{
    "artwork": "http://is4.mzstatic.com/image/thumb/Music/v4/ed/1f/ff/ed1fffa7-5f49-d230-acee-d86ca9d817e0/source/100x100bb.jpg",
    "description": "She's Nik: a marathon runner who's finished her seventh 26.2-miler. He's Dan: a runner who started with the C25K program and has finished his fourth half-marathon. Every week, they record themselves on a short run somewhere in New England (mostly), talk about their training, play some music, and have a few laughs.",
    "feedURL": "http://feeds.feedburner.com/4FR",
    "podcastURL": "http://4frpod.blogspot.com/",
    "publisher": "4feetrunning@gmail.com (Nik and Dan)",
    "title": "4 Feet Running",
    "episodes": [
        {
            "title": "4 Feet Running - Boston Mini-Vacation",
            "datePublished": "Thu, 05 May 2011 07:36:02 PDT",
            "description": "Spend the weekend in Boston with 4 Feet Running! Known in the metro Boston area as Faw Feet Runnin. In this very special episode:<br /><br />- Nik and Dan drive to Boston and get a wicked good paaakin space<br /><br />- They get ready to run the Poco Loco, a 13-mile group run of Boston and Cambridge along the Chaaales Rivah, with Steve Runner, Zen Runner, Eddie Marathon, Chris Russell, Tim D., Tim C., Jay and Deb Kumar, Kelly, Jim, Ninjarunner, Kevin Z., Alett, and special guest appearance by John Ellis<br /><br />- You will barely hear from any of those people because of technical difficulties<br /><br />- Find out what Nik &amp; Dan have been doing since December, and where they're going in 2011<br /><br />- Talking skepticism with Steve and jazz with Zen Runner<br /><br />- A walk through the park in the Fenway, and then a walk through Fenway Park<br /><br />- Put on your mittens and long underwear, Satan: Nik attends her very first Red Sox game<br /><br />- Dan gets super-excited while praying in The Cathedral of Baseball<br /><br />- More of that appalling 4 Feet Running sound quality you crave<br /><br />- Email: 4feetrunning@gmail.com / Blog: 4feetrunning.blogspot.com<br /><br />Thanks for listening! Enjoy!<br /><br />[5.5.11]<img src=\"http://feeds.feedburner.com/~r/4FR/~4/_MoMV8RcwGE\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "0",
            "sourceUrl": "http://www.archive.org/download/4FeetRunning-BostonMini-vacation/4FeetRunningPocoLoco.mp3"
        },
        {
            "title": "4 Feet Running - 6 Feet Running in the Poi",
            "datePublished": "Wed, 09 Feb 2011 15:42:38 PST",
            "description": "It's another 4 Feet Running video special! Nik &amp; Dan go for a run with John From The Poi from Run New England and behold the beauty that is Mattapoisett, Massachusetts, in winter. Check out John's video podcast at RunNewEngland.blogspot.com.<br /><br />Enjoy!<br /><br />(2.9.11)<img src=\"http://feeds.feedburner.com/~r/4FR/~4/6DYdgc6uoF8\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "0",
            "sourceUrl": "http://www.archive.org/download/4FeetRunning-6FeetRunningInThePoi/4FeetRunning-6FeetRunningInThePoi.m4v"
        },
        {
            "title": "4 Feet Running - Mojo Loco and 2010 review Part 2",
            "datePublished": "Tue, 11 Jan 2011 07:39:36 PST",
            "description": "This is part 2 of a very special episode of 4 Feet Running with Nik and Dan! Use this one for a long run, folks, because it's gonna take a while. In this episode:<br /><br />- Nik and Dan drive from St. Augustine, Florida, to infinity and beyond<br /><br />- Infinity and beyond is located at Kennedy Space Center, apparently<br /><br />- They reflect on the great time they had at the Mojo Loco 50-mile-ish relay in December<br /><br />- Dan gets fed up with back-of-the-pack gripes and tries to run faster<br /><br />- Nik overcomes her various dietary quirks at the Philadelphia Marathon<br /><br />- A vague at their plans and goals for 2011, mostly vague because they're only sort of sure what they are at the moment<br /><br />- Nik gets indoctrinated into The Cult of Crossfit<br /><br />- Speaking of cults, they see an Amish person (don't worry, Amish people won't see this because it's on a computer)<br /><br />- Apologies for the sound quality -- moving cars are noisy to record in<br /><br />Thanks for listening, and enjoy!<img src=\"http://feeds.feedburner.com/~r/4FR/~4/rSi8GVxj4Is\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "0",
            "sourceUrl": "http://ia700400.us.archive.org/15/items/4FeetRunning-MojoLoco2/4FeetRunning2010Review2.mp3"
        },
        {
            "title": "4 Feet Running - Screw Your Shoes",
            "datePublished": "Sun, 26 Dec 2010 13:56:25 PST",
            "description": "It's another 4 Feet Running video special! In this instructional tutorial, Nik and Dan make screw-shoes: they drill screws into the bottoms of their running shoes to make cleats for winter running. This is where they got the idea: http://www.skyrunner.com/screwshoe.htm<br /><br />Enjoy!<br /><br />(12.26.10)<img src=\"http://feeds.feedburner.com/~r/4FR/~4/qtlQH5DcVog\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "0",
            "sourceUrl": "http://www.archive.org/download/4FeetRunning-ScrewYourShoes/4FeetRunning-ScrewYourShoes.m4v"
        },
        {
            "title": "4 Feet Running - Mojo Loco and 2010 Review Part 1",
            "datePublished": "Tue, 21 Dec 2010 06:14:48 PST",
            "description": "It's a very special episode of 4 Feet Running with Nik and Dan! Remember them? This episode:<br /><br />- Nik and Dan are in St. Augustine, Florida, to run the first ever Mojo Loco 50-mile relay run to Daytona with 11 other friends from the online running community<br /><br />- Special guest appearances by&nbsp;Adam Tinkoff, Maddy Hubbard, Steve Runner, Steve Chopper, Ed Marathon, Stormin' Norman, Marathon Chris, Susan Stout, Samantha UF, Chris Russell, and the Crazy Runner<br /><br />- Nik and Dan ain't afraid of no ghosts<br /><br />- You asked for it, you got it! More of that classic \"4 Feet Running ear-splitting traffic noise roar\" you love so well<br /><br />- They talk about a few great developments in their running since their last episode<br /><br />- Go on a Gallowalk with the Zen Runner, Maddy, and Dan<br /><br />- What else do 13 runners talk about when they get together? Shoes, shoes, and more shoes<br /><br />- Everyone nearly freezes to death ... in Florida<br /><br />- Nik survives almost a whole day entirely on Boost liquid<br /><br />- A little bit of a short leg at the end due to a calculation error, but after 12 hours of running nobody's complaining<br /><br />- Stay tuned for Part 2, coming very soon, where Nik and Dan go over their 2010 year in review!<br /><br />Enjoy!<br /><br />4feetrunning@gmail.com | 4feetrunning.blogspot.com<br /><br />(12.21.10)<img src=\"http://feeds.feedburner.com/~r/4FR/~4/VUIsAQUQyfg\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "0",
            "sourceUrl": "http://www.archive.org/download/4FeetRunning-MojoLoco/4FeetRunningMojoLoco.mp3"
        },
        {
            "title": "4 Feet Running - Tie Your Shoes",
            "datePublished": "Sat, 28 Aug 2010 11:58:37 PDT",
            "description": "Another 4 Feet Running video special! Nik and Dan wear their Awesome Magic Champion Shoes and teach you how to tie your laces like an awesome magic champion. Special guest appearances by Stanley, Myrna, and the contents of Myrna's colon. Check out more videos and the whole series of audio podcasts at http://4feetrunning.blogspot.com. Enjoy!<img src=\"http://feeds.feedburner.com/~r/4FR/~4/u2f41DGEzdo\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "0",
            "sourceUrl": "http://www.archive.org/download/4FeetRunning-TieYourShoes/4FeetRunning-TieYourShoes.m4v"
        },
        {
            "title": "4 Feet Running - Homemade gel",
            "datePublished": "Sat, 19 Jun 2010 16:25:16 PDT",
            "description": "It's a 4 Feet Running video special! Nik and Dan have been whipping up homemade running-related goodies in their kitchen, and they're going to show you how they make homebrew energy gel. There are more recipes for electrolyte drinks on their blog at http://4feetrunning.blogspot.com. Enjoy!<img src=\"http://feeds.feedburner.com/~r/4FR/~4/ras3ibWgnHg\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "0",
            "sourceUrl": "http://www.archive.org/download/4FeetRunning-HomemadeGel/4FeetRunningGel.mov"
        },
        {
            "title": "4 Feet Running - New Jersey Half and a self-supported marathon",
            "datePublished": "Sat, 15 May 2010 15:43:43 PDT",
            "description": "It's another 4 Feet Running video special! This time around, Dan runs the New Jersey Half Marathon and Nik (who had to bow out of the New Jersey Marathon) goes for a 26.2-miler all by herself.<br /><br />Enjoy!<img src=\"http://feeds.feedburner.com/~r/4FR/~4/Z84SMxzVy6M\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "0",
            "sourceUrl": "http://www.archive.org/download/4FeetRunning-NewJerseyHalf/4FeetRunningNjHalf.m4v"
        },
        {
            "title": "4 Feet Running - New Bedford Half Marathon",
            "datePublished": "Mon, 22 Mar 2010 02:37:08 PDT",
            "description": "It's a special video podcast from 4 Feet Running! Watch as Nik and Dan, plus some special guests, run the New Bedford Half Marathon.<div><br /></div><div>Enjoy!</div><img src=\"http://feeds.feedburner.com/~r/4FR/~4/GmzjdIMLu28\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "0",
            "sourceUrl": "http://www.archive.org/download/4FeetRunning-NewBedfordHalfMarathon/4FeetRunningNbHalf.m4v"
        },
        {
            "title": "4 Feet Running - Ep. 73",
            "datePublished": "Sat, 27 Feb 2010 15:16:45 PST",
            "description": "It's the end of 4 Feet Running as we know it, and they feel fine! In this final episode:<br /><br />- Nik and Dan read strictly feedback from you, the listeners<br /><br />- No other news, to be honest -- just your e-mails and voice messages<br /><br />- A huge thanks to everyone who wrote us, called in, left a review, listened to the show, interacted with us in any way, from us, Nik and Dan, and Stanley and Myrna<div><br /></div><div>(2.10.10)</div><img src=\"http://feeds.feedburner.com/~r/4FR/~4/5y1sLPNVs7M\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "0",
            "sourceUrl": "http://www.archive.org/download/4FeetRunning-Ep.73/4FeetRunning-Ep.73.mp3"
        },
        {
            "title": "4 Feet Running - Ep. 72",
            "datePublished": "Sat, 27 Feb 2010 15:16:34 PST",
            "description": "It's the final 4 Feet Running! Which actually turns out to be the second-to-last 4 Feet Running. Again. It makes sense when you listen. This episode:<br /><br />- Nik and Dan talk about why they're ending the show and their plans for the future<br /><br />- They discuss what they thought would happen when they first started the show years ago<br /><br />- Nik: \"Now you have more time to run. So that means less griping?\" Dan: \"Not likely\"<br /><br />- They talk about the power of accountability to others, and how that helps<br /><br />- Special guest appearance by their crazy neighbor who wants QUIET<br /><br />- Nik has a comeback from her horrible bout of bronchitis and rib pain<br /><br />- Dan's running plans in 2010 have changed again -- goodbye Hyannis, hello New Jersey<br /><br />- Good running tip: register early for races now, because it's mental out there<br /><br />- Science-based self-help with Richard Wiseman, author of \"59 Seconds\"<br /><br />- Nik teaches you how to determine your child's personality using 3 marshmallows, and Dan describes how to lose weight using smaller plates<br /><br />- Dan likes the new Nike Frees that Nik bought him as a special Martin Luther King Day present<br /><br />- Nik and Dan review their 2009 year in running: more miles, more speed, more improvements<br /><br />- Nik: \"You wouldn't want to be at the top -- where would you go?\" Dan: \"I'd stick around there for a while\"<br /><br />- They read the results of the 2009 Feet Running Challenge<br /><br />- Stay tuned for one more episode with just your feedback!<div><br /></div><div>(1.30.10)</div><img src=\"http://feeds.feedburner.com/~r/4FR/~4/ZvthlRYB16E\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "0",
            "sourceUrl": "http://www.archive.org/download/4FeetRunning-Ep.72/4FeetRunning-Ep.72.mp3"
        },
        {
            "title": "4 Feet Running - Ep. 71",
            "datePublished": "Sat, 27 Feb 2010 15:16:20 PST",
            "description": "It's a sick, sick, sick, sick world with 4 Feet Running! Where the hell have Nik and Dan been? And where are they going?<br /><br />- Nik is waylaid by another long and arduous illness -- this time bronchitis<br /><br />- Dan is waylaid by a small and squishy exercise ball<br /><br />- A nurse laughs at Dan's pain<br /><br />- After being floored by various ailments, they get knocked over by 2 feet of snow and then the holidays<br /><br />- But they use the opportunity to try out their new screw-shoes (some assembly required)<br /><br />- They adjust, and then re-adjust, and then re-re-adjust their training plans<br /><br />- Dan's mom gets new kicks<br /><br />- Nik reviews a nice running shirt from Thriv, but will not be seen in it in public for reasons of modesty<br /><br />- They read more emails from wonderful listeners<br /><span><span><br />- Hey! Adam Tinkoff has a new show! Go check it out!</span></span><a href=\"http://www.burning2010.com/\"></a><br /><br />- This is the second-to-last episode we will be producing. We have a brief note about the upcoming final episode of 4 Feet Running<div><br /></div><div>(1.6.10)</div><img src=\"http://feeds.feedburner.com/~r/4FR/~4/C0qR3FJqyOA\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "0",
            "sourceUrl": "http://www.archive.org/download/4FeetRunning-Ep.71/4FeetRunning-Ep.71.mp3"
        },
        {
            "title": "4 Feet Running - Ep. 70",
            "datePublished": "Sat, 27 Feb 2010 15:16:08 PST",
            "description": "It's Rocky II: Rock Harder as 4 Feet Running takes on the 2009 Philadelphia Marathon and Half-Marathon! This episode:<br /><br />- Nik is raring to run the full marathon (her sixth) and Dan shrugs toward the half-marathon (his second)<br /><br />- They stop by the expo for some race swag first<br /><br />- Due to technical difficulties, there's no live race-day audio, but that doesn't mean there's no drama...<br /><br />- Dan almost burns down their hotel room and/or almost floods it, all because of green beans<br /><br />- Nik almost misses the marathon entirely, possibly because of cheese<br /><br />- Then they can't find their corrals, the race announcer forgets about some runners, Nik and Dan skip the porta-potties, a pacer gets floored, and Dan accidentally goes 100% caffeine cold-turkey (which is BAD)<br /><br />- Nik is plagued by hunger and thirst in the wilds of Fairmount Park<br /><br />- Her rationale for eating and drinking all kinds of stuff she shouldn't: \"How much more sick could I possibly get?\"<br /><br />- Dan sees nudity<br /><br />- He runs with his eyes shut in the hopes of taking a brief nap on the road<br /><br />- Nik continues her PR domination, and Dan just misses it because of a pit-stop<br /><br />- Uncle Pfitzy is definitely her favorite -- Uncle Higgy's kicked out of the family<br /><br />- Lousy advice on where to run in Massachusetts and where to eat in Philadelphia<br /><br />- They make big race plans for next year and read some email from wonderful listeners<div><br /></div><div>(12.1.09)</div><img src=\"http://feeds.feedburner.com/~r/4FR/~4/fUAG1rqKOSo\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "0",
            "sourceUrl": "http://www.archive.org/download/4FeetRunning-Ep.70/4FeetRunning-Ep.70.mp3"
        },
        {
            "title": "4 Feet Running - Ep. 69",
            "datePublished": "Sat, 27 Feb 2010 15:15:56 PST",
            "description": "Get two spooky races for the price of one with 4 Feet Running! In this giant-sized week:<br /><br />- Nik and Dan run the Witch City 5K in Salem -- Nik in devil horns and Dan in his lucha libre mask<br /><br />- Nik's out for fun, Dan's just hoping not to suffocate in the damn thing<br /><br />- Gear up with some Brooks and Nike shoe chat, free tech-shirt talk, Halo headband convo<br /><br />- The wrestling mask is surprisingly comfy and warm when it's cold in New England<br /><br />- Nik has a great week! Oh wait, did I say great? I meant \"not great\"<br /><br />- In case you were wondering which company makes the best ketchup chips, it's Herr's<br /><br />- Obligatory parasite mention this week: whipworms!<br /><br />- Some jerky douchebag asshat cuts Nik off on purpose -- some bozo in a yellow shirt<br /><br />- Some 5-piece living room set books it past Dan going up a hill<br /><br />- Nik and Dan also run the New Bedford Spooky Run 10K and 5K, respectively, with John from the Poi, Dan's mom, and a bunch of Nik and Dan's friends<br /><br />- They wish for a Saturday morning cartoon where bad guys turn into monkeys. Someone get on this<br /><br />- Nik and Dan get psyched up for the Philly races in a couple of weeks<br /><br />- Too many cool costumes at the races to mention<br /><br />- Too many PRs to mention -- Nik and Dan get THREE of them between them alone, plus more for John and Dan's mom<br /><br />- Too much great email to mention from wonderful people<div><br /></div><div>(11.11.09)</div><img src=\"http://feeds.feedburner.com/~r/4FR/~4/QzF3uP27t8M\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "0",
            "sourceUrl": "http://www.archive.org/download/4FeetRunning-Ep.69/4FeetRunning-Ep.69.mp3"
        },
        {
            "title": "4 Feet Running - Ep. 68",
            "datePublished": "Sat, 27 Feb 2010 15:15:45 PST",
            "description": "Think global, run in Connecticut this week with 4 Feet Running! This episode:<br /><br />- Nik and Dan do the World Wide Festival of Races at the ING Hartford half-marathon and 5K (respectively)<br /><br />- Hartford is full of cranky people who like to cut in line<br /><br />- Nik and Dan need to practice their geography to figure out where the races begin -- South? West? Huh?<br /><br />- Dan helps a guy put on his timing chip<br /><br />- Nik appears to have pooped her running skirt (but didn't)<br /><br />- It's not the prettiest race course, but they both have great race times<br /><br />- Except Dan has a problem with races that cheap out on the 5K timing mats<br /><br />- Nik finds that the first mile of the half-marathon is a contact sport<br /><br />- Assorted mayhem on the course: bloody nipples, baby stroller roller-derby, broken legs, impromptu football games<br /><br />- Dan goes on a running gear shopping spree<br /><br />- Nik feels weird staring at random people's feet<br /><br />- They read some great email from wonderful listeners<div><br /></div><div>(10.24.09)</div><img src=\"http://feeds.feedburner.com/~r/4FR/~4/OIkXs177-I8\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "0",
            "sourceUrl": "http://www.archive.org/download/4FeetRunning-Ep.68/4FeetRunning-Ep.68.mp3"
        },
        {
            "title": "4 Feet Running - Ep. 67",
            "datePublished": "Sat, 27 Feb 2010 15:15:32 PST",
            "description": "Welcome to Lifestyles of the Rich and Infamous with 4 Feet Running! This week is chock full of assorted topics:<br /><div><br /></div><div>- Nik and Dan go running in Newport, RI, where there are stray Bernese mountain dogs, wine corks littering the streets, and the resident wealthy eccentrics have personal croissant chefs</div><div><br /></div><div>- They also have chicken breast on sale</div><div><br /></div><div>- Nik gets faster in her Frees and breaks a weekly distance record</div><div><br /></div><div>- Dan is a little faster too, because speedwork is agreeing with him</div><div><br /></div><div>- He also has a drinking problem (he's addicted to carrying around his fuel belt bottle)</div><div><br /></div><div>- They're both doing the Worldwide Festival of Races in Hartford next time</div><div><br /></div><div>- A little about the psychology of goal-achievement with professor Richard Wiseman, and why Dan is always a nervous wreck</div><div><br /></div><div>- Nik and Dan meet Stanley the German shorthaired pointer's doppelganger</div><div><br /></div><div>- They discuss Nik's nutritional issues and various fun ironies involving the Paleo diet</div><div><br /></div><div>- Anyone want some Del's frozen lemonade?</div><div><br /></div><div>- Two more giveaways in the 4 Feet Running book club -- <span style=\"font-style: italic; \">listen to find out how to win!</span></div><div><br /></div><div>- Advice on how to arrive last in a road race</div><div><br /></div><div>- They get some great feedback from wonderful listeners</div><div><br /></div><div>(10.6.09)</div><img src=\"http://feeds.feedburner.com/~r/4FR/~4/MUdAYibtQrU\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "0",
            "sourceUrl": "http://www.archive.org/download/4FeetRunning-Ep.67/4FeetRunning-Ep.67.mp3"
        },
        {
            "title": "4 Feet Running - Ep. 66",
            "datePublished": "Sat, 27 Feb 2010 15:15:20 PST",
            "description": "It's a do-over, reboot, renewed 4 Feet Running! After a little delay, they're ready to run again. This week:<div><br /></div><div>- Nik and Dan explain where the hell the show has been for a month</div><div><br /></div><div>- They're in an '80s mood for some reason</div><div><br /></div><div>- Dan falls into a brief but crippling funk due to the heat, but finds redoing his schedule has improved his mojo</div><div><br /></div><div>- Nik gets permission from famous listener Petra to revamp her schedule, too</div><div><br /></div><div>- More grossness: bedbug nests, street trash, plus learn about the fascinating and repulsive life cycle of the hookworm</div><div><br /></div><div>- Nik's knee issues are much improved thanks to forefoot running, and Dan gives her an elbow in the buttcheek</div><div><br /></div><div>- They talk about the barefoot running craze and why they're skeptical of some of the more out-there magical claims</div><div><br /></div><div>- Nik orders and tries out a pair of Nike Frees to help make her more speedy, though they make her toes feel like they've been working out</div><div><br /></div><div>- Dan doesn't like the Frees because contrary to the name, they cost money</div><div><br /></div><div>- They read lots of great feedback from listeners</div><div><br /></div><div>- Special phone call from Hollywood Actor and runner Edward Norton, probably</div><div><br /></div><div>(9.18.09)</div><img src=\"http://feeds.feedburner.com/~r/4FR/~4/22KK2y-I2-I\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "0",
            "sourceUrl": "http://www.archive.org/download/4FeetRunning-Ep.66/4FeetRunning-Ep.66.mp3"
        },
        {
            "title": "4 Feet Running - Ep. 65",
            "datePublished": "Sat, 27 Feb 2010 15:14:48 PST",
            "description": "In the woods, no one can hear 4 Feet Running scream! Not even when they're slowly being bitten to death. This week:<br /><br />- Even though last time Nik and Dan said they hate the woods, they try it anyway at Massasoit State Park in Taunton, Mass.<br /><br />- They immediately regret not having brought bug spray<br /><br />- Quote of the week #1: \"So far no murderers. We've been walking for three minutes.\"<br /><br />- Quote of the week #2: \"You see one tree, you've seen em all.\"<br /><br />- Stanley the pointer dog goes for a dip and tries to free himself from his leash<br /><br />- Dan tries speedwork, strength training (again), and is awful at trail running<br /><br />- Nik has trouble with the humidity, keeping her blood sugar regulated, and is a mosquito magnet<br /><br />- Picture the Raiders of the Lost Ark tarantula scene but with mosquitos<br /><br />- Drinking game: take a shot every time Nik or Dan says: \"I HATE THIS!\" or \"I HATE THE WOODS!\" or \"I DON'T LIKE THE WOODS!\"<br /><br />- They eventually find a road and run on that instead -- hooray!<br /><br />- They read email from some great listeners<div><br /></div><div>(8.17.09)</div><img src=\"http://feeds.feedburner.com/~r/4FR/~4/tfmdNKyj97I\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "0",
            "sourceUrl": "http://www.archive.org/download/4FeetRunning-Ep.65/4FeetRunning-Ep.65.mp3"
        },
        {
            "title": "4 Feet Running - Ep. 64",
            "datePublished": "Sat, 27 Feb 2010 15:14:35 PST",
            "description": "Celebrate 2 whole years of 4 Feet Running with Nik and Dan! This week:<br /><br />- They're actually not at a race for a change -- weird, innit?<br /><br />- Warning: There's so much gory news in this episode for some reason, it's like CSI: 4 Feet Running<br /><br />- Updates on Nik's knees and ankles, and why she's not using Uncle Higgy anymore<br /><br />- Dan remembers his running beginnings and first milestones - He also runs into a telephone pole<br /><br />- They get to see actual cows (sorry, they forgot to take the camera), and they'll tell you where in Fall River the buffalo roam and the pigeons race<br /><br />- They look ahead to their next year of running and the races ahead<br /><br />- Lots of great feedback from wonderful listeners, and a Special Guest Appearance by Carnac the Magnificent and his sidekick Gordon<div><br /></div><div>(7.26.09)</div><img src=\"http://feeds.feedburner.com/~r/4FR/~4/TDwsHZmVgPs\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "0",
            "sourceUrl": "http://www.archive.org/download/4FeetRunning-Ep.64/4FeetRunning-Ep.64.mp3"
        },
        {
            "title": "4 Feet Running - Ep. 63",
            "datePublished": "Sat, 27 Feb 2010 15:14:18 PST",
            "description": "It's a family fun-day road race on the 4th of July with 4 Feet Running! This week:<br /><br />- Meet Dan's mom, who is walking her first-ever road race: the Mattapoisett 5-mile Road Race<br /><br />- Dan's mom is kind of shy about talking into the mike<br /><br />- Special guest appearances by John from the Poi and his friend Martin, a former marathoner and current cranberry engineer<br /><br />- Nik tries to overcome a string of lousy runs, Dan's mom gets tips for a first-time road-racer, and Dan keeps his mom company<br /><br />- Two stop-lights, a post office, and a lot of friendly people: that's Mattapoisett<br /><br />- They set up another giveaway in the 4 Feet Running Book Club: Running and Being by Dr. George Sheehan -- listen to find out when!<br /><br />- Nik realizes one meal of pancakes a day is her limit -- not two<br /><br />- Dan decides to don the luchador mask for a special 5K road race in October (and possibly a cape)<br /><br />- Tons of fantastic email from wonderful listeners<div><br /></div><div>(7.11.09)</div><img src=\"http://feeds.feedburner.com/~r/4FR/~4/4kPF30Taom8\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "0",
            "sourceUrl": "http://www.archive.org/download/4FeetRunning-Ep.63/4FeetRunning-Ep.63.mp3"
        },
        {
            "title": "4 Feet Running - Ep. 62",
            "datePublished": "Sat, 27 Feb 2010 15:14:06 PST",
            "description": "You've rocked -- now let's roll with 4 Feet Running! It's the second half of Nik's San Diego Rock 'N' Roll Marathravaganza! This week:<br /><br />- Nik crosses the finish line in beautiful San Diego and gives a full race report on her fifth 26.2-miler, one of her hardest<br /><br />- Like Elvis? Nik doesn't -- at least not anymore<br /><br />- Like runny-nosed kids? Nik doesn't -- at least not anymore<br /><br />- Hear the long and complicated adventure of how they managed to leave the race finish area<br /><br />- Which would you rather have hurt: your stomach from yucky electrolytes or legs from lack of electrolytes?<br /><br />- Polyester and sequin jumpsuits, Adidas sandals with socks and walking poles: common San Diego marathon wear<br /><br />- What did Nik and Dan think of San Diego? \"The weather was not what we were promised\"<br /><br />- Nik bids a fond adieu to Uncle Higgy and says hello to Uncle Pfitzy<br /><br />- Dan loves his mother, but not in a $50-for-a-T-shirt way<br /><br />- Nik and Dan consider whether a billion dollars is worth being mauled by a bear for<br /><br />- Another giveaway in the 4 Feet Running Book Club: \"Ultramarathon Man\" by fellow San Diego marathoner Dean Karnazes<br /><br />- They get some great feedback from wonderful people<br /><br />- Stay tuned to the very end for a special dawggie treat<div><br /></div><div>(6.23.09)</div><img src=\"http://feeds.feedburner.com/~r/4FR/~4/XnGJA26ppdw\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "0",
            "sourceUrl": "http://www.archive.org/download/4FeetRunning-Ep.62/4FeetRunning-Ep.62.mp3"
        },
        {
            "title": "4 Feet Running - Ep. 61",
            "datePublished": "Sat, 27 Feb 2010 15:13:53 PST",
            "description": "San Diego -- drink it in with 4 Feet Running! It always goes down smooth. This Part 1 of a 2-part San Diego extravamarathaganza! This week:<br /><br />- Nik runs her fifth 26.2-miler, the San Diego Rock 'N' Roll Marathon<br /><br />- Nik and Dan take a little pre-race jaunt around downtown San Diego, where they do some jogging -- or maybe it's \"yogging,\" it may be a soft J<br /><br />- Where's all the good weather at? And how'd Dan's beard get so gray?<br /><br />- They stay at a \"haunted\" hotel, and as predicted they never hear or see anything<br /><br />- They run by Petco Park and they don't see or hear anything there, either<br /><br />- Nik and Dan see <span><span>tens of thousands of people on race day in Balboa Park, including famous running bloggers Maddy (Maddy Runs) and Alisa (Ambitious Aspirations)</span></span><br /><br />- Nik never ends up making the switch to Pacific time -- it's quite amazing, actually<br /><br />- But she DOES make the switch to Ininji toe-socks, which feel terrific with sandals<br /><br />- A little corral-side chit-chat with Nik, Alisa and Maddy about tea, toenails, and \"emergency\" iPod playlists<br /><br />- Experience the music of the Rock 'N' Roll Marathon as Nik runs by<br /><br />- And stay tuned for the next episode where we meet Nik out the race chute, get her race report, and more!<div><br /></div><div>(6.14.09)</div><img src=\"http://feeds.feedburner.com/~r/4FR/~4/sKOf-BKfGkE\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "0",
            "sourceUrl": "http://www.archive.org/download/4FeetRunning-Ep.61/4FeetRunning-Ep.61.mp3"
        },
        {
            "title": "4 Feet Running - Video 5",
            "datePublished": "Sat, 27 Feb 2010 15:13:40 PST",
            "description": "We're a little bit on the other side of the country, we're a little bit Rock 'N' Roll: Here's a quick video of Nik's San Diego Rock 'N' Roll Marathon run!<br /><br />Results, race report, anecdotes, observations, chit-chat and a whole slew of fun audio coming soon!<div><br /></div><div>(6.6.09)</div><img src=\"http://feeds.feedburner.com/~r/4FR/~4/agkFGZR_eAs\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "0",
            "sourceUrl": "http://www.archive.org/download/4FeetRunning-Video5/4FeetRunning-Video5.m4v"
        },
        {
            "title": "4 Feet Running - Ep. 60",
            "datePublished": "Sat, 27 Feb 2010 15:13:20 PST",
            "description": "Have a second helping of chicken salad, with Part 2 of 4 Feet Running's Willow Tree chicken salad half-marathon in Providence! This week:<br /><br />- Dan is struggling around the 7.5 mile mark while Nik is adjusting her knee brace and watching her Garmin Forerunner quickly lose battery power<br /><br />- No tunnel shoutouts this time: Dan has the abdominal stitch to beat all abdominal stitches<br /><br />- It's a good, bad, and ugly kind of race but have a great time, despite not getting a space blanket<br /><br />- They get spotted from listener Tim at the finish line (sorry, it was hard to hear everything, Tim)<br /><br />- How Nik and Dan's knees have held up since the race<br /><br />- They read tons of feedback from lots of wonderful people<br /><br />- It's a Voice-Mail-O-Rama!<br /><br />- The mystery of why Dan is not the Chi Running guy<div><br /></div><div>(5.21.09)</div><img src=\"http://feeds.feedburner.com/~r/4FR/~4/Twb1Z3PQSpY\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "0",
            "sourceUrl": "http://www.archive.org/download/4FeetRunning-Ep.60/4FeetRunning-Ep.60.mp3"
        },
        {
            "title": "4 Feet Running - Ep. 59",
            "datePublished": "Sat, 27 Feb 2010 15:13:06 PST",
            "description": "Have a Willow Tree chicken salad sandwich, hold the sandwich, with 4 Feet Running! This is Part 1 of a 2-part half-stravaganza! This week:<br /><br />- Nik and Dan prepare to run the Willow Tree chicken salad Half-Marathon in Providence, Rhode Island<br /><br />- If they can ever find the start line<br /><br />- Little things get in the way, from vomiting dogs to Garmins that won't sleep, from ass-knots to twingey knees<br /><br />- Take a little trip down memory lane as they remember how Dan got himself into this half-marathon mess<br /><br />- Nik decides she'll pace Dan for the half so she can see him run double-digits in person (and her knee hurts)<br /><br />- More tunnel shout-outs than you can shake an underpass at<br /><br />- Why you shouldn't wear bad shoes even for sitting in a cubicle<br /><br />- Testicle shout-out! Woo hoo testicles!<br /><br />- They meet Ron Burgundy's doppelganger standing in the middle of nowhere<br /><br />- Even though she's broken here and there, Nik is running pretty well, and Dan's having the best run of his life...until, dot-dot-dot...<br /><br />- Will Dan make it through the rest of the race intact? Will Nik's Garmin keep a charge until the end? And why is someone convinced that Dan is the Chi-Running guru Danny Dreyer? Tune in next time!<div><br /></div><div>(5.13.09)</div><img src=\"http://feeds.feedburner.com/~r/4FR/~4/faDkGDKZsPY\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "0",
            "sourceUrl": "http://www.archive.org/download/4FeetRunning-Ep.59/4FeetRunning-Ep.59.mp3"
        },
        {
            "title": "4 Feet Running - Ep. 58",
            "datePublished": "Sat, 27 Feb 2010 15:12:53 PST",
            "description": "Limping a little? Take a walk break with 4 Feet Running. This week:<br /><br />- Nik, Dan, and the dogs go for a stroll along the East Bay Bike Path in Warren, R.I.<br /><br />- Apologies for the Rice Krispies crunchiness early in the episode -- microphone trouble<br /><br />- Nik takes it easy on her knee, which is still smarting from her tussle with a runaway post office<br /><br />- She has better luck with the bike trainer and yoga, but bad luck in terms of wardrobe choice<br /><br />- Dan goes for his longest run ever, a 12-miler the week before his half-marathon race<br /><br />- The difference between horrible crime and whimsical crime<br /><br />- There's also some consternation about Dan's wardrobe choice<br /><br />- Another 4 Feet Running Book Club giveaway is announced! Who wants a book full of running tips and dirty pictures? Stay tuned for 5/5 at 5 p.m.<br /><br />- They read e-mail from some great people, mention a great charity, and do two tunnel shoutouts -- in a REAL tunnel, Gordon<div><br /></div><div>(4.27.09)</div><img src=\"http://feeds.feedburner.com/~r/4FR/~4/D-SZ2c_9Op4\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "0",
            "sourceUrl": "http://www.archive.org/download/4FeetRunning-Ep.58/4FeetRunning-Ep.58.mp3"
        },
        {
            "title": "4 Feet Running - Ep. 57",
            "datePublished": "Sat, 27 Feb 2010 15:12:41 PST",
            "description": "It's a super-sized 10K by the sea with 4 Feet Running! This week:<br /><br />- Nik and Dan run the Cohasset 10K Road Race by the Sea<br /><br />- Where's the race? I dunno ... over there somewhere ... I dunno ...<br /><br />- They hear the race is supposed to be nice and flat<br /><br />- It's nice, but only a Himalayan sherpa would think it's flat<br /><br />- They find where Cohasset, a tony coastal suburb, keeps its antique cuspidor shop and it's all-natural health food store<br /><br />- Does Nik get her 3rd PR in a row? Will Dan conquer Cohasset? Listen to find out<br /><br />- They talk about the new 4 Feet Running book club<br /><br />- They get tons of feedback from lots of wonderful people, including one of the grossest emails ever received<br /><br />- They plug GoWagon.com and the<span><span>ir new monthly challenge for April, Rock Paper Scissors, andthe Trilogy Running challenge</span></span><a href=\"http://www.buckeyeoutdoors.com/cgi-bin/training/versus?challenge=114\"></a><br /><br />- And tons of other stuff<div><br /></div><div>(4.15.09)</div><img src=\"http://feeds.feedburner.com/~r/4FR/~4/2LirY8gW4Ww\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "0",
            "sourceUrl": "http://www.archive.org/download/4FeetRunning-Ep.57/4FeetRunning-Ep.57.mp3"
        },
        {
            "title": "4 Feet Running - Ep. 56",
            "datePublished": "Sat, 27 Feb 2010 15:12:25 PST",
            "description": "Third time's the charm with 4 Feet Running! This week:<br /><br />- Nik runs the New Bedford Half Marathon for the third time after almost bursting an eyeball the first time and bonking the second time<br /><br />- It doesn't smell like fish and garbage in lovely New Bedford this year<br /><br />- Nik's been training like a machine, and so has Dan -- as long as he follows his weird assortment of mojo habits<br /><br />- Dan's the man-purse and Nik goes bottle-less<br /><br />- Weirdos spotted in New Bedford: some guy in teeny-weeny shorts, another guy pointing a leaf blower at concrete under a bank drive-thru, a third guy leering at a baby and somebody's wallet<br /><br />- Nik has a fantastic race, much to everyone's pleasure: <a href=\"http://connect.garmin.com/activity/2549339\">See the map, elevation, and more on Garmin Connect!</a><br /><br />- They take a quick jaunt around the historical area of New Bedford<br /><br />- Should runners get a job? Judge for yourself<br /><br />- Details coming soon about the 4 Feet Running book club!<br /><br />- They read fantastic feedback from lots of great listeners<div><br /></div><div>(3.23.09)</div><img src=\"http://feeds.feedburner.com/~r/4FR/~4/KGim7GgiDbY\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "0",
            "sourceUrl": "http://www.archive.org/download/4FeetRunning-Ep.56/4FeetRunning-56.mp3"
        },
        {
            "title": "4 Feet Running - Ep. 55",
            "datePublished": "Sat, 27 Feb 2010 15:11:58 PST",
            "description": "Coming right up: small Philly run with Cheez Whiz, no mushrooms, no onions, and an extra-large order of 4 Feet Running! This week:<br /><br />- Nik and Dan take a quick weekend trip to Philadelphia to see their family<br /><br />- Apologies for taking so long between episodes, but there were on bedbug patrol<br /><br />- Also trying to determine what all of Nik's Gramma's bizarre kitchen implements do<br /><br />- If you're ever in the City of Brotherly Love, watch out for a Chili's waitress and a hotel valet who shake down Massachusetts tourists for extra big tips<br /><br />- They take a run up the Rocky stairs (well, Dan tries to, anyway)<br /><br />- Both Nik and Dan are doing fantastic with their running -- yes, they actually do talk about running<br /><br />- Monkey-poop coffee is good to the last plop<br /><br />- Pat's? Geno's? Pfft. Nik and Dan think best steak sandwich is the Portuguese steak sandwich<br /><br />- They read a mountain of email, with Special Guest Sta<span><span>r Gordon</span></span><a href=\"http://www.runtodisney.com/\"></a><div><br /></div><div>(3.10.09)</div><img src=\"http://feeds.feedburner.com/~r/4FR/~4/2j8joG2cS_E\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "0",
            "sourceUrl": "http://www.archive.org/download/4FeetRunning-Ep.55/4FeetRunning-Ep.55.mp3"
        },
        {
            "title": "4 Feet Running - Video 4",
            "datePublished": "Sat, 27 Feb 2010 15:11:46 PST",
            "description": "Have a lovely time with 4 Feet Running's 4th video podcast! This special video was made with an extra little pinch of love for <a href=\"http://www.runcast.tv/events/in-love-with-running\">Runcast.tv's February \"In Love With Running\" event!</a> This week:<br /><br />- Nik and Dan venture to the City of Brotherly Love, Philadelphia, to talk about their relationships with running<br /><br />- It's a complicated relationship for Nik<br /><br />- It's also complicated for Dan, and sometimes it hurts<div><br /></div><div>(3.2.09)</div><img src=\"http://feeds.feedburner.com/~r/4FR/~4/qXqfQ0tLURA\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "0",
            "sourceUrl": "http://www.archive.org/download/4FeetRunning-Video4/4FeetRunningVideo4.m4v"
        },
        {
            "title": "4 Feet Running - Ep. 54",
            "datePublished": "Sat, 27 Feb 2010 15:11:36 PST",
            "description": "It's a bird, it's a plane, it's 4 Feet Running's Super 5K race! This week:<br /><br />- Nik and Dan head to beautiful Narragansett, R.I., for the Super 5K<br /><br />- They prove to be invincible to cold weather, but Nik's kryptonite: rocks in her shoes<br /><br />- Hammer Nutrition? You CAN touch this<br /><br />- Dan takes his new Garmin 205 for a spin and loves how it helps his new Uncle Higgy schedule<br /><br />- \"You don't see this many people in tights unless it's a race\"<br /><br />- \"The people I run with in races tend to be sort of elderly and a little bit broken-looking\"<br /><br />- It's a battle of the dueling Garmin tracking websi<span><span>tes, with MotionBased vs. Garmin Connect(check out both logs to compare &amp; contrast)</span></span><br /><br />- They read tons of great e-mail from wonderful people<div><br /></div><div>(2.13.09)</div><img src=\"http://feeds.feedburner.com/~r/4FR/~4/zBdwVQuS1us\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "0",
            "sourceUrl": "http://www.archive.org/download/4FeetRunning-Ep.54/4FeetRunning-Ep.54.mp3"
        },
        {
            "title": "4 Feet Running - Ep. 53",
            "datePublished": "Sat, 27 Feb 2010 15:11:25 PST",
            "description": "Make way for 4 Feet Running! This action-packed week:<br /><br />- Nik, Dan, and the dogs run 3 miles in Boston's Public Garden and Common<br /><br />- Nik starts her San Diego Marathon training plan and is liking it, except for a tiny little pain in her shin that comes &amp; goes<br /><br />- Constant snow and ice keeps frustrating them, and work gets in the way of Dan's running (really, trust me)<br /><br />- They may have witnessed a horrible crime in the middle of the Public Garden<br /><br />- The difference between cable exercises and kegel exercises<br /><br />- Rest In Peace: Dan's NikePlus Sportband. In a related development, Dan gets an early birthday present<br /><br />- Who would win in a fight: a monkey or a unicorn?<br /><br />- Want to support the move to get Dan's chubby bum out on the road? <a href=\"http://www.cafepress.com/trilogyrunning\">Buy your \"DAN GO RUN\" gear here at Cafe Press</a><br /><br />- They read tons of great email from wonderful people<div><br /></div><div>(2.2.09)</div><img src=\"http://feeds.feedburner.com/~r/4FR/~4/zTKYQrlJOPI\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "0",
            "sourceUrl": "http://www.archive.org/download/4FeetRunning-Ep.53/4FeetRunning-Ep.53.mp3"
        },
        {
            "title": "4 Feet Running - Ep. 52",
            "datePublished": "Sat, 27 Feb 2010 15:10:55 PST",
            "description": "Get ready to freeze your behind off with 4 Feet Running! This week:<br /><br />- Nik and Dan go for a staggeringly cold 3-miler in Providence (the ritzy part, not the crappy part)<br /><br />- They discuss Yak Traks, which is appropriate because there's thick ice and snow everywhere<br /><br />- Dan's got two great new coaches, but his trick knee is acting up again<br /><br />- Nik does the Core Performance technique but still can't remember the guy's last name<br /><br />- They wonder why there are multiple words for \"stretching\" in the fitness world<br /><br />- Special Guest Star: Lewis from Starbucks, when Nik and Dan warm up with a nice hot mocha<br /><br />- They take the plunge and actually set up Buckeye Outdoors accounts ... for their dogs<br /><br />- Great feedback-o-rama from lots of listeners<div><br /></div><div>(1.19.09)</div><img src=\"http://feeds.feedburner.com/~r/4FR/~4/A6a6FI95njc\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "0",
            "sourceUrl": "http://www.archive.org/download/4FeetRunning-Ep.52/4FeetRunning-Ep.52.mp3"
        },
        {
            "title": "4 Feet Running - Ep. 51",
            "datePublished": "Sat, 27 Feb 2010 15:10:41 PST",
            "description": "Ring in 2009 with a double-dip audio-video special of 4 Feet Running for the New Year! This week:<br /><br />- Nik and Dan are sick with coughs and colds, but are headed out for a run to start the new year right<br /><br />- They consider giving their dogs Stanley and Myrna their own Buckeye Outdoors accounts<br /><br />- Santa got them some really cool presents, both running and non-running related<br /><br />- Nik has the most annoying alarm clock ever invented<br /><br />- They refuse to be optimistic about 2009<br /><br />- But they're still making lots of running plans for the next year, from marathons to running plans to Core Performance routines to hopping-and-skipping exercises<br /><br />- Nik and Dan take a brief look back at their running year that was 2008, and a look ahead at their new challenges for '09<br /><br />- They get feedback from some fantastic listeners<div><br /></div><div>(1.2.09)</div><img src=\"http://feeds.feedburner.com/~r/4FR/~4/Iln3UtYe62E\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "0",
            "sourceUrl": "http://www.archive.org/download/4FeetRunning-Ep.51/4FeetRunning-Ep.51.mp3"
        },
        {
            "title": "4 Feet Running - Video 3",
            "datePublished": "Sat, 27 Feb 2010 15:10:10 PST",
            "description": "4 Feet Running - Video 3<div><br /></div><div>(1.2.09)</div><img src=\"http://feeds.feedburner.com/~r/4FR/~4/pt0msILjLKg\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "0",
            "sourceUrl": "http://www.archive.org/download/4FeetRunning-Video3/4fr-Video3.m4v"
        },
        {
            "title": "4 Feet Running - Ep. 50",
            "datePublished": "Sat, 27 Feb 2010 15:09:23 PST",
            "description": "Here we are as in olden days, happy golden days with 4 Feet Running! This week:<br /><br />- Nik and Dan do the audio part of their Santa Dash 5K in snowy Fall River, if the fates allow<br /><br />- Dan uses various excuses as to why he doesn't run more -- but till then he'll have to muddle through somehow<br /><br />- Nik's streak of bad luck continues briefly, and is determined not to have a cup of cheer<br /><br />- Dan can't seem to nestle all snug in his bed when it's nestling time, and visions of sugarplums keep him awake<br /><br />- They talk about Christmas lights and decking the halls with boughs of holly, fa la la la la, &amp;c.<br /><br />- Nik wants to deck her bike with a new tire and winter trainer, fa la la la la, &amp;c.<br /><br />- Figgy pudding is not mentioned anywhere in the show, but I thought I'd mention it here anyway<br /><br />- They read a whole Santa sleighful of feedback and get several voice messages from nice people<br /><br />- The annoying hiss you hear during the feedback portion of the show is the sound of the living room radiators at full blast -- sorry for the noise<div><br /></div><div>(12.17.08)</div><img src=\"http://feeds.feedburner.com/~r/4FR/~4/uYhIkNuwGZQ\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "0",
            "sourceUrl": "http://www.archive.org/download/4FeetRunning-Ep.50/4FeetRunning-Ep.50.mp3"
        },
        {
            "title": "4 Feet Running - Video 2",
            "datePublished": "Sat, 27 Feb 2010 15:09:08 PST",
            "description": "Celebrate the first snow of the season with a 4 Feet Running Santa run on video! This week:<br /><br />- Nik and Dan don they now their gay apparel and go for a 5K in the snow<br /><br />- They talk a little about Christmas decorations (but they barely see any)<br /><br />- There's more Garmin vs. Nike Plus discrepancies<br /><br />- Audio podcast next week!<div><br /></div><div>(12.7.08)</div><img src=\"http://feeds.feedburner.com/~r/4FR/~4/hsXo12VeMG8\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "0",
            "sourceUrl": "http://www.archive.org/download/4FeetRunning-Video2/4FeetRunning-Video2.mov"
        },
        {
            "title": "4 Feet Running - Ep. 49",
            "datePublished": "Sat, 27 Feb 2010 15:08:58 PST",
            "description": "Which do you want first, the bad news or the good news? 4 Feet Running has both this week:<br /><br />- Nik and Dan go for a 4.5-miler through their neighborhood<br /><br />- They have the best running geek week ever, with Runner+ back, a newish Garmin, and challenges on Buckeye Outdoors<br /><br />- They have a terrible geek week also, as Nik's MacBook Pro lapses into a coma<br /><br />- Nik and Dan check out treadmills and do really, really long intervals through stores across southern New England<br /><br />- Reading treadmill reviews is very confusing, but they make the best of it<br /><br />- Nik and Dan have some goals in mind they'll work toward with or without a hamster wheel<br /><br />- They get feedback from some very nice people<div><br /></div><div>(11.26.08)</div><img src=\"http://feeds.feedburner.com/~r/4FR/~4/0AdtJhB2CVg\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "0",
            "sourceUrl": "http://www.archive.org/download/4FeetRunning-Ep.49/4FeetRunning-Ep.49.mp3"
        },
        {
            "title": "4 Feet Running - Ep. 48",
            "datePublished": "Sat, 27 Feb 2010 15:08:45 PST",
            "description": "Santa Claus is stuck in a glass cage with 4 Feet Running! This week:<br /><br />- Nik, Dan, and listener John run the Edaville Rail Run 5-miler trail run in Carver, Mass.<br /><br />- Coming along for the ride are John's neighbor Jack, his daughter Amy, and Dan's work friend Jon -- so that's 3 Johns for the price of 1 right there<br /><br />- Edaville Railroad has a whole Christmas display going, complete with creepy Santa dioramas and transgendered elves<br /><br />- Nik's Garmin Forerunner 405 goes bye-bye<br /><br />- They also meet an older lady who's all banged up but who still runs the 5-miler<br /><br />- Dan starves his way across 5 hard miles, Nik's glucose levels plummet, but everyone else doing the race has a phenomenal time<br /><br />- Listeners share their Garmin woes<br /><br />- More Stanley the pointer dog hogging all the attention at the end<br /><br />- They get email and phone calls from very nice people<div><br /></div><div>(11.17.08)</div><img src=\"http://feeds.feedburner.com/~r/4FR/~4/6ROhjetFgfQ\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "0",
            "sourceUrl": "http://www.archive.org/download/4FeetRunning-Ep.48/4FeetRunning-Ep.48.mp3"
        },
        {
            "title": "4 Feet Running - Video 1",
            "datePublished": "Sat, 27 Feb 2010 15:08:32 PST",
            "description": "<div style=\"text-align: left; \">Wow! It's 4 Feet Running's first ever video podcast! Nik and Dan check in very quickly between audio episodes with a little rough home-made video:<br /></div><div style=\"text-align: left; \"><br />- Nik has a little bad news about her Garmin 405<br /><br />- They talk about their race plans for the next audio episode<br /><br />- Special Guest Star: Stanley as Stanley the pointer dog<br /><br />- Go to <a href=\"http://www.runcast.tv/\">www.runcast.tv</a> for more information</div><div style=\"text-align: left; \"><br /></div><div style=\"text-align: left; \">(11.7.08)</div><img src=\"http://feeds.feedburner.com/~r/4FR/~4/LyOeWeS6wEo\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "0",
            "sourceUrl": "http://www.archive.org/download/4FeetRunning-Video1/4FeetRunning-Video1.m4v"
        },
        {
            "title": "4 Feet Running - Ep. 47",
            "datePublished": "Sat, 27 Feb 2010 15:08:16 PST",
            "description": "Think global, run local with 4 Feet Running! This episode:<br /><br />- Nik and Dan go for the Zen Run 10K in Lakeville, Mass.<br /><br />- They talk about their World Wide Festival of Races runs, and why they prefer to call it the WWF<br /><br />- Fall's their favorite season, so they take advantage of it by being out among the various topiaries, lakes, cranberry bogs, and other features of nature<br /><br />- Then nature calls<br /><br />- Nature won't stop calling, so they take advantage of nature by having a pit stop in the woods<br /><br />- Nik discusses what it's like to go wheat-free, Dan wants manly-sounding shoes, and Myrna can't stop wheezing<br /><br />- They talk about their first-ever experiences with running<br /><br />- Nik and Dan get some great feedback from very nice people, and actually give some feedback to other very nice people<div><br /></div><div>(10.27.08)</div><img src=\"http://feeds.feedburner.com/~r/4FR/~4/bzSsJoG1Gnw\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "0",
            "sourceUrl": "http://www.archive.org/download/4FeetRunning-Ep.47/4FeetRunning-Ep.47.mp3"
        },
        {
            "title": "4 Feet Running - Ep. 46",
            "datePublished": "Sat, 27 Feb 2010 15:07:47 PST",
            "description": "4 Feet Running has a wicked good time at the Salem Wicked Half-Marathon! This jam-packed week:<br /><br />- Nik and Dan get lost in a thick, dark fog in America's spookiest city<br /><br />- Nik prepares to run the Wicked Half, her longest distance in a while thanks to some gastrointestinal &amp; dietary issues<br /><br />- Speaking of which, she finally gets an answer as to what's wrong with her (sort of)<br /><br />- Dan realizes he's too neurotic to do Chi Running<br /><br />- They get recognized by a very nice listener<br /><br />- Dan hears a very angry half-marathoner refuse any sort of encouragement whatsoever in the strongest possible language<br /><br />- Nik has a great time at the race but misses her favorite socks<br /><br />- They also discuss some other interesting clothing choices in their childhood<br /><br />- They get some fantastic feedback<div><br /></div><div>(10.4.08)</div><img src=\"http://feeds.feedburner.com/~r/4FR/~4/oO8syrzfZ1k\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "0",
            "sourceUrl": "http://www.archive.org/download/4FeetRunning-Ep.46/4FeetRunning-Ep.46.mp3"
        },
        {
            "title": "4 Feet Running - Ep. 45",
            "datePublished": "Sat, 27 Feb 2010 15:05:52 PST",
            "description": "This is take three of 4 Feet Running! No wait--take four. This week is jam-packed:<br /><br />- Nik and Dan explain their unexplained absence on a 4-mile run through their neighborhood: crappy luck<br /><br />- They decide to take the show biweekly for now due to life stuff<br /><br />- Nik continues her rivalry on the Million Feet Running Challenge with Nigel from Running from the Reaper<br /><br />- They review Chi Running by Danny Dreyer and Pose Method of Running by Nicholas Romanov<br /><br />- Nik explains how she's been running twice a day<br /><br />- Dan's got a slight case of dehydration and sleep deprivation, which is not unique to him in his office<br /><br />- They explain all this Bad Boys of Running vs. Bad Girls of Running business<br /><br />- They get feedback from some very nice people<div><br /></div><div>(9.18.08)</div><img src=\"http://feeds.feedburner.com/~r/4FR/~4/ThCJC_emPnA\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "0",
            "sourceUrl": "http://www.archive.org/download/4FeetRunning-Ep.45/4FeetRunning-Ep.45.mp3"
        },
        {
            "title": "4 Feet Running - Ep. 44",
            "datePublished": "Sat, 27 Feb 2010 15:05:36 PST",
            "description": "We're smokin' stew in a tent down by the river with 4 Feet Running! Or, as the French say, Quatre Pieds Courent! This week:<br /><br />- Nik and Dan do a 3-miler by the Fall River waterfront<br /><br />- They briefly meet up with their favorite newspaper hawker<br /><br />- Dan bids a frustrating farewell to the Crazy Man Running Store and finds a new shop<br /><br />- Nik is feeling better, stomachwise, which is helping her keep up with certain British podcasters on RunnerPlus challenges<br /><br />- They meet a regiment of French Revolutionary War re-enactors camped by the river, nice people who nearly bayonet a civilian<br /><br />- Nik and Dan can be Parisian taxi drivers<br /><br />- There's broken bicycle banter and chi chit-chat<br /><br />- They get some feedback from very nice people<div><br /></div><div>(8.28.08)</div><img src=\"http://feeds.feedburner.com/~r/4FR/~4/k7d1AckX_Uw\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "0",
            "sourceUrl": "http://www.archive.org/download/4FeetRunning-Ep.44/4FeetRunning-Ep.44.mp3"
        },
        {
            "title": "4 Feet Running - Ep 43",
            "datePublished": "Sat, 27 Feb 2010 15:05:20 PST",
            "description": "Run through the playground of America's rich and famous with 4 Feet Running! This week:<br /><br />- Nik and Dan go for a 3-miler down Bellevue Avenue in Newport, R.I.<br /><br />- They keep an eye out for Vikings and/or Chinese explorers<br /><br />- Dan tries out some new shoes that may or may not be working<br /><br />- Nik is feeling somewhat better, but her gastrointestinal doctor's nickname is a bit too appropriate<br /><br />- A quick update on their <a href=\"http://worldwideraces.blogspot.com/\">World Wide Festival</a> plans<br /><br />- They have a little picnic in Touro Park, near the Chinese-Viking-settler monument<br /><br />- They get feedback from some very wonderful people<br /><br />- Keep your eyes peeled for an extra-special project<div><br /></div><div>(8.10.08)</div><img src=\"http://feeds.feedburner.com/~r/4FR/~4/OSIIGjDs8O4\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "0",
            "sourceUrl": "http://www.archive.org/download/4FeetRunning-Ep.43/4FeetRunning-Ep.43.mp3"
        },
        {
            "title": "4 Feet Running - Ep. 42",
            "datePublished": "Sat, 27 Feb 2010 15:05:07 PST",
            "description": "elebrate 1 year running with 4 Feet Running! This week:<br /><br />- Nik and Dan run at night in Bristol, R.I., to escape the heat<br /><br />- They recap their yearlong adventures podcasting and in running<br /><br />- Dan's gone from a blob to an honest-to-goodness runner<br /><br />- Nik's working through her GI issues, and she doesn't mean an overseas deployment, unless \"overseas deployment\" is some sort of euphemism<br /><br />- They discuss the first podcasts they ever listened to, and their first experiences with running podcasts in particular<br /><br />- Dan gets the hard sell from a gym membership lady<br /><br />- He also describes a relaxing experience on the open water<br /><br />- They read feedback from some wonderful people<br /><br />- Stay tuned at the end for a special treat!<div><br /></div><div>(7.28.08)</div><img src=\"http://feeds.feedburner.com/~r/4FR/~4/QYzfo5Bl6Cw\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "0",
            "sourceUrl": "http://www.archive.org/download/4FeetRunning-Ep.42/4FeetRunning-Ep.42.mp3"
        },
        {
            "title": "4 Feet Running - Ep. 41",
            "datePublished": "Sat, 27 Feb 2010 15:04:53 PST",
            "description": "These colors DO run with 4 Feet Running! This week:<br /><br />- Nik and Dan meet Special Guest Star John to run the Mattapoisett 4th of July 5-mile road race<br /><br />- They talk about Mattapoisett history, and how it's the nicest, most quaint town in southern Massachusetts<br /><br />- Running podcasts are the best -- all three of them are agreed on this<br /><br />- John describes what it's like to run a 10-mile-long 5K<br /><br />- Embarrassing race running stories aplenty, and what it's like to quit smoking after decades<br /><br />- Nik talks a little bit about gluten intolerance and her possible Celiac disease<br /><br />- They get a special message from Adam \"Another Runner\" Tinkoff and Austin Hastings<br /><br />- They read feedback and reviews from some very nice people<br /><br />- Special thanks to John for making it a great show!<div><br /></div><div>(7.14.08)</div><img src=\"http://feeds.feedburner.com/~r/4FR/~4/hvGOpdtRhhE\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "0",
            "sourceUrl": "http://www.archive.org/download/4FeetRunning-Ep.41/4FeetRunning-Ep.41.mp3"
        },
        {
            "title": "4 Feet Running - Ep. 40",
            "datePublished": "Sat, 27 Feb 2010 15:04:33 PST",
            "description": "Just a quick run to the post office with 4 Feet Running! This week:<br /><br />- Nik and Dan go for an easy 3-miler through the neighborhood<br /><br />- Despite his second-to-last finish in his last race, Dan's going to try another race next week<br /><br />- Nik discovers she has something strange: reactive hypoglycemia<br /><br />- Meet (very briefly) Mike the Quizmaster Postman!<br /><br />- Nik goes into a little more depth about her shiny new Garmin Forerunner 405<br /><br />- They talk about their favorite new hobby: geocaching<br /><br />- Then they get feedback from some very nice people<div><br /></div><div>(7.2.08)</div><img src=\"http://feeds.feedburner.com/~r/4FR/~4/spa7jcCqGqo\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "0",
            "sourceUrl": "http://www.archive.org/download/4FeetRunning-Ep.40/4FeetRunning-Ep.40.mp3"
        },
        {
            "title": "4 Feet Running - Ep. 39",
            "datePublished": "Sat, 27 Feb 2010 15:04:18 PST",
            "description": "There's foreshadowing, suspense, and dramatic irony aplenty with 4 Feet Running with Nik and Dan! This week:<br /><br />- Nik and Dan run the Fairhaven Father's Day Road Race 10K<br /><br />- They predict it won't rain -- guess what happens?<br /><br />- Nik has mysterious trouble with her Garmin -- guess what happens?<br /><br />- Dan hopes he won't be in last place for his first 10K -- guess what <span style=\"font-style: italic; \">almost</span> happens?<br /><br />- They recover from their lousy races with a nice, relaxing walk, where everyone's a winner<br /><br />- Their dog Stanley has interesting (and expensive) food preferences<br /><br />- Nik shares her first look at the Garmin Forerunner 405 GPS sports watch<br /><br />- Dan wraps up his 10 in 10 in 10 Challenge (10 weeks, 10 pounds, 10K) and looks to the future with sunny optimism<div><br /></div><div>(6.24.08)</div><img src=\"http://feeds.feedburner.com/~r/4FR/~4/CCSzHgL91uc\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "0",
            "sourceUrl": "http://www.archive.org/download/4FeetRunning-Ep.39/4FeetRunning-Ep.39.mp3"
        },
        {
            "title": "4 Feet Running - Ep. 38",
            "datePublished": "Sat, 27 Feb 2010 15:03:58 PST",
            "description": "Have a very Vermonty time with 4 Feet Running! This week:<br /><br />- Nik and Dan and their dogs are in glorious Burlington, Vt., for a week<br /><br />- Nik prepares to run her 4th 26.2-miler, the Keybank Vermont City Marathon<br /><br />- It should be beautiful in Vermont this time of year -- all that snow...<br /><br />- Somehow Dan gets a free marathon T-shirt even though he doesn't run the race<br /><br />- They keep an eye out for Burlington nudists<br /><br />- Nik and Dan discuss their training plans, bicycling through Canada, science vs. yoga, and why no one ever runs out of Chapstick<br /><br />- Nik has a great time running the race<br /><br />- She talks about what it's like running 2 marathons in 1 month, and Dan talks about how he grunts when he runs<br /><br />- They get some great feedback from very nice people<div><br /></div><div>(6.6.08)</div><img src=\"http://feeds.feedburner.com/~r/4FR/~4/ybbYLwynGUY\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "0",
            "sourceUrl": "http://www.archive.org/download/4FeetRunning-Ep.38/4FeetRunning-Ep.38.mp3"
        },
        {
            "title": "4 Feet Running - Ep. 37",
            "datePublished": "Sat, 27 Feb 2010 15:03:21 PST",
            "description": "It's the 7th anniversary of 4 Feet Running! Almost. This week:<br /><br />- Nik and Dan celebrate their 7th wedding anniversary doing a 5-mile run with the dogs in Barrington, R.I.<br /><br />- Nik continues her tapering on the way to the Vermont City Marathon<br /><br />- Dan has sort of a lousy running week thanks to the rain<br /><br />- They discuss the early days of their courtship, which had a Sharks &amp; Jets type feel, politically, until it became Sharks &amp; Sharks<br /><br />- They talk about their future marathon travel plans, which may include Texas<br /><br />- Nik &amp; Dan meet a guy still bitter about World War II<br /><br />- They get some coffee and kale soup and read some feedback from very nice people<div><br /></div><div>(5.21.08)</div><img src=\"http://feeds.feedburner.com/~r/4FR/~4/LTjYm1ereac\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "0",
            "sourceUrl": "http://www.archive.org/download/4FeetRunning-Ep.37/4FeetRunning-Ep.37.mp3"
        },
        {
            "title": "4 Feet Running - Ep. 36",
            "datePublished": "Sat, 27 Feb 2010 15:03:06 PST",
            "description": "Two races for the price of one with 4 Feet Running! This week:<br /><br />- Nik runs the Cox Providence Marathon while Dan runs the New Balance 5K<br /><br />- It rains a lot. Again.<br /><br />- Nik runs about a bergillion miles this week, shattering her previous record of half a bergillion<br /><br />- Dan gets a new Nike+ Sportband, which is wicked cool<br /><br />- Nik explains how all the artists she knows tend to not run marathons, but her own personal funk is over<br /><br />- Dan chats with The Mystery Lady, a fellow 5K runner<br /><br />- The biggest thrill about running the first-ever marathon in Providence: full bottles of Gatorade<br /><br />- The worst thing about running the first-ever marathon in Providence: friction and bloody thighs<br /><br />- They describe their new running challenge and get some great feedback from very nice people<div><br /></div><div>(5.10.08)</div><img src=\"http://feeds.feedburner.com/~r/4FR/~4/cZSE7q931n0\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "0",
            "sourceUrl": "http://www.archive.org/download/4FeetRunning-Ep.36/4FeetRunning-Ep.36.mp3"
        },
        {
            "title": "4 Feet Running - Ep. 35",
            "datePublished": "Sat, 27 Feb 2010 15:02:43 PST",
            "description": "It's 4 Feet Not Running with Nik and Dan! This week:<br /><br />- Nik and Dan are hotel-bound in New York City due to rotten weather (they're going to run next week, promise)<br /><br />- Nik goes for a 3.5-miler, but her feet hurt from wearing \"girl shoes\" at a conference<br /><br />- Dan gets his pants and Chuck Taylors soaked by rain<br /><br />- Then begins his bizarre 10-mile quest across Manhattan for more pants<br /><br />- They run into Clive Owen -- yeah, that Clive Owen -- and catch a Broadway show<br /><br />- Nik meets a guy who writes and publishes bathroom books, all by himself<br /><br />- They get some feedback from very nice people<br /><br />- Special thanks to <a href=\"http://tiree.blogspot.com/\">Gordon from Tiree</a> for his song \"Buddha Bill\"<div><br /></div><div>(5.2.08)</div><img src=\"http://feeds.feedburner.com/~r/4FR/~4/hDJ7CqX0JvA\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "0",
            "sourceUrl": "http://www.archive.org/download/4FeetRunning-Ep.35/4FeetRunning-Ep.35.mp3"
        },
        {
            "title": "4 Feet Running - Ep. 34",
            "datePublished": "Sat, 27 Feb 2010 15:02:20 PST",
            "description": "It's a spring fling in Plymouth with 4 Feet Running! This week:<br /><br />- Nik, Dan, and the dogs rock on for 3 miles in downtown Plymouth<br /><br />- Stanley the pointer goes for several swims in Town River while running through Brewster Park<br /><br />- Nik's in a running funk, but is really liking this Twitter business<br /><br />- Dan's 10K training plan is going according to plan, but ice cream may sabotage his 10 in 10 Challenge<br /><br />- They talk about Nik's ancestor who came over on the Mayflower and may or may not have slipped on a banana peel<br /><br />- Speaking of which, they talk about meeting an older lady clown with a filthy mouth (it's hard to explain ... just listen to it)<br /><br />- There are no pictures of Plymouth Rock because it's frankly not that impressive<br /><br />- They read emails and reviews from very nice people<br /><br />- Special thanks to <a href=\"http://tiree.blogspot.com/\">Gordon from Tiree</a> and <a href=\"http://anotherrunner.blogspot.com/\">Adam \"Another Runner\" Tinkoff</a> for their song \"I Do\"<div><br /></div><div>(4.22.08)</div><img src=\"http://feeds.feedburner.com/~r/4FR/~4/CjKLU2Z7z_o\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "0",
            "sourceUrl": "http://www.archive.org/download/4FeetRunning-Ep.34/4FeetRunning-Ep.34.mp3"
        },
        {
            "title": "4 Feet Running - Ep. 33",
            "datePublished": "Sat, 27 Feb 2010 15:01:37 PST",
            "description": "Take a run downtown with 4 Feet Running as Nik and Dan run the Officer Thomas Giunta Memorial 5K road race! This week:<br /><br />- Nik recalls her first time running this race years before, the start of her running habit<br /><br />- Dan finally -- FINALLY -- gets a 10K training plan<br /><br />- Nik's running routine isn't working so great for her, plus oil paint poisoning sucks<br /><br />- They come dangerously close to not getting any race swag due to poor foresight<br /><br />- Nik wins the Whitest Sneakers Award for her brand-new Brooks, purchased at the Crazy Man Running Store<br /><br />- Dan outruns the military for most of the race<br /><br />- Other characters glimpsed in this episode: Nik's Chauvinist Teacher, Dan's ex-coworker Stacey, and an accountant named Bubbles<br /><br />- They discuss Dan's new 10 in 10 Challenge and read some reviews by very nice people<div><br /></div><div>(4.12.08)</div><img src=\"http://feeds.feedburner.com/~r/4FR/~4/zwAFmVv5gyw\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "0",
            "sourceUrl": "http://www.archive.org/download/4FeetRunning-Ep.33/4FeetRunning-Ep.33.mp3"
        },
        {
            "title": "4 Feet Running - Ep. 32",
            "datePublished": "Sat, 27 Feb 2010 15:01:17 PST",
            "description": "4 Feet Running goes <span style=\"font-style: italic; \">back to the future!</span> Actually, to California. <span style=\"font-style: italic; \">Hill Valley,</span> California! Actually, to Berkeley. In this week's 32nd episode:<br /><br />- Nik drops Dan off at the airport so he can attend a multimedia journalism conference in Berkeley<br /><br />- Dan's now linked in to Facebook and Twitter<br /><br />- Nik uses her powers of deduction, honed by years of watching \"Murder She Wrote,\" to solve the mystery of her recent queasiness<br /><br />- Dan, aka Future Boy, gets the DeLorean up to 88 to end up back in time on the west coast<br /><br />- He gets a panic attack<br /><br />- Dan runs twice through the streets of Berkeley, the second time bringing along a special guest star<br /><br />- Dan reports live from downtown San Francisco with the most bizarre, uninformed travel show ever<br /><br />- Gramma doesn't think very much of Dan, but he behaves himself very well and comes home safe<br /><br />- Nik and Dan catch up and read some email and iTunes reviews from very nice people<div><br /></div><div>(4.1.08)</div><img src=\"http://feeds.feedburner.com/~r/4FR/~4/wgQ1vdcmwf8\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "0",
            "sourceUrl": "http://www.archive.org/download/4FeetRunning-Ep.32/4FeetRunning-Ep.32.mp3"
        },
        {
            "title": "4 Feet Running - Ep. 31",
            "datePublished": "Sat, 27 Feb 2010 14:58:49 PST",
            "description": "Experience the sounds, sights, tastes, and smells of New Bedford, Mass., with 4 Feet Running! This week:<br /><br />- Nik runs the New Bedford Half-Marathon (that's it, no special name)<br /><br />- Dan's having a great time running now that he's introduced cartography into his routine<br /><br />- Nik is having less fun -- she's burnt out, tired, and queasy<br /><br />- Some sights: Barflies emerging from their cocoon<br /><br />- Some tastes: KFC, fish sandwiches, and Fierce Gatorade<br /><br />- Some smells: Fish, garbage, dog poop from the future<br /><br />- They listen to a special audio comment from a nice person<div><br /></div><div>(3.21.08)</div><img src=\"http://feeds.feedburner.com/~r/4FR/~4/EdqXBliqOXc\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "0",
            "sourceUrl": "http://www.archive.org/download/4FeetRunning-Ep.31/4FeetRunning-Ep.31.mp3"
        },
        {
            "title": "4 Feet Running - Ep. 30",
            "datePublished": "Sat, 27 Feb 2010 14:56:04 PST",
            "description": "It's a 4-miler in a van down by the river with 4 Feet Running! This week:<br /><br />- Nik and Dan run for 4 miles through beautifulish Somerset, Mass.<br /><br />- It's the longest Dan's run ever -- seriously, like, ever<br /><br />- They talk about ugly houses and wild goose attacks<br /><br />- Nik has some trouble sleeping and getting a good, decent run in<br /><br />- Dan wonders if he should put Vicks Vapo-Rub on his nipples to clear his sinuses while he runs<br /><br />- They discuss the pros and cons of video art and hoarding cats<br /><br />- Dan is not the Man With A Plan, and Nik is deeply unhappy about Daylight-Saving Time<br /><br />- They read feedback from some very nice people and plug a great charity for MS in case you'd like to donate<br /><br />- APOLOGIES: Forgot to hit the Bleep Button on a few swears in there<div><br /></div><div>(3.10.08)</div><img src=\"http://feeds.feedburner.com/~r/4FR/~4/jGBDwYnggm4\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "0",
            "sourceUrl": "http://www.archive.org/download/4FeetRunning-Ep.30/4FeetRunning-Ep.30.mp3"
        },
        {
            "title": "4 Feet Running - Ep. 29",
            "datePublished": "Sat, 27 Feb 2010 14:55:49 PST",
            "description": "It's a case of the Februaries at the Hyannis Half-Marathon with 4 Feet Running! In this special race-day episode:<br /><br />- Nik and Dan head to beautiful Hyannis, the tricep of Cape Cod<br /><br />- They track the elusive North American sister Kim, a wily, rarely photographed mammal that's small and Asian<br /><br />- After funerals and emergency room visits with relatives, Nik and Dan get the Februaries<br /><br />- They discuss American cultural development vis a vis breakfast eggs<br /><br />- It's chaotic in Hyannis but at least everybody survives intact<br /><br />- Nik runs a great half-marathon race in record time<br /><br />- Dan pays a record amount of money for a bagel<br /><br />- They do a post-race wrapup and read some e-mails from very nice people<div><br /></div><div>(2.29.08)</div><img src=\"http://feeds.feedburner.com/~r/4FR/~4/txGBOGKRgNo\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "0",
            "sourceUrl": "http://www.archive.org/download/4FeetRunning-Ep.29/4FeetRunning-Ep.29.mp3"
        },
        {
            "title": "4 Feet Running - Ep. 28",
            "datePublished": "Sat, 27 Feb 2010 14:55:30 PST",
            "description": "Accidents will happen in the 28th episode of 4 Feet Running with Nik and Dan -- it's the special Half at the Hamptons episode! This week:<br /><br />- Nik and Dan find themselves pretty much all alone in deserted Hampton Beach, NH, where Nik's running the town's first half-marathon<br /><br />- Nik reveals her super identity, and it stinks<br /><br />- Dan and Nik describe her strange stint in jury duty involving Mrs. Magoo, a fall into a grave, and a stinky bath mat<br /><br />- Dan tries to figure out what to do with himself in a town where everything including the McDonald's is boarded up for the winter<br /><br />- Nik has a great half-marathon time<br /><br />- Other people don't do so well at all -- there are two drastic accidents<br /><br />- Nik and Dan do a scared and worried post-race wrapup in the car<br /><br />- Then they drive the hell home as fast as they can<div><br /></div><div>(2.16.08)</div><img src=\"http://feeds.feedburner.com/~r/4FR/~4/fBHMhluI-5s\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "0",
            "sourceUrl": "http://www.archive.org/download/4FeetRunning-Ep.28/4FeetRunning-Ep.28.mp3"
        },
        {
            "title": "4 Feet Running - Ep. 27",
            "datePublished": "Sat, 27 Feb 2010 14:55:13 PST",
            "description": "Unready for some football: It's the Super Bowl edition of 4 Feet Running with Nik and Dan! In this 27th episode:<br /><br />- Nik and Dan take a bathroom break (they're remodeling their bathroom) to squeeze in a three-mile run down by the Fall River waterfront<br /><br />- They leave a sore Stanley dog at home with Myrna to keep him company<br /><br />- Nik is worried she's ill-prepared for the Half at the Hamptons next week<br /><br />- Dan, having slept for 15 hours, is more chipper about it<br /><br />- Somehow or other, they get on the topics of the early days of computers, middle school misogynists and journalistic ethics<br /><br />- They shrug over the Super Bowl<br /><br />- Nik and Dan may or may not meet a fan, but they do read feedback from nice people<div><br /></div><div>(2.4.08)</div><img src=\"http://feeds.feedburner.com/~r/4FR/~4/lSZn8TAtGuo\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "0",
            "sourceUrl": "http://www.archive.org/download/4FeetRunning-Ep.27/4FeetRunning-Ep.27.mp3"
        },
        {
            "title": "4 Feet Running - Ep. 26",
            "datePublished": "Sat, 27 Feb 2010 14:55:01 PST",
            "description": "The \"worst podcast thus far\"? Harumph! It's 4 Feet Running with Nik and Dan! In this 26th episode:<br /><br />- Nik and Dan and the dogs go for a 3-mile run through an unfamiliar section of Providence, R.I.<br /><br />- Nik talks about how she's feeling post-op, and how she's on the Couch-to-100-Pushups plan<br /><br />- Dan turns into Cranky McCrankerson, and has a blast with his Shovelglove<br /><br />- She describes her fartleks -- <span style=\"font-style: italic; \">shaddap!</span> That's what they're <span style=\"font-style: italic; \">called!</span><br /><br />- They speak wistfully of their lost youth and impending old age -- then talk about fartleks some more<br /><br />- Nik and Dan read email and reviews from some very nice people and one meanie<div><br /></div><div>(1.29.08)</div><img src=\"http://feeds.feedburner.com/~r/4FR/~4/B9r5pmR4l0k\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "0",
            "sourceUrl": "http://www.archive.org/download/4FeetRunning-Ep.26/4FeetRunning-Ep.26.mp3"
        },
        {
            "title": "4 Feet Running - Ep. 25",
            "datePublished": "Sat, 27 Feb 2010 14:54:40 PST",
            "description": "Steak, lobster, and a 3-miler: It's the surf-and-turf episode of 4 Feet Running with Nik and Dan! In this 25th installment:<br /><br />- Nik and Dan run through the streets of Fall River because it's snowy and nobody can be bothered to shovel<br /><br />- Nik is well on her way back after having appendix surgery<br /><br />- Dan discusses his recent slowdown in running and his new favorite weight-training device<br /><br />- Nik buys shoes from a friendly running-store hermit<br /><br />- They talk about how Fall River has the highest rate of diabetes in Massachusetts, and the city's weight loss challenge, and how lobster dinners don't help this<br /><br />- Learn more about Portuguese American diets<br /><br />- There's an embarrassing mixup on Buckeye Outdoors -- honest<br /><br />- They read feedback from some very, very nice people, including get-well wishes and some more iTunes reviews<div><br /></div><div>(1.20.08)</div><img src=\"http://feeds.feedburner.com/~r/4FR/~4/RHBY2q-Giv4\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "0",
            "sourceUrl": "http://www.archive.org/download/4FeetRunning-Ep.25/4FeetRunning-Ep.25.mp3"
        },
        {
            "title": "4 Feet Running - Ep. 24",
            "datePublished": "Sat, 27 Feb 2010 14:54:06 PST",
            "description": "It's the 24th episode of 4 Feet Running, the first show of 2008! This week:<br /><br />- Nik and Dan have plans to run the Hangover Classic 5K in Salisbury, Mass., and Nik prepares to do a polar bear plunge<br /><br />- They don't, because Nik decides to have an emergency appendectomy instead<br /><br />- Nik and Dan talk about her surgeon, whose name rhymes with a battery-operated adult toy<br /><br />- Nik has a secret tip for getting to the front of the line at the ER<br /><br />- They spend New Year's in the hospital watching \"The Twilight Zone\"<br /><br />- It's The Year in Running as they go over their 2007 stats and make resolutions for 2008<br /><br />- They read feedback from some very nice people and play a very special promo from Adam \"Another Runner\" Tinkoff<div><br /></div><div>(1.5.08)</div><img src=\"http://feeds.feedburner.com/~r/4FR/~4/mwm224Q3RUo\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "0",
            "sourceUrl": "http://www.archive.org/download/4FeetRunning-Ep.24/4FeetRunning-Ep.24.mp3"
        },
        {
            "title": "4 Feet Running - Ep. 23",
            "datePublished": "Sat, 27 Feb 2010 14:53:52 PST",
            "description": "Welcome to a very special Christmas episode of 4 Feet Running, episode 23! This week:<br /><br />- Nice: Nik and Dan and their dogs go for a 3-mile slog down the slushy median of Commonwealth Avenue in Boston<br /><br />- Naughty: Dan doesn't do so well at it<br /><br />- Nice: Nik discusses her plans to do not one but possibly three marathons in 2008<br /><br />- Nice: She also is planning to run various and sundry other races and do an icy New Year's Day ocean plunge<br /><br />- Naughty: Speaking of things that are cold, Dan is super-grumpy because of bladder issues, traffic, and a startling lack of holiday cheer<br /><br />- Very naughty: He restores it by trying to peek at his Christmas presents<br /><br />- Very nice: They read some e-mails and mention some fans' blogs<div><br /></div><div>(12.24.07)</div><img src=\"http://feeds.feedburner.com/~r/4FR/~4/42lTezc-3q8\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "0",
            "sourceUrl": "http://www.archive.org/download/4FeetRunning-Ep.23/4FeetRunning-Ep.23.mp3"
        },
        {
            "title": "4 Feet Running - Ep. 22",
            "datePublished": "Sat, 27 Feb 2010 14:53:36 PST",
            "description": "Welcome to the 22nd episode of 4 Feet Running with Nik and Dan! This week:<br /><br />- Nik and Dan go for a 2.5-mile run over the icy streets of Fall River<br /><br />- Nik gets called \"adorable\" by the lady at the post office<br /><br />- There's a great deal of confusion over one of Nik's presents, upon which Dan suddenly cancels Christmas<br /><br />- They suddenly realize they're living in Mayberry, USA, as they meet lots of friendly people on the street<br /><br />- Dan describes a pleasant evening of being stuck in stalled traffic for six and a half hours<br /><br />- They talk neti pots, giant schnauzers and American Gladiators<br /><br />- Nik and Dan bid farewell to podcasting guru <a href=\"http://www.thezenrunner.com/\">Adam \"Zen Runner\" Tinkoff</a><div><br /></div><div>(12.18.07)</div><img src=\"http://feeds.feedburner.com/~r/4FR/~4/GQ8e4Hlu9qU\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "0",
            "sourceUrl": "http://www.archive.org/download/4FeetRunning-Ep.22/4FeetRunning-Ep.22.mp3"
        },
        {
            "title": "4 Feet Running - Ep. 21",
            "datePublished": "Sat, 27 Feb 2010 14:53:22 PST",
            "description": "Welcome to the 21st episode of 4 Feet Running! This week:<br /><br />- Nik and Dan go for a 3-mile run through the winter wonderland that is Fall River's Oak Grove Cemetery<br /><br />- Dan unveils his new Hal Higdon-approved training plan<br /><br />- Nik continues to recover capably from her marathon and begins to plan her next running season<br /><br />- They talk about how nice snow is -- love it or leave it, crabby New Englanders<br /><br />- But ice is slippery and unpleasant<br /><br />- They discuss the upcoming Christmas holiday and how Dan's much more into it than Nik is (for reasons which are very sad)<br /><br />- Nik and Dan also wonder which superhero has the best, or stupidest, super power<br /><br />- Some very nice people send in some great e-mail<div><br /></div><div>(12.10.07)</div><img src=\"http://feeds.feedburner.com/~r/4FR/~4/nUQwJ8UYINQ\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "0",
            "sourceUrl": "http://www.archive.org/download/4FeetRunning-Ep.21/4FeetRunning-Ep.21.mp3"
        },
        {
            "title": "4 Feet Running - Ep. 20",
            "datePublished": "Sat, 27 Feb 2010 14:52:34 PST",
            "description": "It's the 20th episode of 4 Feet Running! Hooray! This week:<br /><br />- Start spreading the news: Nik and Dan run for 2 miles through New York City's Central Park<br /><br />- They talk about their friend who literally ran away and joined the circus<br /><br />- Nik feels better after a nasty cold left her in shambles after last week's marathon<br /><br />- Dan's shoes announce their retirement<br /><br />- They weigh the merits (culture) and demerits (cost) of living in Manhattan<br /><br />- Nik and Dan wonder aloud exactly how tall Arnold Schwarzenegger is, given how much controversy there is on the subject<br /><br />- Other oddities seen: Cirque du Soleil contortionists and ladies in fur coats drinking mimosas well before noon<div><br /></div><div>(12.4.07)</div><img src=\"http://feeds.feedburner.com/~r/4FR/~4/0O8UZH-M3yo\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "0",
            "sourceUrl": "http://www.archive.org/download/4FeetRunning-Ep.20/4FeetRunning-Ep.20.mp3"
        },
        {
            "title": "4 Feet Running - Ep. 19",
            "datePublished": "Sat, 27 Feb 2010 14:52:23 PST",
            "description": "Welcome to the 19th episode of 4 Feet Running, and Part 2 of the 2007 Philadelphia Marathon spectacular! It's an extra-special show packed with laughs, heartbreak, adventure, romance, and glory! This week:<br /><br />- All of Nik's training pays off for the Philly Marathon<br /><br />- Nik and Dan wait in line at the marathon expo for her race number, an orderly process that devolves into pandemonium in a matter of seconds<br /><br />- They attend the marathon expo and gather a bunch of swag<br /><br />- Nik and Dan try out the Sleep Number Bed, as seen on TV<br /><br />- They collect their thoughts before the big run and get psyched up<br /><br />- Nik is herded into a group of several thousand people running through downtown Philadelphia<br /><br />- She sees many of them peeing on downtown Philadelphia's bushes, just right out in the open<br /><br />- Nik's thorough post-race report includes moments of juggling, beer-drinking, and one furious runner having the \"worst day\" of his life<br /><br />- They read feedback from some very nice people<div><br /></div><div>(11.25.07)</div><img src=\"http://feeds.feedburner.com/~r/4FR/~4/ISH8FLWnk5I\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "0",
            "sourceUrl": "http://www.archive.org/download/4FeetRunning-Ep.19/4FeetRunning-Ep.19.mp3"
        },
        {
            "title": "4 Feet Running - Ep. 18",
            "datePublished": "Sat, 27 Feb 2010 14:52:09 PST",
            "description": "This is the 18th episode of 4 Feet Running -- and Part 1 of a very special 2-part 2007 Philadelphia Marathon spectacular! This week:<br /><br />- Nik and Dan travel hundreds of miles across the unforgiving wilderness of suburban Connecticut, New York, and Pennsylvania<br /><br />- They discuss, and eat, junk food<br /><br />- Nik and Dan stop in Scranton, Pa., home of Dunder Mifflin Inc., which because of a snafu doesn't get recorded<br /><br />- They take a 2-mile run through downtown Philly to get Nik nice and limber<br /><br />- Nik prepares to run her second 26.2-miler<br /><br />- It briefly becomes 4 Feet Painting as they get into a highbrow art discussion<br /><br />- Make sure to listen next week to see how well Nik ran the marathon!<div><br /></div><div>(11.18.07)</div><img src=\"http://feeds.feedburner.com/~r/4FR/~4/KB7i6QMG2-A\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "0",
            "sourceUrl": "http://www.archive.org/download/4FeetRunning-Ep.18/4FeetRunning-Ep.18.mp3"
        },
        {
            "title": "4 Feet Running - Ep. 17",
            "datePublished": "Sat, 27 Feb 2010 14:51:52 PST",
            "description": "Welcome to the 17th episode of 4 Feet Running! This week:<br /><br />- Dan runs the Vasque Luv2Run 5K Trail Run on the Charles River in Brighton, Mass.<br /><br />- Nik sits out the run while she tapers for the Philadelphia Marathon<br /><br />- Somehow, Dan gets a little lost, which is only the beginning of a highly embarrassing week<br /><br />- Nik and Dan try to talk like young whippersnappers<br /><br />- She suffers from an acute case of non-running, work-related crankiness<br /><br />- Dan introduces this phrase into your vocabulary: \"take a digger\"<br /><br />- They discuss their plans for the next few weeks and read e-mail from very nice people<div><br /></div><div>(11.12.07)</div><img src=\"http://feeds.feedburner.com/~r/4FR/~4/duABFTKqCyk\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "0",
            "sourceUrl": "http://www.archive.org/download/4FeetRunning-Ep.17/4FeetRunning-Ep.17.mp3"
        },
        {
            "title": "4 Feet Running - Ep. 16",
            "datePublished": "Sat, 27 Feb 2010 14:51:38 PST",
            "description": "Welcome to the spooky 16th episode of 4 Feet Running! This week:<br /><br />- Nik and Dan celebrate Halloween with a 2-mile run through Salem, Massachusetts, witch capital of the world<br /><br />- They see a haunted ghost walk featuring mostly live people<br /><br />- Nik reveals that she didn't like candy as a kid (no, REALLY)<br /><br />- Dan's vampiric past gets dragged into the light<br /><br />- They witness an actual recreation of a witch trial in an actual recreation of a witch dungeon<br /><br />- Some ghostly spectre scares the whatsit out of Nik<br /><br />- Dan gets a \"psychic reading,\" and they talk about why psychics are all 100 percent full of crap<div><br /></div><div>(11.5.07)</div><img src=\"http://feeds.feedburner.com/~r/4FR/~4/j9LanlAfWBU\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "0",
            "sourceUrl": "http://www.archive.org/download/4FeetRunning-Ep.16/4FeetRunning-Ep.16.mp3"
        },
        {
            "title": "4 Feet Running - Ep. 15",
            "datePublished": "Sat, 27 Feb 2010 14:49:57 PST",
            "description": "Welcome to 4 Feet Running's 15th episode! This week:<br /><br />- Nik and Dan decide it's a good idea to take the dogs for a 2-mile run in the pouring, freezing rain at night<br /><br />- They decide that this actually isn't that good an idea<br /><br />- Dan reveals his running plans post-5K, then steps in several puddles<br /><br />- Nik worries about whether their Philadelphia hotel will be able to supply oatmeal before her marathon<br /><br />- Some people yell \"Woo hoo\" at them<br /><br />- Nik and Dan at last uncover the answer to the most compelling mystery of our age: \"Who's walking who, eh?\"<br /><br />- They talk about weight loss and read feedback from some nice people<div><br /></div><div>(10.29.07)</div><img src=\"http://feeds.feedburner.com/~r/4FR/~4/Hg4Cx4tjctE\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "0",
            "sourceUrl": "http://www.archive.org/download/4FeetRunning-Ep.15/4FeetRunning-Ep.15.mp3"
        },
        {
            "title": "4 Feet Running - Ep. 14",
            "datePublished": "Sat, 27 Feb 2010 14:49:42 PST",
            "description": "Welcome to the 14th episode of 4 Feet Running! It's a very special episode packed with adventure! This week:<br /><br />- Dan and Nik run the Catholic Memorial Home 5K Harvest Race and Fun Run (or whatever it's called)<br /><br />- It's Dan's first-ever 5K distance, and the longest he's ever run -- EVER<br /><br />- Dan's knee is mysteriously swollen ahead of the race<br /><br />- Nik has a running week packed with miles, yoga and \"fairy cards\"<br /><br />- They discuss the merits of taking a bathroom break before a race, as opposed to taking all over yourself as you run<br /><br />- Bananas appear in strange places<br /><br />- Dan survives to run another day despite one crucial error<br /><br />- They read an e-mail from a very nice person<div><br /></div><div>(10.21.07)</div><img src=\"http://feeds.feedburner.com/~r/4FR/~4/0QTcMkgMePs\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "0",
            "sourceUrl": "http://www.archive.org/download/4FeetRunning-Ep.14/4FeetRunning-Ep.14.mp3"
        },
        {
            "title": "4 Feet Running - Ep. 13",
            "datePublished": "Sat, 27 Feb 2010 14:49:28 PST",
            "description": "This is 4 Feet Running, Episode 13! In this episode:<br /><br />- Nik and Dan run for 40 minutes through the East Side of Providence<br /><br />- They come across the Red Bull Soapbox Race, where they meet people with outrageous soapbox racers (very few of which are made with actual soap boxes)<br /><br />- They talk about Rhode Island drivers and almost get hit by a few<br /><br />- Nik and Dan again discuss the class system<br /><br />- Nik continues her marathon training for Philadelphia, and Dan is one week away from his first 5K<br /><br />- Get an audio tour of the soapbox racer judging<br /><br />- They read feedback from very nice people<div><br /></div><div>(10.14.07)</div><img src=\"http://feeds.feedburner.com/~r/4FR/~4/R7ib4Gim2TE\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "0",
            "sourceUrl": "http://www.archive.org/download/4FeetRunning-Ep.13/4FeetRunning-Ep.13.mp3"
        },
        {
            "title": "4 Feet Running - Ep. 12",
            "datePublished": "Sat, 27 Feb 2010 14:49:15 PST",
            "description": "Welcome to the 12th episode of 4 Feet Running! This week:<br /><br />- Nik and Dan run through beautiful, traffic-plagued Wellesley, Massachusetts<br /><br />- Celebrity chefs mentioned: <a href=\"http://www.ming.com/blueginger/\">Ming Tsai</a>, <a href=\"http://www.rachaelray.com/\">Rachael Ray</a>, the <a href=\"http://www.barefootcontessa.com/\">Barefoot Contessa</a><br /><br />- Dan runs his first 2-miler and does OK with hills<br /><br />- Nik does less OK on a lunch of cookies and soda, which threatens to make an \"encore\"<br /><br />- They discuss <a href=\"http://wjar.weatherplus.com/wxplocal/1113465/detail.html\">meteorologists</a>, Twizzlers, kale soup, and clouds of gnats<br /><br />- They read feedback from lots of nice people<div><br /></div><div>(10.8.07)</div><img src=\"http://feeds.feedburner.com/~r/4FR/~4/7BCGK2NXU-w\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "0",
            "sourceUrl": "http://www.archive.org/download/4FeetRunning-Ep.12/4FeetRunning-Episode12.mp3"
        },
        {
            "title": "4 Feet Running - Ep. 11",
            "datePublished": "Sat, 27 Feb 2010 14:49:01 PST",
            "description": "Welcome to 4 Feet Running, Episode 11! In this week's fun-filled episode:<br /><br />- Nik and Dan hunt zombies in downtown Boston -- yes, zombies<br /><br />- They find them, and they are rather a sorry lot<br /><br />- Nik and Dan run for 30 minutes through the financial district, Faneuil Hall, and past South Station<br /><br />- Dan reveals that he has skipped Week 8 and gone straight for Week 9's jugular<br /><br />- Nik is still tremendously busy with work, which is putting a damper on her marathon training<br /><br />- They discuss the various social habits and cultural biases facing people of the undead orientation<br /><br />- Celebrity spottings aplenty, from world-famous composer John Williams to <a href=\"http://www.imdb.com/name/nm0000445/\">the guy from \"Cheers\" who played Carla's husband</a><br /><br />- Nik and Dan read lots of e-mail from very nice people<div><br /></div><div>(10.1.07)</div><img src=\"http://feeds.feedburner.com/~r/4FR/~4/jT4VMCc7o9w\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "0",
            "sourceUrl": "http://www.archive.org/download/4FeetRunning-Ep.11/4FeetRunning-Episode11.mp3"
        },
        {
            "title": "4 Feet Running - Ep. 10",
            "datePublished": "Sat, 27 Feb 2010 14:48:43 PST",
            "description": "This is 4 Feet Running, Episode 10! This week:<br /><br />- It's 12 Feet Running as Nik and Dan take dogs Stanley and Myrna for a 25-minute jog<br /><br />- Dan breaks his all-time running record at 27 minutes despite running by a bunch of schoolkids<br /><br />- The dogs' various habits, tricks, and PRs are discussed<br /><br />- Nik has a great running week, except for the pain in her foot, a full bladder and bloody hand<br /><br />- Dan suddenly begins to stink pretty bad<br /><br />- The animals get rubbed with ice<br /><br />- Nik also runs 17 miles across state lines and talks about eating \"mystery meats\" as a child at Chinese restaurants<br /><br />- They read feedback and talk about the social sacrifices you make for being a runner<div><br /></div><div>(9.23.07)</div><img src=\"http://feeds.feedburner.com/~r/4FR/~4/nCnDJfYk488\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "0",
            "sourceUrl": "http://www.archive.org/download/4FeetRunning-Ep.10/4FeetRunning-Episode10.mp3"
        },
        {
            "title": "4 Feet Running - Ep. 9",
            "datePublished": "Sat, 27 Feb 2010 14:48:30 PST",
            "description": "Welcome to 4 Feet Running's 9th episode! This week:<br /><br />- It's a 25-minute jog through downtown Bristol, R.I., the noisiest town, like, ever<br /><br />- Dan's C25K week 7 is wicked crappy because he gets a side stitch<br /><br />- Nik's marathon training goes a lot better than last week because her hip is a little better<br /><br />- They talk about coffee (Dan likes it), waking up early (Dan hates it), dogs (they like them), and drinking cheese (Nik did it)<br /><br />- Dan finally figures out the mathematical formula for minutes per mile<br /><br />- Nik knows no long-distance runners who carry as much water as she does<div><br /></div><div>- They reminisce about hanging out in Bristol and Nik beating the crap out of him in chess<br /><br />- Dan wins 50 bucks in the lottery, which they spend on lobster rolls<br /><br />- They read feedback from nice people.</div><div><br /></div><div>(9.16.07)</div><img src=\"http://feeds.feedburner.com/~r/4FR/~4/hZiPf2RZy6Q\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "0",
            "sourceUrl": "http://www.archive.org/download/4FeetRunning-Ep.9/4FeetRunning-Episode9.mp3"
        },
        {
            "title": "4 Feet Running - Ep. 8",
            "datePublished": "Sat, 27 Feb 2010 14:48:17 PST",
            "description": "This is Episode 8 of 4 Feet Running! In this episode:<br /><br />- Nik and Dan go for a 25-minute jog, and he predicts (inaccurately) his own death at the hands of bears or alligators<br /><br />- They talk about their various attempts to lose weight<br /><br />- Dan's Couch to 5K Week 6 is going fantastic<br /><br />- Nik's marathon training isn't as fun, because she has a hurt hip from sitting on her bum too much at work<br /><br />- One of the cats also keeps stealing her chair<br /><br />- Nik confesses she doesn't like chourio, which may trigger an international incident with the nation of Portugal<div><br /></div><div>(9.9.07)</div><img src=\"http://feeds.feedburner.com/~r/4FR/~4/d-1yNhr49qo\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "0",
            "sourceUrl": "http://www.archive.org/download/4FeetRunning-Ep.8/4FeetRunning-Episode8.mp3"
        },
        {
            "title": "4 Feet Running - Ep. 7",
            "datePublished": "Sat, 27 Feb 2010 14:47:53 PST",
            "description": "This is the 7th episode of 4 Feet Running with Nik and Dan! This week:<br /><br /> Nik is exhausted and cranky from lack of sleep, but she still runs Week 7 of the Hal Higdon marathon training program<br /> Dan is exhausted and cranky from lack of sleep, but he still runs Week 5B of his Couch to 5K program<br /> They discuss the body's Four Humours: Larry, Moe, Curly, and Shemp<br /> Several noisy cars run by, and also an ambulance<br /> Dan's in a \"comme ci, comme ca\" mood<br /> Nik describes the interesting sleep-deprivation hallucinations she's having<br /> You find out what Dan shrieking like a little girl sounds like<br /> He also mentions Russian circus bears from Michigan<br /> Then they eat like rich people and read e-mails from nice people<br /><br />Special Guest Star, live via answering machine: Dan's mom<div><br /></div><div>(9.3.07)</div><img src=\"http://feeds.feedburner.com/~r/4FR/~4/ifq5n8lMkcg\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "0",
            "sourceUrl": "http://www.archive.org/download/4FeetRunning-Ep.7/4FeetRunning-Episode7.mp3"
        },
        {
            "title": "4 Feet Running - Ep. 6",
            "datePublished": "Sat, 27 Feb 2010 14:47:40 PST",
            "description": "Welcome to 4 Feet Running's 6th episode! In this fun-packed installment:<br /><br />- Nik and Dan take a run by <a href=\"http://specialsections.wickedlocal.com/SS/Page.aspx?secid=32364\">the Great Feast of the Holy Ghost of New England,</a> a major Portuguese feast in downtown Fall River's Kennedy Park<br />- Dan's C25K Week 5 run becomes Week 5-ish because he's overtired<br />- Nik talks about her do-it-yourself approach when she first started running<br />- Dan recounts the story of Queen Isabella of Portugal, her devotion to the poor, and her milk jugs<br />- Nik describes her weekly training for the <a href=\"http://www.philadelphiamarathon.com/\">Philadelphia Marathon,</a> her new pair of <a href=\"http://www.shop.com/BROOKS_Dyad_4-45423307-p%21.shtml\">Brooks shoes,</a> and her <a href=\"http://www.clifbar.com/eat/shot_blok.cfm?location=shot\">Clif Bloks</a><br />- They wander around the feast, smell some Portuguese food, try to get some free meat, and see a whole bunch more jugs<br />- Dan asks Nik how much money she'd take to break a leg<br />- Dan stupidly forgets what the difference is between being blind and deaf<br />- They apologize again for being too loud in Episode 5<br />- It's wall-to-wall Portuguese music, including songs by this cat: <a href=\"http://www.jorgeferreira.com/\">Jorge Ferreira</a><div><br /></div><div>(8.26.07)</div><img src=\"http://feeds.feedburner.com/~r/4FR/~4/xxZCSZxRaKw\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "0",
            "sourceUrl": "http://www.archive.org/download/4FeetRunning-Ep.6/4FeetRunning-Episode6.mp3"
        },
        {
            "title": "4 Feet Running - Ep. 5",
            "datePublished": "Sat, 27 Feb 2010 14:47:25 PST",
            "description": "Welcome to episode five of 4 Feet Running! In this installment:<br /><br /> Nik and Dan forgo their usual routine as she runs the <a href=\"http://www.louiesrun.com/\">Louie's Race 5K</a> in New Bedford<br /> They almost sneak into <a href=\"http://www.bpzoo.org/\">Buttonwood Park Zoo</a> to \"pet and ride\" the elephants<br /> Dan spills his coffee a little<br /> Nik and Dan somehow get lost walking around a square park<br /> They discuss \"Jungle Love\" and jungle cats<br /> Nik successfully runs her 5K, while others run as if being chased by the zombies from \"Thriller\"<br /> Some guy may have spit a bit of lettuce on her<div><br /></div><div>(8.19.07)</div><img src=\"http://feeds.feedburner.com/~r/4FR/~4/CEM6k5msK-w\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "0",
            "sourceUrl": "http://www.archive.org/download/4FeetRunning-Ep.5/4FeetRunning-Episode5.mp3"
        },
        {
            "title": "4 Feet Running - Ep. 4",
            "datePublished": "Sat, 27 Feb 2010 14:45:56 PST",
            "description": "This is 4 Feet Running's 4th episode! In this installment:<br /><br /> Nik does a great job with her marathon training<br /> Dan does lousy with his Couch to 5K week four, thanks to The Home Improvement Project That Wouldn't Die<br /> Nik and Dan run by the Fall River Celebrates America waterfront festival and are shooed away by two huge guys in military fatigues<br /> Dan reveals that he is actually descended from the Lost City of Atlantis<br /> Nik coaches him on how to relieve side stitches<br /> Nik and Dan talk yoga: hot, naked or otherwise<br /> Phil and Paul get ... uh ... whatever the opposite of a \"shout-out\" is<br /> Nik and Dan read feedback from really nice people<div><br /></div><div>(8.12.07)</div><img src=\"http://feeds.feedburner.com/~r/4FR/~4/UtwDtLQJRmM\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "0",
            "sourceUrl": "http://www.archive.org/download/4FeetRunning-Ep.4/4FeetRunning-Episode4.mp3"
        },
        {
            "title": "4 Feet Running - Ep. 3",
            "datePublished": "Sat, 27 Feb 2010 14:45:31 PST",
            "description": "This is the third episode of 4 Feet Running! In this edition:<br /><br /> Nik continues her marathon training and Dan sweats through 90-plus-degree weather<br /> Nik may or may not be confused as to how long Dan's Couch to 5K run should be<br /> They talk about their weight loss goals and how they are different from those people on \"The Biggest Loser\"<br /> Nik explains what a Portuguese-American vegetable is<br /> Dan reads listener feedback from really nice people<br /> They come to the sad conclusion that they will never be more popular than a naked yoga podcast<div><br /></div><div>(8.4.07)</div><img src=\"http://feeds.feedburner.com/~r/4FR/~4/UNvs0gN5MqY\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "0",
            "sourceUrl": "http://www.archive.org/download/4FeetRunning-Ep.3/4FeetRunning-Episode3.mp3"
        },
        {
            "title": "4 Feet Running - Ep. 2",
            "datePublished": "Sat, 27 Feb 2010 14:44:02 PST",
            "description": "Welcome to the second episode of 4 Feet Running! In this edition:<br /><br /> Nik gets ill (again) with The Mystery Disease and ends up in the ER<br /> Dan flounders miserably as he tries to podcast solo<br /> Later on, though, Nik feels well enough to train with Dan on his Couch to 5K second week run<br /> Nik keeps going to make up for lost time with her marathon program<br /> They talk about dogs, their lack of gardening skills, and bagels<div><br /></div><div>(7.28.07)</div><img src=\"http://feeds.feedburner.com/~r/4FR/~4/mQO16nNELiw\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "0",
            "sourceUrl": "http://www.archive.org/download/4FeetRunning-Ep.2/4FeetRunning-Episode2.mp3"
        },
        {
            "title": "4 Feet Running - Ep. 1",
            "datePublished": "Sat, 27 Feb 2010 14:43:32 PST",
            "description": "Welcome to Episode 1 of the 4 Feet Running podcast with Nik and Dan! She's an intermediate runner training for her 2nd marathon. He's a beginning runner starting the Couch to 5K program. They're the two great tastes that taste great together.<br /><br />In this episode:<br /><br /> we hear a little about Nik and Dan's running histories<br /> we find out about their goals and how they plan to achieve them<br /> some old jerk in a Ford Mustang honks and makes an extremely rude comment about Nik's body parts<br /> they meet a Mystery Lady, and we're not sure who she is or what she was talking about<div><br /></div><div>(7.21.07)</div><img src=\"http://feeds.feedburner.com/~r/4FR/~4/iuNCBgxKu-8\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "0",
            "sourceUrl": "http://www.archive.org/download/4FeetRunning-Ep.1/4FeetRunning-Episode1.mp3"
        }
    ]
}