{
    "artwork": "http://is5.mzstatic.com/image/thumb/Music62/v4/b4/cf/09/b4cf0944-27f9-c986-2e7f-e9c5712bee7a/source/100x100bb.jpg",
    "description": "Podcast by Charles Eisenstein",
    "feedURL": "http://feeds.soundcloud.com/users/soundcloud:users:25399697/sounds.rss",
    "podcastURL": "http://www.charleseisenstein.net",
    "title": "A New and Ancient Story: The Podcast",
    "episodes": [
        {
            "title": "Mellody Hayes: Roots of Healing (E51)",
            "datePublished": "Tue, 22 Sep 2020 00:20:45 +0000",
            "description": "This was a delightful conversation. We hadn't intended to talk about race, but I'm glad we did, because Mellody shared some unique, unorthodox insights worthy of considering in our troubled times. The conversation ranged into the territory of psychedelic therapy, mysticism, and principles of personal and collective transformation. Her riff on spiritual bypass near the end is not to be missed! Mellody Hayes is a physician-writer, speaker, and spiritual teacher and the Executive Director of Ceremony Health, a faith-based psychedelic healing center.  She is graduate of Harvard College and UCSF Medical School and Anesthesiology Residency, John Kenneth Galbraith Scholar, and a Voices of Our Nation Alum.\n\nLinks:\nMellody Hayes: https://www.mellodyhayes.com/\nRefuge with Last Black Man in San Francisco: https://adelaidemagazine.org/nf_mellody_hayes33.html",
            "length": "230562892",
            "sourceUrl": "http://www.podtrac.com/pts/redirect.mp3/feeds.soundcloud.com/stream/897266296-charleseisenstein-mellody-hayes-e-51.mp3"
        },
        {
            "title": "Dr. Edith Ubuntu Chan: A Trillion Points of Light (E50)",
            "datePublished": "Sat, 29 Aug 2020 04:41:30 +0000",
            "description": "Dr. Edith Ubuntu Chan has an unusual background -- studied mathematics at Harvard, became a Doctor of Oriental Medicine... Actually, nothing I could say about her can do justice to the stories she carries: about the soul's journey, the nature of life and death, illness and healing, and the vastness of human potential. I was on her podcast a couple months ago, and she has graciously returned the favor here. Also check out her new book, Super Wellness via http://www.superwellness.com/\n\nAnother podcast of Dr. Chan and Charles is available via http://www.dredithubuntu.com/thedreshow/our-great-initiation-into-the-more-beautiful-world-w-charles-eisenstein",
            "length": "218452766",
            "sourceUrl": "http://www.podtrac.com/pts/redirect.mp3/feeds.soundcloud.com/stream/883915423-charleseisenstein-dr-e-ubuntu-chan-e-50.mp3"
        },
        {
            "title": "Dr. Zach Bush: Life is a Community (E49)",
            "datePublished": "Tue, 28 Jul 2020 02:14:26 +0000",
            "description": "Here I talk with Zach Bush, MD, a doctor with a background in endocrinology who \"went holistic\" and turned toward gut/brain health, the microbiome, and soil science. Our conversation covered a lot of ground: evolution, the importance of biological diversity for personal, social, and ecological health, the inventive fecundity of life, the role of viruses in sharing genetic information, and more. I expect this conversation will help expand people's horizons in trying to understand health and sickness in the Covid era.\n\nDel Bigtree podcast: https://www.youtube.com/watch?v=xXI0UEmCsEw\nAbout Zach: https://zachbushmd.com/video/the-highwire/",
            "length": "198805526",
            "sourceUrl": "http://www.podtrac.com/pts/redirect.mp3/feeds.soundcloud.com/stream/865717096-charleseisenstein-zach-bush-life-is-a-community-e49.mp3"
        },
        {
            "title": "Alnoor Ladha: Oppression, Interconnection, Healing (E48)",
            "datePublished": "Tue, 07 Jul 2020 20:47:09 +0000",
            "description": "This rich dialog treats the evolution of activism beyond us-versus-them thinking, with special reference to current events around race, the indigenous, and the Amazon rainforest. Alnoor Ladha’s work focuses on the intersection of political organizing, systems thinking and narrative work. He was the co-founder and Executive Director of The Rules (TR), a global network of activists, organizers, designers, coders, researchers, writers and others focused on changing the rules that create inequality, poverty and climate change. Currently, he is active with Cura Da Terra (#CuraDaTerra), a campaign of and for the indigenous of the Amazon in their role as healers of the earth. Alnoor comes from a Sufi lineage and explores/writes about the intersection between politics and spirituality in times of crisis.\n\nThe Rules: https://therules.org/",
            "length": "171954722",
            "sourceUrl": "http://www.podtrac.com/pts/redirect.mp3/feeds.soundcloud.com/stream/853890616-charleseisenstein-alnoor-ladha-e48.mp3"
        },
        {
            "title": "Vivian Dittmar: Befriending Fear (E47)",
            "datePublished": "Mon, 27 Apr 2020 22:19:41 +0000",
            "description": "Vivian Dittmar is a teacher, speaker, and writer, author of the book The Power of Feelings. In this conversation we talk about the collective global field of uncertainty, the dynamics of birth and death, and the opportunity that Covid offers to befriend fear and follow its evolutionary power. \n\nHere is a guided meditation she offers on accessing the power of fear:\nhttps://www.youtube.com/watch?v=0eqOXGUgBWY\n\nShe also shares with the audience a chapter on the power of fear from her book: \nhttps://viviandittmar.net/wp-content/uploads/The-Power-of-Fear.pdf\n\nVivian's book, The Power of Feelings is here:\nhttps://viviandittmar.net/en/books/the-power-of-feelings/ \n\nHer upcoming book, The Inner GPS is here:\nhttps://viviandittmar.net/en/books/your-inner-gps/",
            "length": "151769422",
            "sourceUrl": "http://www.podtrac.com/pts/redirect.mp3/feeds.soundcloud.com/stream/808552738-charleseisenstein-vivian-dittmar-befriending-fear-e-47.mp3"
        },
        {
            "title": "Farmer Rishi: The Gift Circle of Life (E46)",
            "datePublished": "Sat, 04 Apr 2020 20:12:16 +0000",
            "description": "Rishi Kumar(https://farmerrishi.com), a former software engineer, is a gardening evangelist who uses gardening for personal, social, and ecological healing. We talk a lot about regeneration: how it is not just a set of techniques, but an orientation, a way of seeing, and a way of relating to the earth. We humans don't have to be outsiders to nature; we too are an organ of Gaia and can join the gift circle of life. I hope our conversation gives whomever listens a little extra encouragement to begin or to deepen their gardening, and to look at the nonprofit Rishi works with, Kiss the Ground (https://kisstheground.com).",
            "length": "133905742",
            "sourceUrl": "http://www.podtrac.com/pts/redirect.mp3/feeds.soundcloud.com/stream/790924612-charleseisenstein-farmer-rishi-e-46.mp3"
        },
        {
            "title": "Sayer Ji: Beyond the Coronavirus (E45)",
            "datePublished": "Wed, 11 Mar 2020 19:34:45 +0000",
            "description": "Sayer Ji is a prominent holistic health researcher and the founder of one of the largest alternative health websites, greenmedinfo.com. We talk first and foremost about the coronavirus and the multiple fear narratives surrounding it, then venture into some other controversial topics: body ecology and the \"virome,\" vaccines, internet censorship, science and its limitations, biological transmutation of elements, water bubble cavitation, and my favorite topic of late, ideological polarization and peace.\n\nLink to his new book, Regenerate: Unlocking Your Body's Radical Resilience through the New Biology: \nhttps://www.penguinrandomhouse.com/books/599585/regenerate-by-sayer-ji/ \nOther resource site: https://regenerateproject.com/",
            "length": "177665211",
            "sourceUrl": "http://www.podtrac.com/pts/redirect.mp3/feeds.soundcloud.com/stream/774530707-charleseisenstein-sayer-ji-e-45.mp3"
        },
        {
            "title": "Luz Gonçalves Brito: Spirituality is the Search for Connection (E44)",
            "datePublished": "Wed, 19 Feb 2020 21:19:04 +0000",
            "description": "Luz Gonçalves Brito is a Brazilian anthropologist who brings academics and spirituality together in an exquisite way. Our conversation was like a meditation, touching on the inseparability of the spiritual from the ecological and political. For example: ecology, like spirituality, is ultimately a search for connection. Luz's research is not only scholarly -- you may feel chills as I did upon hearing her sing the song given to her by a river.",
            "length": "175960555",
            "sourceUrl": "http://www.podtrac.com/pts/redirect.mp3/feeds.soundcloud.com/stream/763379107-charleseisenstein-luz-goncalves-brito-e44.mp3"
        },
        {
            "title": "Julie Esterly: Mystery of Life, Death, and Earth (E43)",
            "datePublished": "Wed, 18 Dec 2019 20:42:04 +0000",
            "description": "Julie Esterly is active in the death care movement, part of the reclamation of death as a culturally recognized part of life. We speak of our culture's death rituals, the necessity of realizing death in order to fully realize life, and the connection between the denial of death and the denial of life, which takes specific form in collective ecocide. Is this a depressing topic? No. See if you come a little more alive through this conversation.\n\nMore about Julie Esterly at esterly.com and her work at naturaldeathcareinitiative.org",
            "length": "148343171",
            "sourceUrl": "http://www.podtrac.com/pts/redirect.mp3/feeds.soundcloud.com/stream/730459417-charleseisenstein-julie-esterly-e43.mp3"
        },
        {
            "title": "Julie Esterly: Mystery of Life, Death, and Earth (E43)",
            "datePublished": "Wed, 18 Dec 2019 20:27:54 +0000",
            "description": "Julie Esterly is active in the death care movement, part of the reclamation of death as a culturally recognized part of life. We speak of our culture's death rituals, the necessity of realizing death in order to fully realize life, and the connection between the denial of death and the denial of life, which takes specific form in collective ecocide. Is this a depressing topic? No. See if you come a little more alive through this conversation.\n\nMore about Julie Esterly at esterly.com and her work at naturaldeathcareinitiative.org",
            "length": "148343171",
            "sourceUrl": "http://www.podtrac.com/pts/redirect.mp3/feeds.soundcloud.com/stream/730453807-charleseisenstein-julie-esterly-mystery-of-life-death-earth-e43.mp3"
        },
        {
            "title": "Gigi Coyle: What is Mine to Do? - Part 2 (E42)",
            "datePublished": "Tue, 05 Nov 2019 18:13:09 +0000",
            "description": "Part Two of my conversation with Gigi Coyle explores the process of transforming pain and turmoil that is intensely reflecting back to us from the world (natural disasters, forest fires, potlics, etc..). How do we find the gifts hidden in these situations? How do we not go crazy trying not to go crazy?\n\nThis is Part Two of a two-part conversation. You can find Part One at:\nhttps://charleseisenstein.org/podcasts/new-and-ancient-story-podcast/gigi-coyle-what-is-mine-to-do-e42/\n\nMore about Gigi's work: \nhttp://schooloflostborders.org/content/virginia-gigi-coyle",
            "length": "64656967",
            "sourceUrl": "http://www.podtrac.com/pts/redirect.mp3/feeds.soundcloud.com/stream/708317455-charleseisenstein-gigi-coyle-what-is-mine-to-do-part-2-e42-2.mp3"
        },
        {
            "title": "Gigi Coyle: What is Mine to Do? - Part 1 (E42)",
            "datePublished": "Tue, 05 Nov 2019 18:09:47 +0000",
            "description": "What is mine to do? This is the mantra of Gigi Coyle, a revered veteran of social, political, and spiritual movements going back to the 1970s. Gigi was instrumental in the founding of the Ojai Foundation, Youth Passageways, Beyond Boundaries, and other groups. She is a true elder, someone whose experiences, successes, and especially failures give birth to wisdom in the soil of her humility. I hope listeners benefit as much from this conversation as I did.\n\nThis is Part One of a two-part conversation. You can find Part Two at:\nhttps://charleseisenstein.org/podcasts/new-and-ancient-story-podcast/gigi-coyle-what-is-mine-to-do-e42/\n\nMore about Gigi's work: \nhttp://schooloflostborders.org/content/virginia-gigi-coyle",
            "length": "116812005",
            "sourceUrl": "http://www.podtrac.com/pts/redirect.mp3/feeds.soundcloud.com/stream/708315856-charleseisenstein-gigi-coyle-what-is-mine-to-do-part-1-e42-1.mp3"
        },
        {
            "title": "Zack Geist: Dispelling the Mystery of Debt (E41)",
            "datePublished": "Wed, 16 Oct 2019 00:12:51 +0000",
            "description": "This conversation with Zack Geist addresses the phenomenon of debt, both from a theoretical standpoint and in very practical terms (at least for US listeners). Zack operates a business that liberates people from student loans and other debt. We discuss the morality of debt, debt peonage, and the crushing realities of debt in America. This is a conversation between a philosopher (me) and someone who works with real people deep inside the system. \n\nTo learn more about Zack Geist's work, please visit https://learn.studentloantutor.com/magic/",
            "length": "139361403",
            "sourceUrl": "http://www.podtrac.com/pts/redirect.mp3/feeds.soundcloud.com/stream/696517537-charleseisenstein-zack-geist-dispelling-the-mystery-of-debt-e41.mp3"
        },
        {
            "title": "Robin McKenna: GIFT(E40)",
            "datePublished": "Mon, 07 Oct 2019 18:12:56 +0000",
            "description": "In this conversation, filmmaker Robin McKenna and I discuss her new film, GIFT, which is inspired by Lewis Hyde's classic book, The Gift. I consider Hyde to be an elder of an intellectual/spiritual lineage that has also informed a lot of my work, in particular the book Sacred Economics and the course, Living in the Gift.  Here we travel through many dimensions of the gift universe as well as the process, content, and impact of this film, which opens in theaters on Oct. 11. \n\nFrom the film description, \"GIFT is a tribute to something that can’t be measured or counted, bought or sold. Exploring the parallels between artists’ work and a gift economy, it’s a reflection on the creative process, the reasons we labour in service of our gifts.\"\n\nGIFT Trailer: https://vimeo.com/283716447\n\nFacebook: https://www.facebook.com/GIFTdocumentary/\n\nInformation on upcoming screenings:\nhttp://www.giftitforwardproject.com/the-film/screenings/ \n\nAlso, check out my book Sacred Economics http://charleseisenstein.org/books/sacred-economics/ and the course, Living in the Gift https://charleseisenstein.org/courses/living-in-the-gift/ to explore this subject in depth.",
            "length": "132625566",
            "sourceUrl": "http://www.podtrac.com/pts/redirect.mp3/feeds.soundcloud.com/stream/692346877-charleseisenstein-robin-mckenna-gift-e40.mp3"
        },
        {
            "title": "Kelly Brogan: Get Real, Get Well, Get Free (E39)",
            "datePublished": "Tue, 17 Sep 2019 22:59:27 +0000",
            "description": "I describe Kelly Brogan as a “renegade psychiatrist” – someone who abandoned a prestigious career “in the system” to become a critic of pharmaceutical psychiatry and an advocate for holistic therapy. She is also a dear friend and ally whom I appreciate for her courage, creativity, and intellect. We covered a lot of ground in this conversation, medical, philosophical, and spiritual. Some of the main themes were: ending the war on pain, reclaiming personal sovereignty in physical and mental health,  the power of “I don’t know,” and the passage to authentic personal and cultural adulthood. We also discuss her powerful new book, Own Your Self (https://amzn.to/32XjBpF).",
            "length": "146992445",
            "sourceUrl": "http://www.podtrac.com/pts/redirect.mp3/feeds.soundcloud.com/stream/682602785-charleseisenstein-kelly-brogan-get-real-get-well-get-free-e39.mp3"
        },
        {
            "title": "Cynthia Jurs: On Synchronicity and Sacrifice (E38)",
            "datePublished": "Fri, 16 Aug 2019 11:25:35 +0000",
            "description": "This conversation with my good friend Cynthia Jurs was originally recorded for my online course, Living in the Gift. It was a meditative, engaging experience with synchronicities that showed up to support the flow of our stories and connection with one another. Truly, it was a lived experience of gift just to be in her presence and allow meaning to unfold, as I hope you will also sense in listening to this slow, deep, and joyful conversation on ideas that are central to synchronicity and sacrifice.\n\nOur conversation weaves together various themes explored in Living in the Gift. To learn more, go here: charleseisenstein.org/gift",
            "length": "157112071",
            "sourceUrl": "http://www.podtrac.com/pts/redirect.mp3/feeds.soundcloud.com/stream/666638366-charleseisenstein-cynthia-jurs-on-synchronicity-and-sacrifice-e38.mp3"
        },
        {
            "title": "Lynne Twist: A Conversation About Living in the Gift (E37)",
            "datePublished": "Thu, 18 Jul 2019 22:23:15 +0000",
            "description": "Lynne Twist is the author of The Soul of Money and co-founder of the Pachamama Alliance. This conversation weaves together various themes explored in my online course, Living in the Gift: https://charleseisenstein.org/gift",
            "length": "144234734",
            "sourceUrl": "http://www.podtrac.com/pts/redirect.mp3/feeds.soundcloud.com/stream/653180639-charleseisenstein-lynne-twist-a-conversation-about-living-in-the-gift-e37.mp3"
        },
        {
            "title": "Helena Norberg-Hodge: Local is the Future (E36)",
            "datePublished": "Fri, 14 Jun 2019 15:37:28 +0000",
            "description": "Helena Norberg-Hodge is a revered elder in the movement seeking alternatives to the present course of economic globalism and cultural homogenization. Her film on Ladakh, Ancient Futures, was a major influence on my work. Here we talk about what is drawing so many people back to the local, back to the land, back to place, and back to a culture of belonging.",
            "length": "177558108",
            "sourceUrl": "http://www.podtrac.com/pts/redirect.mp3/feeds.soundcloud.com/stream/636635439-charleseisenstein-helena-norberg-hodge-local-is-the-future-e36.mp3"
        },
        {
            "title": "Brian Swimme: The Cosmos Watching Itself (E35)",
            "datePublished": "Wed, 03 Apr 2019 14:40:47 +0000",
            "description": "Brian Swimme is a mathematical cosmologist and philosopher. We went really deep in this conversation: the limits of human knowledge, cosmic evolution, science as a road to the sacred, and other speculations. I loved this fun, humorous, and mind-stretching conversation, and had the feeling that together we reached a place that neither could have reached alone.",
            "length": "93758840",
            "sourceUrl": "http://www.podtrac.com/pts/redirect.mp3/feeds.soundcloud.com/stream/600340395-charleseisenstein-brian-swimme.mp3"
        },
        {
            "title": "Daniel Schmachtenberger: Self-terminating Civilization (E34)",
            "datePublished": "Thu, 21 Mar 2019 12:57:04 +0000",
            "description": "Daniel Schmactenberger is a brilliant and innovative technologist and social philosopher. Here he outlines some of the foundations of his worldview as we discuss exponential tech, self-terminating social and technological processes, the future of humanity, the nature of the present crisis, and the necessity of a transition to non-rivalrous systems.",
            "length": "142618686",
            "sourceUrl": "http://www.podtrac.com/pts/redirect.mp3/feeds.soundcloud.com/stream/593498622-charleseisenstein-daniel-schmachtenberger.mp3"
        },
        {
            "title": "Brock Dolman: Eco-spiritual Connections(E33)",
            "datePublished": "Tue, 22 Jan 2019 16:31:00 +0000",
            "description": "Brock Dolman is the founder of Occidental Arts & Ecology in Northern \nCalifornia, one of the first permaculture education centers in North \nAmerica. In this conversation Brock displays a tiny fraction of his \nsavant-level knowledge of ecology, water, soil, trees, and how to engage \nin a healing relationship to our environment. His unorthodox insights, \nespecially relevant in a time of forest fires and extreme weather \nevents, embed scientific reasoning within an ecospiritual aesthetic.",
            "length": "40995159",
            "sourceUrl": "http://www.podtrac.com/pts/redirect.mp3/feeds.soundcloud.com/stream/562971294-charleseisenstein-brock-dolman.mp3"
        },
        {
            "title": "Philip Munyasia: Social & Ecological Healing (E32)",
            "datePublished": "Tue, 30 Oct 2018 22:05:59 +0000",
            "description": "Philip Munyasia is the founder of Otepic, a permaculture/ ecovillage project in Kenya that brings youth from the slums to the land for social and ecological healing. You will Philip's courage, vision, and insight as they shine through in this conversation. He has been for me a key  informant to the question I carry: \"What will it take to heal?\"\n\nYou can make donations to Otepic and send out a powerful ROI  (ripple of impact).",
            "length": "38701915",
            "sourceUrl": "http://www.podtrac.com/pts/redirect.mp3/feeds.soundcloud.com/stream/522362253-charleseisenstein-philip-munyasia.mp3"
        },
        {
            "title": "Orland Bishop - Part 3 (E31)",
            "datePublished": "Wed, 10 Oct 2018 03:01:58 +0000",
            "description": "Orland Bishop is in my eyes a treasure on this earth. In this conversation we talk about the cosmological and geological dimensions of the current evolution of culture and consciousness, along with other topics. Please do avail yourself of the information carried by Orland's words and -- even more -- by his voice.",
            "length": "58736485",
            "sourceUrl": "http://www.podtrac.com/pts/redirect.mp3/feeds.soundcloud.com/stream/512104245-charleseisenstein-orland-bishop-1.mp3"
        },
        {
            "title": "Judith Schwartz: Ecological Healing with Water (E30)",
            "datePublished": "Fri, 17 Aug 2018 00:08:28 +0000",
            "description": "Judith Schwartz is the author of several books, most recently \"Water in Plain Sight.\" She is a leading advocate of what is coming to be known as \"rain for climate\" -- a shift in emphasis toward water as the most important substance in understanding and addressing climate change. We talk about water, soil, and plants, trees and cows, dogmatism, veganism and meat, and other topics.",
            "length": "51594763",
            "sourceUrl": "http://www.podtrac.com/pts/redirect.mp3/feeds.soundcloud.com/stream/486595740-charleseisenstein-judith-schwartz-ecological-healing-with-water-030.mp3"
        },
        {
            "title": "Laura Delano: Sanity in an Insane World (E28)",
            "datePublished": "Wed, 11 Jul 2018 00:00:00 +0000",
            "description": "This conversation explores the contentious subject of the mental health system, through the story of patient advocate Laura Delano. Her journey into being institutionalized and recovering sovereignty over her mind and body has larger significance in our society. Her organization, Inner Compass Initiative, supports those who want to wean themselves off medication -- a formidable task not to be taken lightly.",
            "length": "67303239",
            "sourceUrl": "http://www.podtrac.com/pts/redirect.mp3/feeds.soundcloud.com/stream/470255571-charleseisenstein-laura-delano-sanity-in-an-insane-world.mp3"
        },
        {
            "title": "Orland Bishop - Part 2 (E27)",
            "datePublished": "Sun, 20 May 2018 19:55:22 +0000",
            "description": "Part 2 of Charles' conversation with Orland Bishop.",
            "length": "56986318",
            "sourceUrl": "http://www.podtrac.com/pts/redirect.mp3/feeds.soundcloud.com/stream/446774088-charleseisenstein-orland-bishop-part-2-e27.mp3"
        },
        {
            "title": "Orland Bishop Part 1 (E26)",
            "datePublished": "Fri, 18 May 2018 02:43:34 +0000",
            "description": "Charles Eisenstein in conversation with Orland Bishop",
            "length": "52720797",
            "sourceUrl": "http://www.podtrac.com/pts/redirect.mp3/feeds.soundcloud.com/stream/445649604-charleseisenstein-orland-bishop.mp3"
        },
        {
            "title": "Journey to the Inner Throne (E25)",
            "datePublished": "Tue, 27 Mar 2018 23:35:50 +0000",
            "description": "Eivind Skjellum is the creator of Reclaim your Inner Throne, a training program for men. In this conversation we talk about masculine and feminine archetypes, leadership, elderhood, and stories of transformation in this time when the old story of what a man is and how to be one are dissolving.",
            "length": "33044729",
            "sourceUrl": "http://www.podtrac.com/pts/redirect.mp3/feeds.soundcloud.com/stream/421077240-charleseisenstein-eivind-skjellum.mp3"
        },
        {
            "title": "Land Healing through Young Farmers (E24)",
            "datePublished": "Tue, 20 Mar 2018 15:30:46 +0000",
            "description": "Severine von Tscharner Fleming is a kind of farming savant and a super-dynamic agent of the revolution in agriculture reuniting us with soil, water, and life. She is the founder of the Agrarian Trust, which connects young farmers with land they otherwise couldn't afford. We talked about the evolution of farming, its planetary healing potential, issues of ownership and the commons, and how to bridge our ideals and best practices to present-day economic realities.",
            "length": "20667185",
            "sourceUrl": "http://www.podtrac.com/pts/redirect.mp3/feeds.soundcloud.com/stream/416554419-charleseisenstein-severine-von-tscharner-fleming-e24.mp3"
        },
        {
            "title": "Gigi Coyle (E23)",
            "datePublished": "Wed, 28 Feb 2018 22:25:27 +0000",
            "description": "This conversation with the amazing Gigi Coyle was recorded with a small live audience on a houseboat, where Gigi was recovering from knee surgery. Gigi is a source of valuable wisdom for activists and change agents today; a veteran of 1970's feminist and environmental movements, she has turned to deeper levels of activism. We connected on topics of ritual, surrender to a path, the importance of water, community, ambivalence and paradox, living our songlines, myth as a conveyor of truth, and more. I wish more people would have the chance to learn from Gigi, someone who is, in my eyes, a true elder.",
            "length": "61383128",
            "sourceUrl": "http://www.podtrac.com/pts/redirect.mp3/feeds.soundcloud.com/stream/406716282-charleseisenstein-gigi-coylemp3.mp3"
        },
        {
            "title": "Joanna Harcourt-Smith (E22)",
            "datePublished": "Wed, 23 Aug 2017 22:22:41 +0000",
            "description": "In this episode, Charles talks with author, podcaster, and life-long seeker Joanna Harcourt-Smith.",
            "length": "70860189",
            "sourceUrl": "http://www.podtrac.com/pts/redirect.mp3/feeds.soundcloud.com/stream/339212179-charleseisenstein-joanna-harcourt-smith-e22.mp3"
        },
        {
            "title": "Helena Norberg-Hodge (E21)",
            "datePublished": "Mon, 17 Apr 2017 18:45:38 +0000",
            "description": "This is a conversation with the political thinker and activist Helena Norberg-Hodge. She had a huge radicalizing influence on my political thinking through her film Ancient Futures. By \"radical\" I don't mean the usual leftist politics. Helena is a tireless advocate for re-localization, the reclaiming of the commons, and the importance of direct participation in community. She is deeply insightful in linking these to global issues. Having spent decades in Ladakh, she is also one of the first to integrate traditional and indigenous world-views into a coherent critique of techno-industrial society, finance, and politics. Her work has been a great source of nourishment to me in unfolding a vision of a more beautiful world. I hope you enjoy this conversation we recorded in the fall of 2016 in England.",
            "length": "57578204",
            "sourceUrl": "http://www.podtrac.com/pts/redirect.mp3/feeds.soundcloud.com/stream/318126479-charleseisenstein-helena-norberg-hodge.mp3"
        },
        {
            "title": "An Evening with Satish Kumar (E20)- A New and Ancient Story",
            "datePublished": "Thu, 06 Apr 2017 02:55:02 +0000",
            "description": "Satish Kumar is, in the truest sense of the word, an elder in the peace and ecology movement. To me personally, he is one of those deep allies who confirms that the most radical ideas I work with are not in fact crazy. It was my honor to weave this tapestry of conversation with him. We spoke about gift culture and the natural order; value, values, and the standardization of everything; the perils of over-reliance on metrics; speaking to power and preaching to the converted; gratitude and contentment, and much more.",
            "length": "111974346",
            "sourceUrl": "http://www.podtrac.com/pts/redirect.mp3/feeds.soundcloud.com/stream/316332521-charleseisenstein-an-evening-with-satish-kumar-e20-a-new-and-ancient-story.mp3"
        },
        {
            "title": "A Conversation with Martin Shaw (E19)",
            "datePublished": "Wed, 01 Mar 2017 21:11:27 +0000",
            "description": "Martin Shaw is a mythologist and storyteller from the area of Devon, England. He and I share a deep appreciation for the way myth and story shape the world. Martin starts our conversation with a story about Fox Woman Dreaming that is still with me months later, working inside me. We go on to talk about exile, the nature of magic, stories and relationship, decolonizing the imagination, and lots more. It was a really heady and passionate conversation.",
            "length": "60456697",
            "sourceUrl": "http://www.podtrac.com/pts/redirect.mp3/feeds.soundcloud.com/stream/310211191-charleseisenstein-martin-shaw-naas-19.mp3"
        },
        {
            "title": "Orland Bishop: Word, Gift, and Money (E18) - A New and Ancient Story",
            "datePublished": "Tue, 07 Feb 2017 22:44:02 +0000",
            "description": "This podcast is a public conversation between me and Orland Bishop, recorded in Santos, Brazil. Even though the audio quality isn't perfect, I want to release this recording anyway in hopes of transmitting to you some of what Orland has transmitted to me. He draws from a deep pool of wisdom that is carried not only by his words, but by the voice beneath them. I don't use phrases like \"deep pool of wisdom\" very often, and in this case it is not a cliche. We talk about gift and relationship; the power of word, story, and intention; money and the financial system, and other topics. You might sometimes find Orland hard to understand. That's OK. Just let the words reverberate in you.",
            "length": "47236640",
            "sourceUrl": "http://www.podtrac.com/pts/redirect.mp3/feeds.soundcloud.com/stream/306617649-charleseisenstein-orland-bishop-word-gift-and-money.mp3"
        },
        {
            "title": "Kelly Brogan: Restoring Blunted Consciousness (E17)- A New and Ancient Story",
            "datePublished": "Tue, 13 Dec 2016 23:05:21 +0000",
            "description": "Kelly Brogan is a psychiatrist who made a radical break with pharma-centered orthodoxy to pursue holistic approaches to mental health, with extraordinary results. We recorded a conversation that started with psychiatric drugs and visited many perennial topics: working inside versus outside the system; the importance of community, the blunting of consciousness in our society and the power of grief to restore it; and the recovery of our power as agents of planetary change. I hope you enjoy this deep and playful conversation as much as I did.\n\nNote: Here is the link to Kelly's online program for anyone who is intrigued by what Kelly shares about it in this conversation. http://kellybroganmd.com/vitalmind/",
            "length": "48037386",
            "sourceUrl": "http://www.podtrac.com/pts/redirect.mp3/feeds.soundcloud.com/stream/297785609-charleseisenstein-kelly-brogan-restoring-blunted-consciousness-naas-18.mp3"
        },
        {
            "title": "In Conversation with Rupert Sheldrake (E16)- A New and Ancient Story",
            "datePublished": "Thu, 10 Nov 2016 22:17:11 +0000",
            "description": "This podcast is a recording of a second conversation between me and Rupert Sheldrake, one of my favorite renegade scientists and the number one target of the defenders of scientific orthodoxy. He hardly needs any introduction, but I'll say he is prolific author and researcher with a Ph.D. in Biochemistry from Cambridge University.  I see him as an elder or a pioneer in the liberating of science from its metaphysical dogmas of reductionism and mechanistic materialism, and a true practitioner of the Scientific Method in its original humble spirit. I hope you'll enjoy the intellect and refinement of this man as much as I did.",
            "length": "121978612",
            "sourceUrl": "http://www.podtrac.com/pts/redirect.mp3/feeds.soundcloud.com/stream/292454717-charleseisenstein-in-conversation-with-rupert-sheldrake.mp3"
        },
        {
            "title": "St.JamesTalk",
            "datePublished": "Fri, 07 Oct 2016 19:19:49 +0000",
            "description": "St.JamesTalk by Charles Eisenstein",
            "length": "78267567",
            "sourceUrl": "http://www.podtrac.com/pts/redirect.mp3/feeds.soundcloud.com/stream/286620631-charleseisenstein-st-jamestalk.mp3"
        },
        {
            "title": "The Fertile Ground of Bewilderment (E15) - St. James Church, London - A New and Ancient Story",
            "datePublished": "Fri, 07 Oct 2016 19:18:29 +0000",
            "description": "The Fertile Ground of Bewilderment was the title of a speech I gave at St. James Church in London. I'm sharing it with you all because it was such a high-energy event and I ventured into territory I haven't brought into public speaking before.",
            "length": "78267608",
            "sourceUrl": "http://www.podtrac.com/pts/redirect.mp3/feeds.soundcloud.com/stream/286620440-charleseisenstein-st-james-church-piccadillylondon-10-2016.mp3"
        },
        {
            "title": "Marietta Schürholz: Reinventing Ritual: (E14)A New and Ancient Story",
            "datePublished": "Thu, 23 Jun 2016 02:45:11 +0000",
            "description": "This interview with the filmmaker Marietta Schürholz is on ritual -- a topic about which I've thought a lot and written very little. We tend to think rituals are vestiges of an earlier, more superstitious time, or perhaps elements of indigenous cultures that we need to learn from. We think we live in a society bereft of meaningful rituals. But in fact, we are immersed in rituals that are invisible to us. Medicine, law, and even technology can be understood as a highly elaborated system of ritual, whose legitimacy and efficacy are based on an underlying mythology that tells us what is real and how the world works. As we transition into a new mythology, our old rituals become unsatisfying, and impotent to address the crises of our time.\n\nThis podcast episode originated as an interview for Marietta's film, Reinventing Rituals. You can watch the trailer at www.reinventing-rituals.de. The depth of understanding embodied in her questions, and her wide open heart and vulnerable listening to my responses, makes me think this will be an extraordinary film. If you resonate with our conversation, you might consider donating to her crowdfunding campaign too.",
            "length": "66080807",
            "sourceUrl": "http://www.podtrac.com/pts/redirect.mp3/feeds.soundcloud.com/stream/270430142-charleseisenstein-marietta-schurholz-reinventing-ritual.mp3"
        },
        {
            "title": "Rex Brangwyn: Building Erotic Intelligence (E10) - A New and Ancient Story",
            "datePublished": "Sat, 30 Apr 2016 03:40:15 +0000",
            "description": "This conversation I recorded with Rex Brangwyn was originally part of my online program \"Masculinity: A New Story.\"  The outpouring of gratitude, insight, and stories it provoked from participants has prompted me to share it more widely. You may not agree with everything he says, but he is a sincere explorer who radiates love, compassion, and honesty. If you'd like to access the entire Masculinity: A New Story series, you can do that here: https://newandancientstory.net/learning-journeys/masculinity-a-new-story/",
            "length": "88980583",
            "sourceUrl": "http://www.podtrac.com/pts/redirect.mp3/feeds.soundcloud.com/stream/261607129-charleseisenstein-rex-brangwyn-building-erotic-intelligence-e10-a-new-and-ancient-story.mp3"
        },
        {
            "title": "Eivind Skjellum: Journey through the Archetypes (E13) - A New and Ancient Story",
            "datePublished": "Tue, 05 Apr 2016 02:04:58 +0000",
            "description": "This conversation with the Norwegian men's coach and teacher Eivind Skjellum is a deep and at times raw introduction to an extraordinary transformational map Eivind has created (or, more accurately, that he has discovered). Created for men, I think it has impact on anyone who encounters it. The places he describes carry a profound psychic resonance: the City of Slumber, the Point of No Return, the Meeting with the Mapmaker of the East, the Abyss, the Demon's Feast, the Beauty Path, the Encounter with the Black Knight, and many more. This conversation is part of my online learning journey, Masculinity: A New Story. If you'd like to access the entire series, you can do that here: https://newandancientstory.net/learning-journeys/masculinity-a-new-story/.  ",
            "length": "94348354",
            "sourceUrl": "http://www.podtrac.com/pts/redirect.mp3/feeds.soundcloud.com/stream/257365728-charleseisenstein-eivind-skjellum-the-inner-throne.mp3"
        },
        {
            "title": "Carol Bowman: Three Stories (E12) - A New and Ancient Story",
            "datePublished": "Tue, 01 Mar 2016 00:00:00 +0000",
            "description": "What would you think if your 4-year-old displayed thorough knowledge of WWII aircraft, without having ever been exposed to them? Carol Bowman is a prominent past life researcher who focuses on the past life memories of children. She recounts three extraordinary cases in this conversation, that call into question the conventional brain-dependent understanding of what consciousness is. Because they are so disruptive to basic scientific paradigms, stories like these have long been dismissed as hoaxes, suggestion, confabulation, and so on. Will you also dismiss them out of hand? Or will you entertain the possibility of their authenticity and see where that may lead?",
            "length": "63510717",
            "sourceUrl": "http://www.podtrac.com/pts/redirect.mp3/feeds.soundcloud.com/stream/250738183-charleseisenstein-carolbowman-three-stories.mp3"
        },
        {
            "title": "Lyla June Johnston (E11) - A New and Ancient Story",
            "datePublished": "Wed, 27 Jan 2016 18:51:25 +0000",
            "description": "What are the perils of working \"in the system\" as opposed to trying to change it from the outside? In this multidimensional conversation, Lyla and I expand and perhaps transcend that question. We weave together topics as seemingly divergent as Peak Oil, recovering dying languages, the \"emperor's new clothes\" syndrome, and the importance of small, barely visible actions that contradict what is normal or realistic. The poetry and insight of this young woman is not to be missed.",
            "length": "69214192",
            "sourceUrl": "http://www.podtrac.com/pts/redirect.mp3/feeds.soundcloud.com/stream/244088082-charleseisenstein-lyla-june-johnstone.mp3"
        },
        {
            "title": "Cynthia's Kiva Part 2 (E09) - A New and Ancient Story",
            "datePublished": "Thu, 10 Dec 2015 00:00:00 +0000",
            "description": "This podcast was recorded in late November 2015 at Cynthia Jurs' \"kiva\" in Santa Fe, New Mexico. Originally meant to be a recorded discussion between Charles and David Abram (philosopher/author of The Spell of the Sensuous andBecoming Animal), what arose was a round-table discussion with all of the participants (listed below). We divided the conversation into two, one-hour segments:\n\nPart I touches on many different topics including: urgency and scarcity; biological determinism; eros, compassion, and beauty; intellectual and academic silos; our cultural legacy for future generations; complexity and simplicity; human-generated meaning vs. received meaning, and the importance of reclaiming language.\n\nPart II is a multi-faceted discussion on the topic of indigineity, the imposition of the written word on oral culture, as well as a discussion on the metaphysics of separation.\n\nParticipants include (other than Charles):\nCynthia Jurs, David Abram, Pat McCabe (Woman Stands Shining), Lyla June Johnson, David Bacon, Elizabeth Christine, Michelle Victoria, Joanna Harcourt Smith, Jose Luis Gomez Solar, and Hugh Wheir\n\nYou can join our community or subscribe to the podcast on NewandAncientStory.net.\n",
            "length": "128505800",
            "sourceUrl": "http://www.podtrac.com/pts/redirect.mp3/feeds.soundcloud.com/stream/237708517-charleseisenstein-e09-part2-a-new-and-ancient-story.mp3"
        },
        {
            "title": "Cynthia's Kiva Part 1 (E09) - A New and Ancient Story",
            "datePublished": "Sun, 06 Dec 2015 00:00:00 +0000",
            "description": "This podcast was recorded in late November 2015 at Cynthia Jurs' \"kiva\" in Santa Fe, New Mexico. Originally meant to be a recorded discussion between Charles and David Abram (philosopher/author of The Spell of the Sensuous andBecoming Animal), what arose was a round-table discussion with all of the participants (listed below). We divided the conversation into two, one-hour segments: \n\nPart I touches on many different topics including: urgency and scarcity; biological determinism; eros, compassion, and beauty; intellectual and academic silos; our cultural legacy for future generations; complexity and simplicity; human-generated meaning vs. received meaning, and the importance of reclaiming language.  \n\nPart II is a multi-faceted discussion on the topic of indigineity, the imposition of the written word on oral culture, as well as a discussion on the metaphysics of separation.\n\nParticipants include (other than Charles): \nCynthia Jurs, David Abram, Pat McCabe (Woman Stands Shining), Lyla June Johnson, David Bacon, Elizabeth Christine, Michelle Victoria, Joanna Harcourt Smith, Jose Luis Gomez Solar, and Hugh Wheir\n\nYou can join our community or subscribe to the podcast on NewandAncientStory.net.",
            "length": "142802094",
            "sourceUrl": "http://www.podtrac.com/pts/redirect.mp3/feeds.soundcloud.com/stream/236989451-charleseisenstein-e09-a-new-and-ancient-story.mp3"
        },
        {
            "title": "Seppi's Place (E08) - A New and Ancient Story",
            "datePublished": "Mon, 30 Nov 2015 00:00:00 +0000",
            "description": "Here is a conversation with a group gathered for Charles' birthday at \"Seppi's Place,\" which is kind of a new story waystation for people, especially young people, to develop in ways that society's institutions don't support. We envision a network of such places developing around the country and around the world; permaculture centers, coworking spaces, social enterprise incubators, places of healing, art, and music... places to start walking a different path.\nFind out more about Seppi's Place: seppisplace.com\nJoin Our Community: newandancientstory.net",
            "length": "158300021",
            "sourceUrl": "http://www.podtrac.com/pts/redirect.mp3/feeds.soundcloud.com/stream/235925788-charleseisenstein-seppis-place-final.mp3"
        },
        {
            "title": "The Crisis of Science (E07) - A New and Ancient Story",
            "datePublished": "Wed, 11 Nov 2015 00:00:00 +0000",
            "description": "Rupert Sheldrake is one of the most thoughtful, lucid people I have ever met. In this conversation we talk about the foundations of science, both as an institution and as a path to knowledge. Like all the institutions of modernity, science faces a crisis that is increasingly recognized within science itself. Part of it is the \"replicability crisis,\" but as Rupert and I discuss, that is but a gateway into deeper epistemological and metaphysical problems. \n\nRupert Sheldrake, a biologist and author, is best known for his hypothesis of morphic fields and morphic resonance, which leads to a vision of a living, developing universe with its own inherent memory. Find out more on his website: http://www.sheldrake.org/\n\nJoin our community: www.newandancientstory.net",
            "length": "159234159",
            "sourceUrl": "http://www.podtrac.com/pts/redirect.mp3/feeds.soundcloud.com/stream/233514436-charleseisenstein-the-crisis-of-science-e06-a-new-and-ancient-story.mp3"
        },
        {
            "title": "Healing with Nature (E06) - A New And Ancient Story",
            "datePublished": "Thu, 29 Oct 2015 00:00:00 +0000",
            "description": "Charles speaks with Brown Koroskenyi and Pamela Lyness of the Avatar Centre, an experimental community in the Amazon dedicated to recovering knowledge of how to live harmoniously with the land. Of course, we needn't go to the Amazon to do this, but each place on earth has its own unique medicine. What are the gifts of the Amazon, when we no longer seek to strip it of the wealth we call \"natural resources\"?\n\nJoin Our community: www.newandancientstory.net\nAvatar Centre's website: www.avatarcentre.com\nAvatar Centre's Facebook: www.facebook.com/theavatarcentre\n",
            "length": "159105640",
            "sourceUrl": "http://www.podtrac.com/pts/redirect.mp3/feeds.soundcloud.com/stream/231400225-charleseisenstein-healing-with-nature-a-new-and-ancient-story.mp3"
        },
        {
            "title": "A Story of Gratitude (E05) - A New And Ancient Story",
            "datePublished": "Sun, 18 Oct 2015 00:00:00 +0000",
            "description": "Charles speaks with life coaching legend Julio Olalla about the power of gratitude, and more generally, the role of story and perception in forming the ground from which actions arise. Julio shares an amazing story of synchronicity and gratitude that also hints at the world-changing effects of choices that, in the moment, might seem insignificant. \n\n\"The fact that we have stopped listening to the universe and nature has created in us an age of solitude, because there are no other voices, only human voices.\" - Julio Olalla\n\n\"When anybody is in gratitude, every perception is different and every response to a situation is different. It colors your whole world. And the things that we try so hard to achieve become either irrelevant or effortless.\" - Charles Eisenstein\n\nJulio Olalla, founder and president of The Newfield Network, is a master at generating learning environments that establish the trust, safety, respect, and well-being that accelerate the potential for new thinking and action.\nJulio's website: http://www.newfieldnetwork.com/New3/Home/index.cfm",
            "length": "163245523",
            "sourceUrl": "http://www.podtrac.com/pts/redirect.mp3/feeds.soundcloud.com/stream/229294003-charleseisenstein-julio-olalla-a-new-and-ancient-story.mp3"
        },
        {
            "title": "Deep Wealth and Transformation (E03) - A New and Ancient Story",
            "datePublished": "Tue, 22 Sep 2015 00:00:00 +0000",
            "description": "A conversation with Chris Martenson, creator of the Crash Course, who like I have has moved beyond (way beyond) economics to explore systems change and narrative change. We talk about real wealth and fake wealth, community, technology, healing, and the impossible. A deep dive!",
            "length": "150694208",
            "sourceUrl": "http://www.podtrac.com/pts/redirect.mp3/feeds.soundcloud.com/stream/226104807-charleseisenstein-deep-wealth-and-transformation-description-e03.mp3"
        },
        {
            "title": "Synchronicty and the Impossible (E02) - A New and Ancient Story",
            "datePublished": "Wed, 09 Sep 2015 00:00:00 +0000",
            "description": "A conversation between Charles and Amy Lansky, a computer scientist and NASA researcher who was propelled down the road less traveled through her son's autism and its subsequent \"impossible\" cure. We talk about radicalization, skepticism, and gateways to synchronicity.",
            "length": "182647188",
            "sourceUrl": "http://www.podtrac.com/pts/redirect.mp3/feeds.soundcloud.com/stream/224141253-charleseisenstein-synchronicty-and-the-impossible-e03.mp3"
        },
        {
            "title": "Changing the Story with Kindness (E01) - A New and Ancient Story",
            "datePublished": "Sun, 06 Sep 2015 18:18:29 +0000",
            "description": "This is a podcast featuring a discussion between Charles Eisenstein and Nipun Mehta, the founder of Service Space, on kindness and generosity, non-monetary wealth, and how even small, simple acts of kindness alter the fabric of our world to have potentially enormous social and political consequences.",
            "length": "133082453",
            "sourceUrl": "http://www.podtrac.com/pts/redirect.mp3/feeds.soundcloud.com/stream/222635420-charleseisenstein-new-and-ancient-story-nipun-mehta.mp3"
        },
        {
            "title": "Of Grief and Reverence (E04) - A New and Ancient Story",
            "datePublished": "Tue, 04 Aug 2015 00:00:00 +0000",
            "description": "Charles talks with Francis Weller about grief as a gateway to joy, to reverence, and to community, and the power of public grief to bring healing on a personal, community, and political level.\r\n\r\nJoin our community: www.newandancientstory.net\r\nFrancis Weller's organization: www.wisdombridge.net",
            "length": "150462241",
            "sourceUrl": "http://www.podtrac.com/pts/redirect.mp3/feeds.soundcloud.com/stream/227433683-charleseisenstein-francis-weller-e04.mp3"
        },
        {
            "title": "Reconnecting to the Strength We Have: Maria Scordialos (E00) A New and Ancient Story",
            "datePublished": "Fri, 03 Jul 2015 22:25:38 +0000",
            "description": "This is a conversation with Maria Scordialos, an activist in Greece. We talk about the referendum, the solidarity economy, the role of fear in politics, the economics and politics of debt, and the revolutionary potential of authenticity in leaders. This is our first recorded podcast, and the sound quality is poor. Please excuse our learning curve.",
            "length": "20727068",
            "sourceUrl": "http://www.podtrac.com/pts/redirect.mp3/feeds.soundcloud.com/stream/213159854-charleseisenstein-reconnecting_to_the_strength.m4a"
        }
    ]
}