{
    "artwork": "http://is4.mzstatic.com/image/thumb/Music6/v4/00/83/44/008344f6-7d9f-2031-39c1-107020839411/source/100x100bb.jpg",
    "description": "Welcome!  On this site you’ll find downloadable podcasts from the Fall 2010 Shamatha Retreat led by B. Alan Wallace in Phuket, Thailand.  Follow along with the retreat as Wallace gives daily meditation instructions to help one cultivate attention and awareness as well as the qualities of love, compassion, joy and equanimity.",
    "feedURL": "http://feeds.feedburner.com/AlanWallaceFall2010",
    "podcastURL": "http://podcasts.sbinstitute.com/fall2010/Phuket_Fall_2010_Archive/Podcast/Podcast.html",
    "publisher": "jessicamdennison@gmail.com",
    "title": "Alan Wallace Shamatha Teachings Fall 2010",
    "episodes": [
        {
            "title": "Session 92: (Discussion Only) A Final Teaching, and an Expression of Gratitude to Our Teacher",
            "datePublished": "Thu, 30 Dec 2010 12:30:34 -0800",
            "description": "Alan offers final words and we tearfully say goodbye.  The session ends with a big group hug.",
            "length": "31441245",
            "sourceUrl": "http://podcasts.sbinstitute.com/fall2010/Phuket_Fall_2010_Archive/Media/92%20November%2010%20Evening%20.m4a"
        },
        {
            "title": "Session 91: (Discussion Only) Bringing Good Motivation into Daily Life",
            "datePublished": "Thu, 30 Dec 2010 12:21:14 -0800",
            "description": "Alan encourages us not to be discouraged when life dishes up difficult situations, and instead to bring our best motivation to daily life.",
            "length": "17567588",
            "sourceUrl": "http://podcasts.sbinstitute.com/fall2010/Phuket_Fall_2010_Archive/Media/91%20November%2010%20Morning%20.m4a"
        },
        {
            "title": "Session 90: (Discussion Only) Letting Our Minds Become Dharma",
            "datePublished": "Thu, 30 Dec 2010 12:15:55 -0800",
            "description": "Alan discusses bringing wholesome intentions into our daily lives as a way of letting our minds become dharma.  Though we will continue to be mentally afflicted, if we can see our mental afflictions for what they are, we will be able to act on them less and less.",
            "length": "16350292",
            "sourceUrl": "http://podcasts.sbinstitute.com/fall2010/Phuket_Fall_2010_Archive/Media/90%20November%209%20Morning.m4a"
        },
        {
            "title": "Session 89: (Discussion Only) Envisioning the Future You Would Love to Live",
            "datePublished": "Tue, 7 Dec 2010 22:09:08 -0800",
            "description": "Alan talks about envisioning something new for ourselves as we go back into situations that feel old and familiar.<br/><br/>",
            "length": "26810894",
            "sourceUrl": "http://podcasts.sbinstitute.com/fall2010/Phuket_Fall_2010_Archive/Media/89%20November%208%20Evening.m4a"
        },
        {
            "title": "Session 88: (Discussion Only) Genuine Happiness in Everyday Life",
            "datePublished": "Tue, 7 Dec 2010 21:17:54 -0800",
            "description": "As we anticipate the end of retreat, Alan mentions that the effects of retreat will not be lost as we go out and engage with the world.  Genuine happiness can certainly arise outside of a retreat, as we go out into the world and lead an ethical way of life.  ",
            "length": "14767122",
            "sourceUrl": "http://podcasts.sbinstitute.com/fall2010/Phuket_Fall_2010_Archive/Media/88%20November%208%20Morning%20.m4a"
        },
        {
            "title": "Session 87: (Discussion Only) Balancing Discipline and Gentleness and a Q&A Session",
            "datePublished": "Tue, 7 Dec 2010 21:12:05 -0800",
            "description": "In this talk, Alan encourages us to continue our practice in a spirit of loving-kindness for ourselves.  He then answers questions about Arhats, colors of traditional monastic robes, and oracle to the Dalai Lama, Khandro La.",
            "length": "28180592",
            "sourceUrl": "http://podcasts.sbinstitute.com/fall2010/Phuket_Fall_2010_Archive/Media/87%20November%206%20Evening%20LK.m4a"
        },
        {
            "title": "Session 86: (Discussion Only) Possible Effects of Shamatha on Cognitive Deterioration\r",
            "datePublished": "Fri, 19 Nov 2010 00:29:35 -0800",
            "description": "Alan offers some brief remarks on the 5 Dhana factors, as well some of the possible implications of Buddhist mindfulness on memory loss associated with aging.  This is followed by a silent meditation.<br/>",
            "length": "12010104",
            "sourceUrl": "http://podcasts.sbinstitute.com/fall2010/Phuket_Fall_2010_Archive/Media/86%20November%206%20Morning%20MB.m4a"
        },
        {
            "title": "Session 85: (Discussion only) The Four Immeasurables Keeping Tabs on Each Other\r",
            "datePublished": "Fri, 19 Nov 2010 00:29:32 -0800",
            "description": "This time Alan gave us advice on how to maintain protection from imbalances once we engage in daily life activities and that is becoming more and more familiar with the practices of the Four Immeasurables regarding them as our 4 best friends. We should know that whatever situation comes up there is a chance to practice.  He shared a marvelous metaphor of 4 mighty horses (Four Immeasurables) pulling the chariot leading to awakening and when one of the horses falls stray there is always another one who helps bringing balance to the one that went off track into a false facsimile. The session continued with a free meditation, and ended with 5 very interesting questions and answers.<br/>",
            "length": "38992465",
            "sourceUrl": "http://podcasts.sbinstitute.com/fall2010/Phuket_Fall_2010_Archive/Media/85%20November%205%20Evening%20EQ.m4a"
        },
        {
            "title": "Session 84: (Discussion Only) Some Brief Remarks on Selecting Your Shamatha Practice\r",
            "datePublished": "Fri, 19 Nov 2010 00:29:29 -0800",
            "description": "Alan offers some brief remarks on choosing which practice we’d like to engage in during these silent meditations.  This is followed by an unguided 24 minute Gatika.<br/>",
            "length": "10875220",
            "sourceUrl": "http://podcasts.sbinstitute.com/fall2010/Phuket_Fall_2010_Archive/Media/84%20November%205%20Morning%20.m4a"
        },
        {
            "title": "Session 83: Equanimity and a Great Encompassment of our Practices",
            "datePublished": "Fri, 19 Nov 2010 00:29:26 -0800",
            "description": "On this, the last night of led practice for this retreat, Alan first teaches on how the cultivation of shamatha and the four immeasurables are profoundly inter-related. With shamatha, we withdraw inwards, away from our ordinary identification with the limitations of our physical embodiment and our coarse psyche. Then with the four immeasurables, we expand outwards to identify with all beings. While leading the meditation on equanimity, we are guided briefly through all modes of shamatha and then into the practice of tonglen. Following the practice, Alan speaks at length about benign spirit possession and about the state oracle for the Tibetan government. <br/>",
            "length": "42216123",
            "sourceUrl": "http://podcasts.sbinstitute.com/fall2010/Phuket_Fall_2010_Archive/Media/83%20November%204%20Evening%20EQ.m4a"
        },
        {
            "title": "Session 82: Awareness of Awareness, Shamatha That Can Assist at the Moment of Death\r",
            "datePublished": "Fri, 19 Nov 2010 00:29:24 -0800",
            "description": "This morning we had the last guided Shamatha meditation. Alan explained how in this transient world in which all things that are born have to die, we can tap into the substrate consciousness and even though it is also impermanent in the sense that it changes moment by moment, it is a continuum that carries from one life to the next. It is present even during deep dreamless sleep, comatose and general anesthesia and that’s the reason that we can wake up again. When dying, if you have achieved Shamatha you can follow the process. After the black out if you have Shamatha it will be luminous, then your substrate consciousness dissolves into the clear light of death and you get access to Rigpa. When resting in the clear light there are physical signs that have been witnessed by medical doctors several times, even though the breathing and heart beating has stopped, there is no decomposition of the body, the skin is fresh and the area of the heart remains warm.<br/>Then we practiced awareness of awareness directing our attention to the space in different directions.<br/>",
            "length": "25098292",
            "sourceUrl": "http://podcasts.sbinstitute.com/fall2010/Phuket_Fall_2010_Archive/Media/82%20November%204%20Morning%20AOA.m4a"
        },
        {
            "title": "Session 81: Going Outward with Equanimity\r",
            "datePublished": "Fri, 19 Nov 2010 00:29:21 -0800",
            "description": "Equanimity is understood as a sense of composure in engaging with life situations and persons as well as even heartedness.  Is an attitude transformation that gives you freedom. Since you conceptually designate, you can change the designation and there lies the power to be totally present, engaged, without grasping. Fully alive, revolutionary! It’s possible since we never leap outside the space of our minds. We then meditated on Equanimity.<br/>Suggested that we read the Patience or Fortitude chapter from Shantideva’s “Way of the Bodhisattva” for the occasions when you are mistreated. Be decent. Sprinkle kindness al around you. Wish well to strangers. That’s totally without attachment. There are no Buddhas without patience!.<br/>Then Alan spoke on Dzogchen, the spirit of emergence, subjective experiences, the role of information and Prana.<br/>",
            "length": "37243954",
            "sourceUrl": "http://podcasts.sbinstitute.com/fall2010/Phuket_Fall_2010_Archive/Media/81%20November%203%20Evening%20EQ.m4a"
        },
        {
            "title": "Session 80: Awareness of Awareness and Potentially the Last Soap Box Speech on Materialism\r",
            "datePublished": "Fri, 19 Nov 2010 00:29:18 -0800",
            "description": "This morning Alan took another stab at modern scientific reductionism – the tendency to reduce everything to an objective, solid reality, independent of an observer.  He cited William James’ experience at Harvard Medical School in the 1860s to show that the idea of the brain being the agent – the source of consciousness- actually pre-dated any significant discoveries about the brain and its functions.  All along, however, there have been people like William James himself and the entire Buddhist tradition who have claimed that the brain constricts consciousness rather than being its source.  This is where Buddhism and modern scientific reductionism clash.  According to Buddhist contemplatives and some modern thinkers who are being successfully ignored – in the mind-brain relationship, it is the mind (experience), not the brain (matter) that is primary and not vice versa. We then proceeded to investigate for ourselves, who does what in our own contemplative laboratories.<br/>",
            "length": "21289059",
            "sourceUrl": "http://podcasts.sbinstitute.com/fall2010/Phuket_Fall_2010_Archive/Media/80%20November%203%20Morning%20AOA.m4a"
        },
        {
            "title": "Session 79: Happy Gratitude and Empathetic Joy\r",
            "datePublished": "Fri, 19 Nov 2010 00:29:14 -0800",
            "description": "Alan begins this session with an inspirational story about one of his foremost teachers, Geshe Rabten.  This humble lama, who had completed years of scholarly work and consultation studies with the Dalai Lama, found true contentment in life as he meditated under a simple rock shelf. His dedication to this single pointed purpose demonstrates a shining example of loving-kindness as a practice.  “Dharma”, Alan says, ”is Bodhicitta. We must meditate on it, cultivate it, and then allow it to flow through us.”  This is the dance between the Four Immeasurables and Shamatha practice.  Their integration will facilitate us on our path to liberation: “Shamatha is in the service of the Four Immeasurables.”<br/><br/>",
            "length": "38048887",
            "sourceUrl": "http://podcasts.sbinstitute.com/fall2010/Phuket_Fall_2010_Archive/Media/79%20November%202%20Evening%20EJ.m4a"
        },
        {
            "title": "Session 78: Deactivating the Coarse Mind with Awareness of Awareness\r",
            "datePublished": "Fri, 19 Nov 2010 00:29:11 -0800",
            "description": "Today we take an excursion into our experienced sense of being the observer and probe inward to investigate. <br/><br/>The practice - awareness of awareness – deactivates the coarse mind, the mind with which we identify.   We do our best to do the practice from the vantage point of the substrate.  Practiced correctly, shamatha will rise up to meet us.  <br/><br/>“Our practice here is softening [us] up for vipashyana.”  Likewise with all the practices along the path, each prepares us for the next.<br/><br/>“Let Buddha-hood rise up to meet you.”<br/>",
            "length": "15229072",
            "sourceUrl": "http://podcasts.sbinstitute.com/fall2010/Phuket_Fall_2010_Archive/Media/78%20November%202%20Morning%20AOA.m4a"
        },
        {
            "title": "Session 77: Empathetic Joy and Sacred Tension\r",
            "datePublished": "Fri, 19 Nov 2010 00:29:09 -0800",
            "description": "In the Theravada context, cultivating Empathetic Joy (Mudita) is cultivating an emotion.  There is so much to take delight in!  This will add yeast to life regardless of one’s world view.  When we get away from the retreat center we can really practice!<br/>In the Mahayana context, the practice is cultivating an aspiration, not an emotion.  “Why couldn’t we all be free from suffering, why not?”  If we don’t terminate after death, the Mahayana prayer takes on greater relevance.  Only from the perspective of rigpa does the prayer take on significance:  “I shall see that we all never become separated from happiness”.   Alan uses the term, “sacred tension” to define the balance between the wish to be of service and the wish to attend to one’s own enlightenment.<br/>The question and answer time included:  Are the lamas lying when they say they have no realizations?  Is it better to be vegetarian?  Alan shared some personal stories about the lovable qualities of some of his teachers.<br/>",
            "length": "40635988",
            "sourceUrl": "http://podcasts.sbinstitute.com/fall2010/Phuket_Fall_2010_Archive/Media/77%20November%201%20Evening%20EJ.m4a"
        },
        {
            "title": "Session 76: A Clarification of Buddhist Mindfulness and Awareness of Awareness Practice\r",
            "datePublished": "Fri, 19 Nov 2010 00:29:06 -0800",
            "description": "There are some terms we shouldn’t misunderstand, because if we do, we can waste a lot of time of practice. Alan gave an explanation of such terms: mindfulness, open presence, Rigpa, according to the Buddhist and non-Buddhist perspective in order for us to see the difference.  <br/><br/>After his brief lecture, this morning we came back into the first method of Awareness of Awareness (4th cycle), where we simply rest in the experience of being aware; a second part of the session followed by oscillating the awareness out into space, and inwards, inverting awareness into awareness itself, sustaining the flow of knowing.<br/>",
            "length": "24462710",
            "sourceUrl": "http://podcasts.sbinstitute.com/fall2010/Phuket_Fall_2010_Archive/Media/76%20November%201%20Morning%20AOA.m4a"
        },
        {
            "title": "Session 75: Compassion Practice and the Urge to Become\r",
            "datePublished": "Fri, 19 Nov 2010 00:29:03 -0800",
            "description": "The deepest level of suffering is caused by the three poisons, particularly the grasping to “I am.” While the “message of modernity” is that suffering is inescapable during life, Buddha’s message is that suffering will in fact cease if we attend to its source.   To do this we must face our self-grasping.   Lucid dreaming is the closest analogy to abandoning the ignorance of self-grasping.   <br/>You may feel a recurrent pressure during this retreat, as if something is holding you back.  This is a good sign!  It means you are waking up from ignorance.  Shamatha pulls off the layers, forcing us to face the clinging to “me,” the “urge to become,” and to our brand new Honda (Alan’s story is quite funny).<br/>Food suggestions and headache remedies:  Alan recommends books on Tibetan medicine, “Healing from the Source” (Dhonden) and “The Quintessence Tantras of Tibetan Medicine” (Barry).   Alan also discusses a question regarding Shamatha experience within the Dzogchen view.<br/>",
            "length": "37537218",
            "sourceUrl": "http://podcasts.sbinstitute.com/fall2010/Phuket_Fall_2010_Archive/Media/75%20October%2030%20Evening%20COM.m4a"
        },
        {
            "title": "Session 74: Attending to the Space of the Mind, and a Discussion of Dharmadatu and Dharmata\r",
            "datePublished": "Fri, 19 Nov 2010 00:29:00 -0800",
            "description": "In the intro, Alan explained the difference between the space of the mind with its 6 fields of experience (dharmadatu) and ultimate reality, nirvana, emptiness, absolute space of phenomena (dharmata).  Like Dudjom Rimpoche said: dharmakaya it’s the nature of your own mind. He goes from that and when he talks about open presence, “if excitation arises, then loosen up, if laxity arises, then focus more clearly”. So, within Dzogchen is it possible to take emptiness (sunyata, dharmata), as the object of your Shamatha meditation? The answer is yes, it is hard (you are taking nirvana as your object of meditation), but it is possible. But with the meditation in emptiness you can also achieve relaxation, stability and vividness. All the space between thoughts can be called, in this case, rigpa.<br/>",
            "length": "24690537",
            "sourceUrl": "http://podcasts.sbinstitute.com/fall2010/Phuket_Fall_2010_Archive/Media/74%20October%2030%20Morning%20SM.m4a"
        },
        {
            "title": "Session 73: The Five Obscurations Applied in Education and a Practice in Compassion\r",
            "datePublished": "Fri, 19 Nov 2010 00:28:56 -0800",
            "description": "Once more Alan gave us magnificent reflections about the 5 obscurations, which are responsible for the suffering of change. On this occasion he referred to these obscurations from a universal perspective imagining how it would be like to have an educational system where students could receive specific teachings supporting them in overcoming those obstacles. He pointed out that when we throw away the 5 obscurations then our inner resources can manifest. Alan continued with a meditation session and ended with Q&amp;A. The first one regarding purification practices, and how can we know if we have purified. Then a question about the meaning of the colors of his shawl. And the last one about his impressions upon the realizations and achievements or lack of them of shamatha, vipashyana and so forth of Tulkus and Rinpoches.<br/><br/>",
            "length": "39764995",
            "sourceUrl": "http://podcasts.sbinstitute.com/fall2010/Phuket_Fall_2010_Archive/Media/73%20October%2029%20Evening%20COM.m4a"
        },
        {
            "title": "Session 72: Settling the Mind and Applying No Antidotes\r",
            "datePublished": "Fri, 19 Nov 2010 00:28:54 -0800",
            "description": "Good Morning to All Shamatha Minded Sentient Beings,<br/>This morning Alan went into more detail on settling the mind in its natural state. He opened with a quote from Dujom Rinpoche. “Whatever comes up in the mind don’t apply any antidote.” ( while doing Settling the Mind in its Natural State). He also talked about having confidence in oneself and having a balanced mind. We reviewed the 5 Obscurations and the antidotes for them. And then, how being present, relaxation, and looseness are essential for a sense of well being during meditation. At the end, he cleared up an analogy he had told about the maras that he was concerned was misleading. <br/>Alan’s closing is “Enjoy Your Day”!<br/>Darlene<br/><br/>",
            "length": "19380565",
            "sourceUrl": "http://podcasts.sbinstitute.com/fall2010/Phuket_Fall_2010_Archive/Media/72%20October%2029%20Morning%20SM.m4a"
        },
        {
            "title": "Session 71: Compassion and the Possibility of Ending Suffering in this Life\r",
            "datePublished": "Fri, 19 Nov 2010 00:28:51 -0800",
            "description": "This evening we return to compassion, with a focus on how Buddhism runs against the grain of modernity in terms of its approach to suffering. We can achieve lasting and total freedom from suffering while still alive; we don’t have to wait for death to bring salvation (as in modern mainstream Christianity), or total annihilation (as in the materialistic, neurocentric view of mind). Then, following the meditation session, Alan answers questions concerning ‘settling the mind in its natural state,’ how to find the right balance between mindfulness and introspection, and how to scientifically obliterate the neurocentric view once and for all.<br/><br/>",
            "length": "39999562",
            "sourceUrl": "http://podcasts.sbinstitute.com/fall2010/Phuket_Fall_2010_Archive/Media/71%20October%2028%20Evening%20COM.m4a"
        },
        {
            "title": "Session 70: Settling the Mind and Being a Student of Buddhism\r",
            "datePublished": "Thu, 18 Nov 2010 15:52:29 -0800",
            "description": "This morning we began the cycle of Settling the Mind in its Natural state following the instructions that the Buddha gave to Bahia “In the seen let just the seen be…” “In the heard let just the heard be”,” In the mentally perceived let just be the mentally perceived…” So we don’t elaborate or label. We suspend judgment as if you are listening to a fascinating person or are seeing other people’s mind.  Reality is speaking to you.  Bare, naked.  Alan mentioned that the quintessential instruction is to do it without distraction, without grasping. This is a practice without inquiry.<br/>We meditated on the visual, auditory, tactile and mental fields.<br/>Then he explained Aryadeva’s qualities to be a Buddhist: First: Perception, including hearing, thinking and meditation. Second: Open mind and Third, Yearning to test the practices on oneself.<br/>",
            "length": "23392864",
            "sourceUrl": "http://podcasts.sbinstitute.com/fall2010/Phuket_Fall_2010_Archive/Media/70%20October%2028%20Morning%20SM.m4a"
        },
        {
            "title": "Session 69: Loving-Kindness Practice Drawing From the Theravada, Mahayana and Vajrayana Traditions.\r\r",
            "datePublished": "Thu, 18 Nov 2010 15:52:26 -0800",
            "description": "Alan starts by mentioning that within all physical and mental impermanence, what remains always constant is a person that wants to be happy, loved and smiled back to. The Bodhisattva is a friend of the world! You can practice without having to believe anything; from the Theravada tradition softly sending Loving-Kindness to all; from the Mahayana view expanding the Loving-Kindness until you feel responsible for alleviating the suffering of all beings or, from the Vajrayana tradition, generating yourself as Avalokiteshvara, breathing in all the blessings in the form of light coming from all the Buddhas of the three times and 10 directions, then generating a “super nova” wave of loving kindness that encompasses all mother sentient beings.<br/><br/>",
            "length": "38202359",
            "sourceUrl": "http://podcasts.sbinstitute.com/fall2010/Phuket_Fall_2010_Archive/Media/69%20October%2027%20Evening%20LK.m4a"
        },
        {
            "title": "Session 68: The Build-up to Mindfulness of Breathing (Apertures of the Nostrils)\r",
            "datePublished": "Thu, 18 Nov 2010 15:52:22 -0800",
            "description": "This morning Alan used the Russian-dolls imagery (the dolls that stuck within each other) as his mold.  First, he applied it to our mindfulness of breathing practice.  Settling the body, speech, and mind are all contained within one another.  The mind is at rest when the inner voice is quiet.  The inner voice is quiet when the respiration is flowing unobstructed, not forced and unconstricted within a properly aligned body, which is relaxed, still, and yet in a posture of vigilance.   We then use our introspection to check on the body, respiration and the mind to see if all them are in their natural states.<br/>Alan then applied the Russian-dolls metaphor to Buddhism in general.  Just as a larger doll cannot fit into a smaller one, so the various philosophies of Buddhism gradually build up on one another.  Hinayana is encompassed within Mahayana.  Mahayana is included within Vajrayana and Vajrayana (and all others) are contained within Dzogchen – The Great Encompassment.  Oh, yes…and his favorite – Science makes sense within the context of the Buddhist tradition.  However, reverse the gradation and we end up with a whole lot of conflicts and nonsense.<br/>Before we entered the meditation Alan expressed his disgruntledness with people who might pick any school of Buddhism, chop off what doesn’t fit into their worldview and call themselves “secular Buddhists”.<br/>",
            "length": "14911888",
            "sourceUrl": "http://podcasts.sbinstitute.com/fall2010/Phuket_Fall_2010_Archive/Media/68%20October%2027%20Morning%20MB.m4a"
        },
        {
            "title": "Session 67: Loving Kindness and Achieving a State of “Not Going” (Nirvana)\r",
            "datePublished": "Thu, 18 Nov 2010 15:52:17 -0800",
            "description": "Once again cultivating loving kindness through the practice of Tonglen, Alan advises to start with ourselves as we concentrate on our own merit and then move outwards to others.  As we continue through the practice focusing on loved ones, then neutral persons and finally those with whom we have difficulty, we are really starting the practice where we will end.  The ultimate goal is to breakdown all barriers.  This meditation is a flow of benevolence for others and ourselves.  Listen further for an explanation and a new understanding of Nirvana.<br/><br/>",
            "length": "38858745",
            "sourceUrl": "http://podcasts.sbinstitute.com/fall2010/Phuket_Fall_2010_Archive/Media/67%20October%2026%20Evening%20LK.m4a"
        },
        {
            "title": "Session 66: Refining Mindfulness of Breathing with Stability\r",
            "datePublished": "Thu, 18 Nov 2010 15:52:12 -0800",
            "description": "“So with the man who has daily inured himself to habits of concentrated attention, energetic volition, and self-denial in unnecessary things.  He will stand like a tower when everything rocks around him, and his softer fellow-mortals are winnowed like chaff in the blast.”1<br/><br/>In this short talk Alan gives these succinct instructions; “Have your concentration tight enough that there is not space for thoughts to take hold… Don’t give involuntary thoughts an inch.”  He also discusses how to count the breath, rumination, and three sorts of thinking with a not-to-be-missed dog and newspaper analogy.<br/><br/>1 James, W. (1899). Talks to teachers on psychology: And to students on some of life's ideals. New York: Henry Holt and Company. P. 76.<br/>This book is available as a searchable pdf of the first edition from: <a href=\"http://www.des.emory.edu/mfp/JamesTalksToTeachersFirstEdition.html\">http://www.des.emory.edu/mfp/JamesTalksToTeachersFirstEdition.html</a>    Note the copyright information.<br/>",
            "length": "13510193",
            "sourceUrl": "http://podcasts.sbinstitute.com/fall2010/Phuket_Fall_2010_Archive/Media/66%20October%2026%20Morning%20MB.m4a"
        },
        {
            "title": "Session 65: Freshening Up Our Loving Kindness Practice\r",
            "datePublished": "Thu, 18 Nov 2010 15:52:09 -0800",
            "description": "Discursive meditation, because it is repetitive, can become stale.  Between sessions, look for sentient beings with whom to interact, each time is a fresh interaction. Add fresh yeast to the practice.  Invite more and more beings into the practice.  The object is sentient beings.  We are generating an aspiration which gives rise to a feeling, not simply a feeling.  Alan suggests we envision the aspiration to achieve Shamatha with all the inner and outer requests fulfilled.<br/>Question topics include:  What to do if good ideas come up during meditation? Is Shamatha the same as Perfect Recollection? Can monks marry?  What do we do when a practice bumps us into discovering an uncomfortable memory?<br/>",
            "length": "37035081",
            "sourceUrl": "http://podcasts.sbinstitute.com/fall2010/Phuket_Fall_2010_Archive/Media/65%20October%2025%20Evening%20LK.m4a"
        },
        {
            "title": "Session 64: Back to the Infirmary and the Pure Land of Tushita\r",
            "datePublished": "Thu, 18 Nov 2010 15:52:06 -0800",
            "description": "Pressure in the head and headaches are not habits we should build while meditating.  Therefore, this morning, Alan gave a detailed reminder of how this should be approached:  back to Infirmary.   This is by giving special attention to release all thoughts and tension during the out-breath and by focusing on the earth element (sensations of firmness and solidity).<br/><br/>The tension might come from the feeling of anxiety that there are only 2 ½ weeks left for the retreat to be over.   So, Alan used an analogy on the deva land of Tushita in the desire realm and the Pure Land of Tushita as to be Phuket and the Mind Center respectively,  in order for us to understand the different ways of looking at our reintroduction into the world once the retreat finishes.<br/>",
            "length": "18450039",
            "sourceUrl": "http://podcasts.sbinstitute.com/fall2010/Phuket_Fall_2010_Archive/Media/64%20October%2025%20Morning%20MB.m4a"
        },
        {
            "title": "Session 63: (Discussion Only) Spiritual Friends, Setting a Sleep Schedule, the Suffering of Bodhisattvas, etc.",
            "datePublished": "Thu, 18 Nov 2010 15:52:02 -0800",
            "description": "Following a silent meditation session, Alan addressed a wide range of questions from students:<br/>Post-retreat advice regarding refuge, ethics, and the importance of spiritual friends • Can I drink one or two beers without affecting my meditation? • How to adapt yourself to wake naturally at 3AM • How to use meditation on a physical, visual object as a calming technique • Can bodhisattvas or arhats suffer? • Discussion of alternate pronunciations of Padmasambhava’s mantra and the Vajrasattva mantra • What do Buddha statues’ hand gestures mean?  • Why are the three types of ethics not taught much in the West?<br/><br/>",
            "length": "27572327",
            "sourceUrl": "http://podcasts.sbinstitute.com/fall2010/Phuket_Fall_2010_Archive/Media/63%20October%2023%20Evening%20.m4a"
        },
        {
            "title": "Session 62: (Discussion Only) What it Means to Have a GREAT Meditation\r",
            "datePublished": "Thu, 18 Nov 2010 15:51:57 -0800",
            "description": "We started with a silent meditation with free choice on practicing one of the Shamatha practices. Then Alan gave some examples of the path of Shamatha.  He joked that commenting on your daily meditation practice as being “bad” or “good” or having “highs and lows” is like the habit of coming home to a spouse and reporting on your day.  Alan encouraged us not to measure and evaluate our practice in a hedonic way, but rather to think about what we can bring to our practice in terms of motivation, and to evaluate our performance based on that.  He gave the example of a farmer: a farmer doesn’t reap a harvest very quickly; it takes a while to plow the land, sow the seeds,  etc.  He said that he hopes we will respond to the question, “How is your practice?” by saying that we are doing “GREAT” (GREAT being the acronym for: “Gently but Relentlessly Easing and Arousing Tension”).  In Shamatha it is necessary to “tune our instrument.”  At times we’ll have to release and tighten the tension.  This is the Middle Way. <br/><br/>",
            "length": "13787176",
            "sourceUrl": "http://podcasts.sbinstitute.com/fall2010/Phuket_Fall_2010_Archive/Media/62%20October%2023%20Morning%20MB.m4a"
        },
        {
            "title": "Session 61: (Discussion Only) Encouragement for Practice, Expanding Awareness, Controversial Lamas, etc.\r",
            "datePublished": "Thu, 18 Nov 2010 15:51:49 -0800",
            "description": "We started with a silent meditation with free choice on practicing one or more of the Four Immeasurables. Then Alan gave a little bit of advice and encouragement to all the meditators about dealing in a healthy way with all kinds of obstacles that arises on continuous practice. After that there were 5 Q&amp;A. The first one about the practice of the Four Immeasurables, the 2nd, 3rd and 4th about the three methods of shamatha that Alan has been guiding and the last one about controversial teachers and how to deal those issues if we are interested in their teachings. For this last question Alan gave a superb and profound answer that we definitely recommend you to listen.<br/><br/>",
            "length": "32018003",
            "sourceUrl": "http://podcasts.sbinstitute.com/fall2010/Phuket_Fall_2010_Archive/Media/61%20October%2022%20Evening%20EQ.m4a"
        },
        {
            "title": "Session 60: Tonglen Suffused with Equanimity",
            "datePublished": "Thu, 18 Nov 2010 15:51:45 -0800",
            "description": "This evening we return to the practice of Immeasurable Equanimity, with some profound instructions drawn from Karma Chagme Rinpoche, a great Tibetan master and patriarch of the Mahamudra and Dzogchen lineages. Alan discusses the ways in which the Dharma we practice can be conditioned by our sense of personal identity, history and cultural context, and how achieving Shamatha and the Four Immeasurables allows us to free our Dharma practice from this limited context. He also explains the Four Greats, which go a step beyond the Four Immeasurables and venture into the realm of Bodhicitta by awakening our Buddha nature, and an instruction on how to connect their practice with the four times of day and the activities of the four Buddha families.<br/><br/>",
            "length": "39250450",
            "sourceUrl": "http://podcasts.sbinstitute.com/fall2010/Phuket_Fall_2010_Archive/Media/60%20October%2021%20Evening%20EQ.m4a"
        },
        {
            "title": "Session 59: Having Appropriate Expectations in our Awareness of Awareness Practice\r",
            "datePublished": "Thu, 18 Nov 2010 15:51:42 -0800",
            "description": "In this session Alan made an analogy between the practice of visualizing a Buddha image in the first stages of shamatha and the clarity we can expect to have in the first stages of the practice of awareness of awareness. According to Tsongkhapa we should be satisfied with maintaining just enough contact of the image in the first stages. As we progress on the path of shamatha we develop greater clarity and in the final stages we can see the image as being tridimensional and as vivid as in a dream. Similarly in the practice of awareness of awareness we shouldn’t expect to have a high degree of clarity in the first stages, but just enough continuity of being aware of being aware. The clarity and sharpness will kick in until stages 4 and 5. <br/>He also mentioned two important steps in this practice. The first point is to release all interest to the appearances arising in any of the 6 domains of experience. You’re not deliberately giving your attention to any appearance, if these arise, it’s ok, but if you’re caught in a thought you’re not doing the practice correctly. The second point is that it is quiet and in the silence there is awareness of awareness. You’re not sitting there and not doing anything, you are aware that you are aware.<br/>We then practiced according to the instructions given by Padmasambhava in “Natural Liberation” by directing our awareness to the space upwards, then to the right, left and downwards, then to the heart and finally releasing it into space.<br/><br/>",
            "length": "17054164",
            "sourceUrl": "http://podcasts.sbinstitute.com/fall2010/Phuket_Fall_2010_Archive/Media/59%20October%2021%20Morning%20AOA.m4a"
        },
        {
            "title": "Session 58: Equanimity, Karma, Free Will and Penetrating Past Appearances\r",
            "datePublished": "Thu, 18 Nov 2010 15:51:38 -0800",
            "description": "Alan explains that Equanimity is similar to the Serenity prayer:<br/>God grant me the serenity  to accept the things I cannot change;  courage to change the things I can; and wisdom to know the difference.<br/>It’s not being indifferent. You remain calm. It’s a state cooled from the flames of Samsara, imperturbable.  In Theravada Buddhism is a cultivated emotion. In the Mahayana tradition is an aspiration. Don’t judge people according to their appearances, because that’s where attachment and aversion come from. Neither you analyze persons trough emptiness. You would dehumanize them. So don’t  go too shallow nor too deep. Only enough until you find a being like yourself, which wants to be happy and to avoid suffering.<br/><br/>",
            "length": "39578927",
            "sourceUrl": "http://podcasts.sbinstitute.com/fall2010/Phuket_Fall_2010_Archive/Media/58%20October%2020%20Evening%20EQ.m4a"
        },
        {
            "title": "Session 57: Awareness of Awareness and More on Catatonia-Inducing Materialism\r",
            "datePublished": "Thu, 18 Nov 2010 15:51:35 -0800",
            "description": "The point of awareness of awareness is NOT to prove that there’s no one who is aware because there is.  Not finding any-specific-one who controls the attention and concluding that we don’t exist (and therefore no one else exists) is a nihilistic, not the Buddhist view.  Unfortunately, it is exactly that close facsimile of the Madhyamika view that is most often picked up and allied with by the archetypical scientist materialist Alan likes to debate with.  “We are just our brains.  We are just the summary of our parts.  We are our thoughts/cognition” are simple statements that come out of people’s observation to one particular part of the human experience, seeing there is no one there who’s in charge and concluding there’s no one at all.  Their disastrous consequences come out of the implied refutation of free will and moral responsibility.  Yet, we do make choices or else one couldn’t become a neuroscientist. And there IS a perceiver.  The opposite statement begs the question of “who concludes I don’t exist?”<br/>The practice of Dharma (and meditation in particular) is not to refute free will, and plunge us into an existential depression.  We can get that, free of charge, by simply having “faith” the materialistic view.  The practice of Shamatha (and especially awareness of awareness) is an invitation to investigate HOW we, our perceptions, and our awareness of them exist in relation to each other.  So that’s what we did in the guided session that followed.  Enjoy!<br/><br/>",
            "length": "20623288",
            "sourceUrl": "http://podcasts.sbinstitute.com/fall2010/Phuket_Fall_2010_Archive/Media/57%20October%2020%20Morning%20AOA.m4a"
        },
        {
            "title": "Session 56: Taking Delight with Empathetic Joy\r",
            "datePublished": "Thu, 18 Nov 2010 15:51:31 -0800",
            "description": "Alan reviews for us the process of cultivating empathetic joy.  It is possible to find many rewards in this practice as he explores the unfolding of empathetic joy in its three flavors:  Attending to the kindness shown to us by others, taking delight in one’s own virtue, and creating an aspiration for happiness for all sentient beings.  You will especially enjoying listening to Alan’s own personal story of the way he discovered dharma near the end of the question and answer session.<br/><br/>",
            "length": "37914916",
            "sourceUrl": "http://podcasts.sbinstitute.com/fall2010/Phuket_Fall_2010_Archive/Media/56%20October%2019%20Evening%20EJ.m4a"
        },
        {
            "title": "Session 55: Awareness of Awareness and Cutting Firewood\r",
            "datePublished": "Thu, 18 Nov 2010 15:51:28 -0800",
            "description": "If you want firewood, you can trim off all the leaves and branches and wait for the tree to die and fall over.  OR you can cut the tree down at its base - at the root, and you have firewood now.  Likewise for investigating the mind: you can go at it intellectually – using logic, forming hypotheses, picking off one idea after another or you can go for the root by way of direct observation, though direct experience of the mind at close range in the practice of awareness of awareness.  <br/><br/>Urging us on to the practice, Alan invokes our Star Wars hero; “Be like Luke Skywalker going after the death star.  May the force be with you… <br/>… and the death star is TOAST.”<br/><br/>Other subjects include: the Dalai Lama and the book – The Good Heart, a great quote from physicist Anton Zeilinger, atheism, agnosticism, Stephen Hawking, and more.  Listen for yourself.  See for yourself.<br/><br/>",
            "length": "22788706",
            "sourceUrl": "http://podcasts.sbinstitute.com/fall2010/Phuket_Fall_2010_Archive/Media/55%20October%2019%20Morning%20AOA.m4a"
        },
        {
            "title": "Session 54: Empathetic joy and Achieving Greater Balance by Attending to the Good in the World\r",
            "datePublished": "Thu, 18 Nov 2010 15:51:19 -0800",
            "description": "Strong mental afflictions catch our attention.  We do not notice good deeds as much as bad.  This is especially true of the media.  We need to make a conscious effort to have an antenna up for joy.  In a single meditation session we can take delight in doing the practice well.  Even if our mind wanders, we can bring it back joyfully.<br/>The meditation includes the Mahayana prayer:  <br/>May we all never be parted from genuine happiness and the causes of happiness.  Why couldn’t we?  May we never be parted from genuine happiness and well-being.  May I make it so!  May my own spiritual mentors bless me so I may be enabled to help others to achieve genuine happiness!<br/>The questions and answers dealt with the “cascading waterfall” of thoughts listed in the Stages of Shamatha and practical suggestions for using insight to improve the practice.<br/><br/>",
            "length": "37646053",
            "sourceUrl": "http://podcasts.sbinstitute.com/fall2010/Phuket_Fall_2010_Archive/Media/54%20October%2018%20Evening%20EJ.m4a"
        },
        {
            "title": "Session 53: Keeping it Simple in our Awareness of Awareness Practice\r",
            "datePublished": "Thu, 18 Nov 2010 14:52:36 -0800",
            "description": "Awareness of awareness is “the most profound practice” according to the Buddha, and he gave us this morning very meaningful advice on how to know we’re doing it correctly.<br/><br/>You may wonder that if you’re doing such a profound practice, you should be getting profound results… But, nothing!   This doubt comes from an expectation for deep results.   <br/><br/>How do you know if you are doing this practice of awareness of awareness correctly?  You could ask the following questions:<br/>1.\tAre you aware that you are aware?  And the answer could be:<br/>“Well, yes… I’m aware of what is arising”.   But in this practice you don’t have to be aware of anything arising, but instead you have to draw your attention to you, who is aware.<br/>2.\tHow do I know?<br/>Alan explained this by giving an analogy that if you were taken into a vacuous container (or a deprivation tank), and all your senses were withdrawn, even your mind wouldn’t have any thoughts, nothing… do you think there would still be something?   He explained there would still be a feeling or a presence there, and that would be your awareness, getting ready to illuminate anything that could arise.<br/><br/>So, that is what you look at.  A good expectation by the end of this 8-week retreat would be having the certainty of doing this practice correctly or incorrectly, and knowing it. This practice is about letting be, it is very yin, while modern world is very yang:  trying always to accomplish something.  So, just practice it in this simple way.<br/>",
            "length": "22219886",
            "sourceUrl": "http://podcasts.sbinstitute.com/fall2010/Phuket_Fall_2010_Archive/Media/53%20October%2018%20Morning%20AOA.m4a"
        },
        {
            "title": "Session 52:  Compassion For Those Who Are Grasping\r",
            "datePublished": "Thu, 18 Nov 2010 06:31:41 -0800",
            "description": "Grasping the “real I” and “really mine” is at the root of suffering.  How do we get rid of grasping?  All of Dharma.  After 8 weeks we may find that although our thoughts are still like a cascading waterfall of garbage, we don’t have to eat it any more.  Even if we can’t stop it, we can cut our suffering by developing discerning mindfulness, by not reifying ourselves and our ruminations, and by not acting while afflicted by grasping.   One sign of meditation progress is that our obsessive thoughts and dreams become less disturbing.  But before we totally silence our thoughts, let’s try to cultivate good ones.<br/>The immediate catalyst of compassion is to perceive the suffering of others and to know there is hope.  Authentic compassion for oneself is called renunciation.   In tonight’s meditation we envision how much suffering would be dispelled if we all realized our true nature.   By expanding our field of caring we shrink our relative self-grasping.  We see that our suffering is really small, like one goldfish in the ocean.<br/>",
            "length": "39604853",
            "sourceUrl": "http://podcasts.sbinstitute.com/fall2010/Phuket_Fall_2010_Archive/Media/52%20October%2016%20Evening%20COM.m4a"
        },
        {
            "title": "Session 51:  Settling the Mind in its Natural State and the Ever-Present Substrate\r",
            "datePublished": "Thu, 18 Nov 2010 06:31:30 -0800",
            "description": "Alan starts the session with an explanation of mindfulness of breathing, saying that, with time and practice, there may be a moment where you do not detect the breath anymore, and you can no longer find any sensation.  He recommended doing 2 things: relax more deeply as you are breathing out, and as you are doing so, attend sharply to pick up the sensation. <br/>Then, in the explanation of settling the mind, he said that the substrate is not a mere absence of thoughts.  It is something that can be perceived.  He used some examples of people in deep sleep, under general anesthesia and in a vegetative state, and he said that the substrate consciousness is present and manifesting in those instances.  In fact, the Substrate is always manifesting – or “shining” – but is obscured most of the time.  Like the stars in the sky, it shines more when the sun sets. <br/>Alan also explained that the mental domain is the king of all senses.  The other domains (taste, sight, sound, tactile and olfactory sense) cannot perceive mental awareness, but the mental domain can perceive the others. <br/>He finished with a talk about how, unlike scientists and philosophers in the West, Buddhists have a methodology for the study of consciousness.  Scientific materialists only attend to the brain when trying to understand the phenomena of consciousness, but they lack an empirical methodology.  Alan joked that Buddhism is in a fun-loving wrestling match with these other schools of thought – but certainly not a violent boxing match – to get to the bottom of the consciousness question, and that we can all work together.<br/>",
            "length": "20306553",
            "sourceUrl": "http://podcasts.sbinstitute.com/fall2010/Phuket_Fall_2010_Archive/Media/51%20October%2016%20Morning%20SM.m4a"
        },
        {
            "title": "Session 50: Compassion Practice for the Suffering of Change and the Dissatisfying Nature of Hedonic Pleasure\r",
            "datePublished": "Thu, 18 Nov 2010 06:31:25 -0800",
            "description": "This evening Alan taught us more about the cultivation of compassion, but now going deeper, from the compassion for the blatant suffering of sentient beings to the compassion of the suffering of change which emerge from the 5 obscurations (attachment, malice, dullness, excitation and uncertainty) and he pointed out the unsatisfying nature of hedonism. Then he raised the questions: what is it dukha good for?; Can I make it meaningful? And the response is that dukha can be our best allied making us wake up getting on a real path to emerge definitely from suffering. And for that we should question ourselves: what is a true source of happiness, could it come from within? He addressed the significance of the practices of shamatha and vipashyana. He continued with a touching meditation, finishing with Q&amp;A, the first one regarding the practice of mindfulness of breathing and the second one about Alan’s knowledge of some realizations of practitioners.<br/>",
            "length": "40534452",
            "sourceUrl": "http://podcasts.sbinstitute.com/fall2010/Phuket_Fall_2010_Archive/Media/50%20October%2015%20Evening%20COM.m4a"
        },
        {
            "title": "Session 49: A Discussion of the Elements and Settling the Mind Without Conceptual Designation\r",
            "datePublished": "Thu, 18 Nov 2010 06:31:22 -0800",
            "description": "Good Morning, This Mediation is settling the Mind in Its Natural State. Alan said that because he didn’t answer two questions last night he would answer them this morning. The first question was about the elements. The second question was about grasping. After the meditation, Alan said a couple of more sentences about the prerequisites before starting the practice of settling the Mind in Its Natural State. Darlene",
            "length": "17690857",
            "sourceUrl": "http://podcasts.sbinstitute.com/fall2010/Phuket_Fall_2010_Archive/Media/49%20October%2015%20Morning%20SM.m4a"
        },
        {
            "title": "Session 48: Two Approaches to the Four Immeasurables and a Practice in Compassion \r",
            "datePublished": "Thu, 18 Nov 2010 06:31:19 -0800",
            "description": "This evening, as we return to the theme of Immeasurable Compassion, Alan offers an expansive and truly remarkable presentation of how the Buddhist approach to suffering runs directly against the grain of modernity’s approach to suffering, and finally how the bodhisattva’s response to suffering departs radically from that of a hinayana practitioner aspiring to the state of an arhat. Challenging, mind-expanding and deeply inspiring; one hour of Alan at his finest.",
            "length": "40420830",
            "sourceUrl": "http://podcasts.sbinstitute.com/fall2010/Phuket_Fall_2010_Archive/Media/48%20October%2014%20Evening%20COM.m4a"
        },
        {
            "title": "Session 47: Settling the Mind and Avoiding Reification of Appearances and Emotions\r",
            "datePublished": "Thu, 18 Nov 2010 06:31:16 -0800",
            "description": "This can be a challenging practice. In today’s approach, drawing from the teachings of the Buddha to Bahia “In the seen let it just be the seen”, we applied it to the visual field, then the auditory, the tactile and finally to the mental. The main instruction for this practice is “without distraction and without grasping”. Distraction refers to the tendency to follow a chain of associations. For example, when we see an attribute of an object, like a color, we start superimposing concepts based on memories of past experiences. In this practice we try to see the visual appearances without the association, without the labeling. Just aware of what is presented to our senses; we then apply it to the mind by being aware of mental events. On the other hand, grasping refers to the tendency of reifying the mind and the five obscurations by thinking for example “my mind is tormenting me” or “my thoughts are so disturbing”. We’re getting caught in the drama, and creating a mini-samsara of the movie that is projected in our minds. In this practice we attend to the movie trying to perceive the emptiness of the audio and visual input.",
            "length": "21771799",
            "sourceUrl": "http://podcasts.sbinstitute.com/fall2010/Phuket_Fall_2010_Archive/Media/47%20October%2014%20Morning%20SM.m4a"
        },
        {
            "title": "Session 46: Extending the Field of Loving Kindness ",
            "datePublished": "Thu, 18 Nov 2010 06:31:13 -0800",
            "description": "This afternoon Alan deepens into the subject of Loving-Kindness. He cites sources from the Mettā Sutta  found in the Pali Canon; the Visuddhimagga (The Path of Purification) written by Buddhaghosa , and, of course from the Buddha itself when he says we shouldn’t doubt the Four Immeasurables as explained in the Kalama Sutra. Explains that what we are cultivating an aspiration, that the object of this discursive meditation are all sentient beings. He then guides the meditation saying that we could use the liturgies like a starter for the meditation in Loving-Kindness. <br/>Más... Sin comentarios<br/>",
            "length": "29930112",
            "sourceUrl": "http://podcasts.sbinstitute.com/fall2010/Phuket_Fall_2010_Archive/Media/46%20October%2013%20Evening%20LK.m4a"
        },
        {
            "title": "Session 45: Mindfulness of Breathing (Apertures of the Nostrils) and Fighting the Good Fight\r",
            "datePublished": "Thu, 18 Nov 2010 06:31:10 -0800",
            "description": "This morning Alan raised the emotional issue of the warrior returning home from the front. Going down memory lane he recalled the various ways heroes have been greeted upon their return. Some were welcomed and accommodated with gratitude; others were left to paddle for themselves. And then he got to the point: how about those of us taking time from their lives to face the most noblest (and bloodless) of all battles – the one with our own afflictive emotions. How would we be received when the retreat is over? With love and encouragement? Or indifference at best? Then with a swift maneuver he wiped off the tears and quoted a Kadampa Geshe: “Now is not the time to subdue others’ minds, it’s the time to subdue our own” We then followed him onto the battlefield of mind.",
            "length": "15966634",
            "sourceUrl": "http://podcasts.sbinstitute.com/fall2010/Phuket_Fall_2010_Archive/Media/45%20October%2013%20Morning%20MB.m4a"
        },
        {
            "title": "Session 44: Loving Kindness and Attending to Others with the Correct Magnification\r",
            "datePublished": "Thu, 18 Nov 2010 06:31:08 -0800",
            "description": "Alan reminds us that the practice of loving-kindness first begins with loving ourselves. As so often is the case in meditation practice, we often discover our own shortcomings rather than our assets. Being judgmental, feeling self-contempt and lack of worth leads us to further mental afflictions. He recommends that we attend to these faults (cravings, hatred, jealousy, pettiness, to name a few) and identify them as delusional obstructions to our own healing. The solution is to view these as mere appearances that are not parts of ourselves. Alan recommends that the anecdote to self-loathing and discontent is to observe and investigate, looking carefully for the lovable qualities in ourselves and in others.<br/>",
            "length": "39374972",
            "sourceUrl": "http://podcasts.sbinstitute.com/fall2010/Phuket_Fall_2010_Archive/Media/44%20October%2012%20Evening%20LK.m4a"
        },
        {
            "title": "Session 43: Synergy and Balance - Mindfulness of Breathing with Stability \r",
            "datePublished": "Thu, 18 Nov 2010 06:31:05 -0800",
            "description": "Alan discusses synergy this morning. In the “infirmary” this is experienced while one balances maintaining the initial state of clarity with deepening relaxation. With this practice alone one can dispel 95% of the troubles with meditation. In mindfulness of breathing with stability (focus on the sensations of the breath in the abdomen) discipline is introduced to strengthen stability and balanced with deepening relaxation and vividness. \r\n\r\nFor those interested, today’s practice leads the way into falling asleep lucidly.\r\n\r\nComparing practicing dharma by developing authentic motivation and practicing dharma in the service of samsara, Alan counters the second stating; “The Four Immeasurables grease the wheels for meditation.”",
            "length": "13862623",
            "sourceUrl": "http://podcasts.sbinstitute.com/fall2010/Phuket_Fall_2010_Archive/Media/43%20October%2012%20Morning%20MB.m4a"
        },
        {
            "title": "Session 42: Loving Kindness and Going Against the Grain",
            "datePublished": "Thu, 18 Nov 2010 06:31:01 -0800",
            "description": "In the prelude to this afternoon’s meditation, Alan reminds us that mainstream society is in a frenzy to consume the earth. We are categorized as consumers and told to get spending to stimulate the economy. In the thrust of modernity, one may consider himself special if he meditates 20 minutes a day. Are we devoting our time to what we value? In the meditation we expand on the resources that are not earth depleting or competitive. We tap into the internal, boundless resources of our Buddha nature to send loving kindness to ourselves and others.\r\nThe Questions and Answer session was filled with practice oriented advice. Some of the topics: Overcoming eye strain, changing the object of meditation within a session, subliminal tapes (short cuts) and combining meditation and creative endeavors.",
            "length": "36367943",
            "sourceUrl": "http://podcasts.sbinstitute.com/fall2010/Phuket_Fall_2010_Archive/Media/42%20October%2011%20Evening%20LK.m4a"
        },
        {
            "title": "Session 41: Addiction/Withdrawal, A Review of the Practices, and a Trip Back to the Infirmary\r",
            "datePublished": "Thu, 18 Nov 2010 06:30:58 -0800",
            "description": "We are starting for the 3rd time the cycle of meditations starting with the Infirmary, this wonderful practice to get grounded and enhance relaxation.\r\n\r\nIn his opening 20-minute lecture, Alan talked this time about the parallelism between Shamatha and the 4 Immeasurables on how the former leads to realizing emptiness and the latter bodhichita. Both are the 2 “supernovas” on our way to enlightenment.\r\n\r\nHe also shared in detail his point of view, according to the Geluk tradition, on Ngöndro Practices and the practice of Shamatha. He gives clear advice on how not to make those powerful preliminary practices a quantitative practice just to cover a number of prerequisites in order to have access to other type of teachings and practices, by just becoming religious. So, for a western mind, it could be useful to practice Sutrayana first, because they are too a way of purifying obscurations and creating merit. \r\n\r\nHe suggests letting our faith increase so these preliminary too become meaningful and really transforming. ",
            "length": "19517942",
            "sourceUrl": "http://podcasts.sbinstitute.com/fall2010/Phuket_Fall_2010_Archive/Media/41%20October%2011%20Morning%20MB.m4a"
        },
        {
            "title": "Session 40: Equanimity, a Balanced Foundation for Practice \r",
            "datePublished": "Thu, 18 Nov 2010 04:53:23 -0800",
            "description": "\r\nAlan makes two important points about equanimity and balance. Alan’s first point is that equanimity is the balanced foundation needed to achieve Bodhicitta. Just as Shamatha provides the cognitive balance needed for Vipassana, equanimity provides the affective balance needed for Bodhicitta. Alan’s second point is that a balance between faith and intelligence is extremely critical. This sacred tension between faith and skepticism is part of our practice of equanimity. \r\nAlan leads us in a meditation on equanimity by guiding us to expand our horizons of inclusion with the practice of Tonglen.\r\nFollowing the meditation, Alan answers student questions about what are the best and worst times of day to practice Dharma. ",
            "length": "39147560",
            "sourceUrl": "http://podcasts.sbinstitute.com/fall2010/Phuket_Fall_2010_Archive/Media/40%20October%209%20Evening%20EQ.m4a"
        },
        {
            "title": "Session 39: Awareness of Awareness, Stretching our Awareness of the Space of the Mind\r",
            "datePublished": "Thu, 18 Nov 2010 04:53:21 -0800",
            "description": "Alan’s introduction was very interesting. He explained to us that, according to the teachings of Padmasambhava, this practice is designed to go straight to the nature of the phenomena of consciousness, “the space of awareness,” the relative space of the mind.\r\nHe shared with us that years ago some scientists were trying to investigate and research yogis, and how these people practice Shamatha and Compassion. The scientists wanted to study only the brain, but the yogis refused to take part, because practice is something that is experiential. It’s like trying to investigate how a mathematician can understand sophisticated math, by only looking at his brain. The only one who can assess consciousness is a first person observer, looking at his/her own mind. <br/>",
            "length": "31742616",
            "sourceUrl": "http://podcasts.sbinstitute.com/fall2010/Phuket_Fall_2010_Archive/Media/39%20October%209%20Morning%20AOA.m4a"
        },
        {
            "title": "Session 38: Tending to Special Relationships in the Cultivation of Equanimity\r",
            "datePublished": "Thu, 18 Nov 2010 04:52:11 -0800",
            "description": "\r\nThis afternoon Alan delighted us with his lecture. He gave us advice in how to continue practicing after one has finished a retreat and has to go back to the usual activities of daily life. He questioned, how does special bonds of special relationships fit with the ideal of equanimity? And the answer to that is to take out the threads of attachment attending to the needs of the other person, deepening the sense of loving-kindness. Furthermore turning the hedonic concerns into eudemonic (genuine happiness) ones, at that moment the other becomes our spiritual friend. He also taught us how to deal with wisdom, loving-kindness and compassion in situations when a loved one is behaving badly, out of mental afflictions. After that he continued with a beautiful meditation that we definitely encourage you to practice. Finally he ended with four Q&amp;A. The first one about the recommendation of practicing Ngondro (preliminary practices) before or after Shamatha. The second one, very interesting on advantages and disadvantages of doing retreat with a couple. The 3rd and 4th related to the practices of awareness of awareness and mindfulness of breathing.<br/>",
            "length": "39194679",
            "sourceUrl": "http://podcasts.sbinstitute.com/fall2010/Phuket_Fall_2010_Archive/Media/38%20October%208%20Evening%20EQ.m4a"
        },
        {
            "title": "Session 37: Awareness of Awareness and Alan’s Wrath toward the Neurocentric View\r",
            "datePublished": "Thu, 18 Nov 2010 04:52:08 -0800",
            "description": "Good Morning to All Human Beings,\r\nThis is the third morning for Awareness of Awareness Shamatha Meditation. Alan was speaking like a wrathful deity this morning. He is wrathful about the way some scientists (as well as the journalists who report on scientific studies) use words to describe the functions of computers and the brain. They use language that would suggest that neurons and computers are “smart” and can “communicate” and “detect” things, but at the same time disempower human beings by telling them their minds are merely computers. He is calling for all of us who meditate to use introspection and examine our own experience when we are meditating. Alan says that we are each the scientist of our own mind.\r\nThe lecture had so much value, pointing out what some of the implications are of this type of word usage in the scientific community. I suggest you listen to his lecture five times in order to get the full meaning. \r\nThank you for being conscious.\r\nDarlene",
            "length": "33298355",
            "sourceUrl": "http://podcasts.sbinstitute.com/fall2010/Phuket_Fall_2010_Archive/Media/37%20October%208%20Morning%20AOA.m4a"
        },
        {
            "title": "Session 36: Entering the Path, A Wisdom Perspective on Empathetic Joy\r",
            "datePublished": "Thu, 18 Nov 2010 04:52:05 -0800",
            "description": "This afternoon we look at Empathetic Joy – the aspiration for all beings to never be parted from happiness and its causes – and explore what this means from a wisdom perspective. Ultimately we look at it from the perspective of ‘Path,’ and what it means for one’s life to become Dharma. Following the meditation, Alan answers questions related to the practices of settling the mind in its natural state and awareness of awareness, as well as some very practical guidance related to the practice of lucid dreamless sleep.\r\nThis mudita really is a cultivation of emotion. (It s joy. … Taking delight in others’ joys successes)<br/>",
            "length": "38436169",
            "sourceUrl": "http://podcasts.sbinstitute.com/fall2010/Phuket_Fall_2010_Archive/Media/36%20October%207%20Evening%20EJ.m4a"
        },
        {
            "title": "Session 35: Awareness of Awareness and Responding to Fear of Annihilation \r",
            "datePublished": "Thu, 18 Nov 2010 04:52:01 -0800",
            "description": "In this session we practiced awareness of awareness. According to Padmasambhava, by doing this practice you may realize Rigpa or Pristine awareness. Alan talked about the differences between coarse impermanence and subtle impermanence. He referred to the individual stream of consciousness as one which is impermanent yet never terminates. Rigpa, however, is beyond change, it does not arise upon causes and conditions and it’s a dimension of awareness that transcends the concepts of permanence and impermanence. Letting go of categories, concepts and even the grasping to the experiences of bliss, clarity and non-conceptuality, we might be able to recognize Rigpa.<br/>",
            "length": "18579779",
            "sourceUrl": "http://podcasts.sbinstitute.com/fall2010/Phuket_Fall_2010_Archive/Media/35%20October%207%20Morning%20AOA.m4a"
        },
        {
            "title": "Session 34: Empathetic Joy (Mudita) and Attending to Virtue\r",
            "datePublished": "Thu, 18 Nov 2010 04:51:59 -0800",
            "description": "The third Immeasurable attends to actuality; it is not an aspiration like the first two: Loving-Kindness and Compassion. Empathetic Joy is rejoicing in the well-being of others. Isn’t that extraordinary…? Choosing to feel right!\r\nFirst, you sweep through your life and reflect on the kindness you received. You rejoice in their virtue. You delight in what brings meaning to life. Then you can raise the question how can I repay the kindness that I have received from the world? Then you can think of using your abilities, or ask the question and let the creativity of your substrate consciousness emerge, or try deep form your Buddha Nature.\r\nAlan then answers questions related to the Shamata Project and practical issues like how to deal with your eyes during meditation.",
            "length": "37867035",
            "sourceUrl": "http://podcasts.sbinstitute.com/fall2010/Phuket_Fall_2010_Archive/Media/34%20October%206%20Evening%20EJ.m4a"
        },
        {
            "title": "Session 33: Awareness of Awareness, Buddhist Cosmogony, Non-Dharma and Renunciation\r",
            "datePublished": "Thu, 18 Nov 2010 04:51:56 -0800",
            "description": "WoW! Alan was on a roll this morning. He went from discussing Shamatha and how to gain confidence in it (using awareness of awareness as an example), through the different ways of viewing the Universe according to Buddhist cosmology, only to end on demonstrating when practicing Shamatha may not be Dharma. So in brief: How do we gain confidence in our practice? - By cultivating it. Doing it and knowing when we are doing it correctly. How did the Universe originate? – Well, there’s the long-time ago view of Buddhist Cosmogony and there’s the moment-to-moment view of Dzogchen. How can Shamatha be Non-Dharma? – When we take it as the goal not the path. Dharma is the view and conduct that leads to genuine happiness and Shamatha alone does not get us there.\r\nAfter the awareness of awareness practice Alan illustrated another alternative ways to developing authentic renunciation. This podcast is so packed you will likely need to run it a few times.<br/>",
            "length": "25739751",
            "sourceUrl": "http://podcasts.sbinstitute.com/fall2010/Phuket_Fall_2010_Archive/Media/33%20October%206%20Morning%20AOA%20copy.m4a"
        },
        {
            "title": "Session 32: Compassion, the Path that Addresses All Levels of Our Suffering\r",
            "datePublished": "Thu, 18 Nov 2010 04:51:54 -0800",
            "description": "The core sense of grasping derives from a delusion that all sentient beings share. In this session Alan explains the causes of suffering, how it arises and how it may dissolve. In his guided meditation he shows us how bringing compassion to others and ourselves will break the cycle of suffering as we attend to reality and bring equilibrium and balance into the basis of our practice.v",
            "length": "37785317",
            "sourceUrl": "http://podcasts.sbinstitute.com/fall2010/Phuket_Fall_2010_Archive/Media/32%20October%205%20Evening%20COM.m4a"
        },
        {
            "title": "Session 31: Settling the Mind in the Space of the Mind ",
            "datePublished": "Thu, 18 Nov 2010 04:51:48 -0800",
            "description": "\r\nWith this morning’s practice of Settling the Mind in its Natural State, we shift attention to the background of the events of the mind – the space of the mind. This space is none other than the substrate seen, as one views the moon on a cloudy night, through veils of afflictions. \r\n\r\nUsing a metaphor for this practice Alan asks why anyone would want to look at a blank screen on the TV when the third obscuration, laxity and dullness, is the habitual response. As Shamatha “always entails a flow of knowing,” the “beauty of the system” is that maintaining stability and vividness while attending to something as un-scintillating “is a great accomplishment.” To top it off, this practice is the best way to enter into lucid dreaming and relaxing the grip onto “I am”, especially “I am in charge.” \r\n\r\nYou won’t want to miss the rest of the discussion. Here’s a taste of the topics: life force (Srog lung [TIB], jīva [SAN]), “Just being dead and loving it,” Stephen Hawking’s new book - The Grand Design, and rainbow body. Finally, if the EU can support a $6 billion supercollider on the border of Switzerland and France, can the Buddhist community support a contemplative science laboratory?<br/>",
            "length": "30098659",
            "sourceUrl": "http://podcasts.sbinstitute.com/fall2010/Phuket_Fall_2010_Archive/Media/31%20October%205%20Morning%20SM.m4a"
        },
        {
            "title": "Session 30: Compassion in Response to the Suffering of Change, “Dukkha”\r",
            "datePublished": "Thu, 18 Nov 2010 01:58:29 -0800",
            "description": "What are the real causes of suffering and what are the catalysts? Dukkha, the suffering of change, affects everyone. Even if samsara is turning out well for you now it’s inevitable that tragedy will happen. If your happiness is based on the notion that what you have won’t be lost, suffering will ensue. The introductory talk and meditation leads us to seek freedom from the five mental tendencies that obscure our birthright of luminous clarity: craving, malice, laxity, excitation/anxiety and uncertainty.\r\nAlan answered various questions: what to do when thoughts arise during meditation, definition of Alaya and Alaya-vijnana, and compassion for someone who commits suicide.<br/>",
            "length": "39923623",
            "sourceUrl": "http://podcasts.sbinstitute.com/fall2010/Phuket_Fall_2010_Archive/Media/30%20October%204%20Evening%20COM.m4a"
        },
        {
            "title": "Session 29: Settling the Mind and Pushing Past the Ceiling on our Shamatha Practice \r",
            "datePublished": "Thu, 18 Nov 2010 01:58:17 -0800",
            "description": "Alan begins the first session of this week by a useful explanation on the sources of suffering in Modernity and the impediments that arise in our path to bliss, luminosity and non-conceptuality.\r\nModernity seems to be perfect to increase Obsessional-Compulsive-Delusional-Disorder (OCDD), through work, stress, entertainment... In this pathological context, OCDD is taken to be normal. Contemplative traditions (Buddhism has not the monopoly here) come to the scene by claiming: “this might be normal, but this is not healthy”. If the source of suffering is internal (in our own minds), -rather than external (lack of sufficient external stimuli/hedonic pleasure)- then there is no point in “trying to get the world to turn out right”. The hedonic row always ends in a tragedy. Comparatively, the Dharma path is a comedy, because it has a happy ending. \r\nFive obscurations can be obstacles in our meditative way to substrate consciousness: 1. Craving to sensual pleasures, 2. Ill will, 3. Laxity and dullness, 4. Excitation, (including remorse, regret, anxiety and fear), and 5. Uncertainty (in our own capacity). Five remedies or antidotes can be applied to overcome them, respectively: 1. Single-pointed attention, 2. a sense of Well-being, 3. Applied thought (coarse examination), 4. Bliss (enthusiasm for the practice eventually creates bliss, and once it arises, fear vanishes), and 5. Subtle investigation, applied thought (perseverance in the practice).\r\nA rich and clear introduction precedes a guided meditation on Settling the Mind in its Natural State. This practice can not only subdue these mental obscurations, but actually terminate them.",
            "length": "20997693",
            "sourceUrl": "http://podcasts.sbinstitute.com/fall2010/Phuket_Fall_2010_Archive/Media/29%20October%204%20Morning%20SM.m4a"
        },
        {
            "title": "Session 28: Returning to Compassion, the Best Response to Suffering\r",
            "datePublished": "Thu, 18 Nov 2010 01:58:12 -0800",
            "description": "When we experience suffering there is a risk that we will respond with grief or anger. Instead Alan guides us to meditate on compassion, which is the heartfelt yearning: “May we all be free of suffering and the sources of suffering.” Compassion is the response that guides our spiritual practice swiftly upward like a rocket. Today’s meditation focuses our compassion on the first of three levels of suffering, the “suffering of suffering” commonly known as everyday physical and emotional pain.\r\nAlan then answers student questions: How to distinguish an intuitive insight from a delusional thought? Is prana the same as the Tibetan word, lung? Can I lie down all the way to liberation?",
            "length": "40458837",
            "sourceUrl": "http://podcasts.sbinstitute.com/fall2010/Phuket_Fall_2010_Archive/Media/28%20October%202%20Evening%20COM.m4a"
        },
        {
            "title": "Session 27: Settling the Mind, A Thought-Provoking Practice\r",
            "datePublished": "Thu, 18 Nov 2010 01:58:09 -0800",
            "description": "Before the meditation, Alan explained to us the importance of this practice –Settling the Mind is a crucial Shamatha practice and also has qualities of Vipassana. The practice was introduced by the Buddha. Alan explained also that there are 2 types of ignorance: Cognitive Deficit Disorder, when the mind is distracted and we don’t perceive the reality of the moment. The other is Cognitive Hyperactivity, when we perceive something that is not there, but rather is a projection of our thoughts, images, ideas, etc. We project permanency into them and we create an illusion. \r\nAlan’s instructions for the practice were not to engage in grasping and aversion when we watch our thoughts. Like the Buddha said: In the seen there is only the seen; in the mentally perceived, just the mentally perceived.<br/>",
            "length": "16597211",
            "sourceUrl": "http://podcasts.sbinstitute.com/fall2010/Phuket_Fall_2010_Archive/Media/27%20October%202%20Morning%20SM.m4a"
        },
        {
            "title": "Session 26: Loving Kindness and Being of Greatest Benefit to Others\r",
            "datePublished": "Thu, 18 Nov 2010 01:58:06 -0800",
            "description": "Once again, Alan shared with us some very inspiring reflections about our own capacity and potential. Remembering a question from H.H. Dalai Lama: What is our deepest impulse? He answers that our deepest impulse is caring. Caring emerges from within, so the potential of wanting to have happiness and be free from suffering is already there, but it’s blocked, it has barriers. The cause of these barriers is grasping on “I”, “Me” and “Mine”. So besides the well known practices like Tonglen, the practice of Shamatha can let come out this limitless potential. Having said that, we should question ourselves: what can we do to help us and other people, to be more ethical, benevolent, to cultivate our minds and hearts? Are we going to be content just the way we are? How can I be of greatest benefit? \r\nAlan then continued with a beautiful meditation which culminated with a detailed response to a question about rebirth.",
            "length": "39451916",
            "sourceUrl": "http://podcasts.sbinstitute.com/fall2010/Phuket_Fall_2010_Archive/Media/26%20October%201%20Evening%20LK.m4a"
        },
        {
            "title": "Session 25: The Healing Power of Mindfulness of Breathing, Apertures of the Nostrils",
            "datePublished": "Thu, 18 Nov 2010 01:58:03 -0800",
            "description": "Hello to All You Worldwide Sweeties,\r\nThis morning, Alan returned to instructions on Mindfulness of Breathing at the nostrils. He had one word of caution. This is very important. If any pressure starts to build up in the head, immediately bring your attention to the rise and fall of the abdomen or go to the infirmary - full body.\r\nHe emphasized the importance of observing the breath if it is long or short. Don’t manipulate or try to control the breath in any manner. Solely be an observer.\r\nMindfulness of Breathing is displaying itself as a whole system that can heal itself. The whole system calms down and the substrate takes place. The pranas of the body can start to function properly.\r\nBig Worldwide Hug to All of You,\r\nDarlene",
            "length": "17249450",
            "sourceUrl": "http://podcasts.sbinstitute.com/fall2010/Phuket_Fall_2010_Archive/Media/25%20October%201%20Morning%20MB.m4a"
        },
        {
            "title": "Session 24: Attending to Others with Loving-Kindness\r",
            "datePublished": "Thu, 18 Nov 2010 01:57:59 -0800",
            "description": "This afternoon we revisit some of the main points of Immeasurable Loving-Kindness, and also the issue of how to develop one’s practice of all Four Immeasurables in a natural way, both in and out of formal meditation sessions. Then Alan answers some very practical questions relating to transitory meditation experiences, loving-kindness, mindfulness of breathing and settling the mind in its natural state.",
            "length": "40785923",
            "sourceUrl": "http://podcasts.sbinstitute.com/fall2010/Phuket_Fall_2010_Archive/Media/24%20Sept%2030%20Evening%20LK.m4a"
        },
        {
            "title": "Session 23: Mindfulness of Breathing (Abdominal), Cultivating Stability and the Five Powers\r",
            "datePublished": "Thu, 18 Nov 2010 01:57:55 -0800",
            "description": "This morning we were honored with the visit of Klaus Hebben, founder and director of PIA. After expressing his gratitude to him, Alan gave an explanation of bala, which literally means power. Referring to the five powers (panchabalani), which are developed by strengthening the five roots or controlling faculties (indriya): faith or devotion (shraddha) which overcomes doubt and false beliefs; enthusiasm or zeal (vidya) which overcomes laziness; mindfulness (sati) which overcomes forgetfulness; perfect concentration (samadhi) which overcomes distractedness; and wisdom (prajña) which overcomes ignorance. He emphasized the balance between enthusiasm and zeal in the case of Vidya, the balance between wisdom and confidence in the case of Prajna and the importance of Sati or Mindfulness, which enables to balance all the other 4 elements. \r\nIn this second round of meditations after having developed relaxation at the infirmary the day before; we continue today with the cultivation of stability in the practice of Mindfulness of Breathing, focusing on the tactile sensations of the abdomen. ",
            "length": "16013120",
            "sourceUrl": "http://podcasts.sbinstitute.com/fall2010/Phuket_Fall_2010_Archive/Media/23%20Sept%2030%20Morning%20MB.m4a"
        },
        {
            "title": "Session 22: Deepening Loving Kindness for Ourselves \r",
            "datePublished": "Thu, 18 Nov 2010 01:57:52 -0800",
            "description": "Loving-kindness should be saturated with wisdom, that is, knowing what’s conducive to well being. So we need to envision a conducive place to live, including partners for who you feel genuine affection, respect and trust. Instead of asking what I love to receive from the world, we need to ask what I truly need. So be content with merely the adequate. Loving-Kindness involves an internal transformation, to end with craving and hostility.\r\nAfter the meditation, Dr. Wallace answered questions that dealt with levels of happiness: Hedonic pleasure, eudemonic well being that comes from a virtuous life, and the deeper level coming from wisdom. He finished with an explanation of prāṇa, energy and its effects in body and mind.",
            "length": "41063500",
            "sourceUrl": "http://podcasts.sbinstitute.com/fall2010/Phuket_Fall_2010_Archive/Media/22%20Sept%2029%20Evening%20LK.m4a"
        },
        {
            "title": "Session 21: Back to the Infirmary\r",
            "datePublished": "Thu, 18 Nov 2010 01:57:49 -0800",
            "description": "Here we go again! Alan turns the wheel of dharma from the beginning of the cycle emphasizing the great benefits of the infirmary practice and the supine position, which we can use to make a habit out of relaxing around everything and anything that comes up (yes, even bliss). With the understanding that all mental afflictions are carried over by the conceptual mind, we take every exhalation as an opportunity to silence the inner chatter. Quiet conceptual mind equals dormant mental afflictions, equals Shamatha. Thus Alan once again showed us how the beginning is the end. After a guided infirmary session Sean, who is directly involved with actualizing the PIA vision, kindly shared with us some of the details around the invitation of the King’s Brahmin to consecrate the building site. Today’s picture represents the Mind Centre Spirits House, which was built on that occasion as a gesture of courtesy and respect towards Thai traditions. Enjoy! ",
            "length": "17502301",
            "sourceUrl": "http://podcasts.sbinstitute.com/fall2010/Phuket_Fall_2010_Archive/Media/21%20Sept%2029%20Morning%20MB.m4a"
        },
        {
            "title": "Session 20: Equanimity, Breaking Down the Barriers\r",
            "datePublished": "Thu, 18 Nov 2010 01:03:02 -0800",
            "description": "\r\nBreaking down the barriers to others and our preferences for some over others is the basis of the practice of equanimity. We find ourselves in the grip of our own mental afflictions unless we are able to unlock our limited views of the people we meet in our daily encounters. Seeing without attachment and aversion creates a view where it is possible to value all sentient beings with equanimity.<br/>",
            "length": "41065314",
            "sourceUrl": "http://podcasts.sbinstitute.com/fall2010/Phuket_Fall_2010_Archive/Media/20%20Sept%2028%20Evening%20EQ.m4a"
        },
        {
            "title": "Session 19: Expanding our Awareness (of Awareness)\r",
            "datePublished": "Thu, 18 Nov 2010 00:55:39 -0800",
            "description": "We enter the final day of the first 10-day cycle of meditations in this retreat and the last phase of Awareness of Awareness in which we “expand our sense of our space of the mind.” The practice comes from Natural Liberation, by Padmasambhava. \r\n\r\nWe are then graced with a wide ranging discussion including: the philosophies of mind - materialism and Cartesian dualism, a modern version of relative and ultimate truth, a description of who (from each person’s own philosophic or religious perspective) achieves liberation, what it is that is both physical and not material, and two approaches to a rich Buddhist education. \r\n\r\nDescartes’ illustration of dualism. Inputs are passed on by the sensory organs to the epiphysis in the brain and from there to the immaterial spirit. <a href=\"http://en.wikipedia.org/wiki/Cartesian_dualism\">http://en.wikipedia.org/wiki/Cartesian_dualism</a><br/>",
            "length": "20133118",
            "sourceUrl": "http://podcasts.sbinstitute.com/fall2010/Phuket_Fall_2010_Archive/Media/19%20Sept%2028%20Morning%20AOA.m4a"
        },
        {
            "title": "Session 18: Intro to Equanimity\r",
            "datePublished": "Thu, 18 Nov 2010 00:55:35 -0800",
            "description": "At first glance, Equanimity seems anticlimactic after Loving Kindness, Compassion and Empathetic Joy. In fact, Equanimity is the culmination of the Four Immeasurables. It is an emotional state of balance…deep composure. When the Dalai Lama was asked, “What is our most primary impulse?” He answered CARING. Caring is the root of Loving Kindness &amp; Compassion. The meditation guides us to shift places with others to realize that we all equally want to be well and happy, free from suffering and the causes of suffering.\r\nThe question and answer period dealt with questions about the Awareness of Awareness meditation instructions from the morning session.",
            "length": "41266999",
            "sourceUrl": "http://podcasts.sbinstitute.com/fall2010/Phuket_Fall_2010_Archive/Media/18%20Sept%2027%20Evening%20EQ.m4a"
        },
        {
            "title": "Session 17: Awareness of Awareness, An Empowering Practice \r",
            "datePublished": "Thu, 18 Nov 2010 00:55:30 -0800",
            "description": "By clearly stating “Nobody has direct access to the mind as you do” Alan speaks briefly about science and Buddhism, especially in terms of defining who we really are, where the scientific conclusions lead generally to disempower the individual experience. He invites us, then, to watch the nature of our own awareness. He affirms that the reason why the mind has the appearance of movement is because of grasping. If you relinquish all grasping, awareness is by nature still and luminous. Even when dullness arises we can be vividly aware of it, by not grasping to it. And these are the characteristics of achieving shamatha: stability and vividness.\r\nAfter a 10–minute introduction to today’s practice, we went into the 3rd round on meditating on awareness of awareness. He guided us by asking questions about our mind, about the agent or the observer… but, it is better if you listen to this meditation session!\r\n\r\nNOTE ON THE PICTURE: The name of this lovely dog who resides in the Mind Centre is Joy. She was particularly inspiring for us this morning showing us how to practice in the śavāsana posture (supine), as Alan noted. ",
            "length": "21633234",
            "sourceUrl": "http://podcasts.sbinstitute.com/fall2010/Phuket_Fall_2010_Archive/Media/17%20Sept%2027%20Morning%20AOA.m4a"
        },
        {
            "title": "Session 16: Empathetic Joy, Rejoicing in Happiness and Virtue\r",
            "datePublished": "Thu, 18 Nov 2010 00:55:27 -0800",
            "description": "Alan leads a guided meditation on Empathetic Joy, the third of the Four Immeasurables. This is the practice of rejoicing in our and others’ happiness, kindness, and virtuous actions. This practice counteracts the self-centered attitude of “I win!” Instead, we feel joy due to the existence of all the good in the world.\r\nA question and answer session follows the meditation. Alan gives practical advice on meditation practice. A technical discussion is given on the integration of Shamatha and Bodhicitta practices with Mahamudra and Dzogchen. A conspiracy is revealed between musicians and elevator manufacturers to hide the true nature of our minds. Alan tells us what to expect from eight weeks of practice. The session ends with a motivational talk on how the path of Shamatha stops the spin cycle of Samsara.",
            "length": "41904306",
            "sourceUrl": "http://podcasts.sbinstitute.com/fall2010/Phuket_Fall_2010_Archive/Media/16%20Sept%2025%20Evening%20EJ.m4a"
        },
        {
            "title": "Session 15: Awareness of Awareness, Taking the Fruit as the Path\r",
            "datePublished": "Thu, 18 Nov 2010 00:55:25 -0800",
            "description": "Alan’s introduction to today’s practice aimed to differentiate Awareness of Awareness from Settling the Mind in its Natural State. The culmination of any Shamatha method is the dissolution of the mind in substrate consciousness. In Settling the Mind, the object of meditation is the space of the mind and whatever mental events arise within it, and the practice consists in letting these events be. In Awareness of Awareness, the interest is the nature of awareness itself. The practice consists in letting go any mental event, in releasing the thoughts. Alan explains that this is like “taking the fruit as the path” because you are releasing your mind as if you were ready to transcend the mind immediately. By being aware of being aware, you can indeed have a taste of the three characteristics of the substrate consciousness: bliss, luminosity (not to be equated to brightness, but rather to a sense of being awake) and non-conceptuality.<br/>",
            "length": "19938555",
            "sourceUrl": "http://podcasts.sbinstitute.com/fall2010/Phuket_Fall_2010_Archive/Media/15%20Sept%2025%20Morning%20AOA.m4a"
        },
        {
            "title": "Session 14: Intro to Empathetic Joy ",
            "datePublished": "Thu, 18 Nov 2010 00:55:11 -0800",
            "description": "This afternoon Alan started giving a brilliant lecture about the third of the Four Immeasurables, empathetic joy, which means taking delight from other’s joys, fortunes and virtues. He addressed that nowadays more than ever we should practice on this immeasurable, knowing that around 90% of the news we read on the web are bad news and recalling one of his favorite phrases from William James: “At the moment what we are attending to is reality”, then we should focus and take delight from all the bandwidth of people having joys, fortune and those, independent of beliefs or religions, who are devoting their lives bringing happiness to others. We continued with a marvelous meditation, practicing the above, and finally ended with Q&amp;A, one of them regarding to the practice of Shamatha settling the mind in its natural state, two questions about the practice of awareness of awareness and one last question about Buddha Nature. Enjoy it!!",
            "length": "40339151",
            "sourceUrl": "http://podcasts.sbinstitute.com/fall2010/Phuket_Fall_2010_Archive/Media/14%20Sept%2024%20Evening%20EJ.m4a"
        },
        {
            "title": "Session 13: Intro to Awareness of Awareness",
            "datePublished": "Thu, 18 Nov 2010 00:55:07 -0800",
            "description": "Hello All you Lovelies out in Computerland or iPodland,\r\nThis morning’s meditation technique is Awareness of Awareness. \r\nPadmasambhava, in his book Natural Liberation, calls this meditation technique the cultivation of ‘Shamatha without a sign’. Then, Alan went into some of the history of how different scientific disciplines have thought about the mind according to how their discipline measures things. Each one has a specialized language. He gave instructions on how to do the meditation of Awareness of Awareness and I will refer you to his books ‘The Attention Revolution’ and ‘Genuine Happiness’ for details. Alan believes in radical empiricism. Let experience lead you to the theory. This is what Padmasambhava is saying when he gave us the meditational technique of Awareness of Awareness. \r\nDarlene",
            "length": "22453093",
            "sourceUrl": "http://podcasts.sbinstitute.com/fall2010/Phuket_Fall_2010_Archive/Media/13%20Sept%2024%20Morning%20AOA.m4a"
        },
        {
            "title": "Session 12: Compassion and the Deepest Dimension of Suffering\r",
            "datePublished": "Thu, 18 Nov 2010 00:55:05 -0800",
            "description": "This evening Alan leads us into the practice of compassion by attending to the 3rd and deepest dimension of suffering and its causes, completing the process of merging wisdom and compassion. After the meditation session, Alan answers 3 very important and very practical questions: one dealing with the ‘vase breathing,’ which can be applied in the practice of “settling the mind in its natural state” and in “awareness of awareness;” the second dealing with how to distinguish between observing the space of the mind when nothing arises in it, and awareness of awareness itself; and the third dealing with how to progress most efficiently while practicing mindfulness of breathing.<br/>",
            "length": "37643960",
            "sourceUrl": "http://podcasts.sbinstitute.com/fall2010/Phuket_Fall_2010_Archive/Media/12%20Sept%2023%20Evening%20COM.m4a"
        },
        {
            "title": "Session 11: Settling the Mind and Scientific Inquiry\r",
            "datePublished": "Thu, 18 Nov 2010 00:55:02 -0800",
            "description": "\r\nIn this session Alan gives a short explanation on the modern neurocentric view which sustains that mental events are either equal to the brain, emergent properties of the brain or mere functions of it. He encourages us to observe mental events with an empiric–centric view, a spirit of inquiry and first person experience. We then meditated on settling the mind in its natural state with a special emphasis on observing carefully the space from which mental events arise, take place and dissolve back.<br/>",
            "length": "20744391",
            "sourceUrl": "http://podcasts.sbinstitute.com/fall2010/Phuket_Fall_2010_Archive/Media/11%20Sept%2023%20Morning%20SM.m4a"
        },
        {
            "title": "Session 10: Compassion and the Five Obscurations",
            "datePublished": "Mon, 15 Nov 2010 02:43:29 -0800",
            "description": " ",
            "length": "41517395",
            "sourceUrl": "http://podcasts.sbinstitute.com/fall2010/Phuket_Fall_2010_Archive/Media/10%20Sept%2022%20Evening%20COM.m4a"
        },
        {
            "title": "Session 09: Deepening the Practice of Settling the Mind",
            "datePublished": "Mon, 15 Nov 2010 02:43:27 -0800",
            "description": " ",
            "length": "15524344",
            "sourceUrl": "http://podcasts.sbinstitute.com/fall2010/Phuket_Fall_2010_Archive/Media/9%20Sept%2022%20Morning%20SM.m4a"
        },
        {
            "title": "Session 08: Intro to Compassion",
            "datePublished": "Mon, 15 Nov 2010 02:43:23 -0800",
            "description": " ",
            "length": "38309719",
            "sourceUrl": "http://podcasts.sbinstitute.com/fall2010/Phuket_Fall_2010_Archive/Media/8%20Sept%2021%20Evening%20COM.m4a"
        },
        {
            "title": "Session 07: Intro to Settling the Mind in its Natural State",
            "datePublished": "Mon, 15 Nov 2010 02:43:20 -0800",
            "description": " ",
            "length": "21423161",
            "sourceUrl": "http://podcasts.sbinstitute.com/fall2010/Phuket_Fall_2010_Archive/Media/7%20Sept%2021%20Morning%20SM.m4a"
        },
        {
            "title": "Session 06: Dreaming Big in our Loving Kindness Practice",
            "datePublished": "Mon, 15 Nov 2010 02:43:16 -0800",
            "description": " ",
            "length": "38968153",
            "sourceUrl": "http://podcasts.sbinstitute.com/fall2010/Phuket_Fall_2010_Archive/Media/6%20Sept%2020%20Evening%20LK.m4a"
        },
        {
            "title": "Session 05: Mindfulness of Breathing, Apertures of the Nostrils",
            "datePublished": "Mon, 15 Nov 2010 02:43:13 -0800",
            "description": " ",
            "length": "16802063",
            "sourceUrl": "http://podcasts.sbinstitute.com/fall2010/Phuket_Fall_2010_Archive/Media/5%20Sept%2020%20Morning%20MB.m4a"
        },
        {
            "title": "Session 04: Expanding the Circle of Loving Kindness",
            "datePublished": "Mon, 15 Nov 2010 02:43:10 -0800",
            "description": " ",
            "length": "36954225",
            "sourceUrl": "http://podcasts.sbinstitute.com/fall2010/Phuket_Fall_2010_Archive/Media/4%20Sept%2018%20Evening%20LK.m4a"
        },
        {
            "title": "Session 03: Mindfulness of Breathing, Abdomen",
            "datePublished": "Mon, 15 Nov 2010 02:36:48 -0800",
            "description": " ",
            "length": "12567837",
            "sourceUrl": "http://podcasts.sbinstitute.com/fall2010/Phuket_Fall_2010_Archive/Media/3%20Sept%2018%20Morning%20MB.m4a"
        },
        {
            "title": "Session 02: Intro to Loving Kindness\r",
            "datePublished": "Mon, 15 Nov 2010 01:35:24 -0800",
            "description": " ",
            "length": "40242973",
            "sourceUrl": "http://podcasts.sbinstitute.com/fall2010/Phuket_Fall_2010_Archive/Media/2%20Sept%2017%20Evening%20LK.m4a"
        },
        {
            "title": "Session 01: Mindfulness of Breathing in the Infirmary",
            "datePublished": "Mon, 15 Nov 2010 00:25:28 -0800",
            "description": "<a href=\"http://podcasts.sbinstitute.com/fall2010/Phuket_Fall_2010_Archive/Media/1%20Sept%2017%20Morning%20MB%20copy.m4a\"><img src=\"http://podcasts.sbinstitute.com/fall2010/Phuket_Fall_2010_Archive/Podcast/Media/1%20Sept%2017%20Morning%20MB%20copy.png\" style=\"float:left; padding-right:10px; padding-bottom:10px; width:144px; height:144px;\"/></a> ",
            "length": "14098769",
            "sourceUrl": "http://podcasts.sbinstitute.com/fall2010/Phuket_Fall_2010_Archive/Media/1%20Sept%2017%20Morning%20MB%20copy.m4a"
        }
    ]
}