{
    "artwork": "http://is3.mzstatic.com/image/thumb/Music62/v4/c7/5a/cf/c75acf0f-5f94-1199-451e-d56ccc46b809/source/100x100bb.jpg",
    "description": "The mission of Apologetics.com is to provide cutting-edge resources and training in Christian apologetics to the public through our website and related activities. Challenging believers to think and thinkers to believe.",
    "feedURL": "http://apologetics.com/podcast/Apologetics.comWeeklyRadioShow.xml",
    "podcastURL": "http://www.apologetics.com",
    "title": "Apologetics.com Radio Show",
    "episodes": [
        {
            "title": "Modern Culture and the Conceit of Affluence",
            "datePublished": "Tue, 27 Oct 2020 12:31:23 -0700",
            "description": "We see there are differences between the older and younger generations regarding culture and what we value. This disparity is prevalent not simply in secular society but also in the church. Here we explore why young people see the world differently and how both sides can overcome their biases to understand the world in a more realistic context.",
            "length": "54335866",
            "sourceUrl": "http://apologeticscom.s3.amazonaws.com/RadioShows/201017_affluence.mp3"
        },
        {
            "title": "Examining the Evidence for Systemic Racism",
            "datePublished": "Wed, 21 Oct 2020 05:16:45 -0700",
            "description": "<p>Part of the Apologetics.com Radio Show series, preached at a Saturdays service\n<br />As apologists, we bring logic, reason and evidence to bear on arguments that are raised against the Christian worldview. In this show, Jason and Tony take an evidence based look at Critical Race Theory, systemic racism and the arguments behind the Black Lives Matter organization. Is systemic racism the only answer for why incarceration rates are 6x for black people? We want to take an honest look at this situation with the goal of acting justly, loving mercy and walking humbly with our God. Join us for this conversation and feel free to chime in via email (jason@apologetics.com) or on our Facebook page.</p>",
            "length": "54526456",
            "sourceUrl": "http://apologeticscom.s3.amazonaws.com/RadioShows/201010_race.mp3"
        },
        {
            "title": "Should Christians Engage in Politics?",
            "datePublished": "Mon, 12 Oct 2020 08:16:52 -0700",
            "description": "<p>On this episode Jacob Daniel, Harry Edwards and special guest Logan Zeppieri discuss the role Christians play in politics. We try to answer the question \"Should Christians engage in politics and to what extent?\" This topic was spurned by recent events surrounding the arrests made at a church in Moscow, ID for violating local mandates related to COVID restrictions. Some of the questions we delve into are:</p>\n\n<p>1. What does the Bible say about politics? Is it a necessary evil? Or is there virtue found in politics?</p>\n\n<p>2. Why has the topic of politics even become an issue for Christians today? In other cultures, say the Muslims, their faith and politics are viewed in the same way—very little distinction between the two. Do we think there’s any good in viewing politics similarly to how the Muslim view theirs?</p>",
            "length": "54668980",
            "sourceUrl": "http://apologeticscom.s3.amazonaws.com/RadioShows/200926_faithandpolitics.mp3"
        },
        {
            "title": "How Then Do We Live as Christians in a Broken World",
            "datePublished": "Sat, 10 Oct 2020 14:43:17 -0700",
            "description": "In this show, Bob Parucha and Michael Robirds discuss how we are to live in the context of today's situation. They touch on the important topics of sanctification, fighting our own sin, justification and the relationship between faith and works.",
            "length": "54383514",
            "sourceUrl": "http://apologeticscom.s3.amazonaws.com/RadioShows/200912_tolive.mp3"
        },
        {
            "title": "Walking the Line Between Church and State",
            "datePublished": "Sat, 10 Oct 2020 05:58:22 -0700",
            "description": "Because God has ordained the family, the church, and the state, we must, as Chrisitans engage with the political sphere. On this show, we talk about justice and our government and the way in which they have been regulating church activities. How should Christians be responding? Are these mandates examples of political tyranny? How should Christians be thinking through these topics and where do we begin our thought process? The famous Presbyterian Reformer John Knox declared that resistance to tyranny is obedience to God. Are we at that point? If not now, when? Tune in as we discuss this topic and take calls from our listeners.",
            "length": "51791749",
            "sourceUrl": "http://apologeticscom.s3.amazonaws.com/RadioShows/200808_churchstate.mp3"
        },
        {
            "title": "How Has Church Changed During the Pandemic of 2020?",
            "datePublished": "Wed, 02 Sep 2020 09:19:56 -0700",
            "description": "Jon Noyes and Harry Edwards discuss the changes churches have undergone since the pandemic. We invite a couple of listeners to express their opinions on how the pandemic has affected their weekly gatherings.",
            "length": "55239494",
            "sourceUrl": "http://apologeticscom.s3.amazonaws.com/RadioShows/200828_church.mp3"
        },
        {
            "title": "Christianity, Kids, and the Crisis of Despair",
            "datePublished": "Wed, 26 Aug 2020 15:08:29 -0700",
            "description": "The newest CDC report shows that anxiety, depression, and thoughts of suicide have skyrocketed in young people--especially those in the 18-24 year old age group. This problem has bee growing for a few years, thought he pandemic has highlighted the crisis. Here, Lenny is joined by therapist Tom Thomazin to discuss some of the causes of despair among youth today and how both the Church and families can work to help them overcome their anxieties.",
            "length": "54454985",
            "sourceUrl": "http://apologeticscom.s3.amazonaws.com/RadioShows/200822_kidsincrisis.mp3"
        },
        {
            "title": "Covid-19 and Mental Health",
            "datePublished": "Wed, 19 Aug 2020 12:45:14 -0700",
            "description": "On this episode of the Apologetics.com Radio, host Jon Noyes is joined by Dr Loren Martin from Azusa Pacific University. They discuss the effects Covid-19 is having on the mental health of the nation.",
            "length": "54930622",
            "sourceUrl": "http://apologeticscom.s3.amazonaws.com/RadioShows/200815_covid.mp3"
        },
        {
            "title": "The Great Awokening [sic]: CRT and its Effect on the Church",
            "datePublished": "Mon, 27 Jul 2020 07:41:28 -0700",
            "description": "On this show, we've invited Monique Duson, founder and president of Center for Biblical Unity, to share her compelling experience grappling with the nuances of Critical Race Theory. We will attempt to answer questions such as \"What is Critical Race Theory?,\" \"How can we tell if a church has adopted CRT?,\" \"Is CRT similar to the Gospel?\" and a host of other related questions.",
            "length": "55715132",
            "sourceUrl": "http://apologeticscom.s3.amazonaws.com/RadioShows/200725_crt.mp3"
        },
        {
            "title": "Soap and Water: How Science Has taken Millennia to Catch Up With the Wisdom Found in Scripture",
            "datePublished": "Mon, 27 Jul 2020 07:20:00 -0700",
            "description": "What does the Bible have to say about infectious disease and how does what it says relate to the Gospel of Jesus Christ? Find out this and more as we unpack Old Testament Scriptures that show us the fingerprints of God and also display his common grace to the whole world!",
            "length": "50721773",
            "sourceUrl": "http://apologeticscom.s3.amazonaws.com/RadioShows/200509_science.mp3"
        },
        {
            "title": "The Dangers of Progressive Christianity",
            "datePublished": "Mon, 13 Jul 2020 09:41:02 -0700",
            "description": "In this show, Jason and Tony talk about “Progressive Christianity” and the danger of losing sight of the gospel. We also talk about the importance of speaking to people’s hearts along with their minds when we evangelize and engage in apologetics. Tune in and share with those you love.",
            "length": "54454985",
            "sourceUrl": "http://apologeticscom.s3.amazonaws.com/RadioShows/200711_progressivexianity.mp3"
        },
        {
            "title": "The Church Has Left the Building",
            "datePublished": "Mon, 13 Jul 2020 09:28:55 -0700",
            "description": "In this conversation Jason, Eddie and Daniel discuss the biblical doctrine of the church and what it means for something to be essential. How much value do we place on the gathering of the saints? Is it vital to our health and well being? Tune in as we discuss this and related topics.",
            "length": "53717705",
            "sourceUrl": "http://apologeticscom.s3.amazonaws.com/RadioShows/200613_churchleft.mp3"
        },
        {
            "title": "The Good, The Bad and Coronavirus",
            "datePublished": "Mon, 13 Jul 2020 09:15:46 -0700",
            "description": "<p>In this show we talk about Ethics, the Knowledge of Good and Evil and the Corona Virus. Can you see the hand of God in the midst of all that is going on around the globe? Listen in to hear how the Sovereignty of God can be clearly seen during this precarious season of life. </p>\n\n<p>[Sorry for the metronome in the background. There was an error in the conversion process.]</p>",
            "length": "54668980",
            "sourceUrl": "http://apologeticscom.s3.amazonaws.com/RadioShows/200314.mp3"
        },
        {
            "title": "Race and Culture",
            "datePublished": "Wed, 10 Jun 2020 06:46:30 -0700",
            "description": "On this episode of the Apologetics.com Radio Show, Jon and Eric discuss the racial tensions we are feeling and explore how we can move towards a culture that seems to be increasingly divided.",
            "length": "53265891",
            "sourceUrl": "http://apologeticscom.s3.amazonaws.com/RadioShows/200606_riots.mp3"
        },
        {
            "title": "Kobe",
            "datePublished": "Tue, 21 Apr 2020 17:36:26 -0700",
            "description": "Jon, Eric, and Chang discuss all things Kobe Bryant in the wake of his sudden death in a helicopter crash. Join the discussion as they explore why the death of this celebrity/athlete is so important.",
            "length": "54835328",
            "sourceUrl": "http://apologeticscom.s3.amazonaws.com/RadioShows/200201_kobe.mp3"
        },
        {
            "title": "Is Christianity Compatible with Science?",
            "datePublished": "Tue, 21 Apr 2020 17:30:59 -0700",
            "description": "Can you be a scientist and a Christian? How do Christianity and science interact? These are just some of the questions explored as hosts Jon Noyes and Dr. Leslie Wickman take to airwaves this week on Apologetics.com Radio. They also take listener phone calls.",
            "length": "26587973",
            "sourceUrl": "http://apologeticscom.s3.amazonaws.com/RadioShows/200118_science.mp3"
        },
        {
            "title": "Loving Your Neighbor During a Pandemic",
            "datePublished": "Sat, 11 Apr 2020 20:19:06 -0700",
            "description": "There is not a more relevant topic to be discussing right now, other than COVID-19. Join us as we discuss a variety of moral, social and biblical issues that are related to this pandemic and the way it is being handled across the nation. Are we doing a good job loving our neighbor, how valuable is our individual liberty during this time and how can we move our country forward in a wise and loving manner...?? Listen in as we discuss these things and take calls from our listeners.",
            "length": "51031063",
            "sourceUrl": "http://apologeticscom.s3.amazonaws.com/RadioShows/200411_covid19.mp3"
        },
        {
            "title": "How Christians Ought to Behave During a Pandemic",
            "datePublished": "Wed, 01 Apr 2020 14:35:24 -0700",
            "description": "These are uncertain times. We are in a world war. The enemy is invisible and much of society is in crisis mode. In this episode of the Apologetics.com Radio show, Harry Edwards talks to Lenny Esposito and Dr. Jacob Daniel to discuss how Christians ought to behave during a pandemic. We take our cues from history to consider how our forebears dealt with similar circumstances. We also consider how this crisis has potential for greater things to come while being cognizant of the dangers if we lose hope in Christ and in each other.",
            "length": "55691308",
            "sourceUrl": "http://apologeticscom.s3.amazonaws.com/RadioShows/200328_corona.mp3"
        },
        {
            "title": "Catholic and Protestant Conversations: Why They Matter",
            "datePublished": "Tue, 03 Mar 2020 09:56:59 -0800",
            "description": "On this episode of the Apologetics.com Radio Show, Harry Edwards hosts Anthony Costello who converted from Catholicism to Evangelicalism and Andrew Morgan who converted from Evangelicalism to Catholicism. Listen as they recount the reasons for their switch to rich traditions that appear to have little to do with each other. Each lay out the importance of having continued conversations around important issues primarily for the main reason that Jesus desires his church to be united in faith, hope and love.",
            "length": "54264813",
            "sourceUrl": "http://apologeticscom.s3.amazonaws.com/RadioShows/200229_ecumenism.mp3"
        },
        {
            "title": "Answering Rhett & Link's Spiritual Deconstruction",
            "datePublished": "Mon, 24 Feb 2020 14:42:30 -0800",
            "description": "There’s a lot of concern over the growing trend of young people leaving the church. The exodus has included high profile Christian leaders like Josh Harris and Marty Sampson. Now, the two hugely popular YouTube stars who host “Good Mythical Morning” have publicly announced how they also lost their faith. In this show, Lenny Esposito, Harry Edwards, and Jacob Daniel consider the stories of Rhett and Link, examine their objections to Christianity, and mark specific points where Christians need to do better in addressing the doubts of young people today.",
            "length": "54859151",
            "sourceUrl": "http://apologeticscom.s3.amazonaws.com/RadioShows/200222_deconversion.mp3"
        },
        {
            "title": "Loving Our Catholic Neighbor: A Dialogue with Gavin Ashenden",
            "datePublished": "Fri, 14 Feb 2020 17:49:46 -0800",
            "description": "<p>Join us for a fascinating show on Catholicism and Christianity as we discuss places of commonality and differences and whether they are matters of eternal significance. With special guest Tony Yu.</p>\n\n<p>A snapshot of Gavin Ashenden:\n<br />Ordained as an Anglican priest in 1980. Later became the Vicar of a Church on the edge of South London. In the 1980’s when he was also vice-chair of Keston College, he was involved in smuggling bibles and medicine into the former Soviet Union.\n<br />Occasionally arrested and interrogated by the KGB and other security services.</p>\n\n<p>He spent 23 years at the University of Sussex as a senior lecturer and senior chaplain, lecturing in the Psychology of Religion, Literature, and convening an MA programme in Monotheist Mysticism. In 2008 he was appointed a Chaplain to the Queen. In 2017 he resigned from his chaplaincy to the Queen in order to be free to speak out for the faith in the contested public forum, and subsequently appeared on media outlets across the world, including Fox News in the USA and the Bolt Report in Australia.</p>\n\n<p>Convinced that the consecration of women to the episcopate represented the replacement of apostolic and biblical patterns with the competing culture of the values of Cultural Marxism, and dissenting from the increasing accommodation of the Church of England to radical secular views on gender, he resigned from the Church of England in 2017. On Sunday 22nd of December, Dr Ashenden was received into the Roman Catholic.</p>",
            "length": "51577754",
            "sourceUrl": "http://apologeticscom.s3.amazonaws.com/RadioShows/200111_ecumenism.mp3"
        },
        {
            "title": "General Cultural Apologetics",
            "datePublished": "Fri, 14 Feb 2020 16:46:17 -0800",
            "description": "Jon, Eric and Daniel talk about a variety of current cultural themes (e.g. Kanye, Joshua Harris, etc.) and its application to apologetics.",
            "length": "104023670",
            "sourceUrl": "http://apologeticscom.s3.amazonaws.com/RadioShows/200104_culture.mp3"
        },
        {
            "title": "Fresh Look at the Christmas Narrative",
            "datePublished": "Fri, 14 Feb 2020 08:47:42 -0800",
            "description": "Jon and his co-host Eric talk about Christmas traditions, culture and a historical perspective of the birth narrative of Jesus. What really happened that day? Have our cultural images of Christmas distorted the events reported in the Gospels? Does it make a difference? Tune in and learn to separate myth from fact on the birth of our Lord Jesus.",
            "length": "38384724",
            "sourceUrl": "http://apologeticscom.s3.amazonaws.com/RadioShows/191207_xmas.mp3"
        },
        {
            "title": "Sci-Fi Movies and Their Utility in a Christian Worldview",
            "datePublished": "Fri, 14 Feb 2020 08:35:04 -0800",
            "description": "Jon and Leslie discuss the philosophical underpinnings of some of the popular sci-fi movies and their implications as aids to understand and undergird the Christian worldview.",
            "length": "24987170",
            "sourceUrl": "http://apologeticscom.s3.amazonaws.com/RadioShows/191116_scifi.mp3"
        },
        {
            "title": "How to Love a Muslim in America: An Interview with Wali Razaqi",
            "datePublished": "Sat, 28 Dec 2019 08:57:20 -0800",
            "description": "Born in Afghanistan, Wali and his family moved to the U.S. when he was just three years old. He was raised Muslim and found a way to keep practicing his Islamic faith while building a successful career in film & television. In addition to producing and acting, Wali made a name for himself winning the Sundance film festival, becoming the president at TapouT, and being honored with his own day & a key to city of Santa Cruz. He’d found a comfortable balance of being a Muslim and living the American dream...until 4 years ago. A bizarre late-night encounter at a Hollywood gas station with a football and Justin Bieber, inspired the start of a life changing journey of self reflection, re-examination of faith, and an unimaginable discovery within the Quran. All of which helped lead Wali to accept the fullness of God's grace and love through the death & resurrection of Jesus Christ. With his deep knowledge of Islam and his personal methods of self & religious examination, Wali has been traveling the country discussing a timely and relevant topic, “How To Love A Muslim in America”. He boldly teaches audiences how to talk with Muslims about the truth of who Jesus is without offending anyone. Wali will share all of this along with his inspiring, entertaining journey of faith.",
            "length": "38489864",
            "sourceUrl": "http://apologeticscom.s3.amazonaws.com/RadioShows/191214_muslim.mp3"
        },
        {
            "title": "The Case for Domestic Apologetics: Why We Need to Defend the Truth Claims of Christianity in the West",
            "datePublished": "Sun, 22 Dec 2019 06:55:42 -0800",
            "description": "Hosted by Jon Noyes, our team discuss the importance of concentrating missions efforts and focus to help save the West by deploying apologetics in our churches.",
            "length": "26255676",
            "sourceUrl": "http://apologeticscom.s3.amazonaws.com/RadioShows/191130_domesticmissions.mp3"
        },
        {
            "title": "Church and State",
            "datePublished": "Mon, 09 Dec 2019 15:28:42 -0800",
            "description": "In this episode we talk about the relationship between our Biblical Worldview and our understanding and involvement in civic affairs. Some of the topics include the Separation of Church and State, the role of the Gospel in the Transformation of the Nations, and the Relationship between Ethics, Law, and Justice. We also take some calls from our listeners regarding our duty to pray for our leaders.",
            "length": "25510664",
            "sourceUrl": "http://apologeticscom.s3.amazonaws.com/RadioShows/191109_churchstate.mp3"
        },
        {
            "title": "The Conversion of Kanye West",
            "datePublished": "Mon, 04 Nov 2019 15:38:54 -0800",
            "description": "On this episode of the Apologetics.com Radio, Jon, Chang and Eric discuss the recent conversion of Kanye West and his new album. Listen as they discuss the impact this has on Christian culture and on culture at large.",
            "length": "25448179",
            "sourceUrl": "http://apologeticscom.s3.amazonaws.com/RadioShows/191102_kanye.mp3"
        },
        {
            "title": "Transhumanism: Humans 2.0",
            "datePublished": "Mon, 28 Oct 2019 13:34:57 -0700",
            "description": "In this episode of the Apologetics.com Radio, our team led by Harry Edwards discuss Dr. Fuz Rana's new book \"Humans 2.0\" which sheds light on the scientific, philosophical and theological perspectives and implications of transhumanism. Tune in to listen and learn about the latest technological advancements, human flourishing aspects and promise of the Gospel to restore and redeem this broken world. Also, learn about the scope and limits of transhumanism and what it means for human flourishing.",
            "length": "25083928",
            "sourceUrl": "http://apologeticscom.s3.amazonaws.com/RadioShows/191026_transhumanism.mp3"
        },
        {
            "title": "What Does the Bible Say About the Environment?",
            "datePublished": "Sun, 27 Oct 2019 09:37:15 -0700",
            "description": "On this episode of apologetics.com radio hosts Jon Noyes and Leslie Wickman discuss the importance of protecting the environment. Join us as we pursue a biblical understanding of this important and popular topic.",
            "length": "50968369",
            "sourceUrl": "http://apologeticscom.s3.amazonaws.com/RadioShows/191019_asa.mp3"
        },
        {
            "title": "How Mathematical Truth Refutes Evolution",
            "datePublished": "Sun, 27 Oct 2019 09:28:35 -0700",
            "description": "In this episode we discuss how numbers and mathematical truths, which are unchanging by nature, refute the secular worldview of evolutionary change over time. We also discuss how a renowned computer science professor from Yale University leaves Darwinism for mathematical reasons and touch briefly on what we can glean from Kanye West’s recent conversion and his “Sunday services”. May you be encouraged and equipped to share the gospel with those around you!",
            "length": "50173411",
            "sourceUrl": "http://apologeticscom.s3.amazonaws.com/RadioShows/191012_math.mp3"
        },
        {
            "title": "Suicide",
            "datePublished": "Sun, 27 Oct 2019 09:03:34 -0700",
            "description": "Did you know that the suicide rate has increased 30% since 1999? Suicide is now the 2nd leading cause of death in the US for ages 10-34. On this episode of apologetics.com radio join Jon Noyes and a team of others as they pursue a biblical understanding of this difficult topic.",
            "length": "50934097",
            "sourceUrl": "http://apologeticscom.s3.amazonaws.com/RadioShows/191005_suicide.mp3"
        },
        {
            "title": "American Scientific Affiliation Annual Conference Update",
            "datePublished": "Sun, 27 Oct 2019 09:05:21 -0700",
            "description": "Join hosts Jon Noyes and Leslie Wickman on this episode of apologetics.com radio as they review the American Scientific Affiliations annual conference.",
            "length": "50411230",
            "sourceUrl": "http://apologeticscom.s3.amazonaws.com/RadioShows/190921_asa.mp3"
        },
        {
            "title": "Why I Still Believe",
            "datePublished": "Mon, 21 Oct 2019 10:34:14 -0700",
            "description": "Ex-atheist Mary Jo Sharp joined Lenny in the studio to discuss why her struggles with Christians in the church did not dissuade her from holding onto the truth claims of Christianity. At a time when de-conversion stories have become all too common, Mary Jo's questions ultimately led her to irresistible hope.",
            "length": "50483955",
            "sourceUrl": "http://apologeticscom.s3.amazonaws.com/RadioShows/190928_maryjo.mp3"
        },
        {
            "title": "Building Your House on the Rock",
            "datePublished": "Sat, 19 Oct 2019 08:21:36 -0700",
            "description": "In this episode, Jason Gallagher, Daniel Adrean and Eddie Anorga discuss the importance of building your thinking and apologetic methodology on the rock solid foundation of Scripture. During our discussion, we hear from a caller with a friend whose birthday adds up to the number 666. It was a great teaching point to show the practical implications and importance of building our thinking on Scripture rather than some mathematical model that turns birth-dates into something that determines a person's eternal destiny. Be sure to tune in and share this episode with those you love!",
            "length": "51171915",
            "sourceUrl": "http://apologeticscom.s3.amazonaws.com/RadioShows/190914_houseonrock.mp3"
        },
        {
            "title": "Importance of Story in Apologetics",
            "datePublished": "Sat, 19 Oct 2019 08:14:24 -0700",
            "description": "Jon Noyes and the Apologetics Radio team talk about the importance of engaging the skeptic using the power of story.",
            "length": "51432304",
            "sourceUrl": "http://apologeticscom.s3.amazonaws.com/RadioShows/190907_story.mp3"
        },
        {
            "title": "Live Encounter with a Steamroller",
            "datePublished": "Tue, 17 Sep 2019 09:37:40 -0700",
            "description": "Greg Koukl, in his Tactics book, describes a \"steamroller\" in the context of an apologetics engagement. A steamroller is a person with whom you disagree about fundamental issues and in the course of a conversation refuses to listen and acknowledge the civil give and take required to achieve fruitful interactions around a subject. Our radio team led by Jon Noyes encountered such a person while we took calls. Listen and discern some of the lessons or techniques employed by the radio team in handling the caller.",
            "length": "51916301",
            "sourceUrl": "http://apologeticscom.s3.amazonaws.com/RadioShows/190831_misc.mp3"
        },
        {
            "title": "Classic Christian Thinkers",
            "datePublished": "Thu, 05 Sep 2019 15:20:21 -0700",
            "description": "In this episode of the Apologetics.com Radio Show we invite Ken Samples, author and speaker to talk about his latest book Classic Christian Thinkers. Here, in survey fashion, we look at the contributions of the following thinkers: Iranaeus, Athanasius, Augustine, Anselm, Aquinas, Martin Luther, Calvin, Pascal and C.S. Lewis.",
            "length": "51053215",
            "sourceUrl": "http://apologeticscom.s3.amazonaws.com/RadioShows/190824_classicchristianthinkers.mp3"
        },
        {
            "title": "Answering the Four Horsemen of Atheism: Hitchens, Dawkins, Harris and Dennett",
            "datePublished": "Fri, 16 Aug 2019 09:37:39 -0700",
            "description": "In this show, host Bob Parucha tackles specific objections of the \"new atheists\" as detailed in the book \"The Four Horsemen\". They look at the so-called \"scientific method\" of the new atheists, they discuss the problem of theodicy and the goodness of God. In response, they highlight how the biblical worldview is the only way to make sense of evil, rationally and emotionally, as well as how Christianity is the only true answer to what ails humankind. Listen in and join the conversation online.",
            "length": "50197235",
            "sourceUrl": "http://apologeticscom.s3.amazonaws.com/RadioShows/190810_atheism.mp3"
        },
        {
            "title": "Leaving Christianity",
            "datePublished": "Thu, 15 Aug 2019 11:28:17 -0700",
            "description": "This week on Apologetics.com Jon, Eric, and Joel discuss the recent news of Christian author and former pastor Joshua Harris that he was no longer Christian. They briefly look at the timeline of events and discuss how to respond biblically to these kinds of issues.",
            "length": "51385910",
            "sourceUrl": "http://apologeticscom.s3.amazonaws.com/RadioShows/190803_leavingchrist.mp3"
        },
        {
            "title": "Helpful Apologetics Methods and Tips",
            "datePublished": "Mon, 29 Jul 2019 15:34:13 -0700",
            "description": "In this episode of the Apologetics.com Radio Show, Lenny Esposito and Dr. Jacob Daniel share their favorite apologetics tips and methods to defend the truth claims of Christianity. Listen and learn how to effectively engage and persuade your listener on ultimate issues pertaining to faith, truth and reason.",
            "length": "50815396",
            "sourceUrl": "http://apologeticscom.s3.amazonaws.com/RadioShows/190727_apologeticstips.mp3"
        },
        {
            "title": "A Change of Affection: A Gay Man's Incredible Story of Redemption",
            "datePublished": "Fri, 19 Jul 2019 10:41:16 -0700",
            "description": "In this show we discuss Becket Cook's upcoming book release and how we can go about loving and reaching our LGBTQ neighbors. One key point of discussion is the issue of identity. As Becket shares, we don't see people organizing \"greed pride\" parades because, although we all struggle with greed, it does not become a person's core identity. With homosexuality, however, it becomes very difficult to repent, or turn away, from something that has become an integral part of who you are as a person. And without repentance, there is no forgiveness. This and much more is part of this intriguing and informative show. Be sure and share it with those you love!",
            "length": "52197587",
            "sourceUrl": "http://apologeticscom.s3.amazonaws.com/RadioShows/190713_lgbt.mp3"
        },
        {
            "title": "Columbo Tactic",
            "datePublished": "Tue, 09 Jul 2019 10:16:26 -0700",
            "description": "On this episode of Aplogetics.com Radio Host Jon Noyes is joined by Eric Horne and Chang Yuon as they discuss Greg Koukl's book Tactics: A game plan for discussion your Christian convictions. They focus especially on the Columbo Tactic which helps anyone get into the drivers seat and navigate conversations without feeling any pressure to \"seal the deal.\" Join us as we explore how to talk to the average person about amazing things.",
            "length": "52915223",
            "sourceUrl": "http://apologeticscom.s3.amazonaws.com/RadioShows/190706_columbo.mp3"
        },
        {
            "title": "Effective Apologetics",
            "datePublished": "Mon, 08 Jul 2019 09:40:19 -0700",
            "description": "This show recaps some of the topics discussed in the month of June. A caller asks each of our hosts what we consider a good effective apologetics tactic. Listen as Jon Noyes, Leslie Wickman and Harry Edwards respond to the question.",
            "length": "51077039",
            "sourceUrl": "https://apologeticscom.s3.amazonaws.com/RadioShows/190629_misc.mp3"
        },
        {
            "title": "Deconversion Part 2",
            "datePublished": "Thu, 27 Jun 2019 10:49:48 -0700",
            "description": "<p>On this episode we continue with the discussion on deconversion hosted and facilitated by Dr. Jacob Daniel on May 25, 2019. Here we specifically expound on Dr. John Marriott's book \"A Recipe for Disaster\" in which he explains four factors churches and parents contribute to the process of weakening believer's doubts that ultimately lead to renouncing the Christian faith: over-prepared, ill-prepared, ill-prepared and painfully prepared. </p>\n\n<p>This show was hosted by Harry Edwards with panelist Chris Sandoval, Lenny Esposito and Dr. Jacob Daniel.</p>",
            "length": "54453313",
            "sourceUrl": "http://apologeticscom.s3.amazonaws.com/RadioShows/190622_deconversion.mp3"
        },
        {
            "title": "How Reason Can Lead To God",
            "datePublished": "Wed, 26 Jun 2019 17:01:48 -0700",
            "description": "<p>On this show, Harry Edwards facilitates a conversation between a scientist, Dr. Leslie Wickman and a philosopher, Dr. Joshua Rasmussen on how reason can lead to God.</p>\n\n<p>Here you'll find a teaser for Dr. Rasmussen's upcoming book titled \"How Reason Can Lead to God.\" Do you value reason, science, and independent thinking, yet you hope there could be a greater purpose to the universe? Beginning with his own story of losing the belief in any ultimate purpose in life, philosopher Joshua Rasmussen builds a bridge to faith. Using only the instruments of reason and common experience, Rasmussen constructs a pathway that he argues can lead to meaning and, ultimately, a vision of God.</p>",
            "length": "53050224",
            "sourceUrl": "http://apologeticscom.s3.amazonaws.com/RadioShows/190615_reason.mp3"
        },
        {
            "title": "Should We Argue God's Existence?",
            "datePublished": "Wed, 26 Jun 2019 16:15:32 -0700",
            "description": "On this episode of Apologetics.com, brought to you by Branch of Hope OPC (www.branchofhope.org), daniel adrean talks to us about talking about God. Should we argue for God's existence? Can we? Should we prove God's existence? Is that possible? He also introduces us to various discussions regarding the \"cosmological arguments\" and \"teleological arguments\" for the existence of God and advances the Biblical method of defending our faith.",
            "length": "52765176",
            "sourceUrl": "http://apologeticscom.s3.amazonaws.com/RadioShows/190608godexist.mp3"
        },
        {
            "title": "The Gospel and the First Amendment",
            "datePublished": "Wed, 12 Jun 2019 08:54:20 -0700",
            "description": "Join host Jonathan Noyes and Eric Horne as they recap the Get a Grip presentation by Mike Adams in which he explained three threats to liberty students face on the college campus. From there they discuss the importance of the First Amendment and the protection of free speech, even offensive ones in light of the idea that the Good News is offensive speech.",
            "length": "51116745",
            "sourceUrl": "http://apologeticscom.s3.amazonaws.com/RadioShows/190601_firstamendment.mp3"
        },
        {
            "title": "Deconversion",
            "datePublished": "Tue, 04 Jun 2019 08:53:49 -0700",
            "description": "<p>Why do some people leave their faith? What motivates them to take this step? Do Christians have credible answers to the questions they raise? If you are interested in these questions, and wish to learn about \"De-conversion\" and how to instill a faith that endures, you will enjoy listening to this episode of the Apologetics.com Radio Show.</p>\n\n<p>This show is hosted by Dr. Jacob Daniel. Guests include distinguished scholars and apologists Dr. John Marriott, Dr. Michael Chamberlain, Mr. Finney Premkumar and Mr. Prashanth Daniel.</p>",
            "length": "47272356",
            "sourceUrl": "http://apologeticscom.s3.amazonaws.com/RadioShows/190525_deconversion.mp3"
        },
        {
            "title": "Are We Alone?",
            "datePublished": "Tue, 04 Jun 2019 08:46:15 -0700",
            "description": "Join Jon and Leslie as they discuss the idea that there might be life on other planets. What are the chances? Why? Whats' the significance? These are just some of the questions they address.",
            "length": "53169342",
            "sourceUrl": "http://apologeticscom.s3.amazonaws.com/RadioShows/190518_arewealone.mp3"
        },
        {
            "title": "Millennials and Spirituality",
            "datePublished": "Tue, 21 May 2019 05:47:58 -0700",
            "description": "On this episode of apologetics.com radio host Jason Gallagher and special guest Bob Parucha will be discussing what “spirituality” means to millennials today who do not have the default biblical worldview that previous generations grew up with. They will be comparing it with the definition of the spiritual man/woman as defined by scripture.",
            "length": "50720101",
            "sourceUrl": "http://s3.amazonaws.com/apologeticscom/RadioShows/190511_millenials.mp3"
        },
        {
            "title": "Reliability of the Bible",
            "datePublished": "Mon, 06 May 2019 09:53:21 -0700",
            "description": "Is the Bible reliable? Where did it come from? Is the Bible’s reliability even important? These are some of the questions Jon, Eric and Steve will be discussing on this episode. Last week Dr. Sean McDowell spoke about Biblical Reliability at the annual Get A Grip conference in Newbury Park. On the show tonight we will carry on the conversation and review what Dr. McDowell taught.",
            "length": "52600082",
            "sourceUrl": "http://s3.amazonaws.com/apologeticscom/RadioShows/190504_relofbible.mp3"
        },
        {
            "title": "Why Education Matters",
            "datePublished": "Wed, 01 May 2019 15:18:04 -0700",
            "description": "<p>Our society today has a functionalist view of education. What that means in popular culture today is education is defined and measured solely on the basis of better job prospects at the end of a process. In other words, one ought to get the best education in order to get the best job, in order to be successful, and so on.</p>\n\n<p>We no longer consider and appreciate the formative power that education brings to the imagination, creativity and other social advantages that come along with it. In this show we will attempt to demonstrate the difference between good education and the misguided ones; consequences of apathy on the subject and presenting good alternatives such as the Chesterton School of Liberal Arts.</p>",
            "length": "52358919",
            "sourceUrl": "http://s3.amazonaws.com/apologeticscom/RadioShows/190427_education.mp3"
        },
        {
            "title": "Science of the Crucifixion with Guest Dr. Cahleen Shrier",
            "datePublished": "Thu, 25 Apr 2019 10:52:21 -0700",
            "description": "On this episode of apologetics.com radio, Hosts Jon and Dr. Wickman interview Dr. Cahleen Shrier.  Dr. Shrier is a professor of Biology and Chemistry at Azusa Pacific University and for many years she has taught her General Biology students about the Science of the Crucifixion. Focusing on the physiological components of Christ’s crucifixion, she provides a window into the suffering Jesus experienced and the depth of the sacrifice made on the cross. Tonight on the show she will walk us through the Stations of the Cross and why it’s important to grasp the physiology of the Crucifixion.",
            "length": "52955347",
            "sourceUrl": "http://s3.amazonaws.com/apologeticscom/RadioShows/190420_crux.mp3"
        },
        {
            "title": "Human Trafficking and the Importance of Foster Care, an interview with Susan Patterson",
            "datePublished": "Thu, 25 Apr 2019 10:45:47 -0700",
            "description": "In this episode Jason and Susan address the problem of human trafficking and how we can help. The first half of the show is spent largely defining terms and discussing just how massive of a problem this really is.  During the last half of the show they discussed ways we can help, focusing on foster care and how important foster care is for our children.",
            "length": "52087246",
            "sourceUrl": "http://s3.amazonaws.com/apologeticscom/RadioShows/190413_humantraffic.mp3"
        },
        {
            "title": "Why Does God Allow Evil?",
            "datePublished": "Fri, 12 Apr 2019 15:04:05 -0700",
            "description": "On this episode of apologetics.com radio Jon, Eric and Steve discuss the four main points of Dr. Clay Jones book, “Why Does God Allow Evil”. Why do we suffer, humans depravity, free will, and the Glory of Eternal Life. The problem of evil is considered the “rock of Atheism” and one of the most emotionally difficult questions to deal with, even as a Christian. The question “Why do bad things happen to good people” is on the forefront of everyone's mind, with natural disasters, cancer and mass shootings affecting everybody and leaving them wondering...Where’s God. Dr. Jones’ book and The Christian Worldview will answer these questions for us.",
            "length": "52907700",
            "sourceUrl": "http://s3.amazonaws.com/apologeticscom/RadioShows/190406_evil.mp3"
        },
        {
            "title": "Paul Gould on Cultural Apologetics",
            "datePublished": "Fri, 05 Apr 2019 16:33:46 -0700",
            "description": "Dr. Jacob Daniel interviews Dr. Paul Gould about his new book Cultural Apologetics. On the show are Lenny Esposito and Harry Edwards. They discuss how contemporary culture presents us with a disenchanted view of reality, and how as believers we can provide a robust response to the various challenges facing the church today.",
            "length": "52714603",
            "sourceUrl": "http://s3.amazonaws.com/apologeticscom/RadioShows/190330_culturalapologetics.mp3"
        },
        {
            "title": "Abdu Murray Interview on Saving Truth",
            "datePublished": "Fri, 05 Apr 2019 07:53:43 -0700",
            "description": "Jon Noyes interviews Abdu Murray (RZIM) on his latest book Saving Truth.",
            "length": "32102527",
            "sourceUrl": "http://s3.amazonaws.com/apologeticscom/RadioShows/1903_abdumurray.mp3"
        },
        {
            "title": "Abortion: An Inglorius Blight on Culture",
            "datePublished": "Wed, 27 Mar 2019 13:25:32 -0700",
            "description": "<p>This episode starts off with a discussion about reading books by non-christian authors.  Is it ok to read books such as The God Delusion, or should Christians be sticking to strictly “Christian based” apologetics books? The hosts then continue with a in depth look at abortion, one of the most controversial issues of the day.  Should Christians be speaking/sharing in front of clinics, if so how? Has or society devalued human life? Why should we care about abortion if it “doesn’t really affect us”? When is a human actually a human?  All these questions and more.</p>\n\n<p>Mentioned on the Show\n<br />-An Evening with Ravi Zacharias, El Segundo H.S….Event Brite June 28,2019\n<br />-abort73.com\n<br />-Nat Geo Movie “In The Womb”\n<br />-Scott Klusendorf, Life Training Institute Prolifetraining.com</p>",
            "length": "51195739",
            "sourceUrl": "http://s3.amazonaws.com/apologeticscom/RadioShows/190323_abortion.mp3"
        },
        {
            "title": "Examining Exoplanets",
            "datePublished": "Wed, 27 Mar 2019 13:17:04 -0700",
            "description": "In this week's episode of apologetics.com radio Dr. Wickman and Jon discuss exoplanets. What is an exoplanet? How many exoplanets are there? What are some of the methods in detecting exoplanets, and could if we find life on them...could this lead to a multiverse?",
            "length": "53026818",
            "sourceUrl": "http://s3.amazonaws.com/apologeticscom/RadioShows/190316_exoplanets.mp3"
        },
        {
            "title": "Scripture Alone - The Super Standard",
            "datePublished": "Tue, 12 Mar 2019 14:20:14 -0700",
            "description": "<p>In this episode Daniel Adrean (deacon at Branch of Hope OPC in Torrance, California) interviews the Reverend Kent Moorlach, minister of the historic Richland Associate Reformed Presbyterian Church in Shelby County, Tennessee, about the Bible as the only (and therefore the super) standard for the lives, loves, thoughts, feelings, and actions of believers. They explore with us what a standard is; what it means for the Bible to be our supreme, preeminent standard; and how the Bible is to be used in apologetics by the members and officers of Jesus's church.</p>\n\n<p>Pastor Moorlach brings valuable insights from his own experiences, studies, and labors as the minister of a growing congregation that has roots that are quite literally more than one hundred fifty years old. Please listen to learn more about how essential it is that the Bible be the center of our apologetics, and of every aspect of our lives and be blessed as you seek to learn more about and serve the true and living God who perfectly reveals Himself in its pages.</p>",
            "length": "51457381",
            "sourceUrl": "http://s3.amazonaws.com/apologeticscom/RadioShows/190309_bible.mp3"
        },
        {
            "title": "Undeniable: A Review of Dr. Douglas Axe's Latest Book",
            "datePublished": "Mon, 11 Mar 2019 10:12:01 -0700",
            "description": "<p>Daniel Keer and Joel Vaughn joined us from the Science and Culture\n<br />Network. SCN is affiliated with the Discovery Institute. Their main\n<br />purpose is to advance the position that humans are not the consequence\n<br />of random processes, exposing bias in\n<br />science and exposing new scientific ideas related to human origin that\n<br />help explain the gaps in the conventional explanations. They want to\n<br />bring the discussion to everyone.</p>\n\n<p>Check out http://discovery.org/scnsocal</p>\n\n<p>Then we discussed Dr. Axe's presentation. We first explained materialism\n<br />and I think the a brief materialist view. There were two approaches\n<br />described by Dr. Axe as ways to counter arguments from materialist view:\n<br />introspection and observation. The introspective approach was explained\n<br />as a self-defeating argument: In summary: materialists say all that\n<br />exists are physical, but that viewpoint can't explain the existence of\n<br />thoughts. We described the difference between Numerals and Numbers.</p>\n\n<p>The observation approach was explained in terms of randomness and\n<br />likelihood. We explored the alphabet soup example to help characterize\n<br />the level of probability required for things to be as they are observed\n<br />today as explained by a pure science worldview. Big numbers, low odds.</p>\n\n<p>Hosts: Jonathan Noyes, with Eric Horne and guests Joe Vaughn and Daniel Keer from The Southern California Chapter of The Discovery Institute.</p>",
            "length": "52361009",
            "sourceUrl": "http://s3.amazonaws.com/apologeticscom/RadioShows/190302_axe.mp3"
        },
        {
            "title": "The Need for Civility in an Increasingly Uncivilized Society",
            "datePublished": "Mon, 25 Feb 2019 10:03:05 -0800",
            "description": "This show is a rough introduction to some of the ideas that has led to a new desire for civility in against the backdrop of popular media that appear to highlight and glory incivility in modern society. We introduce terms such as modernity, Aristotle's idea of the \"common good\" and Dr. Richard Park's formulation of the \"human good\" as necessary tools to understand, ground and point a way forward to establishing civility in our culture.",
            "length": "49864121",
            "sourceUrl": "http://s3.amazonaws.com/apologeticscom/RadioShows/190223_modernity.mp3"
        },
        {
            "title": "Lessons on Science and Faith from Galileo",
            "datePublished": "Wed, 20 Feb 2019 10:31:20 -0800",
            "description": "On this episode of aplogetics.com radio were taking a look at Galileo and what he taught us about faith and science. Galileo’s conflict with the Church is often portrayed as a clash between science and religion. It might be better characterized as the culmination of a clash between ancient and modern science that had been brewing for centuries, leading up to the Scientific Revolution.  Join us as we discuss what lessons we can learn from Galileo today.",
            "length": "52361009",
            "sourceUrl": "http://s3.amazonaws.com/apologeticscom/RadioShows/190216_galileo.mp3"
        },
        {
            "title": "Is Evolution Scientific?",
            "datePublished": "Sat, 09 Feb 2019 15:04:28 -0800",
            "description": "Join us on this show for a discussion on science and evolution. Central to this topic is the importance of definitions. What is science? What is evolution? Often times these are moving targets that muddy understanding and fruitful dialogue. We also discuss some of the insurmountable problems with Darwinian evolution and bring forth positive arguments for the Intelligent Design position.",
            "length": "51171915",
            "sourceUrl": "http://s3.amazonaws.com/apologeticscom/RadioShows/190209_evolution.mp3"
        },
        {
            "title": "Saving Truth: A Review of Abdu Murray's Latest Book",
            "datePublished": "Tue, 05 Feb 2019 09:35:52 -0800",
            "description": "<p>In this show hosts Jon and Steve discuss Abdu Murray’s latest book “Saving Truth”. Why is truth important and what does it mean to live in a “post-truth” society. Before we can truly enter into logical discussions on any other topic we need to understand truth. We are living in a society where feelings and emotions have been elevated and fact has been dismissed, so what can a Christian do to address this problem.</p>\n\n<p>Callers include:\n<br />-Comments on Abdu Murray at Get a Grip 2019\n<br />-Thoughts on Roman Catholicism and addressing false beliefs</p>",
            "length": "52147014",
            "sourceUrl": "http://s3.amazonaws.com/apologeticscom/RadioShows/190203_savingtruth.mp3"
        },
        {
            "title": "Defending Your Marriage",
            "datePublished": "Wed, 30 Jan 2019 09:50:51 -0800",
            "description": "In this show we invited Dr. Timothy Muehlhoff, communications professor at Biola University and marriage expert, to talk about his new book, Defending Your Marriage. This is an important work because it highlights an oft-overlooked source of marital problems, and that is spiritual battles. The evil one is hell-bent on thwarting successful marriages for obvious reasons. Listen as we discuss his schemes and how to combat them.",
            "length": "51433558",
            "sourceUrl": "http://s3.amazonaws.com/apologeticscom/RadioShows/190126_marriage.mp3"
        },
        {
            "title": "Christology: The Incarnation and The Trinity",
            "datePublished": "Tue, 15 Jan 2019 15:25:12 -0800",
            "description": "On this episode of the ADC Radio show we talk about Christology, specifically the Incarnation and the Trinity. These are two watershed doctrines that every Christian should be familiar with. Join Daniel Adrean and Jason Gallagher as they discuss these doctrines and some common objections to them.",
            "length": "51695200",
            "sourceUrl": "http://s3.amazonaws.com/apologeticscom/RadioShows/190112_christology.mp3"
        },
        {
            "title": "Story of Reality: Part 2",
            "datePublished": "Tue, 15 Jan 2019 10:47:09 -0800",
            "description": "This week on the show Jon, Steve and Eric finish up their series on The Story of Reality discussing The Cross and what it means to be Holy. They also discuss the upcoming Get A Grip apologetics speaker series from Living Oaks Community Church.",
            "length": "54809832",
            "sourceUrl": "http://s3.amazonaws.com/apologeticscom/RadioShows/190105_storyofreality.mp3"
        },
        {
            "title": "Are We Losing Culture ....and Why?",
            "datePublished": "Tue, 15 Jan 2019 10:42:22 -0800",
            "description": "In this show we discuss the current cultural climate and how it seems that the cultural battle is being won by the world, at least in America. Every aspect of media seems to be preaching the same message. Whether it's commercials, TV shows, movies, kids cartoons, songs, radio shows or news outlets, consistent moral messages are being preached 24/7 whether we like it or not. Meanwhile, it seems most Christians are reluctant to even mention the name \"Jesus\" for fear of being seen as overbearing, fanatical or judgmental. What has happened to the church? Why is our voice seemingly silent? What is the biblical model for remedying this trend? Tune in as ADC regulars Steve Van Kuelen, Jon Noyes and Jason Gallagher discuss this and other related topics.",
            "length": "54595837",
            "sourceUrl": "http://s3.amazonaws.com/apologeticscom/RadioShows/181229_losingculture.mp3"
        },
        {
            "title": "Playing God?",
            "datePublished": "Thu, 20 Dec 2018 15:04:15 -0800",
            "description": "A Stanford trained geneticist announced a few weeks ago that he had successfully edited the genes of two embryos to protect them from inheriting HIV from their father. The newborn twins appear to be HIV free and healthy. Leading geneticists condemned the action. Why? What ought the Christian response be? On this episode of Aplogetics.com Radio join hosts Jon Noyes and Dr. Leslie Wickman along with special guest Dr. James Peterson, professor of ethics at Roanoke College and Virginia Tech Medical School as they grapple with this event and the implication that flow from it.",
            "length": "55237822",
            "sourceUrl": "http://s3.amazonaws.com/apologeticscom/RadioShows/181220_playinggod.mp3"
        },
        {
            "title": "How To Respond To Violence in the Bible",
            "datePublished": "Thu, 13 Dec 2018 11:30:06 -0800",
            "description": "<p>Have you ever wondered about the seemingly excessive violence in the Old Testament? There are actually great reasons for the violence and what you will find is that God is not only a just and holy God but also incredibly patient with sinful man. Join host Jason Gallagher and guests Tony Yu and Daniel Adrean to talk about this difficult topic that can stumble a lot of people.</p>\n\n<p>1 Samuel 15:3\n<br />Now go and attack Amalek, and utterly destroy all that they have, and do not spare them. But kill both man and WOMAN, INFANT and NURSING CHILD, ox and sheep, camel and donkey.</p>",
            "length": "54857480",
            "sourceUrl": "http://s3.amazonaws.com/apologeticscom/RadioShows/181208_violence.mp3"
        },
        {
            "title": "God In The Midst of Tragedy",
            "datePublished": "Thu, 06 Dec 2018 16:16:26 -0800",
            "description": "On this episode of Apologetics.com Radio host Jon Noyes and guest Eric Horne review the recent events affecting Thousand Oaks. This community was rocked by first a mass shooting and then fires. Jon and Eric beginning to discuss what practical steps they were able to do as ambassadors of Christ while wrestling with the question, where is God in the midst of Tragedy. And of course they take your calls.",
            "length": "54762185",
            "sourceUrl": "http://s3.amazonaws.com/apologeticscom/RadioShows/181201_tragedy.mp3"
        },
        {
            "title": "Is Modern Culture's Shift Making Us Less Human?",
            "datePublished": "Wed, 28 Nov 2018 08:50:55 -0800",
            "description": "Social Justice Warriors tell us we must never criticize people's feeling or desires, no matter the cost. They say this makes us more humane. But what if doing so actually makes us less human? In this show, we'll explore the three great virtues of Truth, Goodness, and Beauty and discuss why a feelings-based culture actually makes us more like animals than it does human beings.<em></em>",
            "length": "54833656",
            "sourceUrl": "http://s3.amazonaws.com/apologeticscom/RadioShows/181124_lesshuman.mp3"
        },
        {
            "title": "The State of American Theology",
            "datePublished": "Thu, 15 Nov 2018 06:53:14 -0800",
            "description": "What do Americans think about God, Jesus Christ, sin, and eternity? Ligonier Ministries’ and Lifeway recently teamed up to find out and many of the answers were not pretty. Does God accept the worship of other religions? 70% of Evangelicals think so but Scripture tells us differently. Tune in as Jason Gallagher and Bob Parucha discuss some more of the studies findings and how we can challenge believers to think as we defend and confirm the gospel within the walls of the church.",
            "length": "54643484",
            "sourceUrl": "http://s3.amazonaws.com/apologeticscom/RadioShows/181110_stateoftheo.mp3"
        },
        {
            "title": "Last Call for Liberty",
            "datePublished": "Wed, 07 Nov 2018 09:33:14 -0800",
            "description": "<p>The following was taken from Os Guinness latest book \"Last Call for Liberty.\"</p>\n\n<p>The hour is critical. The American republic is suffering its gravest crisis since the Civil War. Conflicts, hostility, and incivility now threaten to tear the country apart. Competing visions have led to a dangerous moment of cultural self-destruction. This is no longer politics as usual, but an era of political warfare where our enemies are not foreign adversaries, but our fellow citizens.</p>\n\n<p>Yet the roots of the crisis are deeper than many realize. Os Guinness argues that we face a fundamental crisis of freedom, as America's genius for freedom has become her Achilles' heel. Our society's conflicts are rooted in two rival views of freedom, one embodied in \"1776\" and the ideals of the American Revolution, and the other in \"1789\" and the ideals of the French Revolution. Once again America has become a house divided, and Americans must make up their minds as to which freedom to follow. Will the constitutional republic be restored or replaced?</p>\n\n<p>This grand treatment of history, civics, and ethics in the Jewish and Christian traditions represents Guinness's definitive exploration of the prospects for human freedom today. He calls for a national conversation on the nature of freedom, and poses key questions for concerned citizens to consider as we face a critical chapter in the American story. He offers readers a checklist by which they can assess the character and consequences of the freedoms they are choosing.</p>\n\n<p>In the tradition of Alexis de Tocqueville, Guinness provides a visitor's careful observation of the American experiment. Discover here a stirring vision for faithful citizenship and renewed responsibility for not only the nation but also the watching world.</p>",
            "length": "34932111",
            "sourceUrl": "http://s3.amazonaws.com/apologeticscom/RadioShows/os_lastcallforliberty.mp3"
        },
        {
            "title": "Story of Reality",
            "datePublished": "Wed, 07 Nov 2018 09:22:25 -0800",
            "description": "On this episode of Apologetics.com radio Jon, Steve and guest Eric continue through Greg Koukl's The Story of Reality focusing on Jesus. Who he was and what he did.",
            "length": "54881303",
            "sourceUrl": "http://s3.amazonaws.com/apologeticscom/RadioShows/181103_storyofreality.mp3"
        },
        {
            "title": "Does God Care About What You Eat? Part 2",
            "datePublished": "Wed, 07 Nov 2018 09:07:55 -0800",
            "description": "Do we limit what we watch on television in pursuit of holiness? Are we careful of what we read as it concerns God? Most of us would say yes to these questions bit what about food? Is there a right theology of food? Does it matter spiritually what we consume? Join Dr. Lesslie Wickman and Jon Noyes on this episode of Apologetics.com Radio as the discuss these ideas and more.",
            "length": "54952774",
            "sourceUrl": "http://s3.amazonaws.com/apologeticscom/RadioShows/181020_nutrition.mp3"
        },
        {
            "title": "The Women in Apologetics",
            "datePublished": "Mon, 29 Oct 2018 14:36:55 -0700",
            "description": "In this episode of the Apologetics.com Radio show, we interview Laurie Stewart, Hillary Ferrer, Krista Bontrager and Rachel Shockey, the leaders of Women in Apologetics, an organization devoted to developing apologetics training, especially for women to reach other women for Christ. In this show we discuss the importance of being culturally engaged and the practical benefits we can employ as we seek to defend the truth claims of Christianity in our community.",
            "length": "55119122",
            "sourceUrl": "http://s3.amazonaws.com/apologeticscom/RadioShows/181027_wia.mp3"
        },
        {
            "title": "The Crucifixion of Jesus: Interview with Dr. Joe Bergeron",
            "datePublished": "Mon, 15 Oct 2018 10:18:50 -0700",
            "description": "In this show, Jason Gallagher interviews Dr. Joe Bergeron on his upcoming book \"The Crucifixion of Jesus: A Medical Doctor Examines the Death and Resurrection of Christ.\" Central to Christianity, the death and resurrection of Christ is a topic that all believers should be readily equipped to confirm and defend. This book gives believers strong arguments and evidences that confirm the truth of Scripture and the authenticity of the Gospel accounts and defend the resurrection against arguments such as the \"hallucination hypotheses\" posed by skeptics. Thanks to St. Polycarp Publishing House for giving away free books to our callers. For all other listeners, go to www.crucifixionbook.com for a 15% discount.",
            "length": "54786009",
            "sourceUrl": "http://s3.amazonaws.com/apologeticscom/RadioShows/181013_crux.mp3"
        },
        {
            "title": "The Theology of Man",
            "datePublished": "Fri, 12 Oct 2018 09:43:50 -0700",
            "description": "Are we a product of time, chance and random mutations or are we made special, unique and with purpose and meaning? What is the truth about our nature and what are the answers to life’s most important questions? Join Jon Noyes, Steve Van Keulen and special guest Amy Hall from Stand to Reason as they answer these question, “Who is man?”",
            "length": "54619661",
            "sourceUrl": "http://s3.amazonaws.com/apologeticscom/RadioShows/181006_man.mp3"
        },
        {
            "title": "Examining Islam",
            "datePublished": "Sun, 30 Sep 2018 16:19:05 -0700",
            "description": "In this show we take an honest look at the fruits of Islam based on the foundational teachings of the Qur’an and the way it impacting cultures today. Is it really a religion of peace or something different? Tune in as Jason Gallagher leads a discussion with Tony Yu and Daniel Adrean",
            "length": "54857480",
            "sourceUrl": "http://s3.amazonaws.com/apologeticscom/RadioShows/180929_islam.mp3"
        },
        {
            "title": "Can Hollywood Make You a Better Christian?",
            "datePublished": "Thu, 27 Sep 2018 17:17:52 -0700",
            "description": "In this episode we will explore the cultural artifact of movies and story-telling to see if there is anything in Hollywood that can teach Christians to discern between legitimate worldviews (apologetics) and bankrupt ones. This show will also help you consider the inherent goodness and significance of beauty and art in Christian living. Our special guests are Brian Godawa, Lenny Esposito, Jacob Daniel and your host Harry Edwards.",
            "length": "54667308",
            "sourceUrl": "http://s3.amazonaws.com/apologeticscom/RadioShows/180922_hollywood.mp3"
        },
        {
            "title": "Does God Care About What You Eat?",
            "datePublished": "Sun, 16 Sep 2018 20:09:54 -0700",
            "description": "Do we limit what we watch on television in pursuit of holiness? Are we careful of what we read as it concerns God? Most of us would say yes to these questions bit what about food? Is there a right theology of food? Does it matter spiritually what we consume? Join Dr. Lesslie Wickman and Jon Noyes on this episode of Apologetics.com Radio as the discuss these ideas and more.",
            "length": "54786009",
            "sourceUrl": "http://s3.amazonaws.com/apologeticscom/RadioShows/180915_food.mp3"
        },
        {
            "title": "A Converstaion With A Street Epistemologist",
            "datePublished": "Tue, 11 Sep 2018 08:59:20 -0700",
            "description": "Is faith a reliable way to determine truth? The biblical answer is no, but many Christians seem to think it is and get tripped up in conversations when asked this by street epistemologists. From the book \"A Manual for Creating Atheists\", street epistemology has quickly become the new atheist evangelism and is being adopted worldwide by atheists seeking to shake the faith of Christians. In tonight's show, host Jason Gallagher and Tony Yu have a live conversation with an atheist \"street epistemologist\" as we seek to walk through their methodology and demonstrate how Christians can be better equipped to respond to its challenges. Enjoy the show!",
            "length": "54833656",
            "sourceUrl": "http://s3.amazonaws.com/apologeticscom/RadioShows/180908_episteme.mp3"
        },
        {
            "title": "The Story of Reality",
            "datePublished": "Wed, 05 Sep 2018 21:46:29 -0700",
            "description": "On tonight's episode of Apologetics.com Radio Jon and Steve explore reality, the way things really are. There is an underlying true story that explains the way the world is. The question is, what is that story? Who are the main characters? And why does it matter? Of course they take your calls too.",
            "length": "54809832",
            "sourceUrl": "http://s3.amazonaws.com/apologeticscom/RadioShows/180901_reality.mp3"
        },
        {
            "title": "GenZ Apology",
            "datePublished": "Sun, 02 Sep 2018 10:54:03 -0700",
            "description": "Who are the GenZ and how do we tailor our apologetics to reach them? Listen as our team discuss some of the unique traits of this generation, their struggles, strengths and opportunities to connect them to the one and only person who can give them real happiness, satisfaction and shalom in this life and the life to come.",
            "length": "54381842",
            "sourceUrl": "http://s3.amazonaws.com/apologeticscom/RadioShows/180825_genz.mp3"
        },
        {
            "title": "Problem of Evil Continued",
            "datePublished": "Fri, 17 Aug 2018 14:12:45 -0700",
            "description": "Join Apologetics.com host Jonathan Noyes and Steven Van Kuelen as they continue the conversation on the problem of evil. In light of some recent conversations while speaking at Hume Lake Christian Camps it is clear that this is one of them most talked about subjects and as such deserving of another episode.",
            "length": "54833656",
            "sourceUrl": "http://s3.amazonaws.com/apologeticscom/RadioShows/180811_poe.mp3"
        },
        {
            "title": "Problem of Evil",
            "datePublished": "Sun, 12 Aug 2018 10:58:39 -0700",
            "description": "If God is good and all powerful, why then is there evil in the world? People have been asking this question for millennia and tonight on the ADC Radio Show host Jason Gallagher and special guests Patrick Parks and Daniel Adrean will be providing you with biblical answers.",
            "length": "54381842",
            "sourceUrl": "http://s3.amazonaws.com/apologeticscom/RadioShows/180804_poe.mp3"
        },
        {
            "title": "Art, Beauty and Apologetics",
            "datePublished": "Thu, 02 Aug 2018 08:37:26 -0700",
            "description": "The transcendent value of beauty is hardly mentioned in academic conversations in our modern world, much less in everyday culture in which superficial preferences are the norm. That wasn't the case before the Enlightenment. What happened? In this show we take a survey approach to the nature of beauty, some of its properties, and the important role it plays in the art and science of apologetics. On the show are Lenny Esposito, Daniel Jacob, Harry Edwards and special guest Brian Godawa.",
            "length": "55333117",
            "sourceUrl": "http://s3.amazonaws.com/apologeticscom/RadioShows/180728_artbeauty.mp3"
        },
        {
            "title": "The Theory of Everything: God",
            "datePublished": "Thu, 26 Jul 2018 10:06:39 -0700",
            "description": "On this episode of Apologetics.com join Dr. Lesslie Wickman and Jonathan Noyes as they host special guest Dr. Robert Mann, Proffessor of Physics and Mathematics at the University of Waterloo. The topic tonight is black holes, quatum physics, and the particles that make up everything. All in the context of the existence of God of course.",
            "length": "54524784",
            "sourceUrl": "http://s3.amazonaws.com/apologeticscom/RadioShows/180721_toe.mp3"
        },
        {
            "title": "Investigating the Ice Age - An Interview with Dr. Jake Hebert",
            "datePublished": "Wed, 18 Jul 2018 13:38:47 -0700",
            "description": "The Ice Age is probably one of the least well known events that has happened during our earth's history. In this show, we interview Dr. Jake Hebert from the Institute for Creation Research and discuss how various scientists view the evidence we see today. Dr. Hebert argues that the evidence we see fits best within the context of a 6-day creation and the Genesis Flood. Tune in as we discuss these topics and also take a call from an atheist friend of ours in Canada.",
            "length": "54405666",
            "sourceUrl": "http://s3.amazonaws.com/apologeticscom/RadioShows/180714_iceage.mp3"
        },
        {
            "title": "Pro-Life Tactics",
            "datePublished": "Wed, 18 Jul 2018 13:26:41 -0700",
            "description": "Join hosts Jon Noyes and Steven Van Keulen as they discuss one of the most pressing issues of the day, abortion. In this episode of Apologetics.com Radio we talk about tactics in navigating discussions centered on abortion and pro-life persuasion.",
            "length": "54072970",
            "sourceUrl": "http://s3.amazonaws.com/apologeticscom/RadioShows/180707_prolife.mp3"
        },
        {
            "title": "Is There Life Out There?",
            "datePublished": "Tue, 03 Jul 2018 16:45:49 -0700",
            "description": "Jason Gallagher hosts astrophysicist Dr. Jeff Zweerink and astronaut Dr. Leslie Wickman as they answer common questions about the search for life-friendly planets.<img src=\"http://s3.amazonaws.com/apologeticscom/RadioShows/images/lifeoutthere.png\" alt=\"lifeoutthere\"/>",
            "length": "54191671",
            "sourceUrl": "http://s3.amazonaws.com/apologeticscom/RadioShows/180630_lifeoutthere.mp3"
        },
        {
            "title": "Can We Be Moral Without God?",
            "datePublished": "Tue, 19 Jun 2018 11:08:04 -0700",
            "description": "While atheists and non-believers can live outwardly “good” lives, do they have any rational basis or justification for loving their neighbor and expecting others to do so? If we are alive today and then gone forever does it really matter how we behave? Sponsored by Branch of Hope OPC, join host Jason Gallagher and guests as we discuss these questions and expose the utter inability of the unbelieving/evolutionary worldview to account for any sort of objective morality and show that the Christian worldview is the only rational basis for truly loving your neighbor as yourself.",
            "length": "54215494",
            "sourceUrl": "http://s3.amazonaws.com/apologeticscom/RadioShows/180616_moralssansgod.mp3"
        },
        {
            "title": "The Grand Canyon: Evidence for an Old Earth",
            "datePublished": "Fri, 15 Jun 2018 08:47:55 -0700",
            "description": "This weekend on Apologetics.com Radio join hosts Leslie Wickman and Jonathan Noyes as they spend the hour discussing the age of the earth with professor Ken Wolgemuth, author of The Grand Canyon, Monument to an Ancient Earth.",
            "length": "54191671",
            "sourceUrl": "http://s3.amazonaws.com/apologeticscom/RadioShows/180609_grandcanyon.mp3"
        },
        {
            "title": "Foundations for Cultural Engagement",
            "datePublished": "Wed, 30 May 2018 06:29:40 -0700",
            "description": "<p>On this episode of the Apologetics.com Radio Show we discuss the importance of developing a biblical theory, or framework, with which to understand and engage the important cultural issues of our day. In it we discuss Christopher Watkin’s book, “Thinking Through Creation”, which brings the doctrine of the Trinity into the forefront of this conversation. With host Jason Gallagher and guests Bob Parucha and Patrick Parks.</p>\n\n<p>“If Christians do not articulate how the Bible explains all other stories in terms of its own story and how it provides a positive vision for society, then other stories will step in to explain the Bible in their own terms and provide that vision in its place.” Christopher Watkin</p>",
            "length": "54453313",
            "sourceUrl": "http://s3.amazonaws.com/apologeticscom/RadioShows/180526_foundations.mp3"
        },
        {
            "title": "Global Warming and the Christian Engagement",
            "datePublished": "Tue, 29 May 2018 11:26:27 -0700",
            "description": "This week on the program radio host Jon Noyes and Leslie Wickman discuss a conference Dr. Wickman just attended. The conversation turned into a focused dialogue about Global Warming and how the Christian can engage the issue in a meaningful and informed way.",
            "length": "54405666",
            "sourceUrl": "http://s3.amazonaws.com/apologeticscom/RadioShows/180519_globalwarming.mp3"
        },
        {
            "title": "Three Things Every Christian Must Have in Their Apologetics Tool Belt",
            "datePublished": "Tue, 15 May 2018 11:30:07 -0700",
            "description": "If you're a believer in Christ, you can't miss the command to be ready to give a defense to anyone who asks for the hope you have in Him, yet with gentleness and respect (1 Pet. 3:15). It's not an option to engage in the defense of the faith. In fact, it's a joy and honor to represent our Lord and Savior since we're all called to be ambassadors for the Kingdom. Here we discuss what we think are three of the most important methods to help our listeners engage our current culture for Christ. I'm joined in the studio with Lenny Esposito, Jacob Daniel and first time guest Artur Asaduriyan.",
            "length": "53597333",
            "sourceUrl": "http://s3.amazonaws.com/apologeticscom/RadioShows/180512_3things.mp3"
        },
        {
            "title": "CA Bill AB2943",
            "datePublished": "Wed, 09 May 2018 16:07:55 -0700",
            "description": "On this episode of Apologetics.com Radio Jon Noyes and Steve Van Keulin talk about AB2943, a bill in California that is a real threat to both religious liberty and freedom of speech. They also field some of your questions.",
            "length": "54072970",
            "sourceUrl": "http://s3.amazonaws.com/apologeticscom/RadioShows/180505_AB2943.mp3"
        }
    ]
}