{
    "artwork": "http://is3.mzstatic.com/image/thumb/Music/v4/bd/10/c3/bd10c3e1-5f9b-f020-f3bc-c5326bb07518/source/100x100bb.jpg",
    "description": "Around The Coin is an award-winning top fintech podcast. Co-Hosts Faisal Khan and Brian Roemmele discuss all things in the world of payments, from the trading of shells to bitcoins and everything in between!",
    "feedURL": "http://feeds.soundcloud.com/users/soundcloud:users:13052133/sounds.rss",
    "podcastURL": "http://soundcloud.com/aroundthecoin",
    "title": "Around The Coin",
    "episodes": [
        {
            "title": "Ray Youssef, CEO and Co-founder of Paxful",
            "datePublished": "Mon, 09 Nov 2020 22:51:27 +0000",
            "description": "In this episode, Faisal Khan gets a chance to sit down with Ray Youssef, CEO, and Co-founder of Paxful to learn how he got started with the idea of Paxful and what his company is doing to eliminate \"financial apartheid\" as he calls it.",
            "length": "38308040",
            "sourceUrl": "http://feeds.soundcloud.com/stream/926300791-aroundthecoin-ray-youssef-ceo-and-co-founder-of-paxful.mp3"
        },
        {
            "title": "Clay Wilkes, CEO of Galileo FT",
            "datePublished": "Sun, 18 Oct 2020 19:11:28 +0000",
            "description": "In this episode Faisal Khan interviews Clay Wilkes, who is the founder and CEO of Galileo Financial Technologies. Galileo FT is a company that has been around for 20 years and is pretty much the go to company for the world most innovative fintechs. \n\nGalileo offers, what I would call a super API, one unified API that connects to it all and offers all sort of banking solutions including regulatory coverage in multiple markets.",
            "length": "53101287",
            "sourceUrl": "http://feeds.soundcloud.com/stream/912822703-aroundthecoin-clay-wilkes-ceo-of-galileo-ft.mp3"
        },
        {
            "title": "John Colthart, SVP Sales at MindBridge",
            "datePublished": "Thu, 15 Oct 2020 21:55:13 +0000",
            "description": "Kinsa Durst interviews John Colthart. John has made clients successful in every major market worldwide during his 17-year career in technology leading world-class sales and professional services organizations. This started after his departure as a corporate finance and accounting practitioner in 2000 so he could grow a startup to +425 employees and exit to IBM with a role of VP Sales Operations in 2010.  \n\nDuring his stay at IBM, John held global roles running sales enablement, offering management and design leadership within the IBM Analytics division.  He strives to lead clients to effectively use analytics to change the course of their\nbusiness.\n\nSponsors:\nOtter Labs www.hireotter.com\n- Hire great and inexpensive developer with staff augmentation through Otter.\n\nDeFi Code www.defi-code.com\nGo-to-market agency for cryptocurrency companies. Make your project stand out and gain maximum impact in the industry.",
            "length": "64366796",
            "sourceUrl": "http://feeds.soundcloud.com/stream/911318512-aroundthecoin-john-colthart-svp-sales-at-mindbridge-ai.mp3"
        },
        {
            "title": "Roham Gharegozlou, CEO at Dapper Labs",
            "datePublished": "Fri, 25 Sep 2020 18:00:04 +0000",
            "description": "Mike Townsend interviews Roham Gharegozlou. Roham is the CEO of Dapper Labs and the founder of Axiom Zen, the award-winning emerging technology venture studio behind Dapper Labs. Dapper Labs is the creator of CryptoKitties, the world’s most popular consumer blockchain experience, with over 3M transactions on the Ethereum network – more than any smart contract that’s not a cryptocurrency exchange.\n\nSponsors:\nOtter Labs www.hireotter.com\n- Hire great and inexpensive developer with staff augmentation through Otter.\n\nRedeeem www.redeeem.com\n- Redeeem is a decentralized peer-to-peer exchange that lets you save 15% or more on gift cards using Bitcoin and other cryptocurrencies.",
            "length": "56452275",
            "sourceUrl": "http://feeds.soundcloud.com/stream/895107472-aroundthecoin-roham-gharegozlou-ceo-at-dapper-labs.mp3"
        },
        {
            "title": "Kayvan Alikhani, CEO of Compliance.ai",
            "datePublished": "Thu, 24 Sep 2020 18:00:04 +0000",
            "description": "Mike Townsend interviews Kayvan Alikhani. Kayvan is the CEO and co-founder of Compliance.ai. Kayvan has more than 25 years of experience in hi-tech, Kayvan leads operations, strategy, sales, and marketing for Compliance.ai. Most recently, Kayvan led the identity strategy at RSA, and represented EMC on various industry alliances such as the FIDO board. A serial entrepreneur as well, Kayvan was the co-founder and CEO of PassBan (acquired by RSA), a company focused on mobile identity assurance. He also led strategy at LiteScape (as CTO and later as CEO), creating security and mobile identity solutions for VOIP based networks. He was co-founder and CTO at BeNotified, a cloud mobile communication service provider. Prior to that, Kayvan co-founded AVIRNEX, a cloud-based enhanced fixed and mobile communication service provider.\n\nSponsors:\nOtter Labs www.hireotter.com\n- Hire great and inexpensive developer with staff augmentation through Otter.\n\nRedeeem www.redeeem.com\n- Redeeem is a decentralized peer-to-peer exchange that lets you save 15% or more on gift cards using Bitcoin and other cryptocurrencies.",
            "length": "51630529",
            "sourceUrl": "http://feeds.soundcloud.com/stream/895106035-aroundthecoin-kayvan-alikhani-ceo-of-complianceai.mp3"
        },
        {
            "title": "James Gillingham, CEO of Finxflo",
            "datePublished": "Wed, 23 Sep 2020 18:00:04 +0000",
            "description": "Mike Townsend interviews James Gillingham. James is the Co-Founder and CEO of Finxflo, the world’s first hybrid aggregator and cryptocurrency brokerage firm. Under his leadership, Finxflo has embarked on a new partnership with leading blockchain luminaries, Tron and JustSwap, to build the world’s first DeFi protocol aggregator. During his 15 years’ of experience in financial markets, FinTech and entrepreneurship, James has managed over $4 billion worth of funds. An accomplished entrepreneur, he was the force behind the building of JageroFX, a trading algorithm start-up that he built up and led through a successful buy-out.\n\nSponsors:\nOtter Labs www.hireotter.com\n- Hire great and inexpensive developer with staff augmentation through Otter.\n\nRedeeem www.redeeem.com\n- Redeeem is a decentralized peer-to-peer exchange that lets you save 15% or more on gift cards using Bitcoin and other cryptocurrencies.",
            "length": "55092990",
            "sourceUrl": "http://feeds.soundcloud.com/stream/895103683-aroundthecoin-james-gillingham-ceo-of-finxflo.mp3"
        },
        {
            "title": "Kinsa Durst, Partner at DeFi Code",
            "datePublished": "Tue, 22 Sep 2020 18:00:04 +0000",
            "description": "Mike Townsend interviews Kinsa Durst. Kinsa is the founder of DeFi Code, a consulting firm for developing and executing global go-to-market strategy for blockchain and cryptocurrency companies. Coming from a diverse cultural background, he leverages his extensive experience  working with companies in the U.S., China, and Korea to help companies establish their unique value and presence in the industry.  He has always been passionate about bridging multiple cultures, and loves connecting with new people and learning about their perspective of the world.\n\nSponsors:\nOtter Labs www.hireotter.com\n- Hire great and inexpensive developer with staff augmentation through Otter.\n\nRedeeem www.redeeem.com\n- Redeeem is a decentralized peer-to-peer exchange that lets you save 15% or more on gift cards using Bitcoin and other cryptocurrencies.",
            "length": "50093160",
            "sourceUrl": "http://feeds.soundcloud.com/stream/895093351-aroundthecoin-kinsa-durst-partner-at-defi-code.mp3"
        },
        {
            "title": "Daniyal Inamullah, Head of Capital Markets at Cred",
            "datePublished": "Mon, 21 Sep 2020 18:00:08 +0000",
            "description": "Mike Townsend interviews Daniyal Inamullah. Daniyal is the Head of Capital Markets at Cred and Co-Founder for the Glitter of Hope Foundation. Daniyal has spent his career specializing in mergers & acquisitions for energy companies at EY and Houlihan Lokey before he focused his career on democratizing financial services by leveraging blockchain technology.\n\nIn his current role at Cred, Daniyal works on optimizing Cred's capital markets through facilitating partnerships and product ideation. Cred's mission is to provide digital asset hodlers the tools to access financial services at the micro level and take control of their financial future.\n\nDaniyal graduated from Emory University and obtained his MBA from the University of Houston. He is a CFA Charterholder. You can find more of his blog posts at financechai.com.\n\nSponsors:\nOtter Labs www.hireotter.com\n- Hire great and inexpensive developer with staff augmentation through Otter.\n\nRedeeem www.redeeem.com\n- Redeeem is a decentralized peer-to-peer exchange that lets you save 15% or more on gift cards using Bitcoin and other cryptocurrencies.",
            "length": "54364882",
            "sourceUrl": "http://feeds.soundcloud.com/stream/895078192-aroundthecoin-daniyal-inamullah-head-of-capital-markets-at-cred.mp3"
        },
        {
            "title": "Moaz Hamid, CEO of MvmtAi",
            "datePublished": "Fri, 18 Sep 2020 18:00:18 +0000",
            "description": "Mike Townsend interviews Moaz Hamid. Moaz is a mission-driven technologist and strategist, solving for the future of jobs and medicine, and the role of Robotics and AI. He is mvmtAi, a health tech startup, founder and CEO. Advisor for SoftBank Robotics, and serves on, and Robotics WG member, for the Consumer Technology Association (CTA).\n\nMoaz is also advisor and mentor for seed stage startups for Yellow (accelerator) by Snap Inc., and early stage startups and chair of the advisory board for Startup Boost (pre-accelerator), as well as, LA underserved youth entrepreneurship program, embarcLA.\n\nSponsors:\nOtter Labs www.hireotter.com\n- Hire great and inexpensive developer with staff augmentation through Otter.\n\nRedeeem www.redeeem.com\n- Redeeem is a decentralized peer-to-peer exchange that lets you save 15% or more on gift cards using Bitcoin and other cryptocurrencies.",
            "length": "54461814",
            "sourceUrl": "http://feeds.soundcloud.com/stream/895065106-aroundthecoin-moaz-hamid-ceo-of-mvmtai.mp3"
        },
        {
            "title": "Ned Phillips, CEO of Bambu",
            "datePublished": "Wed, 09 Sep 2020 17:59:59 +0000",
            "description": "Mike Townsend interviews Ned Phillips. Started his Fintech journey with E*TRADE as one of the very first online brokers and now an entrepreneur, Ned Phillips is the founder and chief executive officer of Bambu. Ned had the opportunity to experience the first dot-com boom with one of the original FinTech companies as well as was a consultant to 8Securities when they launched the first robo-advisor in Asia.\n\nSponsors:\nOtter Labs www.hireotter.com\n- Hire great and inexpensive developer with staff augmentation through Otter.\n\nRedeeem www.redeeem.com\n- Redeeem is a decentralized peer-to-peer exchange that lets you save 15% or more on gift cards using Bitcoin and other cryptocurrencies.",
            "length": "61672643",
            "sourceUrl": "http://feeds.soundcloud.com/stream/887106793-aroundthecoin-ned-phillips-ceo-of-bambu.mp3"
        },
        {
            "title": "Joe Bayen, CEO of Grow Credit",
            "datePublished": "Mon, 07 Sep 2020 18:00:00 +0000",
            "description": "Joe Bayen is CEO at Grow Credit. Over the past decade, Joe has specialized in underwriting, credit score improvement, user acquisition, and monetization.\n\nGrow Credit helps consumers establish or build credit using a MasterCard designed to exclusively process subscription payments. The platform enables consumers with thin credit or no credit files to seamlessly establish a credit history using a Netflix, Pandora, or Xbox live account.\n\nJoe previously founded at ICS Mobile Inc, the developer behind Free App A Day, a mobile application marketing platform with 12M users worldwide that was bootstrapped to $18.3M in total revenue. Notable clients included Disney, Electronic Arts, Groupon, and Kabam.\n\nSponsors:\nOtter Labs www.hireotter.com\n- Hire great and inexpensive developer with staff augmentation through Otter.\n\nRedeeem www.redeeem.com\n- Redeeem is a decentralized peer-to-peer exchange that lets you save 15% or more on gift cards using Bitcoin and other cryptocurrencies.",
            "length": "62875640",
            "sourceUrl": "http://feeds.soundcloud.com/stream/887098864-aroundthecoin-joe-bayen-ceo-of-grow-credit.mp3"
        },
        {
            "title": "Jareau Wade, Head of Growth at Finix",
            "datePublished": "Fri, 04 Sep 2020 18:00:10 +0000",
            "description": "Mike Townsend interviews Jareau Wadé, a payments entrepreneur and recovering engineer based in Atlanta, GA. He currently runs growth and marketing at payments infrastructure company, Finix. Prior, Jareau lead commerce and visual search business development for Pinterest and co-founded Balanced, a payments API company that exited to Stripe in 2015. Jareau was also the first employee and head of data acquisition at Milo.com, a local shopping search engine acquired by eBay in 2010.\n\nSponsors:\nOtter Labs www.hireotter.com\n- Hire great and inexpensive developer with staff augmentation through Otter.\n\nRedeeem www.redeeem.com\n- Redeeem is a decentralized peer-to-peer exchange that lets you save 15% or more on gift cards using Bitcoin and other cryptocurrencies.",
            "length": "70140556",
            "sourceUrl": "http://feeds.soundcloud.com/stream/887093068-aroundthecoin-jareau-wade-head-of-growth-at-finix.mp3"
        },
        {
            "title": "Xiaohan Zhu, CEO of Meter.io",
            "datePublished": "Sat, 15 Aug 2020 20:00:05 +0000",
            "description": "Mike Townsend interviews Xiaohan Zhu, CEO of Meter.io. Xiaohan Zhu is an engineer by training, he was born and raised in Chine, and moved the US to go to graduate school at UC San Diego, and eventually got his MBA at Wharton before working as an engineer at Microsoft and Motorola. In 2016 he became fascinated with cryptocurrency and global finance and started ZMT Capital investing in Blockchain, and ICOs. In 2018 Xiaohan started Meter.io to further enable of the crypto community by using the cost of production and the minor's behavior and the proof of work system as the key piece of feedback that enables stable pricing of their Meter token. Learn more about what makes Meter special on the deep dive interview!\n\nSponsors:\nOtter Labs www.hireotter.com\n- Hire great and inexpensive developer with staff augmentation through Otter.\n\nRedeeem https://redeeem.click/qdza\n- Redeeem is a decentralized peer-to-peer exchange that lets you save 15% or more on gift cards using Bitcoin and other cryptocurrencies.",
            "length": "55872944",
            "sourceUrl": "http://feeds.soundcloud.com/stream/875298892-aroundthecoin-xiaohan-zhu-ceo-of-meterio.mp3"
        },
        {
            "title": "Sunayna Tuteja, Head of Digital Assets TD Ameritrade",
            "datePublished": "Fri, 14 Aug 2020 20:00:15 +0000",
            "description": "In this engaging interview Mike Townsend interviews Sunayna Tuteja, Head of Digital Assets and Blockchain at TD Ameritrade. With more than ten years of diverse global experience, she has a proven record for building new ventures from scratch and leading the kind of change that is critical in shaping the future of business. In her current role, Sunayna is responsible for building a scalable blockchain and crypto practice within TD Ameritrade. This rapidly growing practice is inclusive of partnerships, investments and products to harness the growing power of blockchain technology. Through partnering with the Stanford Innovation Lab, she works closely with the start-up and VC communities helping to advance public and corporate innovation. Outside of work and school, you can find Sunayna adventuring the skies in her Cessna.\n\nSponsors:\nOtter Labs www.hireotter.com\n- Hire great and inexpensive developer with staff augmentation through Otter.\n\nRedeeem https://redeeem.click/qdza\n- Redeeem is a decentralized peer-to-peer exchange that lets you save 15% or more on gift cards using Bitcoin and other cryptocurrencies.",
            "length": "69892230",
            "sourceUrl": "http://feeds.soundcloud.com/stream/875297365-aroundthecoin-sunayna-tuteja-head-of-digital-assets-td-ameritrade.mp3"
        },
        {
            "title": "Kyle Samani, Founder at Multicoin Capital",
            "datePublished": "Thu, 13 Aug 2020 20:00:25 +0000",
            "description": "Kyle Samani and Mike Townsend sit down and chat about how cryptocurrency will influence the US and global economy over the coming years. Kyle gives us the down low on companies and crypto projects he's excited about, and how he thinks about making investment decisions. \n\nKyle Samani is a co-founder and managing partner at Multicoin Capital, a thesis-driven investment firm that invests in cryptocurrencies, tokens, and blockchain companies. Prior to Multicoin Capital, Kyle founded Pristine, a health IT startup that was later acquired by Upskill. Kyle holds degrees in Finance and Management from NYU, and is widely recognized in the crypto ecosystem for his writing and system-level analysis.\n\nSponsors:\nOtter Labs www.hireotter.com\n- Hire great and inexpensive developer with staff augmentation through Otter.\n\nRedeeem https://redeeem.click/qdza\n- Redeeem is a decentralized peer-to-peer exchange that lets you save 15% or more on gift cards using Bitcoin and other cryptocurrencies.\n\nWe promise you'll learn a lot on this show, tune in!",
            "length": "57951325",
            "sourceUrl": "http://feeds.soundcloud.com/stream/875295583-aroundthecoin-kyle-samani-founder-at-multicoin-capital.mp3"
        },
        {
            "title": "Interview with Alex Bouaziz, CEO of Deel",
            "datePublished": "Thu, 02 Jul 2020 16:00:21 +0000",
            "description": "In this interview Mike Townsend interviews Alex Bouaziz, the founder and CEO of Deel. Alex is a true international entrepreneur, having been born and raised in Paris, France, he then went to undergraduate university in Tel Aviv, Israel, studying civil and environmental engineering. We chatted about his time getting a master degree at MIT, and starting on his PhD researching water treatment. The conversation moved quickly into the future of remote work, how companies are hiring now, what countries have the best and worse employment laws, and what a long term vision for Deel could look like to improve the international standard for employment. \nThe world looks a lot different today than it did 50 years ago and it will look just as different 50 years in the future, learn what those differences are and more on the show!\n\nSponsors:\nOtter Labs www.hireotter.com\n- Hire great and inexpensive developer with staff augmentation through Otter.\n\nRedeeem https://redeeem.click/qdza\n- Redeeem is a decentralized peer-to-peer exchange that lets you save 15% or more on gift cards using Bitcoin and other cryptocurrencies.",
            "length": "52990678",
            "sourceUrl": "http://feeds.soundcloud.com/stream/849810001-aroundthecoin-interview-with-alex-bouaziz-ceo-of-deel.mp3"
        },
        {
            "title": "Interview with Chris McAlary CEO of Coin Cloud",
            "datePublished": "Mon, 29 Jun 2020 13:00:12 +0000",
            "description": "In this show Mike Townsend interviews Chris McAlary, the CEO of Coin Cloud, the world’s largest network of two-way digital currency kiosks. From his early days as a Bitcoin miner to now, he is a pioneer in the cryptocurrency industry. When Robocoin installed the world’s first Bitcoin ATM in Vancouver, BC, in 2013, McAlary wondered why not the US. After much research and collaboration, he installed the first Coin Cloud BTM on the Las Vegas Strip in 2014 – built by Robocoin, branded by Coin Cloud, and serviced by McAlary himself.\nToday, Coin Cloud is the largest Bitcoin ATM company in the nation, with over 800 machines (and growing constantly), all of which allow two-way transactions of Bitcoin and 29 altcoins. Coin Cloud’s first international expansion is Brazil, offering that country the first opportunity ever to purchase digital currency with cash.\n\nSponsors:\nOtter Labs www.hireotter.com\n- Hire great and inexpensive developer with staff augmentation through Otter.\n\nRedeeem https://redeeem.click/qdza\n- Redeeem is a decentralized peer-to-peer exchange that lets you save 15% or more on gift cards using Bitcoin and other cryptocurrencies.",
            "length": "55417620",
            "sourceUrl": "http://feeds.soundcloud.com/stream/848006926-aroundthecoin-interview-with-chris-mcalary-ceo-of-coin-cloud.mp3"
        },
        {
            "title": "Interview with Ljuba Youngblom CEO of Hometown",
            "datePublished": "Fri, 26 Jun 2020 16:38:21 +0000",
            "description": "In this interview Mike Townsend interviews Ljuba Youngblom, the co-founder and CEO of Hometown, an early stage startup reimagining local news from the ground up. Prior to that, Ljuba co-founded the connected car startup Automatic Labs, which was acquired by SiriusXM in 2017. He’s a UX designer, mentor, and pragmatic do-gooder living in Oakland, California. \nIn the show we go into depth on local politics, what motivates people to vote, to contribute to their local economies, and what fascinating new techniques Hometown is using to improve democracy on a local level.\n\nSponsors:\nOtter Labs www.hireotter.com\n- Hire great and inexpensive developer with staff augmentation through Otter.\n\nRedeeem https://redeeem.click/qdza\n- Redeeem is a decentralized peer-to-peer exchange that lets you save 15% or more on gift cards using Bitcoin and other cryptocurrencies.\n\n\nTune in and share if you enjoyed the show!",
            "length": "65685493",
            "sourceUrl": "http://feeds.soundcloud.com/stream/847393084-aroundthecoin-interview-with-ljuba-youngblom-ceo-of-hometown.mp3"
        },
        {
            "title": "Interview with Jason Butcher, CEO of CoinPayments",
            "datePublished": "Thu, 25 Jun 2020 16:00:12 +0000",
            "description": "In this interview Mike Townsend interviews Jason Butcher, CEO of CoinPayments. Jason took over as CEO after running HODLtech, a crypto consultancy. He now leads CoinPayments which is most known for being a leader in facilitating cryptocurrency payments for businesses. CoinPayments has over 1800 crypto options, over 100,000 merchant customers, processing over $100M per month, which has increased over 30% since the Coronavirus hit. \n\nWe talked about why crypto companies incorporate off shore to the Cayman Islands or Malta, and all the pros and cons that go along with that decision. We talk about the governmental policies regarding crypto and what we should be thinking about now that will prevent mistakes down the road. We also dive into what crypto opportunities he sees on the horizon and much more!\n\nSponsors:\nOtter Labs www.hireotter.com\n- Hire great and inexpensive developer with staff augmentation through Otter.\n\nRedeeem https://redeeem.click/qdza\n- Redeeem is a decentralized peer-to-peer exchange that lets you save 15% or more on gift cards using Bitcoin and other cryptocurrencies.",
            "length": "57207821",
            "sourceUrl": "http://feeds.soundcloud.com/stream/845628418-aroundthecoin-interview-with-jason-butcher-ceo-of-coinpayments.mp3"
        },
        {
            "title": "Interview with Nelson Chu CEO of Cadence",
            "datePublished": "Wed, 24 Jun 2020 17:00:22 +0000",
            "description": "In this show Mike Townsend interviews Nelson Chu, founder and CEO of Cadence. Nelson is a 3x startup founder with several years of experience at the top investment management firms, including Bank of America and BlackRock. Prior to Cadence, he founded a strategy consulting firm specializing in helping companies build products and raise capital for growth, creating over $1B in equity value. He currently serves as an advisor to an ultra high net worth family office and is an active angel investor, with notable investments including BlockFi, Cadre, Care/Of, Clover Health, dv01, Tala, and Uala. \n\nThis was a highly educational podcast, as Nelson explains how the highly complex market of business lending works, from the small business loans, personal loans, and all the way up to the banks and governments. Nelson gives us his thoughts on how the 2008 financial crisis changed the way money flows throughout the system now.\n\nWe hear that Cadence has $1.6 issuance volume and $40M in securitization, and self-proclaimed shortest duration, highest yield (30%) flexible cheap growth capital... give it a try and decide for yourself! \n\nAs always, reach out if you'd like to be on the show, or have guest recommendations.\n\nSponsors:\nOtter Labs www.hireotter.com\n- Hire great and inexpensive developer with staff augmentation through Otter.\n\nRedeeem https://redeeem.click/qdza\n- Redeeem is a decentralized peer-to-peer exchange that lets you save 15% or more on gift cards using Bitcoin and other cryptocurrencies.",
            "length": "55363181",
            "sourceUrl": "http://feeds.soundcloud.com/stream/845618959-aroundthecoin-interview-with-nelson-chu-ceo-of-cadence.mp3"
        },
        {
            "title": "Interview with Felix Feng Cofounder/CEO of Set Protocol",
            "datePublished": "Tue, 23 Jun 2020 23:11:56 +0000",
            "description": "In this interview Mike Townsend interviews Felix Feng, founder of Set Protocol.\nHe previously worked at 21.co (acquired by Coinbase) and Radius, and graduated from UC Berkeley. We learn how Felix came up with the idea for Set Protocol and how how raised money and grew his team. \n\nSet Protocol basically allows you to buy and sell crypto management strategies for the average person, similar to how an ETF works on wall street. Check it out at Set Protocol.\n\nIn the show we talk about what Set Protocol, which is a ERC20 token of crypto assets that automatically rebalances based on the strategy, who is using it, who's benefiting. We discuss why in 2017 lots of ICO’s were returning nearly 100x and it made sense to diversify, but in 2018/19 the long tail fell out of favor. There is a great article, How Set Protocol Works Under the Hood that explains more in detail about Set Protocol. \n\nWe promise you'll learn a lot on this show, tune in!\n\nSponsors:\nOtter Labs www.hireotter.com\n- Hire great and inexpensive developer with staff augmentation through Otter.\n\nRedeeem https://redeeem.click/qdza\n- Redeeem is a decentralized peer-to-peer exchange that lets you save 15% or more on gift cards using Bitcoin and other cryptocurrencies.",
            "length": "56445197",
            "sourceUrl": "http://feeds.soundcloud.com/stream/845562970-aroundthecoin-interview-with-felix-feng-cofounderceo-of-set-protocol.mp3"
        },
        {
            "title": "Interview with Mark Thomas founder of ZenSports",
            "datePublished": "Sun, 31 May 2020 13:45:59 +0000",
            "description": "In this interview Mike Townsend interviews Mark Thomas, CEO and founder of ZenSports. ZenSports is a mobile peer-to-peer sports betting marketplace where anyone can create and accept sports bets with anyone else in the world, without the need for a centralized bookmaker. Mike and Mark uncover the history of betting, discuss the future of sports coming out of Coronavirus, and talk about what the strategies that the best sports betters use to win 55% of their bets. We also learn about the history of betting regulation and other high potential cryptocurrency companies.\n\nSponsors:\nOtter Labs www.hireotter.com\n- Hire great and inexpensive developer with staff augmentation through Otter.\n\nRedeeem https://redeeem.click/qdza\n- Redeeem is a decentralized peer-to-peer exchange that lets you save 15% or more on gift cards using Bitcoin and other cryptocurrencies.",
            "length": "74852302",
            "sourceUrl": "http://feeds.soundcloud.com/stream/831615712-aroundthecoin-interview-with-mark-thomas-founder-of-zensports.mp3"
        },
        {
            "title": "Interview with Chris Maurice founder of Yellow Card",
            "datePublished": "Sun, 10 May 2020 15:56:14 +0000",
            "description": "In this interview Mike Townsend interviews Chris Maurice, CEO and co-founder of Yellow Card, a cryptocurrency exchange operating across Africa. In high school, Chris started an SEO consulting firm which helped optimize over 140 websites on Google, including Prezi.com. In college, he started a manufacturing and supply chain logistics company producing clothing and shoes out of a factory in Pakistan. As a boy from Southern Louisiana who had been on a plane four times before founding Yellow Card, he then flew to Nigeria on two weeks' notice to build a company bringing Bitcoin to everyone. Hear the story of how Chris launched a bitcoin business in Africa, and how he met Jack Dorsey, (CEO of Twitter and Square), in Africa.\n\nSponsors:\nOtter Labs www.hireotter.com\n- Hire great and inexpensive developer with staff augmentation through Otter.\n\nRedeeem https://redeeem.click/qdza\n- Redeeem is a decentralized peer-to-peer exchange that lets you save 15% or more on gift cards using Bitcoin and other cryptocurrencies.",
            "length": "75514980",
            "sourceUrl": "http://feeds.soundcloud.com/stream/817580872-aroundthecoin-interview-with-chris-maurice-founder-of-yellow-card.mp3"
        },
        {
            "title": "Interview with Greg Kolodziejzyk",
            "datePublished": "Tue, 28 Apr 2020 14:53:22 +0000",
            "description": "In this interview, Mike Townsend interviews Greg Kolodziejzyk, founder of AlgoLab. In his 20's Greg quit his job at a local oil company based out of Calgary Albert and started his own business as a freelance graphic designer. In 1994 his company, Image Club, was purchased for millions, and Greg became financially independent.\n\nWith plenty of time on his hands, Greg shifted his focus to endurance training and completed 12 Ironman Triathlons, and multiple 100 mile run races in Alaska. Unlike most people, Greg has an insatiable appetite for pushing the limit, and so naturally the next goal became to do something that had never been done before... breaking world records!\n\nWe discuss Greg's adventures breaking multiple Guinness World Records including the farthest distance traveled in 24 hours by human power on land and separately on water.\n\nIn the last 30 minutes of the show, we shift gears and learn about how Greg built AlgoLab, one of the best performing algorithmic futures trading platforms on the market. Greg talks about how he came up with the idea, why futures are an especially great investment category, and some of the reasons AlgoLab is doing it better than anyone else out there.\n\nSponsors:\nOtter Labs www.hireotter.com\n- Hire great and inexpensive developer with staff augmentation through Otter.\n\nRedeeem https://redeeem.click/qdza\n- Redeeem is a decentralized peer-to-peer exchange that lets you save 15% or more on gift cards using Bitcoin and other cryptocurrencies.",
            "length": "104315902",
            "sourceUrl": "http://feeds.soundcloud.com/stream/808995580-aroundthecoin-interview-with-greg-kolodziejzyk.mp3"
        },
        {
            "title": "Interview with Jack Nikogosian CEO of ARYZE",
            "datePublished": "Sat, 18 Apr 2020 19:12:03 +0000",
            "description": "Today, ARYZE is passionately led by Jack and is successfully establishing itself in the industry. The values ‘inclusivity’, and ‘transparency’ are embedded in the company’s culture and show what ARYZE is truly about.\n\nThe company is working towards solving the United Nations’ Sustainable Development Goal Numbers 9, 10, and 16. It does so by building a secure financial platform that is accessible to the financially excluded, and where costs are brought to near zero.\n\nSponsors:\nOtter Labs www.hireotter.com\n- Hire great and inexpensive developer with staff augmentation through Otter.\n\nRedeeem https://redeeem.click/qdza\n- Redeeem is a decentralized peer-to-peer exchange that lets you save 15% or more on gift cards using Bitcoin and other cryptocurrencies.",
            "length": "73922533",
            "sourceUrl": "http://feeds.soundcloud.com/stream/801749200-aroundthecoin-interview-with-jack-nikogosian-ceo-of-aryze.mp3"
        },
        {
            "title": "Interview of Ethan Austin of Techstars Western Union Accelerator",
            "datePublished": "Sat, 11 Apr 2020 14:12:46 +0000",
            "description": "In this interview, Mike Townsend interviews Ethan Austin, who oversees all operations at the Techstars & Western Union Accelerator. This Techstars program focuses on investing in startups looking to shape the future of money. Ethan and Mike talk about the history of Western Union, which is now about 170 years old and dominated the American telegraph industry in both the 19th and 20th centuries.\n\nSponsors:\nOtter Labs www.hireotter.com\n- Hire great and inexpensive developer with staff augmentation through Otter.\n\nRedeeem https://redeeem.click/qdza\n- Redeeem is a decentralized peer-to-peer exchange that lets you save 15% or more on gift cards using Bitcoin and other cryptocurrencies.",
            "length": "71657427",
            "sourceUrl": "http://feeds.soundcloud.com/stream/796073077-aroundthecoin-interview-of-ethan-austin-of-techstars-western-union-accelerator.mp3"
        },
        {
            "title": "Interview with Andreas M. Antonopoulos",
            "datePublished": "Wed, 18 Mar 2020 08:26:32 +0000",
            "description": "In our latest edition, Nako Mbelle interviews to whom we refer to as the brand ambassador or Bitcoin evangelist: Andreas M. Antonopoulos.\n\nAndreas M. Antonopoulos is a critically-acclaimed best-selling author, speaker, educator, and one of the world’s foremost bitcoin and open blockchain experts. Andreas makes complex subjects accessible and easy to understand. He is known for delivering electric talks that combine economics, psychology, technology, and game theory with current events, personal anecdote, and historical precedent—effortlessly transliterating the complex issues of blockchain technology out of the abstract and into the real world.\n\nSponsors:\nOtter Labs www.hireotter.com\n- Hire great and inexpensive developer with staff augmentation through Otter.\n\nRedeeem https://redeeem.click/qdza\n- Redeeem is a decentralized peer-to-peer exchange that lets you save 15% or more on gift cards using Bitcoin and other cryptocurrencies.",
            "length": "39929073",
            "sourceUrl": "http://feeds.soundcloud.com/stream/778115314-aroundthecoin-interview-with-andreas-m-antonopoulos.mp3"
        },
        {
            "title": "Interview with Andrée Simon President and CEO of FINCA Impact Finance",
            "datePublished": "Sun, 05 Jan 2020 09:42:23 +0000",
            "description": "You can't seem to pick up any Fintech aka banking & payments magazine or blog without the mention of the word, 'financial inclusion'. Depending on whom you talk to, the number of financially excluded population is anywhere from 2.5 Billion people to 1.5 Billion. World Bank Group defines financial inclusion as individuals (and businesses) that have access to useful and affordable financial products and services that meet their needs - such as transactions, payments, savings, credit and insurance - delivered in a responsible and sustainable way. \n\nMost of this is done through microfinance banks. These microfinance basically offer a very specialized category of financial services to those who lack access to conventional banking and related services.\n\nOne such institution that is helping solve this problem of underbanked/unbanked is FINCA. FINCA's network of 20 community-based microfinance institutions and banks use fintech to expand financial inclusion, offering innovative, responsible and impactful financial services to low-income clients.\n\nI'm very honored to have Andrée  Simon who is the President& CEO of FINACA Impact Finance, based out of Washington DC.\n\nSponsors:\nOtter Labs www.hireotter.com\n- Hire great and inexpensive developer with staff augmentation through Otter.\n\nRedeeem https://redeeem.click/qdza\n- Redeeem is a decentralized peer-to-peer exchange that lets you save 15% or more on gift cards using Bitcoin and other cryptocurrencies.",
            "length": "80291701",
            "sourceUrl": "http://feeds.soundcloud.com/stream/738644959-aroundthecoin-interview-with-andree-simon-president-and-ceo-of-finca-impact-finance.mp3"
        },
        {
            "title": "Interview with Kyle Hill - Founder of Redeeem.com",
            "datePublished": "Sat, 16 Nov 2019 19:59:41 +0000",
            "description": "In this interview Mike Townsend talks to Kyle Hill, which is a special episode because Kyle and Mike are co-founders of Redeeem (trusted peer-to-peer crypto gift card exchange), and have started 3 startups over the last 8 years together. Previous to Redeeem, they raised $23M for HomeHero, a tech-enabled home care marketplace. They talk about how to work successfully together as a team, the mission and story of Redeeem, as well as a variety of topics related to bitcoin, government regulation, and upcoming exciting blockchain projects.\n\nSponsors:\nOtter Labs www.hireotter.com\n- Hire great and inexpensive developer with staff augmentation through Otter.\n\nRedeeem https://redeeem.click/qdza\n- Redeeem is a decentralized peer-to-peer exchange that lets you save 15% or more on gift cards using Bitcoin and other cryptocurrencies.",
            "length": "36193174",
            "sourceUrl": "http://feeds.soundcloud.com/stream/713841811-aroundthecoin-interview-with-kyle-hill-founder-of-redeeemcom.mp3"
        },
        {
            "title": "Interview with Ethan Kravitz, Partner at AGE Crypto Hedge Fund",
            "datePublished": "Wed, 11 Sep 2019 19:45:07 +0000",
            "description": "In this interview Mike Townsend interviews Ethan, who talks about his journey from CTO of VC funded startup, Overnight, to partner of AGE Crypto hedge fund. Learn about the differences between a VC fund and a crypto hedge fund, as well as how many exist what specific methods hedge funds use to provide returns for their LPs. Ethan walks us through a typical day, researching github projects, talking to developers of tokens, building tools that automate crypto trading, as well as much more.\n\nSponsors:\nOtter Labs www.hireotter.com\n- Hire great and inexpensive developer with staff augmentation through Otter.\n\nRedeeem https://redeeem.click/qdza\n- Redeeem is a decentralized peer-to-peer exchange that lets you save 15% or more on gift cards using Bitcoin and other cryptocurrencies.",
            "length": "36159970",
            "sourceUrl": "http://feeds.soundcloud.com/stream/679710527-aroundthecoin-interview-with-ethan-kravitz-partner-at-age-crypto-hedge-fund.mp3"
        },
        {
            "title": "Interview with Yan Pritzker the author of Inventing Bitcoin",
            "datePublished": "Sun, 11 Aug 2019 15:15:01 +0000",
            "description": "In this podcast, Nako Mbelle interviews Yan Pritzker the author of Inventing Bitcoin and I discuss what makes bitcoin a revolutionary tech; and why he left his full-time CTO position at his startup to devote 100% of his time to Bitcoin. \n\nYan’s book Inventing Bitcoin is written for non-technical people who want to better understand bitcoin at a deeper level and go beyond the superficial talking points of price and profit.\n\nSponsors:\nOtter Labs www.hireotter.com\n- Hire great and inexpensive developer with staff augmentation through Otter.\n\nRedeeem https://redeeem.click/qdza\n- Redeeem is a decentralized peer-to-peer exchange that lets you save 15% or more on gift cards using Bitcoin and other cryptocurrencies.",
            "length": "102252689",
            "sourceUrl": "http://feeds.soundcloud.com/stream/664286501-aroundthecoin-interview-with-yan-pritzker-the-author-of-inventing-bitcoin.mp3"
        },
        {
            "title": "Interview with SFOX Team",
            "datePublished": "Tue, 18 Jun 2019 09:11:50 +0000",
            "description": "In this episode Mike Townsend visited the offices of SFOX to interview Founder George Melika and Head of Growth Danny Kim in their offices in Playa Vista, California. SFOX raised $23M in VC from Y Combinator, Social Capital, Tribe Capital among others to build the easiest tool to access the digital cryptocurrency market.\n\nWe discussed exchange trading, how crypto companies can successfully work with banks, and underrated projects and people working in crypto. Hope you enjoy the conversation and let us know if you have any feedback or suggestions for our next episode.\n\nSponsors:\nOtter Labs www.hireotter.com\n- Hire great and inexpensive developer with staff augmentation through Otter.\n\nRedeeem https://redeeem.click/qdza\n- Redeeem is a decentralized peer-to-peer exchange that lets you save 15% or more on gift cards using Bitcoin and other cryptocurrencies.",
            "length": "42764942",
            "sourceUrl": "http://feeds.soundcloud.com/stream/638434122-aroundthecoin-interview-with-sfox-team.mp3"
        },
        {
            "title": "FATF: Creating Gold Standards and Paper Realities?",
            "datePublished": "Fri, 19 Apr 2019 05:31:04 +0000",
            "description": "This show focuses on the FATF, the Financial Action Task Force. We discuss why the organization – that remains unknown to many finance and payments professionals and even to AML/CFT compliance specialists, is so powerful and important. We discuss the basics: why was it created? What are FATF’s goals? What are the down sides or unintended consequences of the standards it sets? We discuss the effects of non-compliance on countries and the inner workings of the mutual evaluation process that countries go through. Finally, we touch upon the questions of political influence, organizational overreach and even bullying through FATF decision making.\n\nSponsors:\nOtter Labs www.hireotter.com\n- Hire great and inexpensive developer with staff augmentation through Otter.\n\nRedeeem https://redeeem.click/qdza\n- Redeeem is a decentralized peer-to-peer exchange that lets you save 15% or more on gift cards using Bitcoin and other cryptocurrencies.",
            "length": "33979867",
            "sourceUrl": "http://feeds.soundcloud.com/stream/608225409-aroundthecoin-fatf-creating-gold-standards-and-paper-realities.mp3"
        },
        {
            "title": "Interview with Bitcoin critic David Gerard about everything he finds wrong with Bitcoin",
            "datePublished": "Sun, 14 Apr 2019 11:32:41 +0000",
            "description": "Nako interviews David Gerard, a Bitcoin critic. They talk about the technological superiority complex of some Bitcoin maximalists; Bitcoin's energy inefficiencies and whether crypto mass adoption is a pipe dream or closer to becoming a reality because of the Lightning Network.\n\nSponsors:\nOtter Labs www.hireotter.com\n- Hire great and inexpensive developer with staff augmentation through Otter.\n\nRedeeem https://redeeem.click/qdza\n- Redeeem is a decentralized peer-to-peer exchange that lets you save 15% or more on gift cards using Bitcoin and other cryptocurrencies.",
            "length": "75189425",
            "sourceUrl": "http://feeds.soundcloud.com/stream/605798226-aroundthecoin-interview-with-bitcoin-critic-david-gerard-about-everything-he-finds-wrong-with-bitcoin.mp3"
        },
        {
            "title": "The birth of AML/CFT",
            "datePublished": "Wed, 27 Mar 2019 18:46:28 +0000",
            "description": "This week Faisal Khan sits down with Dr. Mara Wesseling (our newest co-host) and we discuss the world of compliance. This show offers a first introduction to AML/CFT compliance (Anti-Money Laundering and Combating the Financing of Terrorism). It touches upon what compliance stands for and who needs to do it. How big and relevant is today's compliance industry? What to make of the unhappy marriage of placing AML and CFT under one legal umbrella? The show also looks into the history of the AML/CFT legal framework and what makes it important now. By reflecting upon the past 30 years of AML regulation and almost 20 years of the War on Terrorism Financing, the effectiveness question remains on the table and the call for a new approach - AML/CFT 2.0 - becomes louder.\n\nSponsors:\nOtter Labs www.hireotter.com\n- Hire great and inexpensive developer with staff augmentation through Otter.\n\nRedeeem https://redeeem.click/qdza\n- Redeeem is a decentralized peer-to-peer exchange that lets you save 15% or more on gift cards using Bitcoin and other cryptocurrencies.",
            "length": "34623914",
            "sourceUrl": "http://feeds.soundcloud.com/stream/596874381-aroundthecoin-the-birth-of-aml-cft.mp3"
        },
        {
            "title": "Understanding the Lightning Network",
            "datePublished": "Tue, 26 Mar 2019 19:00:00 +0000",
            "description": "In this episode of Around The Coin, Faisal & Nako get on the air to continue with their BTC (Behind The Coin) series. We discuss the very basics of the Lightning Network and what it means for normals folks like you and I (not to mention Bitcoin enthusiasts). We try to cover this without getting technical. Let us know how we did?\n\nSponsors:\nOtter Labs www.hireotter.com\n- Hire great and inexpensive developer with staff augmentation through Otter.\n\nRedeeem https://redeeem.click/qdza\n- Redeeem is a decentralized peer-to-peer exchange that lets you save 15% or more on gift cards using Bitcoin and other cryptocurrencies.",
            "length": "40148929",
            "sourceUrl": "http://feeds.soundcloud.com/stream/596369526-aroundthecoin-understanding-the-lightning-network.mp3"
        },
        {
            "title": "Back to basics - Financial Inclusion",
            "datePublished": "Sun, 24 Mar 2019 18:08:53 +0000",
            "description": "In this episode, Faisal and Malini discuss financial inclusion\nbeyond its basic definition, and talk through the fundamental\nbuilding blocks required for a more financially 'inclusive'\nworld.\n\nSponsors:\nOtter Labs www.hireotter.com\n- Hire great and inexpensive developer with staff augmentation through Otter.\n\nRedeeem https://redeeem.click/qdza\n- Redeeem is a decentralized peer-to-peer exchange that lets you save 15% or more on gift cards using Bitcoin and other cryptocurrencies.",
            "length": "35023306",
            "sourceUrl": "http://feeds.soundcloud.com/stream/595154646-aroundthecoin-back-to-basics-financial-inclusion.mp3"
        },
        {
            "title": "Economic Literacy Crash Course",
            "datePublished": "Sun, 24 Mar 2019 16:53:14 +0000",
            "description": "This week the trio is back on the air. Brian and Mike discuss what does capitalism and socialism mean in today's world? (Faisal unfortunately, dropped out due to technical reasons). We discuss the role of centralized governments and economic frameworks in areas such as healthcare, education, and much more. A wide-ranging high paced conversation that could have lasted for hours!\n\nSponsors:\nOtter Labs www.hireotter.com\n- Hire great and inexpensive developer with staff augmentation through Otter.\n\nRedeeem https://redeeem.click/qdza\n- Redeeem is a decentralized peer-to-peer exchange that lets you save 15% or more on gift cards using Bitcoin and other cryptocurrencies.",
            "length": "77974666",
            "sourceUrl": "http://feeds.soundcloud.com/stream/595119540-aroundthecoin-economic-literacy-crash-course.mp3"
        },
        {
            "title": "Interview with Marc Bhargava - Founder of Tagomi",
            "datePublished": "Sat, 23 Mar 2019 19:59:17 +0000",
            "description": "Description: \nMike Townsend sits down with Marc Bhargava. Marc is the founder of Tagomi, the first electronic agency prime brokerage in the digital assets space. We discuss why now is the perfect time to be building in crypto, what Marc's most contrarian crypto views are, and other thought-provoking ideas in the space. Tune in and enjoy!\n\nSponsors:\nOtter Labs www.hireotter.com\n- Hire great and inexpensive developer with staff augmentation through Otter.\n\nRedeeem https://redeeem.click/qdza\n- Redeeem is a decentralized peer-to-peer exchange that lets you save 15% or more on gift cards using Bitcoin and other cryptocurrencies.",
            "length": "32885245",
            "sourceUrl": "http://feeds.soundcloud.com/stream/594755301-aroundthecoin-interview-with-marc-bhargava-founder-of-tagomi.mp3"
        },
        {
            "title": "The Great Depression",
            "datePublished": "Tue, 19 Mar 2019 21:43:59 +0000",
            "description": "The Great Depression: How the Great Depression impacted our modern financial world. \n\nMike and Brian dissect events that played a major role in the Great Depression such as the telephone, prohibition, food subsidies, bank closures, wage laws and more. We reflect on how each of these policy changes shaped the world we live in today and how you can predict the future by understanding cycles of the past.\n\nLinks: \nhttps://www.thebalance.com/the-great-depression-of-1929-3306033\nhttps://www.history.com/topics/great-depression/great-depression-history\nhttps://en.wikipedia.org/wiki/Edward_R._Dewey\n\nSponsors:\nOtter Labs www.hireotter.com\n- Hire great and inexpensive developer with staff augmentation through Otter.\n\nRedeeem https://redeeem.click/qdza\n- Redeeem is a decentralized peer-to-peer exchange that lets you save 15% or more on gift cards using Bitcoin and other cryptocurrencies.",
            "length": "57425693",
            "sourceUrl": "http://feeds.soundcloud.com/stream/592699917-aroundthecoin-the-great-depression.mp3"
        },
        {
            "title": "Interview with Jack Jia of Wyre",
            "datePublished": "Sat, 09 Mar 2019 06:59:19 +0000",
            "description": "This week Mike Townsend sits down with Jack Jia of Wyre. Jack is the founding employee at Wyre and in this show we talk about the inspiration for the idea which largely came from a PayPal hackathon in 2015. We talk about how Wyre uses bitcoin behind the scene to enable much faster and cheaper foreign exchange. We also spoke about Jack's experience living and doing business in China and how he sees the crypto landscape unfolding in the US and globally.\n\nSponsors:\nOtter Labs www.hireotter.com\n- Hire great and inexpensive developer with staff augmentation through Otter.\n\nRedeeem https://redeeem.click/qdza\n- Redeeem is a decentralized peer-to-peer exchange that lets you save 15% or more on gift cards using Bitcoin and other cryptocurrencies.",
            "length": "42104574",
            "sourceUrl": "http://feeds.soundcloud.com/stream/587278020-aroundthecoin-interview-with-jack-jia-of-wyre.mp3"
        },
        {
            "title": "A Story of Credit Cards",
            "datePublished": "Sun, 03 Mar 2019 19:10:27 +0000",
            "description": "An in depth look at the history of the credit card companies that run our global financial networks. We touch it all, from the founding of American Express in 1850 to charge coins, money orders, traveler's checks, diners club cards, the first credit card US Patent, and the formation of Visa and MasterCard. The origin stories of the financial industry carry lessons that will inspire anyone working to make a change in the world.\n\nSponsors:\nOtter Labs www.hireotter.com\n- Hire great and inexpensive developer with staff augmentation through Otter.\n\nRedeeem https://redeeem.click/qdza\n- Redeeem is a decentralized peer-to-peer exchange that lets you save 15% or more on gift cards using Bitcoin and other cryptocurrencies.",
            "length": "48245667",
            "sourceUrl": "http://feeds.soundcloud.com/stream/584401173-aroundthecoin-a-story-of-credit-cards.mp3"
        },
        {
            "title": "Unblocking the Unbanked",
            "datePublished": "Wed, 27 Feb 2019 07:19:55 +0000",
            "description": "The unbanked are often overlooked due to their inability to integrate into the global economic engine. In this episode, we look at who they are, what their life is like, and what obstacles stand in the way for them to join the financial system. Could blockchain based startups like Bloom, Civic, and Spring Labs provide a reliable decentralized credit infrastructure and unlock the economic potential of the unbanked? Find out in this week's episode.\n\nSponsors:\nOtter Labs www.hireotter.com\n- Hire great and inexpensive developer with staff augmentation through Otter.\n\nRedeeem https://redeeem.click/qdza\n- Redeeem is a decentralized peer-to-peer exchange that lets you save 15% or more on gift cards using Bitcoin and other cryptocurrencies.",
            "length": "49265043",
            "sourceUrl": "http://feeds.soundcloud.com/stream/582049182-aroundthecoin-unblocking-the-unbanked.mp3"
        },
        {
            "title": "BTC - Behind The Coin - Ep 5 - Interview with Tyrone Ross of NobleBridge Wealth",
            "datePublished": "Sat, 09 Feb 2019 09:14:51 +0000",
            "description": "This week Behind The Coin Host Nako Mbelle sits down with Tyrone Ross of NobleBridge Wealth. Tyrone has more than a decade of experience in the financial services industry.\n\nTyrone has worked for large wirehouse firms like Morgan Stanley and Merrill Lynch where he gained investment management and financial planning experience leading him to break away and become an independent investment advisor. Currently, he works as a financial advisor to early-stage startups and has in-depth knowledge of blockchain and crypto assets. \n\nTyrone is also an established speaker having addressed employees at Etsy, Spotify, Uber and Wyndham as well as students at Columbia, York College, Seton Hall, and Montclair State University. \n\nTyrone is a graduate of Seton Hall University and was also a 2004 Olympic Trials qualifier in track and field in the 400 meters. This year Tyrone was recognized by Wealth Management.com as a top ten advisor set to change the industry.\n\nSponsors:\nOtter Labs www.hireotter.com\n- Hire great and inexpensive developer with staff augmentation through Otter.\n\nRedeeem https://redeeem.click/qdza\n- Redeeem is a decentralized peer-to-peer exchange that lets you save 15% or more on gift cards using Bitcoin and other cryptocurrencies.",
            "length": "59961494",
            "sourceUrl": "http://feeds.soundcloud.com/stream/572554335-aroundthecoin-btc-behind-the-coin-ep-5-interview-with-tyrone-ross-of-noblebridge-wealth.mp3"
        },
        {
            "title": "Interview with Andy Bryant COO bitFlyer Europe",
            "datePublished": "Wed, 06 Feb 2019 03:50:21 +0000",
            "description": "In this episode, we get a change to sit down and have a chat with Andy Bryant, who is the COO of bitFlyer Europe. bitFlyer is a licensed cryptocurrency exchange in Japan and holds additional licenses in Europe and the United States. We talk with Andy where we stand today with respect to crypto exchanges and what might we see in the coming months/years as cryptocurrency trading evolves more into mainstream.\n\nSponsors:\nOtter Labs www.hireotter.com\n- Hire great and inexpensive developer with staff augmentation through Otter.\n\nRedeeem https://redeeem.click/qdza\n- Redeeem is a decentralized peer-to-peer exchange that lets you save 15% or more on gift cards using Bitcoin and other cryptocurrencies.",
            "length": "41447973",
            "sourceUrl": "http://feeds.soundcloud.com/stream/570891696-aroundthecoin-interview-with-andy-bryant-coo-bitflyer-europe.mp3"
        },
        {
            "title": "Is Speech Too Dangerous To Be Free?",
            "datePublished": "Sun, 27 Jan 2019 14:17:23 +0000",
            "description": "Faisal, Mike, and Brian jump right in the deep end debating the decision of tech giants like Youtube, Twitter, and Facebook to ban people for spreading the wrong ideas. We talk about how ancient civilizations dealt with free speech, and how special and unusual free speech is today. The discussion which was very dynamic and engaging wrapped up with 10 minutes at the end mentioning the top payments and crypto conferences to look for in 2019.\n\nSponsors:\nOtter Labs www.hireotter.com\n- Hire great and inexpensive developer with staff augmentation through Otter.\n\nRedeeem https://redeeem.click/qdza\n- Redeeem is a decentralized peer-to-peer exchange that lets you save 15% or more on gift cards using Bitcoin and other cryptocurrencies.",
            "length": "49256277",
            "sourceUrl": "http://feeds.soundcloud.com/stream/565357050-aroundthecoin-is-speech-too-dangerous-to-be-free.mp3"
        },
        {
            "title": "How Our Collective Myths Shape The World",
            "datePublished": "Sat, 19 Jan 2019 20:40:08 +0000",
            "description": "In this show, the hosts give a special thanks to listeners Kevin McKernan, Scott Dueweke, and Shahid Sharif for their ongoing support. \n\nThe first topic of discussion seeks to expose the listener to the complexity of our global banking system and how many insiders don't appreciate the big picture of history. From there we debate ideas in cryptocurrency regulation, get a better understanding of the innovation in Baltic countries, and end on Brian's \"most important life message\".\n\nList of country debts: \nhttps://en.wikipedia.org/wiki/List_of_countries_by_public_debt\n\nThesis, antithesis, synthesis by Friedrich Hegel:\nhttps://en.wikipedia.org/wiki/Thesis,_antithesis,_synthesis \n\nRichard Feynman lectures: \nhttps://www.youtube.com/watch?v=wMFPe-DwULM\n\nSponsors:\nOtter Labs www.hireotter.com\n- Hire great and inexpensive developer with staff augmentation through Otter.\n\nRedeeem https://redeeem.click/qdza\n- Redeeem is a decentralized peer-to-peer exchange that lets you save 15% or more on gift cards using Bitcoin and other cryptocurrencies.",
            "length": "58672065",
            "sourceUrl": "http://feeds.soundcloud.com/stream/561570330-aroundthecoin-how-our-collective-myths-shape-the-world.mp3"
        },
        {
            "title": "The Story of Knowledge - How Science, Psychedelics, and Ancient History shapes the World",
            "datePublished": "Sat, 12 Jan 2019 21:54:05 +0000",
            "description": "This week, the trio talk about: Hegelian dielectric (Dialectical materialism), Ted David Christian 2011 History of our World in 18 minutes, Julian Jaynes Breakdown of Bicameral Mind, The impact of psychedelics back into Western Medicine, The global political waves impacting life today, Calcite microcrystals in the pineal gland of the human brain (https://www.ncbi.nlm.nih.gov/pubmed/12224052) and After On podcast - Harvard astronomy department chairman Avi Loeb https://after-on.com/episodes-31-60/040\n\nSponsors:\nOtter Labs www.hireotter.com\n- Hire great and inexpensive developer with staff augmentation through Otter.\n\nRedeeem https://redeeem.click/qdza\n- Redeeem is a decentralized peer-to-peer exchange that lets you save 15% or more on gift cards using Bitcoin and other cryptocurrencies.",
            "length": "58086612",
            "sourceUrl": "http://feeds.soundcloud.com/stream/558088251-aroundthecoin-the-story-of-knowledge-how-science-psychedelics-and-ancient-history-shapes-the-world.mp3"
        },
        {
            "title": "The Rabbit Hole of Currency",
            "datePublished": "Mon, 07 Jan 2019 05:54:34 +0000",
            "description": "The trio, Brian Roemmele, Mike Townsend and Faisal Khan are back on air, starting season four of Around The Coin. This week we discuss: Thoughts on why currency evolved, how it shaped the world around us, and the inevitable future direction it will take.\n\nSponsors:\nOtter Labs www.hireotter.com\n- Hire great and inexpensive developer with staff augmentation through Otter.\n\nRedeeem https://redeeem.click/qdza\n- Redeeem is a decentralized peer-to-peer exchange that lets you save 15% or more on gift cards using Bitcoin and other cryptocurrencies.",
            "length": "51273354",
            "sourceUrl": "http://feeds.soundcloud.com/stream/555220311-aroundthecoin-the-rabbit-hole-of-currency.mp3"
        },
        {
            "title": "The Decentralized Economy - Interview with CEO of Radar Relay Alan Curtis",
            "datePublished": "Fri, 07 Sep 2018 19:54:25 +0000",
            "description": "In July, Ethereum founder Vitalik Buterin, shared some choice words for centralized cryptocurrency exchanges, hoping they “burn in hell”. \n\nThese exchanges are some of the most powerful players in the digital currency market, acting as the middleman between buyers and seller, however, according to JPMorgan, one-third of centralized crypto exchanges have been subject to hacks. Over the past year, decentralized exchanges that don’t hold custody of funds and allow buyers and sellers to directly exchange tokens have been growing in popularity, gaining attention across the industry segment.\n\nNow imagine a decentralized trading platform for ERC-20 compliant tokens the runs on the 0x protocol. Users are able to trade tokens wallet-to-wallet with other traders via the Ethereum blockchain without giving custody of the tokens to an exchange or smart contract. This improves both the speed, security, and safety of peer-to-peer trading compared to a centralized exchange.\n\nOnce such startup doing exactly that. Changing the world, one user at a time in a decentralized manner. That company is called Radar Relay and I recently had the chance to interview the CEO Alan Curtis.\n\nSponsors:\nOtter Labs www.hireotter.com\n- Hire great and inexpensive developer with staff augmentation through Otter.\n\nRedeeem https://redeeem.click/qdza\n- Redeeem is a decentralized peer-to-peer exchange that lets you save 15% or more on gift cards using Bitcoin and other cryptocurrencies.",
            "length": "46471923",
            "sourceUrl": "http://feeds.soundcloud.com/stream/496744011-aroundthecoin-the-decentralized-economy-interview-with-ceo-of-radar-relay-alan-curtis.mp3"
        },
        {
            "title": "Ep 159: The Oligopoly in American Banking That No One Talks About",
            "datePublished": "Sat, 25 Aug 2018 13:24:08 +0000",
            "description": "To kick things off for Season 4, I'd thought I'd interview someone peculiar. Aaron Silva and I got in touch in which he told me of a very unique story in the banking world, that people don't talk about. To put it bluntly, the oligopoly of the three large CBS (Core Banking System) providers in the United States, i.e. Jack Henry, FIS Global and Fiserv. Amongst these three giants, they pretty much dominate (read: control) the core banking system and allied services market in the US. \n\nSo what's the problem? Well, they say the devil is in the details. 1000s of banks sign away these contracts with the big 3, not knowing what they have given up, as far as the freedom, flexibility  and independence of purchasing these systems go and what happens to the ownership of the bank's data.\n\nWithout any further delay, we will speak to Aaron Silva of Paladin FS to shed light on this very dark subject.\n\nSponsors:\nOtter Labs www.hireotter.com\n- Hire great and inexpensive developer with staff augmentation through Otter.\n\nRedeeem https://redeeem.click/qdza\n- Redeeem is a decentralized peer-to-peer exchange that lets you save 15% or more on gift cards using Bitcoin and other cryptocurrencies.",
            "length": "36617623",
            "sourceUrl": "http://feeds.soundcloud.com/stream/490446996-aroundthecoin-the-oligopoly-in-banking-that-no-one-talks-about.mp3"
        },
        {
            "title": "Fintech Podcast - Episode 158 - The Fragmented World of Payments",
            "datePublished": "Sun, 01 Apr 2018 18:07:23 +0000",
            "description": "This week Mike Townsend and Faisal Khan discuss the topic that has been on everyone else’s mind, but we hardly speak of it. The fragmented world of payments and how broken the system is. We discuss with simple examples of why the cross-border money transfer system is broken and how it represents a multi trillion dollar opportunity.\n\nSponsors:\nOtter Labs www.hireotter.com\n- Hire great and inexpensive developer with staff augmentation through Otter.\n\nRedeeem https://redeeem.click/qdza\n- Redeeem is a decentralized peer-to-peer exchange that lets you save 15% or more on gift cards using Bitcoin and other cryptocurrencies.",
            "length": "43039987",
            "sourceUrl": "http://feeds.soundcloud.com/stream/423279918-aroundthecoin-fintech-podcast-episode-158-the-fragmented-world-of-payments.mp3"
        },
        {
            "title": "Fintech Podcast - Episode 157 - Pulse Check on the Crypto Payments World",
            "datePublished": "Fri, 30 Mar 2018 17:36:07 +0000",
            "description": "The Original Crew: Brian Roemmele, Mike Townsend and Faisal Khan get back on the air. This time we discuss all what is going in the world of payments, especially crypto based regulation.\n\nSponsors:\nOtter Labs www.hireotter.com\n- Hire great and inexpensive developer with staff augmentation through Otter.\n\nRedeeem https://redeeem.click/qdza\n- Redeeem is a decentralized peer-to-peer exchange that lets you save 15% or more on gift cards using Bitcoin and other cryptocurrencies.",
            "length": "43403388",
            "sourceUrl": "http://feeds.soundcloud.com/stream/422415429-aroundthecoin-fintech-podcast-episode-157-pulse-check-on-the-crypto-payments-world.mp3"
        },
        {
            "title": "BTC - Behind The Coin - Ep 4 - Terms of Endearment in the Crypto World",
            "datePublished": "Wed, 28 Mar 2018 14:34:17 +0000",
            "description": "On this week's podcast, we discuss why common terms like addresses, wallets, pre-mines and forks confuse newcomers and observers in the space. We clear up common misconceptions which is costing many crypto traders millions BTC and ETH. Learning this one \"not-well known\" recovery process can help you get back any BTC or some alt-coins you may have lost.   Lastly, we talk about some of our favorite crypto lingo: HODL.\n\nSponsors:\nOtter Labs www.hireotter.com\n- Hire great and inexpensive developer with staff augmentation through Otter.\n\nRedeeem https://redeeem.click/qdza\n- Redeeem is a decentralized peer-to-peer exchange that lets you save 15% or more on gift cards using Bitcoin and other cryptocurrencies.",
            "length": "54839363",
            "sourceUrl": "http://feeds.soundcloud.com/stream/421340970-aroundthecoin-btc-behind-the-coin-ep-4-terms-of-endearment-in-the-crypto-world.mp3"
        },
        {
            "title": "Fintech Podcast - Episode 156 - Interview with the Co-Founders of Kora",
            "datePublished": "Fri, 09 Mar 2018 17:44:00 +0000",
            "description": "Around the Coin got a chance to sit down with both the Co-Founders of Kora, Dickson Nsofor (CEO) and Maomao Hu (COO).\n\nKora is a blockchain company that is focused on bringing low-cost access to financial services to as many people as possible. They are building a blockchain network and embedding into it functionality where it can be accessed by anyone, and helping people access the blockchain without internet by going through telecom networks. They are investigating betas this year around solving the problem of financial infrastructure, including payments to Nigerian farmers, trade financing to Colombian coffee exporters, and core systems for a Bangladeshi co-op.\n\nSponsors:\nOtter Labs www.hireotter.com\n- Hire great and inexpensive developer with staff augmentation through Otter.\n\nRedeeem https://redeeem.click/qdza\n- Redeeem is a decentralized peer-to-peer exchange that lets you save 15% or more on gift cards using Bitcoin and other cryptocurrencies.",
            "length": "49318554",
            "sourceUrl": "http://feeds.soundcloud.com/stream/411185769-aroundthecoin-fintech-podcast-episode-interview-with-the-co-founders-of-kora.mp3"
        },
        {
            "title": "Fintech Podcast - Episode 155 - Interview with Evgeni Mitkov COO of Everex",
            "datePublished": "Thu, 08 Mar 2018 20:37:02 +0000",
            "description": "Everex is a blockchain technology provider offering global money transfer, payment and currency exchange solutions to financial and non-financial institutions worldwide.\n\nEverex technology enables its partners to usher individuals and SMEs, with or without access to banking services, into the new global economy with real-time fiat payments using distributed ledger technology. Fiat currency transactions are powered and governed by smart contracts in compliance with existing regulations. Everex payment ecosystem brings the best of banking and blockchain together.\n\nSponsors:\nOtter Labs www.hireotter.com\n- Hire great and inexpensive developer with staff augmentation through Otter.\n\nRedeeem https://redeeem.click/qdza\n- Redeeem is a decentralized peer-to-peer exchange that lets you save 15% or more on gift cards using Bitcoin and other cryptocurrencies.",
            "length": "42800472",
            "sourceUrl": "http://feeds.soundcloud.com/stream/410701605-aroundthecoin-fintech-podcast-episode-155-interview-with-evgeni-mitkof-coo-of-everex.mp3"
        },
        {
            "title": "Fintech Podcast - Episode 154 - Bitcoin Challenge with Amelie Arras",
            "datePublished": "Thu, 08 Mar 2018 18:46:37 +0000",
            "description": "In a quest to best demonstrate the real-world challenges of everyday transactions, using nothing but bitcoin, Amelie’s challenge is to purchase everything from food to travel to accommodation during the five-day race, beginning in Hong Kong on 10th March 2018. Amelie must complete a series of daring challenges on route to win points along the way; competing with more traditional payment method including, mobile payments, gold, cash and plastic card, the person with the most number of points when they cross the finish line at Money20/20 Asia in Singapore is the winner.\n\nSponsors:\nOtter Labs www.hireotter.com\n- Hire great and inexpensive developer with staff augmentation through Otter.\n\nRedeeem https://redeeem.click/qdza\n- Redeeem is a decentralized peer-to-peer exchange that lets you save 15% or more on gift cards using Bitcoin and other cryptocurrencies.",
            "length": "14337867",
            "sourceUrl": "http://feeds.soundcloud.com/stream/410649534-aroundthecoin-fintech-podcast-episode-154-bitcoin-challenge-with-amelie-arras.mp3"
        },
        {
            "title": "BTC - Behind The Coin - Ep 3 - Interview with Thomas Euler",
            "datePublished": "Sat, 03 Mar 2018 17:43:24 +0000",
            "description": "For the past 10+ years, Thomas worked with countless clients – global corporations, SMEs, and startups – on their digital strategy and transformation efforts. His main subjects are internet business models and antifragile organizations. Due to his long-standing interest in decentralized systems, he researched the blockchain space from early on. These days, Thomas is working in the blockchain space with the Untitled INC network, doing consulting and developing independent projects.\n\nSponsors:\nOtter Labs www.hireotter.com\n- Hire great and inexpensive developer with staff augmentation through Otter.\n\nRedeeem https://redeeem.click/qdza\n- Redeeem is a decentralized peer-to-peer exchange that lets you save 15% or more on gift cards using Bitcoin and other cryptocurrencies.",
            "length": "77344491",
            "sourceUrl": "http://feeds.soundcloud.com/stream/408138108-aroundthecoin-btc-behind-the-coin-ep-3-interview-with-thomas-euler.mp3"
        },
        {
            "title": "BTC - Behind The Coin - Ep 2 - Why We Believe in Bitcoin, Cryptocurrency and Blockchain",
            "datePublished": "Sat, 03 Mar 2018 17:37:29 +0000",
            "description": "It's just as important for us to discuss the reasons WHY we believe Bitcoin, Cryptocurrency and Blockchain as it is to discuss  HOW to participate in it. The WHYs are the only reason you'll be able to withstand the huge volatility in the market. The goal is to shed some light on the world of crypto for you to understand the WHY and the HOW (to participate)\n\nSponsors:\nOtter Labs www.hireotter.com\n- Hire great and inexpensive developer with staff augmentation through Otter.\n\nRedeeem https://redeeem.click/qdza\n- Redeeem is a decentralized peer-to-peer exchange that lets you save 15% or more on gift cards using Bitcoin and other cryptocurrencies.",
            "length": "48357040",
            "sourceUrl": "http://feeds.soundcloud.com/stream/408133158-aroundthecoin-btc-behind-the-coin-ep-2-why-we-believe-in-bitcoin-cryptocurrency-and-blockchain-and-how-to-participate-in-it.mp3"
        },
        {
            "title": "Fintech Podcast - Money On The Move - Episode 3 - The $10 Trillion Problem Of Moving Money",
            "datePublished": "Sat, 03 Mar 2018 17:02:44 +0000",
            "description": "In this episode, we talk about the tens of trillions of dollars of problems faced in moving money around the world by the banking system. What is the challenge with money moving through the banking system today. Why is it so expensive to do a wire transfer today. How complex does it get? How might Ripple solve this problem and will it be successful?\n\nSponsors:\nOtter Labs www.hireotter.com\n- Hire great and inexpensive developer with staff augmentation through Otter.\n\nRedeeem https://redeeem.click/qdza\n- Redeeem is a decentralized peer-to-peer exchange that lets you save 15% or more on gift cards using Bitcoin and other cryptocurrencies.",
            "length": "21166706",
            "sourceUrl": "http://feeds.soundcloud.com/stream/408122238-aroundthecoin-fintech-podcast-money-on-the-move-episode-3-the-10-trillion-problem-of-moving-money.mp3"
        },
        {
            "title": "Crypto Podcast - BTC Behind The Coin - Pilot Episode",
            "datePublished": "Sat, 20 Jan 2018 12:34:32 +0000",
            "description": "Behind The Coin (BTC) in a brand new weekly podcast series that is focused towards the world of crypto! Be it bitcoin or an Alt-coin you've not heard of, from mining to trading to proof of stake. From ICOs to how-tos, the aim of this podcast is to cover it all. Let's not forget the movers and shakers from the crypto world we intend to interview!\n\nThis pilot episode, sets the stage was to what you can expect of us.\n\nSponsors:\nOtter Labs www.hireotter.com\n- Hire great and inexpensive developer with staff augmentation through Otter.\n\nRedeeem https://redeeem.click/qdza\n- Redeeem is a decentralized peer-to-peer exchange that lets you save 15% or more on gift cards using Bitcoin and other cryptocurrencies.",
            "length": "38505742",
            "sourceUrl": "http://feeds.soundcloud.com/stream/386438858-aroundthecoin-crypto-podcast-btc-behind-the-coin-pilot-episode.mp3"
        },
        {
            "title": "Fintech Podcast - Money On the Move - Episode 2 - Behind The Figures",
            "datePublished": "Tue, 16 Jan 2018 08:32:19 +0000",
            "description": "In this episode we decode the often quoted figure of $600 billion annual remittances in 2017, to understand where this number comes from and how it’s calculated. We also cover the informal money transfer industry or ‘hawala’ system and discuss how to interpret the global cost of remittances.\n\nSponsors:\nOtter Labs www.hireotter.com\n- Hire great and inexpensive developer with staff augmentation through Otter.\n\nRedeeem https://redeeem.click/qdza\n- Redeeem is a decentralized peer-to-peer exchange that lets you save 15% or more on gift cards using Bitcoin and other cryptocurrencies.",
            "length": "25739787",
            "sourceUrl": "http://feeds.soundcloud.com/stream/384328172-aroundthecoin-fintech-podcast-money-on-the-move-episode-2-behind-the-figures.mp3"
        },
        {
            "title": "Fintech Podcast - Money on the Move: Pilot Episode",
            "datePublished": "Tue, 09 Jan 2018 19:39:55 +0000",
            "description": "Pilot Episode of a new series called \"Money on the Move\" on Around The Coin.\n\nSponsors:\nOtter Labs www.hireotter.com\n- Hire great and inexpensive developer with staff augmentation through Otter.\n\nRedeeem https://redeeem.click/qdza\n- Redeeem is a decentralized peer-to-peer exchange that lets you save 15% or more on gift cards using Bitcoin and other cryptocurrencies.",
            "length": "28746152",
            "sourceUrl": "http://feeds.soundcloud.com/stream/381164150-aroundthecoin-money-on-the-move-pilot-episode.mp3"
        },
        {
            "title": "Fintech Podcast - Ep 153 Interview with Lawrence Richardson CEO of ZeroSum Markets",
            "datePublished": "Sat, 06 Jan 2018 18:39:23 +0000",
            "description": "Take game theory, throw a lil' bit of real-money, add the stock markets of the world, squeeze some incentives and don't forget a pinch or two of the crypto-world and shake it (or stir it) - what do you get? You get daily fantasy trading! Trade against your peers and not the professionals. Listen to our interview with Lawrence Richardson, CEO Founder of ZeroSum Markets.\n\nSponsors:\nOtter Labs www.hireotter.com\n- Hire great and inexpensive developer with staff augmentation through Otter.\n\nRedeeem https://redeeem.click/qdza\n- Redeeem is a decentralized peer-to-peer exchange that lets you save 15% or more on gift cards using Bitcoin and other cryptocurrencies.",
            "length": "32160532",
            "sourceUrl": "http://feeds.soundcloud.com/stream/379707056-aroundthecoin-fintech-podcast-ep-153-interview-with-lawrence-richardson-ceo-of-zerosum-markets.mp3"
        },
        {
            "title": "Fintech Podcast - Episode 152 - Is Bitcoin A Bubble Or Is This The Real Deal",
            "datePublished": "Sun, 10 Dec 2017 19:01:30 +0000",
            "description": "This week the three co-hosts, Brian Roemmele, Mike Townsend and Faisal Khan are back on the air, discussing what is proverbial $64 Million Question: Is Bitcoin A Bubble? (or is this the real deal?) For the last couple of years bitcoin has seen almost no sharp rise, until this year, from August onwards, the price of bitcoin has been sky-rocketing. Famed economists tell us we are in a bubble. Investment experts tell us we are in a bubble. But are we in a bubble. Tune in and listen to three different view points on the Bitcoin & Bubble argument.\n\nSponsors:\nOtter Labs www.hireotter.com\n- Hire great and inexpensive developer with staff augmentation through Otter.\n\nRedeeem https://redeeem.click/qdza\n- Redeeem is a decentralized peer-to-peer exchange that lets you save 15% or more on gift cards using Bitcoin and other cryptocurrencies.",
            "length": "56417598",
            "sourceUrl": "http://feeds.soundcloud.com/stream/367641701-aroundthecoin-fintech-podcast-episode-152-is-bitcoin-a-bubble-or-is-this-the-real-deal.mp3"
        },
        {
            "title": "Amélie Arras - Bitcoin Challenge",
            "datePublished": "Thu, 19 Oct 2017 19:05:52 +0000",
            "description": "From sight seeing in Toronto, to Niagara Falls, Amelie is settling into her days off before the race begins. Follow her from her cosy flat, to Gatwick, to Toronto. With one more day left before the race begins, this is her last opportunity for some down time, as in less than a day, Amelie will be setting off. She will be making the monumental journey across America to Las Vegas, using only Bitcoin as payment. Head over to our page to read the rules, and what Amelie is up against.\n\nAround the Coin is very happy to cover her challenge and see how it unfolds...\n\nSponsors:\nOtter Labs www.hireotter.com\n- Hire great and inexpensive developer with staff augmentation through Otter.\n\nRedeeem https://redeeem.click/qdza\n- Redeeem is a decentralized peer-to-peer exchange that lets you save 15% or more on gift cards using Bitcoin and other cryptocurrencies.",
            "length": "6948060",
            "sourceUrl": "http://feeds.soundcloud.com/stream/347663163-aroundthecoin-amelie-arras-bitcoin-challenge.mp3"
        },
        {
            "title": "Fintech Podcast - Episode 151 - Crypto-Economics as explained by Dr Chris Berg",
            "datePublished": "Mon, 25 Sep 2017 19:35:41 +0000",
            "description": "Our guest today holds a Ph.D. in economics from Royal Melbourne Institute of Technology, better know as RMIT University (Australia) His thesis was titled \"Safety and Soundness: An Economic History of Prudential Bank Regulation in Australia, 1893-2008\", and offered the first comprehensive history of the politics and economics of prudential bank regulation in Australia.\n\nFair to say, my guest knows his financial regulations. Dr. Berg is one of Australia’s most prominent voices for free markets and individual liberty, and a leading authority on over-regulation, economic freedom, and civil liberties.\n\nOur talk with him today will be around \"Crypto-Economics\".\n\nSponsors:\nOtter Labs www.hireotter.com\n- Hire great and inexpensive developer with staff augmentation through Otter.\n\nRedeeem https://redeeem.click/qdza\n- Redeeem is a decentralized peer-to-peer exchange that lets you save 15% or more on gift cards using Bitcoin and other cryptocurrencies.",
            "length": "43801588",
            "sourceUrl": "http://feeds.soundcloud.com/stream/343996083-aroundthecoin-fintech-podcast-episode-151-crypto-economics-as-explained-by-dr-chris-berg.mp3"
        },
        {
            "title": "Fintech Podcast - Episode 150 - Discussing Segwit & Segwit2X with Ryan X. Charles",
            "datePublished": "Sat, 16 Sep 2017 10:22:47 +0000",
            "description": "Bitcoin recently experienced a hard fork which resulted in Bitcoin classic if you will and Bitcoin Cash. This was because of Segwit. Now there is Segwit2X coming up and the possibility to have perhaps another form of bitcoin - i.e. there will be 3 different versions of bitcoin out to trade and use.\n\nTo explain all this, we needed to bring an expert in. Ryan Charles is the Cofounder and CEO of Yours.org. \n\nRyan's been involved in the blockchain industry since 2011. He's has worked as an engineer at BitPay and BitGo as well as he was the Cryptocurrency engineer of Reddit from 2014-2015. As as proponent of Bitcoin Cash, Ryan explains to us the intricacies of what's happening with Bitcoin.\n\nTo help us with that, I've invited Nako Mbelle who is one of our new co-hosts and she will be having this illuminating chat with Ryan.\n\nSponsors:\nOtter Labs www.hireotter.com\n- Hire great and inexpensive developer with staff augmentation through Otter.\n\nRedeeem https://redeeem.click/qdza\n- Redeeem is a decentralized peer-to-peer exchange that lets you save 15% or more on gift cards using Bitcoin and other cryptocurrencies.",
            "length": "40091397",
            "sourceUrl": "http://feeds.soundcloud.com/stream/342609156-aroundthecoin-segwit-and-segwith2x-with-ryan-x-charles.mp3"
        },
        {
            "title": "Fintech Podcast - Episode 149 - ICO Mania - Equifax Hack & Apple",
            "datePublished": "Sun, 10 Sep 2017 20:16:53 +0000",
            "description": "The duo is back: This week Faisal Khan & Brian Roemmele are back together on the air after a brief break. We discuss the gold-rush behind ICOs and the move by China to ban ICOs (or Token Sales) and what impact will that have on the ICO industry. Will it get worse before it gets better or will we see a strong regulation clamp down? In other news the recent breach at Equifax, of the three leading credit scoring agency, where possibly millions of records on Americans consumers have been compromised. What does this mean? What effect can it have on the economy and the whole credit rating system itself? Will the playbook be rewritten? Lastly, we discuss what will happen on 12th September when Apple possibly releases the new iPhone, being dubbed as iPhone X by Brian Roemmele.\n\nSponsors:\nOtter Labs www.hireotter.com\n- Hire great and inexpensive developer with staff augmentation through Otter.\n\nRedeeem https://redeeem.click/qdza\n- Redeeem is a decentralized peer-to-peer exchange that lets you save 15% or more on gift cards using Bitcoin and other cryptocurrencies.",
            "length": "64485915",
            "sourceUrl": "http://feeds.soundcloud.com/stream/341781792-aroundthecoin-fintech-podcast-episode-149-ico-mania-equifax-hack-apple.mp3"
        },
        {
            "title": "Fintech Podcast - Episode 148 - The Smart POS -  Interview with AEVI CEO Nelson Holzner",
            "datePublished": "Wed, 06 Sep 2017 16:55:16 +0000",
            "description": "If you think the point of sale terminal is just this static old machine through which you swipe your card, well, I've got news for you. Times-a-changing. \n\nOn this show we have Nelson Holzner CEO of AEVI from Germany and he is here to tell us, the new POS is not your grandfather's POS anymore. Innovation has come knocking on the merchant's door.\n\nSponsors:\nOtter Labs www.hireotter.com\n- Hire great and inexpensive developer with staff augmentation through Otter.\n\nRedeeem https://redeeem.click/qdza\n- Redeeem is a decentralized peer-to-peer exchange that lets you save 15% or more on gift cards using Bitcoin and other cryptocurrencies.",
            "length": "48943900",
            "sourceUrl": "http://feeds.soundcloud.com/stream/341185241-aroundthecoin-fintech-podcast-episode-148-the-smart-pos-interview-with-aevi-ceo-nelson-holzner.mp3"
        },
        {
            "title": "Fintech Podcast - Episode 147 - Interview with Mike Jones CEO of Science Inc",
            "datePublished": "Sat, 02 Sep 2017 15:20:51 +0000",
            "description": "It is not every day you get to interview great people. Mike Jones who is the Co-Founder and CEO of Science Inc., a very successful VC firm based out of Los Angeles. We get to talk to Mike about his past success (Dollar Shave Club, Famebit, HelloSociety to name a few), and how the idea behind Science came about and what is it that they do differently. Also, we have Mike open up a bit about their upcoming Science ICO.\n\nSponsors:\nOtter Labs www.hireotter.com\n- Hire great and inexpensive developer with staff augmentation through Otter.\n\nRedeeem https://redeeem.click/qdza\n- Redeeem is a decentralized peer-to-peer exchange that lets you save 15% or more on gift cards using Bitcoin and other cryptocurrencies.",
            "length": "32179292",
            "sourceUrl": "http://feeds.soundcloud.com/stream/340599860-aroundthecoin-fintech-podcast-episode-147-interview-with-mike-jones-ceo-of-science-inc.mp3"
        },
        {
            "title": "Fintech Podcast - Episode 146 - Bitcoin - Segwit and Segwit2X",
            "datePublished": "Fri, 25 Aug 2017 08:48:37 +0000",
            "description": "This week co-hosts Faisal Khan and Nako Mbelle interview CEO of Prasos, Henry Brade who is has been involved in cryptocurrency since 2011 to get his take on Segwit and Segwit2X, what is the difference between the two? What does it mean for the rest of us.\n\nSponsors:\nOtter Labs www.hireotter.com\n- Hire great and inexpensive developer with staff augmentation through Otter.\n\nRedeeem https://redeeem.click/qdza\n- Redeeem is a decentralized peer-to-peer exchange that lets you save 15% or more on gift cards using Bitcoin and other cryptocurrencies.",
            "length": "44086683",
            "sourceUrl": "http://feeds.soundcloud.com/stream/339423181-aroundthecoin-fintech-podcast-episode-146-bitcoin-segwit-and-segwit2x.mp3"
        },
        {
            "title": "Employment opportunities in the Crypto & Blockchain space",
            "datePublished": "Thu, 17 Aug 2017 20:18:57 +0000",
            "description": "In this episode of Around The Coin, Faisal Khan and one of our new co-hosts Nako Mbelle discuss the world of crypto and blockchain, specifically from the employment point of view. Nako is the CEO/Founder of Fintech Recruiters based in Toronto, Canada and she has first hand experience on all things employment in the bitcoin, blockchain, ethereum, crypto-coin space. We ask Nako what is working (and not) with respect to job opportunities in the space, how to position yourself for employments and what to look out for in the coming years.\n\nSponsors:\nOtter Labs www.hireotter.com\n- Hire great and inexpensive developer with staff augmentation through Otter.\n\nRedeeem https://redeeem.click/qdza\n- Redeeem is a decentralized peer-to-peer exchange that lets you save 15% or more on gift cards using Bitcoin and other cryptocurrencies.",
            "length": "47199720",
            "sourceUrl": "http://feeds.soundcloud.com/stream/338320593-aroundthecoin-employment-opportunities-in-the-crypto-blockchain-space.mp3"
        },
        {
            "title": "Fintech Podcast - Episode 144 - During The Next Financial Crisis - Will Bitcoin Be Noah’s Ark?",
            "datePublished": "Sun, 13 Aug 2017 19:08:23 +0000",
            "description": "Brian Roemmele & Faisal Khan are back on the air this week. With the meteoric rise in the price of bitcoin and the added fear of an economic correction that is due, we discuss the power of Bitcoin and how it can be an avenue where wealth could get parked in the next financial crisis. Whether it will happen or not, remains to be seen. Brian does dwell on the dystopian society that we might be heading towards, and when the alarm bells rings, will we find solace in the driftwood (or ark) known as Bitcoin, for a common person like you and me. Consider this, that during the financial crisis of 2008, Bitcoin was not there. How it will play out this time around, poses an interesting dilemma for both governments and the financial industry in general.\n\nSponsors:\nOtter Labs www.hireotter.com\n- Hire great and inexpensive developer with staff augmentation through Otter.\n\nRedeeem https://redeeem.click/qdza\n- Redeeem is a decentralized peer-to-peer exchange that lets you save 15% or more on gift cards using Bitcoin and other cryptocurrencies.",
            "length": "63498424",
            "sourceUrl": "http://feeds.soundcloud.com/stream/337722877-aroundthecoin-fintech-podcast-episode-144-during-the-next-financial-crisis-will-bitcoin-be-noahs-ark.mp3"
        },
        {
            "title": "Faster Payments Task Force Report with Jordan Lampe",
            "datePublished": "Thu, 10 Aug 2017 17:03:45 +0000",
            "description": "This week Faisal Khan interviews Jordan Lampe who is the Head of Strategic Projects at Dwolla. Dwolla is payments related financial services company in Des Monies, Iowa. Dwolla also is one of the members of the Federal Reserve Task Force on Faster Payments initiative. We had interviewed Jordan earlier on this (See Episode 113). Reconnecting again with Jordan, we ask him on the Faster Payment Task Force Reports that come out (two of them actually): Final Report Part One: The Faster Payments Task Force Approach & Final Report Part Two: A Call To Action. Both these reports were published in July 2017.\n\nSponsors:\nOtter Labs www.hireotter.com\n- Hire great and inexpensive developer with staff augmentation through Otter.\n\nRedeeem https://redeeem.click/qdza\n- Redeeem is a decentralized peer-to-peer exchange that lets you save 15% or more on gift cards using Bitcoin and other cryptocurrencies.",
            "length": "34532925",
            "sourceUrl": "http://feeds.soundcloud.com/stream/337314879-aroundthecoin-faster-payments-task-force-report-with-jordan-lempe.mp3"
        },
        {
            "title": "Fintech Podcast Episode 142 - Interview With Scott Robinson Of PlugAndPlay Tech Center",
            "datePublished": "Thu, 03 Aug 2017 19:00:27 +0000",
            "description": "This week, Faisal Khan interviews Scott Robinson is the founder and VP of Plug and Play FinTech, the financial technology focused startup innovation platform in partnership with BNP Paribas, Santander, Credit Suisse, Deutsche Bank, TD Bank, Sberbank, USAA, Mitsubishi, Capital One, Sumitomo, Intuit and many more global financial institutions. Listen to how a UCLA History major finds his calling and establishes one of the most successful incubator/accelerator hubs in the world, not to be left out, one of the early adopters of bitcoin/blockchain.\n\nSponsors:\nOtter Labs www.hireotter.com\n- Hire great and inexpensive developer with staff augmentation through Otter.\n\nRedeeem https://redeeem.click/qdza\n- Redeeem is a decentralized peer-to-peer exchange that lets you save 15% or more on gift cards using Bitcoin and other cryptocurrencies.",
            "length": "39669341",
            "sourceUrl": "http://feeds.soundcloud.com/stream/336131394-aroundthecoin-fintech-podcast-episode-142-interview-with-scott-robinson-of-plugandplay-tech-center.mp3"
        },
        {
            "title": "Fintech Podcast - Episode 141 - Bitcoin Classic Versus Bitcoin Cash - The Fork Ahead",
            "datePublished": "Sun, 30 Jul 2017 18:17:43 +0000",
            "description": "The duo is back on the air after a short break. This week Brian Roemmele and Faisal Khan discuss the impending hard fork for Bitcoin. The Bitcoin Classic versus Bitcoin Cash. Not many people truly understand why it is happening and what it means for the average consumer/user of bitcoins like you and me. Brian very eloquently explains the whole scenario about the fork and some of the players who are deliberately not cooperating with respect to consumer rights and BCC. Don’t support it, that is okay, but don’t tell your users, you will not give them their due BCC (Bitcoin Cash) coins post hard fork on 1st of August 2017.\n\nSponsors:\nOtter Labs www.hireotter.com\n- Hire great and inexpensive developer with staff augmentation through Otter.\n\nRedeeem https://redeeem.click/qdza\n- Redeeem is a decentralized peer-to-peer exchange that lets you save 15% or more on gift cards using Bitcoin and other cryptocurrencies.",
            "length": "54534477",
            "sourceUrl": "http://feeds.soundcloud.com/stream/335533505-aroundthecoin-fintech-podcast-episode-141-bitcoin-classic-versus-bitcoin-cash-the-fork-ahead.mp3"
        },
        {
            "title": "Fintech Podcast - Episode 140: Interview with Co-Founder of Innovate Finance, Abdul Haseeb Basit",
            "datePublished": "Fri, 28 Jul 2017 20:06:14 +0000",
            "description": "This week, Faisal Khan interviews the Co-Founder of Innovate Finance, Abdul Haseeb Basit. We discuss what Innovate Finance is all about, how they are acting as a catalyst for the UK Fintech scene and above all we hear Abdul's viewpoint on a recent article which was published in the New York Times. \n\nThe article cites that as per the numbers published by Innovate Finance, that \"Investment in UK Fintech Tops Pre-Brexit Levels in First Half of 2017\". What does this mean for UK and the fintech scene - we will get Abdul's viewpoint.\n\nSponsors:\nOtter Labs www.hireotter.com\n- Hire great and inexpensive developer with staff augmentation through Otter.\n\nRedeeem https://redeeem.click/qdza\n- Redeeem is a decentralized peer-to-peer exchange that lets you save 15% or more on gift cards using Bitcoin and other cryptocurrencies.",
            "length": "29084942",
            "sourceUrl": "http://feeds.soundcloud.com/stream/335278664-aroundthecoin-fintech-podcast-episode-140-interview-with-co-founder-of-innovate-finance-abdul-haseeb-basit.mp3"
        },
        {
            "title": "Fintech Podcast, Episode 139: Civil right to own & hold your own wealth!",
            "datePublished": "Tue, 20 Jun 2017 17:44:27 +0000",
            "description": "This week Brian Roemmele & Faisal Khan discuss the philosophical questions on the right of individuals to hold on to their own wealth. For centuries now, monetary value has been controlled by the Crown/Government. Today, with the disruption in the wealth creation, distribution, storage and payment verticals, a consensus based currency (or currencies) could very well be the de facto method of value transfer in the years forward.\n\nSponsors:\nOtter Labs www.hireotter.com\n- Hire great and inexpensive developer with staff augmentation through Otter.\n\nRedeeem https://redeeem.click/qdza\n- Redeeem is a decentralized peer-to-peer exchange that lets you save 15% or more on gift cards using Bitcoin and other cryptocurrencies.",
            "length": "63533138",
            "sourceUrl": "http://feeds.soundcloud.com/stream/329025484-aroundthecoin-fintech-podcast-episode-139-civil-right-to-own-hold-your-own-wealth.mp3"
        },
        {
            "title": "Fintech Podcast, Episode 138: Interview with Kathleen Breitman, CEO of Tezos.",
            "datePublished": "Fri, 16 Jun 2017 17:05:23 +0000",
            "description": "This week, Kathleen Breitman, CEO of Tezos was interviewed by Faisal Khan for Around The Coin. We were very grateful for Kathleen to take time out from her busy schedule and update us on what tezos is all about and its upcoming initial coin offering.\n\nSponsors:\nOtter Labs www.hireotter.com\n- Hire great and inexpensive developer with staff augmentation through Otter.\n\nRedeeem https://redeeem.click/qdza\n- Redeeem is a decentralized peer-to-peer exchange that lets you save 15% or more on gift cards using Bitcoin and other cryptocurrencies.",
            "length": "23432044",
            "sourceUrl": "http://feeds.soundcloud.com/stream/328404725-aroundthecoin-fintech-podcast-episode-138-interview-with-kathleen-breitman-ceo-of-tezos.mp3"
        },
        {
            "title": "The rise, rise and rise of Bitcoin, plus our take on the ICO storm.",
            "datePublished": "Sun, 11 Jun 2017 18:42:57 +0000",
            "description": "This week Brian Roemmele and Faisal Khan discuss the epic rise of Bitcoin. Once termed as a fad or tulip mania, it is fair to say, Bitcoin has reached critical mass and there is no way the genie can be put back into the bottle now. Brian also discusses attending Apple WWDC (World Wide Developers Conference) that happened last week. In addition, ICO or Initial Coin Offering is all the rage these days. We briefly talk about what ICOs are (in a very non-technical manner) and discuss some of the pros and cons of this new form of capital raising.\n\nSponsors:\nOtter Labs www.hireotter.com\n- Hire great and inexpensive developer with staff augmentation through Otter.\n\nRedeeem https://redeeem.click/qdza\n- Redeeem is a decentralized peer-to-peer exchange that lets you save 15% or more on gift cards using Bitcoin and other cryptocurrencies.",
            "length": "49267957",
            "sourceUrl": "http://feeds.soundcloud.com/stream/327579284-aroundthecoin-the-rise-rise-and-rise-of-bitcoin-plus-our-take-on-the-ico-storm.mp3"
        },
        {
            "title": "Fintech Podcast - Episode 136 - Coverage of ETA Conference and Amazon’s Echo!",
            "datePublished": "Sun, 21 May 2017 10:30:12 +0000",
            "description": "This week Brian, Faisal and Mike are back into the thick of things, discussing payments. Brian covers his epic attendance of the ETA conference and what he saw there. \n\nMike and Faisal discuss with Brian, the emergence of Amazon Echo and what it means for the masses, both in the developed world and in the developing world. Is Amazon Echo going to be the game changer?\n\nSponsors:\nOtter Labs www.hireotter.com\n- Hire great and inexpensive developer with staff augmentation through Otter.\n\nRedeeem https://redeeem.click/qdza\n- Redeeem is a decentralized peer-to-peer exchange that lets you save 15% or more on gift cards using Bitcoin and other cryptocurrencies.",
            "length": "38402328",
            "sourceUrl": "http://feeds.soundcloud.com/stream/323748920-aroundthecoin-fintech-podcast-episode-136-coverage-of-eta-conference-and-amazons-echo.mp3"
        },
        {
            "title": "Fintech Podcast Episode 135 Understanding Effective Altruism And Why Amazon's Echo Just Grew Eyes",
            "datePublished": "Mon, 01 May 2017 17:48:18 +0000",
            "description": "Brian and Mike back at it for an intense discussion about altruism and how people think about donating money and charity. In the first part of the conversation Brian and Mike initially discuss their favorite product of the week then spend time on Amazon's new announcement about the new Echo with a camera. Brian take a bullish stand on how new Echo will impact the fashion industry which he write more in detail here. We took a deep dive into the effective altruism - which seeks to answer the simple question: \"how can we use our resources to help others the most?\" \n\nBrian's product of the week: \nVictor Scheinman -16 year old student invents Emvi, a voice recognition system in the 1950s:  \nhttps://www.youtube.com/watch?v=sYEhE11gqGw&t=14s\n\nMike product of the week: \nA curated directory of resources & tools to help you build your Startup:\nwww.Startupstash.com: \n\n\nThis week’s special shout outs are:\n\nNathan Kontny CEO Highrise\nhttps://m.signalvnoise.com/speed-reading-2ff843053cc6 \n\nChad Grills Founder of the Mission\nhttps://medium.com/the-mission/you-wont-win-until-they-start-betting-against-you-a97a3141690e\n\nShaunta Grimes How to know what to write about.\nhttps://medium.com/startup-grind/how-to-know-what-to-write-about-bf539223ba32\n\nShow note links:\n\n- https://www.samharris.org/podcast/item/being-good-and-doing-good\n- https://www.effectivealtruism.org/\n- http://readmultiplex.com/2017/04/26/the-amazon-look-will-transform-the-closet-and-the-fashion-industry/\n- http://www.princeton.edu/~pear/\n\nSponsors:\nOtter Labs www.hireotter.com\n- Hire great and inexpensive developer with staff augmentation through Otter.\n\nRedeeem https://redeeem.click/qdza\n- Redeeem is a decentralized peer-to-peer exchange that lets you save 15% or more on gift cards using Bitcoin and other cryptocurrencies.",
            "length": "63615296",
            "sourceUrl": "http://feeds.soundcloud.com/stream/320363180-aroundthecoin-fintech-podcast-episode-135-understanding-effective-altruism-and-why-amazons-echo-just-grew-eyes.mp3"
        },
        {
            "title": "Fintech Podcast Episode 134 - MoneyGram merger, Quora's successful  raise and Neural Hooks!",
            "datePublished": "Mon, 24 Apr 2017 19:57:29 +0000",
            "description": "Sponsors:\nOtter Labs www.hireotter.com\n- Hire great and inexpensive developer with staff augmentation through Otter.\n\nRedeeem https://redeeem.click/qdza\n- Redeeem is a decentralized peer-to-peer exchange that lets you save 15% or more on gift cards using Bitcoin and other cryptocurrencies.",
            "length": "69674288",
            "sourceUrl": "http://feeds.soundcloud.com/stream/319282470-aroundthecoin-fintech-podcast-episode-134-moneygram-merger-quoras-successful-raise-and-neural-hooks.mp3"
        },
        {
            "title": "Fintech Podcast Episode 133 - Blockchain, The Dark Side of AI and Jeff Bezos Talks About Day 2",
            "datePublished": "Fri, 21 Apr 2017 14:30:50 +0000",
            "description": "Brian and Mike back on the show for another fun thought provoking discussion across many topics. We first covered Brian’s in person presentation to startup founders, investors and payment executives at Propeler VC last week. \n\nThis week’s two special shout outs are:\nJason Fiedler VC Investor @ Red Sea Ventures\nhttps://medium.com/@jasonfiedler/the-magic-of-mobile-pay-60136a886f9a\n\nBrett Caine CEO Urban Airship https://medium.com/mobile-engagement/the-question-for-mobile-payments-isnt-when-but-how-c4b45d78cc58\n\nDuring the conversation we discuss banks -  the purpose of them in the past vs the future, and how banks will or won’t survive the change on the horizon. We touch on the benefits of writing on paper vs. typing on a computer to retain information as well as whether it is appropriate to take notes on your phone during business meetings. \n\nWe next dive into blockchain in healthcare and talk about some opportunities for innovation there. A healthy portion of the conversation was spent covering the Jeff Bezos’s annual shareholder letter which was released this week. This letter was different than years past for one big reason! Lastly, we wrapped up with an always engaging debate about the power of A.I. and the incredible rate of progress. It remains to be seen how quickly A.I. will catch up to all human interaction capabilities, but recent developments are astonishing. \n\nEnjoy and let us know if you have suggestions for guests, topics or special shout outs!\n\nSponsors:\nOtter Labs www.hireotter.com\n- Hire great and inexpensive developer with staff augmentation through Otter.\n\nRedeeem https://redeeem.click/qdza\n- Redeeem is a decentralized peer-to-peer exchange that lets you save 15% or more on gift cards using Bitcoin and other cryptocurrencies.",
            "length": "66438790",
            "sourceUrl": "http://feeds.soundcloud.com/stream/318801949-aroundthecoin-fintech-podcast-episode-133-blockchain-the-dark-side-of-ai-and-jeff-bezos-talks-about-day-2.mp3"
        },
        {
            "title": "Episode 132 - Bitcoin Blockchain Breakdown with Matthew Mezinskis",
            "datePublished": "Wed, 19 Apr 2017 17:16:20 +0000",
            "description": "Guest Matthew Mezinskis dials in from Latvia where he's lived for the last 10 years working in banking, finance and payments. Matthew is the founder of Crypto Voices (https://cryptovoices.com/) a audio blog that focuses on Bitcoin, blockchain, cryptocurrency, digital ledger technology and broader FinTech, including all of the benefits and challenges that come with these breakthrough technologies.\n\nMatthew Mezinskis and Mike Townsend have a passionate conversation about the decisions facing Bitcoin that will make or break the currency. Specifically, the 1MB block limit that says Miners can mine blocks up to the 1MB fixed limit, but any block larger than 1MB is invalid. Whatever happens, this will have huge implications on Bitcoin. \n\nThe second major topic touched on was the idea of monopolies and how they affect the surrounding economy. We discussed government controlled monopolies and whether or not there is any role for a monopoly in cryptocurrency. \n\nMatthew has a inspirational story and a unique perspective living in Latvia. Enjoy!\n\nSponsors:\nOtter Labs www.hireotter.com\n- Hire great and inexpensive developer with staff augmentation through Otter.\n\nRedeeem https://redeeem.click/qdza\n- Redeeem is a decentralized peer-to-peer exchange that lets you save 15% or more on gift cards using Bitcoin and other cryptocurrencies.",
            "length": "52677902",
            "sourceUrl": "http://feeds.soundcloud.com/stream/318493420-aroundthecoin-episode132-bitcoin-blockchain-breakdown-with-matthew-mezinskis.mp3"
        },
        {
            "title": "Fintech Podcast Episode 131 - What Is Workflow And Why Did Apple Just Buy Them?",
            "datePublished": "Mon, 27 Mar 2017 20:23:34 +0000",
            "description": "Sponsors:\nOtter Labs www.hireotter.com\n- Hire great and inexpensive developer with staff augmentation through Otter.\n\nRedeeem https://redeeem.click/qdza\n- Redeeem is a decentralized peer-to-peer exchange that lets you save 15% or more on gift cards using Bitcoin and other cryptocurrencies.",
            "length": "24539636",
            "sourceUrl": "http://feeds.soundcloud.com/stream/314756016-aroundthecoin-fintech-podcast-episode-131-what-is-workflow-and-why-did-apple-just-buy-them.mp3"
        },
        {
            "title": "Episode 130 - Interview with Olivia Chow, Project Lead for Finder.com's Money Transfer Awards 2017",
            "datePublished": "Thu, 23 Mar 2017 09:26:43 +0000",
            "description": "In this edition of Around the Coin, Faisal Khan interviews Olivia Chow, the Project Lead of Finder.com's Money Transfer Award. \n\nOlivia discusses how for the first time in the remittance industry, Finder.com is presenting awards to money transfer companies. These awards are based on weeks of detailed research that Olivia and her team conducted on various online money transfer companies in the US.\n\nSponsors:\nOtter Labs www.hireotter.com\n- Hire great and inexpensive developer with staff augmentation through Otter.\n\nRedeeem https://redeeem.click/qdza\n- Redeeem is a decentralized peer-to-peer exchange that lets you save 15% or more on gift cards using Bitcoin and other cryptocurrencies.",
            "length": "20603714",
            "sourceUrl": "http://feeds.soundcloud.com/stream/314061141-aroundthecoin-episode-130-interview-with-olivia-chow-project-lead-for-findercoms-money-transfer-awards-2017.mp3"
        },
        {
            "title": "Episode 129 Interview With Luke Salinas SVP Strategy At Adyen",
            "datePublished": "Mon, 13 Mar 2017 17:08:59 +0000",
            "description": "In this edition of Around the Coin, we interview Luke Salinas, SVP Strategy for Adyen. Adyen is one of those companies, unless you're working with them not very many people know about them. This Dutch based payment processor started more than a decade ago and has become huge! Processing for the likes of Netflix, Uber, and Spotify to name a few.\n\nSponsors:\nOtter Labs www.hireotter.com\n- Hire great and inexpensive developer with staff augmentation through Otter.\n\nRedeeem https://redeeem.click/qdza\n- Redeeem is a decentralized peer-to-peer exchange that lets you save 15% or more on gift cards using Bitcoin and other cryptocurrencies.",
            "length": "37727084",
            "sourceUrl": "http://feeds.soundcloud.com/stream/312173540-aroundthecoin-episode-129-interview-with-luke-salainas-svp-strategy-at-adyen.mp3"
        },
        {
            "title": "Episode 128 Interview With Ambar Sur CEO Of Terrapay",
            "datePublished": "Mon, 13 Mar 2017 05:59:10 +0000",
            "description": "This week I got to sit down with the Founder & CEO of TerraPay, Mr. Ambar Sur. Ambar started his career in the RF design of cell sites and has now gravitated towards payment. His idea of an interoperable payments world is slowly taking shape. We ask him what TerraPay is all about, how it got started, where it is today and where it is heading.\n\nSponsors:\nOtter Labs www.hireotter.com\n- Hire great and inexpensive developer with staff augmentation through Otter.\n\nRedeeem https://redeeem.click/qdza\n- Redeeem is a decentralized peer-to-peer exchange that lets you save 15% or more on gift cards using Bitcoin and other cryptocurrencies.",
            "length": "32939780",
            "sourceUrl": "http://feeds.soundcloud.com/stream/312106013-aroundthecoin-episode-128-interview-with-ambar-sur-ceo-of-terrapay.mp3"
        },
        {
            "title": "Episode 127: Alexa Blows Up, PayPal Buys TIO Networks $233M and MoneyGram is China-owned.",
            "datePublished": "Tue, 28 Feb 2017 09:18:14 +0000",
            "description": "This week, Brian, Faisal and Mike are back on the air again. We discuss Brian's Multiplex application, Faisal's traveling and Mike changing the direction of his company. In addition we talk about Amazon Alexa hitting 10,000 skills, yet it is difficult to make an income from it. PayPal buys TIO Network and what does it mean for the unbanked? Alibaba's Ant Financial scoops up MoneyGram - what will they do with it? And TransferWise now uses Messenger Bots to transfer money!\n\nSponsors:\nOtter Labs www.hireotter.com\n- Hire great and inexpensive developer with staff augmentation through Otter.\n\nRedeeem https://redeeem.click/qdza\n- Redeeem is a decentralized peer-to-peer exchange that lets you save 15% or more on gift cards using Bitcoin and other cryptocurrencies.",
            "length": "58130598",
            "sourceUrl": "http://feeds.soundcloud.com/stream/309931702-aroundthecoin-episode-127-alexa-blows-up-paypal-buys-tio-networks-233m-and-moneygram-is-china-owned.mp3"
        },
        {
            "title": "Episode 126: Great Thinker Series: Carl Jung",
            "datePublished": "Mon, 13 Feb 2017 19:05:18 +0000",
            "description": "Sponsors:\nOtter Labs www.hireotter.com\n- Hire great and inexpensive developer with staff augmentation through Otter.\n\nRedeeem https://redeeem.click/qdza\n- Redeeem is a decentralized peer-to-peer exchange that lets you save 15% or more on gift cards using Bitcoin and other cryptocurrencies.",
            "length": "61433311",
            "sourceUrl": "http://feeds.soundcloud.com/stream/307552277-aroundthecoin-episode-126-great-thinker-series-carl-jung.mp3"
        },
        {
            "title": "Episode 125: Interview with the Oracle of Payments & Identity: David Birch",
            "datePublished": "Thu, 02 Feb 2017 12:32:32 +0000",
            "description": "In this week's episode of Around The Coin, Faisal Khan interviews the Oracle of Payments & Identity, David Birch. Dave is truly multi-talented, he is the author of \"Identity is the New Money\", which was his book that came out in 2014. He's a public speaker, world traveler, and needless to say a consultant in the payments space and works with Consult Hyperion. We discuss the importance of identity and where it is heading with respect to payments. In our pre-show discussion, David hinted about the new book he is writing so we will have him say a few words about that as well.\n\nSponsors:\nOtter Labs www.hireotter.com\n- Hire great and inexpensive developer with staff augmentation through Otter.\n\nRedeeem https://redeeem.click/qdza\n- Redeeem is a decentralized peer-to-peer exchange that lets you save 15% or more on gift cards using Bitcoin and other cryptocurrencies.",
            "length": "46441533",
            "sourceUrl": "http://feeds.soundcloud.com/stream/305747970-aroundthecoin-episode-125-interview-with-the-oracle-of-payments-identity-david-birch.mp3"
        },
        {
            "title": "Episode 124: Interview with Luis Buenaventura, author of \"Reinventing Remittances with Bitcoin\"",
            "datePublished": "Thu, 26 Jan 2017 10:21:04 +0000",
            "description": "n this episode, Faisal Khan interviews Luis Buenaventura, author of \"Reinventing Remittances with Bitcoin\". Luis is one of the early pioneers in the Bitcoin Remittance space. The concise book shares his accumulated knowledge of what he has learned about Remittances+Bitcoin. \n\nThis book collects stories about the pioneering startups who have been focusing on this exciting new space since 2013. From Nairobi to San Francisco to Manila, each new company brings us a little closer to the perfect solution: an affordable, safe, and universally accessible money transfer network unlike anything the world has ever seen.\n\nSponsors:\nOtter Labs www.hireotter.com\n- Hire great and inexpensive developer with staff augmentation through Otter.\n\nRedeeem https://redeeem.click/qdza\n- Redeeem is a decentralized peer-to-peer exchange that lets you save 15% or more on gift cards using Bitcoin and other cryptocurrencies.",
            "length": "27651823",
            "sourceUrl": "http://feeds.soundcloud.com/stream/304600556-aroundthecoin-episode-124-interview-with-luis-buenaventura-author-of-reinventing-remittances-with-bitcoin.mp3"
        },
        {
            "title": "Episode 123: The Art Of Conversation And Lessons From Ayn Rand",
            "datePublished": "Mon, 23 Jan 2017 15:42:51 +0000",
            "description": "Sponsors:\nOtter Labs www.hireotter.com\n- Hire great and inexpensive developer with staff augmentation through Otter.\n\nRedeeem https://redeeem.click/qdza\n- Redeeem is a decentralized peer-to-peer exchange that lets you save 15% or more on gift cards using Bitcoin and other cryptocurrencies.",
            "length": "55701595",
            "sourceUrl": "http://feeds.soundcloud.com/stream/304124935-aroundthecoin-episode-123-the-art-of-conversation-and-lessons-from-ayn-rand.mp3"
        },
        {
            "title": "Episode 122: Interview with Katharina Lueth, Head of Europe for Raisin.",
            "datePublished": "Sun, 22 Jan 2017 09:23:43 +0000",
            "description": "This week, Faisal Khan interviews Katharina Lueth, Head of Europe for Raisin. This interview was conducted in November 2016 at Raisin's headquarters in Berlin, Germany.\n\nRaisin's goal is to offer savers high interest rates! As the leading platform for investments throughout Europe, we give you access to exclusive offers from all over Europe - Raise your interest with Europe's #1 deposit marketplace\n\nSponsors:\nOtter Labs www.hireotter.com\n- Hire great and inexpensive developer with staff augmentation through Otter.\n\nRedeeem https://redeeem.click/qdza\n- Redeeem is a decentralized peer-to-peer exchange that lets you save 15% or more on gift cards using Bitcoin and other cryptocurrencies.",
            "length": "24609017",
            "sourceUrl": "http://feeds.soundcloud.com/stream/303940032-aroundthecoin-episode-122-interview-with-katharina-lueth-head-of-europe-for-raisin.mp3"
        },
        {
            "title": "Episode 121: How Driverless Cars Will Accelerate Our Need For Basic Income",
            "datePublished": "Mon, 16 Jan 2017 09:38:05 +0000",
            "description": "This week Mike, Faisal and Brian discuss the world where automation kills the workforce. However, before we start, a big shout out to Wikipedia that turned 16 years old today! Congratulations to Jimmy Wales, the entire team of the Wikimedia Foundation and 100,000s of contributors who donate their time and effort to make Wikipedia what it is today.\n\nAnother shout out to Tobias van Schneider who put up a really great 11 most used tools list. Whilst we generally don't do list, this one was too good to pass up. Lastly, a shout out to Amit, the Co-Founder and Chief Curator of Let's Talk Payments (LTP). Amit wrote a really great article on the Fintech Story, Hits and Misses from 2013 to 2016 and the Way Forward.\n\nIn addition to this, our main topic of the show was to understand how the world will transform when technologies like VR, Driverless Cards, Drones, Cryptocurrency/Bitcoin, Voice Recognition, AI and Robotics become mainstream. How do we as a society (as we are now) embrace this change, what will happen to the workforce that would be displaced? Will society need to offer basic income to all? Listen in and discover what we have to say!\n\nSponsors:\nOtter Labs www.hireotter.com\n- Hire great and inexpensive developer with staff augmentation through Otter.\n\nRedeeem https://redeeem.click/qdza\n- Redeeem is a decentralized peer-to-peer exchange that lets you save 15% or more on gift cards using Bitcoin and other cryptocurrencies",
            "length": "65946434",
            "sourceUrl": "http://feeds.soundcloud.com/stream/302944887-aroundthecoin-episode-121-how-driverless-cars-will-accelerate-our-need-for-basic-income.mp3"
        },
        {
            "title": "Episode 120: Interview with Grace Gong, author of \"The Last Key To Success\"",
            "datePublished": "Mon, 09 Jan 2017 16:37:35 +0000",
            "description": "This week Mike, Brian and Faisal were honored to have Grace Gong author of \"The Last Key To Success\" on our show. From China to USA, we trace her journey and how she came to the US and eventually became an author of a book, that is crowd-contributed. This book is a short guide for people in their 20’s trying to create a company in America. It includes 21 successful founders. In it, each founder covers about 2 out of the 13 topics below to share their opinions and personal experiences from when they started their own business.\n\nSponsors:\nOtter Labs www.hireotter.com\n- Hire great and inexpensive developer with staff augmentation through Otter.\n\nRedeeem https://redeeem.click/qdza\n- Redeeem is a decentralized peer-to-peer exchange that lets you save 15% or more on gift cards using Bitcoin and other cryptocurrencies.",
            "length": "27488566",
            "sourceUrl": "http://feeds.soundcloud.com/stream/301687532-aroundthecoin-episode-120-interview-with-grace-gong-author-of-the-last-key-to-success.mp3"
        },
        {
            "title": "Episode 119: A Voice First CES and How Quantum Computers May Crash Bitcoin",
            "datePublished": "Mon, 09 Jan 2017 16:03:23 +0000",
            "description": "Sponsors:\nOtter Labs www.hireotter.com\n- Hire great and inexpensive developer with staff augmentation through Otter.\n\nRedeeem https://redeeem.click/qdza\n- Redeeem is a decentralized peer-to-peer exchange that lets you save 15% or more on gift cards using Bitcoin and other cryptocurrencies.",
            "length": "46656364",
            "sourceUrl": "http://feeds.soundcloud.com/stream/301683386-aroundthecoin-episode-119-a-voice-first-ces-and-how-quantum-computers-may-crash-bitcoin.mp3"
        },
        {
            "title": "Episode 118: New Year's Edition: Our Top 5 Predictions for 2017",
            "datePublished": "Mon, 02 Jan 2017 10:12:19 +0000",
            "description": "Happy New Year. As 2017 starts it is only fair that we give our predictions as to what will happen in the payments world in 2017. Brian and Faisal give their Top 5 predictions for the year and as we go along we will see if we were on the mark or not.\n\nSponsors:\nOtter Labs www.hireotter.com\n- Hire great and inexpensive developer with staff augmentation through Otter.\n\nRedeeem https://redeeem.click/qdza\n- Redeeem is a decentralized peer-to-peer exchange that lets you save 15% or more on gift cards using Bitcoin and other cryptocurrencies.",
            "length": "52413824",
            "sourceUrl": "http://feeds.soundcloud.com/stream/300554393-aroundthecoin-new-years-edition-our-top-5-predictions-for-2017.mp3"
        },
        {
            "title": "Episode 117: The Business of Voice Assisted, Authenticated and Activated Commerce will shape up!",
            "datePublished": "Mon, 12 Dec 2016 17:30:17 +0000",
            "description": "This week Brian Roemmele discusses further the potential of Voice assisted, authenticated and activated commerce and how it will shape society (and not to mention payments). Mike Townsend and Faisal Khan chime in and give their viewpoint.\n\nSponsors:\nOtter Labs www.hireotter.com\n- Hire great and inexpensive developer with staff augmentation through Otter.\n\nRedeeem https://redeeem.click/qdza\n- Redeeem is a decentralized peer-to-peer exchange that lets you save 15% or more on gift cards using Bitcoin and other cryptocurrencies.",
            "length": "52388955",
            "sourceUrl": "http://feeds.soundcloud.com/stream/297556362-aroundthecoin-episode-117-the-business-of-voice-assisted-authenticated-and-activated-commerce-will-shape-up.mp3"
        },
        {
            "title": "Episode 116:The €500 Note, Voice Commerce and the Presidential Election.",
            "datePublished": "Sun, 11 Dec 2016 08:16:18 +0000",
            "description": "This week the three amigos discuss a wide variety of topics, from the €500 Note to voice interaction and the impeding voice commerce as well as the post US Presidential election discussion.\n\nSponsors:\nOtter Labs www.hireotter.com\n- Hire great and inexpensive developer with staff augmentation through Otter.\n\nRedeeem https://redeeem.click/qdza\n- Redeeem is a decentralized peer-to-peer exchange that lets you save 15% or more on gift cards using Bitcoin and other cryptocurrencies.",
            "length": "74153970",
            "sourceUrl": "http://feeds.soundcloud.com/stream/297353767-aroundthecoin-episode-116the-500-note-voice-commerce-and-the-presidential-election.mp3"
        },
        {
            "title": "Episode 115: How Blockchain Really Works And Why The Internet Just Crashed",
            "datePublished": "Sun, 23 Oct 2016 17:38:58 +0000",
            "description": "Brian, Mike and Faisal are back on the air. This week we discuss the economic impact of the DDoS attack that happened and how commerce was affected. Also, Faisal explains the blockchain in layman's terms and what it means for all of us. How will it impact you and I and society on the whole. Why it is being called the \"next internet\"?\n\nSponsors:\nOtter Labs www.hireotter.com\n- Hire great and inexpensive developer with staff augmentation through Otter.\n\nRedeeem https://redeeem.click/qdza\n- Redeeem is a decentralized peer-to-peer exchange that lets you save 15% or more on gift cards using Bitcoin and other cryptocurrencies.",
            "length": "65534745",
            "sourceUrl": "http://feeds.soundcloud.com/stream/289604152-aroundthecoin-episode-115-how-blockchain-really-works-and-why-the-internet-just-crashed.mp3"
        },
        {
            "title": "Episode 114: Newsflash - Samsung's acquisition of Viv - what does it mean?",
            "datePublished": "Mon, 10 Oct 2016 18:58:18 +0000",
            "description": "Maestro Brian Roemmele and Mike Townsend put on a small show. \"Newsflash\" talk about the acquisition of Viv by Samsung. What does it mean, Brian lays it out with a little back story on Siri.\n\nSponsors:\nOtter Labs www.hireotter.com\n- Hire great and inexpensive developer with staff augmentation through Otter.\n\nRedeeem https://redeeem.click/qdza\n- Redeeem is a decentralized peer-to-peer exchange that lets you save 15% or more on gift cards using Bitcoin and other cryptocurrencies.",
            "length": "22555166",
            "sourceUrl": "http://feeds.soundcloud.com/stream/287032277-aroundthecoin-episode-114-newsflash-samsungs-acquisition-of-viv-what-does-it-mean.mp3"
        },
        {
            "title": "Episode 113: Interview with Jordan Lampe of Dwolla on Same Day ACH",
            "datePublished": "Fri, 23 Sep 2016 19:56:57 +0000",
            "description": "Today, 23rd of September 2016 is a historic day in the Untied States in many ways. 40 years in the making, today marks the first day of what is being called Same Day ACH or SDA. Whilst it isn't instant settlement, it is progress nonetheless.\n\nI'm very pleased to have on our show Jordan Lampe who is the VP of Policy & Communication at Dwolla. Dwolla is payments related financial services company in Des Monies, Iowa. Dwolla also is one of the members of the Federal Reserve Task Force on Faster Payments initiative. The company already has a real-time mechanism for faster payments, aptly titled Fisync (as in Financial Sync) that enables real-time payment settlement amongst member banks.\n\nSponsors:\nOtter Labs www.hireotter.com\n- Hire great and inexpensive developer with staff augmentation through Otter.\n\nRedeeem https://redeeem.click/qdza\n- Redeeem is a decentralized peer-to-peer exchange that lets you save 15% or more on gift cards using Bitcoin and other cryptocurrencies.",
            "length": "25008168",
            "sourceUrl": "http://feeds.soundcloud.com/stream/284335196-aroundthecoin-episode-113-interview-with-jordan-lempe-of-dwolla-on-same-day-ach.mp3"
        },
        {
            "title": "Episode 112: Interview with Jack Langworthy, Founder & CEO of Ninayo",
            "datePublished": "Fri, 23 Sep 2016 19:27:53 +0000",
            "description": "Mike interviews Jack Langworthy, Founder & CEO of Ninayo. NINAYO.com is an online trading platform targeting emerging markets, launched in Tanzania in May, 2015, and now has over 3500 users. Founder, Jack Langworthy, was in the Peace Core for years in Tanzania and during his time there he became passionate about solving problems that plague the farming industry. \n\nIn a country of 50 Million people (slightly larger than California), there are about 10 Million family farms, and 40% of all the food they produce ends up rotting because of a terribly inefficient system of buying and selling. All this while 30% of the population in the country struggles with malnutrition. Jack tells us about his journey to solve it all! \n \nIf you find yourself inspired by this story, please share it and help spread the word.\n\nSponsors:\nOtter Labs www.hireotter.com\n- Hire great and inexpensive developer with staff augmentation through Otter.\n\nRedeeem https://redeeem.click/qdza\n- Redeeem is a decentralized peer-to-peer exchange that lets you save 15% or more on gift cards using Bitcoin and other cryptocurrencies.",
            "length": "32937690",
            "sourceUrl": "http://feeds.soundcloud.com/stream/284331239-aroundthecoin-episode-112-interview-with-jack-langworthy-founder-ceo-of-ninayo.mp3"
        },
        {
            "title": "Episode 111: New & Ideas around Apple + Developing strategies for your Career path",
            "datePublished": "Tue, 20 Sep 2016 06:42:42 +0000",
            "description": "This week Mike and Brian warm up with news and ideas around Apple. Then we dive in talking about our experiences with developing strategies for your career path. We referred to Bret Victor's \"Invent on Principal\" as well as Freeman Dyson's work as a physicist and his quote: \"We are but atoms analyzing other atoms\".\n\nSponsors:\nOtter Labs www.hireotter.com\n- Hire great and inexpensive developer with staff augmentation through Otter.\n\nRedeeem https://redeeem.click/qdza\n- Redeeem is a decentralized peer-to-peer exchange that lets you save 15% or more on gift cards using Bitcoin and other cryptocurrencies.",
            "length": "72186983",
            "sourceUrl": "http://feeds.soundcloud.com/stream/283742081-aroundthecoin-episode-111-new-ideas-around-apple-developing-strategies-for-your-career-path.mp3"
        },
        {
            "title": "Episode 110: Apple's iPhone 7 (and 8) + Information Organization Hacks.",
            "datePublished": "Mon, 12 Sep 2016 19:08:16 +0000",
            "description": "This week, after a break of two weeks, Brian, Mike and Faisal are back on air. This week we discuss the important of iPhone 7 and what would iPhone 8 be made of (Brian's prophesy!). In addition, in this day and age of information overload, how do you manage your online & offline content? We discuss how each one of us manages their information in our daily lives.\n\nSponsors:\nOtter Labs www.hireotter.com\n- Hire great and inexpensive developer with staff augmentation through Otter.\n\nRedeeem https://redeeem.click/qdza\n- Redeeem is a decentralized peer-to-peer exchange that lets you save 15% or more on gift cards using Bitcoin and other cryptocurrencies.",
            "length": "52057651",
            "sourceUrl": "http://feeds.soundcloud.com/stream/282596815-aroundthecoin-episode-110-apples-iphone-7-and-8-information-organization-hacks.mp3"
        },
        {
            "title": "Episode 109: Challenge The Given Narrative",
            "datePublished": "Mon, 15 Aug 2016 11:54:22 +0000",
            "description": "This week Brian, Faisal and Mike discuss challenging the given narratives. We start with the rising cost of healthcare and lead the conversation towards training your mind to break assumptions and discover new truths.\n\nSponsors:\nOtter Labs www.hireotter.com\n- Hire great and inexpensive developer with staff augmentation through Otter.\n\nRedeeem https://redeeem.click/qdza\n- Redeeem is a decentralized peer-to-peer exchange that lets you save 15% or more on gift cards using Bitcoin and other cryptocurrencies.",
            "length": "72321984",
            "sourceUrl": "http://feeds.soundcloud.com/stream/278336922-aroundthecoin-episode-109-challenge-the-given-narrative.mp3"
        },
        {
            "title": "Episode 108:  The Goal Of Education: Philosophy",
            "datePublished": "Sun, 07 Aug 2016 11:26:44 +0000",
            "description": "This week, Mike Townsend, Brian Roemmele and Faisal Khan get back on air with another show debating the \"The Goal of Education: Philosophy\". Why there is a difference in being educated and education in general. How the love of wisdom comes into play. Also in the show are updates on Quip's acquisition, Yahoo! and Revel being acquired by IBM.\n\nSponsors:\nOtter Labs www.hireotter.com\n- Hire great and inexpensive developer with staff augmentation through Otter.\n\nRedeeem https://redeeem.click/qdza\n- Redeeem is a decentralized peer-to-peer exchange that lets you save 15% or more on gift cards using Bitcoin and other cryptocurrencies.",
            "length": "61309177",
            "sourceUrl": "http://feeds.soundcloud.com/stream/277199545-aroundthecoin-episode-108-the-goal-of-education-philosophy.mp3"
        },
        {
            "title": "Episode 107: Business At The Speed of Pokémon",
            "datePublished": "Sun, 24 Jul 2016 21:07:34 +0000",
            "description": "The phenomenal rise and rise of Pokémon Go has taken the world by a storm, despite being launched in only a handful of countries. This week Brian Roemmele and Faisal Khan discuss how we've entered a new age of what we are calling \"Pokemon Speed\". How will businesses large and small take advantage of this? How will the incumbents turn their boats to face in the same direction where Pokémon Go is heading? \n\nWe discuss how it is imperative to see (literally) what is going on, and this can best be done by a tired and tested theory of Empirical Praxis - by observation! Getting out of the comfort zone and divorcing oneself from the company they work for, go out and see how the trends and patters are taking shape.\n\nIn this new era, there is no standing still, for business is done at Pokémon Speed.\n\nSponsors:\nOtter Labs www.hireotter.com\n- Hire great and inexpensive developer with staff augmentation through Otter.\n\nRedeeem https://redeeem.click/qdza\n- Redeeem is a decentralized peer-to-peer exchange that lets you save 15% or more on gift cards using Bitcoin and other cryptocurrencies.",
            "length": "66867617",
            "sourceUrl": "http://feeds.soundcloud.com/stream/275183105-aroundthecoin-episode-107-business-at-the-speed-of-pokemon.mp3"
        },
        {
            "title": "Episode 106: Interview with Sean Safahi, CEO of Bold",
            "datePublished": "Tue, 19 Jul 2016 11:50:35 +0000",
            "description": "This week joining us is Sean Safahi, who is the CEO of Bold. Bold is a  SF payments company and to explain what they do, etc. we have Sean on the mic this week.\n\nSponsors:\nOtter Labs www.hireotter.com\n- Hire great and inexpensive developer with staff augmentation through Otter.\n\nRedeeem https://redeeem.click/qdza\n- Redeeem is a decentralized peer-to-peer exchange that lets you save 15% or more on gift cards using Bitcoin and other cryptocurrencies.",
            "length": "20399458",
            "sourceUrl": "http://feeds.soundcloud.com/stream/274370436-aroundthecoin-episode-106-interview-with-sean-safahi-ceo-of-bold.mp3"
        },
        {
            "title": "Episode 105: Pokémon GO",
            "datePublished": "Tue, 19 Jul 2016 11:17:22 +0000",
            "description": "This week, Brian and Mike talk about Pokémon GO, and the never before seen impact it's had on small businesses by actually putting feet inside of storefronts. We discuss how Brian acted fast to write a booklet which has sold thousands of copies in the first week! It's important to look at every change in the world as opportunity, not a threat and the rapid growth of Pokemon is no exception, many people are fearful at the impact it may have, others capitalize on it... the choice is up to you.\n\nSponsors:\nOtter Labs www.hireotter.com\n- Hire great and inexpensive developer with staff augmentation through Otter.\n\nRedeeem https://redeeem.click/qdza\n- Redeeem is a decentralized peer-to-peer exchange that lets you save 15% or more on gift cards using Bitcoin and other cryptocurrencies.",
            "length": "48926301",
            "sourceUrl": "http://feeds.soundcloud.com/stream/274367558-aroundthecoin-episode-105-pokemon-go.mp3"
        },
        {
            "title": "Episode 104: Interview with George Harrap, CEO of Bitspark",
            "datePublished": "Fri, 08 Jul 2016 09:03:44 +0000",
            "description": "This week joining us all the way from Hong Kong is George Harrap. George is the CEO of Bitspark, a remittance/money transfer company that specializes in building an alliance network of money transfer agents all the while using Bitcoin as its settlement mechanism at the back end.\n\nSponsors:\nOtter Labs www.hireotter.com\n- Hire great and inexpensive developer with staff augmentation through Otter.\n\nRedeeem https://redeeem.click/qdza\n- Redeeem is a decentralized peer-to-peer exchange that lets you save 15% or more on gift cards using Bitcoin and other cryptocurrencies.",
            "length": "48153494",
            "sourceUrl": "http://feeds.soundcloud.com/stream/272715751-aroundthecoin-episode-104-interview-with-george-harrap-ceo-of-bitspark.mp3"
        },
        {
            "title": "Episode 103: Interview with Suneera Madhani, Founder/CEO of Fattmerchant",
            "datePublished": "Tue, 05 Jul 2016 17:40:47 +0000",
            "description": "About Fattmerchant:\nFattmerchant is a subscription-based merchant service provider offering unlimited payment processing at direct cost for a flat monthly membership and no contract. Suneera Madhani, CEO of Fattmerchant, founded the company in 2014 after working in the credit card processing industry for four years, wanting to create and sell a product that was transparent and provided value to the everyday business owner. Fattmerchant offers credit card processing for every business type, without adding mark-ups or other fees, and providing free equipment, no contract and no ancillary fees.\n \nWant to learn more about Fattmerchant: https://www.fattmerchant.com/\n\nSponsors:\nOtter Labs www.hireotter.com\n- Hire great and inexpensive developer with staff augmentation through Otter.\n\nRedeeem https://redeeem.click/qdza\n- Redeeem is a decentralized peer-to-peer exchange that lets you save 15% or more on gift cards using Bitcoin and other cryptocurrencies.",
            "length": "32518477",
            "sourceUrl": "http://feeds.soundcloud.com/stream/272309949-aroundthecoin-episode-103-interview-with-suneera-madhani-founderceo-of-fattmerchant.mp3"
        },
        {
            "title": "Episode 102 - An Empathetic Perspective - Paypal, Bitcoin, and Brexit",
            "datePublished": "Mon, 04 Jul 2016 04:26:52 +0000",
            "description": "This week, Brian, Mike & Faisal talk about the rise and rise of Bitcoin and try to make some sense out of it all. PayPal being a target of an acquisition has been a market rumor for a long time, we discuss that, as well as what Brexit means for all of us.\n\nSponsors:\nOtter Labs www.hireotter.com\n- Hire great and inexpensive developer with staff augmentation through Otter.\n\nRedeeem https://redeeem.click/qdza\n- Redeeem is a decentralized peer-to-peer exchange that lets you save 15% or more on gift cards using Bitcoin and other cryptocurrencies.",
            "length": "65982379",
            "sourceUrl": "http://feeds.soundcloud.com/stream/272076267-aroundthecoin-episode-102-an-empathetic-perspective-paypal-bitcoin-and-brexit.mp3"
        },
        {
            "title": "Episode 101: The insider’s take on what WWDC means for us all",
            "datePublished": "Sun, 19 Jun 2016 19:52:58 +0000",
            "description": "This week, Brian, Faisal and Mike get back on air and discuss a myriad of topics. First up was Faisal's city-hopping tour and what he learned about the Remittance (Money Transfer) world. \n\nBrian dives into the latest WWDC (World Wide Developers Conference) that Apple recently hosted and what it means for all of us.\n\nLastly, Mike and Brian briefly give their thoughts on Microsoft's $26 Billion acquisition of LinkedIn. \n\nSponsors:\nOtter Labs www.hireotter.com\n- Hire great and inexpensive developer with staff augmentation through Otter.\n\nRedeeem https://redeeem.click/qdza\n- Redeeem is a decentralized peer-to-peer exchange that lets you save 15% or more on gift cards using Bitcoin and other cryptocurrencies.",
            "length": "61865063",
            "sourceUrl": "http://feeds.soundcloud.com/stream/269917251-aroundthecoin-episode-101-the-insiders-take-on-what-wwdc-means-for-us-all.mp3"
        },
        {
            "title": "Episode 100 - Voice First Revolution - Breaking It Down With Mary Meeker",
            "datePublished": "Wed, 08 Jun 2016 16:44:46 +0000",
            "description": "Brian and Mike discuss the industrial strength report as published by Mary Meeker of Kleiner, Perkins, Caufield and Byers and the 2016 Internet Trends report she publishes every year. Brian breaks down the report on the various aspects of Voice First Revolution.\n\nSponsors:\nOtter Labs www.hireotter.com\n- Hire great and inexpensive developer with staff augmentation through Otter.\n\nRedeeem https://redeeem.click/qdza\n- Redeeem is a decentralized peer-to-peer exchange that lets you save 15% or more on gift cards using Bitcoin and other cryptocurrencies.",
            "length": "63212146",
            "sourceUrl": "http://feeds.soundcloud.com/stream/268157313-aroundthecoin-episode-100-voice-first-revolution-breaking-it-down-with-mark-meeker.mp3"
        },
        {
            "title": "Episode 99 - There Is A Revolution Ahead And It Has A Voice",
            "datePublished": "Wed, 08 Jun 2016 16:37:30 +0000",
            "description": "Today Brian and Mike discussed the news of Viv Labs launching publicly and the representative revolution in AI this represents. \n\nThe core of the discussion stems from the ideas of exformation (information subconsciously filtered out to give you a seamless perception of reality) originally presented in our interview of Tor Nørretranders. We use these building blocks and the history of basic human communication and technological progress to draw predictions on the future of how tech will creep up on us and change our everyday lives. \n\nSponsors:\nOtter Labs www.hireotter.com\n- Hire great and inexpensive developer with staff augmentation through Otter.\n\nRedeeem https://redeeem.click/qdza\n- Redeeem is a decentralized peer-to-peer exchange that lets you save 15% or more on gift cards using Bitcoin and other cryptocurrencies.",
            "length": "66813700",
            "sourceUrl": "http://feeds.soundcloud.com/stream/268156358-aroundthecoin-episode-99-there-is-a-revolution-ahead-and-it-has-a-voice.mp3"
        },
        {
            "title": "Episode 98: The Serendipity of Conferences",
            "datePublished": "Wed, 04 May 2016 11:23:42 +0000",
            "description": "This week Mike Townsend, Brian Roemmele and Faisal Khan discuss Conferences. How to attend them, plan for them? What to look out for and above all, the serendipity factor of conferences.\n\nSponsors:\nOtter Labs www.hireotter.com\n- Hire great and inexpensive developer with staff augmentation through Otter.\n\nRedeeem https://redeeem.click/qdza\n- Redeeem is a decentralized peer-to-peer exchange that lets you save 15% or more on gift cards using Bitcoin and other cryptocurrencies.",
            "length": "52491492",
            "sourceUrl": "http://feeds.soundcloud.com/stream/262440970-aroundthecoin-episode-98-serendipity-of-conferences.mp3"
        },
        {
            "title": "Episode 97: Money2020 Europe, ETA & TechStars",
            "datePublished": "Wed, 27 Apr 2016 10:10:58 +0000",
            "description": "This week the three payment nerds Brian, Faisal and Mike are back at it again. Faisal discusses the recent Money2020 Europe Conference that was held in Copenhagen for the very first time. Brian discusses his coverage of the TRANSACT show by ETA (Electronic Transaction Association) and Mike tells us all about how HomeHero is enrolled in TechStars with Cedars Sinai Hospital.\n\nSponsors:\nOtter Labs www.hireotter.com\n- Hire great and inexpensive developer with staff augmentation through Otter.\n\nRedeeem https://redeeem.click/qdza\n- Redeeem is a decentralized peer-to-peer exchange that lets you save 15% or more on gift cards using Bitcoin and other cryptocurrencies.",
            "length": "45616482",
            "sourceUrl": "http://feeds.soundcloud.com/stream/261130574-aroundthecoin-episode-97-money2020-europe-eta-techstars.mp3"
        },
        {
            "title": "Episode 96: Alexa/Raspberry Pi, Apple CareKit and Mobile Wallets!",
            "datePublished": "Mon, 28 Mar 2016 04:13:43 +0000",
            "description": "This week the three amigos Brian, Faisal and Mike are back at it again. Brian discuss Amazon's Echo and the new Echo equivalent that one can build with Raspberry Pi. Mike explains the benefits and the potential of Apple's CareKit and Faisal discusses mobile wallets and small value transfer, why we need to reexamine the whole ecosystem. \n\nSponsors:\nOtter Labs www.hireotter.com\n- Hire great and inexpensive developer with staff augmentation through Otter.\n\nRedeeem https://redeeem.click/qdza\n- Redeeem is a decentralized peer-to-peer exchange that lets you save 15% or more on gift cards using Bitcoin and other cryptocurrencies.",
            "length": "46319489",
            "sourceUrl": "http://feeds.soundcloud.com/stream/255519318-aroundthecoin-episode-96-alexa-apple-carekit-and-mobile-wallets.mp3"
        },
        {
            "title": "Episode 95: Voice Recognition - How it will replace APIs",
            "datePublished": "Thu, 24 Mar 2016 20:19:07 +0000",
            "description": "This week Mike Townsend and Faisal Khan dive deep into what Brian Roemmele affectionately calls Ontological Recipes - How Voice Recognition will replace APIs, mega shift in payments and interaction.\n\nSponsors:\nOtter Labs www.hireotter.com\n- Hire great and inexpensive developer with staff augmentation through Otter.\n\nRedeeem https://redeeem.click/qdza\n- Redeeem is a decentralized peer-to-peer exchange that lets you save 15% or more on gift cards using Bitcoin and other cryptocurrencies.",
            "length": "67534679",
            "sourceUrl": "http://feeds.soundcloud.com/stream/254868398-aroundthecoin-episode-95-voice-recognition-how-it-will-replace-apis.mp3"
        },
        {
            "title": "Episode 94: Interview Jon Carder MOGL CEO",
            "datePublished": "Wed, 16 Mar 2016 16:43:20 +0000",
            "description": "This week Mike interviews the CEO of MOGL.com - Jon Carder: Jon Carder is an experienced entrepreneur who has founded five internet businesses, his first at the age of 19. In college Jon founded eHeaven.com, an online e-commerce superstore that was purchased by BabyUniverse in 2002. Jon Carder then founded Client Shop inc. a website dedicated to finding consumers the lowest rates on home loans. ClientShop was San Diego's fastest growing company in 2005 (San Diego Business Journal) and was sold to Internet Brands in 2006. After a short “retirement” he realized building companies beats is more fulfilling than being retired and started his next venture, MojoPages.com, an online local search engine which received $5M (series A) from Austin Ventures and operates out of La Jolla, CA. Most recently Jon is founder and CEO of Mogl.com - a frictionless online to offline rewards program & Empyr.com - an online to offline ad platform. Mogl/Empyr has raised $35M in funding and has a partnership with Visa, Mastercard and Amex to effortlessly track any purchase from an enrolled consumer at a participating offline merchant in under 1 minute.\n\nSponsors:\nOtter Labs www.hireotter.com\n- Hire great and inexpensive developer with staff augmentation through Otter.\n\nRedeeem https://redeeem.click/qdza\n- Redeeem is a decentralized peer-to-peer exchange that lets you save 15% or more on gift cards using Bitcoin and other cryptocurrencies.",
            "length": "32331231",
            "sourceUrl": "http://feeds.soundcloud.com/stream/252181213-aroundthecoin-episode-94-interview-jon-carder-mogl-ceo.mp3"
        },
        {
            "title": "Episode 93 - Where is the future of Voice Recognition and AI",
            "datePublished": "Wed, 16 Mar 2016 16:20:43 +0000",
            "description": "This week Brian and Mike discuss where is the future of voice recognition and artificial intelligence.\n\nSponsors:\nOtter Labs www.hireotter.com\n- Hire great and inexpensive developer with staff augmentation through Otter.\n\nRedeeem https://redeeem.click/qdza\n- Redeeem is a decentralized peer-to-peer exchange that lets you save 15% or more on gift cards using Bitcoin and other cryptocurrencies.",
            "length": "41448175",
            "sourceUrl": "http://feeds.soundcloud.com/stream/252177720-aroundthecoin-episode-93-where-is-the-future-of-voice-recognition-and-ai.mp3"
        },
        {
            "title": "Episode 92: Robots, Conferences, Undocumented, Currency Notes & the Historic Value of Money",
            "datePublished": "Sun, 28 Feb 2016 19:27:12 +0000",
            "description": "This week, Brian, Faisal and Mike discuss the coming of age of Robots & AI and what it means for us. We touch upon the various conferences we will be attending, covering and speaking in. The undocumented work, couple that with the recent news of the eliminating the US $100 Bill, what does all this mean. What has history taught us about value transfer and control. \n\nSponsors:\nOtter Labs www.hireotter.com\n- Hire great and inexpensive developer with staff augmentation through Otter.\n\nRedeeem https://redeeem.click/qdza\n- Redeeem is a decentralized peer-to-peer exchange that lets you save 15% or more on gift cards using Bitcoin and other cryptocurrencies.",
            "length": "67974372",
            "sourceUrl": "http://feeds.soundcloud.com/stream/249352638-aroundthecoin-episode-92-robots-conferences-undocumented-currency-notes-the-historic-value-of-money.mp3"
        },
        {
            "title": "Episode 91: Interview with Drew Sievers",
            "datePublished": "Fri, 26 Feb 2016 08:34:00 +0000",
            "description": "Drew Sievers is one of North America's foremost innovators in mobile financial services.\n\nAs mFoundry’s Co-Founder & CEO, Drew helped build the mBanking industry, establishing mFoundry as the industry leader with more than 900 clients. mFoundry also developed North America’s largest mPayment solution, Starbucks Card Mobile. Drew sold mFoundry to FIS for $165MM.\n\nDrew was also the President of iAgency powerhouse Semaphore Partners, which was acquired in 2002.\n\nDrew spent 5 years in Japan as Regional Director for Saatchi & Saatchi, and co-founded Saatchi & Saatchi Interactive.\n\nDrew advises and sits on the boards of Spendgo, mScripts, and Fortumo.\n\nSponsors:\nOtter Labs www.hireotter.com\n- Hire great and inexpensive developer with staff augmentation through Otter.\n\nRedeeem https://redeeem.click/qdza\n- Redeeem is a decentralized peer-to-peer exchange that lets you save 15% or more on gift cards using Bitcoin and other cryptocurrencies.",
            "length": "33473096",
            "sourceUrl": "http://feeds.soundcloud.com/stream/248980284-aroundthecoin-episode-91-interview-with-drew-sievers.mp3"
        },
        {
            "title": "Episode 90: All You Need Is Love.",
            "datePublished": "Fri, 26 Feb 2016 06:53:34 +0000",
            "description": "All You Need Is Love - A deep dive into decisions of government security, freedom and our responsibility as a society.\n\nSponsors:\nOtter Labs www.hireotter.com\n- Hire great and inexpensive developer with staff augmentation through Otter.\n\nRedeeem https://redeeem.click/qdza\n- Redeeem is a decentralized peer-to-peer exchange that lets you save 15% or more on gift cards using Bitcoin and other cryptocurrencies.",
            "length": "65663894",
            "sourceUrl": "http://feeds.soundcloud.com/stream/248973066-aroundthecoin-episode-90-all-you-need-is-love.mp3"
        },
        {
            "title": "Episode 89: The Winter of Discontent",
            "datePublished": "Sun, 17 Jan 2016 21:01:06 +0000",
            "description": "This week Brian, Faisal and Mike discuss what we term as the Winter of Discontent. With falling oil prices, Bitcoin being termed as a failed experiment, stock plummeting, oil prices below $30, Yellow cab company in SF filing for bankruptcy, colleagues thinking about abandoning tuition? what does this mean for our economy? Listen and find out.\n\nSponsors:\nOtter Labs www.hireotter.com\n- Hire great and inexpensive developer with staff augmentation through Otter.\n\nRedeeem https://redeeem.click/qdza\n- Redeeem is a decentralized peer-to-peer exchange that lets you save 15% or more on gift cards using Bitcoin and other cryptocurrencies.",
            "length": "63430738",
            "sourceUrl": "http://feeds.soundcloud.com/stream/242449646-aroundthecoin-episode-89-the-winter-of-discontent.mp3"
        },
        {
            "title": "Episode 88: The Sherpa's Guide to a Payments Startup",
            "datePublished": "Mon, 11 Jan 2016 13:21:48 +0000",
            "description": "This week Brain Roemmele and Faisal Khan discuss what would it take for those with an idea about a payments startup in the US market to take their dream forward. Dispensing some practical advice on how to go from and idea to product launched in your target market.\n\nSponsors:\nOtter Labs www.hireotter.com\n- Hire great and inexpensive developer with staff augmentation through Otter.\n\nRedeeem https://redeeem.click/qdza\n- Redeeem is a decentralized peer-to-peer exchange that lets you save 15% or more on gift cards using Bitcoin and other cryptocurrencies.",
            "length": "67197804",
            "sourceUrl": "http://feeds.soundcloud.com/stream/241419428-aroundthecoin-episode-88-the-sherpas-guide-to-a-payments-startup.mp3"
        },
        {
            "title": "Episode 87: Interview with Tor Nørretranders",
            "datePublished": "Sat, 09 Jan 2016 08:20:40 +0000",
            "description": "Interview with Tor Norretranders:\n\nNew book: Light! On light in life and the life in light \nLife in the early 80’s working in Danish broadcasting television\nInspiration for User Illusion - on being a 11 year old goalkeeper \nCovering Exformation \nTough decisions on driverless cars\nIs Singularity a reality, and when?\nBenjamin Libet - ½ second delay, and when are we aware of a decision \nWhat is the future of science in consciousness?\nClosing message to listeners\n\nRelevant links:\nUser Illusion by Tor Norretranders, 1991 \nLight! On light in life and the life in light by Tor Norretranders, 2015\nA bandwidth for humans by Nigel Holmes\n\nSponsors:\nOtter Labs www.hireotter.com\n- Hire great and inexpensive developer with staff augmentation through Otter.\n\nRedeeem https://redeeem.click/qdza\n- Redeeem is a decentralized peer-to-peer exchange that lets you save 15% or more on gift cards using Bitcoin and other cryptocurrencies.",
            "length": "64362787",
            "sourceUrl": "http://feeds.soundcloud.com/stream/241095394-aroundthecoin-episode-87-interview-with-tor-norretranders.mp3"
        },
        {
            "title": "Episode 86: The Goldilocks Year for Payments",
            "datePublished": "Sun, 03 Jan 2016 21:36:30 +0000",
            "description": "Happy New Year. As 2016 starts, Brian & Faisal debate if \"this\" is the year for payments! Both agree that 2016 is the Goldilocks Year, where conditions will be just right for fintech and payment projects to take off. \n\nSponsors:\nOtter Labs www.hireotter.com\n- Hire great and inexpensive developer with staff augmentation through Otter.\n\nRedeeem https://redeeem.click/qdza\n- Redeeem is a decentralized peer-to-peer exchange that lets you save 15% or more on gift cards using Bitcoin and other cryptocurrencies.",
            "length": "58705292",
            "sourceUrl": "http://feeds.soundcloud.com/stream/240254817-aroundthecoin-episode-86-the-goldilocks-year-for-payments.mp3"
        },
        {
            "title": "Episode 85: Around The Coin Podcast",
            "datePublished": "Sun, 20 Dec 2015 20:13:58 +0000",
            "description": "Facebook+Uber+Braintree, what are they up to? Apple Pay and Samsung enter China partner China Union Pay, Target's rumored new Wallet App using NFC, Global Payments acquires Heartland Payment systems, Pinterest Buyable pins now come with price tracking, plus new segments in our show!\n\nSponsors:\nOtter Labs www.hireotter.com\n- Hire great and inexpensive developer with staff augmentation through Otter.\n\nRedeeem https://redeeem.click/qdza\n- Redeeem is a decentralized peer-to-peer exchange that lets you save 15% or more on gift cards using Bitcoin and other cryptocurrencies.",
            "length": "49137788",
            "sourceUrl": "http://feeds.soundcloud.com/stream/238414585-aroundthecoin-episode-85-around-the-coin-podcast.mp3"
        },
        {
            "title": "Brian's solo music, Walmart Pay, Oil dropping the bass and Satoshi!",
            "datePublished": "Mon, 14 Dec 2015 12:18:35 +0000",
            "description": "This week we talk about Walmart and its recently announced product: Walmart Pay, Faisal discusses the repercussions of low oil prices and then Brian and Mike discuss on the potential of Satoshi Nakamoto being unmasked and what it means for us.\n\nSponsors:\nOtter Labs www.hireotter.com\n- Hire great and inexpensive developer with staff augmentation through Otter.\n\nRedeeem https://redeeem.click/qdza\n- Redeeem is a decentralized peer-to-peer exchange that lets you save 15% or more on gift cards using Bitcoin and other cryptocurrencies.",
            "length": "52126196",
            "sourceUrl": "http://feeds.soundcloud.com/stream/237489949-aroundthecoin-brians-solo-music-walmart-pay-oil-dropping-the-bass-and-satoshi.mp3"
        },
        {
            "title": "Potpourri Edition: From Summit at Sea to AliBaba and everything in-between.",
            "datePublished": "Sun, 22 Nov 2015 20:37:40 +0000",
            "description": "This week, Brian, Faisal and Mike discuss a wide variety of topics, and in between these, we talk about Apple Car, Edward Snowden, Strangulation by Regulation, Wall Street pressure, Jack Ma of Alibaba to Jack Mama! \n\nSummit at Sea\nSquare IPO\nBarclays fined again\nMartha Stewart moves to Amazon’s Handmade platform\nAmazon first physical store\nMost US consumers plan to go to Amazon.com for their online holiday shopping, rather than going to malls and shops, finding parking, weathering  the cold days and testing their patience\nApple to partner (acquire?) Postmates\nSamsung Pay is coming to budget phones. The Korean mobile phone maker says it will be offering Samsung Pay on both its mid and low end handsets.\nSilicon Valley Bank survey shows 43% think regulatory red tape is main hurdle to growth in fintech growth,\nIn an interesting development, a UK government report cites that “digital currencies pose lowest money laundering risk”\nChina’s Alibaba Singles Day Sale: $14.3 Billion in 24 hours. Up 60% from last year’s record: $ 9.3 Billion.\n\nSponsors:\nOtter Labs www.hireotter.com\n- Hire great and inexpensive developer with staff augmentation through Otter.\n\nRedeeem https://redeeem.click/qdza\n- Redeeem is a decentralized peer-to-peer exchange that lets you save 15% or more on gift cards using Bitcoin and other cryptocurrencies.",
            "length": "59819153",
            "sourceUrl": "http://feeds.soundcloud.com/stream/234243097-aroundthecoin-potpourri-edition-from-summit-at-sea-to-alibaba-and-everything-in-between.mp3"
        },
        {
            "title": "Episode 82: 1st November 2015",
            "datePublished": "Sun, 01 Nov 2015 19:16:39 +0000",
            "description": "This week, Brian, Faisal and Mike discuss Brian’s meet-up with Dave Birch, Brian’s new project called PayFinders, an Apple app for Apple Pay, we discuss the Amazon Prime Now lawsuit, Independent Contractors, China’s reversal of its One-Child per family policy, China vs India and Bitcoin volume/value, Ledgerless value transfers.\n\nSponsors:\nOtter Labs www.hireotter.com\n- Hire great and inexpensive developer with staff augmentation through Otter.\n\nRedeeem https://redeeem.click/qdza\n- Redeeem is a decentralized peer-to-peer exchange that lets you save 15% or more on gift cards using Bitcoin and other cryptocurrencies.",
            "length": "55557641",
            "sourceUrl": "http://feeds.soundcloud.com/stream/231093193-aroundthecoin-episode-82-1st-november-2015.mp3"
        },
        {
            "title": "From Square S1 to ApplePay, to Microsoft Wallet to Bitcoin to Identifying Business Opportunities",
            "datePublished": "Sun, 25 Oct 2015 19:12:02 +0000",
            "description": "Square S1 thoughts\nOne Women takes Square for millions- Rookie mistake takes 2 years to discover- solitary seller represented nearly 23% of Square’s transaction and advance losses for the first half of 2015 http://www.buzzfeed.com/nitashatiku/square-fraud-losses-single-seller\nApple Pay turned 1 year\nMicrosoft wallet (http://www.pymnts.com/news/2015/microsoft-takes-another-look-at-mobile-payments/) \nIdentifying Business Opportunities - is there a pattern to identify these ideas?\nHow 3 guys created Blue Apron, a $2 billion recipe-delivery business with 2,500 employees, in 36 months - Blue Apron (http://www.businessinsider.com/blue-apron-founder-story-sai-100-2015-10) \nSlack $2.8B http://www.marketplace.org/topics/tech/slacks-breakneck-growth\nPinterest valuation: http://www.pymnts.com/news/2015/pinterests-payments-push-documents-leaked/\nBitcoin pricing\nWhat 2016 Holds for Bitcoin Businesses (October 18, 2015, coindesk.com)\nEU Rules Bitcoin Is a Currency, Not a Commodity — Virtually (Oct 22, 2015, wsj.com)\nSweden first country cashless (http://cointelegraph.com/news/115452/sweden-to-become-worlds-first-cashless-country) \n\n\nSponsors:\nOtter Labs www.hireotter.com\n- Hire great and inexpensive developer with staff augmentation through Otter.\n\nRedeeem https://redeeem.click/qdza\n- Redeeem is a decentralized peer-to-peer exchange that lets you save 15% or more on gift cards using Bitcoin and other cryptocurrencies.",
            "length": "59495652",
            "sourceUrl": "http://feeds.soundcloud.com/stream/230041078-aroundthecoin-from-square-s1-to-applepay-to-microsoft-wallet-to-bitcoin-to-identifying-business-opportunities.mp3"
        },
        {
            "title": "Apple Pay & Starbucks + Lyft & Stripe instant payout.",
            "datePublished": "Mon, 12 Oct 2015 16:22:25 +0000",
            "description": "Apple Pay & Starbucks + Lyft & Stripe instant payout.\nHead of Apple Pay Jennifer Bailey Shares How Apple is Winning Local\n\nJennifer Bailey - retail experience expert and head of apple pay discloses that Apple is using the existing merchant sales people, 370,00 in the US to distribute and educate the merchants across the country. Also we discussed the impact of immediate payouts for marketplace companies. \n\n\nSponsors:\nOtter Labs www.hireotter.com\n- Hire great and inexpensive developer with staff augmentation through Otter.\n\nRedeeem https://redeeem.click/qdza\n- Redeeem is a decentralized peer-to-peer exchange that lets you save 15% or more on gift cards using Bitcoin and other cryptocurrencies.",
            "length": "31135032",
            "sourceUrl": "http://feeds.soundcloud.com/stream/228069106-aroundthecoin-apple-pay-starbucks-lyft-stripe-instant-payout.mp3"
        },
        {
            "title": "Interview with Peter Ohser EVP Business Development for MoneyGram",
            "datePublished": "Tue, 06 Oct 2015 17:56:20 +0000",
            "description": "Episode 79: In this special episode Mike & Faisal interview Peter Ohser, EVP (Business Development) for MoneyGram, one of the large incumbents in the money transfer space. \n\nSponsors:\nOtter Labs www.hireotter.com\n- Hire great and inexpensive developer with staff augmentation through Otter.\n\nRedeeem https://redeeem.click/qdza\n- Redeeem is a decentralized peer-to-peer exchange that lets you save 15% or more on gift cards using Bitcoin and other cryptocurrencies.",
            "length": "40334732",
            "sourceUrl": "http://feeds.soundcloud.com/stream/227198334-aroundthecoin-interview-with-peter-ohser-evp-business-development-for-moneygram.mp3"
        },
        {
            "title": "Trump & T-Mobile Hacks, EMV in America, Poor Bitcoin, to Psychology of Marketplaces",
            "datePublished": "Sun, 04 Oct 2015 19:49:55 +0000",
            "description": "This week we discuss: \nTrump Hotels & T-Mobile Hacks, \nEMV in America and what it means for us\nBen Milne’s Blog article on Blockchain\nPoor Bitcoin - has it lost its luster\nUnderstanding the Psychology of Marketplaces\n\nSponsors:\nOtter Labs www.hireotter.com\n- Hire great and inexpensive developer with staff augmentation through Otter.\n\nRedeeem https://redeeem.click/qdza\n- Redeeem is a decentralized peer-to-peer exchange that lets you save 15% or more on gift cards using Bitcoin and other cryptocurrencies.",
            "length": "61244394",
            "sourceUrl": "http://feeds.soundcloud.com/stream/226900789-aroundthecoin-trump-t-mobile-hacks-emv-in-america-poor-bitcoin-to-psychology-of-marketplaces.mp3"
        },
        {
            "title": "Braintree, Macy's, Paypal and would you believe it - the Kardashians!",
            "datePublished": "Sun, 20 Sep 2015 18:23:38 +0000",
            "description": "This week we discuss a host of newsworthy items, from Braintree's recent announcement of the volume they are doing (US$ 50 Billion) and the 154 Million cards on file. We also briefly touch on the voice biometrics for authorizing payments. Stripe's launch of relay to make mobile shopping easier, and believe it or not - The Kardashians! (how they were hacked as soon as they came out with an app). Brian talks briefly on how it important it is to secure user data (card &/or person), and compares it to Apple Pay and how it secures it vault. Faisal talks about the repercussions if the same were to happen to the 154 Million cards on file with Braintree, and in the end Mike talks about the psychological effects of hacking. \n\nWe also discuss how Macy's now offers PayPal to its customers online, in-store and on the mobile. Brian talks about how Android Pay will grow and how every bank will eventually jump on board. It may not be as accelerated or glamorous as Apple Pay, but it will make its mark. \n\nFinally, towards the end, Mike's take on Clover Health (a data driven health insurance startup) that raised US$ 100 Million and his perspective as to what this means for the startups in the healthcare and health-insurance arena.\n\nSponsors:\nOtter Labs www.hireotter.com\n- Hire great and inexpensive developer with staff augmentation through Otter.\n\nRedeeem https://redeeem.click/qdza\n- Redeeem is a decentralized peer-to-peer exchange that lets you save 15% or more on gift cards using Bitcoin and other cryptocurrencies.",
            "length": "51759228",
            "sourceUrl": "http://feeds.soundcloud.com/stream/224761244-aroundthecoin-braintree-macys-paypal-and-would-you-believe-it-the-kardashians.mp3"
        },
        {
            "title": "Mobile Payments in Africa, Remittance in Dubai and Apple's TV + Apple Pay",
            "datePublished": "Sun, 06 Sep 2015 18:24:00 +0000",
            "description": "This week Brian and Faisal discuss the Faisal's recent travels to Africa to discover and learn about mobile payments in Africa, part of the financial inclusion discovery tour.\nFaisal discusses the mobile payments landscape in Tanzania and how mobile payments are being used by all facets of society. In addition Faisal also discusses his recent trip to the labor camps in Dubai and how migrant workers are sending remittances back home, along with a surprise discovery when it comes to smartphones.\n\nBrian delves deep into Apple's September 9th (2015) event and what it has in store for us. In particular Brian elaborates on his Quora post about how Apple TV + Siri + Apple TV Apps + ApplePay might just be a reality for us all. How Apple is taking the bringing the big screen back and how our lives will change with the anticipated Apple TV launch. Brian hints at what he thinks will be Apple's strategy with respect to how we interact and do commerce with our TV and Apple devices, using Siri and ApplePay.\n\nSponsors:\nOtter Labs www.hireotter.com\n- Hire great and inexpensive developer with staff augmentation through Otter.\n\nRedeeem https://redeeem.click/qdza\n- Redeeem is a decentralized peer-to-peer exchange that lets you save 15% or more on gift cards using Bitcoin and other cryptocurrencies.",
            "length": "65668074",
            "sourceUrl": "http://feeds.soundcloud.com/stream/222636160-aroundthecoin-mobile-payments-in-africa-remittance-in-dubai-and-apples-tv-apple-pay.mp3"
        },
        {
            "title": "Episode 75: PayAnywhere & Apple Deal, and How 1099 vs. W-2 Works in Service Based Marketplaces",
            "datePublished": "Thu, 03 Sep 2015 19:26:15 +0000",
            "description": "This week Brian and Mike cruise through recent news, giving insight to the recent PayAnywhere & Apple exclusive partnership, breaking down what it takes to get a successful partnership with Apple. We chat about the international world of payments in Kenya’s recent partnership with PayPal and end discussing the changing landscape of 1099 independent contractor models vs W-2 employee model and what the implications are in today’s world. \n\nSponsors:\nOtter Labs www.hireotter.com\n- Hire great and inexpensive developer with staff augmentation through Otter.\n\nRedeeem https://redeeem.click/qdza\n- Redeeem is a decentralized peer-to-peer exchange that lets you save 15% or more on gift cards using Bitcoin and other cryptocurrencies.",
            "length": "46164008",
            "sourceUrl": "http://feeds.soundcloud.com/stream/222219103-aroundthecoin-episode-75-payanywhere-apple-deal-and-how-1099-vs-w-2-works-in-service-based-marketplaces.mp3"
        },
        {
            "title": "Interview with Gadi Ruchin, Founder and VP Sales at OGY Docs.",
            "datePublished": "Fri, 21 Aug 2015 22:20:08 +0000",
            "description": "Today Mike Townsend and guest host Zachary Damato interviewed Gadi Ruchin, Founder and VP Sales at OGY Docs. \n\nSponsors:\nOtter Labs www.hireotter.com\n- Hire great and inexpensive developer with staff augmentation through Otter.\n\nRedeeem https://redeeem.click/qdza\n- Redeeem is a decentralized peer-to-peer exchange that lets you save 15% or more on gift cards using Bitcoin and other cryptocurrencies.",
            "length": "17333184",
            "sourceUrl": "http://feeds.soundcloud.com/stream/220315484-aroundthecoin-interview-with-gadi-ruchin-founder-and-vp-sales-at-ogy-docs.mp3"
        },
        {
            "title": "Interview with Jonathan Levin, Co-founder & Chief Revenue Officer at Chainanlysis",
            "datePublished": "Fri, 21 Aug 2015 20:17:03 +0000",
            "description": "Today we had Mike Townsend and guest host Zachary Damato interviewing Jonathan Levin, Co-founder and Chief Revenue Officer at Chainanlysis out of the TechStars office in NYC.\n\nSponsors:\nOtter Labs www.hireotter.com\n- Hire great and inexpensive developer with staff augmentation through Otter.\n\nRedeeem https://redeeem.click/qdza\n- Redeeem is a decentralized peer-to-peer exchange that lets you save 15% or more on gift cards using Bitcoin and other cryptocurrencies.",
            "length": "22839796",
            "sourceUrl": "http://feeds.soundcloud.com/stream/220300273-aroundthecoin-interview-with-jonathan-levin-co-founder-chief-revenue-officer-at-chainanlysis.mp3"
        },
        {
            "title": "Potpourri of players in the payments space, what will happen?",
            "datePublished": "Sun, 16 Aug 2015 17:59:27 +0000",
            "description": "This week Brian and Faisal discuss the landscape of payments, reflecting back on 1.5 years of Around The Coin podcast and discuss what's going to happen in the payments space for months to come. Who will die out, who will shine and who will be the big surprise. \n\nSponsors:\nOtter Labs www.hireotter.com\n- Hire great and inexpensive developer with staff augmentation through Otter.\n\nRedeeem https://redeeem.click/qdza\n- Redeeem is a decentralized peer-to-peer exchange that lets you save 15% or more on gift cards using Bitcoin and other cryptocurrencies.",
            "length": "61411577",
            "sourceUrl": "http://feeds.soundcloud.com/stream/219516160-aroundthecoin-potpourri-of-players-in-the-payments-space-what-will-happen.mp3"
        },
        {
            "title": "Interview with Laurent Oberholzer & Francois Briod, Co-Founders  of Tawipay",
            "datePublished": "Thu, 13 Aug 2015 15:07:52 +0000",
            "description": "In this episode of Around The Coin, Faisal Khan interviews  Laurent Oberholzer & Francois Briod, Co-Founders  of Tawipay, startup based out of Switzerland, that specializes in Remittance (Money Transfer) comparison. ",
            "length": "47097729",
            "sourceUrl": "http://feeds.soundcloud.com/stream/219073129-aroundthecoin-interview-with-laurent-oberholzer-francois-briod-co-founders-of-tawipay.mp3"
        },
        {
            "title": "Interview with Ralph Dangelmaier, CEO of BlueSnap",
            "datePublished": "Thu, 13 Aug 2015 14:44:53 +0000",
            "description": "This week on Around The Coin, we had the great privilege to interview, Ralph Dangelmaier, CEO of BlueSnap.  \n\nSponsors:\nOtter Labs www.hireotter.com\n- Hire great and inexpensive developer with staff augmentation through Otter.\n\nRedeeem https://redeeem.click/qdza\n- Redeeem is a decentralized peer-to-peer exchange that lets you save 15% or more on gift cards using Bitcoin and other cryptocurrencies.",
            "length": "26204128",
            "sourceUrl": "http://feeds.soundcloud.com/stream/219070188-aroundthecoin-interview-with-ralph-dangelmaier-ceo-of-bluesnap.mp3"
        },
        {
            "title": "Interview with Les Riedl, CEO of GlobeOne",
            "datePublished": "Sun, 02 Aug 2015 10:58:30 +0000",
            "description": "Mike, Brian and Faisal interview Les Riedl, CEO of GlobeOne and their ambitious plan to sign up 50 Million customers by 2020.\n\nSponsors:\nOtter Labs www.hireotter.com\n- Hire great and inexpensive developer with staff augmentation through Otter.\n\nRedeeem https://redeeem.click/qdza\n- Redeeem is a decentralized peer-to-peer exchange that lets you save 15% or more on gift cards using Bitcoin and other cryptocurrencies.",
            "length": "55593526",
            "sourceUrl": "http://feeds.soundcloud.com/stream/217438467-aroundthecoin-interview-with-les-riedl-ceo-of-globeone.mp3"
        },
        {
            "title": "Mike Townsend visits NY and drops in at Techstars Accelerator Program",
            "datePublished": "Sat, 01 Aug 2015 20:00:40 +0000",
            "description": "While visiting New York, Mike Townsend drops in at the Techstar / 2015 Barclays Accelerator. Mike meets up with Tommy Nicholas (Alloy), Jonathan Levin (Chainanalysis), Gadi Ruschin (Ogydocs), Rachel Cook (Seeds) and Jenny Fielding of Techstars.\n\nSponsors:\nOtter Labs www.hireotter.com\n- Hire great and inexpensive developer with staff augmentation through Otter.\n\nRedeeem https://redeeem.click/qdza\n- Redeeem is a decentralized peer-to-peer exchange that lets you save 15% or more on gift cards using Bitcoin and other cryptocurrencies.",
            "length": "62311326",
            "sourceUrl": "http://feeds.soundcloud.com/stream/217367467-aroundthecoin-mike-townsend-visits-ny-and-drops-in-at-techstars-accelerator-program.mp3"
        },
        {
            "title": "HomeHero raises $20 Million, PayPal's acquisition of Xoom & what this means for Facebook and Ebay",
            "datePublished": "Sat, 01 Aug 2015 19:45:06 +0000",
            "description": "This week we discuss Mike Townsend (our co-host), who raised US$ 20+ Million in venture capital funding for his Senior Care Startup called HomeHero.\n\nCongrats Mike!\n\nBrian gives his perspective on the separation of Ebay and Paypal. PayPal's acquisition of Xoom and how we would be seeing the new roaring PayPal and more Brian's prediction that more acquisitions would be coming PayPal's way. We also discuss Facebook's Messenger which went live nationwide in the US. We discuss the possibility of Cisco entering into the payments business and towards the end we briefly discuss Ebay and what it would be doing in the days to come.\n\nSponsors:\nOtter Labs www.hireotter.com\n- Hire great and inexpensive developer with staff augmentation through Otter.\n\nRedeeem https://redeeem.click/qdza\n- Redeeem is a decentralized peer-to-peer exchange that lets you save 15% or more on gift cards using Bitcoin and other cryptocurrencies.",
            "length": "48611610",
            "sourceUrl": "http://feeds.soundcloud.com/stream/217365733-aroundthecoin-homehero-raises-us-20-million-paypals-acquisition-of-xoom-and-what-this-means-for-facebook-and-ebay.mp3"
        },
        {
            "title": "Apple Pay, Android Pay, Dwolla, Free Payments and where banking is heading in general",
            "datePublished": "Sat, 01 Aug 2015 18:59:17 +0000",
            "description": "In this episode of Around The Coin, Brian and Faisal talk about Apple Pay and the recently introduced Android Pay. We also talk about Dwolla's free payments and would payments eventually become free? Also, we touch upon how such ecosystems are changing banking, slowly changing financial services. \n\nSponsors:\nOtter Labs www.hireotter.com\n- Hire great and inexpensive developer with staff augmentation through Otter.\n\nRedeeem https://redeeem.click/qdza\n- Redeeem is a decentralized peer-to-peer exchange that lets you save 15% or more on gift cards using Bitcoin and other cryptocurrencies.",
            "length": "60802904",
            "sourceUrl": "http://feeds.soundcloud.com/stream/217360783-aroundthecoin-apple-pay-android-pay-dwolla-free-payments-and-where-banking-is-heading-in-general.mp3"
        },
        {
            "title": "Interview with Nicolas Merterns CEO of Sign2Pay",
            "datePublished": "Sat, 01 Aug 2015 17:14:59 +0000",
            "description": "Interview with Nicolas Mertens, CEO of Sign2Pay (www.sign2pay.com). Interview conducted by Faisal Khan\n\nSponsors:\nOtter Labs www.hireotter.com\n- Hire great and inexpensive developer with staff augmentation through Otter.\n\nRedeeem https://redeeem.click/qdza\n- Redeeem is a decentralized peer-to-peer exchange that lets you save 15% or more on gift cards using Bitcoin and other cryptocurrencies.",
            "length": "44102216",
            "sourceUrl": "http://feeds.soundcloud.com/stream/217349065-aroundthecoin-interview-with-nicolas-merterns-ceo-of-sign2pay.mp3"
        },
        {
            "title": "Constatine Firun And VoisiCard",
            "datePublished": "Mon, 08 Jun 2015 15:54:50 +0000",
            "description": "Sponsors:\nOtter Labs www.hireotter.com\n- Hire great and inexpensive developer with staff augmentation through Otter.\n\nRedeeem https://redeeem.click/qdza\n- Redeeem is a decentralized peer-to-peer exchange that lets you save 15% or more on gift cards using Bitcoin and other cryptocurrencies.",
            "length": "45239748",
            "sourceUrl": "http://feeds.soundcloud.com/stream/208810126-aroundthecoin-constatine-firun-and-voisicard.mp3"
        },
        {
            "title": "Bitcoin Startup 21 Raises US$ 116 Million, NASDAQ + Blockchain and Money Transmitter Licenses",
            "datePublished": "Mon, 08 Jun 2015 15:15:14 +0000",
            "description": "Sponsors:\nOtter Labs www.hireotter.com\n- Hire great and inexpensive developer with staff augmentation through Otter.\n\nRedeeem https://redeeem.click/qdza\n- Redeeem is a decentralized peer-to-peer exchange that lets you save 15% or more on gift cards using Bitcoin and other cryptocurrencies.",
            "length": "43236897",
            "sourceUrl": "http://feeds.soundcloud.com/stream/208809954-aroundthecoin-bitcoin-startup-21-raises116-million-nasdaq-blockchain-money-transmitter-licenses.mp3"
        },
        {
            "title": "While Clinkle Collapses, Affirm Raises 75M And LearnVest 250M Acquisition",
            "datePublished": "Mon, 08 Jun 2015 15:12:11 +0000",
            "description": "Sponsors:\nOtter Labs www.hireotter.com\n- Hire great and inexpensive developer with staff augmentation through Otter.\n\nRedeeem https://redeeem.click/qdza\n- Redeeem is a decentralized peer-to-peer exchange that lets you save 15% or more on gift cards using Bitcoin and other cryptocurrencies.",
            "length": "61482315",
            "sourceUrl": "http://feeds.soundcloud.com/stream/208809717-aroundthecoin-while-clinkle-collapses-affirm-raises-75m-and-learnvest-250m-acquisition.mp3"
        },
        {
            "title": "Zing.co Acquired By BigCommerce, CEO Nate Stewart Shares The Story",
            "datePublished": "Mon, 08 Jun 2015 15:07:07 +0000",
            "description": "Sponsors:\nOtter Labs www.hireotter.com\n- Hire great and inexpensive developer with staff augmentation through Otter.\n\nRedeeem https://redeeem.click/qdza\n- Redeeem is a decentralized peer-to-peer exchange that lets you save 15% or more on gift cards using Bitcoin and other cryptocurrencies.",
            "length": "30406224",
            "sourceUrl": "http://feeds.soundcloud.com/stream/208808212-aroundthecoin-zingco-acquired-by-bigcommerce-ceo-nate-stewart-shares-the-story.mp3"
        },
        {
            "title": "Bitcoin Tech Vs Wallstreet - A Love Hate Story. Tesla And Circle Make Moves.",
            "datePublished": "Sun, 17 May 2015 23:48:59 +0000",
            "description": "We covered a few topics this week in a passionate debate about the future of payments and technology in our world.\n\n1. Tesla’s new $3,000 Powerwall \n2. Circle raises $50M\n3. Bitcoin battles Credit Unions\n4. Western Union 'Exploring' Pilot Program With Ripple Labs\n\nSponsors:\nOtter Labs www.hireotter.com\n- Hire great and inexpensive developer with staff augmentation through Otter.\n\nRedeeem https://redeeem.click/qdza\n- Redeeem is a decentralized peer-to-peer exchange that lets you save 15% or more on gift cards using Bitcoin and other cryptocurrencies.",
            "length": "62527748",
            "sourceUrl": "http://feeds.soundcloud.com/stream/205961136-aroundthecoin-bitcoin-tech-vs-wallstreet-a-love-hate-story-tesla-and-circle-make-moves.mp3"
        },
        {
            "title": "Founding Partner of Commerce Ventures Dan Rosen Gives Investment Insights",
            "datePublished": "Wed, 29 Apr 2015 05:30:54 +0000",
            "description": "We had Dan Rosen, long time Venture Capalist on the show this week to share his investment thesis and what sectors of the payment industry are hot right now as well as insights into trends.\n\nSponsors:\nOtter Labs www.hireotter.com\n- Hire great and inexpensive developer with staff augmentation through Otter.\n\nRedeeem https://redeeem.click/qdza\n- Redeeem is a decentralized peer-to-peer exchange that lets you save 15% or more on gift cards using Bitcoin and other cryptocurrencies.",
            "length": "57768944",
            "sourceUrl": "http://feeds.soundcloud.com/stream/203069364-aroundthecoin-founding-partner-of-commerce-ventures-dan-rosen-gives-investment-insights.mp3"
        },
        {
            "title": "The Inspirational Story of the Digital Finance Institute with Christine Duhaime and Sam Maule",
            "datePublished": "Wed, 29 Apr 2015 04:37:52 +0000",
            "description": "This week we had Christine Duhaime and Sam Maule of Digital Finance Institute join us on the show with an incredibly inspiring story of how they grew this non-profit organization into a world-changing endeavor through the lens of payments.\n\nSponsors:\nOtter Labs www.hireotter.com\n- Hire great and inexpensive developer with staff augmentation through Otter.\n\nRedeeem https://redeeem.click/qdza\n- Redeeem is a decentralized peer-to-peer exchange that lets you save 15% or more on gift cards using Bitcoin and other cryptocurrencies.",
            "length": "46582085",
            "sourceUrl": "http://feeds.soundcloud.com/stream/203065177-aroundthecoin-the-inspirational-story-of-the-digital-finance-institute-with-christine-duhaime-and-sam-maule.mp3"
        },
        {
            "title": "Story of Charlie Shrem Going to Jail and how new SEC Crowdfunding Law Changes the Game",
            "datePublished": "Fri, 10 Apr 2015 23:09:55 +0000",
            "description": "This week Brian shared his experience of joining Brett King on podcast Breaking Banks. While Brians podcast focused on Apply pay, we learned of an incredible story of Charlie Shrem, a payment technology entrepreneur who is going to jail because of a retroactive law that outlawed specific transactions from years ago. \n\nIn the second part of the podcast we discussed the recent change in SEC raising the limit to $50 million that can be raised by private companies. \n\nSponsors:\nOtter Labs www.hireotter.com\n- Hire great and inexpensive developer with staff augmentation through Otter.\n\nRedeeem https://redeeem.click/qdza\n- Redeeem is a decentralized peer-to-peer exchange that lets you save 15% or more on gift cards using Bitcoin and other cryptocurrencies.",
            "length": "66285335",
            "sourceUrl": "http://feeds.soundcloud.com/stream/200239015-aroundthecoin-story-of-charlie-shrem-going-to-jail-and-how-new-sec-crowdfunding-law-changes-the-game.mp3"
        },
        {
            "title": "Facebook Payments and a Brief History of Social Payments",
            "datePublished": "Fri, 10 Apr 2015 22:58:14 +0000",
            "description": "This week Brian and Faisal dove deep into social payments, with an in-depth history of the social payment landscape that puts a fascinating perspective on predictions for how social payments will turn out.\n\nSponsors:\nOtter Labs www.hireotter.com\n- Hire great and inexpensive developer with staff augmentation through Otter.\n\nRedeeem https://redeeem.click/qdza\n- Redeeem is a decentralized peer-to-peer exchange that lets you save 15% or more on gift cards using Bitcoin and other cryptocurrencies.",
            "length": "76802075",
            "sourceUrl": "http://feeds.soundcloud.com/stream/200237666-aroundthecoin-facebook-payments-and-a-brief-history-of-social-payments.mp3"
        },
        {
            "title": "Where Does Apple Watch Go From Here? Square Order, Balanced Both Shutdown",
            "datePublished": "Wed, 25 Mar 2015 18:11:02 +0000",
            "description": "Sponsors:\nOtter Labs www.hireotter.com\n- Hire great and inexpensive developer with staff augmentation through Otter.\n\nRedeeem https://redeeem.click/qdza\n- Redeeem is a decentralized peer-to-peer exchange that lets you save 15% or more on gift cards using Bitcoin and other cryptocurrencies.",
            "length": "65251175",
            "sourceUrl": "http://feeds.soundcloud.com/stream/197647862-aroundthecoin-where-does-apple-watch-go-from-here-square-order-balanced-both-shutdown.mp3"
        },
        {
            "title": "The Hidden Backstory to the PayPal and Samsung Acquisition",
            "datePublished": "Thu, 19 Mar 2015 19:34:37 +0000",
            "description": "This week we talk about the recent acquisitions by PayPal and Samsung with perspectives on future strategies of these companies and shining light into the complex and fascinating world of payments.\n\nSponsors:\nOtter Labs www.hireotter.com\n- Hire great and inexpensive developer with staff augmentation through Otter.\n\nRedeeem https://redeeem.click/qdza\n- Redeeem is a decentralized peer-to-peer exchange that lets you save 15% or more on gift cards using Bitcoin and other cryptocurrencies.",
            "length": "63974321",
            "sourceUrl": "http://feeds.soundcloud.com/stream/196161878-aroundthecoin-hidden-backstory-to-the-paypal-and-samsung-acquisition.mp3"
        },
        {
            "title": "Secret Apple watch data Released & How Marketplaces pay their workers",
            "datePublished": "Fri, 06 Mar 2015 17:43:34 +0000",
            "description": "This week Brian, with his inside connections at Apple, described what it was like to wear the Apple Watch for a full day and naturally we all made predictions about future impact of the watch and other wearables.  We then touched on Google acquiring Softcard, and lastly we talked about how Marketplace companies (Uber, HomeHero, Instacart etc) handle payments to workers and some of the recent legal changes to 1099 workers that have had a huge effect.\n\nSponsors:\nOtter Labs www.hireotter.com\n- Hire great and inexpensive developer with staff augmentation through Otter.\n\nRedeeem https://redeeem.click/qdza\n- Redeeem is a decentralized peer-to-peer exchange that lets you save 15% or more on gift cards using Bitcoin and other cryptocurrencies.",
            "length": "53500532",
            "sourceUrl": "http://feeds.soundcloud.com/stream/194561409-aroundthecoin-secret-apple-watch-data-released-how-marketplaces-pay-their-workers.mp3"
        },
        {
            "title": "Periodic Table of Payments & Samsung's Attack on Apple Pay",
            "datePublished": "Sun, 01 Mar 2015 23:30:52 +0000",
            "description": "Around the Coin podcast\n\nWe make this podcast out of passion. If you enjoy listening, please make a donation of Bitcoin. If we ever make more than we spend, we will donate it to charity.\n\nOur Bitcoin Address: 1LQZF3yYSSHi5qturYCXuuoRf2cSzRwRE\n\nEpisode 52\n\nThis week we covered a bunch of topics listed below:\n\nFaisals periodic table study \nFederal portal opens Dwolla\n Samsung Acquires Loop to compete with Apple Pay\n1 year review: Facebook + Whatsapp\nStripe's incorporation of Bitcoin\n\nOur speakers in this week's episode:\nBrian Roemmele\nFaisal Khan\nMike Townsend\n\nResources:\nMind Map of Money\nMonetary Velocity & John Exter’s Inverse Pyramid\nFinextra news: Federal payments portal opens up to digital wallets from PayPal and Dwolla\nMaking Transactions with the Government More Secure\nWhat’s Up with WhatsApp And Payments?\nSamsung acquires Apple Pay competitor LoopPay\nFour Numbers That Explain Why Facebook Acquired...\nMonetary Velocity & John Exter’s Inverse Pyramid",
            "length": "64260800",
            "sourceUrl": "http://feeds.soundcloud.com/stream/193744820-aroundthecoin-periodic-table-of-payments-samsungs-attack-on-apple-pay.mp3"
        },
        {
            "title": "Apply Pay wins over Fed Govt & philosophical debate on future of weath",
            "datePublished": "Wed, 18 Feb 2015 01:32:11 +0000",
            "description": "This week was a collection of various topics ranging from Apple Pay's acceptance in the eyes of the Federal Government to Pinterest launching the \"Buy Now\" button. We ended with an interesting philosophical discussion on the evolution of money as well as potential social effects with recent wealth consolidation trends.\n\nSponsors:\nOtter Labs www.hireotter.com\n- Hire great and inexpensive developer with staff augmentation through Otter.\n\nRedeeem https://redeeem.click/qdza\n- Redeeem is a decentralized peer-to-peer exchange that lets you save 15% or more on gift cards using Bitcoin and other cryptocurrencies.",
            "length": "63238316",
            "sourceUrl": "http://feeds.soundcloud.com/stream/191688192-aroundthecoin-apply-pay-wins-over-fed-govt-philosophical-debate-on-future-of-weath.mp3"
        },
        {
            "title": "How Button is Connecting the World of Mobile Commerce Apps",
            "datePublished": "Fri, 13 Feb 2015 22:45:18 +0000",
            "description": "Mike Dudas is Chief Revenue Officer and Co-Founder of Button which just raised $12M in Jan 2015. Previously he was Head of Mobile BD at Venmo/Braintree which was acquired by PayPal for $800 million in 2013. Before that he ran business development at Google Wallet. We talked with Mike about his path into payments, specifically what it was like at Google Wallet, Venmo, PayPal and now how he and his team are poised to change the world of mobile commerce as we know it.\n\nSponsors:\nOtter Labs www.hireotter.com\n- Hire great and inexpensive developer with staff augmentation through Otter.\n\nRedeeem https://redeeem.click/qdza\n- Redeeem is a decentralized peer-to-peer exchange that lets you save 15% or more on gift cards using Bitcoin and other cryptocurrencies.",
            "length": "59737880",
            "sourceUrl": "http://feeds.soundcloud.com/stream/191011053-aroundthecoin-how-button-is-connecting-payments.mp3"
        },
        {
            "title": "The On-Demand Marketplace Economy",
            "datePublished": "Thu, 05 Feb 2015 04:30:11 +0000",
            "description": "This week we (of course) had to chat about Apple's record breaking Q1 earnings report, which was the biggest Q1 income of any company, ever. Mike chats about his trip to Australia and New Zealand undergoing top secret research, aka visiting his brother. The big topic this week was really online marketplaces. We addressed Stripes partnership with Intuit to provide tools for on-demand workers, how the battle of 1099 independent contractors vs. W-2 employees is going and some important aspects about growing a marketplace company.\n\nSponsors:\nOtter Labs www.hireotter.com\n- Hire great and inexpensive developer with staff augmentation through Otter.\n\nRedeeem https://redeeem.click/qdza\n- Redeeem is a decentralized peer-to-peer exchange that lets you save 15% or more on gift cards using Bitcoin and other cryptocurrencies.\n\nSponsors:\nOtter Labs www.hireotter.com\n- Hire great and inexpensive developer with staff augmentation through Otter.\n\nRedeeem https://redeeem.click/qdza\n- Redeeem is a decentralized peer-to-peer exchange that lets you save 15% or more on gift cards using Bitcoin and other cryptocurrencies.",
            "length": "79701301",
            "sourceUrl": "http://feeds.soundcloud.com/stream/189564970-aroundthecoin-the-on-demand-marketplace-economy.mp3"
        },
        {
            "title": "Apple Watch, 2015 Fundraising, and Immigration Reform",
            "datePublished": "Thu, 05 Feb 2015 03:54:23 +0000",
            "description": "This week Brian discussed news of the Apple Watch, the current state of cryto mining and some secrets for making money on mining in the future. Mike discussed what investments VC's are looking for in 2015 and collectively we all gave our opinions toward the end of the show on the effect of immigration to the U.S. particularly with technologists. \n\nSponsors:\nOtter Labs www.hireotter.com\n- Hire great and inexpensive developer with staff augmentation through Otter.\n\nRedeeem https://redeeem.click/qdza\n- Redeeem is a decentralized peer-to-peer exchange that lets you save 15% or more on gift cards using Bitcoin and other cryptocurrencies.",
            "length": "74337847",
            "sourceUrl": "http://feeds.soundcloud.com/stream/189561095-aroundthecoin-apple-watch-2015-fundraising-and-immigration-reform.mp3"
        },
        {
            "title": "Sony Hack, BTC Regulation, and More...",
            "datePublished": "Thu, 05 Feb 2015 03:29:48 +0000",
            "description": "This week we discussed the implications of the biggest cyber attack in history on Sony and what the future might hold. Faisal enlightens us about the recent Bitcoin regulations, both positive and negative, and how they affect Bitcoin related startups as well as the financial industry as a whole. Lastly we touch on Facebook payments a bit of the magic of Apply Pay.\n\nSponsors:\nOtter Labs www.hireotter.com\n- Hire great and inexpensive developer with staff augmentation through Otter.\n\nRedeeem https://redeeem.click/qdza\n- Redeeem is a decentralized peer-to-peer exchange that lets you save 15% or more on gift cards using Bitcoin and other cryptocurrencies.",
            "length": "68284675",
            "sourceUrl": "http://feeds.soundcloud.com/stream/189558377-aroundthecoin-sony-hack-btc-regulation-and-more.mp3"
        },
        {
            "title": "Total Recap of 2014 Part 2",
            "datePublished": "Tue, 30 Dec 2014 07:16:04 +0000",
            "description": "This week we recapped every episode of the past year and updated you on the current status of each topic. We often make predictions and in this episode we took a step back and recapped how we did, surprisingly it wasn't too bad!\n\nSponsors:\nOtter Labs www.hireotter.com\n- Hire great and inexpensive developer with staff augmentation through Otter.\n\nRedeeem https://redeeem.click/qdza\n- Redeeem is a decentralized peer-to-peer exchange that lets you save 15% or more on gift cards using Bitcoin and other cryptocurrencies.",
            "length": "121094932",
            "sourceUrl": "http://feeds.soundcloud.com/stream/183705112-aroundthecoin-total-recap-of-2014-part-2.m4a"
        },
        {
            "title": "Total Recap of 2014 Part 1",
            "datePublished": "Tue, 30 Dec 2014 06:58:41 +0000",
            "description": "This week we recapped every episode of the past year and updated you on the current status of each topic. We often make predictions and in this episode we took a step back and recapped how we did, surprisingly it wasn't too bad!\n\nSponsors:\nOtter Labs www.hireotter.com\n- Hire great and inexpensive developer with staff augmentation through Otter.\n\nRedeeem https://redeeem.click/qdza\n- Redeeem is a decentralized peer-to-peer exchange that lets you save 15% or more on gift cards using Bitcoin and other cryptocurrencies.",
            "length": "46624444",
            "sourceUrl": "http://feeds.soundcloud.com/stream/183703857-aroundthecoin-total-recap-of-2014-part-1.mp3"
        },
        {
            "title": "The Snapcash Game Changer and how M-Pesa is Crushing it in Africa.",
            "datePublished": "Sat, 06 Dec 2014 05:27:34 +0000",
            "description": "Take away thoughts from Mobile Money & Digital - Faisal\n8th Mobile Money and Digital Conference \nOver 300 attendees\nBehavioral changes more important than ever\n\nM-Pesa Stats\nAcceptance, closed loop, equally share client base\n65,000 merchants - M-Pesa in Kenya\n18 M, 80% adults in kenya use \n6000 transactions / day\n16,000 bank agents accept M-Pesa\n\nSnapcash: Snapcash Could Bring Real Identity And Ad Targeting Data To Snapchat\nAmerican red cross launches bitcoin: American Red Cross To Accept Bitcoin Donations Through BitPay\n\nSponsors:\nOtter Labs www.hireotter.com\n- Hire great and inexpensive developer with staff augmentation through Otter.\n\nRedeeem https://redeeem.click/qdza\n- Redeeem is a decentralized peer-to-peer exchange that lets you save 15% or more on gift cards using Bitcoin and other cryptocurrencies.",
            "length": "64694722",
            "sourceUrl": "http://feeds.soundcloud.com/stream/180206404-aroundthecoin-final-version-around-the-coin-episode-44.mp3"
        },
        {
            "title": "How to Discover Your Life's Work",
            "datePublished": "Sat, 29 Nov 2014 00:06:50 +0000",
            "description": "This week Brian and Mike dig into some deep topics this week, particularly how to find your path in life and other general topics.\n\n- How Brian relaunched onTwitter\n- Why Social profile is mandatory\n- HomeHero retreat brings people together, it’s all about people\n- How Flowtab and ZingCheckout became an obsession\n- How to connect life with expertise\n- Why having 2 roller coasters going is important\n- Generation gap between WW2, dreams\n- Sharel Sandberg married David Goldberg, the current CEO of SurveyMonkey\n- Decisions are not better or worse, they’re just different (Ted)\n- Steve Jobs cancer / Tim Cook going publicly gay\n\nSponsors:\nOtter Labs www.hireotter.com\n- Hire great and inexpensive developer with staff augmentation through Otter.\n\nRedeeem https://redeeem.click/qdza\n- Redeeem is a decentralized peer-to-peer exchange that lets you save 15% or more on gift cards using Bitcoin and other cryptocurrencies.",
            "length": "63470827",
            "sourceUrl": "http://feeds.soundcloud.com/stream/179101510-aroundthecoin-how-to-discover-your-lifes-work.mp3"
        },
        {
            "title": "MCX just declared war on Apple Pay",
            "datePublished": "Fri, 14 Nov 2014 20:19:31 +0000",
            "description": "This week we dive into MCX, we talked about the history of the organization and why it is probably doomed. MCX (Merchant Customer Exchange). MCX is the collection of efforts by major retailers to eliminate the expense of Visa, Mastercard, and AMEX by creating their own payment network. Unfortunately the project now competes directly with Apple Pay and may be hitting some rough waters soon...\n\nSponsors:\nOtter Labs www.hireotter.com\n- Hire great and inexpensive developer with staff augmentation through Otter.\n\nRedeeem https://redeeem.click/qdza\n- Redeeem is a decentralized peer-to-peer exchange that lets you save 15% or more on gift cards using Bitcoin and other cryptocurrencies.",
            "length": "39094258",
            "sourceUrl": "http://feeds.soundcloud.com/stream/176932467-aroundthecoin-mcx-just-declared-war-on-apple-pay.mp3"
        },
        {
            "title": "Interview: Nick Tomaino, Coinbase Launches Bitcoin Tipping to the Masses.",
            "datePublished": "Fri, 14 Nov 2014 20:17:52 +0000",
            "description": "Nick Tomaino is the Business Development Manager at Coinbase and is responsible for the growth of Coinbase's new product that may just change the entire social construct of the social internet, Tipping. \n\nMany companies have tried and failed, but Coinbase is the world's most popular Bitcoin wallet, and they have the unique position to crush it.\n\nLearn what Nick and the Coinbase team have created and how they're planning to roll out out to the world. \n\nSponsors:\nOtter Labs www.hireotter.com\n- Hire great and inexpensive developer with staff augmentation through Otter.\n\nRedeeem https://redeeem.click/qdza\n- Redeeem is a decentralized peer-to-peer exchange that lets you save 15% or more on gift cards using Bitcoin and other cryptocurrencies.",
            "length": "43361419",
            "sourceUrl": "http://feeds.soundcloud.com/stream/176932269-aroundthecoin-interview-nick-tomaino-coinbase-launches-online-tipping.mp3"
        },
        {
            "title": "Fincen causes an earthquake by regulating Bitcoin",
            "datePublished": "Fri, 14 Nov 2014 20:12:57 +0000",
            "description": "Today we talk about how the Money2020 conference became one of the most most important payment conference in the world in just a few years. Faisal Khan talks about the interesting moves Poynt has made recently and why they are in a great position. We also touched on the recent Fincen Ruling around Bitcoin, why MCX server hacking could put them in the grave and the ever growing Starbucks payment ecosystem. \n\nSponsors:\nOtter Labs www.hireotter.com\n- Hire great and inexpensive developer with staff augmentation through Otter.\n\nRedeeem https://redeeem.click/qdza\n- Redeeem is a decentralized peer-to-peer exchange that lets you save 15% or more on gift cards using Bitcoin and other cryptocurrencies.",
            "length": "60202798",
            "sourceUrl": "http://feeds.soundcloud.com/stream/176931579-aroundthecoin-fincen-causes-an-earthquake-by-regulating-bitcoin.mp3"
        },
        {
            "title": "Etsy and Square Behind the Scenes and the Untold Story of Payments Giant, North American Bancard.",
            "datePublished": "Fri, 31 Oct 2014 05:27:57 +0000",
            "description": "In this episode we started with Mike Townsend and Brian Roemmele's experience with Apple Pay, then covered the big topic of Etsy launching their own card reader to compete with Square. Then we discuss an often overlooked, but massive aspect to the payment industry, the drama of the offline payment processors.\n\nSponsors:\nOtter Labs www.hireotter.com\n- Hire great and inexpensive developer with staff augmentation through Otter.\n\nRedeeem https://redeeem.click/qdza\n- Redeeem is a decentralized peer-to-peer exchange that lets you save 15% or more on gift cards using Bitcoin and other cryptocurrencies.",
            "length": "67814299",
            "sourceUrl": "http://feeds.soundcloud.com/stream/174666492-aroundthecoin-etsy-and-square-behind-the-scenes-and-the-untold-story-of-payments-giant-north-american-bancard.mp3"
        },
        {
            "title": "An Explanation of Carl Icahn and a Response to Marc Andreessen",
            "datePublished": "Wed, 15 Oct 2014 19:54:01 +0000",
            "description": "This week we covered multiple topics with a vibrant conversation between Brian, Mike and Faisal. Below are the highlights:\nCarl Icahn history (Gordon Gekko/ Wolf on Wallstreet)\nBrians answer to Marc Andreessen (earthquake to hit financial)\nPayPal splits with Ebay\nSerbia Russia banning bitcoin\nDisney’s example setting the trend\n\nSponsors:\nOtter Labs www.hireotter.com\n- Hire great and inexpensive developer with staff augmentation through Otter.\n\nRedeeem https://redeeem.click/qdza\n- Redeeem is a decentralized peer-to-peer exchange that lets you save 15% or more on gift cards using Bitcoin and other cryptocurrencies.",
            "length": "61689403",
            "sourceUrl": "http://feeds.soundcloud.com/stream/172313536-aroundthecoin-an-explanation-of-carl-icahn-and-a-response-to-marc-andreessen.mp3"
        },
        {
            "title": "Clinkle Launches, PayPal Integrates BTC, and Facebook Partners with Stripe.",
            "datePublished": "Wed, 08 Oct 2014 01:03:48 +0000",
            "description": "This week we talk about the official launch of Clinkle, which has had controversial reactions. Paypal integrates Bitcoin which shakes the industry and potentially has massive effects. Facebook partners with Stripe in anticipation of Facebook payments in messenger. And of course at the end we dig into a few insights within Apply Pay.\n\nSponsors:\nOtter Labs www.hireotter.com\n- Hire great and inexpensive developer with staff augmentation through Otter.\n\nRedeeem https://redeeem.click/qdza\n- Redeeem is a decentralized peer-to-peer exchange that lets you save 15% or more on gift cards using Bitcoin and other cryptocurrencies.",
            "length": "65775169",
            "sourceUrl": "http://feeds.soundcloud.com/stream/171120571-aroundthecoin-around-the-coin-episode-37.mp3"
        },
        {
            "title": "Interview: Ohad Samet, CEO - TrueAccord",
            "datePublished": "Thu, 02 Oct 2014 19:08:01 +0000",
            "description": "Ohad Samet is truly a magician. He has one of the most interesting track records of anyone we've had on the show, he was an early employee at Fraud Sciences Corporation (started by a few israeli special forces) which was acquired by PayPal for $169 Million, worked at PayPal for a few years then started and sold his company, Analyzd to Klarna. Now he's looking for a third big win with his new company TrueAccord offering debt collection services to companies by innovating in an industry that hasn't changed in 30 years. Listen to his amazing story and give leave a comment below!\n\nSponsors:\nOtter Labs www.hireotter.com\n- Hire great and inexpensive developer with staff augmentation through Otter.\n\nRedeeem https://redeeem.click/qdza\n- Redeeem is a decentralized peer-to-peer exchange that lets you save 15% or more on gift cards using Bitcoin and other cryptocurrencies.",
            "length": "62814052",
            "sourceUrl": "http://feeds.soundcloud.com/stream/170361231-aroundthecoin-interview-ohad-samet-ceo-trueaccord.mp3"
        },
        {
            "title": "How to Launch a Bitcoin Startup, Yahoo and Pinterest Payments.",
            "datePublished": "Tue, 23 Sep 2014 01:28:22 +0000",
            "description": "This week we focused on a few requests from Dustin Byington and Brian Lawe. We responded by giving a few predictions to what Yahoo may do in payments, as they have been notably silent for years. Next we give thoughts on how to grow a Bitcoin Startup, specifically answering these questions: \nIf Bitcoin (crytpo) was your startup and your goal was to expand adoption as quickly as possible:\nWhat is the biggest problem Bitcoin solaves?\nWhat is the most actionable problem Bitcoin solves?\nHow do you anticipate Bitcoin evolves from 1 to 2?\nWhat demographic would you target in the US?\nWhat demographic would you target globally?\n\nWe also dig into how Pinterest should get into payments and what may end up hurting them if they do it wrong.\nSponsors:\nOtter Labs www.hireotter.com\n- Hire great and inexpensive developer with staff augmentation through Otter.\n\nRedeeem https://redeeem.click/qdza\n- Redeeem is a decentralized peer-to-peer exchange that lets you save 15% or more on gift cards using Bitcoin and other cryptocurrencies.",
            "length": "58860892",
            "sourceUrl": "http://feeds.soundcloud.com/stream/168943401-aroundthecoin-how-to-launch-a-bitcoin-startup-yahoo-and-pinterest-payments.mp3"
        },
        {
            "title": "Wow, Apple Pay Just Changed Everything!",
            "datePublished": "Fri, 19 Sep 2014 01:05:56 +0000",
            "description": "The earth quaked the moment Apple released news of their move into the payment landscape with Apple Pay. Some business models were immediately crushed while others were accelerated. Brian and Faisal collectively have written 1000's of answers on payments give us the breakdown of how this announcement will effect us all.\n\nSponsors:\nOtter Labs www.hireotter.com\n- Hire great and inexpensive developer with staff augmentation through Otter.\n\nRedeeem https://redeeem.click/qdza\n- Redeeem is a decentralized peer-to-peer exchange that lets you save 15% or more on gift cards using Bitcoin and other cryptocurrencies.",
            "length": "87588439",
            "sourceUrl": "http://feeds.soundcloud.com/stream/168372797-aroundthecoin-applepay-changed-everything.mp3"
        },
        {
            "title": "Interview: Nate Stewart, CEO - Zing",
            "datePublished": "Mon, 15 Sep 2014 18:38:03 +0000",
            "description": "I am very excited to publish this interview with our guest Nate Stewart, CEO of Zing. Nate tells the story of how ZingCheckout was born, how the company acquired early customers, and what the future of retail commerce looks like. The mission at Zing is to create the future of retail software, starting with the Point of Sale. \n\nSponsors:\nOtter Labs www.hireotter.com\n- Hire great and inexpensive developer with staff augmentation through Otter.\n\nRedeeem https://redeeem.click/qdza\n- Redeeem is a decentralized peer-to-peer exchange that lets you save 15% or more on gift cards using Bitcoin and other cryptocurrencies.",
            "length": "63319039",
            "sourceUrl": "http://feeds.soundcloud.com/stream/167864451-aroundthecoin-interview-nate-stewart-ceo-zing.mp3"
        },
        {
            "title": "Learn How To Mine Crypto currency. From The Experts Who Do It.",
            "datePublished": "Fri, 12 Sep 2014 00:37:58 +0000",
            "description": "Sponsors:\nOtter Labs www.hireotter.com\n- Hire great and inexpensive developer with staff augmentation through Otter.\n\nRedeeem https://redeeem.click/qdza\n- Redeeem is a decentralized peer-to-peer exchange that lets you save 15% or more on gift cards using Bitcoin and other cryptocurrencies.",
            "length": "33298792",
            "sourceUrl": "http://feeds.soundcloud.com/stream/167332195-aroundthecoin-learn-how-to-mine-crypto-currency-from-the-experts-who-do-it.mp3"
        },
        {
            "title": "Guest: Cass Phillipps - Organizer of Failcon",
            "datePublished": "Mon, 08 Sep 2014 20:35:41 +0000",
            "description": "This episode Cass Phillipps joins Brian, Faisal and Mike on the show. Cass was the creator of FailCon. FailCon is a conference for startup founders to study their own and others' failures and prepare for success. FailCon is produced in over a dozen cities on 6 continents around the globe by people just like you.\n\nCass started her career in the performing arts where she brings many of her learnings to the technology industry. She now works as a game designer at Pocket Gems on their newest title, Episode – Choose Your Story.\n\nWe discuss perspectives on startup failure, performing arts and finding your life's calling.\n\nSponsors:\nOtter Labs www.hireotter.com\n- Hire great and inexpensive developer with staff augmentation through Otter.\n\nRedeeem https://redeeem.click/qdza\n- Redeeem is a decentralized peer-to-peer exchange that lets you save 15% or more on gift cards using Bitcoin and other cryptocurrencies.",
            "length": "32796724",
            "sourceUrl": "http://feeds.soundcloud.com/stream/166827510-aroundthecoin-guest-cass-phillipps-organizer-of-failcon.mp3"
        },
        {
            "title": "Guest: CEO Kuapay, Joaquin Ayuso de Paul",
            "datePublished": "Thu, 28 Aug 2014 18:04:42 +0000",
            "description": "We invited Joaquin Ayuso de Paul, CEO of Kuapay on the show. Juaquin has one of the most interesting startup stories I've ever heard, he built \"The Facebook of Spain\" and sold it for $99Million in 2010. He then moved to Santa Monica, CA and started Kuapay, which has had great success by launching in Chili as a test market first. Come list how he did it!\n\nSponsors:\nOtter Labs www.hireotter.com\n- Hire great and inexpensive developer with staff augmentation through Otter.\n\nRedeeem https://redeeem.click/qdza\n- Redeeem is a decentralized peer-to-peer exchange that lets you save 15% or more on gift cards using Bitcoin and other cryptocurrencies.",
            "length": "57243349",
            "sourceUrl": "http://feeds.soundcloud.com/stream/165187490-aroundthecoin-around-the-coin-podcast-episode-30.mp3"
        },
        {
            "title": "Brian and Mike Get Philosophical",
            "datePublished": "Thu, 28 Aug 2014 04:23:14 +0000",
            "description": "Brian and Mike get philosophical as some major tectonic plates shift in the payment world and what this means for all of us.\n\nSponsors:\nOtter Labs www.hireotter.com\n- Hire great and inexpensive developer with staff augmentation through Otter.\n\nRedeeem https://redeeem.click/qdza\n- Redeeem is a decentralized peer-to-peer exchange that lets you save 15% or more on gift cards using Bitcoin and other cryptocurrencies.",
            "length": "31542388",
            "sourceUrl": "http://feeds.soundcloud.com/stream/165105801-aroundthecoin-brian-and-mike-get-philosophical.mp3"
        },
        {
            "title": "Amazon's Secret Payment Plan",
            "datePublished": "Thu, 28 Aug 2014 04:05:39 +0000",
            "description": "On Episode 28 of Around the Coin, Mike Townsend, Brian Roemmele (Romm-lee), and Faisal (f uh y - z uh l) Khan (k AA n ) discuss what the CEO of Starbucks is planning to do with the most successful mobile payments app in the world. Also, Amazon’s secret plan to combine same day delivery, payments, and the new Fire phone. Lastly, we discuss the release of the brand new Stellar cyrptocurrency.\n\nSponsors:\nOtter Labs www.hireotter.com\n- Hire great and inexpensive developer with staff augmentation through Otter.\n\nRedeeem https://redeeem.click/qdza\n- Redeeem is a decentralized peer-to-peer exchange that lets you save 15% or more on gift cards using Bitcoin and other cryptocurrencies.",
            "length": "31542388",
            "sourceUrl": "http://feeds.soundcloud.com/stream/165104194-aroundthecoin-amazons-secret-payment-plan.mp3"
        },
        {
            "title": "Payments and Social Media are on a Collision Course",
            "datePublished": "Wed, 06 Aug 2014 21:43:08 +0000",
            "description": "On Episode 27 of Around the Coin, Mike Townsend, Brian Roemmele, and Faisal Khan predict the future of payments in social media with Twitter buying cardspring, snapchat payments, and Facebook’s new “Buy Button” for one click buying. \n\nSponsors:\nOtter Labs www.hireotter.com\n- Hire great and inexpensive developer with staff augmentation through Otter.\n\nRedeeem https://redeeem.click/qdza\n- Redeeem is a decentralized peer-to-peer exchange that lets you save 15% or more on gift cards using Bitcoin and other cryptocurrencies.",
            "length": "61720351",
            "sourceUrl": "http://feeds.soundcloud.com/stream/162015120-aroundthecoin-payments-and-social-media-are-on-a-collision-course.mp3"
        },
        {
            "title": "Our Trip to the White House",
            "datePublished": "Tue, 05 Aug 2014 01:41:58 +0000",
            "description": "This week on Around the Coin, Mike Townsend, Brian Roemmele, and Faisal Khan discuss Brian’s trip to the White House, meeting with economic advisors in a colaborative plan to improve America’s payment industry.\n\nSponsors:\nOtter Labs www.hireotter.com\n- Hire great and inexpensive developer with staff augmentation through Otter.\n\nRedeeem https://redeeem.click/qdza\n- Redeeem is a decentralized peer-to-peer exchange that lets you save 15% or more on gift cards using Bitcoin and other cryptocurrencies.",
            "length": "61113199",
            "sourceUrl": "http://feeds.soundcloud.com/stream/161738975-aroundthecoin-our-trip-to-the-white-house.mp3"
        },
        {
            "title": "Recap of the Last 25 Episodes",
            "datePublished": "Tue, 05 Aug 2014 01:32:37 +0000",
            "description": "This week on Around the Coin, Mike Townsend, Brian Roemmele, and Faisal Khan recap the last 25 shows and provide life tips that you can use to discover new opportunities and engage with awesome people online.\n\nSponsors:\nOtter Labs www.hireotter.com\n- Hire great and inexpensive developer with staff augmentation through Otter.\n\nRedeeem https://redeeem.click/qdza\n- Redeeem is a decentralized peer-to-peer exchange that lets you save 15% or more on gift cards using Bitcoin and other cryptocurrencies.",
            "length": "58274665",
            "sourceUrl": "http://feeds.soundcloud.com/stream/161738030-aroundthecoin-around-the-coin-podcast-episode-25.mp3"
        },
        {
            "title": "CA Governor Jerry Brown Signs Bill Legalizing Bitcoin",
            "datePublished": "Tue, 22 Jul 2014 23:38:49 +0000",
            "description": "This week on Around the Coin, Mike Townsend, Brian Roemmele, and Faisal Khan discuss the huge effects of governor Jerry Brown signing a law that legalizes bitcoin in California as well as the implications of a Bitcoin Exchange.\n\nSponsors:\nOtter Labs www.hireotter.com\n- Hire great and inexpensive developer with staff augmentation through Otter.\n\nRedeeem https://redeeem.click/qdza\n- Redeeem is a decentralized peer-to-peer exchange that lets you save 15% or more on gift cards using Bitcoin and other cryptocurrencies.",
            "length": "59375859",
            "sourceUrl": "http://feeds.soundcloud.com/stream/159866302-aroundthecoin-ca-governor-jerry-brown-signs-bill-legalizing-bitcoin.mp3"
        },
        {
            "title": "Why Oracle buys Micros for $5 Billion and what Amazon has planned with Fire Phone.",
            "datePublished": "Tue, 08 Jul 2014 03:06:09 +0000",
            "description": "This week on Around the Coin, Brian Roemmele, Faisal Khan, and Mike Townsend discuss Oracle’s acquisition of Micros for 5 billion dollars, a review of the Amazon Fire phone, and how crypto currencies are affecting marketplace startups.\n\nSponsors:\nOtter Labs www.hireotter.com\n- Hire great and inexpensive developer with staff augmentation through Otter.\n\nRedeeem https://redeeem.click/qdza\n- Redeeem is a decentralized peer-to-peer exchange that lets you save 15% or more on gift cards using Bitcoin and other cryptocurrencies.",
            "length": "59174558",
            "sourceUrl": "http://feeds.soundcloud.com/stream/157758215-aroundthecoin-why-oracle-bought-micros-for-5-billion-and-what-amazon-has-planned-with-fire-phone.mp3"
        },
        {
            "title": "Part 1: 'Knox Payments' CEO Interview. Part 2: Why Did David Marcus Quit Paypal for Facebook?",
            "datePublished": "Tue, 01 Jul 2014 07:02:15 +0000",
            "description": "This week on Around the Coin we’re joined by CEO of Knox Payments, Tommy Nicholas, telling us his strategy to kill Visa and Mastercard. Also, we’ll be discussing the $2.6 billion dollar acquisition of Open Table and the stunning move by David Marcus to quit Paypal and build Facebook’s next generation payment platform.\n\nSponsors:\nOtter Labs www.hireotter.com\n- Hire great and inexpensive developer with staff augmentation through Otter.\n\nRedeeem https://redeeem.click/qdza\n- Redeeem is a decentralized peer-to-peer exchange that lets you save 15% or more on gift cards using Bitcoin and other cryptocurrencies.",
            "length": "60011485",
            "sourceUrl": "http://feeds.soundcloud.com/stream/156799333-aroundthecoin-part-1-knox-payments-ceo-interview-part-2-why-did-david-marcus-quit-paypal-for-facebook.mp3"
        },
        {
            "title": "What Did Apple’s WWDC Mean for Payments?",
            "datePublished": "Sat, 21 Jun 2014 07:59:25 +0000",
            "description": "This week on Around the Coin we traveled to Apple’s WWDC conference and saw first hand what Apple is releasing that will shake up the world of payments. Around the coin. \n\nSponsors:\nOtter Labs www.hireotter.com\n- Hire great and inexpensive developer with staff augmentation through Otter.\n\nRedeeem https://redeeem.click/qdza\n- Redeeem is a decentralized peer-to-peer exchange that lets you save 15% or more on gift cards using Bitcoin and other cryptocurrencies.",
            "length": "56670898",
            "sourceUrl": "http://feeds.soundcloud.com/stream/155345936-aroundthecoin-what-did-apples-wwdc-mean-for-payments.mp3"
        },
        {
            "title": "How to Use Quora to Make Money and Progress Your Career.",
            "datePublished": "Fri, 13 Jun 2014 22:07:34 +0000",
            "description": "This week’s episode on Around the Coin we focus on Quora’s recent Top Writer’s Meet-up, how Quora will eventually monetize, and the secrets to getting the most out of Quora’s brilliant community by some of the most active writers in the game. \n\nSponsors:\nOtter Labs www.hireotter.com\n- Hire great and inexpensive developer with staff augmentation through Otter.\n\nRedeeem https://redeeem.click/qdza\n- Redeeem is a decentralized peer-to-peer exchange that lets you save 15% or more on gift cards using Bitcoin and other cryptocurrencies.",
            "length": "62051776",
            "sourceUrl": "http://feeds.soundcloud.com/stream/154255365-aroundthecoin-how-to-use-quora-to-make-money-and-progress-your-career.mp3"
        },
        {
            "title": "Why Apple Bought Beats and Square Traded 'Wallet' for 'Order'",
            "datePublished": "Thu, 29 May 2014 02:55:32 +0000",
            "description": "This week on Around the Coin, we talk about Apple’s acquisition of “Beats by Dre” for $3.2 Billion, the failure of “Square Wallet”, and what “Square Order” must do to become successful in an already crowded space of mobile ordering applications. Around the Coin.\n\nSponsors:\nOtter Labs www.hireotter.com\n- Hire great and inexpensive developer with staff augmentation through Otter.\n\nRedeeem https://redeeem.click/qdza\n- Redeeem is a decentralized peer-to-peer exchange that lets you save 15% or more on gift cards using Bitcoin and other cryptocurrencies.",
            "length": "59835511",
            "sourceUrl": "http://feeds.soundcloud.com/stream/151777423-aroundthecoin-why-apple-bought-beats-and-square-traded-wallet-for-order.mp3"
        },
        {
            "title": "Special Guest: Chris Larsen - Ripple CEO",
            "datePublished": "Thu, 22 May 2014 16:10:53 +0000",
            "description": "Today on Around the Coin podcast, we have the CEO of Ripple Labs, Chris Larsen discussing the future of payments, the strategy behind Ripple, and the tremendous opportunities in cryptocurrency over the coming years.  Around The Coin podcast.\n\nSponsors:\nOtter Labs www.hireotter.com\n- Hire great and inexpensive developer with staff augmentation through Otter.\n\nRedeeem https://redeeem.click/qdza\n- Redeeem is a decentralized peer-to-peer exchange that lets you save 15% or more on gift cards using Bitcoin and other cryptocurrencies.",
            "length": "43193041",
            "sourceUrl": "http://feeds.soundcloud.com/stream/150761189-aroundthecoin-special-guest-chris-larsen-ripple-ceo.mp3"
        },
        {
            "title": "What Are iBeacons All About?",
            "datePublished": "Tue, 13 May 2014 00:19:14 +0000",
            "description": "This week on Around the Coin podcast we cover iBeacon technology. We'll discuss how it technically works, examples in the real world, and what future business opportunities exist for startup founders. Around the Coin.\n\nSponsors:\nOtter Labs www.hireotter.com\n- Hire great and inexpensive developer with staff augmentation through Otter.\n\nRedeeem https://redeeem.click/qdza\n- Redeeem is a decentralized peer-to-peer exchange that lets you save 15% or more on gift cards using Bitcoin and other cryptocurrencies.",
            "length": "63099370",
            "sourceUrl": "http://feeds.soundcloud.com/stream/149240987-aroundthecoin-episode-16-fixed.mp3"
        },
        {
            "title": "Everything About Money Transmitter Licensing",
            "datePublished": "Fri, 09 May 2014 15:49:03 +0000",
            "description": "This week on Around the Coin, Faisal Khan, Brian Roemmele, and Mike Townsend discuss everything about money transmitter licenses, including how they work, who needs one, and how bitcoin plays a role. Around the Coin.\n\nSponsors:\nOtter Labs www.hireotter.com\n- Hire great and inexpensive developer with staff augmentation through Otter.\n\nRedeeem https://redeeem.click/qdza\n- Redeeem is a decentralized peer-to-peer exchange that lets you save 15% or more on gift cards using Bitcoin and other cryptocurrencies.",
            "length": "63525961",
            "sourceUrl": "http://feeds.soundcloud.com/stream/148700373-aroundthecoin-episode-17.mp3"
        },
        {
            "title": "What Facebook is Doing with Money Transmitter Licenses & Future Uses for Bitcoin.",
            "datePublished": "Tue, 29 Apr 2014 05:28:15 +0000",
            "description": "This week on Around the Coin, Brian Roemmele, Faisal Khan, and Mike Townsend cover the recent ETA conference, why Facebook money transmitter licenses are so important, and future uses for the Bitcoin block chain.",
            "length": "62797045",
            "sourceUrl": "http://feeds.soundcloud.com/stream/147006322-aroundthecoin-what-facebook-is-doing-with-money-transmitter-licenses-future-uses-for-bitcoin.mp3"
        },
        {
            "title": "Changing Landscape of Remittances",
            "datePublished": "Sun, 20 Apr 2014 00:25:20 +0000",
            "description": "This week on Around the Coin we talk about the \"Changing Landscape of Remittances\".  Our in-house expert, Faisal Khan explains the current state of world remittances and a few major business opportunities over the next few years. Around the Coin.\n\nSponsors:\nOtter Labs www.hireotter.com\n- Hire great and inexpensive developer with staff augmentation through Otter.\n\nRedeeem https://redeeem.click/qdza\n- Redeeem is a decentralized peer-to-peer exchange that lets you save 15% or more on gift cards using Bitcoin and other cryptocurrencies.",
            "length": "56661634",
            "sourceUrl": "http://feeds.soundcloud.com/stream/145536385-aroundthecoin-episode-14.mp3"
        },
        {
            "title": "An Entrepreneur's Journey Into Payments - Mike Townsend.",
            "datePublished": "Sun, 13 Apr 2014 09:18:27 +0000",
            "description": "This week on Around the Coin, Mike Townsend discusses his journey beginning as an engineer in Singapore then moving to LA to design military UAV’s. He tells us how he transitioned into payments by starting a point of sale company, ZingCheckout and mobile payments company Flowtab.  Around the Coin.\n\nSponsors:\nOtter Labs www.hireotter.com\n- Hire great and inexpensive developer with staff augmentation through Otter.\n\nRedeeem https://redeeem.click/qdza\n- Redeeem is a decentralized peer-to-peer exchange that lets you save 15% or more on gift cards using Bitcoin and other cryptocurrencies.",
            "length": "71885977",
            "sourceUrl": "http://feeds.soundcloud.com/stream/144467724-aroundthecoin-an-entrepreneurs-journey-into.mp3"
        },
        {
            "title": "Special Guest: Brett King - Moven CEO and Author of \"Bank 3.0\"",
            "datePublished": "Sat, 05 Apr 2014 02:38:13 +0000",
            "description": "This week on Around the Coin, we have Brett King on the show! Brett is a world leader in the banking and payment industry. He is author of the book Bank 3.0, radio host at Breaking Banks and CEO of mobile payments startup Moven.\n\nSponsors:\nOtter Labs www.hireotter.com\n- Hire great and inexpensive developer with staff augmentation through Otter.\n\nRedeeem https://redeeem.click/qdza\n- Redeeem is a decentralized peer-to-peer exchange that lets you save 15% or more on gift cards using Bitcoin and other cryptocurrencies.",
            "length": "56444050",
            "sourceUrl": "http://feeds.soundcloud.com/stream/143141213-aroundthecoin-special-guest-brett-king-moven.mp3"
        },
        {
            "title": "The Blueprint for the Next Decade of Mobile Payments",
            "datePublished": "Mon, 31 Mar 2014 02:53:46 +0000",
            "description": "This week on Around the Coin, Brian Roemmele, Faisal Kahn, and Mike Townsend provide the blueprint for the mobile payment industry both in the United States and abroad. Around the Coin.\n\nSponsors:\nOtter Labs www.hireotter.com\n- Hire great and inexpensive developer with staff augmentation through Otter.\n\nRedeeem https://redeeem.click/qdza\n- Redeeem is a decentralized peer-to-peer exchange that lets you save 15% or more on gift cards using Bitcoin and other cryptocurrencies.",
            "length": "65872419",
            "sourceUrl": "http://feeds.soundcloud.com/stream/142276819-aroundthecoin-the-blueprint-for-the-next-decade-of-mobile-payments.mp3"
        },
        {
            "title": "Why are digital wallets are struggling while PowaTag is winning.",
            "datePublished": "Fri, 21 Mar 2014 02:44:28 +0000",
            "description": "This week on Around the Coin, Faisal Kahn, Brian Roemmele, and Mike Townsend will be discussing london-based PowaTag’s (pow - ah - tag)  $97M (ninty seven million dollar) raise and why major mobile wallets like Google, Square, and Paypal continue to struggle at brick and mortar. Around the Coin.\n\nSponsors:\nOtter Labs www.hireotter.com\n- Hire great and inexpensive developer with staff augmentation through Otter.\n\nRedeeem https://redeeem.click/qdza\n- Redeeem is a decentralized peer-to-peer exchange that lets you save 15% or more on gift cards using Bitcoin and other cryptocurrencies.",
            "length": "71963539",
            "sourceUrl": "http://feeds.soundcloud.com/stream/140633036-aroundthecoin-why-are-digital-wallets-are-struggling.mp3"
        },
        {
            "title": "Special Guest: Sasha Orloff - LendUp CEO",
            "datePublished": "Sun, 09 Mar 2014 21:05:08 +0000",
            "description": "This week we have special guest and CEO of LendUp, Sasha Orloff joining the conversation. We’ll be discussing opportunities in microfinance, peer to peer lending and what LendUp has already done to revolutionize payday loans.  Around the coin podcast.\n\nSponsors:\nOtter Labs www.hireotter.com\n- Hire great and inexpensive developer with staff augmentation through Otter.\n\nRedeeem https://redeeem.click/qdza\n- Redeeem is a decentralized peer-to-peer exchange that lets you save 15% or more on gift cards using Bitcoin and other cryptocurrencies.",
            "length": "57677560",
            "sourceUrl": "http://feeds.soundcloud.com/stream/138758882-aroundthecoin-special-guest-sasha-orloff.mp3"
        },
        {
            "title": "Simple's $117M acquisition is the start of a movement.",
            "datePublished": "Sat, 01 Mar 2014 20:34:28 +0000",
            "description": "This week in episode 8 of Around the Coin podcast, Brian Roemmele, Mike Townsend and Faisal Kahn explain why Simple was acquired for 120 million dollars by a 150 year old spanish bank.  Then, Faisal tells us why the mortgage system is broken across India and Southeast Asia and explains in detail for entrepreneurs how to fix it.  Around the Coin podcast.\n\nSponsors:\nOtter Labs www.hireotter.com\n- Hire great and inexpensive developer with staff augmentation through Otter.\n\nRedeeem https://redeeem.click/qdza\n- Redeeem is a decentralized peer-to-peer exchange that lets you save 15% or more on gift cards using Bitcoin and other cryptocurrencies.",
            "length": "63566825",
            "sourceUrl": "http://feeds.soundcloud.com/stream/137420757-aroundthecoin-simples-117m-acquisition-is.mp3"
        },
        {
            "title": "Did we just witness Bitcoin's tipping point?",
            "datePublished": "Fri, 21 Feb 2014 23:58:49 +0000",
            "description": "This week on Around the Coin, Faisal Kahn, Brian Roemmele and Mike Townsend talk about Iceland’s creation of their own crypto currency, how Fiverr’s decision to accept bitcoin will be the tipping point and how millions of dollars worth of bitcoin were stolen from Silk Road. Around the Coin podcast.\n\nEpisode 7\n\nSponsors:\nOtter Labs www.hireotter.com\n- Hire great and inexpensive developer with staff augmentation through Otter.\n\nRedeeem https://redeeem.click/qdza\n- Redeeem is a decentralized peer-to-peer exchange that lets you save 15% or more on gift cards using Bitcoin and other cryptocurrencies.",
            "length": "49147393",
            "sourceUrl": "http://feeds.soundcloud.com/stream/136078724-aroundthecoin-episode-7.mp3"
        },
        {
            "title": "How the payment ecosystem works, and the trillion dollar idea.",
            "datePublished": "Sat, 15 Feb 2014 05:46:45 +0000",
            "description": "This week on Around the Coin podcast, Mike Townsend, Faisal Kahn and Brian Roemmele give you the high level view of how the payment ecosystem works, and the trillion dollar idea to create a trust network for Bitcoin transactions. Around the Coin podcast.\n\nSponsors:\nOtter Labs www.hireotter.com\n- Hire great and inexpensive developer with staff augmentation through Otter.\n\nRedeeem https://redeeem.click/qdza\n- Redeeem is a decentralized peer-to-peer exchange that lets you save 15% or more on gift cards using Bitcoin and other cryptocurrencies.",
            "length": "79945751",
            "sourceUrl": "http://feeds.soundcloud.com/stream/134913857-aroundthecoin-how-the-payment-ecosystem.mp3"
        },
        {
            "title": "Which peer to peer payment application will win, and why?",
            "datePublished": "Fri, 07 Feb 2014 20:35:38 +0000",
            "description": "Sponsors:\nOtter Labs www.hireotter.com\n- Hire great and inexpensive developer with staff augmentation through Otter.\n\nRedeeem https://redeeem.click/qdza\n- Redeeem is a decentralized peer-to-peer exchange that lets you save 15% or more on gift cards using Bitcoin and other cryptocurrencies.",
            "length": "226453754",
            "sourceUrl": "http://feeds.soundcloud.com/stream/133599116-aroundthecoin-what-peer-to-peer-payment.m4a"
        },
        {
            "title": "Podcast_01_26_14",
            "datePublished": "Sat, 01 Feb 2014 06:02:22 +0000",
            "description": "Who will win the loyalty game?\n\nAround the Coin podcast\n\nIf you are building a business or thinking about integrating loyalty into your offering, we made this podcast for you.\nWe touch on the legacy loyalty coupons (S&H Green Stamps), what technical strategies will win in the long run, and a few secrets to distribution in tough markets. \n\nSponsors:\nOtter Labs www.hireotter.com\n- Hire great and inexpensive developer with staff augmentation through Otter.\n\nRedeeem https://redeeem.click/qdza\n- Redeeem is a decentralized peer-to-peer exchange that lets you save 15% or more on gift cards using Bitcoin and other cryptocurrencies.",
            "length": "68107561",
            "sourceUrl": "http://feeds.soundcloud.com/stream/132479302-aroundthecoin-podcast_01_26_14.mp3"
        },
        {
            "title": "Interview: Matin Tamizi, CEO - Balanced Payments",
            "datePublished": "Mon, 20 Jan 2014 18:03:31 +0000",
            "description": "Sponsors:\nOtter Labs www.hireotter.com\n- Hire great and inexpensive developer with staff augmentation through Otter.\n\nRedeeem https://redeeem.click/qdza\n- Redeeem is a decentralized peer-to-peer exchange that lets you save 15% or more on gift cards using Bitcoin and other cryptocurrencies.",
            "length": "74780038",
            "sourceUrl": "http://feeds.soundcloud.com/stream/130487122-aroundthecoin-balanced-payments.mp3"
        },
        {
            "title": "Podcast_01_12_14",
            "datePublished": "Sun, 19 Jan 2014 22:43:50 +0000",
            "description": "Sponsors:\nOtter Labs www.hireotter.com\n- Hire great and inexpensive developer with staff augmentation through Otter.\n\nRedeeem https://redeeem.click/qdza\n- Redeeem is a decentralized peer-to-peer exchange that lets you save 15% or more on gift cards using Bitcoin and other cryptocurrencies.",
            "length": "70257727",
            "sourceUrl": "http://feeds.soundcloud.com/stream/130365507-aroundthecoin-podcast_01_12_14.mp3"
        }
    ]
}