{
    "artwork": "http://is2.mzstatic.com/image/thumb/Music3/v4/7a/e4/b4/7ae4b4b9-cc31-6f23-4a5e-afde68fac6c3/source/100x100bb.jpg",
    "description": "The Artelligence Podcast unpacks the mysteries of the global art market through interviews with collectors, dealers, auction house specialists, lawyers, art advisors and the myriad individuals who make the art market a beguiling mixture of sublime beauty and commercial acumen.",
    "feedURL": "http://feeds.soundcloud.com/users/soundcloud:users:92594613/sounds.rss",
    "podcastURL": "http://www.artmarketmonitor.com/artelligence/",
    "title": "Artelligence Podcast",
    "episodes": [
        {
            "title": "Made You Look, Barry Avrich's New Documentary About the Knoedler Forgeries",
            "datePublished": "Mon, 08 Jun 2020 18:25:55 +0000",
            "description": "Barry Avrich is a prolific documentary film producer. In 2017, he released \"Blurred Lines\" about the Contemporary art market. Avrich's latest project, \"Made You Look: A True Story About Fake Art,\" deals with the Knoedler forgery trial that took place in 2016. Avrich talks about how he got former Knoedler director Ann Freedman to participate in the documentary as well as alleged mastermind of the fraud, Juan Carlos Bergantinos. Throughout the movie, Avrich allows the parties to speak for themselves. The result is a fair but compelling look at the illusions and delusions that surround the world's most valuable art. \n\nThe film will open with a limited theatrical release later this Fall in New York, London and Los Angeles. It will be streamed in wide release in early 2021.",
            "length": "54773302",
            "sourceUrl": "http://feeds.soundcloud.com/stream/827154193-artelligence-made-you-look-barry-avrichs.mp3"
        },
        {
            "title": "Buying, Selling and Financing Art from Quarantine with Bill Griffin, Cynthia Sachs and Naomi Baigell",
            "datePublished": "Wed, 13 May 2020 20:50:13 +0000",
            "description": "Bill Griffin of Los Angeles's Kayne Griffin Corcoran gallery joins Cynthia Sachs and Naomi Baigell of Athena Art Finance to discuss the current state of art market. Griffin discusses the ways that the pandemic has had an impact upon his business and the surprising ways that it has not. Gallerists are traveling less but collectors seem no less keen on continuing conversations and re-thinking the composition of their collections.",
            "length": "62990755",
            "sourceUrl": "http://feeds.soundcloud.com/stream/813423787-artelligence-buying-selling-and-financing.mp3"
        },
        {
            "title": "KASMIN Director Nick Olney on Paul Kasmin, painter William Copley and California Surrealism",
            "datePublished": "Thu, 23 Apr 2020 14:17:13 +0000",
            "description": "Nick Olney, Director at KASMIN Gallery, discusses the life and legacy of Paul Kasmin, the gallery's founder who died in March 2020. Olney illustrates Kasmin's vision through an examination of the William Copley show that opened just days before New York fell under a \"stay-at-home\" order that closed the galleries temporarily.  Copley was a California-bred painter who became an ardent and self-styled surrealist before becoming an artist in his own right. Copley's experience dovetails with the subject of another show at KASMIN Gallery—\"Valley of Gold: Southern California and the Phantasmagoric\"— temporarily suspended too.",
            "length": "57813687",
            "sourceUrl": "http://feeds.soundcloud.com/stream/803067610-artelligence-kasmin-director-nick-olney-on.mp3"
        },
        {
            "title": "Women in Creative Leadership: Yieldstreet x Athena Art Finance at The Armory Show",
            "datePublished": "Wed, 15 Apr 2020 21:32:04 +0000",
            "description": "This is another episode in our series of collaborations between ARTnews and Yieldstreet x Athena Art Finance. At the Armory Show in New York, Vajra Kingsley moderated a panel on what it takes for women to be successful in creative leadership positions featuring Angela Redai, founder of Artine Advisory; Samantha Bloom, partner at Unbranded Pictures; Lexie Komisar, global head of Startup Ecosystems & Partner Platforms at IBM; and Wen-You Cai, founder and director at Special Special.",
            "length": "63225890",
            "sourceUrl": "http://feeds.soundcloud.com/stream/799210999-artelligence-yield-street-x-athena-art.mp3"
        },
        {
            "title": "Athena Art Finance's Prize for the Best Booth at The Armory Show Presents",
            "datePublished": "Wed, 08 Apr 2020 14:04:21 +0000",
            "description": "Since 2017, Athena Art Finance has awarded $10,000 to the best booth in The Armory Show Presents, a section of the fair for emerging galleries. In this podcast recorded at the fair, Athena's Naomi Baigell and ARTnews Editor-in-Chief Sarah Douglas talk to Mariane Ibrahim, a gallerist and former winner of the prize, about what it takes to put on a winning art fair presentation. You'll learn here about all of the thinking, planning and strategy that goes into making an effective art fair booth.",
            "length": "62929660",
            "sourceUrl": "http://feeds.soundcloud.com/stream/792954034-artelligence-armory-show-presents-booth.mp3"
        },
        {
            "title": "Michael Weisz on Art Lending for Collectors and Investors: Yieldstreet at The Armory Show",
            "datePublished": "Mon, 06 Apr 2020 17:20:08 +0000",
            "description": "Continuing ARTnews's collaboration with Yieldstreet for the Armory Show fair in New York, Michael Weisz talks about bringing liquidity to art collectors in the form of non-recourse loans backed by Yieldstreet's platform. Weisz, co-founder and President of Yieldstreet, talks about the transformation Yieldstreet is bringing to investors looking for diversified investments and the opportunities that offers to art collectors and dealers. Loans, properly applied, offer those with significant capital tied up in art greater flexibility and spending power.",
            "length": "65915291",
            "sourceUrl": "http://feeds.soundcloud.com/stream/789440446-artelligence-michael-weisz-armory-show.mp3"
        },
        {
            "title": "The Business of Art: Yieldstreet x Athena Art Finance at The Armory Show",
            "datePublished": "Wed, 25 Mar 2020 09:00:20 +0000",
            "description": "At the 2020 Armory Show Art Fair, three entrepreneurs—Yieldstreet's Co-Founder and President Michael Weisz, PRZM Co-Founder Larry Milstein and Athena Art Finance's CIO Cynthia Sachs—got together to talk about the challenges to building a business in the creative industries. Milstein's PRZM guides companies through the complexities of marketing to Gen Z consumers who prize experiences and cultural property in ways that are novel and rapidly expanding. Sachs has built Athena into the leading non-recourse lender in the art finance category. Now owned by Yieldstreet and benefiting from the capital sourced through Yieldstreet's platform, Athena provides art collectors and dealers with a different model for managing the capital and liquidity requirements of owning art. Weisz shared his experiences in building the Yieldstreet platform and vision for the future of finance.",
            "length": "91872310",
            "sourceUrl": "http://feeds.soundcloud.com/stream/778408594-artelligence-yield-street-armory-show-art-1.mp3"
        },
        {
            "title": "Tina Perry and Ric Whitney Discuss Their Art Collecting with ARTnews Editor in Chief Sarah Douglas",
            "datePublished": "Tue, 03 Mar 2020 21:55:38 +0000",
            "description": "To kick off the second Frieze LA art fair, ARTnews Editor-in-Chief Sarah Douglas interviewed Los Angeles collectors Ric Whitney and Tina Perry-Whitney at the Four Seasons Los Angeles, exploring ways to begin collecting art. \n \nDuring the panel the Whitneys spoke about their interest in patronage of such institutions as CalArts, getting to know artists as individuals, and how they got involved in the art world in Los Angeles and beyond. “All this art we live with, there’s an energy emanating from it,” said Tina. “It is a privilege to get to buy this work and live with it.” Since 2012, the couple—Ric is a music publishing and talent management entrepreneur, and Tina is president of Oprah Winfrey Network—have been building a collection that is diverse not only in terms of the artists’ ethnicity and gender, but in medium, comprising sculpture, installation, painting, and photography. Among the artists whose work they hold are Charles Gaines, Genevieve Gaignard, Joe Goode, Henry Taylor, Sadie Barnette, David Shrigley, Thinh Nguyen, and many others.",
            "length": "60242396",
            "sourceUrl": "http://feeds.soundcloud.com/stream/769678087-artelligence-tina-perry-and-ric-whitney.m4a"
        },
        {
            "title": "AiA Art + Tech with William S. Smith, Laura Lehmann  and Ann Spalter",
            "datePublished": "Sat, 22 Feb 2020 14:00:10 +0000",
            "description": "At the Peninsula hotel  in Los Angeles, Art in America hosted a brunch for the highlighting the magazine's January Issue on Artificial Intelligence and Generative art. Artist, scholar, and collector Anne Spalter joined A.i.A. editor William S. Smith and tech entrepreneur Laura Lehmann for a conversation about the history and future of computer art.\n\nSpalter, author of the influential history The Computer in the Visual Arts (1999), described how her research into a field within art history that was neglected at the time led to her interest in collecting. She and her spouse, Michael Spalter, have built a significant collection that includes work created between the 1950s and 1980s by pioneering figures such as Vera Molnár, Georg Nees, and Koji Fujino. Though many of the compositions were produced by algorithms, the designs were fabricated with plotter printers on paper. The Spalters’ collection of computer art features many pieces in traditional mediums. Lehmann articulated an expanded view of collecting, noting that the meaning of collecting and curating is changing as those activities become widespread on social media. A new generation accustomed to managing collections of digital imagery on a daily basis could very well transform fundamental values in art and assumptions about its singularity.",
            "length": "39358133",
            "sourceUrl": "http://feeds.soundcloud.com/stream/764546695-artelligence-aia-laura-lehmann-panel-in-los.m4a"
        },
        {
            "title": "\"The Point of Final Collapse\": Brian Droitcour Interviews Postcommodity's Cristobal Martinez",
            "datePublished": "Mon, 27 Jan 2020 14:45:42 +0000",
            "description": "Postcommodity's The Point of Final Collapse is a sound piece broadcast from San Francisco Art Instititute's Chestnut Street campus every day at 5:01pm. The work incorporates the effects of AMSR to capture the city's housing crisis by highlighting the sinking Millennium Tower, a ten-year-old development in downtown San Francisco, and its structural problems. The work attempts to turn  data about Millennium Tower's pitching and yawing into a soothing, ever-evolving audio experience. In a conversation with Brian Droitcour, an editor at Art in America, artist Cristobal Martinez of Postcommodity discusses how he turns data into sound and why he feels the piece provides a tonic and comment upon upheaval in San Francisco's built environment.",
            "length": "89935397",
            "sourceUrl": "http://feeds.soundcloud.com/stream/747626155-artelligence-art-in-americas-brian.m4a"
        },
        {
            "title": "Painter Diarmuid Kelley Interviewed by Art in America's Will Smith",
            "datePublished": "Fri, 20 Dec 2019 20:21:36 +0000",
            "description": "Art in America's Editor Will Smith interviewed Diarmuid Kelley at Offer Waterman's pop-up gallery on Madison Avenue in New York during the November 2019 sales season. Smith and Kelley talk about Kelley's interest in clothes, costume and cinematography. \n\nBorn in Stirling in 1972, Diarmuid Kelley grew up in the north of England. He studied Fine Art at Newcastle University, graduating in 1995. He was the youngest artist ever to win the prestigious Nat West Art Prize at the age of 23, in the same year, he graduated from Newcastle. He went on to study for a Masters degree at Chelsea College of Art and Design.\n\nKelley has a long association with Offer Waterman & Co, having had five solo-exhibitions at the gallery. His work has regularly featured in the BP Portrait Award held at the National Portrait Gallery, London, and he has recently participated in a number of other group exhibitions including The Figure, Browse & Darby, London, Hinterland, Thomas Williams, London and Illuminate, Jasmine Studios, Hammersmith, London.\n\nEach year, Diarmuid undertakes a limited number of portrait commissions, often painted on location, which are produced in parallel to his studio work. In 2010 he was commissioned to paint Dame Anne Owers, Her Majesty's Chief Inspector of Prisons, This painting is now part of the National Portrait Gallery's permanent collection.",
            "length": "74776413",
            "sourceUrl": "http://feeds.soundcloud.com/stream/731528374-artelligence-diarmuid-kelly-interviewed-by.m4a"
        },
        {
            "title": "Pamela Joyner and Sarah Douglas at the CORE Club",
            "datePublished": "Thu, 05 Dec 2019 02:33:55 +0000",
            "description": "Pamela Joyner's collection of abstract art by African-American artists includes some of the giants of the field like Alma Thomas, Jack Whitten and Sam Gilliam. Her collecting focuses on supporting scholarship as much as acquiring and donating important works by African American artists to institutions like the Tate Modern in Britain.",
            "length": "65166233",
            "sourceUrl": "http://feeds.soundcloud.com/stream/692266114-artelligence-pamela-joyner-and-sarah-douglas-at-the-core-club.mp3"
        },
        {
            "title": "Adam Lindemann on Buying and Selling at Auction",
            "datePublished": "Wed, 13 Nov 2019 23:28:15 +0000",
            "description": "Adam Lindemann regales Sarah Douglas, Editor-in-Chief of ARTnews, with his stories and adventures on the art auction market. Lindemann explains the strategies he uses to approach estimates, reserves, guarantees and private sales. One of the most successful sellers at auction, Lindemann set the record price for a living artist in 2007 when he sold Jeff Koons's Hanging Heart for $23m. He succeeded again when his Jean-Michel Basquiat painting sold for a record price of $57m.",
            "length": "57890608",
            "sourceUrl": "http://feeds.soundcloud.com/stream/711889522-artelligence-adam-lindemann-on.mp3"
        },
        {
            "title": "Fantasy Art Collecting Tips from Christie's Johanna Flaum",
            "datePublished": "Thu, 07 Nov 2019 02:27:33 +0000",
            "description": "AMM Fantasy Art Collecting game is live now for the November auctions. Entries will be accepted until 9pm on Nov 10th at fantasy.artmarketmonitor.com. In this podcast, Christie's Johanna Flaum, a past winner of the game, joins us at CORE Club to talk about strategies for playing the fantasy collecting game and give us an overview of the November 2019 New York sales season.",
            "length": "44444652",
            "sourceUrl": "http://feeds.soundcloud.com/stream/708904870-artelligence-fantasy-art-collecting-tips-from-christies-johanna-flaum.mp3"
        },
        {
            "title": "Sean Kelly Collect Wisely",
            "datePublished": "Thu, 17 Oct 2019 14:15:02 +0000",
            "description": "This podcast is a partnership with Sean Kelly Gallery to promote their Collect Wisely program which is a series of podcasts in which Sean Kelly interviews prominent international collectors on the nature of collecting and connoisseurship in the 21st century. These conversations aim to inspire a new generation of individuals committed to making a vital and meaningful investment in our common cultural future.\n\nTo subscribe to Collect Wisely, please visit Anchor, SoundCloud, Spotify, Apple Podcasts and other podcast hosting platforms, or through Sean Kelly's website: skny.com/collect-wisely\n\nSean Kelly will have an exhibition at the gallery in the summer of 2020 which will have a publication the following year.\n\nJoin the conversation, subscribe to the podcast and leave a review.",
            "length": "53004247",
            "sourceUrl": "http://feeds.soundcloud.com/stream/685838947-artelligence-sean-kelly-collect-wisely.mp3"
        },
        {
            "title": "Art in America's Editor in Chief William Smith at CORE Club",
            "datePublished": "Mon, 16 Sep 2019 14:13:12 +0000",
            "description": "Art in America's Editor in Chief, William Smith, talks about the redesigned magazine, the launch of two newsletters—one featuring a daily review from the magazine's critics and one on the subject of Art & Technology—as well as Theaster Gates's Portfolio project featuring images from the Johnson Publishing Archives and W.E.B. Dubois's early 20th Century infographics about African American life, and his own essay on the artist KAWS and what Smith calls the long 1990s.",
            "length": "53521218",
            "sourceUrl": "http://feeds.soundcloud.com/stream/680373206-artelligence-art-in-americas-editor-in.m4a"
        },
        {
            "title": "Phillips's Deputy Chairman Jean-Paul Engelen",
            "datePublished": "Mon, 13 May 2019 19:11:53 +0000",
            "description": "Jean-Paul Engelen discusses Phillips's position in the new global auction marketplace, its recent additions of highly experienced specialists in Impressionst, Modern and American art, and the new exhibition space, \"The Cube,\" at 432 Park Avenue.\n\nJean-Paul Engelen is the Deputy Chairman and Worldwide Co-Head of 20th Century & Contemporary Art. He joined Phillips in August of 2015 and is based in New York. \n\nWith over two decades of market experience and working with artists, Engelen was Director of Public Art Programs at Qatar Museums beginning in 2011. In this role he was responsible for a significant public art installation program, the establishment of an Artist in Residence program and space, and Contemporary Art exhibitions and working with contemporary artists on notable exhibitions including Damien Hirst, Richard Serra, Cai Guo Qiang, and Takashi Murakami. \n\nEngelen also oversaw over three dozen site-specific public art installations including “East West West East” by Richard Serra, “The Miraculous Journey” by Damien Hirst, “Salwa Road Murals” by eL Seed, and “Untitled (Playground)” by Tom Otterness.",
            "length": "54833006",
            "sourceUrl": "http://feeds.soundcloud.com/stream/620061300-artelligence-phillipss-jean-paul-engelen.m4a"
        },
        {
            "title": "To Repel Ghosts: Jean-Michel Basquiat's Self Portrait from the Collection of Matt Dike",
            "datePublished": "Thu, 02 May 2019 15:32:21 +0000",
            "description": "In this podcast made in collaboration with Phillips, Scott Nussbaum, head of 20th Century and Contemporary Art at Phillips, New York and Fred Hoffman, curator of a seminal Basquiat retrospective and author of The Art of Jean-Michel Basquiat, talk about Matt Dike's relationship to the artist, their work together in Los Angeles in the 1980s, their friendship around music and the gifts of art Basquiat made to Dike.\n\nChief among those gifts was the self portrait painted on two doors and a panel that will be sold during Phillips May 16th Evening sale in New York. Moved directly from Basquiat's studio to Dike's home, the work is a rare example of Basquiat's art never to have been sold before, as Fred Hoffman explains in his catalogue essay for Phillips:\n\n\"As one of Jean-Michel Basquiat’s most compelling depictions of himself, Self Portrait, 1983 presents a metaphysical subject on two related panels. The full-length representation of the artist is juxtaposed with an adjacent panel portraying both his personal incantation, “To Repel Ghosts”, and his characterization of the passage from the material to the eternal. Self Portrait is unique, having been executed on two found doors, one which also includes an attached plywood panel. This singular painting was executed in Venice, California sometime in 1983 at New City Editions, the print studio where Basquiat produced his now acclaimed silkscreen works, Tuxedo, 1983, Untitled, 1983 and Back of the Neck, 1983. The creation of this painting is recorded in filmmaker Tamra Davis’ acclaimed documentary, The Radiant Child, possibly the only extant film documentation of Basquiat working on a painting. \n\nAs conveyed to the author by Tamra Davis, after having completed the work, Jean-Michel Basquiat and Tamra Davis moved the work to the studio of Matt Dike in West Hollywood. The work is also documented in Tamra Davis’ 1988 promotional video for Matt Dike’s record label Delicious Vinyl, in which Matt Dike and his business partner Mike Ross are filmed sitting on a couch with Self Portrait in the background.\"",
            "length": "73604708",
            "sourceUrl": "http://feeds.soundcloud.com/stream/614638575-artelligence-to-repel-ghosts-podcast.m4a"
        },
        {
            "title": "Christie's Education Panel: Selling Art in the Digital Age",
            "datePublished": "Thu, 14 Feb 2019 15:07:10 +0000",
            "description": "Vivian Brodie, Christie's Head of Mid-Season and Online sales; Elena Soboleva, Director of Online Sales, David Zwirner; and Sam Orlofsky, Director, Gagosian discuss their experiences extending sales from their globally branded enterprises into the digital domain. \n\nAmong the topics we cover in this panel discussion is the different ways that Christie's, Zwirner and Gagosian have come to selling digitally; how the sales process is integrated into the larger pattern of client acquisition and sales; who benefits internally from digital sales and how the companies are charting a path forward.",
            "length": "132889759",
            "sourceUrl": "http://feeds.soundcloud.com/stream/574717377-artelligence-christies-education-panel.m4a"
        },
        {
            "title": "Who Was Henry Geldzahler?--A Conversation with Randall Bourscheidt",
            "datePublished": "Mon, 04 Feb 2019 20:37:26 +0000",
            "description": "On Thursday 7 February, Randall Bourscheidt and Vincent Fremont will join Peter Brant and Gary Tinterow in a panel discussion about Henry Geldzahler at Christie’s New York, 20 Rockefeller Plaza. The event will be chaired by Marc Porter, Chairman of Christie’s Americas. \n\nThis conversation with Randall Bourscheidt explores some of the themes of Geldzahler's life: His role at the Metropolitan Museum during the height of New York's art market ferment; Geldzahler's friendships with Andy Warhol and David Hockney; his experiences as New York City's Cultural Commissioner; his eventual retreat to the Hamptons and his early death from liver cancer.",
            "length": "58731543",
            "sourceUrl": "http://feeds.soundcloud.com/stream/570103770-artelligence-who-was-henry-geldzahler-a-1.mp3"
        },
        {
            "title": "Asher Edelman on Auction Guarantees and Art Market Liquidity",
            "datePublished": "Mon, 10 Dec 2018 17:28:04 +0000",
            "description": "Asher Edelman has a long history participating in the art market and as a transformative player on Wall Street. From his perspective as an investor, art dealer and provider of art financing through his company Art Assure, Edelman talks through the effect of guarantees on the auctions and the broader market for art.",
            "length": "62764416",
            "sourceUrl": "http://feeds.soundcloud.com/stream/542701758-artelligence-asher-edelman-on-auction.m4a"
        },
        {
            "title": "David Norman on Nov 2018 NY Impressionist and Modern art sales",
            "datePublished": "Wed, 05 Dec 2018 14:20:14 +0000",
            "description": "David Norman discusses the November Impressionist and Modern sales in New York. In particular, Norman looks at the Picasso and Monet markets, the participation of Asian buyers, the bidding patterns on top lots like Edvard Munch's Scream, Alberto Giacometti's Chariot and Pointing Man, the role of guarantees and the right strategy for bringing lots to market in today's guarantee-supported auction environment.",
            "length": "76350773",
            "sourceUrl": "http://feeds.soundcloud.com/stream/539954670-artelligence-david-norman-on-nov-2018-ny.m4a"
        },
        {
            "title": "Hugues Joffre, Senior Advisor to the CEO of Phillips",
            "datePublished": "Thu, 08 Nov 2018 13:49:13 +0000",
            "description": "Three years ago, after a career at Christie's and as a private advisor, Hugues Joffre took over the task of establishing a Modern art department within Phillips, auction house noted for its expertise in cutting edge artists. \n\nIn this podcast, Joffre talks about the process of winning the kinds of 20th Century consignments that would help drive Phillips' sales totals higher and position the auction house as a peer and alternative to Sotheby's and Christie's not only in Contemporary art but also in the art of the 20th Century.\n\nAlong the way, Joffre comments on the way young collectors develop and broaden their tastes, the future of the art market and the taste of the great Greek shipping collectors of the 60s and 70s.",
            "length": "73695304",
            "sourceUrl": "http://feeds.soundcloud.com/stream/526593969-artelligence-hugues-joffre-phillips.m4a"
        },
        {
            "title": "Magnus Renfrew on Taipei Dangdai",
            "datePublished": "Mon, 29 Oct 2018 14:04:47 +0000",
            "description": "Magnus Renfrew launches his new fair Taipei Dangdai in Taiwan on January 18, 2019. The fair features 90 galleries from Asia, Europe and North America. Dealers David Zwirner, Thaddaeus Ropac, Edouard Malingue, Gagosian, Gallery Hyundai, Kukje, Lisson, Massimo de Carlo, Whitestone, White Cube, Tomio Koyama, Tang Contemporary, Spruth Mägers, Sadie Coles, Sean Kelly, Simon Lee , Perrotin, Pearl Lam and Longmen Art Projects are among the participants.",
            "length": "50682890",
            "sourceUrl": "http://feeds.soundcloud.com/stream/520022337-artelligence-magnus-renfrew-on-taipei.m4a"
        },
        {
            "title": "Jim Carona of Heather James Gallery",
            "datePublished": "Thu, 02 Aug 2018 14:45:19 +0000",
            "description": "Since its founding in Palm Desert, California, Heather James Gallery has carved a particular niche in the art market catering to wealthy residents of a fabled community of vacation homes. The formula has clearly worked. Heather James now has galleries in Jackson, Wyoming, San Francisco, New York and will open a new gallery in Montecito this Fall. \n\nIn this podcast, Jim Carona walks through the history of the gallery and the secret of its expansion. He explains the philosophy behind their eclectic program and the appeal of art to his constituency.",
            "length": "72009810",
            "sourceUrl": "http://feeds.soundcloud.com/stream/480148734-artelligence-jim-carona-of-heather-james.m4a"
        },
        {
            "title": "Megan Fox Kelly, Todd Levin and William O'Reilly on Giving Advice in the Global Art Market",
            "datePublished": "Mon, 16 Jul 2018 11:35:04 +0000",
            "description": "As part of an international program to celebrate the gallery’s 25th Anniversary, Dickinson held a panel discussion at their New York space during Spring TEFAF. Conversation centered on the multiplicity of sources of advice in the art market and how collectors can be best served as they seek to acquire art.\n\nOn the panel are Megan Fox Kelly, President of the Association of Professional Art Advisors and an advisor with a broad practice that includes helping new collectors to find their bearings in the art market and advising artist's estates and foundations on a market-facing strategy; Todd Levin, who has built noteworthy collections that have achieved verifiable market successes as well as curated his own shows at various galleries in New York, Los Angeles and Berlin; and William O'Reilly, Senior Director with Dickinson in New York where he works with collectors of Old Master through to Contemporary Art.\n\nThe lively conversation explores the relationship between advisors, collectors and the art market ecosystem, and the joys and pitfalls of building a collection.",
            "length": "127617155",
            "sourceUrl": "http://feeds.soundcloud.com/stream/471274614-artelligence-dickinson-panel-during-tefaf.m4a"
        },
        {
            "title": "Christie's Art + Tech Summit with Elliot Safra",
            "datePublished": "Fri, 06 Jul 2018 18:08:57 +0000",
            "description": "Elliot Safra describes Christie's Art + Tech Summit taking place on July 17th in London. The full-day conference will explore the many hoped for uses of block chain technology in the art market. \n\nSafra explains that the tech summit is meant to appeal to a broad range of constituents from attracting technology investors who might learn more about the art world to creating a showcase for technology companies launched to solve art market constraints to offering the art industry a place to come together and discuss the challenges and opportunities for selling art in the 21st Century.\n\nArt dealers, auction house staff, technology investors and entrepreneurs are all expected at this year's summit. For more information: http://www.christies.com/art-and-tech",
            "length": "40902077",
            "sourceUrl": "http://feeds.soundcloud.com/stream/468082119-artelligence-christies-art-tech-conference.m4a"
        },
        {
            "title": "Bloomberg's James Tarmy on Art Basel 2018",
            "datePublished": "Wed, 27 Jun 2018 15:25:16 +0000",
            "description": "Bloomberg art market reporter James Tarmy spent the better part of a week swimming in the aisles of Art Basel in Switzerland, the world's premier art fair where many of the top galleries not only make important sales but set the tone for their client base and communicate their view of the art market and its opportunities. \n\nBasel isn't only about sales, as Tarmy explains. The city's museums put on influential shows like the Sam Gilliam retrospective or the Beyeler Foundation's Francis Bacon-Alberto Giacometti show. Then, of course, there are the dinners.",
            "length": "59165221",
            "sourceUrl": "http://feeds.soundcloud.com/stream/464159472-artelligence-bloombergs-james-tarmy-on-art.m4a"
        },
        {
            "title": "Thaddaeus Ropac",
            "datePublished": "Mon, 11 Jun 2018 12:48:19 +0000",
            "description": "Thaddaeus Ropac opened his first gallery in Salzburg, Austria after having met and been inspired by Joseph Beuys in Berlin and having become acquainted Andy Warhol, Jean-Michel Basquiat, Keith Haring and Robert Mapplethorpe while in New York. He expanded to Paris in the depths of the global art market recession in 1990. In 2012, Ropac expanded in Paris; and, again, in 2017, he opened in London. Along the way, Ropac began to represent Georg Baselitz, Alex Katz, Anselm Kiefer and dozens of other artists and estates. Most recently, Ropac completed the circle by taking over representation of the Beuys estate.",
            "length": "99007489",
            "sourceUrl": "http://feeds.soundcloud.com/stream/456618147-artelligence-thaddaeus-ropac-1.m4a"
        },
        {
            "title": "David Norman on Rockefeller & NY Imp-Mod, May 2018",
            "datePublished": "Tue, 05 Jun 2018 13:32:29 +0000",
            "description": "David Norman applies his 30+ years experience in the Impressionist and Modern category to the results from this May's sales in New York where $1.5bn in Modern and Impressionist art was sold. As a result, this season the Impressionist and Modern category returns to a pride of place as the biggest market, a stature it has not held for a decade.\n\nThe season was packed with stories from the Rockefeller Estate which featured an extraordinary concentration of Impressionist pictures from artists like Monet, Picasso, Gauguin, Henri Matisse, Juan Gris, Ferdnand Léger, and Georges Seurat. \n\nThe biggest, and some of the most impressive, sales came from the Impressionist and Modern Evening sales where works by Modigliani, Kazimir Malevich and Constantin Brancusi set new benchmarks.\n\nEven with those successes and the stratospheric sales totals, the sales results do show that nearly a decade of uninterrupted growth in art prices may be beginning to have an effect on the market. Buyers and sellers are increasingly having a standoff over estimates and expectations. \n\nThe Impressionist and Modern market is strong but picky. David Norman explains why.",
            "length": "108784861",
            "sourceUrl": "http://feeds.soundcloud.com/stream/453728277-artelligence-david-norman-on-rockefeller-ny.m4a"
        },
        {
            "title": "Marc Porter: Behind the Scenes at the Rockefeller Sale",
            "datePublished": "Tue, 03 Apr 2018 11:22:47 +0000",
            "description": "The Peggy and David Rockefeller collection is likely to be the most valuable single-owner sale in history. The great breadth of the Rockefeller collection—with extraordinary examples of French, German and American painting—furniture, ceramics and other decorative objects—will be on view at Christie's Rockefeller Center headquarters in late April with a series of auctions held the first week in May. \n\nIn this podcast, Marc Porter, Chairman of Christie's Americas, discusses the unique opportunities and challenges of organizing and marketing the estate of one of the world's most famous families. From China to Europe to the Gulf States to the UK and America, Christie's has tailored its marketing and publicity to the attributes of the Rockefeller family and the collection that are key to exciting the interest of each of these distinct populations.\n\nPorter goes further to tell some of the history of the Rockefeller's collecting experiences and the goals of the estate.",
            "length": "103309359",
            "sourceUrl": "http://feeds.soundcloud.com/stream/421814649-artelligence-marc-porter-on-peggy-and-david.m4a"
        },
        {
            "title": "Lock Kresler on Lévy Gorvy's Source and Stimulus",
            "datePublished": "Mon, 19 Mar 2018 16:10:11 +0000",
            "description": "Lock Kresler discusses Lévy Gorvy's exhibition, 'Source and Stimulus' open until April 21, 2018 at 22 Old Bond St in London. The show features a series of outstanding museum quality loans and seminal examples of works by all three artists in the exhibition including Roy Lichtenstein’s ‘Frightened Girl’ (1964), being seen publicly for the first time in 25 years having been hidden away in a private collection in Europe since its last public display in 1993, when it was shown in the artist’s retrospective at the Guggenheim Museum in New York.\n\nLévy Gorvy is also exhibiting Sigmar Polke’s ‘Untitled (Couple)’ (1965-66), which was purchased directly from the artist and has never been seen publicly or published before, and ‘Girlfriends’ (1964-65), which featured prominently in Polke’s retrospectives in 2014 at New York’s Museum of Modern Art and London’s Tate Modern.\n\nThe exhibition also sees two paintings by Gerald Laing reunited for the first time since they were created in 1965. ‘Shout’ and ‘Rain Check’ were sold the same year by Richard Feigen to two different collectors in the US, and neither work has been seen publicly since then.\n\nIn addition, Lévy Gorvy has a video (https://youtu.be/_9tFL9b1LDI)about the exhibition and you can see images of the show on the gallery's website (https://www.levygorvy.com/exhibitions/source-and-stimulus-polke-lichtenstein-laing/).",
            "length": "56597257",
            "sourceUrl": "http://feeds.soundcloud.com/stream/416006607-artelligence-lock-kresler-on-levygorvys.m4a"
        },
        {
            "title": "Mark Lurie on Codex, the Blockchain and the Art Market",
            "datePublished": "Wed, 07 Feb 2018 17:56:04 +0000",
            "description": "Mark Lurie is the founder of Lofty, a seller of art and collectibles online that he sold a little over a year ago. Since then, Mark, who has worked as a venture captialist as well as a founder, saw the natural fit between the art market and blockchain technology. His new venture Codex seeks to create an title registry for the art market. But Codex is more than that. It seeks to be a foundational technology for many different businesses and services in the art market. In this podcast, Mark explains his vision of the future of the art market and how we'll get there.",
            "length": "57424431",
            "sourceUrl": "http://feeds.soundcloud.com/stream/395483298-artelligence-mark-lurie-podcast.m4a"
        },
        {
            "title": "James Tarmy on Contemporary Artists and Their Markets",
            "datePublished": "Mon, 29 Jan 2018 03:15:57 +0000",
            "description": "Bloomberg's art market reporter, James Tarmy, discusses the unexpected corners of the Contemporary art market by looking at six different artists and their markets. They range from Lawrence Abu Hamdan who has strong support from museums and other institutions but no real market to John McAllister whose work thrives without much fanfare. In between, Tarmy looks at Laura Owens, Lynette Yiadom-Boakye and Michael Krebber, all artists who have thriving but very different market trajectories. Each of these case studies attempts to ask how we can identify an artist whose work and reputation will last.",
            "length": "56591911",
            "sourceUrl": "http://feeds.soundcloud.com/stream/390614907-artelligence-james-tarmy-on-contemporary.m4a"
        },
        {
            "title": "David Norman on Fall 2017 Impressionist and Modern Auctions",
            "datePublished": "Thu, 11 Jan 2018 18:47:01 +0000",
            "description": "David Norman talks through the results from November's Impressionist and Modern auctions in New York. Norman discusses the use of guarantees, the differences between the public and private markets, the relative strength of different types of work by Pablo Picasso, the tastes of Asian buyers and the impact of private museums on that Modern market.",
            "length": "96385868",
            "sourceUrl": "http://feeds.soundcloud.com/stream/382057439-artelligence-david-norman-on-fall-2017.m4a"
        },
        {
            "title": "Cheyenne Westphal, Chairman, Phillips",
            "datePublished": "Thu, 14 Dec 2017 16:45:34 +0000",
            "description": "Cheyenne Westphal speaks, after two full New York sales cycles with Phillips, about the company's strategy moving forward to carve out a place for itself in a Contemporary and Modern art market dominated by two larger houses.\n\nSpeaking a few days before the November Evening sale, Westphal talks about attracting buyers and sellers, the increased use of guarantees, collectors' interest in identifying new artists and the use of shows with unexpected focus to bring attention to historically undervalued art.",
            "length": "73258935",
            "sourceUrl": "http://feeds.soundcloud.com/stream/369273827-artelligence-cheyenne-westphal-chairman.m4a"
        },
        {
            "title": "Bendor Grosvenor on Leonardo's Salvator Mundi",
            "datePublished": "Wed, 29 Nov 2017 15:16:44 +0000",
            "description": "The $450m sale of Leonardo da Vinci's Salvator Mundi was surrounded by a the near constant repetition of the erroneous idea that there are doubts about the work's authenticity. From news reports to essays by Contemporary art critics miffed at the growing spectacle, writers ignored the consensus among scholars and scientific researchers that the work is the lost work of the Renaissance master.\n\nIn this podcast, Bendor Grosvenor, an Old Master dealer credited with numerous 'sleeper' finds and the host of \"Britain's Lost Masterpieces,\" discusses the 2011 National Gallery show on Leonardo that admitted the Salvator Mundi into the canon of the few recognized works by the artist.\n\nGrosvenor also addresses the tone of the Old Masters market, his hopes that this sale will remind art collectors of the enduring popularity of Old Master paintings and spur more attention to the field.",
            "length": "70003976",
            "sourceUrl": "http://feeds.soundcloud.com/stream/362310827-artelligence-bendor-grosvenor-on-leonardos.m4a"
        },
        {
            "title": "Michael FIndlay on Seeing Slowly",
            "datePublished": "Tue, 17 Oct 2017 18:00:42 +0000",
            "description": "Michael Findlay, the author of The Value of Art, has a new book out about changing the way we approach a work of art. In Seeing Slowly, Findlay suggests we put our experience of the art itself first. Ignore the wall labels, avoid pontificating to your companion and simply look at the art informed by own connoisseurship, the experience of having looked at art in the past, and your own cultural awareness. \n\nIn this podcast, Findlay explains what he means and why he thinks we would all be better off approaching art this way. Then he talks about Instagram and the way that the business of selling art has changed—and how buyers and sellers would benefit from seeing slowly.",
            "length": "115836648",
            "sourceUrl": "http://feeds.soundcloud.com/stream/347340025-artelligence-michael-findlay-on-seeing.m4a"
        },
        {
            "title": "Nicholas and Alex Logsdail on Lisson Gallery's 50 yrs",
            "datePublished": "Tue, 26 Sep 2017 14:20:51 +0000",
            "description": "Nicholas Lisson on his philosophy of running an enduring gallery business: \"The money will come if the art is good enough.\" \n\nLisson Gallery's father-son duo Nicholas and Alex Logsdail discuss the history of their gallery, its more than 500 exhibitions over 50 years now only partially captured in a book of 1,200 pages.\n\nIn this intimate conversation between Elena Platonova and the Logsdails we learn about the path both men took from pursuing their own artistic visions—Nicholas as a painter; Alexander as a musician—to running a transatlantic gallery. We hear about their plans for further global expansion and their own fifty-year rule for gauging the quality of an artist.",
            "length": "68155747",
            "sourceUrl": "http://feeds.soundcloud.com/stream/344108969-artelligence-nicholas-and-alex-logsdail-on.m4a"
        },
        {
            "title": "Lisanne Skyler, Producer of \"Brillo Box (3¢ Off)\" on HBO",
            "datePublished": "Mon, 14 Aug 2017 18:56:03 +0000",
            "description": "Lisanne Skyler's parents were art collectors in the 1970s. Her father was a young lawyer in Manhattan who spent his weekends going to gallery shows looking for exciting young artists. To buy new paintings he often had to sell the works he already owned. That's how he came in 1969 to buy from the OK Harris gallery a small yellow Brillo Box sculpture made by Andy Warhol. Two years later, Skyler sold the work to buy a drawing by another artist who, at the time, seemed like he was going to have a career that would eclipse the faltering Warhol's. \nOver time, the Skylers' Brillo Box passed through the hands of collectors like Charles Saatchi and other anonymous figures before landing among the possessions of Robert Shapazian, a noted gallerist who ran Gagosian in Los Angeles. When Shapazian's estate was sold at Christie's in 2010, the little yellow Brillo Box made $3m, a shock to Lisanne Skyler who was now an adult. \nCurious about her family's glancing role in the art world, Lisanne made a documentary film now available on HBO. Brillo Box (3¢ Off) is not just about the sculpture's journey from her childhood living room to the auction block at Christie's but about how and why her parents collected art; what became of the works they owned and the stress art collecting eventually placed on their marriage.\nIn this podcast, Lisanne Skyler talks about the role art played in her parents marriage, their personal evolution and the family that they raised.",
            "length": "55453149",
            "sourceUrl": "http://feeds.soundcloud.com/stream/337863259-artelligence-lisanne-skyler-producer-of.m4a"
        },
        {
            "title": "Amy Cappellazzo on Barkley Hendricks",
            "datePublished": "Mon, 26 Jun 2017 12:56:05 +0000",
            "description": "Amy Cappellazzo talks about her record setting sales of three works by Barkley Hendricks, the recently deceased artist whose unique portrait style, developed in the 1960s and 70s, has been gaining attention for the last decade since the Nasher Museum held a retrospective of his work called, The Birth of Cool.\n\nIn this podcast, Cappellazzo talks about having encountered the artists work and then getting the rare opportunity a few decades later to sell three works from one collection as it came to market. \n\nFaced with a series of choices about how to position and market the work, Cappellazzo walks us through her thinking and strategy. The record prices ultimately achieved were the product of a combination of cultivating new buyers, personal selling and the value of a sense of discovery.",
            "length": "50179094",
            "sourceUrl": "http://feeds.soundcloud.com/stream/329593166-artelligence-amy-cappellazzo-on-barkley-1.m4a"
        },
        {
            "title": "Timothy Taylor on Alex Katz, Ding Yi and Running a Global Art Gallery",
            "datePublished": "Mon, 05 Jun 2017 16:51:52 +0000",
            "description": "Timothy Taylor has a space in New York that measures 16 x 34 feet. The intimacy of the gallery appealed to his artist Alex Katz who helped create a show around one of his student sketchbooks. The small works set in a small space offer a very different experience of the artist known for his work at scale. \n\nIn this podcast, Timothy Taylor talks about the changing ways in which art dealers must operate to represent their artists well while coping with the constraints of ever-rising retail space rents in major metropolitan centers and the growing interest in art from collectors in far-flung cities across Asia and the West.\n\nTaylor, who has just opened a show of Ding Yi's new work in his London space, has also brought Alex Katz and Sean Scully to China. He sees the way that dealers represent their artists requires thinking creatively and hints that the future of art dealing may already be upon us.",
            "length": "70455380",
            "sourceUrl": "http://feeds.soundcloud.com/stream/326196448-artelligence-timothy-taylor-on-alex-katz.m4a"
        },
        {
            "title": "May 2017 Imp - Mod Recap with Brooke Lampley & David Norman",
            "datePublished": "Thu, 01 Jun 2017 13:12:52 +0000",
            "description": "David Norman, formerly head of the Impressionist and Modern department at Sotheby's, and Brooke Lampley, formerly the head of the same department at Christie's (and scheduled to join Sotheby's in 2018,) get together to discuss the results of the Impressionist and Modern art auctions in May of 2017.\n\nFrom the stunning performance of a number of sculptures to the quandary of Monet's results to the use of guarantees and mix of lots in the Evening sales, Norman and Lampley offer their insights into the sometimes opaque bidding.\n\nThe buyers of Impressionist and Modern art are changing. Their approach and objectives are different from the way in which buyers in the category used to see Impressionist and Modern art. Lampley and Norman illuminate these shifting trends.",
            "length": "110616998",
            "sourceUrl": "http://feeds.soundcloud.com/stream/325427827-artelligence-may-2017-imp-mod-recap-wbrooke-lampley-david-norman.mp3"
        },
        {
            "title": "Stefania Bortolami",
            "datePublished": "Thu, 25 May 2017 17:48:56 +0000",
            "description": "Elena Platonova sits down with Stefania Bortolami to talk about her new gallery in Tribeca, Daniel Buren's show inaugurating the space and her ambitious plan to get art across America including into former fast food outlets.\n\nIn this podcast, Bortolami and Platonova discuss:\n\n*Has Chelsea left galleries no more room for error?\n\n*Will TriBeCa take over from the Lower East Side as the next gallery neighborhood? \n\n*Daniel Buren—\"the Stripe Guy\"—his latest exhibition and his career? \n\n*Her program to bring art exhibitions to cities around the US. Next up, New Haven's remarkable Marcel Breuer masterpiece.",
            "length": "67693430",
            "sourceUrl": "http://feeds.soundcloud.com/stream/324320884-artelligence-stefania-bortolami.m4a"
        },
        {
            "title": "Sam Gilliam interviewed by Jonathan Binstock",
            "datePublished": "Wed, 17 May 2017 12:27:38 +0000",
            "description": "Sirius XM produced this interview between artist Sam Gilliam and Jonathan Binstock, the director of Rochester's Memorial Art Gallery and a Gilliam scholar. \n\nOn the occasion of Gilliam's return to the Venice Biennale 45 years after he represented the United States, this far-ranging conversation covers the artist's entire career. Born in Louisville, Kentucky where Cassius Clay, Sr. (Muhammed Ali's father) was a prominent painter, Gilliam encountered a European refugee Ulfert Wilke at the Louisville and became his studio assistant. \n\nHe also eventually encountered the Gutai artists in Japan, Bob Thompson and moved eventually to Washington, DC where Kenneth Noland was at the center of the Color Field movement and the city was \"a town of connection.\"\n\nThroughout this conversation Gilliam talks of the lifelong struggle to make art and make a life as an artist. His career followed no clear trajectory but has been punctuated by encounters with an endless cast of 20th Century artistic influences culminating in his most recent turn in the center stage.",
            "length": "109757955",
            "sourceUrl": "http://feeds.soundcloud.com/stream/322787773-artelligence-sam-gilliam-interviewed-by.m4a"
        },
        {
            "title": "Mike Tansey and Barry Ellsworth on Art Dealing in Santa Fe",
            "datePublished": "Wed, 10 May 2017 13:19:44 +0000",
            "description": "Santa Fe, NM has long been a center of the visual arts in the United States. For more than a century, modern artists have retreated to the dry climate. The region is also home to a rich array of native and Spanish artists and artisans that have attracted visitors for hundreds of years. \n\nWith a large number of vacation homes and occasional visitors, a long-running international opera that attracts foreign visitors and being a major tourist have made Santa Fe a magnet for art dealers as well as art buyers. \n\nThere are more than 200 galleries in the city spread across four major neighborhoods. SITE Santa Fe, a national and international Contemporary art venue, re-opens in expanded form this Fall.\n\nMike Tansey and Barry Ellsworth are two prominent gallerists in the city, they talk about the culture of art dealing in Santa Fe.",
            "length": "66817940",
            "sourceUrl": "http://feeds.soundcloud.com/stream/321623967-artelligence-santa-fe-barry-ellsworth-mike.m4a"
        },
        {
            "title": "Margit Rowell on Miro's Constellations at Acquavella",
            "datePublished": "Tue, 02 May 2017 20:47:23 +0000",
            "description": "Acquavella galleries has brought together the 23 gouaches in Joan Miró's Constellations series that were last seen together in 1993 at the Museum of Modern Art. \n\nConsidered by many to be the height of Miró's achievement as an artist, these works gain power and impact from being shown all together. Indeed, the condition for many of the loans was that the entire series had to be on view.\n\nThe suite of images was produced between January of 1940 and September of 1941—but it was not until 1958 that André Breton named them “Constellations.\" When Miró and his family fled France for Spain ahead of the German invasion in June of 1940, he took virtually nothing with him apart from the portfolio of his ten completed Constellations. \n\n\"Since they were first exhibited at Pierre Matisse’s gallery in New York in early 1945, after having been smuggled out of Europe, the Constellations have been celebrated as one of the most powerful artistic statements of the 20th century,\" said Bill Acquavella. \n\nMargit Rowell is an art historian and curator who works mostly in Paris and New York. She has held curatorial positions at the Guggenheim Museum in New York, at the Centre Pompidou in Paris, and as curator of drawings at The Museum of Modern Art, New York.",
            "length": "57906727",
            "sourceUrl": "http://feeds.soundcloud.com/stream/320545156-artelligence-margit-rowell-on-miros.m4a"
        },
        {
            "title": "Adam Lindemann on Bernard Buffet: Paintings from 1956-99",
            "datePublished": "Fri, 07 Apr 2017 12:12:46 +0000",
            "description": "Adam Lindemann discusses hisVenus Over Manhattan gallery's presentation of a survey of Bernard Buffet's paintings:\n\nThe exhibition, organized in collaboration with the Estate of Bernard Buffet, marks the first major solo presentation of Buffet’s work in New York in nearly three decades.\n\nWhile Bernard Buffet (b. 1928, Paris, France; d. 1999, Tourtour, France) was once hailed as the next Picasso in France and internationally, the artist’s work has weathered dizzying cycles of acclaim and rejection. Immensely popular – and always commercially successful – at numerous points in his career, Buffet suffered long spells of vicious critical repudiation, when his work was considered the ultimate embodiment of poor taste. But curatorial attention has returned to his oeuvre in the years since his death, culminating in a major retrospective of his work at the Musée d’Art Moderne de la Ville de Paris in 2016, organized by the museum’s director, Fabrice Hergott. At this moment of renewed relevance, Bernard Buffet: Paintings from 1956 to 1999 reintroduces the artist’s oeuvre to a new generation of American viewers, charting a history of the artist’s development through a tightly focused selection of highlights from Buffet’s career.",
            "length": "52938579",
            "sourceUrl": "http://feeds.soundcloud.com/stream/316454556-artelligence-adam-lindemann-on-bernard.m4a"
        },
        {
            "title": "Phillips CEO Edward Dolman",
            "datePublished": "Wed, 29 Mar 2017 17:59:10 +0000",
            "description": "\"This is why Phillips positioning is right. We essentially believe in an international Contemporary art marketplace and we believe most tastes converge at some point.\" ——Edward Dolman, CEO Phillips Auction House\n\nIn the two and a half years since Edward Dolman took over the helm of Phillips auction house, he has been engaged in a remaking of the firm from an upstart auction house focusing on the fringes of the Contemporary art market to a serious alternative to Sotheby's and Christie's with a seat at the table when the biggest art deals are being made.\n\nIn this podcast, Dolman talks about how the expansion of the Contemporary art market has made Phillips's strategy viable and profitable. \n\nHe talks about the new team he has spent the last two years hiring—with leading specialists who decamped from Christie's and Sotheby's—and how their arrival will position the auction house to expand into new collecting fields and penetrate other regions of the world.\n\nHe discusses the growing financialization of the art market and the role guarantees play in facilitating art transactions, especially public ones. Dolman shares his view of the watch, jewelry and collectible markets. Finally, shares his thoughts on the global auction calendar and how that is likely to change in the coming months and years.",
            "length": "76293500",
            "sourceUrl": "http://feeds.soundcloud.com/stream/314788508-artelligence-phillips-ceo-edward-dolman.m4a"
        },
        {
            "title": "David Norman on London's Impressionist & Modern Sales, March 2017",
            "datePublished": "Thu, 23 Mar 2017 13:58:50 +0000",
            "description": "David Norman looks at the results of the March 2017 auctions of Impressionist and Modern art at Sotheby's and Christie's. The surprisingly strong sales came in the context of a nervous art market wondering what the future might hold. \n\nIn part because of that uncertainty, few of the works on offer were considered the kinds of trophies that would motivate bidders to aggressively pursue these works. Nonetheless, they did. Buyers, especially from Asia, were out in force.\n\nAlthough, as Norman points out, the bidding was tactical and sober. Buyers are keen on acquiring works of art but not at any price. \n\nWith that in mind, Norman follows up on the previous sales of many of the works and points out that very few of the works auctioned in this March cycle lacked market exposure.  Some did well against previous prices; others fared poorly. But the market showed that it could distribute familiar material efficiently and with strong prices even if the sales lacked an estate or other fresh material that might excite \"animal spirits.\"",
            "length": "91648687",
            "sourceUrl": "http://feeds.soundcloud.com/stream/313938377-artelligence-david-norman-on-londons.m4a"
        },
        {
            "title": "Simon Hornby of Crozier Fine Art",
            "datePublished": "Wed, 22 Feb 2017 08:16:32 +0000",
            "description": "Art storage is one of the most overlooked aspects of the global art market. Crozier Fine Art is one of the first dedicated art storage firms specializing in storage, transport and transaction support. \n\nSimon Hornby discusses the firm's history and orientation toward serving the needs of collectors, dealers and museums. He also talks about the ways in which the art storage industry has grown into a custodial and service role to enable the new global art dealing that is based in art fairs around the world.\n\nFirms like Crozier provide support to the professionals who manage legal and tax concerns for collectors, dealers and institutions. Finally, Crozier's recent acquisition by Iron Mountain, the document and records storage concern, has initiated a new phase of expansion for Crozier both geographically and into broader areas of tangible asset storage.",
            "length": "81349088",
            "sourceUrl": "http://feeds.soundcloud.com/stream/308235659-artelligence-simon-hornby-of-crozier-fine.m4a"
        },
        {
            "title": "Mnuchin Gallery's Robert Mangold: A Survey 1965-2003",
            "datePublished": "Mon, 13 Feb 2017 22:30:44 +0000",
            "description": "Mnuchin Gallery's founder, Robert Mnuchin, discusses the work of Robert Mangold and his gallery's show, \"Robert Mangold: A Survey 1965-2003.\"\n\nThe exhibition begins with a selection of early works from the 1960s in which the artist inaugurates his mode of tracing hand-drawn geometric figures within the outline of a shaped support, and continues through the 1970s, featuring examples of Mangold’s Circle paintings and A Triangle Within Two Rectangles paintings. In the early 1980s, the geometric forms of the paintings’ interior compositions—in this case, Xs and +s—began to dictate the shapes of the canvases themselves. The show also includes examples of Mangold’s work from the 1990s and 2000s, including the Attic Paintings, the Plane / Figure Paintings, and the Column Paintings, speaking to the evolution of Mangold’s interest in art history.",
            "length": "47195066",
            "sourceUrl": "http://feeds.soundcloud.com/stream/307516079-artelligence-mnuchin-gallerys-robert.m4a"
        },
        {
            "title": "Loretta Wurtenberger  describes turning the Hans Arp estate in a new direction",
            "datePublished": "Wed, 01 Feb 2017 15:08:04 +0000",
            "description": "“Sell as little as possible but as much as necessary.”  --Loretta Wurtenberger on the Arp estate's guiding principle.\n\nLoretta Wurtenberger is one of the founders of the Institute for Artists’ Estates (http://www.artists-estates.com/)and has been managing the estate of Hans Arp since 2009.\n\nThe prospect of managing artists’ estates has become a new topic lately, so we’re presenting the audio of Dr. Wurtenberger’s talk from the Keeping the Legacy Alive conference held in Berlin in September of 2016.\n\nEntitled Back to Square One, Wurtenberger’s talk describes the seven-year odyssey the Hans Arp estate made from controversy over posthumous casts to a vibrant discussion of the artist in the academic world, museums and on the art market.\n\nThe talk begins with a brief biography of Arp, the conditions of  the   from Arp’s death in 1966 through the mismanagement of a German dealer and the controversies surround posthumous castings.\n \nIn 2009, when Wurtenberger took over the the strategic management of the estate, Arp was out of fashion. There was no academic interest; the Catalogue Raisonné was out dated; the last US exhibition of the artist had been in the 1980s; and Arp’s work was undervalued on the art market. \n\nWurtenberger helped the foundation focus on repositioning Arp through sponsoring academic research, enabling museum exhibitions not only of the best known blockbuster works by Arp but also of the lesser known works held by the estate, and by enhancing the artist’s market in Europe and the US.\n\nFinally, Wurtenberger explains that the Arp foundation is not legally allowed to have an endowmen t. So it must sell from its holdings enough each year to cover the annual expenses.",
            "length": "80661748",
            "sourceUrl": "http://feeds.soundcloud.com/stream/305594519-artelligence-loretta-wurtenberger-describes.m4a"
        },
        {
            "title": "Eykyn Maclean's Nicholas Maclean on the Private Market",
            "datePublished": "Thu, 26 Jan 2017 14:24:32 +0000",
            "description": "Nicholas Maclean spent nearly a decade as the co-head of Christie's Impressionist and Modern art department along with his partner, Christopher Eykyn, before opening his own New York and London-based gallery, Eykyn Maclean, 11 years ago.\n\nIn this podcast, Maclean talks about the often overlooked private market where many substantial collectors who do not buy or sell through auction houses conduct a surprising amount of business that potentially dwarves the public art market.\n\nMaclean also talks about the difficulties for dealers in acquiring new work in today's art market where the overall public sales volume has fallen substantially without having an effect of weakening prices. \n\nIn this climate, Maclean points to Italian Pop art as a potential area for collectors to find high quality work at prices that have yet to equalize with the rest of the global art market. \n\nFinally, Maclean shares his thoughts on new collectors and their behavior in the art market.",
            "length": "69471800",
            "sourceUrl": "http://feeds.soundcloud.com/stream/304622641-artelligence-eykyn-macleans-nicholas.m4a"
        },
        {
            "title": "Christy MacLear at Institute for Artist's Estates Conference",
            "datePublished": "Wed, 18 Jan 2017 14:43:46 +0000",
            "description": "Christy MacLear, former Executive Director of the Robert Rauschenberg Foundation, speaks about building the Rauschenberg Foundation at the Institute for Artists Estates Conference in Berlin (http://www.artists-estates.com)last September. Rauschenberg put some thought into his own legacy before he died.  From arts education to the environment, Rauschenberg wanted his Foundation to have an impact on several areas. It was left to MacLear to build a bridge between Rauschenberg’s interests and the community at large. \n\nMacLear emphasizes the importance of understanding a foundation’s assets and creating create a “time horizon” in which goals should be accomplished. MacLear’s task was to understand the artist’s “values,” so she could, in turn, help the heirs and foundation decide what to do with the assets. I\n \nIn addition, the Robert Rauschenberg Foundation chose to make Rauschenberg’s copyright open to public use keeping with their belief in “art as a communicative currency.”",
            "length": "73564212",
            "sourceUrl": "http://feeds.soundcloud.com/stream/303046876-artelligence-christy-maclear-at-institute.m4a"
        },
        {
            "title": "Marisa Kayyem on the Convergence of Art and Fashion",
            "datePublished": "Tue, 10 Jan 2017 20:08:11 +0000",
            "description": "\"It's easier to know what bag to pick up for a lot of people than it is to know what art to pick.\"\n\nMarisa Kayyem, program director for Christie's Continuing Education, talks about the ways in which art and fashion have grown to depend upon each other more and more.\n\nIn this conversation she talks about:\n\n*Why brands are in search of the \"new\" and what they find in art.\n\n*The trend toward luxury retailers using art to create unique spaces.\n\n*Fashion shows as performance art.\n\n* Historical links between fashion and artists like Schiaparelli and Salvador Dalí.\n\n*The controversy surrounding Cecil Beaton's Vogue photoshoot in front Jackson Pollock's work.",
            "length": "66310383",
            "sourceUrl": "http://feeds.soundcloud.com/stream/301865908-artelligence-marisa-kayyem.m4a"
        },
        {
            "title": "David Norman Discusses the November 2016 New York Impressionist and Modern sales",
            "datePublished": "Wed, 04 Jan 2017 14:15:45 +0000",
            "description": "David Norman delves into his 30 years experience as a top specialist in Impressionist and Modern art to discuss in this podcast sponsored by Christie's Education New York the results of the November sales in New York.\n\n*Norman explains the backstory behind Wassily Kandinksy's Rigide et courbé and the not-easy decision to guarantee a post-Bauhaus Kandinsky at that level.\n\n* Norman offers some of the market history behind Edvard Munch's Girls on the Bridge.\n\n*We learn more about how the changing tastes have effected the prices for Monet's gainstacks.\n\n*Also discussed here are many works that were previously offered nearly a generation ago that failed to find buyers but now achieved major prices, as well as surprises for Miro, Chagall, Picasso and others.",
            "length": "102610367",
            "sourceUrl": "http://feeds.soundcloud.com/stream/300755308-artelligence-david-norman-discusses-the.m4a"
        },
        {
            "title": "Judd Tully, Veronique Chagnon-Burke & Marion Maneker on the Future of Auction Houses",
            "datePublished": "Wed, 21 Dec 2016 17:37:43 +0000",
            "description": "This edition of the Artelligence Podcast is the second part of a two-part conversation at Christie's Education between Vernonique Chagnon-Burke, Judd Tully and Marion Maneker.\n\nChagnon-Burke is the director of Christie's Education New York. She organized this panel to discuss the future of auction houses and the current state of the art market for students and guests at Christie's Education's Rockefeller Center location.\n\nThe discussion begins with a general take on the shape of the auction houses' businesses, how they differ and what their strategies going forward appear to be.",
            "length": "68387707",
            "sourceUrl": "http://feeds.soundcloud.com/stream/298859808-artelligence-christies-edu-dec-6-panel-pt-2.m4a"
        },
        {
            "title": "Judd Tully, Veronique Chagnon-Burke & Marion Maneker on Art Basel in Miami Beach",
            "datePublished": "Wed, 14 Dec 2016 16:44:50 +0000",
            "description": "This edition of the Artelligence Podcast is the first part of a two-part conversation at Christie's Education between Vernonique Chagnon-Burke, Judd Tully and Marion Maneker.\n\nChagnon-Burke is the director of Christie's Education New York. She organized this panel to discuss the Art Basel in Miami Beach art fair and the current state of the art market for students and guests at Christie's Education's Rockefeller Center location.\n\nThe discussion begins with a general take on the state of the art market and the tone of the Art Basel fair. Artinfo's Judd Tully gave his impressions of the dealers, their inventory and the booths. \n\nThe discussion includes a brief exploration of the state of the Andy Warhol market and its effect on the broader Contemporary art market.\n\nPart 2 of the discussion focuses on the landscape of the auction houses and their differing strategies.",
            "length": "63594722",
            "sourceUrl": "http://feeds.soundcloud.com/stream/297879861-artelligence-judd-tully-veronique-changon.m4a"
        },
        {
            "title": "Back Stage at Art Basel in Miami Beach",
            "datePublished": "Wed, 07 Dec 2016 14:05:44 +0000",
            "description": "Each year 30,000 visitors arrive in Miami for the Art Basel fair. Many are art dealers and art collectors looking to buy or build relationships. But Art Basel in Miami Beach is also the art market's trade convention or annual Christmas party, take your pick.\n\nIn this podcast, we speak to 8 different attendees about why they come to Art Basel and what they do at the fair. You'll hear from auction house professionals and appraisers, art lawyers and magazine publishers, the creator of Artsy's activation and a museum director.\n\nFeatured in this podcast are:\n\nKenny Schachter: perhaps the only serious collector, dealer and advisor who also writes extensively about the art market. Schachter details his strategy for obsessively extracting every relevant piece of information out of the fair.\n\nElena Soboleva: Elena leads special projects at Artsy and details the year-long planning and execution of Artsy's signature event, this year an immersive experience of VR and music at the Faena Art Time Capsule Geodesic Dome featuring site-specific works by Rachel Rossin, Jon Rafman and Jacolby Satterwhite.\n\nJonathan Binstock: The director of Rochester, NY's Memorial Art Gallery details his trip to the fair with members of his board. He explains how museum groups interact with the fair, the dealers and the subtle negotiations between supporting collectors and furthering the goals of the museum.\n\nNaomi Baigell: Athena Art Finance's head of marketing talks about the fair as a community of like-minded art market professionals who mix the demands of work with a common experience of a career in the art market.\n\nJudd Grossman: The principal of Grossman LLP explains why he's on hand at the art fair to help his clients with the inevitable last-minute legal problems that arise between the myriad of participants in the art market.\n\nMari-Claudia Jimenez: Sotheby's head of Trusts & Estates explains why she arrives earlier and earlier each year to Art Basel in Miami Beach and it matters that art professionals attend.\n\nKimball Higgs: Winston Art Group's Contemporary art appraiser and advisor talks about his strategy for tackling the fair.\n\nLaurent Moïsi: The publisher of Whitewall magazine talks about how Art Basel in Miami Beach has shifted from parties to content as he arranges the distribution of 60,000 magazines to hotel rooms in the days before the fair opens and organizes the Lexus Art Series at the Faena hotel.",
            "length": "79406265",
            "sourceUrl": "http://feeds.soundcloud.com/stream/296522081-artelligence-everybody-goes-to-art-basel.m4a"
        },
        {
            "title": "Gary Nader on Latin American Art",
            "datePublished": "Mon, 21 Nov 2016 14:10:23 +0000",
            "description": "Dealer Gary Nader discusses the future of the Latin American art market. \n\n• The central importance of Latin America's four global masters: Wifredo Lam, Joaquin Torres-Garcia, Fernando Botero and Roberto Matta.\n\n• The history of the Latin American category, why it was invented and how the market needs to move beyond it.\n\n• Museums of Latin American art and the museum infrastructure in Latin America.\n\n• How Central and South American collectors view artists from their own countries and from other countries around the region.\n\n• Who are the generation of artists who happen to be from Latin American countries but are now major global artists.\n\n• The future of Cuban art and artists as the country opens itself to the US and the world.",
            "length": "47391765",
            "sourceUrl": "http://feeds.soundcloud.com/stream/294064242-artelligence-gary-nader-on-latin-american.m4a"
        },
        {
            "title": "Jonathan Miller, CEO Miller Samuel, Inc.",
            "datePublished": "Fri, 11 Nov 2016 12:51:19 +0000",
            "description": "Jonathan Miller, CEO of Miller Samuel, Inc. discusses the intersection of the real estate and art markets. In this podcast, Miller goes into some detail about \n\n•the financing and construction of luxury real estate in New York and Miami\n•the glut of supply in the luxury market of $5m and above\n•the sudden drop in demand at the highest end of the market\n•how real estate markets clear when supply is greater than demand\n•apartments as stores of wealth and which cities predominate",
            "length": "61296742",
            "sourceUrl": "http://feeds.soundcloud.com/stream/292538081-artelligence-jonathan-miller-ceo-miller.m4a"
        },
        {
            "title": "Paul Becker of Art Money",
            "datePublished": "Mon, 07 Nov 2016 11:47:04 +0000",
            "description": "Paul Becker, founder and CEO of Art Money, talks about how Art Money enables art buyers to pay for a work of art from a gallery over 10 months while the gallery owner gets paid in 10 days (helping the gallerist pay the artist sooner too.)\n\nThis art buying model solves a stalemate between buyers—who want to purchase art but feel it is more responsible to pay for the works over time—and sellers who do not want to play the role of a bank.\n\nBecker explains that 90% of his customers can afford to pay for their art upfront but it is a powerful psychological enabler for them to be able to pay over time. \n\nMore important, Becker explains, Art Money takes a widespread practice among art market veterans—paying for a work of art over time—and makes it available to new buyers who may not know that some galleries will over such terms to buyers.\n\n\"We allow people,\" Becker says, \"to say 'Yes!'\"",
            "length": "45199070",
            "sourceUrl": "http://feeds.soundcloud.com/stream/291826385-artelligence-paul-becker-of-art-money.m4a"
        },
        {
            "title": "Jamie Niven",
            "datePublished": "Fri, 21 Oct 2016 11:23:14 +0000",
            "description": "Jamie Niven, the well-known charity auctioneer, discusses his new role at Athena Art Finance, his years in business development at Sotheby's and the loneliness of the auctioneer struggling through a bad sale.",
            "length": "61582200",
            "sourceUrl": "http://feeds.soundcloud.com/stream/289041927-artelligence-jamie-niven.m4a"
        },
        {
            "title": "James Tarmy on Frieze 2016",
            "datePublished": "Fri, 14 Oct 2016 01:12:58 +0000",
            "description": "Bloomberg's James Tarmy discusses sales and the mood at the Frieze art fair.",
            "length": "51596335",
            "sourceUrl": "http://feeds.soundcloud.com/stream/287514429-artelligence-tarmy-on-frieze-2016.m4a"
        },
        {
            "title": "Touria El Glaoui",
            "datePublished": "Mon, 03 Oct 2016 00:41:30 +0000",
            "description": "Touria El Glaoui is the founder and director of the 1:54 Art Fair which opens in London on October 6th. In this podcast, El Glaoui talks about the African collector base for Contemporary African art, the 1:54 Fair's role in developing that collector base further and the future of African Contemporary art within the global art market.",
            "length": "58812823",
            "sourceUrl": "http://feeds.soundcloud.com/stream/285425203-artelligence-touria-el-glaoui.m4a"
        },
        {
            "title": "Allese Thomson & James Tarmy",
            "datePublished": "Fri, 30 Sep 2016 13:37:34 +0000",
            "description": "Allese Thomson, who works with many Contemporary artists as executive producer at Here Be Dragons, and James Tarmy, who covers the art market for Bloomberg, discuss the new Thomas Heatherwick structure being built for Hudson Yards as a \"public\" art project, the current mind-set of Contemporary art collectors as they digest the fruits of the last few years of market frenzy, and the continuing evolution of art fairs in this episode of the Artelligence podcast.",
            "length": "82054268",
            "sourceUrl": "http://feeds.soundcloud.com/stream/285176762-artelligence-thomson-tarmy-1.m4a"
        },
        {
            "title": "Mathias Rastorfer on Wifredo Lam",
            "datePublished": "Mon, 26 Sep 2016 12:08:13 +0000",
            "description": "Galerie Gmurzynska's Mathias Rastorfer talks about Wifredo Lam's legacy in the context of the Tate's new show of the Cuban Modern master. Rastorfer reviews Lam's progress back into the mainstream of the global art market after a sojourn as a Latin American painter. He also reveals the strong connection between Jean-Michel Basquiat and the work of Wifredo Lam.",
            "length": "38579963",
            "sourceUrl": "http://feeds.soundcloud.com/stream/284285016-artelligence-mathias-rastorfer-on-wifredo.m4a"
        },
        {
            "title": "Mary Rozell",
            "datePublished": "Mon, 27 Jun 2016 10:15:10 +0000",
            "description": "Mary Rozell discusses the UBS Art Collection which holds 30,000 works of art in the bank's offices around the world. Rozell's team curates and conserves the art it owns and acquires on the primary market additional works from artists and dealers around the world. \n\nIn this podcast, Rozell discusses the unique nature of UBS's art collection and her thoughts on guiding it into the future.\n\nMary Rozell has been an advisor to collectors, artists and estates on legal and strategic issues relating to the acquisition, management and deaccessioning of private art collections. An art lawyer with a master’s degree in modern art from The Courtauld, she was until recently the Director of Art Business at Sotheby’s Institute of Art – New York. Rozell has also served as the director and/or consultant to several major private art collections, as well as Managing Director of the Swiss Institute – Contemporary Art in New York and Curator/Director of the European Studio Programme for the ACC Galerie in the city of Weimar, Germany. While living in Berlin for almost a decade, Rozell was also the German correspondent for The Art Newspaper, a curator of contemporary art and a consultant to galleries and Villa Grisebach Auctions. She has written and lectured extensively about Berlin’s emerging art scene and architectural landscape, and is the author of numerous journal articles, catalogue essays and translations.",
            "length": "76045085",
            "sourceUrl": "http://feeds.soundcloud.com/stream/262295803-artelligence-mary-rozell.mp3"
        },
        {
            "title": "Inigo Philbrick",
            "datePublished": "Fri, 17 Jun 2016 13:43:41 +0000",
            "description": "Inigo Philbrick discusses his new London gallery show of Rudolf Stingel's \"Instruction Paintings,\" Stingel's market and the vagaries of art dealing.",
            "length": "51465154",
            "sourceUrl": "http://feeds.soundcloud.com/stream/268118323-artelligence-inigo-philbrick.m4a"
        },
        {
            "title": "Heritage Auctions's Leon Benrimon",
            "datePublished": "Wed, 27 Apr 2016 15:16:26 +0000",
            "description": "Leon Benrimon is spearheading Heritage Auction's expansion into Modern and Contemporary art and sales in New York. He speaks here about his focus on the middle market of works ranging in value from $10,000 to $1m, why he thinks that market is going to expand dramatically and Heritage's unique use of the web for bidding and selling.",
            "length": "83600169",
            "sourceUrl": "http://feeds.soundcloud.com/stream/261166202-artelligence-heritage-auctions-leon.m4a"
        },
        {
            "title": "Adam Fields of Arta",
            "datePublished": "Mon, 21 Mar 2016 21:01:19 +0000",
            "description": "Adam Fields is the founder of Arta, the platform for matching galleries and collectors with the appropriate art shipping firm. Arta offers a tool to give quotes on art shipping as well as providing fast and easy access to  competitive bids. (Shiparta.com)",
            "length": "41502492",
            "sourceUrl": "http://feeds.soundcloud.com/stream/253880290-artelligence-adam-fields-of-arta.m4a"
        },
        {
            "title": "Marc Spiegler and Noah Horowitz of Art Basel",
            "datePublished": "Tue, 08 Mar 2016 21:08:45 +0000",
            "description": "Marc Spiegler, Global Director of ArtBasel, and Noah Horowitz, Director Americas, talk about the world's leading art fair, the character of each of the different fairs and how ArtBasel works with galleries to create a massive federation of global galleries.",
            "length": "90088403",
            "sourceUrl": "http://feeds.soundcloud.com/stream/250701950-artelligence-marc-spiegler-and-noah.m4a"
        },
        {
            "title": "Art Basel Salon | Collector Talk: Erling Kagge",
            "datePublished": "Tue, 02 Feb 2016 12:03:01 +0000",
            "description": "Norwegian explorer, book publisher and noted art collector talks about his experiences becoming a collector without access to the art world or a great deal of money.",
            "length": "95609419",
            "sourceUrl": "http://feeds.soundcloud.com/stream/244917378-artelligence-art-basel-salon-erling-kagge.m4a"
        },
        {
            "title": "ArtBasel Salon | In the Age of Volatility with Wilbur Ross, Steven Tananbaum and Jeffrey Deitch",
            "datePublished": "Wed, 20 Jan 2016 14:09:05 +0000",
            "description": "A panel discussion at ArtBasel Miami Beach offering perspectives on the future of the art market as the global economy moves toward significant re-adjustment with Wilbur Ross, Jr., Steven Tananbaum and Jeffrey Deitch.",
            "length": "112123909",
            "sourceUrl": "http://feeds.soundcloud.com/stream/242777871-artelligence-artbasel-miami-beach-in-the.m4a"
        },
        {
            "title": "Robert Heffel",
            "datePublished": "Sat, 21 Nov 2015 17:56:38 +0000",
            "description": "Robert Heffel of Canada's leading auction house, Heffel Fine Art, discusses the firm's Post-War and Contemporary art and Fine Canadian art sales that will take place on November 26, 2015. The Fine Canadian art sale features three important works by Lawren Harris, the Group of Seven artist who was featured at the Hammer Museum in Los Angeles this Fall.",
            "length": "47179151",
            "sourceUrl": "http://feeds.soundcloud.com/stream/233965851-artelligence-robert-heffel.mp3"
        },
        {
            "title": "Mathias Rastorfer of Galerie Gmurzynska on Joan Miro Show",
            "datePublished": "Thu, 08 Oct 2015 14:13:43 +0000",
            "description": "Mathias Rastorfer, CEO and Co-owner of Galerie Gmurzynksa, talks about the survey of Joan Miro's work the gallery has mounted for its 50th Anniversary. The exhibition comprises early, radically abstract-surrealist museum-works such as the 1925 “Circus Horse” or the beautifully-hued 1927 “Peinture;” rarely seen mixed-media “Collage-Drawings” of the 1930s;  a suite of large drawings picturing fantastic biomorphic interpretations on the female figure and on the theme of lovers; and a distinct group of Miró’s commanding anthropomorphic bronze sculptures from the 1960s to 1970s.",
            "length": "56912336",
            "sourceUrl": "http://feeds.soundcloud.com/stream/227378351-artelligence-galerie-gmurzynska-miro-show.m4a"
        },
        {
            "title": "Fred Hills on American Art's Growing International Appeal",
            "datePublished": "Tue, 23 Jun 2015 23:17:56 +0000",
            "description": "Fred Hills and Daisy Sanders of Collisart discuss the growing international demand for American paintings and their experiences at Masterpiece, the London art fair.",
            "length": "57800887",
            "sourceUrl": "http://feeds.soundcloud.com/stream/211689314-artelligence-fred-hills-on-american-arts.m4a"
        },
        {
            "title": "Stavros Merjos",
            "datePublished": "Tue, 09 Jun 2015 19:09:08 +0000",
            "description": "Collector turned private dealer, Stavros Merjos, discusses his love  for the work of Ed Ruscha, hot artists from the 1980s and their markets, LA collectors, Richard Prince and why Warhols are still really, really cheap but won't be forever.",
            "length": "59039226",
            "sourceUrl": "http://feeds.soundcloud.com/stream/209534853-artelligence-stavros-merjos.m4a"
        },
        {
            "title": "Rudiger Weng Launches Weng Contemporary",
            "datePublished": "Wed, 03 Jun 2015 20:13:43 +0000",
            "description": "Rudiger Weng describes the business logic behind his new venture, Weng Contemporary, which hopes to transform the market for prints and multiples by contemporary artists. ",
            "length": "49916828",
            "sourceUrl": "http://feeds.soundcloud.com/stream/208347658-artelligence-rudiger-weng-launches-weng.m4a"
        },
        {
            "title": "The New York May Sales with Judd Tully & Scott Reyburn",
            "datePublished": "Tue, 26 May 2015 11:21:41 +0000",
            "description": "Judd Tully of Art + Auction and Scott Reyburn of the International New York Times discuss the May 2015 cycle of marquee art auctions in New York. With sales totals well above $2bn, Christie's bold move to consolidate sales and its aggressive use of guarantees have pushed the art market into new territory.",
            "length": "106376386",
            "sourceUrl": "http://feeds.soundcloud.com/stream/207271996-artelligence-the-new-york-may-sales-with.m4a"
        },
        {
            "title": "David Heffel on Canadian Art's International Rise",
            "datePublished": "Wed, 20 May 2015 16:24:40 +0000",
            "description": "Heffel holds its Spring sales in Vancouver on May 27th amid growing interest in Canadian art exemplified by the popularity of the Dulwich Picture Gallery's show of Emily Carr and the upcoming Lawren Harris show co-curated by Steve Martin coming to the Hammer Museum.",
            "length": "51730512",
            "sourceUrl": "http://feeds.soundcloud.com/stream/206379262-artelligence-david-heffel.m4a"
        },
        {
            "title": "\"Simon Hantai, Pliage: The First Decade\" at Mnuchin Gallery",
            "datePublished": "Fri, 15 May 2015 15:11:15 +0000",
            "description": "Alfred Pacquement, former director of the Centre Pompidou, Sukanya Rajaratnam of Mnuchin Gallery and Daniel Hantai, discuss the artist's career and his position within the history of abstract painting.",
            "length": "65322352",
            "sourceUrl": "http://feeds.soundcloud.com/stream/205502910-artelligence-simon-hantai-the-first-decade.m4a"
        },
        {
            "title": "Rachel Lehmann & David Maupin of Lehmann Maupin",
            "datePublished": "Tue, 12 May 2015 17:11:22 +0000",
            "description": "Global gallerists Rachel Lehmann and David Maupin discuss artists, collectors and running a gallery with offices on opposite sides of the world serving artists and collectors everywhere in between.",
            "length": "72584317",
            "sourceUrl": "http://feeds.soundcloud.com/stream/205126445-artelligence-lehmann-maupin.m4a"
        },
        {
            "title": "Joshua Roth, United Talent Agency",
            "datePublished": "Wed, 08 Apr 2015 11:24:53 +0000",
            "description": "Joshua Roth, Head of United Talent Agency's new department representing artists, discusses the new options for artists to reach a wider audience through relationships with global brands, his background in a Los Angeles art collecting family, LA's changing art culture and the role for curators in the new global art ecosystem.",
            "length": "64152637",
            "sourceUrl": "http://feeds.soundcloud.com/stream/199679124-artelligence-joshua-roth-united-talent.m4a"
        },
        {
            "title": "Scott Reyburn on TEFAF, Online Sales & Sotheby's New Leadership",
            "datePublished": "Mon, 23 Mar 2015 14:42:45 +0000",
            "description": "Scott Reyburn of the International New York Times discusses the TEFAF art fair, the growth of online art sales and the future of Sotheby's now that a new Chairman has been installed along with his hand-picked CEO.",
            "length": "95462378",
            "sourceUrl": "http://feeds.soundcloud.com/stream/197276761-artelligence-scott-reyburn-on-tefaf-online.m4a"
        },
        {
            "title": "Victor J. Rocco, Herrick Feinstein",
            "datePublished": "Mon, 16 Mar 2015 18:06:54 +0000",
            "description": "Former Federal Prosecutor Victor J. Rocco, now chair of Herrick Feinstein's White Collar Defense and Investigations Practice, discusses what gallery owners should do when faced with a subpoena or questions from law enforcement. Several stories in the press cite the Manhattan District Attorney's office as conducting an investigation of gallery practices around sales tax collection.",
            "length": "46557693",
            "sourceUrl": "http://feeds.soundcloud.com/stream/196177270-artelligence-victor-j-rocco-herrick.m4a"
        },
        {
            "title": "Judd Tully on the Armory Week Shows",
            "datePublished": "Wed, 11 Mar 2015 02:31:45 +0000",
            "description": "In this episode of the Artelligence Podcast Judd Tully talks about the dealers, the fairs (at the piers and on Park avenue) and the sales during this year's Armory Week.",
            "length": "46545344",
            "sourceUrl": "http://feeds.soundcloud.com/stream/195282420-artelligence-judd-tully-armory-shows.m4a"
        },
        {
            "title": "Scott Reyburn on London's Struggling Mega Dealers, Sotheby's Renewed Board Fight & more",
            "datePublished": "Sun, 22 Feb 2015 18:58:43 +0000",
            "description": "The International New York Times's Art Market correspondent, Scott Reyburn, discusses his story on London's private dealers and their struggle with \"buyers\" instead of \"collectors.\" Also, we discuss the Arttactic confidence survey, Marcato's renewed attacks on Sotheby's board, Sotheby's deal with RM Auctions to get a foothold in the classic car market, and much more.",
            "length": "88373812",
            "sourceUrl": "http://feeds.soundcloud.com/stream/192466529-artelligence-scott-reyburn-on-londons.m4a"
        },
        {
            "title": "Inter'l New York Times Art Market Columnist Scott Reyburn on the London Contemporary sales Feb 15",
            "datePublished": "Sun, 15 Feb 2015 17:04:33 +0000",
            "description": "Scott Reyburn discusses the London Contemporary sales and the possibility that the art market has achieved a new, sustainable level; Thorstein Veblen's idea of conspicuous consumption; and the weight of auction catalogues.",
            "length": "55111816",
            "sourceUrl": "http://feeds.soundcloud.com/stream/191273670-artelligence-scott-reyburn-london-cont-215.m4a"
        },
        {
            "title": "Colin Gleadell on London's Imp-Mod Sales; Artnet's Thierry Dumoulin on TEFAF",
            "datePublished": "Mon, 09 Feb 2015 18:01:48 +0000",
            "description": "Colin Gleadell recaps the London Impressionist and Modern sales at Sotheby's and Christie's; Artnet's Director of Marketing, Thierry Dumoulin, explains the site's new partnership with TEFAF.",
            "length": "45993851",
            "sourceUrl": "http://feeds.soundcloud.com/stream/190278903-artelligence-gleadell-london-feb-15-dumoulin-artnet-tefaf.m4a"
        },
        {
            "title": "Hrag Vartanian of Hyperallergic, James Tarmy of Bloomberg and Brian Boucher of Artnet",
            "datePublished": "Wed, 04 Feb 2015 00:51:12 +0000",
            "description": "Hrag Vartanian of Hyperallergic describes his trip to LA for a series of art fairs including the LA Art Book Fair and ArtLA Contemporary; James Tarmy of Bloomberg and Brian Boucher from Artnet News talk about the New York Old Master sales.",
            "length": "52169708",
            "sourceUrl": "http://feeds.soundcloud.com/stream/189373262-artelligence-vartanian-tarmy-boucher.m4a"
        },
        {
            "title": "Patricia Cohen, New York Times & Rob Weisberg, CEO, Invaluable",
            "datePublished": "Tue, 20 Jan 2015 14:57:10 +0000",
            "description": "Patricia Cohen of the New York Times discusses the reaction to her story about private museum tax exemptions; Rob Weisberg describes Invaluable's strategy, its alliances with eBay and Epai in China as well as the growth prospects for art collectibles.",
            "length": "67109608",
            "sourceUrl": "http://feeds.soundcloud.com/stream/186972038-artelligence-patricia-cohen-new-york-times.m4a"
        },
        {
            "title": "Miro and the Modern Market Panel, Part 2",
            "datePublished": "Fri, 09 Jan 2015 21:01:10 +0000",
            "description": "This section of the September 2011 Artelligence Modern Market panel opens with Helly Nahmad explaining how Chinese buyers came to collect Giorgio Morandi (pictured) paintings and continues to explore the artists Guy Bennett, Nicholas Maclean and Nicholas Acquavella saw as worth buying and holding.",
            "length": "67952227",
            "sourceUrl": "http://feeds.soundcloud.com/stream/185270842-artelligence-modern-market-panel-part-2.m4a"
        },
        {
            "title": "Olyvia Kwok",
            "datePublished": "Tue, 16 Dec 2014 22:08:02 +0000",
            "description": "Olyvia Kwok is the principal of Willstone Management, an art investment and advisory firm in London and New York. Here, Kwok discusses her business and her views on artists and the art market.",
            "length": "51514702",
            "sourceUrl": "http://feeds.soundcloud.com/stream/181839704-artelligence-olyvia-kwok.m4a"
        },
        {
            "title": "NY Cont Nov 2014",
            "datePublished": "Mon, 17 Nov 2014 04:10:31 +0000",
            "description": "NY Cont Nov 2014 by Artelligence Podcast",
            "length": "41787900",
            "sourceUrl": "http://feeds.soundcloud.com/stream/177275593-artelligence-ny-cont-nov-2014.m4a"
        },
        {
            "title": "Judd Tully Post-NY IM Conversation",
            "datePublished": "Mon, 10 Nov 2014 17:35:43 +0000",
            "description": "Marion Maneker & Judd Tully discuss the previous week's round of Impressionist and Modern sales.",
            "length": "55933766",
            "sourceUrl": "http://feeds.soundcloud.com/stream/176252826-artelligence-judd-tully-post-ny-im.m4a"
        },
        {
            "title": "Miro and the Modern Market with Guy Bennett, Nicholas Acquavella, Nicholas Maclean and Helly Nahmad",
            "datePublished": "Mon, 03 Nov 2014 00:52:35 +0000",
            "description": "The panel discussion originally took place in September of 2011 at the Artelligence conference. Guy Bennett, Nicholas Acquavella, Nicholas Maclean and Helly Nahmad discuss various aspects of the market but the conversation focuses on the prices achieved for Joan Miró.",
            "length": "43981010",
            "sourceUrl": "http://feeds.soundcloud.com/stream/175068727-artelligence-miro-and-the-modern-market.m4a"
        },
        {
            "title": "Mnuchin Gallery Frieze Masters Show of David Smith, The Forgings",
            "datePublished": "Tue, 30 Sep 2014 21:14:06 +0000",
            "description": "Peter Stevens, Executive Director of the David Smith Estate, joins Robert Mnuchin and Sukanya Rajaratnam of Mnuchin Gallery to discuss their show at Frieze Masters of David Smith, The Forgings.",
            "length": "48118993",
            "sourceUrl": "http://feeds.soundcloud.com/stream/170081936-artelligence-mnuchin-gallery-frieze-masters.m4a"
        },
        {
            "title": "Alexander Zacke, Auctionata",
            "datePublished": "Mon, 15 Sep 2014 17:04:30 +0000",
            "description": "Alexander Zacke, Auctionata by Artelligence Podcast",
            "length": "33638108",
            "sourceUrl": "http://feeds.soundcloud.com/stream/167850561-artelligence-alexander-zacke-auctionata.mp3"
        },
        {
            "title": "Peter Loughrey, Los Angeles Modern Auctions",
            "datePublished": "Sat, 06 Sep 2014 18:10:21 +0000",
            "description": "Peter Loughrey is an established curator, trusted consultant, and a well-recognized expert in Modern Design & Fine Art. He is a prominent figure in the Los Angeles Modern Art & Design community through his involvement at LACMA as a member of the Decorative Arts and Design Council and Contemporary Friends, as well as his contributions to Taschen books. Not only is he a repeat appraiser on PBS’s “Antiques Roadshow”, but he has also been featured on Forbes’ “Sold!” on Ovation TV.\n\nPeter co-curated many Los Angeles gallery shows, including “Gio Ponti: Furnished Settings & Figuration” (2004) and “Dutch Design” (2005), both at ACME Gallery, in addition to co-curating and publishing a catalog for “Gaetano Pesce: Pieces from a Larger Puzzle” at Los Angeles’ Italian Cultural Institute (2010). He has also written numerous articles and was a contributor in the books Case Study Houses (Taschen 2003), Julius Shulman Modernism Rediscovered (Taschen 2007), and Collecting Design (Taschen 2010).  He was named one of the 50 most powerful dealers in the Art + Auction “Power Issue” for two consecutive years.",
            "length": "28146124",
            "sourceUrl": "http://feeds.soundcloud.com/stream/166520759-artelligence-peter-loughrey-los-angeles-modern-auctions.mp3"
        },
        {
            "title": "Steve Lazarides, Street Art Pioneer",
            "datePublished": "Thu, 10 Jul 2014 19:24:51 +0000",
            "description": "Curator of BANKSY The Unauthorised Retrospective on view at Sotheby's in London and owner of Lazarides, Steve Lazarides talks about the \"street art\" market, Banksy and future of this global style.\r\n\r\nwww.lazinc.com\r\n\r\nInstagram - Lazarides\r\nFacebook - https://www.facebook.com/Lazinc\r\nTwitter- @Lazarides_Art",
            "length": "42269801",
            "sourceUrl": "http://feeds.soundcloud.com/stream/158149521-artelligence-steve-lazarides.mp3"
        },
        {
            "title": "Richard Wright",
            "datePublished": "Mon, 09 Jun 2014 18:42:42 +0000",
            "description": "Richard Wright, founder of the design and Contemporary art auction house Wright, speaks about his 14 years in the business, the growth of the design market and his expansion to New York.",
            "length": "41663552",
            "sourceUrl": "http://feeds.soundcloud.com/stream/153585639-artelligence-artelligence-richard-wright.mp3"
        },
        {
            "title": "Loretta Würtenberger",
            "datePublished": "Mon, 02 Jun 2014 20:06:39 +0000",
            "description": "Dr. Loretta Würtenberger of Fine Art Partners discusses her firm's role in providing financing to dealers for secondary market transactions and fabrication for the primary market. Dr. Würtenberger also explains how her firm works with artists estates.",
            "length": "44231493",
            "sourceUrl": "http://feeds.soundcloud.com/stream/152496830-artelligence-loretta-wurtenberger.mp3"
        },
        {
            "title": "Adam Lindemann",
            "datePublished": "Tue, 20 May 2014 20:19:40 +0000",
            "description": "Venus Over Manhattan gallerist and collector Adam Lindemann talks about the Contemporary art market, the New York auctions, guarantees, Richard Prince, Joe Bradley and Alexander Calder (because, in the end, Calder goes with everything.)",
            "length": "24294213",
            "sourceUrl": "http://feeds.soundcloud.com/stream/150469028-artelligence-adam-lindemann-1.mp3"
        },
        {
            "title": "Amy Cappellazzo",
            "datePublished": "Fri, 02 May 2014 18:39:43 +0000",
            "description": "After nearly 13 years at the head of Christie's Contemporary Art department during a period of un paralleled growth in the art market and, even more strikingly, the market for Contemporary Art, Amy Cappellazzo has started a new firm called Art Agency Partners with renowned art advisor Allan Schwartzmann. \r\n\r\nHere Amy talks about the essential ingredients—liquidity for the wealthy and a liquidity of art and artists—that made this global art boom possible.",
            "length": "32308371",
            "sourceUrl": "http://feeds.soundcloud.com/stream/147597185-artelligence-amy-cappellazzo.mp3"
        }
    ]
}