{
    "artwork": "http://is5.mzstatic.com/image/thumb/Music4/v4/08/fc/51/08fc5131-fac0-2edc-043f-84bf4eb2385d/source/100x100bb.jpg",
    "description": "World premieres, news, events and interesting features: The Audi Video Podcast. Enjoy!",
    "feedURL": "http://feeds.feedburner.com/AudiParis2006EN",
    "podcastURL": "http://www.audi.com/videocast",
    "title": "Audi Video Podcast",
    "episodes": [
        {
            "title": "Piloted, electrified and fully connected – Audi at the 2016 CES",
            "datePublished": "Wed, 13 Jan 2016 12:00:00 GMT",
            "description": "Electrification, digitalization and piloted driving: Audi is making these three future trends of the automotive industry the focus of its appearance at this year’s Consumer Electronics Show (CES) in Las Vegas, Nevada.<img src=\"http://feeds.feedburner.com/~r/AudiParis2006EN/~4/WgU-uhviGEI\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "372069597",
            "sourceUrl": "http://microsites.audi.com/audio/videocast/en_US/feed/CES16_PUBLIC_V3A_FINAL.mp4",
            "categories": [
                "Business News"
            ]
        },
        {
            "title": "Audi at Design Miami: Into an Electric Future",
            "datePublished": "Thu, 10 Dec 2015 18:30:00 GMT",
            "description": "Audi is presenting the future of electric mobility at this year’s Design Miami in the shape of the Audi e-tron quattro concept. The Stockholm design studio “Humans since 1982” has been given the commission to present the sporty SUV. Audi has been a partner of Design Miami since 2006.<img src=\"http://feeds.feedburner.com/~r/AudiParis2006EN/~4/wPM7Z1jwup4\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "86326899",
            "sourceUrl": "http://microsites.audi.com/audio/videocast/en_US/feed/DM15_Public_1080p_Master.mp4",
            "categories": [
                "Business News"
            ]
        },
        {
            "title": "Audi at the International Automotive Exhibition (IAA) 2015",
            "datePublished": "Sat, 3 Oct 2015 13:45:00 GMT",
            "description": "At the International Automotive Exhibition (IAA) 2015 in Frankfurt Audi stands out with four highlights: Audi Sport, quattro, Audi Technologies and Audi ultra while focussing at the new Audi A4 and the study Audi e-tron quattro concept.<img src=\"http://feeds.feedburner.com/~r/AudiParis2006EN/~4/Cc6fgCzBGYA\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "238797037",
            "sourceUrl": "http://microsites.audi.com/audio/videocast/en_US/feed/AUDI_IAA_2015_Frankfurt-Highlights_EN2.mp4",
            "categories": [
                "Business News"
            ]
        },
        {
            "title": "Two days of elite European football: The Audi Cup 2015",
            "datePublished": "Mon, 17 Aug 2015 12:00:00 GMT",
            "description": "Clubs from the top four European leagues in Germany, Spain, England and Italy went head-to-head for the first time in Audi Cup history: FC Bayern Munich, Real Madrid, AC Milan and Tottenham Hotspur The high-caliber field fulfilled expectations: after four goal-laden and partly high quality fixtures, the winner’s trophy went as it did in 2009 and 2013 to FC Bayern Munich.<img src=\"http://feeds.feedburner.com/~r/AudiParis2006EN/~4/nZL2PuRP8eI\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "511850489",
            "sourceUrl": "http://microsites.audi.com/audio/videocast/en_US/feed/AudiCup2015_Final_EN.mp4",
            "categories": [
                "Business News"
            ]
        },
        {
            "title": "“The great quattro” by Audi at Design Miami/Basel",
            "datePublished": "Mon, 29 Jun 2015 12:00:00 GMT",
            "description": "This year, the Audi presence at Design Miami/Basel revolves around the new Audi Q7. The brand with the four rings is the exclusive automotive partner of the show and from June 16 to 21 it will be exhibiting “The great quattro”: a three-dimensional installation with dark monoliths which prominently showcases the largest model of the Audi SUV family. The “The great quattro” installation sets the stage this feeling of space in an artistic way. A sculptural scene surrounds the SUV with six monoliths, each over four meters (13.1 ft) in overall height on an exhibit area measuring 300 square meters (3,229.2 sq ft). Walking on paths, visitors can explore this mountain landscape for themselves at various elevations.<img src=\"http://feeds.feedburner.com/~r/AudiParis2006EN/~4/S3fOL4UVTnM\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "384042810",
            "sourceUrl": "http://microsites.audi.com/audio/videocast/en_US/feed/Audi_DMB15_Public.mp4",
            "categories": [
                "Business News"
            ]
        },
        {
            "title": "The Audi City Lab in Milan",
            "datePublished": "Mon, 19 Jan 2015 17:00:00 GMT",
            "description": "Audi set up shop for ten days in Via Montenapoleone in the heart of Milan, opening the Audi City Lab in Italy's capital of design and innovation. Among other events, Audi showed the stunning Audi prologue concept car for the fist time in Europe.<img src=\"http://feeds.feedburner.com/~r/AudiParis2006EN/~4/RFbL_FbnKq4\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "66709940",
            "sourceUrl": "http://microsites.audi.com/audio/videocast/en_US/feed/Audi_Milan_CityLab-ENG.mp4",
            "categories": [
                "Business News"
            ]
        },
        {
            "title": "Audi at 2015 CES",
            "datePublished": "Fri, 16 Jan 2015 12:00:00 GMT",
            "description": "A four core processor processing eight billion operations per second. A virtual tachometer with a needle that is rendered anew 60 times per second to ensure absolutely fluid motion. 3D sound to match a concert hall and appearing to come from every direction, an Audi tablet as a multimedia control panel and simple wireless communication between your mobile devices and your car all demonstrate how diverse the future of the automobile is at Audi. All this and convenience, too: piloted parking and innovative Audi wireless charging (AWC) technology pave the way for electric mobility. A laser headlight shining ahead hundreds of feet and a car lapping the famous Hockenheim speedway at 240 km/h (149.1 mph) without a driver – Audi is a leading and driving force in all technology areas relating to electronics and electrics. At CES in Las Vegas, the world’s most important electronics exhibition, Audi makes a splash with a host of new technologies.<img src=\"http://feeds.feedburner.com/~r/AudiParis2006EN/~4/KZhbVCQM7yU\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "73692266",
            "sourceUrl": "http://microsites.audi.com/audio/videocast/en_US/feed/CES15_140115_PUBLIC_Master.mp4",
            "categories": [
                "Business News"
            ]
        },
        {
            "title": "The force within: Audi prologue at Design Miami 2014",
            "datePublished": "Mon, 15 Dec 2014 12:00:00 GMT",
            "description": "Audi is continuing with its new design strategy: At Design Miami, the brand with the four rings is presenting the essence of quattro as “The force within”. To mark the tenth anniversary of the show, which takes place from December 3 through 7, 2014, Audi is also presenting the revolutionary Audi prologue concept car – this is the first vehicle created by the Audi design team under the leadership of new design chief Marc Lichte.<img src=\"http://feeds.feedburner.com/~r/AudiParis2006EN/~4/uy63fbh1DSo\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "77823226",
            "sourceUrl": "http://microsites.audi.com/audio/videocast/en_US/feed/DM14_Public_720p_Master.mp4",
            "categories": [
                "Business News"
            ]
        },
        {
            "title": "The Audi novelities at the Paris Motor Show 2014",
            "datePublished": "Mon, 13 Oct 2014 12:00:00 GMT",
            "description": "Audi presents the new TTS Roadster, the showcar TT Sportback concept and the new A6 ultra on stage at the Paris Motor Show.<img src=\"http://feeds.feedburner.com/~r/AudiParis2006EN/~4/Wxd0sOclUrQ\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "246131256",
            "sourceUrl": "http://microsites.audi.com/audio/videocast/en_US/feed/Audi_Paris_2014-FIN-ENG.mp4",
            "categories": [
                "Business News"
            ]
        },
        {
            "title": "Audi Football Summit New York",
            "datePublished": "Fri, 29 Aug 2014 12:00:00 GMT",
            "description": "Audi delivered high caliber football during its Audi Summer Football tour in the United States: Both clubs FC Bayern Munich and Club Deportivo Guadalajara from Mexico accepted the invitation of Audi to play in NYC.<img src=\"http://feeds.feedburner.com/~r/AudiParis2006EN/~4/kbsaebaNjYM\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "369444448",
            "sourceUrl": "http://microsites.audi.com/audio/videocast/de_DE/feed/Audi_Summit_2014-public-ENG.mp4",
            "categories": [
                "Business News"
            ]
        },
        {
            "title": "Audi at the World Ducati Week",
            "datePublished": "Fri, 01 Aug 2014 12:00:00 GMT",
            "description": "The eighth edition of World Ducati Week, the international, bi-annual Ducati gathering that attracts countless enthusiasts from the global Ducati community, has been an outstanding success, able to thrill the tens of thousands of motorcyclists who filled the \"Marco Simoncelli\" Misano World Circuit from Friday 18 to Sunday 20 July.<img src=\"http://feeds.feedburner.com/~r/AudiParis2006EN/~4/9GXoedk0w1c\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "252830050",
            "sourceUrl": "http://microsites.audi.com/audio/videocast/en_US/feed/140725_Audi-WDW-2014-ENG.mp4",
            "categories": [
                "Business News"
            ]
        },
        {
            "title": "Audi at Design Miami/Basel 2014",
            "datePublished": "Mon, 30 Jun 2014 10:00:00 GMT",
            "description": "Audi is presenting its first-ever architecture installation designed by Konstantin Grcic, one of the most influential industrial designers of the age, at this year’s Design Miami/Basel. The source of inspiration for the polygonal TT Pavilion is the new Audi TT. Grcic has used parts of the TT to create a mobile space that transfers the technology of automotive engineering to architectural design.<img src=\"http://feeds.feedburner.com/~r/AudiParis2006EN/~4/YZIo8BPTuSE\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "325343481",
            "sourceUrl": "http://microsites.audi.com/audio/videocast/en_US/feed/DMB14_Public_Master.mp4",
            "categories": [
                "Business News"
            ]
        },
        {
            "title": "Audi at the 2014 Wörthersee Tour",
            "datePublished": "Thu, 12 Jun 2014 12:00:00 GMT",
            "description": "Audi presented the A3 clubsport quattro concept at this year's Wörthersee Meeting in Reifnitz (Kärnten) from May 28–31. The concept study has a five-cylinder TFSI engine under the hood producing 386 kW (525 hp). Shown were also the Audi TT quattro sport concept show car, which debuted at the 2014 Geneva Motor Show, and ten production models.<img src=\"http://feeds.feedburner.com/~r/AudiParis2006EN/~4/jQNawWEr-UQ\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "229543547",
            "sourceUrl": "http://microsites.audi.com/audio/videocast/en_US/feed/AUDI_WSEE_2014_EN.mp4",
            "categories": [
                "Business News"
            ]
        },
        {
            "title": "quattro snow art",
            "datePublished": "Thu, 06 Feb 2014 16:00:00 GMT",
            "description": "quattro snow art by Simon Beck at Verbier in the Swiss Alps<img src=\"http://feeds.feedburner.com/~r/AudiParis2006EN/~4/h8gJWkWU5CA\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "259292144",
            "sourceUrl": "http://microsites.audi.com/audio/videocast/en_US/feed/Audi_SnowArt_Long.mp4",
            "categories": [
                "Business News"
            ]
        },
        {
            "title": "Audi at the 2014 International CES",
            "datePublished": "Tue, 28 Jan 2014 13:00:00 GMT",
            "description": "“Next Generation” is the motto under which Audi is appearing with a virtual fireworks display of innovations at the Consumer Electronics Show (CES) taking place in Las Vegas from January 6 - 10, 2014. Audi is showing its future solutions for the megatrends piloted driving, infotainment, connectivity, operation and display, and its groundbreaking lighting technologies at the world’s most important consumer electronics trade show.<img src=\"http://feeds.feedburner.com/~r/AudiParis2006EN/~4/MDHOhi8ycvM\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "318494438",
            "sourceUrl": "http://microsites.audi.com/audio/videocast/en_US/feed/AudiCES14_Master720p.mp4",
            "categories": [
                "Business News"
            ]
        },
        {
            "title": "quattro Festkogl-Alm in Hochgurgel/Obergurgel",
            "datePublished": "Fri, 17 Jan 2014 11:30:00 GMT",
            "description": "On the quattro Festkoglalm in Hochgurgl / Obergurgl, skiers can expect a lunch break of a special kind. The building has been remodeled and presents itself in a progressive quattro design. Interactive multimedia tables provide information about the ski resort and the quattro technology.<img src=\"http://feeds.feedburner.com/~r/AudiParis2006EN/~4/ukO6kx7brkE\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "192666714",
            "sourceUrl": "http://microsites.audi.com/audio/videocast/en_US/feed/140117_Audi_Festkoglalm_v13_EN.mp4",
            "categories": [
                "Business News"
            ]
        },
        {
            "title": "quattro BAR opens in St. Moritz",
            "datePublished": "Sat, 14 Dec 2013 18:00:00 GMT",
            "description": "In the midst of the Corviglia ski area the exclusive quattro BAR opened at 2,486 meters above sea level. With open fires and creations from celebrity chef Reto Mathis guests expect perfect quattro conditions: Wind, blowing snow, ice and the impressive panorama of the Alps visibile through the encircling glass facade of the building. Audi interprets the classical concept of the ski lodge in a modern way and is responsible for the interior design. Eye-catcher is the quattro logo made of aluminum which is prominently embedded in the clad Vals granite back wall of the bar area. The bar in the mountains above St. Moritz with its more than 100 square meters can accommodate up to 90 guests and will be open in both the winter and in the summer season.<img src=\"http://feeds.feedburner.com/~r/AudiParis2006EN/~4/jscoo1_FICs\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "72812368",
            "sourceUrl": "http://microsites.audi.com/audio/videocast/en_US/feed/131213_Audi_Quattro_Bar_v7.mp4",
            "categories": [
                "Business News"
            ]
        },
        {
            "title": "Audi at Design Miami/ 2013",
            "datePublished": "Thu, 12 Dec 2013 18:00:00 GMT",
            "description": "Audi’s presence at Design Miami/ from December 3rd to 8th has been dominated by Audi Sport and featured two of its sportiest models: the production model R8 Spyder and the R8 LMS ultra for customer racing. The Audi sculpture entitled “Fragmentation” served as the backdrop. This three-dimensional installation plays with the red rhombus, the symbol of Audi Sport.<img src=\"http://feeds.feedburner.com/~r/AudiParis2006EN/~4/QWwWxtm4z6Q\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "297815362",
            "sourceUrl": "http://microsites.audi.com/audio/videocast/en_US/feed/131210-DM13_MASTER.mp4",
            "categories": [
                "Business News"
            ]
        },
        {
            "title": "Audi at the IAA 2013",
            "datePublished": "Thu, 24 Sep 2013 14:00:00 GMT",
            "description": "A new skyline for Frankfurt am Main: Audi once again had a spectacular architecture in store for visitors of the International Motor Show (IAA). Constructed specially for the exhibition, the building invited visitors to consider the parameters for urban mobility from an unusual point of view. Inside, skyscrapers and entire city districts sprouting from the ceiling created “hanging cities”. Visitors walking through the pavilion experienced the diverse requirements on future mobility and the technological innovations from Audi.<img src=\"http://feeds.feedburner.com/~r/AudiParis2006EN/~4/jwn6v6otbME\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "366777048",
            "sourceUrl": "http://microsites.audi.com/audio/videocast/en_US/feed/130920_Audi_IAA_2013_v5_EN_1080p.mp4",
            "categories": [
                "Business News"
            ]
        },
        {
            "title": "Audi at Design Miami/Basel",
            "datePublished": "Thu, 25 Jun 2013 17:00:00 GMT",
            "description": "At Design Miami/Basel held from June 11 to 16, Audi will showcase an installation by Tim John: “Home of quattro.” The scenographer will portray milestones from quattro history as silhouettes. And two extraordinary Audi models will take center stage: the new Audi RS6 Avant – unveiled at the Geneva Motor Show in March – and the legendary 1984 Audi Sport quattro. In February 2013, the company with the four rings celebrated a remarkable achievement: the five-millionth Audi with quattro drive rolled off the assembly line.<img src=\"http://feeds.feedburner.com/~r/AudiParis2006EN/~4/huCrMhWUJ3s\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "285050786",
            "sourceUrl": "http://microsites.audi.com/audio/videocast/en_US/feed/Audi_DM_Basel2013_EN_720_10mbit.mp4",
            "categories": [
                "Business News"
            ]
        },
        {
            "title": "Audi at the 2013 Wörthersee Tour",
            "datePublished": "Thu, 16 May 2013 18:00:00 GMT",
            "description": "Audi is turning the Wörthersee 2013 into the “Home of quattro”. At the large gathering from May 8 to 11 in Reifnitz (Kärnten), the premium brand will unveil the Audi TT ultra quattro concept – which combines minimal weight and maximum sportiness. A wide range of high-performance cars will also give fans another taste of sportiness. In addition to the legendary Sport quattro S1, the very latest RS models and thoroughbred race cars are also on show. The Audi R18 e-tron quattro, which was the first hybrid car to win the 24 Hours of Le Mans last year, will also be part of the action at the lakeside.<img src=\"http://feeds.feedburner.com/~r/AudiParis2006EN/~4/qcCBZ839KGs\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "270561313",
            "sourceUrl": "http://microsites.audi.com/audio/videocast/en_US/feed/AUDI_WSEE2013_FINAL-ENG-h264.mp4",
            "categories": [
                "Business News"
            ]
        },
        {
            "title": "Audi at the 2013 CES",
            "datePublished": "Thu, 8 Jan 2013 12:30:00 GMT",
            "description": "Audi has presented its new electrics/electronics technologies at the Consumer Electronics Show (CES) in Las Vegas. The show booth was devoted to networking the car with its environment – with a particular focus on future piloted driving and mobile communications. Other show highlights include sound and lighting technologies.<img src=\"http://feeds.feedburner.com/~r/AudiParis2006EN/~4/h1mnbrJJg4o\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "301964201",
            "sourceUrl": "http://microsites.audi.com/audio/videocast/en_US/feed/Audi_CES2013_720_10mbit.mp4",
            "categories": [
                "Business News"
            ]
        },
        {
            "title": "Audi at the Design Miami/",
            "datePublished": "Wed, 19 Dec 2012 12:30:00 GMT",
            "description": "The R18 Ultra Chair set to be exhibited by Audi at Design Miami/ was masterminded by Clemens Weisshaar and Reed Kram, who represent a new generation of digital designers. The prototype was developed in cooperation with the Audi Lightweight Construction Center and made its very first appearance at the Milan Furniture Fair in April. The chair was fine-tuned using data obtained from an interactive installation that was trialed by over 1,500 testers, plus the know-how of Audi lightweight engineers. The result is sturdier, more comfortable and one kilogram (2.20 lbs) lighter.<img src=\"http://feeds.feedburner.com/~r/AudiParis2006EN/~4/VjVFh5ejSwE\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "150104050",
            "sourceUrl": "http://microsites.audi.com/audio/videocast/en_US/feed/121219_Audi_Design_Miami_2012_long_noKW_v13.mp4",
            "categories": [
                "Business News"
            ]
        },
        {
            "title": "Audi at the Sevilla Speed Days",
            "datePublished": "Wed, 21 Nov 2012 12:30:00 GMT",
            "description": "Fly to Sevilla, drive an Audi RS 5 to the race track and test the new Audi R8 plus.<img src=\"http://feeds.feedburner.com/~r/AudiParis2006EN/~4/jN0j3iT1zTE\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "255187347",
            "sourceUrl": "http://microsites.audi.com/audio/videocast/en_US/feed/Sevilla_SpeedDays_EN.mp4",
            "categories": [
                "Business News"
            ]
        },
        {
            "title": "Audi at the 2012 Paris Motor Show",
            "datePublished": "Mon, 8 Oct 2012 20:00:00 GMT",
            "description": "Audi is presenting a number of new models at the Paris Motor Show 2012. Experience the Audi S3, Audi S3 Sportback, Audi RS 5 Cabriolet, Audi SQ5 TDI and the Concept Car Audi crosslane coupé.<img src=\"http://feeds.feedburner.com/~r/AudiParis2006EN/~4/hbyddGDJ1QM\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "276006736",
            "sourceUrl": "http://microsites.audi.com/audio/videocast/en_US/feed/55_audi_paris_2012_en.mp4",
            "categories": [
                "Business News"
            ]
        },
        {
            "title": "Audi Sphere in Copenhagen: experience tomorrow’s technology firsthand",
            "datePublished": "Thu, 9 Aug 2012 20:00:00 GMT",
            "description": "In the Audi Sphere in Copenhagen, Audi is showing how it is shaping tomorrow’s technology, while making it possible to experience the brand’s fields of innovation: In front of the Parliament Building in the Danish capital, three walk-in spheres present unique worlds for each key aspect of technology.<img src=\"http://feeds.feedburner.com/~r/AudiParis2006EN/~4/H272ixy7nkw\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "299373171",
            "sourceUrl": "http://microsites.audi.com/audio/videocast/en_US/feed/54_audi_copenhagen_sphere_EN.mp4",
            "categories": [
                "Business News"
            ]
        },
        {
            "title": "Audi at the 2012 Wörthersee Tour",
            "datePublished": "Fri, 25 May 2012 10:00:00 GMT",
            "description": "Audi is exhibiting concept vehicles for lifestyle, action and sport on the Wörthersee Tour. Three powerful versions provide new accents in the Q3 model family, and with its e-bike Wörthersee prototype Audi defines a technical bike concept that explores the limits of technical feasibility on the basis of Audi’s core competences “design”, “ultra”, “connect” and “e-tron”.<img src=\"http://feeds.feedburner.com/~r/AudiParis2006EN/~4/vJpKceQUqjs\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "110975902",
            "sourceUrl": "http://microsites.audi.com/audio/videocast/en_US/feed/52_Audi_Wörthersee_2012_v13.mp4",
            "categories": [
                "Business News"
            ]
        },
        {
            "title": "The R18 Ultra Chair Public Beta",
            "datePublished": "Thu, 03 May 2012 21:00:00 GMT",
            "description": "At the Salone Internazionale del Mobile in Milano, Audi in April 2012has displayed a pioneering project at the Palazzo Clerici: “R18 Ultra Chair – Public Beta.” Visitors were invited to try out Audi ultra lightweight technology in an interactive installation. Designers Clemens Weisshaar and Reed Kram collaborated with the Audi Lightweight Design Center to develop a chair prototype.<img src=\"http://feeds.feedburner.com/~r/AudiParis2006EN/~4/GvnGQZHLOek\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "182428852",
            "sourceUrl": "http://microsites.audi.com/audio/videocast/en_US/feed/51_Audi_Mailand_2012.mp4",
            "categories": [
                "Business News"
            ]
        },
        {
            "title": "Audi at the Design Miami/ 2011",
            "datePublished": "Tue, 13 Dec 2011 14:15:00 GMT",
            "description": "In the future, streets will communicate with every road user – this hypothesis is put forward by architectural firm Bjarke Ingels Group (BIG) in their vision of mobility of the future. Visitors to Design Miami/ 2011 (November 29 to December 4) can discover what the architecture group’s idea actually looks like. In cooperation with AUDI AG, they have created the interactive LED installation “Urban Future”. At its heart is the Audi A2 concept: an integral part of the future model that connects to its environment.<img src=\"http://feeds.feedburner.com/~r/AudiParis2006EN/~4/sJrgzLQbxvY\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "344400526",
            "sourceUrl": "http://microsites.audi.com/audio/videocast/en_US/feed/49_audi_videocast_design_miami_2011_v2.mp4",
            "categories": [
                "Business News"
            ]
        },
        {
            "title": "Audi at the Frankfurt Book Fair 2011",
            "datePublished": "Fri, 21 Oct 2011 14:15:00 GMT",
            "description": "AUDI AG and the Frankfurt Book Fair have agreed to a multi-year partnership to provide a platform for the exchange of ideas between various disciplines and schools of thought. The aim is to work together to foster innovative ideas through the convergence of different fields. The partners are providing a first glimpse of their collaborative project with the ‘Open Talks’ at this year’s Frankfurt Book Fair.<img src=\"http://feeds.feedburner.com/~r/AudiParis2006EN/~4/U4JYoqTZGeY\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "152077088",
            "sourceUrl": "http://microsites.audi.com/audio/videocast/en_US/feed/48_Audi_Buchmesse_2011_v7_EN_FNL.m4v",
            "categories": [
                "Business News"
            ]
        },
        {
            "title": "Audi at the IAA 2011",
            "datePublished": "Thu, 23 Sep 2011 22:00:00 GMT",
            "description": "With the Audi Ring, Audi is celebrating a very special world premiere at the IAA 2011 in Frankfurt/Main (Germany): For the first time, the brand with the four rings is being presented in its own building on the Agora, the central forum and meeting place at the IAA, the most important motor show of the year. See the fasctinating building, the all-new Audi S6, Audi S7, Audi S8 and the concept cars Audi A2 concept and Audi urban concept in this episode of the Audi podcast.<img src=\"http://feeds.feedburner.com/~r/AudiParis2006EN/~4/ANtlomg1Jdk\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "138533438",
            "sourceUrl": "http://microsites.audi.com/audio/videocast/en_US/feed/47_Audi_IAA_2011_Podcast_FNL_English.m4v",
            "categories": [
                "Business News"
            ]
        },
        {
            "title": "Audi at the Wörthersee Tour 2011",
            "datePublished": "Thu, 16 June 2011 16:00:00 GMT",
            "description": "For the fifth time, Audi presented its most recent and sporty cars at the Wörthersee Tour (Austria). More than 300.000 fans were thrilled by the numerous outstanding cars on display and the fascinating Audi show including Audi drivers presenting their cars and the world premiere of the stunning Audi A1 clubsport quattro concept car.<img src=\"http://feeds.feedburner.com/~r/AudiParis2006EN/~4/OP74iRIaMEg\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "166598533",
            "sourceUrl": "http://microsites.audi.com/audio/videocast/en_US/feed/46_Audi_Woerthersee_long_external_v4_english.m4v",
            "categories": [
                "Business News"
            ]
        },
        {
            "title": "The Audi Q3 in Barcelona",
            "datePublished": "Fri, 27 May 2011 16:00:00 GMT",
            "description": "The Audi Q3 on it's roadshow in Barcelona. A huge glass cube as a 360-degree stage presents the Audi Q3.<img src=\"http://feeds.feedburner.com/~r/AudiParis2006EN/~4/EH2paIiwsNM\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "189426188",
            "sourceUrl": "http://microsites.audi.com/audio/videocast/en_US/feed/45_Audi_Q3_Cube_Barcelona_2011_long_external_v3_english.m4v",
            "categories": [
                "Business News"
            ]
        },
        {
            "title": "Audi at the Auto Shanghai 2011",
            "datePublished": "Thu, 28 Apr 2011 12:00:00 GMT",
            "description": "Next to some personal views on the city of Shanghai, see the Audi highlights of the Auto Shanghai 2011 including the Audi Q3 and A3 e-tron concept.<img src=\"http://feeds.feedburner.com/~r/AudiParis2006EN/~4/C9zeC2mDI-E\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "158393004",
            "sourceUrl": "http://microsites.audi.com/audio/videocast/en_US/feed/43_audi_videocast_shanghai2011_int.m4v",
            "categories": [
                "Business News"
            ]
        },
        {
            "title": "Audi at Design Miami: Filling up on creativity",
            "datePublished": "Sat, 18 Dec 2010 12:00:00 GMT",
            "description": "Fill it up, pay, get on your way. It probably won’t be that easy with electric cars, since charging takes longer than filling up with gasoline or diesel. At the Design Miami show 2010, Audi took a playful look at this aspect: What can drivers do in the meantime? What amenities will charging stations of the future have to offer? Furthermore Audi presented four electric vehicle concepts with its e-tron family within just one year – and the small-series, 100% electric R8 e-tron supercar will be on the market in 2012.<img src=\"http://feeds.feedburner.com/~r/AudiParis2006EN/~4/c1s1Yhv0NOs\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "238833454",
            "sourceUrl": "http://microsites.audi.com/audio/videocast/en_US/feed/42_audi_videocast_miami_2010_ipod_en.m4v",
            "categories": [
                "Business News"
            ]
        },
        {
            "title": "Audi at the Paris Motor Show 2010: The Audi e-tron Spyder",
            "datePublished": "Mon, 04 Oct 2010 13:30:00 GMT",
            "description": "Audi presented a stunning show car at the 2010 Paris Motor Show: The Audi e-tron Spyder. The Audi e-tron Spyder is an open sports car with plug-in hybdrid drive combining TDI power with two electric motors.<img src=\"http://feeds.feedburner.com/~r/AudiParis2006EN/~4/hCkV9r8oLno\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "31147476",
            "sourceUrl": "http://microsites.audi.com/audio/videocast/en_US/feed/41_Audi_Paris2010_e-tron_IPOD_eng.m4v",
            "categories": [
                "Business News"
            ]
        },
        {
            "title": "Audi at “Wörthersee Tour 2010”",
            "datePublished": "Tue, 25 May 2010 16:00:00 GMT",
            "description": "Once again, Audi attracted fans from throughout Europe with a stunning presence at the 2010 Wörthersee Tour. In leading role: The new Audi A1. Innovative adhesive film designs, vibrant paint finishes as well as exterior add-on parts and a matching interior transformed a total of seven models of the new compact car into spectacular motto vehicles. Furthermore, the Audi R8 GT, a limited-production version of the high-performance sports car, was presented to the general public for the first time at Wörthersee shortly after its world premiere.<img src=\"http://feeds.feedburner.com/~r/AudiParis2006EN/~4/l9pK8vuQ--g\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "69816970",
            "sourceUrl": "http://microsites.audi.com/audio/videocast/en_US/feed/40_audi_videocast_woerthersee2010_ipod_en.m4v",
            "categories": [
                "Business News"
            ]
        },
        {
            "title": "Audi premiere at Milan Design Week",
            "datePublished": "Wed, 28 Apr 2010 16:30:00 GMT",
            "description": "Extraordinary trade fair displays are ‘par for the course’ at Audi, and have been for years. This was true at Design Miami in Basel and Miami, and it will also be true at the Milan Furniture Fair, also commonly known as the Milan Design Week, were Audi will have a display for the first time ever. The highlight will be Lucid Flux, a light installation by innovative designer Moritz Waldemeyer to showcase two new Audi models, the sub-compact A1 and the A8 luxury sedan.<img src=\"http://feeds.feedburner.com/~r/AudiParis2006EN/~4/nskU7tFVThg\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "73177840",
            "sourceUrl": "http://microsites.audi.com/audio/videocast/en_US/feed/39_audi_videocast_milano_ipod_EN.mp4",
            "categories": [
                "Business News"
            ]
        },
        {
            "title": "The Audi A1 close and personal - at the AreA1 in Barcelona",
            "datePublished": "Mon, 15 Mar 2010 13:30:00 GMT",
            "description": "Live and multi-faceted: Audi presented the new Audi A1 at the Moll de la Marina in the Olympic Harbour of Barcelone (Spain). From 10-27 March 2010, the AreA1 presented the next big Audi - a thrilling stand showing all technical features of the car and giving a very special driving experience as the co-pilot of a professional driver.<img src=\"http://feeds.feedburner.com/~r/AudiParis2006EN/~4/OTtHraH_bww\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "40649546",
            "sourceUrl": "http://microsites.audi.com/audio/videocast/en_US/feed/38_audi_videocast_AreA1_Barcelona_2010_ipod_ml.mp4",
            "categories": [
                "Business News"
            ]
        },
        {
            "title": "Audi at the Geneva Motor Show 2010 ",
            "datePublished": "Sun, 7 Mar 2010 11:30:00 GMT",
            "description": "The 80th Geneva Motor Show serves as the backdrop for several spectacular Audi premieres. International star Justin Timberlake unveiled the new Audi A1 during the press conference at the Audi stand. In addition, Rupert Stadler, Chairman of the Board of Management of AUDI AG, and Michael Dick, Member of the Board of Management for Technical Development, presented the Audi RS 5, the near-production Audi A8 Hybrid show car and the Audi A1 e-tron concept car. quattro technology from Audi has an anniversary to celebrate: The spotlights homed in on the first Audi quattro at the Geneva Motor Show on March 3, 1980. Its appearance signaled the start of a winning streak in motor sport and on ordinary roads that still continues today.<img src=\"http://feeds.feedburner.com/~r/AudiParis2006EN/~4/ykHkxwWgTqk\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "61645243",
            "sourceUrl": "http://microsites.audi.com/audio/videocast/en_US/feed/37_audi_videocast_geneva2010_ipod_en.mp4",
            "categories": [
                "Business News"
            ]
        },
        {
            "title": "Audi at the Detroit Auto Show 2010 - Audi e-tron",
            "datePublished": "Fri, 15 Jan 2010 21:00:00 GMT",
            "description": "Audi is showing an uncompromising purist compact sports car with all-electric drive at the first major auto show of 2010. The Detroit showcar Audi e-tron is the name of this 3.93 meter (154.72 in) long and 1.78 meter (70.08 in) wide but just 1.22 meter (48.03 in) tall two-seater; just a few months after the debut of the Audi e-tron at the 2009 Frankfurt Motor Show, this is now the second electric concept vehicle from the brand with the four rings.<img src=\"http://feeds.feedburner.com/~r/AudiParis2006EN/~4/Fjra2vHXM50\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "55541600",
            "sourceUrl": "http://microsites.audi.com/audio/videocast/en_US/feed/36_audi_videocast_detroit2010_ipod_en.mp4",
            "categories": [
                "Business News"
            ]
        },
        {
            "title": "Audi at the Design Miami 2009",
            "datePublished": "Thu, 17 Dec 2009 18:30:00 GMT",
            "description": "The 100th anniversary year of the Audi brand is set to culminate with a very special occasion. November 30 sees the world premiere of the new Audi A8 – in the extraordinary setting of Miami. Here the brand’s new flagship will be presented in a truly innovative way in the Audi Pavilion, a temporary museum structure. It is to be the focal point of the vernissage “The Art of Progress,” which exhibits cultural and technological progress and echoes the values of the new A8: Vorsprung durch Technik and design expertise that stirs the emotions.<img src=\"http://feeds.feedburner.com/~r/AudiParis2006EN/~4/us5lGfGTVK8\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "88460488",
            "sourceUrl": "http://microsites.audi.com/audio/videocast/en_US/feed/35_audi_videocast_miami2009_ipod_en.m4v",
            "categories": [
                "Business News"
            ]
        },
        {
            "title": "Audi at the IAA 2009",
            "datePublished": "Tue, 29 Sep 2009 19:00:00 GMT",
            "description": "Besides the world premiere of the fascinating Audi e-tron, there was much more to see at the Audi stand at the IAA 2009 in Frankfurt. Join us for comprehensive review of the most important motor show and see the Audi S5 Sportback and other world premieres in the Audi Video Podcast.<img src=\"http://feeds.feedburner.com/~r/AudiParis2006EN/~4/P92vmi05Gk0\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "63004591",
            "sourceUrl": "http://microsites.audi.com/audio/videocast/en_US/feed/34_audi_videocast_iaa2009_gesamt_ipod_en.mp4",
            "categories": [
                "Business News"
            ]
        },
        {
            "title": "World premiere Audi e-tron",
            "datePublished": "Sat, 19 Sep 2009 19:00:00 GMT",
            "description": "Audi presents the highlight of the IAA 2009: the e-tron, a high-performance sports car with a purely electric drive system. Four motors – two each at the front and rear axles – drive the wheels, making the concept car a true quattro. Producing 230 kW (313 hp) and 4,500 Nm (3,319.03 lb-ft) of torque, the two-seater accelerates from 0 to 100 km/h (0 – 62.14 mph) in 4.8 seconds, and from 60 to 120 km/h (37.28 – 74.56 mph) in 4.1 seconds. The lithium-ion battery provides a truly useable energy content of 42.4 kilowatt hours to enable a range of approximately 248 kilometers.<img src=\"http://feeds.feedburner.com/~r/AudiParis2006EN/~4/hXtT_dDeKWg\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "49299198",
            "sourceUrl": "http://microsites.audi.com/audio/videocast/en_US/feed/33_audi_videocast_iaa2009_ipod_en.mp4",
            "categories": [
                "Business News"
            ]
        },
        {
            "title": "Audi at Wörthersee Tour 2009",
            "datePublished": "Fri, 29 May 2009 16:30:00 GMT",
            "description": "Each year Wörthersee plays host to the now legendary GTI meet, at which auto enthusiasts and of course Audi fans from throughout Europe come together. AUDI AG once again has its own stand at this extraordinary event. The brand’s appearance at the 28th Wörthersee Tour (from May 20-23) in Reifnitz, Kärnten (Austria), is dedicated to the centennial celebration “100 years of Audi.” In addition to historic models from various decades, the Ingolstadt carmaker is featuring showcase vehicles such as the Audi TT RS, the Audi R8 5.2 FSI quattro and the Audi A1 Sportback. As a special highlight for the event at Wörthersee, Audi has prepared a customized Audi Q5 with 21-inch wheels, wider track, lowered ride height, a special paint finish and a power-enhanced 3.0 TFSI engine: the Audi Q5 custom concept.<img src=\"http://feeds.feedburner.com/~r/AudiParis2006EN/~4/ry9NU-UUwck\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "43249004",
            "sourceUrl": "http://microsites.audi.com/audio/videocast/en_US/feed/32_audi_videocast_woerthersee09_ipod_eng.mp4",
            "categories": [
                "Business News"
            ]
        },
        {
            "title": "Audi at the Auto Shanghai 2009",
            "datePublished": "Tue, 28 Apr 2009 12:30:00 GMT",
            "description": "Visitors to the Audi stand at the Auto Shanghai 2009 found some interesting new models. The highlights were the world premiere of the Audi Q7 – the new generation, as well as the Asian premieres of the Audi S5 Cabriolet and Audi R8 5.2 FSI quattro. Furthermore Audi presented the China premiere of the Audi A6L 2.7 TDI.<img src=\"http://feeds.feedburner.com/~r/AudiParis2006EN/~4/tvxfJTubpS0\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "89274699",
            "sourceUrl": "http://microsites.audi.com/audio/videocast/en_US/feed/31_audi_videocast_shanghai_eng_ipod.mp4",
            "categories": [
                "Business News"
            ]
        },
        {
            "title": "Audi at the Design Miami/ 2008",
            "datePublished": "Tue, 30 Dec 2008 16:00:00 +0100",
            "description": "Audi is the exclusive automotive sponsor for the third year running at Design Miami/, the leading global forum for high-end design. From December 2 through 5, the world’s most influential dealers, designers, collectors, curators, and critics met to celebrate the design scene’s highlights at countless events. Audi was not only sponsor of the VIP fleet, but also – with the “Audi Coastline Marina” installation – a participating designer. During the same week, Audi has participated for the first time at Art Basel Miami Beach, a key U.S. art show.<img src=\"http://feeds.feedburner.com/~r/AudiParis2006EN/~4/f097-aHqETA\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "44235148",
            "sourceUrl": "http://microsites.audi.com/audio/videocast/en_US/feed/30_audi_videocast_miami_en_ipod.mp4",
            "categories": [
                "Business News"
            ]
        },
        {
            "title": "Audi Mileage Marathon 2008",
            "datePublished": "Fri, 28 Nov 2008 20:00:00 +0100",
            "description": "A stunning proof of Audi's efficient \"Vorsprung durch Technik\": The Audi Mileage Marathon 2008 from coast to coast in the USA<img src=\"http://feeds.feedburner.com/~r/AudiParis2006EN/~4/ylLaifTSIUE\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "57326111",
            "sourceUrl": "http://microsites.audi.com/audio/videocast/en_US/feed/29_audi_videocast_LA08_mileage_eng_ipod.mp4",
            "categories": [
                "Business News"
            ]
        },
        {
            "title": "Audi at the Los Angeles Motorshow 2008",
            "datePublished": "Mon, 24 Nov 2008 12:00:00 +0100",
            "description": "Audi at the Los Angeles Motorshow 2008: See the US premiere of the Audi Q5 and the results of a stunning marathon from coast to coast - the Audi Mileage Marathon, a long-distance efficiency run.<img src=\"http://feeds.feedburner.com/~r/AudiParis2006EN/~4/-U45C-7Zrw4\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "45223843",
            "sourceUrl": "http://microsites.audi.com/audio/videocast/en_US/feed/28_audi_videocast_LA08_allgemein_eng_ipod.mp4",
            "categories": [
                "Business News"
            ]
        },
        {
            "title": "Audi at the Paris Motor Show 2008 (2)",
            "datePublished": "Fri, 10 Oct 2008 15:00:00 +0100",
            "description": "Audi at the Paris Motor Show 2008: Join us for a visit to the Audi stand and experience a stunning array of world premieres and novelties. In this episode of the Audi videocast: Exlcusive footage from the Audi S4 world premiere, interesting facts about the Audi A6 2.0 TDI e and the Le Mans winning sports prototype Audi R10 TDI.<img src=\"http://feeds.feedburner.com/~r/AudiParis2006EN/~4/sqQfusnY0DE\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "64485513",
            "sourceUrl": "http://microsites.audi.com/audio/videocast/en_US/feed/27_audi_videocast_paris08_2_eng_ipod.mp4",
            "categories": [
                "Business News"
            ]
        },
        {
            "title": "Audi at the Paris Motor Show 2008",
            "datePublished": "Sun, 05 Oct 2008 16:00:00 +0100",
            "description": "Efficiency: Built into every Audi - and a topic for the future as well as for the present. Experience the Audi A1 Sportback concept with its trendsetting drivetrain concept. See the exceptionally efficient Audi A4 TDI concept e. The highlights of the Paris Motor Show 2008 - now in the Audi Videocast!<img src=\"http://feeds.feedburner.com/~r/AudiParis2006EN/~4/sd_n8EdJscI\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "66237836",
            "sourceUrl": "http://microsites.audi.com/audio/videocast/en_US/feed/26_audi_videocast_paris08_eng_ipod.mp4",
            "categories": [
                "Business News"
            ]
        },
        {
            "title": "Audi at the Moscow Motor Show 2008",
            "datePublished": "Thu, 11 Sep 2008 22:00:00 +0100",
            "description": "The Audi RS 6 is the most powerful Audi that has ever been built for the road. Its impressive power is matched only by its exceptional design, luxuriously comfortable fittings and great technical refinement. See the Audi RS 6 and other stunning new Audi models at the Moscow Motor Show 2008 - in the official Audi Video Podcast!<img src=\"http://feeds.feedburner.com/~r/AudiParis2006EN/~4/PAXz2wg_mHs\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "68852537",
            "sourceUrl": "http://microsites.audi.com/audio/videocast/en_US/feed/25_audi_videocast_moskau_en_ipod.mp4",
            "categories": [
                "Business News"
            ]
        },
        {
            "title": "Audi at the Design Annual 08",
            "datePublished": "Fri, 11 Jul 2008 13:00:00 +0100",
            "description": "At the Design Annual 08 in Frankfurt, the Audi A1 project quattro design study was the star of an extraordinary booth. For the first time since its debut at the Tokyo Motor Show 2007, the Audi A1 project quattro made an appearance at an international design trade fair. The Design Annual in Frankfurt took place from July 4-7. Only selected brands are allowed to exhibit here. The motif changes yearly - in 2008, it was \"Showtime\", inspiring Audi for a stand that allowed the visitors to actively experience the brands' emotional design.<img src=\"http://feeds.feedburner.com/~r/AudiParis2006EN/~4/RZDTP7dICzM\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "38255074",
            "sourceUrl": "http://microsites.audi.com/audio/videocast/en_US/feed/24_audi_videocast_designannual_ipod_en.m4v",
            "categories": [
                "Business News"
            ]
        },
        {
            "title": "Audi at the Design Miami/ Basel 2008",
            "datePublished": "Mon, 09 Jun 2008 22:00:00 +0100",
            "description": "The movers and shakers of the art world converged in Basel for Design Miami/ Basel 2008, the world’s biggest art trade show, being held June 2-5. Audi took part as an creative exhibitor and automotive sponsor. Audi is well-equipped to present itself within this somewhat unusual terrain: with its extraordinary design, the exhibition booth makes a clear statement about the brand’s design philosophy. The presentation centers on the Audi R8 sports car. The interplay between human creativity and “Vorsprung durch Technik” is the theme of this year’s appearance.<img src=\"http://feeds.feedburner.com/~r/AudiParis2006EN/~4/c7auS_f2xEU\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "48117319",
            "sourceUrl": "http://microsites.audi.com/audio/videocast/en_US/feed/23_audi_videocast_basel-e-iTunes.m4v",
            "categories": [
                "Business News"
            ]
        },
        {
            "title": "Audi at the Worthersee Tour 2008",
            "datePublished": "Mon, 02 Jun 2008 13:00:00 +0100",
            "description": "Audi is again presenting spectacular showcars at the Worthersee Tour in 2008. The highlight the Audi A3 TDI clubsport quattro, whose two-liter diesel engine churns out 165 kW (224 hp) and 450 Nm (331.90 lb-ft) of torque. The concept car is a driving machine loaded with innovative solutions.<img src=\"http://feeds.feedburner.com/~r/AudiParis2006EN/~4/c0XHA-5P4MM\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "49912143",
            "sourceUrl": "http://microsites.audi.com/audio/videocast/en_US/feed/22_audi_videocast_woerther_see_08_ipod_eng.mp4",
            "categories": [
                "Business News"
            ]
        },
        {
            "title": "The new Audi Q5",
            "datePublished": "Thu, 24 Apr 2008 13:00:00 +0100",
            "description": "Efficient, but fun to drive. Sporty without losing its practicality: The new Audi Q5 - see every stunning detail in the Audi video podcast.<img src=\"http://feeds.feedburner.com/~r/AudiParis2006EN/~4/jqrrNkgAntM\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "50347726",
            "sourceUrl": "http://microsites.audi.com/audio/videocast/en_US/feed/21_audi_videocast_q5_ipod_eng.mp4",
            "categories": [
                "Business News"
            ]
        },
        {
            "title": "Audi at the Auto China 2008 in Beijing",
            "datePublished": "Thu, 24 Apr 2008 13:00:00 +0100",
            "description": "Come with us for detailed and exclusive insights into the Audi world premieres at the Auto China 2008 motor show in Beijing. Join us for a visit to one of the most fascinating megacities of the world and see the new Audi Q5 and the Audi A4 LWB .<img src=\"http://feeds.feedburner.com/~r/AudiParis2006EN/~4/yIB987V8Qwc\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "72913185",
            "sourceUrl": "http://microsites.audi.com/audio/videocast/en_US/feed/20_audi_videocast_Peking08_ipod_eng.mp4",
            "categories": [
                "Business News"
            ]
        },
        {
            "title": "Audi at the Geneva Auto Show 2008 - experience three stunning world premieres",
            "datePublished": "Fri, 07 Mar 2008 13:00:00 +0100",
            "description": "Audi unveiled a dazzling array of world premieres at the 2008 Geneva Auto Show: See the Audi A4 Avant, the Audi TT 2.0 TDI quattro and the Audi Q7 V12 TDI quattro in the official Audi Video Podcast!<img src=\"http://feeds.feedburner.com/~r/AudiParis2006EN/~4/mgnswyQutDA\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "70634420",
            "sourceUrl": "http://microsites.audi.com/audio/videocast/en_US/feed/19_audi_videocast_genf_2008_ipod_en.mp4",
            "categories": [
                "Business News"
            ]
        },
        {
            "title": "Audi at the Detroit Auto Show 2008 - Audi R8 V12 TDI concept and Audi TTS",
            "datePublished": "Tue, 17 Jan 2008 13:00:00 +0100",
            "description": "Audi is presenting a revolution in the top class at the Detroit Auto Show 2008 – the first 12-cylinder diesel engine in a high-performance roadgoing sports car. The V12 TDI with a displacement of six liters powers a concept car based on the Audi R8. This unit generates a huge 500 hp and 1,000 Newton-meters of torque. Another world premiere in Detroit: The new Audi TTS with a new 2.0 TFSI engine - a pure driving machine, built for the ultimate road experience. See both world premieres in the official Audi Video Podcast!<img src=\"http://feeds.feedburner.com/~r/AudiParis2006EN/~4/UsgyumwvpIE\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "65763069",
            "sourceUrl": "http://microsites.audi.com/audio/videocast/en_US/feed/18_audi_videocast_detroit_2008_en_ipod.mp4",
            "categories": [
                "Business News"
            ]
        },
        {
            "title": "Design Miami/ 2007 - Experience design processes live",
            "datePublished": "Fri, 21 Dec 2007 23:00:00 +0100",
            "description": "Between December 7th and 9th, 2007, the most influential designers, art gallery owners, dealers, and collectors have gathered in Miami’s Design District to present and absorb the latest trends from the world of design. This year, Audi again was present as the exclusive automobile sponsor and creative exhibitor at “Design Miami/ 2007”. The focal point of the creative presentation was the Audi Cross Cabriolet concept study - see the presentation and experience the Audi design processes in the official Audi video podcast.<img src=\"http://feeds.feedburner.com/~r/AudiParis2006EN/~4/nN-luuyEkxU\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "45318938",
            "sourceUrl": "http://microsites.audi.com/audio/videocast/en_US/feed/17_audi_videocast_miami_en_ipod.mp4",
            "categories": [
                "Business News"
            ]
        },
        {
            "title": "Tokyo Motor Show 2007 - the Audi metroproject quattro",
            "datePublished": "Sat, 27 Oct 2007 17:00:00 +0100",
            "description": "At the Tokyo Motor Show 2007 Audi has unveiled the metroproject quattro, an original, characteristically Audi design study for the sub-compact segment. The three-door four-seater car blends dynamic styling with exemplary economy of space and supreme quality in trailblazing fashion. See every detail in the Audi video podcast!<img src=\"http://feeds.feedburner.com/~r/AudiParis2006EN/~4/8oi5GV1lMMQ\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "20436188",
            "sourceUrl": "http://microsites.audi.com/audio/videocast/en_US/feed/14_audi_videocast_tokio07_ipod_eng.m4v",
            "categories": [
                "Business News"
            ]
        },
        {
            "title": "Audi at the IAA 2007",
            "datePublished": "Tue, 18 Sep 2007 18:00:00 +0100",
            "description": "Join us for a visit to the Frankfurt Motor Show 2007 and see the world premieres of the Audi RS 6 Avant and the Audi A4<img src=\"http://feeds.feedburner.com/~r/AudiParis2006EN/~4/3LPZv18cs2o\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "38224056",
            "sourceUrl": "http://microsites.audi.com/audio/videocast/en_US/feed/13_audi_videocast_IAA07_gesamt_en_ipod.m4v",
            "categories": [
                "Business News"
            ]
        },
        {
            "title": "The Audi A4 world premiere",
            "datePublished": "Fri, 14 Sep 2007 23:00:00 +0100",
            "description": "Audi opens up new horizons. The A4 is a sporty car with superb presence on the road; it takes Audi forward into a new dimension on the midsize car market. Eyewitness the Audi A4's world premiere at the 2007 Frankfurt Motor Show in the official Audi video podcast.<img src=\"http://feeds.feedburner.com/~r/AudiParis2006EN/~4/1YMk30s0-wo\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "39887587",
            "sourceUrl": "http://microsites.audi.com/audio/videocast/en_US/feed/12_audi_videocast_iaa07_en_ipod.m4v",
            "categories": [
                "Business News"
            ]
        },
        {
            "title": "Audi Cross Coupé quattro",
            "datePublished": "Sun, 22 Apr 2007 23:00:00 +0100",
            "description": "At the Shanghai Motor Show Audi has presented a study that defines a new segment in the field of crossover vehicles. The Audi Cross Coupé quattro combines the design and dynamism of a compact premium sports car with the spaciousness and versatility of a four-seat sport utility vehicle (SUV) - see it in the official Audi Video Podcast.<img src=\"http://feeds.feedburner.com/~r/AudiParis2006EN/~4/jQe7R7Cvyd4\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "36050560",
            "sourceUrl": "http://microsites.audi.com/audio/videocast/en_US/feed/11_audi_videocast_shanghai_en.m4v",
            "categories": [
                "Business News"
            ]
        },
        {
            "title": "A new form of sportiness. The Audi S5.",
            "datePublished": "Mon, 12 Mar 2007 11:32:00 +0100",
            "description": "In this car the “sports” idea has been brought to a classic form – the world premiere of the new Audi S5 in Geneva.<img src=\"http://feeds.feedburner.com/~r/AudiParis2006EN/~4/XZ70EjOttj4\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "21828593",
            "sourceUrl": "http://microsites.audi.com/audio/videocast/en_US/feed/10_audi_videocast_s5_en.m4v",
            "categories": [
                "Business News"
            ]
        },
        {
            "title": "Impressive world premieres in Geneva",
            "datePublished": "Mon, 12 Mar 2007 11:32:00 +0100",
            "description": "Join us for a visit on the 77th international motor show in Geneva and see the stunning world premieres: The Audi A5 and S5 successfully unite the acclaimed Audi design language and thrilling dynamic driving performance, and combine generous refinement with the brand’s characteristic quality and sophistication.<img src=\"http://feeds.feedburner.com/~r/AudiParis2006EN/~4/YsPiupzNQFI\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "21828593",
            "sourceUrl": "http://microsites.audi.com/audio/videocast/en_US/feed/9_audi_videocast_geneva_en.m4v",
            "categories": [
                "Business News"
            ]
        },
        {
            "title": "Impressive TDI Power at the NAIAS 2007",
            "datePublished": "Wed, 10 Jan 2007 19:32:06 +0100",
            "description": "Two world premieres and the impressive TDI technology emphasize Audi's role as an automotive pioneer on the North American Motor Show in Detroit. Join us for a visit to the Audi stand and see the Audi Q7 V12 TDI concept and the Audi Q7 3.0 TDI.<img src=\"http://feeds.feedburner.com/~r/AudiParis2006EN/~4/weuZdr724Z8\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "21828593",
            "sourceUrl": "http://microsites.audi.com/audio/videocast/en_US/feed/8_audi_videocast_detroit_en_ipod.m4v",
            "categories": [
                "Business News"
            ]
        },
        {
            "title": "R8 ignition - expressing ultimate sportiness",
            "datePublished": "Thu, 21 Dec 2006 13:18:02 +0100",
            "description": "Design Miami/ 2006 has become one of the groundbreaking gatherings of top designers. Located in the atrium of the Moore Building, Audi revealed the R8 ignition installation. Teardrop shaped arrows shoot across the room, expressing motion and speed.<img src=\"http://feeds.feedburner.com/~r/AudiParis2006EN/~4/wUuB63usNlw\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "15828604",
            "sourceUrl": "http://microsites.audi.com/audio/videocast/en_US/feed/7_audi_videocast_miami_ipod_en.m4v",
            "categories": [
                "Business News"
            ]
        },
        {
            "title": "Audi at the LA Auto Show in Los Angeles",
            "datePublished": "Wed, 20 Dec 2006 18:04:27 +0100",
            "description": "Join us for a retrospective of the LA Auto Show 2006 in Los Angeles and see the highlights of the Audi booth - including the world premiere of the new Audi TT Roadster.<img src=\"http://feeds.feedburner.com/~r/AudiParis2006EN/~4/_IZt2MIKzms\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "23009995",
            "sourceUrl": "http://microsites.audi.com/audio/videocast/en_US/feed/6_audi_videocast_en.m4v",
            "categories": [
                "Business News"
            ]
        },
        {
            "title": "Audi TT Roadster world premiere in LA",
            "datePublished": "Thu, 07 Dec 2006 15:32:58 +0100",
            "description": "The new Audi TT Roadster is about to be launched – with the unmistakable clarity of its original design. The new Audi TT Roadster – a genuine sports car. Experience its world premiere on the Los Angeles Auto Show 2006.<img src=\"http://feeds.feedburner.com/~r/AudiParis2006EN/~4/z9CYflYO8pA\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "18692934",
            "sourceUrl": "http://microsites.audi.com/audio/videocast/en_US/feed/5_audi_videocast_en.m4v",
            "categories": [
                "Business News"
            ]
        },
        {
            "title": "Audi at the Mondial de l' Automobile 2006 (4)",
            "datePublished": "Tue, 03 Oct 2006 12:28:19 +0200",
            "description": "This is a cult car, an icon –  the Audi TT took the sports coupe segment by storm. Now the second generation is making its debut. The new TT Coupe embodies sheer dynamism – in its design, in its engine output and in its performance. See it in Paris.<img src=\"http://feeds.feedburner.com/~r/AudiParis2006EN/~4/KwrjsUQuvRQ\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "23957575",
            "sourceUrl": "http://microsites.audi.com/audio/videocast/en_US/feed/4_audi_videocast_paris.m4v",
            "categories": [
                "Business News"
            ]
        },
        {
            "title": "Audi at the Mondial de l' Automobile 2006 (3)",
            "datePublished": "Mon, 02 Oct 2006 19:27:09 +0200",
            "description": "With the Audi R10 TDI, victorious TDI power is on display at the Audi Stand on the Paris Motor Show: The sports prototype won the legendary 24 hours of Le Mans race in 2006. In the Audi Q7, this technology will find its way into a regular production car.<img src=\"http://feeds.feedburner.com/~r/AudiParis2006EN/~4/9BNk3pTTS9U\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "24091294",
            "sourceUrl": "http://microsites.audi.com/audio/videocast/en_US/feed/3_audi_videocast_paris.m4v",
            "categories": [
                "Business News"
            ]
        },
        {
            "title": "Audi at the Mondial de l' Automobile 2006 (2)",
            "datePublished": "Sun, 01 Oct 2006 19:11:16 +0200",
            "description": "Created from our most potent ideas. The Audi R8 attracts the enthusiast with close attention to technical detail and superb driving dynamics. Visit the Audi stand in Paris and see the Audi R8.<img src=\"http://feeds.feedburner.com/~r/AudiParis2006EN/~4/vq15kqD8S58\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "24398711",
            "sourceUrl": "http://microsites.audi.com/audio/videocast/en_US/feed/2_audi_videocast_paris.m4v",
            "categories": [
                "Business News"
            ]
        },
        {
            "title": "Audi at the Mondial de l' Automobile 2006 (1)",
            "datePublished": "Fri, 29 Sep 2006 22:03:44 +0200",
            "description": "Come with us for a visit to the Audi stand on the Paris Motor Show 2006 and experience all news and world premieres in our video podcast. See the new Audi R8 sports car, the sporty Audi S3, the stylish Audi TT Coupé and the Le Mans winning s Audi R10 TDI.<img src=\"http://feeds.feedburner.com/~r/AudiParis2006EN/~4/mJXr6I1TP1w\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "22845339",
            "sourceUrl": "http://microsites.audi.com/audio/videocast/en_US/feed/1_audi_videocast_paris.m4v",
            "categories": [
                "Business News"
            ]
        }
    ]
}