{
    "artwork": "http://is3.mzstatic.com/image/thumb/Music111/v4/77/69/ab/7769ab8d-d295-bbac-6ff4-f6d0d5a561bf/source/100x100bb.jpg",
    "description": "Hello! I'm Alison, this is my podcast and my ONLY goal for it is to help you feel more awesome each time you listen. Whether it’s by laughing at me, laughing with me, or learning something new and helpful, I hope you feel more empowered and awesome than you did before!",
    "feedURL": "http://feeds.soundcloud.com/users/soundcloud:users:278452196/sounds.rss",
    "podcastURL": "http://thealisonshow.com",
    "title": "Awesome with Alison",
    "episodes": [
        {
            "title": "Ep. 137: Arrange whatever pieces come your way",
            "datePublished": "Thu, 12 Nov 2020 22:52:22 +0000",
            "description": "Have you heard I’m writing a book?!! Well I am! And it has been...let’s just say challenging?! Ha! But this quote from Virginia Woolf has been guiding me, “Arrange whatever pieces come your way.” In this episode I’m sharing how to do that, what it feels like and how it’s going to help you be the person you’ve only ever dreamed of being! Let’s do this!\n\nEric's closing song is \"On Your Mind,\" from his Pleasant Pictures Music Club. You make videos. We make dope music.\nUse code: AWESOMEWITHERIC\nfor 20% off!\npleasantpictures.club",
            "length": "73330688",
            "sourceUrl": "http://feeds.soundcloud.com/stream/928264972-awesomewithalison-ep-137-arrange-whatever-pieces-come-your-way.mp3"
        },
        {
            "title": "136: How to SHOW UP and live! Even if you have no idea what’s going to happen!",
            "datePublished": "Thu, 05 Nov 2020 04:24:04 +0000",
            "description": "Oh life! Aren’t you fun!! But holy crap if you aren’t also full of so much unknown! So how do we do it? How do we keep showing up? How do we not spontaneously combust? How do we not have panic attacks every hour or lay in bed all day when we have no idea what the future holds? And when we have no idea what’s coming for us? Good question! Here’s what I’ve got so far:\n5 quick tools for showing up in uncertainty!\n\nI know it will serve you! It’s been helping me! And yes, we don’t know what’s going to happen...but we know how we want to show up! In this episode I quickly break down some ideas for HOW to do it! Let’s go!\n\nShow UP for 2021 with my Year of Awesome calendar on sale now!\nhttps://partywithalison.com/products/2021-year-of-awesome-calendar-1\n\nEric's closing song is \"Phone Book\" from the dopest stock music library ever... Pleasant Pictures Music Club\n\nUse code: AWESOMEWITHERIC for 20% off!\n\nhttps://pleasantpictures.club",
            "length": "77318768",
            "sourceUrl": "http://feeds.soundcloud.com/stream/923595031-awesomewithalison-136-how-to-show-up-and-live-even-if-you-have-no-idea-whats-going-to-happen.mp3"
        },
        {
            "title": "135: Remix: Why it’s ok to be wrong and what’s intellectual humility?!",
            "datePublished": "Thu, 29 Oct 2020 16:35:58 +0000",
            "description": "Ooooh yeah! We are remixing a popular episode (75!) and updating it with an awesome study about intellectual humility! What’s that?! Listen up! You’re gonna love it!\n\nAnd before you snap back, \"THERE'S NO WAY I'M WRONG!\" Haha, this episode is intended to break your brain open a bit! We're talking about why it feels wrong to be wrong, but how being wrong can lead to so many wonderful things that are right! One huge takeaway from this episode is an exercise asking you to question if you're wrong about yourself, what you can do and what you are capable of! And not in the, \"You can't do it...\" way, but in the, \"But what if you can?!\" So go on a philosophical journey through time and space with us and see if you can't find some solutions or a little bit of awesome in thinking about your current life shtuff in a new way! I hope you love it!\n\nArticle referenced!\n\nhttps://today.duke.edu/2017/03/modest-personality-trait-intellectual-humility-packs-punch\n\nEric's closing song is \"Morning of the First Snow\" from his stock music library Pleasant Pictures Music Club\n\nUse code: AWESOMEWITHERIC\nfor 20% off!\nhttps://pleasantpictures.club",
            "length": "78657176",
            "sourceUrl": "http://feeds.soundcloud.com/stream/919692463-awesomewithalison-135-remix-why-its-ok-to-be-wrong-and-whats-intellectual-humility.mp3"
        },
        {
            "title": "Ep. 134:  What’s on the inside will come out!",
            "datePublished": "Fri, 16 Oct 2020 01:33:34 +0000",
            "description": "Listen, I know what it’s like to feel at your complete wits end. To have voices from every direction telling you that to feel better and be who you want to be, what you need to do is never give up, change, and just try a little harder. And how that can make you want to cry because you’re already trying as hard as you can! That’s not the point of this episode (or anything I do)! The point of this episode is to help you think about what you actually want to carry each day, what you want to be filled with, and to give you a few simple ideas for how to do it! So you can feel a little more awesome than you did before. Not worse! Just a tiny bit better, possibly! Give it a try! You’re doing a really good job!\n\nYOUR FREE JOURNAL EXERCISE:\nhttps://thealisonshow.com/feelsgood/\n\nEric's closing song is \"Cascade Springs\" from the brand new AUTUMN MORNING Collection at his incredible stock music library Pleasant Pictures Music Club. https://pleasantpictures.club\n\nUse code: AWESOMEWITHERIC for 20% off and start creating today!",
            "length": "71218676",
            "sourceUrl": "http://feeds.soundcloud.com/stream/911285902-awesomewithalison-podcast-101420.mp3"
        },
        {
            "title": "133: How to tap into your intuition to feel more clarity and less anxiety with @dariluna_!",
            "datePublished": "Wed, 07 Oct 2020 16:18:39 +0000",
            "description": "Get ready for the exact ideas you need to set yourself FREE!!! YES! Who doesn’t want more clarity and peace right now? I know I need it! And that’s why my friend and the brilliant coach and speaker Dariana Moreina @dariluna_ is here to blow our minds! Dari and I talk about intuition, what it is and why following it is a good thing! And most importantly Dari shares awesome, concrete practices for HOW to freaking do it, even when we feel like we’re living in utter chaos! I love this conversation so much. I’m honored to get to share it! Share it with your soul, your loved ones, and surrender to your glorious flow!\n\nFind Dari online and give her love here:\nhttps://www.instagram.com/dariluna_/\n\nGrab one of my She Can’t Be Stopped shirts here!\nhttps://partywithalison.com/\n\nEric's closing song is \"Alpine Autumn\" from the raddest stock music library ever: Pleasant Pictures Music Club // https://pleasantpictures.club\n\nUse code: AWESOMEWITHERIC for 20% off",
            "length": "173249840",
            "sourceUrl": "http://feeds.soundcloud.com/stream/906583444-awesomewithalison-133-how-to-tap-into-your-intuition-to-feel-more-clarity-and-less-anxiety-with-dariluna.mp3"
        },
        {
            "title": "132: How to be bold, colorful & TRUE TO YOU! With @colormecourtney!",
            "datePublished": "Thu, 03 Sep 2020 15:40:55 +0000",
            "description": "One of the most beautiful, inspiring things to witness in life is someone being boldly, beautifully and fully themselves! And that’s EXACTLY what the insanely brilliant and talented Courtney Quinn of @colormecourtney seems to do so effortlessly! She inspires her community of millions to live a life full of color! Here she shares with me some of the lessons and life experiences that helped her learn how to live so incredibly. She’s a TREAT, a legit genius and you will be so freaking inspired to get out there and do YOU!\n\nLearn even more from Courtney Quinn! She’s featured in my Social Media FIRE SALE! It’s happening now for a limited time!\nhttps://alisonsbrandschool.com/fire-sale\n\nFind Courtney online and share the love!\nhttps://www.instagram.com/colormecourtney/\n\nEric's closing song is \"Party Picnic\" from the DANCE PARTY Collection at his stock music library Pleasant Pictures Music Club.\n\nUse code: AWESOMEWITHERIC for 20% off!",
            "length": "151997132",
            "sourceUrl": "http://feeds.soundcloud.com/stream/886950877-awesomewithalison-132-how-to-be-bold-colorful-true-to-you-with-colormecourtney.mp3"
        },
        {
            "title": "131: The Gospel of MOANA!!!",
            "datePublished": "Wed, 12 Aug 2020 19:46:01 +0000",
            "description": "We are doing it! WE ARE DOING IT! I am finally doing the episode of my dreams, and showing you how Moana (yes the Disney movie) can help you answer all of your life’s burning questions! Using this beautiful hero’s journey, I’m going to use examples from Moana to invite you to become more of the hero and conscious creator of your own journey and life. If you’re feeling stuck, unsure, hopeless or just BLEH, I think this episode will give you some direction and inspiration for the steps you can take next! Make way, make way!\n\nThe episode is sponsored by Shine Cosmetics! Get my custom lip gloss AWESOME here:\nhttps://shinecosmetics.com/products/awesome-by-the-alison-show\n\nUse the code ALISON to save!!!\n\nFind more empowering goodness here:\nhttps://www.instagram.com/shinecosmetics/\n\nEric's closing song is \"Hawaii\" from the World Guitar Collection at his incredible music library Pleasant Pictures Music Club.\n\nUse code: AWESOMEWITHERIC for 20% off and start making the best videos ever!",
            "length": "142484204",
            "sourceUrl": "http://feeds.soundcloud.com/stream/874685521-awesomewithalison-131-the-gospel-of-moana.mp3"
        },
        {
            "title": "130: Facing your fears, trusting yourself, and why it’s so WORTH IT! with @britbarron",
            "datePublished": "Wed, 29 Jul 2020 16:28:03 +0000",
            "description": "YAY! We’ve got educator, speaker, and author Brit Barron with us today! And baby it’s so so so good! I’m talking to her about her incredible new book Worth It! And holy crap, is this book worth the read! In it Brit shares her story of being boxed in by fears and feeling unable to make the changes she desired, and then helps us learn how she finally decided to leave her old life behind for one that has allowed her to live in her full potential. Brit poses so many good questions that will BLOW YOUR MIND and help tune you in to how to trust yourself more, and face those fears! Brit’s leading by example showing you that hard work to do so is so WORTH IT!\n\nGet Brit’s Book!\nhttps://tinyurl.com/y69yxb9c\n\nFollow Brit on Instagram\nhttps://www.instagram.com/britbarron/\n\nSnatch up my I’m Doing Awesome Journal\nhttps://partywithalison.com/products/im-doing-awesome-journal\n\nEric's closing song is \"OUR TIME\" from the dopest music library ever... Pleasant Pictures Music Club. \nUse code: AWESOMEWITHERIC for 20% off for life!",
            "length": "167450420",
            "sourceUrl": "http://feeds.soundcloud.com/stream/866635057-awesomewithalison-130-facing-your-fears-trusting-yourself-and-why-its-so-worth-it-with-britbarron.mp3"
        },
        {
            "title": "129: How to Feel, Deal, & Heal with therapist and powerhouse @heytiffanyroe",
            "datePublished": "Thu, 16 Jul 2020 18:38:03 +0000",
            "description": "It’s about time I got a licensed therapist on here to help us navigate the barrage of uncomfortable, new, hard and exhausting emotions that are circulating right now! And there’s no better woman for the job than Tiffany Roe! Tiffany is not only an incredible, FUN therapist and owner of Mindful Counseling, she’s also going to open up to us about her journey to becoming a therapist, and what her battle with diet culture and eating disorders has taught her about how to FEEL DEAL and HEAL! Tiffany also shares a Feel, Deal, Heal mindfulness practice with us! We used some of Eric’s music and it’s SO GOOD! So come back to it time and time again!\n\nFollow Tiffany on Instagram\nhttps://www.instagram.com/heytiffanyroe/\n\nCheck out her Feel, Deal Heal subscription\nhttps://tiffanyroemerch.com/\n\nEric's closing song is \"Nobody Else\" from the brand new collection LOFI Hip Hop at Pleasant Pictures Music Club\n\nGet access to the dopest music ever by going to pleasantpictures.club and using code : AWESOMEWITHERIC for 20% off!!!",
            "length": "141398444",
            "sourceUrl": "http://feeds.soundcloud.com/stream/859144576-awesomewithalison-129-how-to-feel-deal-heal-with-therapist-and-powerhouse-heytiffanyroe.mp3"
        },
        {
            "title": "128: Cultivating belonging and self-love even w/ the odds against you w/ Stacey Harkey!",
            "datePublished": "Wed, 01 Jul 2020 17:34:55 +0000",
            "description": "Stacey Harkey is an actor, comedian and all-around GENIUS! And he is showing up BIG to share his light, love and wisdom today! IT IS SO GOOD! Stacey shares his experiences coming to truly love himself, and how he has cultivated a sense of belonging as a proud black and gay man. Stacey is a gifted teacher, speaker and storyteller, and after listening to his life lessons mixed with some bomb.com plant analogies, you will feel empowered, awesome, and ready to be YOU in this crazy world! And possibly get a new house plant!\n\nI know you're loving the music at the end of the podcasts!\n\nYou can have access to use all of these and so many more by becoming a member of Pleasant Pictures Music Club! You will have the raddest music for: youtube / instagram / podcasts / ads / films / anything!\n\nUse code: AWESOMEWITHERIC for 20% off!\npleasantpictures.club",
            "length": "175821212",
            "sourceUrl": "http://feeds.soundcloud.com/stream/850351405-awesomewithalison-128-cultivating-belonging-and-self-love-even-w-the-odds-against-you-w-stacey-harkey.mp3"
        },
        {
            "title": "Ep. 127: YOU MATTER a poem and WISDOM! from Darryl Dzapasi",
            "datePublished": "Wed, 10 Jun 2020 23:26:03 +0000",
            "description": "Today I’m sharing with you what might be one of my favorite episodes ever! My new friend and phenomenal poet Darryl Dzpasi is here to share his poem called YOU MATTER. Darryl wrote this poem after learning about the tragic death of George Floyd--he wrote it as a message for himself and the world around him. Darryl beautifully reads his poem (grab your tissues), and then generously talks to me about the experiences of his life that contributed to writing it. I also have Darryl tell me how he got to be so WISE and DEEP! You’ll get actionable takeaways for self-love, compassion, and navigating difficult emotions, as well as deep insight and perspective from Darryl’s unique experiences, which I know is so needed right now. I’m so excited to share this with you!\n\nFollow Darryl on Instagram here:\nhttps://www.instagram.com/darryldzapasi/\n\nFind the words of Darryl’s YOU MATTER poem here:\nhttps://www.instagram.com/p/CBCVpPAgxoR/\n\nThe meditation practice Darryl references here:\nhttps://tinyurl.com/ya9l7gdk\n\nEric's closing song is \"How Does It Feel\" from the amazing INDIE DANCE POP Collection at his amazing Stock Music Library, Pleasant Pictures Music Club. \nUse code: AWESOMEWITHERIC for 20% off\nThe whole library for a limited time is only $99/yr\npleasantpictures.club",
            "length": "126285500",
            "sourceUrl": "http://feeds.soundcloud.com/stream/837887941-awesomewithalison-ep-127-you-matter-a-poem-and-wisdom-from-darryl-dzapasi.mp3"
        },
        {
            "title": "Ep. 126:  Alison’s Storytime: Only slightly traumatic childhood memories!",
            "datePublished": "Wed, 20 May 2020 21:56:00 +0000",
            "description": "Today I simply want to entertain you and give you a break! So I’m sharing two of my favorite, only slightly traumatic childhood memories! You’ll laugh (maybe not as hard as Eric does…) you’ll possibly cry, but mostly I hope you just get a chance to connect with me, and most importantly connect with yourself. You’re doing a really good job. Keep showing up as YOU, exactly as you are.\n\nHere’s my I’m Doing Awesome Journal\nhttps://partywithalison.com/products/im-doing-awesome-journal\n\nCheck out Awesome on Demand\nhttps://aod.thealisonshow.com/\n\nEric's closing song is \"Ready for Change\" from his incredible stock music library loaded with songs to use in your podcasts/youtube/instagram/ads/films/whatever! For a limited time get the whole library for $99/yr!\n\nUse code: AWESOMEWITHERIC for additional 20% off!\npleasantpictures.club",
            "length": "69469568",
            "sourceUrl": "http://feeds.soundcloud.com/stream/824724418-awesomewithalison-ep-126-alisons-storytime-only-slightly-traumatic-childhood-memories.mp3"
        },
        {
            "title": "Ep. 125: What to do when you don’t want to/can’t get out of bed!",
            "datePublished": "Wed, 06 May 2020 20:16:31 +0000",
            "description": "This is THE EPISODE for those of you who have a hard time getting out of bed, or for those of you who want to understand a loved one in your life who has a hard time getting out of bed! Whether it’s stemming from a circumstance or from depression, sometimes starting the day can be the biggest battle. I’ve talked to lots of people, as well as gotten EXCELLENT feedback from the Awesome Empire community, to fill this episode with 4 easy steps for when you just can’t seem to get going--as well as dozens of ideas for how to get a little spark! I hope this serves you, helps you understand someone you love, and gives you ideas of how to take action with love and acceptance!\n\nJoin the Journal-a-thon and mini course for overcoming overwhelm!\nhttps://thealisonshow.com/journalathon/\n\nHere’s my I’m Doing Awesome Journal\nhttps://partywithalison.com/products/im-doing-awesome-journal\n\nEric's closing song is \"We Thank You\" from the dopest stock music library to ever exist, Pleasant Pictures Music Club. http://pleasantpictures.club\n\nUse code: AWESOMEWITHERIC for 20% off and snag the library while its hot!",
            "length": "97849088",
            "sourceUrl": "http://feeds.soundcloud.com/stream/815029699-awesomewithalison-ep-125-what-to-do-when-you-dont-want-tocant-get-out-of-bed.mp3"
        },
        {
            "title": "Ep. 124: How’s that new normal going for ya? 5 tips for adjusting with more ease!",
            "datePublished": "Thu, 30 Apr 2020 11:00:18 +0000",
            "description": "One thing we can all agree on is that the world is CHANGED! Each of us has been affected differently during this pandemic, but there is a stark “before COVID-19” for each of us. And as we work on adjusting to “during COVID” and look hopefully towards our “AFTER” we are re-sharing 5 tips that have already helped thousands of people adjust to new normals over the past two years. They are relevant in a whole new light! So no matter where you’re at right now, I know these tips can serve and support you. I hope they help you make transitions in your life with more ease, love and compassion. YOU’VE GOT THIS!\n\nEric's closing song is \"Rabbits and Hats\" from the Urban Magic Collection at the raddest stock music library ever... Pleasant Pictures Music Club. For a limited time our library is only $99!\n\nUse code: AWESOMEWITHERIC for 20% off!\n\npleasantpictures.club",
            "length": "76300928",
            "sourceUrl": "http://feeds.soundcloud.com/stream/809274298-awesomewithalison-ep-124-hows-that-new-normal-going-for-ya-5-tips-for-adjusting-with-more-ease.mp3"
        },
        {
            "title": "Ep. 123:  Things to watch, read, and FUN STUFF we’re LOVING right now!",
            "datePublished": "Wed, 22 Apr 2020 18:42:55 +0000",
            "description": "In this episode we’re taking a deep breath and leaning into the art of doing nothing! We’re dissecting why being bored is a good thing, how important it is to create space and fight for alone time, and sharing what we love to do when we get it! Eric and I are dishing on shows, books and hobbies we are loving, and hope it inspires you to find some levity and fun, no matter how dark and dreary things get!\n\nI’m Doing Awesome Daily Guided Journal\nhttps://partywithalison.com/products/im-doing-awesome-journal\n\nEric's closing song is \"Deathbeat\" from his lates New Shack EP you can find here:\nhttps://music.apple.com/us/album/so-soda-ep/1475250093\nand\nhttps://open.spotify.com/album/694mFDgjkZEZ4DodUYRJj9?si=zO31buRXQcuePhRPEHYPgg",
            "length": "88368128",
            "sourceUrl": "http://feeds.soundcloud.com/stream/804740866-awesomewithalison-ep-123-things-to-watch-read-and-fun-stuff-were-loving-right-now.mp3"
        },
        {
            "title": "Ep. 122: Why capacity isn’t the same as ability (and how to be nicer to yourself) w/ @thebirdspapaya",
            "datePublished": "Thu, 16 Apr 2020 17:43:55 +0000",
            "description": "It’s easy to think that because we have time or the ability to do something, that the only reason we don’t do it is because we’re lazy and the worst! But what if there’s another factor?! (Hint: there is!) In this episode the wildly popular and amazing speaker and self-love advocate Sarah Landry of @thebirdspapaya and I discuss how capacity isn’t the same as ability! Sarah shares the hard lessons that have helped her learn this important distinction! And gives us all 3 concrete ideas for measuring where your capacity is at RIGHT NOW! Sarah is insightful, hysterical, transparent, and downright DELIGHTFUL! You’re going to LOVE this conversation, and thought nuggets Sarah shares!\n\nWant to support us?! THANK YOU!\n\nListen to the Papaya Podcast:\nhttps://podcasts.apple.com/us/podcast/the-papaya-podcast/id1469615517\n\n Hang out with Sarah on Instagram:\nhttps://www.instagram.com/thebirdspapaya/?hl=en\n\nI’m Doing Awesome Daily Guided Journal\nhttps://partywithalison.com/products/im-doing-awesome-journal\n\nEric's closing song is \"I Want To Go To There\" from his incredible stock music library Pleasant Pictures Music Club. For a limited time the library is only $99!\n\nUse code: AWESOMEWITHERIC for an additional 20% off!\nhttp://pleasantpictures.club",
            "length": "90245888",
            "sourceUrl": "http://feeds.soundcloud.com/stream/800204542-awesomewithalison-ep-122-why-capacity-isnt-the-same-as-ability-and-how-to-be-nicer-to-yourself-with-thebirdspapaya.mp3"
        },
        {
            "title": "Ep. 121: Playing the cards you’ve been dealt!",
            "datePublished": "Wed, 08 Apr 2020 12:00:23 +0000",
            "description": "Listen. I’m not sugarcoating anything here. I’m mad, I’m sad. I’m NOT HAPPY WITH THESE CARDS I’VE BEEN DEALT, and that so many others are being dealt. But in this episode I’m sharing how I’ve been deciding to play these cards, what that means, and how we can all try to move into some awareness right now! No matter when you listen to this, pandemic or not, it will be relevant to what life can deal us, and what we CAN DO ABOUT IT!\n\nWant to support us?! THANK YOU!\n\nI’m Doing Awesome Daily Guided Journal\nhttps://partywithalison.com/products/im-doing-awesome-journal\n\nSHE CAN’T BE STOPPED SHIRT\nhttps://partywithalison.com/products/she-cant-be-stopped-shirt\n\nEric's closing song is \"Hit and MIss\" from his stock music library Pleasant Pictures Music Club. For a limited time our library is only $99/yr!\nUse code: AWESOMEWITHERIC for 20% off\nhttp://pleasantpictures.club",
            "length": "59916608",
            "sourceUrl": "http://feeds.soundcloud.com/stream/793220266-awesomewithalison-ep-121-playing-the-cards-youve-been-dealt.mp3"
        },
        {
            "title": "Ep. 120: Building body image resilience through thick and thin with @beauty_redefined!",
            "datePublished": "Thu, 02 Apr 2020 18:03:03 +0000",
            "description": "Watch out! I’m bringing in the big guns when it comes to learning about how we see and treat our bodies! I knew this was SO NEEDED right this minute, and it’s going to be a life-changer for sure! Get ready to let go of shame and have your mind blown! I’ve got one half of the INCREDIBLE PhD touting twin duo that runs the nonprofit Beauty Redefined, Lexie Kite! And Lexie is helping us (and of course I also mean me) work on how to build body image resilience--and learn what that even means! We’ll talk about how your body is an instrument and not an ornament! I argue with her a bit about my own issues, which of course we work through and I cry. And then we examine how we can pass on healthier ideas to future generations! IT’S SO GOOD! I’m so grateful for the work that Beauty Redefined is doing, it is changing my life and I can’t wait for it to change yours too!\n\nGet your I'm Doing Awesome Journal or She Can't Be Stopped T HERE!\nhttps://partywithalison.com/collections/awesome-collection\n\nEric's closing song is \"Grass Valley\" from the brand new CALIFORNIA TRAIL Collection at Pleasant Pictures Music Club.\n\nFor the best stock music for you videos head to pleasantpictures.club where our ENTIRE LIBRARY IS $99!!!\n\nUse code: AWESOMEWITHERIC for 20% off",
            "length": "146255168",
            "sourceUrl": "http://feeds.soundcloud.com/stream/789331648-awesomewithalison-ep-120-building-body-image-resilience-through-thick-and-thin-with-beauty_redefined.mp3"
        },
        {
            "title": "Ep. 119: How to always DO YOUR BEST! The 4 Agreements Read Along Pt. 4!",
            "datePublished": "Wed, 25 Mar 2020 16:23:57 +0000",
            "description": "Does “Do your best!” automatically stress you out? Do you feel overwhelmed and exhausted when you hear that? OR do you feel guilt like you should be pushing harder? Either way we’re going to help you see how your “best” won’t and can’t come from either of these places! We are doing a read along of Don Miguel Ruiz’s The Four Agreements--and the fourth one is: Do Your Best! But we’re breaking down how there’s no stress or shame required! And how truly doing your best will help you become a master of transformation! We have loved doing the read along with you and know this final installment will be the cherry on top!\n\nJoin the Read Along and get some bookmarks!\nthealisonshow.com/readalong\n\nGet a free trial and book from Audible!\nhttp://audibletrial.com/awesomewithalison \n\nThe Four Agreements Book \nhttps://www.amazon.com/dp/1878424319/?ref=exp_thealisonshow_dp_vv_d\n\nEric's closing song is \"Celtic\" from the raddest stock music library ever... Pleasant Pictures Music Club!\n\nUse code: AWESOMEWITHERIC for 20% off\npleasantpictures.club",
            "length": "86969504",
            "sourceUrl": "http://feeds.soundcloud.com/stream/782634727-awesomewithalison-podcast-32420-do-your-best.mp3"
        },
        {
            "title": "Ep. 118: Don’t Make Assumptions (During a pandemic?!): The 4 Agreements Read Along Pt. 3!",
            "datePublished": "Wed, 18 Mar 2020 12:00:13 +0000",
            "description": "HOLY CRAP! The fact that THIS agreement popped up at THIS time is just BANANAS! A pandemic could not be a better, more perfect time to work on not making assumptions! We are doing a read along of Don Miguel Ruiz’s The Four Agreements, and he suggests that making assumptions is one of the main things that causes our sadness and suffering! Eric and I discuss how making assumptions during this time of uncertainty in the world keeps us from connecting and being unified. And I offer you 5 affirmations that I use on the daily to help keep me from jumping to conclusions and making judgements. We love you, we are grateful for this community and we hope that this episode offers you some ideas to help you feel a little more awesome. \n\nJoin the Read Along and get some bookmarks!\nthealisonshow.com/readalong\n\nGet a free trial and book from Audible!\nhttp://audibletrial.com/awesomewithalison \n\nThe Four Agreements Book \nhttps://www.amazon.com/dp/1878424319/?ref=exp_thealisonshow_dp_vv_d\n\nEric's closing song is \"Hold On, The Light Will Come\" from the album:\nhttps://music.apple.com/us/album/hold-on-a-modern-tribute-to-the-music-of-michael-mclean/1430149514\n\nLove you all!",
            "length": "96243356",
            "sourceUrl": "http://feeds.soundcloud.com/stream/777838570-awesomewithalison-ep-118-dont-make-assumptions-during-a-pandemic-the-4-agreements-read-along-pt-3.mp3"
        },
        {
            "title": "Ep. 117: Don’t take anything personally?!: The 4 Agreements Read Along Pt. 2!",
            "datePublished": "Wed, 11 Mar 2020 13:00:00 +0000",
            "description": "Get ready to get personal, haha, this week as part of our read along we are talking about the life-changing principle of not taking anything personally! AND HOLY CRAP is this one hard! But as Don Miguel Ruiz promises in his book The Four Agreements, “Your sadness will disappear.” If you’re able to master this, so we think it’s at least worth a try! I give you 5 questions I ask myself to help take the personal sting out of things, and how we’re working on and trying to live this agreement! It’s such a good one and it will change your world! \n\nJoin the Read Along and get some bookmarks!\nthealisonshow.com/readalong\n\nCome build your business with me at my upcoming mastermind retreat!\nAlisonsbrandschool.com/retreat\n\nGet a free trial and book from Audible!\nhttp://audibletrial.com/awesomewithalison \n\nThe Four Agreements Book \nhttps://www.amazon.com/dp/1878424319/?ref=exp_thealisonshow_dp_vv_d\n\nEric's closing song is \"Brazil\" from the new WORLD GUITAR Collection at Pleasant Pictures Music Club.  \n\nUse code: AWESOMEWITHERIC for 20% off the dopest stock music library ever.\npleasantpicturesclub",
            "length": "81519824",
            "sourceUrl": "http://feeds.soundcloud.com/stream/772023283-awesomewithalison-podcast-3620-2nd-agreement.mp3"
        },
        {
            "title": "Ep. 116: Being impeccable with your word: The 4 Agreements Read Along Pt. 1!",
            "datePublished": "Wed, 04 Mar 2020 13:00:30 +0000",
            "description": "This is SUCH A TREAT! We are doing our first ever Awesome with Alison READ ALONG! And of course, it had to be one of our favorite books, The Four Agreements by Don Miguel Ruiz! YOU WILL LOVE THIS! Now, don’t skip this episode if you haven’t read or don’t plan on reading the book, because you are still going to get SO MUCH! This week we are talking about the first agreement of being impeccable with your word! We share our personal experience with trying to live this, and I give 5 easy tips that have helped me speak with more love and power! All while trying to keep out of those nasty habits of negative self talk and gossip! Eric and I are so excited to be sharing this with you! Listen up!\n\nJoin the Read Along and get some bookmarks!\nthealisonshow.com/readalong\n\nCome build your business with me at my upcoming mastermind retreat!\nAlisonsbrandschool.com/retreat\n\nGet a free trial and book from Audible!\nhttp://audibletrial.com/awesomewithalison \n\nThe Four Agreements Book \nhttps://www.amazon.com/dp/1878424319/?ref=exp_thealisonshow_dp_vv_d\n\nEric's closing song is \"Me Time Pt. 2\" from the dopest stock music library in the galaxy... Pleasant Pictures Music Club!\n\nUse code: AWESOMEWITHERIC for 20% off at pleasantpictures.club",
            "length": "99132104",
            "sourceUrl": "http://feeds.soundcloud.com/stream/770490550-awesomewithalison-ep-116-being-impeccable-with-your-word-the-4-agreements-read-along-pt-1.mp3"
        },
        {
            "title": "Ep. 115: Our greatest epiphanies, what to do if you’re unsure of your purpose, and other FAQs!",
            "datePublished": "Wed, 26 Feb 2020 18:52:09 +0000",
            "description": "We are taking some of the questions we get asked the most and dishing it HOT today! Watch out because we’re holding nothing back, and sometimes the truth hurts! Ha, but really, Eric and I loved doing this, I love the answers we shared, and I know you’ll leave feeling inspired! You’ll also learn at least one tangible step you can take right now to help you with any problem you’re facing! Let’s do it!\n\nGet some free bookmarks and join the read along!\nthealisonshow.com/readalong\n\nGet a free trial and book from Audible!\nhttp://audibletrial.com/awesomewithalison \n\nThe Four Agreements Book \nhttps://www.amazon.com/dp/1878424319/?ref=exp_thealisonshow_dp_vv_d\n\nRetreat\nAlisonsbrandschool.com/retreat\n\nEric's closing song is \"Hot Damn\" in the new FUNKY FRESH VOL. 2 at Pleasant Pictures Music Club.\n\nUse code: AWESOMEWITHERIC for 20% off\npleasantpictures.club",
            "length": "90581744",
            "sourceUrl": "http://feeds.soundcloud.com/stream/766974637-awesomewithalison-ep-115-our-greatest-epiphanies-what-to-do-if-youre-unsure-of-your-purpose-and-other-faqs.mp3"
        },
        {
            "title": "Ep. 114: Holy crap, I can’t handle this: Navigating the hard stuff!",
            "datePublished": "Wed, 19 Feb 2020 15:23:12 +0000",
            "description": "This episode is really good! There, I SAID IT! But I know it’s so good because I created it after I was dealt a heavy blow, and leaned into inspiration, even in deep saddness, to follow these steps. They flowed to me, and kept me from spiraling even harder into the dark place! I know they will serve you too because I’ve tested them out and gotten feedback on them from my powerful Awesome on Demand group! And I’m just so excited to see what you do with them! We explore your go-to emotions, and I really lay out what it means to FEEL your feelings. Let’s do it!\n\nJoin us at our Mastermind Retreat! alisonsbrandschool.com/retreat\n\nTake is to the next level with Awesome on Demand! https://aod.thealisonshow.com/\n\nEric's closing song is \"Dizzy\" from the brand new Funky Fresh Vol.2 at Pleasant Pictures Music Club. Get access to the dopest stock music ever at pleasantpictures.club\n\nUse code: AWESOMEWITHERIC for 20% off",
            "length": "103249640",
            "sourceUrl": "http://feeds.soundcloud.com/stream/763031146-awesomewithalison-podcast-2182020.mp3"
        },
        {
            "title": "Ep. 113: 5 Lessons I learned from a topless resort about busting out of your comfort zone!",
            "datePublished": "Thu, 06 Feb 2020 17:30:03 +0000",
            "description": "Remember that one time Eric and I went on vacation and accidentally booked a week at a topless party resort?! No? WE DO! Now, a topless Spring-break-like party resort might be your jam--and I applaud you--but it’s nothing like what we’re used to! I learned SO many lessons about BUSTING out of our comfort zone, and I just couldn’t wait to share! I’ve got 5 concrete takeaways for you--and a whole lot of me trying to figure out what to wear! So I know you’ll find something good!\n\nEric'c closing song is \"High Desert\" from the CAMPFIRE collection at the best stock music library in the world: Pleasant Pictures Music Club.\n\nUse code AWESOMEWITHERIC for 20% off\npleasantpictures.club",
            "length": "109619084",
            "sourceUrl": "http://feeds.soundcloud.com/stream/756172984-awesomewithalison-ep-113-5-lessons-i-learned-from-a-topless-resort-about-busting-out-of-your-comfort-zone.mp3"
        },
        {
            "title": "Ep. 112: Do less attract more & how to get out of low, dark places with Gabby Bernstein!",
            "datePublished": "Wed, 29 Jan 2020 13:00:20 +0000",
            "description": "No, it’s fine! DON’T FREAK OUT! I just got to talk to one of my greatest teachers and a woman I ADORE, the 7X New York Times best-selling author, and renowned speaker, Gabby Bernstein! We cover so many important topics in this episode! And I KNOW you’re going to get something good! We talk about Postpartum Anxiety, medication, and how to start feeling better even from the lowest, darkest places. We dive into how to become a Super Attractor and also touch on social media, and an addiction I didn’t even realize was the cause of so much anxiety in me for so long. It’s revelatory! Gabby is a pro at sharing actionable tools that will help you feel better immediately, and she shares tons here, so get ready to get HOOKED UP! \n\nEric's closing song is \"9th & 9th\" from his high end stock music library Pleasant Pictures Music Club. pleasantpictures.club\n\nUse code: AWESOMEWITHERIC for 20% off!",
            "length": "121490408",
            "sourceUrl": "http://feeds.soundcloud.com/stream/751138879-awesomewithalison-ep-112-do-less-attract-more-how-to-get-out-of-low-dark-places-with-gabby-bernstein.mp3"
        },
        {
            "title": "Ep. 111: More vs. Growth: How to stop the disease that’s robbing you of your happiness!",
            "datePublished": "Wed, 15 Jan 2020 19:21:22 +0000",
            "description": "So many of us are chasing goals—achieving them and STILL never feeling satisfied! I started noticing that the need for MORE MORE MORE was masquerading as wanting “growth” in my life—and it was leaving me feeling drained and crappy! So we’re diving into how to root out whether your goals and dreams are rooted in the healthy, empowering place of GROWTH vs the draining need for MORE! It has helped me be braver to try new ideas and helped me be bolder in making decisions! And I know it can do the same for you, so I’m excited for you to listen up!\n\nEric's closing song is \"Low Tide\" from Pleasant Pictures Music Club. Use code: AWESOMEWITHERIC for 20% off and get the best stock music in the world for your videos!\n\npleasantpictures.club",
            "length": "97987880",
            "sourceUrl": "http://feeds.soundcloud.com/stream/743955325-awesomewithalison-podcast-11420.mp3"
        },
        {
            "title": "Ep. 110: How to create YOUR success story for anything you want to do!",
            "datePublished": "Wed, 08 Jan 2020 13:00:16 +0000",
            "description": "Whether we realize it or not, we are all carrying around beliefs and definitions of success. The real question is...does carrying them REALLY serve us? Is it what we REALLY believe? Or are these definitions and ideas something we picked up along the way and forgot to put down? THAT’S WHAT WE’RE TALKING ABOUT TODAY! As I give you a sneak preview of my Boss Babe Booster that lives in the content vault of my Awesome on Demand coaching program! We will help you uncover your OLD success stories, so that you can write new ones that enable you to do ANYTHING you want to do!\n\nJOIN MY FREE 5-Day Pump up! Starting January 14th!\n\nhttps://slkt.io/4Nba\n\nAnd don’t miss our deal of the decade in AWESOME ON DEMAND!\n\nhttps://aod.thealisonshow.com/?subid=2020\n\nEric's closing song is \"Gentle\" from the \"Hold On: A Modern Tribute to the Music of Michael McLean\" album. https://music.apple.com/us/album/hold-on-a-modern-tribute-to-the-music-of-michael-mclean/1430149514\n\nAnd as always, all you videographers out there need Pleasant Pictures Music Club... high end music for your projects! Use code: AWESOMEWITHERIC for 20% off!\n\npleasantpictures.club",
            "length": "119847152",
            "sourceUrl": "http://feeds.soundcloud.com/stream/739768345-awesomewithalison-ep-110-how-to-create-your-success-story-for-anything-you-want-to-do.mp3"
        },
        {
            "title": "Ep. 109: Trauma 101: How to help, what to say, and paths to healing!",
            "datePublished": "Wed, 18 Dec 2019 22:40:08 +0000",
            "description": "Ok! If you’re going through tough stuff, have ever been through tough stuff, OR know someone going through tough stuff (so if you’re a human) this episode IS FOR YOU! And I hope it will be a valuable resource for you! We’re doing a bit of Trauma 101, and sharing what it really is, how to help yourself and others in the middle of it or after it, and giving SO MANY ideas for reaching out to those around you! We are sharing the DO’s and the DO NOT’s and I’ve gathered ideas from lots of people and resources that I know will help us all serve with more confidence and love!\n\nCheck out the show notes for links to everything we talked about and an easy reference list of how to help people going through hard stuff!\n\nhttps://thealisonshow.com/podcasts/ep-109/\n\nWe are trying to raise money for 50 kids to get access to necessary trauma therapy through the Utah County Children’s Justice Center!\n\nWILL YOU HELP?! Even a $1 Would be SO GOOD!\n\nVENMO\n\nhttps://venmo.com/CJC-Provo\n\n@CJC-Provo\n\nVIA PAY PAL\n\nhttp://donate.cjcprovo.com\n\nKim can kick it video!\n\nhttps://www.instagram.com/p/B6Jl8vcBRJs/\n\nEric's closing song is \"All is Calm\" from the Old Fashioned Christmas Collection at his Pleasant PIctures Music Club. \n\nUse code: AWESOMEWITHERIC for 20% off\n\npleasantpictures.club",
            "length": "107047712",
            "sourceUrl": "http://feeds.soundcloud.com/stream/730506934-awesomewithalison-podcast-121719.mp3"
        },
        {
            "title": "Ep. 108:  How to love your life more without changing A THING!",
            "datePublished": "Wed, 11 Dec 2019 17:34:08 +0000",
            "description": "FRIENDS! I am feeling GOOD! Like awesome! And it’s not because outside circumstances have been booming, breezy or easy! But because of a few simple thought shifts that I’ve really been able to implement! I want you to be able to pick up these good vibes I’m putting down--right now--right this MINUTE! So I’ve got 4 easy tips for how you can love your life more RIGHT NOW--without changing a thing!\n\nEric's closing song is \"Deathbeat\" from the BRAND NEW EP FROM HIS BAND NEW SHACK!!!\n\nListen and share!!!\nhttps://music.apple.com/us/album/so-soda-ep/1475250093",
            "length": "88542812",
            "sourceUrl": "http://feeds.soundcloud.com/stream/726019048-awesomewithalison-ep-108-how-to-love-your-life-more-without-changing-a-thing.mp3"
        },
        {
            "title": "Ep. 107: Books that have changed my life!",
            "datePublished": "Wed, 04 Dec 2019 15:00:13 +0000",
            "description": "I like to think of books as the BEST kind of medicine to help cure what ails ya! I share about books all the time, but in this episode I’m sharing the books that HAVE CHANGED MY LIFE for the better, and helping you find which of these books can start to change your life too! So you have them all in one place! I hope you reference this time and time again, share it, and get inspired! I also share my tips for becoming more of a reader and how to get more book time in your life with ease! \n\n\n\nWANT A FREE AUDIO BOOK?!\n\nhttp://audibletrial.com/awesomewithalison\n\n\nFIND A FULL LIST OF THE BOOKS AND RECS HERE!\nhttps://thealisonshow.com/podcasts/ep-107-books-that-have-changed-my-life/\n\nEric's closing song is \"Sosoda\" a brand new single from his band New Shack!\n\nPlease stream it and share it far and wide and I, Eric, will be forever grateful.",
            "length": "124544108",
            "sourceUrl": "http://feeds.soundcloud.com/stream/722343193-awesomewithalison-podcast-12319.mp3"
        },
        {
            "title": "Ep. 106:  Family Fun Survival Tips!",
            "datePublished": "Wed, 27 Nov 2019 21:53:32 +0000",
            "description": "We are coming at you REMOTE AND LIVE from a fun family-filled holiday week (I’m at my parent’s in Southern California), and I am sharing my TOP TIPS for having LOOOOTS of together time! So whether you’re prepping for the holidays, a Sunday dinner, or honestly just a night out with people you love, I know these 5 quick tips will help you in any social setting you encounter! They’ll help you feel more love, find more understanding and also have more fun!\n\nEric's closing song isn \"Wake up Johnny, its Christmas again!\" from the new Old Fashion Christmas Collection.\n\nThis week only get a $99 subscription using code: TURKEYTIME\n\npleasantpictures.club",
            "length": "62051312",
            "sourceUrl": "http://feeds.soundcloud.com/stream/719453398-awesomewithalison-ep-106-family-fun-survival-tips.mp3"
        },
        {
            "title": "Ep. 105: A QUICK pep talk for when you want to quit!",
            "datePublished": "Wed, 13 Nov 2019 23:37:32 +0000",
            "description": "Oh hi, are things not working out the way you thought they would? Are you pretty sure it’s time to quit, give up or stop trying? Then I’m SO GLAD YOU ARE HERE--because I’ve BEEN THERE! And I have a QUICK, easy-to-listen to pep talk for you, I hope you come back to this one again and again because we need you champ! LISTEN UP!\n\nWant more tools like this QUICKLY and without any beginning or ending SHUTFF? You'll freaking LOVE Awesome On Demand:\n\nhttps://thealisonshow.com/awesomeondemand\n\nEric's closing song is \"City Kid\" from the new collection \"BIG SKY.\" If you are a content creator and need the best music you can get your hands on then head to pleasantpictures.club and sign up today!\n\nUse code: AWESOMEWITHERIC for 20% off your subscription and start creating today!",
            "length": "57679040",
            "sourceUrl": "http://feeds.soundcloud.com/stream/712445764-awesomewithalison-ep-105-a-quick-pep-talk-for-when-you-want-to-quit.mp3"
        },
        {
            "title": "Ep. 104: Are you a critic or a creator?",
            "datePublished": "Wed, 30 Oct 2019 20:04:30 +0000",
            "description": "What is the purpose of LIFE? What is the meaning of existence? If you’re excited to talk about questions like these, then THIS EPISODE IS FOR YOU! Haha, and even if you’re not in an existential type of mood--but want some ideas on how to find more joy and peace regardless of your circumstances right now--WE GOT YOU! We’re sharing the difference of what it means to be a critic or a creator in your life, and some easy, applicable ideas of how to create more of the life you want TODAY! \n\n\nWant a clear plan for how to use Instagram to Build YOUR DREAM? Check out:\n\nalisonsbrandschool.com/IG4U\n\nEric's closing song is \"God in the Meadow\" from the brand new \"KINDNESS\" Collection at Pleasant Pictures Music Club. High end stock music for $199/yr\n\nUse code: AWESOMEWITHERIC for 20% off\n\npleasantpictures.club",
            "length": "92649908",
            "sourceUrl": "http://feeds.soundcloud.com/stream/705495682-awesomewithalison-ep-104-are-you-a-critic-or-a-creator.mp3"
        },
        {
            "title": "Ep. 103: A gratitude practice for loving your body!",
            "datePublished": "Thu, 24 Oct 2019 16:39:12 +0000",
            "description": "Ok! I dipped into my vault of premium content and opened it up, to share with you one of my greatest treasures! This episode holds a POWERFUL gratitude practice for LOVING YOUR BODY! This practice is healing, empowering and so incredible! It’s already helped so many people tap into and love their body more--and I cannot WAIT for it to help you! Use it on a walk, while you’re folding laundry, on a drive, or ANY and EVERY time you need to realign with your gorgeous self. I’m so excited for you to have this!\n\n\nWant more powerful practices like this EVERY MONTH? Check out\n\nthealisonshow.com/awesomeondemand\n\n\nWant a clear plan for how to use Instagram to Build YOUR DREAM? Check out:\n\nalisonsbrandschool.com/IG4U\n\nEric's closing song is \"New La La\" from the incomparable Pleasant Pictures Music Club. High end stock music $199/yr. \n\nUse code: AWESOMEWITHERIC for 20% off!\n\npleasantpictures.club",
            "length": "68500100",
            "sourceUrl": "http://feeds.soundcloud.com/stream/701139523-awesomewithalison-ep-103-a-gratitude-practice-for-loving-your-body.mp3"
        },
        {
            "title": "Ep. 102: I want to know what fun is!",
            "datePublished": "Wed, 16 Oct 2019 19:44:53 +0000",
            "description": "This episode IS A PARTY!!! Are you ready to have some extra pep in your step? Vroom in your zoom? Zing in your swing? Pump in your hump?!! You’re gonna get all that and more because we’re getting back to the basics on having more fun in your life! I’m selling you on why fun needs to be a priority, and setting you up to be able to remember what’s fun for you! You learn how to create it in your life with more ease! And yes, it will be fun in the process too. HIGH KICK!\n\nWant the accompanying worksheet?!\nText iwantfun to 31996\n\nWant more ease and joy in turning your dream into a reality?! Don’t miss my new course at it’s 1/2 off introductory rate!\nAlisonsbrandschool.com/ig4u\n\nEric's closing song is \"All I See\" from the Funky Fresh Collection at Pleasant Pictures Music Club. High End Music for $199/yr\n\nUse code: AWESOMEWITHERIC for 20% off!\n\nVisit pleasantpictures.club and see what all the fuss is about!",
            "length": "90026336",
            "sourceUrl": "http://feeds.soundcloud.com/stream/697203767-awesomewithalison-ep-102-i-want-to-know-what-fun-is.mp3"
        },
        {
            "title": "Ep. 101: PUMP UP: Change can happen in an instant!",
            "datePublished": "Wed, 09 Oct 2019 20:07:58 +0000",
            "description": "We can feel so drained and weighed down by the things we want to change--thinking it’s going to take more work than we have capcity for! But in this little PUMP UP I’m sharing with you different ways that change CAN happen in an instant. I’ve got examples from my own life, and a few thought shifts you can employ RIGHT THIS MINUTE, to find relief, calm, hope and more peace! So much love to you!\n\nEric's closing song is \"Eye Patch\" in the Indie Dance Pop Collection at Pleasant Pictures Music Club. High End stock music for $199/yr.\n\nUse code: AWESOMEWITHERIC for 20% off for life!!\npleasantpictures.club",
            "length": "53245172",
            "sourceUrl": "http://feeds.soundcloud.com/stream/693415015-awesomewithalison-ep-101-pump-up-change-can-happen-in-an-instant.mp3"
        },
        {
            "title": "Ep. 100: The BEST ideas for feeling more awesome than you did before!",
            "datePublished": "Wed, 02 Oct 2019 14:00:24 +0000",
            "description": "Holy banana balls we've done 100 episodes!!! AND TO CELEBRATE (insert fog horn) we reached out to our Awesome Empire of listeners and asked, \"What do you do when you need to feel more awesome?\" We got dozens of incredible responses, with some voices and names you'll recognize and love! But most importantly this episode is full of serious inspiration for when you need a boost! I'm not kidding, I will be listening to this over and over! You guys are straight up geniuses! You're gonna freaking love it!\n\nCome and feel even more awesome and connect to your purpose at my\nBuild an Awesome Brand Workshop! Learn more here:\nalisonsbrandschool.com/workshop\n\nEric's closing song is \"Tell the Birds\" from the Golden Hour Collection at Pleasant Pictures Music Club. \n\nUse code: AWESOMEWITHERIC for 20% off\npleasantpictures.club",
            "length": "108057260",
            "sourceUrl": "http://feeds.soundcloud.com/stream/689799877-awesomewithalison-ep-100-the-best-ideas-for-feeling-more-awesome-than-you-did-before.mp3"
        },
        {
            "title": "Ep. 99: My Confidence Check List for FEELING LIKE A BOSS!",
            "datePublished": "Wed, 25 Sep 2019 17:16:21 +0000",
            "description": "Ok, today I'm sharing every little tool, trick, and thought I use to help me feel confident like the complete and total boss that I am! It's a check-list of 10 things I say to myself, or say out loud, or think through when I need to STAND IN MY POWER! I get a little fiery in this one! Come back to it when you need to DOMINATE!\n\nGet the check list for your life! \nFREE DOWNLOAD JUST TEXT\nconfidencechecklist to 31996\n\nEric's closing song is \"Flan\" in the Hazy Dreams Vol. 1 Collection at Pleasant Pictures Music Club. THE best music for your content.\n\nUse code: AWESOMEWITHERIC for 20% off your purchase\npleasantpictures.club",
            "length": "92828432",
            "sourceUrl": "http://feeds.soundcloud.com/stream/686231107-awesomewithalison-podcast-92419.mp3"
        },
        {
            "title": "Ep. 98: The art of putting yourself OUT THERE! with Ellen Bennett!",
            "datePublished": "Wed, 18 Sep 2019 14:00:55 +0000",
            "description": "If there was going to be a master’s course, in GOING FOR IT, Ellen Marie Bennett, founder of the super successful culinary brand Hedley and Bennett, would be the professor! In this episode you’ll be wildly inspired by how Ellen got her dream business (and life) off the ground, with no savings, little experience and a lot of enthusiasm! And we’ll dive into how YOU can do the same, by showing up for yourself and what you want! All that plus Ellen will give you solid tips on how to get your butt in the kitchen! Eric and I have seriously increased our joy making meals exponentially after listening to Ellen’s tips! You’re going to have so much fun!\n\nEric's closing song is \"Flan\" in the HAZY DREAMS VOL. 1 Collection at pleasantpictures.club\n\nUse code: AWESOMEWITHERIC for 20% off",
            "length": "162200144",
            "sourceUrl": "http://feeds.soundcloud.com/stream/682567469-awesomewithalison-podcast-9619-ellen.mp3"
        },
        {
            "title": "Ep. 97: Everything is figureoutable! With Marie Forleo",
            "datePublished": "Wed, 11 Sep 2019 17:51:27 +0000",
            "description": "I’m bringing in the heavy hitters today! I’ve got the beautiful amazing thought-leader and author Marie Forleo FIRING US UP! And helping us see how EVERYTHING we want in this life, is truly figureoutable! Everything is Figureoutable is not only Marie’s life motto, but it’s also the title of her new book! She has a life-time track record of amazing accomplishments, like being called a “leader for the next generation” by Oprah. Yeah I said it, OPRAH! And she’s sharing with us how we can be brave, bold, and figure out exactly what we want. I’m SO excited to bring you Marie! And I know you’ll love this episode!\n\n\nWe are having a 3-day blitz for our Arizona Build an Awesome Brand Workshop! GET YOUR TICKET HERE NOW and save over $400:\n\nhttps://alisonsbrandschool.com/workshop/\n\nEric's closing song is \"City Kid\" in the new Big Sky Collection at Pleasant Pictures Music Club.\n\nUse code: AWESOMEWITHERIC for 20% off and download unlimited music for your projects!\n\npleasantpictures.club",
            "length": "136040636",
            "sourceUrl": "http://feeds.soundcloud.com/stream/679660088-awesomewithalison-ep-97-everything-is-figureoutable-with-marie-forleo.mp3"
        },
        {
            "title": "Ep. 96: How to use writing to heal and reveal! With Ashmae!",
            "datePublished": "Wed, 04 Sep 2019 16:22:49 +0000",
            "description": "Hold onto your notepads! You are about to have your hearts opened, minds bent and awesomeness expanded with my girl Ashmae Hoiland @birdsofashmae! Ashmae is an author, artist, storyteller and writing instructor--as well as a beautiful human with deep wisdom! I wanted her to come and share all the tips, tricks, and magic that she has discovered from writing and sharing her own life and stories, as well as teaching and guiding others how to do it too! You’ll walk away from this episode with 3 tangible ideas for how to use writing to benefit your life, and I’m so excited for all of us! If you don't consider yourself a writer or even if you do, listen up! We cover it all! \n\n\n\nJoin us at our Alison's Brand School Build an Awesome Brand Workshop!\n\nText earlybirdblitz to 31996\n\nEric's closing song is \"Friday Harbor\" in the World Traveler Collection at Pleasant Pictures Music Club.\n\nUse code: AWESOMEWITHERIC for 20% off\npleasantpictures.club",
            "length": "108421616",
            "sourceUrl": "http://feeds.soundcloud.com/stream/676273247-awesomewithalison-ep-96-how-to-use-writing-to-heal-and-reveal-with-ashmae.mp3"
        },
        {
            "title": "Ep. 95:  The thing that might be blocking you most of all!",
            "datePublished": "Wed, 28 Aug 2019 17:48:24 +0000",
            "description": "Do you want more money, love, connection, time, space, peace, ideas? What?! What is it?! What if you already have it, or it’s already in your life in some way, but you’ve been blocking yourself off from it? Today we are diving into how to open yourself up to receive more of what you want! We’ve got actionable ideas and you will feel ready to accept all the help, guidance, and goodness that’s coming your way after you listen!\n\nEric's closing song is \"Sun Soaked\" from the Golden Hour Collection.\n\nUse code: AWESOMEWITHERIC for 20% off at pleasantpictures.club",
            "length": "74357984",
            "sourceUrl": "http://feeds.soundcloud.com/stream/672291248-awesomewithalison-ep-95-the-thing-that-might-be-blocking-you-most-of-all.mp3"
        },
        {
            "title": "Ep. 94: PEP TALK for when YOU FEEL LAZY!",
            "datePublished": "Wed, 21 Aug 2019 16:42:43 +0000",
            "description": "It’s been a minute since I gave you an ol’ Alison PEP TALK! And I LOVE this one! I’m so excited for you to have it! I was feeling so good and in the flow, and I really think if you listen it will help raise your energy and vibes! In this short, fun ep I talk about what it can mean when we feel “lazy,” some ideas for what to do with the feeling, and how to really use it to direct you and guide you and help you see what you need! I hope you love it, share it, and come back to it time and time again!\n\n\n\nINSTAGRAM POST I MENTION:\n\nhttps://www.instagram.com/p/B1VJLgEpiX_/\n\n\n\nPEP TALK for when life is a lot:\n\nhttps://podcasts.apple.com/us/podcast/ep-61-pep-talk-for-when-life-is-a-lot/id1191721368?i=1000421671118 \n\n\n\nPUMP UP for how to do hard things!\n\nhttps://podcasts.apple.com/us/podcast/ep-76-pump-up-doing-really-hard-things-you-can-do-it/id1191721368?i=1000435156542 \n\n\n\nWant a new pep talk or gratitude practice every month?\n\nhttps://thealisonshow.com/awesomeondemand/\n\nEric's closing song is \"Golden Hour\" from the new Golden Hour Collection at Pleasant Pictures Music Club.\nUse Code: AWESOMEWITHERIC for 20% off for all your music needs!",
            "length": "62885888",
            "sourceUrl": "http://feeds.soundcloud.com/stream/669039326-awesomewithalison-ep-94-pep-talk-for-when-you-feel-lazy.mp3"
        },
        {
            "title": "Ep. 93:  Making and keeping friends as an adult with Ashley Rose Reeves!",
            "datePublished": "Wed, 14 Aug 2019 14:00:36 +0000",
            "description": "Do you feel like nobody cares about you?! Do you feel like making friends is something you should have learned how to do in elementary school and now you are out of luck? Or maybe you're just looking to cultivate and deepen some awesome relationships you already have?! Good news! We're talking about all of it! How to find friends, make them, keep them, and when to let them go! And I know it's going to open your mind to how many awesome resources you have! But to talk about this I brought one of my good friends, and a friend to many, Ashley Rose Reeves! I can't wait for you to listen, feel less alone, and ramp up to be the best friend you've always wanted to be and have!\n\nEric's closing song is \"Grandad's Workshop\" from the \"Parisian Cafe\" Collection at Pleasant Pictures Music Club.\n\nUse code: AWESOMEWITHERIC for 20% off and get the BEST MUSIC IN THE WORLD! \n\npleasantpictures.club",
            "length": "136849736",
            "sourceUrl": "http://feeds.soundcloud.com/stream/665399201-awesomewithalison-ep-93-making-and-keeping-friends-as-an-adult-with-ashley-rose-reeves.mp3"
        },
        {
            "title": "Ep. 92: How I let Instagram ruin my life!",
            "datePublished": "Wed, 07 Aug 2019 17:34:00 +0000",
            "description": "Whether you’re on social media for friends and family, using it to build a business, or have sworn off of it all together, social media affects all of us BIG TIME. There’s no denying it! So I wanted to share my story, and all I’ve learned about how to use Instagram in a way that enriches my life and business, rather than drains it. It’s been a long road! My life, of course, is not actually ruined, but for a while, I absolutely let my performance on Instagram determine my mood for the day, how I felt about my business, and without realizing, I let it affect how I valued myself as a person. I open up quite a lot here, it's ROUGH, haha, but I really hope that sharing what I’ve learned serves you, or helps you feel less alone and empowered. \n\n\nCome have a DTR with us and help make IG work for you!\n\nAlisonsbrandschool.com/IG4U\n\nEric's Closing song is \"I'm Still a Stupid Kid\" by Valentine & the Regard. \nUse code AWESOMEWITHERIC and use this track and hundreds more at Pleasant Pictures Music Club // pleasantpictures.club",
            "length": "136435268",
            "sourceUrl": "http://feeds.soundcloud.com/stream/662513492-awesomewithalison-podcast-8619.mp3"
        },
        {
            "title": "Ep. 91: What to do when you don’t know what to do!",
            "datePublished": "Wed, 31 Jul 2019 14:00:15 +0000",
            "description": "This is the PERFECT episode if there is any area of your life that has you saying, “I HAVE NO CLUE WHAT TO DO!” We’ve got questions to ask yourself, exercises to try, and some good ol’ THOUGHT WERK that will have you feeling better, more inspired and aligned! Really! I think you will come back to this episode again and again for ideas! And I hope you remember, that no matter what you do, only you can be you, and you’re already as awesome as you need to be! \n\nEric's closing song is \"Baguette and Chaps\" from the new Parisian Cafe Collection at Pleasant Pictures Music Club. \n\nDon't use bland music for your content! Use code: AWESOMEWITHERIC for 20% off your purchase at pleasantpictures.club",
            "length": "75905192",
            "sourceUrl": "http://feeds.soundcloud.com/stream/658689209-awesomewithalison-ep-91-what-to-do-when-you-dont-know-what-to-do.mp3"
        },
        {
            "title": "Ep. 90: How to be yourself MORE!",
            "datePublished": "Wed, 24 Jul 2019 18:35:13 +0000",
            "description": "What does it EVEN MEAN to be yourself? It seems like something that should be effortless and easy right? But instead of it being more effortless to “be yourself” the older you get, sometimes it actually feels harder. Add having kids, relationships, school, work, or who you think you should be vs. who you want to be! And oh man! What is life?! But before you have a Zoolander-esque breakdown, (“WHO AM I?!”) in this episode we are going into what it even means to “be yourself”, why it’s easy to feel lost, and then giving you 4 awesome ideas for how to be MORE of yourself, no matter where you are showing up! \n\nEric's closing song is \"Into the Black Hole\" by Valentine and the Regard. The instrumental is in the Lofi Dream Pop Collection at Pleasant Pictures Music Club. pleasantpictures.club\n\nUse code: AWESOMEWITHERIC for 20% off",
            "length": "84448244",
            "sourceUrl": "http://feeds.soundcloud.com/stream/655832552-awesomewithalison-ep-90-how-to-be-yourself-more.mp3"
        },
        {
            "title": "Ep. 89: How to be a life-long learner and why it will make your life richer with Marilyn Faulkner!",
            "datePublished": "Mon, 15 Jul 2019 15:16:37 +0000",
            "description": "Ok, this is a pretty special episode! Prepare to have your mind blown and your appetite to learn whetted by MY MAMA! That’s right we’ve got Marilyn Faulkner in the house, talking about how to be a life-long learner, what that even means, and how it’s going to bring more joy into your life! She shares some freaking inspiring awesome stories about rejection, being brave, and how to create a learning package for yourself, regardless of your age or stage in life! You’ll be so inspired to be more curious and learn more in your life!\n\nWE ARE SO EXCITED TO PARTNER WITH AMAZON HOME FOR THIS EPISODE! IT’S PRIME DAY AND I’VE PICKED OUT MY FAVORITE DEALS FOR YOU!\n\nSHOP THEM HERE:\nhttps://www.amazon.com/shop/thealisonshow",
            "length": "130751096",
            "sourceUrl": "http://feeds.soundcloud.com/stream/647335524-awesomewithalison-podcast-7319-marilyn.mp3"
        },
        {
            "title": "Ep. 88: Creating spaces that enable better habits!",
            "datePublished": "Wed, 10 Jul 2019 12:00:24 +0000",
            "description": "How often have you said, “I just need more discipline!” Or, “I just need more motivation!” When it comes to making or keeping better habits? What if INSTEAD you just need a more intentional nightstand set up? Or a little something in your car? In this episode I’m sharing how some simple environmental changes have led to big habit changes in my life! And of course we’re talking about how to do this for yourself! You’ll freaking love it and get awesome ideas!\n\n\nWe are so excited to partner with Amazon Home for this episode! It’s ALMOST Prime Day and I’ve picked out some deals that are ALREADY live for you NOW!\n\n\nhttp://amazon.com/shop/thealisonshow",
            "length": "83931521",
            "sourceUrl": "http://feeds.soundcloud.com/stream/647332152-awesomewithalison-podcast-7519.mp3"
        },
        {
            "title": "Ep. 87: Faith transition, spirituality and adult development with Thomas McConkie",
            "datePublished": "Wed, 03 Jul 2019 20:47:22 +0000",
            "description": "I am SO FREAKING excited for you to have this episode in your life! If you have been feeling lost, disconnected, or like you’re coming to a new place in your life...this will be SO HELPFUL! In this episode I talk to adult development, mindfulness and meditation expert Thomas McConkie. We’re not talking about religion, we are talking about faith, spirituality, and what happens when you’ve got tough questions! What happens in your brain, in your relationships, in your LIFE and how to navigate the tough stuff! We cover a lot of ground and I’m positive it will relieve some suffering in your life or help you connect with someone who is suffering. It’s so important and I’m so grateful for us all to have this! Enjoy! \n\nEric's closing song is \"Modern Beasts\" from the brand new EDGY ATMOS collection at Pleasant Pictures Music Club. pleasantpictures.club\n\nUse code AWESOMEWITHERIC for 20% off!",
            "length": "171421796",
            "sourceUrl": "http://feeds.soundcloud.com/stream/645821247-awesomewithalison-podcast-61119-thommmmassss.mp3"
        },
        {
            "title": "Ep. 86: Inspired Action vs. Frantic Action!",
            "datePublished": "Thu, 27 Jun 2019 00:52:33 +0000",
            "description": "We all know action is good...yes?! MORE ACTION PLEASE! But what I’m personally working on in my life is this idea of inspired action, or working with ease and working in the flow vs. frantic, stressful, action which is often fueled by scarcity and leads to anxiety and quitting! I’m checking in with you on how YOUR year is going, where you want to be 6 months from now, and offering you three things that taking more inspired action will require of you! You can do it, and you’ll love it!\n\n\nWant to empower yourself with better thoughts and set clear goals? \n\nGet out BEST YEAR EVER Worksheet by texting\n\n\nbestyearever to 31996 \n\n\nWant a system to help you take more inspired action? Check out:\n\nthealisonshow.com/awesomeondemand\n\nEric's closing song is \"Deathbeat\" by his band New Shack. New album drops 8/19",
            "length": "70745744",
            "sourceUrl": "http://feeds.soundcloud.com/stream/642047601-awesomewithalison-podcast-62419.mp3"
        },
        {
            "title": "Ep. 85: Who's your cast of characters?",
            "datePublished": "Wed, 19 Jun 2019 16:38:11 +0000",
            "description": "Ep. 85: Who's your cast of characters? by Alison Faulkner",
            "length": "65659520",
            "sourceUrl": "http://feeds.soundcloud.com/stream/639081672-awesomewithalison-ep-85-whos-your-cast-of-characters.mp3"
        },
        {
            "title": "Ep. 84: The GIFTS of negative emotions & emotion coaching with Georgia Anderson!",
            "datePublished": "Wed, 12 Jun 2019 14:00:16 +0000",
            "description": "“Your best opportunity for connection is when your emotions are negative.” When I heard parenting and relationship expert Georgia Anderson say that, I screamed, “I WILL GET HER ON THE PODCAST!” And boom baby I did! In this truly life-changing episode, I ask Georgia to use her 30 years of experience in relationship and parenting education  to help us see how we can employ emotion coaching on ourselves when we FEEL LIKE CRAP! She shares HOW to use negative emotions to build stronger relationships and a greater connection to self! It’s so good guys. She also gives Eric and I a little bit of relationship and parenting coaching, helping us see how we can better navigate my BIG feelings and our daughter’s too! If you’re a human, who has negative emotions, you’re going to freaking love this episode! I’m so excited for you! \n\nEric's closing song is \"That is Neat\" from the Indie Dance Pop collection at Pleasant Pictures Music Club // pleasantpictures.club",
            "length": "134539364",
            "sourceUrl": "http://feeds.soundcloud.com/stream/635408766-awesomewithalison-ep-84-the-gifts-of-negative-emotions-emotion-coaching-with-georgia-anderson.mp3"
        },
        {
            "title": "Ep. 83: Realizing you are More Than Enough with Miranda Anderson",
            "datePublished": "Wed, 05 Jun 2019 19:07:14 +0000",
            "description": "What would happen if you stopped buying stuff for one full year? If you’re like me you might think, “Meh--who cares!” HAHA but if you’re like my amazing guest Miranda Anderson you might think, “What would that do for me and my family?! And could I find peace and abundance from that?” Spoiler alert--she did and has some amazing tips for us too! In this incredibly fun and entertaining interview you’ll be SO INSPIRED by Miranda, how she lives with full confidence, and how she used that confidence to pursue a dream and idea that led to her soon-to-be released book More Than Enough! I laughed, I cried, and even if you *THINK* you know everything about minimalism, you’ll see some ideas in a whole new light! She also leaves us with practical ideas for discovering you have and you are MORE THAN ENOUGH--and you don’t even have to stop buying stuff! Ha! DON’T MISS THIS ONE!\n\n\nGet Miranda’s Book More Than Enough!\n\nhttps://livefreecreative.co/more-than-enough-pre-order-plus-a-free-gift/\n\n\nWant to work on your confidence? Join us in Awesome on Demand!\n\nhttps://thealisonshow.com/awesomeondemand\n\nEric's closing song is \"Fun in the Sun\" from the Weekend Away Collection at Pleasant Pictures Music Club\n\nGet unlimited music for $199 and make your content POP!\nUse code: AWESOMEWITHERIC for 20% off",
            "length": "138054512",
            "sourceUrl": "http://feeds.soundcloud.com/stream/632253435-awesomewithalison-ep-83-realizing-you-are-more-than-enough-with-miranda-anderson.mp3"
        },
        {
            "title": "Ep. 82:  Beware the curse of padded thoughts!!!",
            "datePublished": "Wed, 29 May 2019 16:48:52 +0000",
            "description": "This is an exercise Eric took me through recently when I was trying to calm myself with “good thoughts”, but what I was actually doing was setting myself up to just need more and more validation and outside confirmation! Oh man! What are padded thoughts?! You’re about to find out! And I’ll tell you this, they always lead you thirsty! But we’re all having them all day, every day, and they’re like a house of cards! Building a reality and situations for yourself that you cannot sustain, and that will inevitably tumble! We’re talking about how to identify “padded thoughts”, how they can betray you, and most importantly, some thoughts to replace them with! \n\nEric's closing song is \"Cats\" from the upcoming Parisian Cafe Collection at Pleasant Pictures Music Club.\n\nUse code: AWESOMEWITHERIC for 20% off at pleasantpictures.club and get access to the music that makes your content POP!!!",
            "length": "88987556",
            "sourceUrl": "http://feeds.soundcloud.com/stream/628047084-awesomewithalison-podcast-52819.mp3"
        },
        {
            "title": "Ep. 81:  3 magical ideas that have changed my life!",
            "datePublished": "Wed, 22 May 2019 17:15:57 +0000",
            "description": "You are going to LOVE these ideas, or thought shifts, or NUGGETS so much! They have changed my life, how I think, and my relationships, all for the better! They all have to do with how we interact with other people--which is good because we have to interact with other people every single day yes? Yes! The next time you’re feeling anxious, nervous or crappy about an interaction--run through these 3 ideas and I know you’ll have more clarity in no time!\n\nEric's closing song is \"Old Flame\" in the Lounge Life Collection at Pleasant Pictures Music Club. Use code: AWESOMEWITHERIC for 20% off\npleasantpictures.club",
            "length": "72477740",
            "sourceUrl": "http://feeds.soundcloud.com/stream/624563016-awesomewithalison-podcast-52119.mp3"
        },
        {
            "title": "Ep. 80: A million reasons why you can’t do what you feel called to do-and the ONE reason you should!",
            "datePublished": "Thu, 16 May 2019 17:35:47 +0000",
            "description": "Watch out now! This extra special episode was captured when I was feeling ON FIRE and wanting to pass that FIRE on to you! We’ll talk about why you shouldn’t quit your day job--whatever that may be, and we’ll also dive into why HOW you do something matters way more than WHAT you are doing! If you feel called to do something--or want to get clearer about your life--listen up. We’ve got actionable prompts and exercises in here and I hope you do them so you can see the change you want! As always we’re sharing what has worked for us and thoughts that can work for you! \n\nWant the download mentioned in the episode \n\nSign up for my Thought Nuggets here:\n\nhttps://thealisonshow.com/subscribe/\n\nDon’t miss out on my Alison’s Brand School goodies HERE:\n\nhttps://alisonsbrandschool.com?\n\nEric's closing song is \"Where did april go?\" in the new Lounge Life Collection at Pleasant Pictures Music Club.\n\nUse code: AWESOMEWITHERIC for 20% off your purchase and get the dopest music for you projects!\n\npleasantpictures.club",
            "length": "109313192",
            "sourceUrl": "http://feeds.soundcloud.com/stream/621653343-awesomewithalison-ep-80-a-million-reasons-why-you-cant-do-what-you-feel-called-to-do-and-the-one-reason-you-should.mp3"
        },
        {
            "title": "EP. 79: Discovering your \"Personal Legend\" -- inspiration from The Alchemist",
            "datePublished": "Wed, 08 May 2019 14:00:39 +0000",
            "description": "Are you trying to figure out your purpose? Your life’s work? Your reason for being? Or do you know what it is but seem to keep getting stopped up? Either way this is going to be a really inspiring episode for you! Regardless if you’ve read Paulo Coelho's The Alchemist or not, I know you'll learn something new that can help you RIGHHT NOW! I’m sharing some of my favorite advice and takeaways from what is considered one of the world’s top ten books. These principles and ideas have been a lifeline for me as of late, and I genuinely hope they can inspire and comfort you! So much love to you on your journey* DING!\n\nEric's closing song is \"Ducks\" from the Lounge Life collection at pleasantpictures.club where the music is real and raw and is yours to use when you join the club!",
            "length": "103214144",
            "sourceUrl": "http://feeds.soundcloud.com/stream/617325939-awesomewithalison-ep-79-discovering-your-personal-legend-inspiration-from-the-alchemist.mp3"
        },
        {
            "title": "Ep. 78:  Are you limiting your happiness?",
            "datePublished": "Wed, 01 May 2019 06:19:45 +0000",
            "description": "You want it, you’re looking for it, you’re working towards it...and yet? You’re very likely putting limits around it! What is that IT? \"IT\" could be your happiness, your dream, your relationship, your health! We strive and stretch for these things, but we also unintentionally set limits that make them almost impossible to achieve. How inconvenient is that?! We're hoping to help you uncover some imaginary walls, as well as giving you the tools to take them down! Limits be gone! We hope you listen, learn, and feel awesome! \n\nThis episode was brought to you by Alison's Brand School. Be sure to check out The Ultimate Guide to Influencer Marketing at alisonsbrandschool.com/audiocourse\n\nEric's closing song is \"Anthro\" by his band New Shack.",
            "length": "79830632",
            "sourceUrl": "http://feeds.soundcloud.com/stream/613753659-awesomewithalison-podcast-43019.mp3"
        },
        {
            "title": "Ep. 77:  But who’s going to watch the kids? The great childcare debate!",
            "datePublished": "Wed, 24 Apr 2019 20:22:02 +0000",
            "description": "This is a very special episode in which we are opening all the cans of all the worms on WHO IS SUPPOSED TO WATCH THESE KIDS?! Now in NO way is this a complete and comprehensive discussion of childcare in America, or the challenges that so many face! We are however sharing how this is a huge, prevalent problem for so many women, offering up a few solutions, as well as sharing tips and ideas for creating a system that works for you, and helps you live at your best level! I bring on my employee and friend Nichelle Jensen, and we share our different experiences and journeys with finding and getting good help with our kids! Our goal is that our limited experience help in some way, but will also open up the conversation to others who are in a different situation! So let’s do it! \n\nEric's closing song is \"Early Morning LA\" from the new World Traveler collection at pleasantpictures.club\nUse code: AWESOME WITH ERIC to get 20% off a track or subscription!",
            "length": "133309532",
            "sourceUrl": "http://feeds.soundcloud.com/stream/610866921-awesomewithalison-podcast-42319.mp3"
        },
        {
            "title": "Ep. 76: PUMP UP: Doing really hard things! YOU CAN DO IT!",
            "datePublished": "Wed, 17 Apr 2019 14:00:24 +0000",
            "description": "Whether life has thrust something difficult in your direction, or you’re wondering how and IF you can do that really hard thing you want to do, this pump up IS FOR YOU! This your, “YOU CAN DO IT!” Moment, and further than that, your “Why you should!” and “This is HOW to do it!” moments too! I’m sharing 4 principles, you better believe they are universal, to deconstruct the mysteries that surround doing really hard things. Listen up, I’m doing hard crap all the time and I’m sharing everything that is making is possible. There’s no way this won’t help you out! \n\nEric's closing song is :\"Sunrise in Bangkok\" at pleasantpictures.club",
            "length": "93158336",
            "sourceUrl": "http://feeds.soundcloud.com/stream/607048272-awesomewithalison-ep-76-pump-up-doing-really-hard-things-you-can-do-it.mp3"
        },
        {
            "title": "Ep. 75: What if you're wrong?! And why that's a good thing!",
            "datePublished": "Wed, 10 Apr 2019 17:45:32 +0000",
            "description": "Before you snap back, \"THERE'S NO WAY I'M WRONG!\" Haha, this episode is intended to break your brain open a bit! We're talking about why it feels wrong to be wrong, but how being wrong can lead to so many wonderful things that are right! One huge takeaway from this episode is an exercise asking you to question if you're wrong about yourself, what you can do and what you are capable of! And not in the, \"You can't do it...\" way, but in the, \"But what if you can?!\" So go on a philosophical journey through time and space with us and see if you can't find some solutions or a little bit of awesome in thinking about your current life shtuff in a new way! I hope you love it!\n\nEric's closing song is \"Tangerine\" from his pleasantpictures.club",
            "length": "64786592",
            "sourceUrl": "http://feeds.soundcloud.com/stream/603526443-awesomewithalison-podcast-4219-2.mp3"
        },
        {
            "title": "Ep: 74. Why you’re not hitting your goal!",
            "datePublished": "Wed, 03 Apr 2019 14:00:12 +0000",
            "description": "Whoa Nelly DO I LOVE THIS EPISODE! In a world where everyone is telling you HOW to reach your goals, and how important it is to set them...it feels like no one is talking about WHY you’re not reaching those goals, even if you’re working your butt off! I promise you’re not alone! I’m sharing some major goals I’ve missed, and Eric is too! Then we’re sharing why it happened, and how that can help YOU!\n\n \n\nI’ve thought about this SO much, and I’m so so excited to share these 2 EASY STEPS to troubleshoot when you’re just not able to do what you want to do! You’re gonna love it!\n\n \n\nLooking for a system to help you with those goals?! Check out Awesome on Demand\n\nhttps://thealisonshow.com/awesomeondemand/\n\nEric's closing song is \"Bright Orange\" from the new Indie Dance Pop Collection at pleasantpictures.club     Use code: AWESOMEWOTHERIC for 20% off your subscription.",
            "length": "80050916",
            "sourceUrl": "http://feeds.soundcloud.com/stream/599982873-awesomewithalison-podcast-4219-1.mp3"
        },
        {
            "title": "Ep. 73: Options vs. Solutions!",
            "datePublished": "Wed, 06 Mar 2019 22:15:21 +0000",
            "description": "Have you felt stuck? Frustrated? Up a creek without a paddle in any way in your life lately? Maybe everything is great but you’d like a little excitement or variety?! OOOOOOOH BABY! We’ve got options and solutions GALORE for you this week! But way more importantly, we want to pry your mind open and dive into how you can open yourself up to uncovering, believing and realizing there are more solutions available to you right now than you can possibly imagine. We’ve got some awesome personal examples of ways we have found and created more options in our lives, as well as actionable exercises to free your mind! You’re going to love this episode and I really believe it will allow you think of something new and helpful! Enjoy!\n\n\nMarch is our FREE 31-Day #THOUGHTWERK CHALLENGE\n\nGet your free Thought Werk Prompts (via text!) by signing up here:\n\nhttps://slkt.io/GZw\n\n \n\nCANADA EH?\n\nJoin the #THOUGHTWERK CHALLENGE by texting\n\nCanada to 902-200-2270\n\n \n\nInternational? \n\nWe can email you our quick daily #thoughtwerk challenges! Opt-in here!\n\nhttp://bit.ly/2tTI4N5 \n\n\nWant to become a master thought werker!? Check out Awesome on Demand here:\n\nhttps://thealisonshow.com/awesomeondemand/\n\nEric's closing song is \"Sitty Pretty\" in the Mellow Gold Collection at pleasantpictures.club \n\nUse code AWESOMEWITHERIC for 20% off your subscription of the best music in the galaxy.",
            "length": "81981272",
            "sourceUrl": "http://feeds.soundcloud.com/stream/586049784-awesomewithalison-ep-73-options-vs-solutions.mp3"
        },
        {
            "title": "Ep. 72: What is THOUGHT WERK: and how it can bring you sex, money power! (and peace?!)",
            "datePublished": "Wed, 27 Feb 2019 22:17:31 +0000",
            "description": "OK, OK, OK! I’ve been talking about choosing your thoughts, changing your thoughts, being aware of your thoughts, basically THOUGHT WERK! But what the hell is that even?! GOOD QUESTION! I’ll tell you--it is E-V-E-R-Y-T-H-I-N-G, and oh yeah, it totally will give you sex money and power, hahaha or more importantly, peace, joy, fulfillment, life-long happiness regardless of your circumstances--you know, if you’re into that sort of thing! In this episode I’m sharing all that THOUGHT WERK has done for me, how it can help you, plus what it is and what it isn’t AND 6 easy ways to become more of a THOUGHT WERKER!\n\n\nMarch is our FREE 31-Day #THOUGHTWERK CHALLENGE\n\nGet your free Thought Werk Prompts (via text!) by signing up here:\n\nhttps://slkt.io/GZw\n\n\nWant to become a master thought werker!? Check out Awesome on Demand here:\n\nhttps://thealisonshow.com/awesomeondemand/\n\nEric's closing song is \"Crystal Clear\" from the new Sophisticated Collection at pleasantpictures.club\nUse code AWESOMEWITHERIC for 20% off your subscription",
            "length": "77581856",
            "sourceUrl": "http://feeds.soundcloud.com/stream/582393972-awesomewithalison-ep-72-what-is-thought-werk-and-how-it-can-bring-you-sex-money-power-and-peace.mp3"
        },
        {
            "title": "Ep. 71: LIVE PODCAST TOUR SEATTLE: How to choose your thoughts so you can WIN at life!!",
            "datePublished": "Wed, 20 Feb 2019 18:47:29 +0000",
            "description": "We’ve got some really fun, really insane, totally full of Faulkner nonsense SISTER ACTION for you in this episode, with our extra special guest Andrea Faulkner Williams of Tubby Todd! I imported my one and only sister to Seattle for one glorious night, and she shares some amazing insight on how to choose better thoughts to yield better results! Andrea and I were raised similar, and outwardly seem alike, but have very different internal maps. I hope listening to this not only inspires and motivates you to choose better thoughts, BUT also helps you understand that even if you were raised by the same people, you and your loved ones can still have very different ways of approaching the world. I learned so much from Andrea in this really funny episode, and I know you will too! \n\n\nTo aid you in this be sure to download our FREE Done Is Fun! Action Plan!\n\nTEXT: doneisfun to 31996\n\n\nIt will give you awesome guidance on how to break your project into those small, easy-to-take manageable steps. \n\n\nWant to take all this to the next level and see REAL change in your life? And be held accountable?? Join my Awesome On Demand membership! Learn more:\n\nthealisonshow.com/awesomeondemand\n\nEric's closing song is \"Mellow Gold\" from the Mellow Gold Collection at pleasantpictures.club",
            "length": "142472720",
            "sourceUrl": "http://feeds.soundcloud.com/stream/578556786-awesomewithalison-ep-71-live-podcast-tour-seattle-how-to-choose-your-thoughts-so-you-can-win-at-life.mp3"
        },
        {
            "title": "Ep.70: LIVE PODCAST TOUR SF: How to take massive FREAKING action!",
            "datePublished": "Tue, 12 Feb 2019 19:05:46 +0000",
            "description": "What are your obstacles (cough excuses) to taking massive action? Maybe not knowing where to start? Maybe not enough resources or money? Or maybe YOU ARE taking action and you feel like it’s not working??? BABY DOLL we’ve got you coooovered in this episode! These POWER HOUSE, take-no-prisoners WHOA-men are spilling all the goodies. @jordanferney of Oh Happy Day! and The Color Factory and Gabrielle Blair of @altsummit and @designmom share concrete steps as well as pointers from their own personal experience on creating beautiful work and beautiful lives. \n\n\nAfter you finish this episode you will be PUMPED and informed on how to take some massive freaking action!\n\n\nTo aid you in this be sure to download our FREE Done Is Fun! Action Plan!\n\nTEXT: doneisfun to 31996\n\n\nIt will give you awesome guidance on how to break your project into those small, easy-to-take manageable steps! You'll love it! \n\n\nWant even more help on getting your mind in a place to take action?Join my Awesome On Demand! Learn more:\n\nthealisonshow.com/awesomeondemand\n\nEric's closing track is \"I Got This\" from the Urban Magic Collection at pleasantpictures.club",
            "length": "146968184",
            "sourceUrl": "http://feeds.soundcloud.com/stream/574307856-awesomewithalison-ep70-live-podcast-tour-sf-how-to-take-massive-freaking-action.mp3"
        },
        {
            "title": "Ep. 69: LIVE PODCAST TOUR LA: How to believe in yourself and discover what makes you YOU!",
            "datePublished": "Fri, 01 Feb 2019 18:47:36 +0000",
            "description": "You are going to LOOOOOOVE this open, honest, FUN and vulnerable conversation Eric and I have with the insanely amazing, talented, and genuine Jeff and Kelly Mindell of Studio DIY. But more than just the conversation, you’re going to get 6 amazing, and concrete insights in how to more fully believe in yourself and discover what makes you YOU! Whether you’re working on your business, raising a family, or trying to figure out WHAT you want, there are so many AH-HA gems to grab on to! I laughed, I cried, and you’re going to feel more awesome after you listen! \n\n\nWant to get our FREE special Get Clear about the Direction of Your Life Workbook? Text the word Direction to 31996! And we’ll send it to you!\n\n\nWant to take all this to the next level and see REAL change in your life? Join my Awesome On Demand membership! Learn more:\n\nthealisonshow.com/awesomeondemand\n\nEric's closing song is \"Off the Cuff\" from the brand new collection \"New Wave\" at Pleasant Pictures Music Club. Use code AWESOMEWITHERIC to get 20% off your subscription to the dopest music on the globe.",
            "length": "139217528",
            "sourceUrl": "http://feeds.soundcloud.com/stream/568596708-awesomewithalison-la-podcast-v3.mp3"
        },
        {
            "title": "Ep. 68:LIVE PODCAST TOUR PHOENIX: How to get focused when you're not sure what to do!",
            "datePublished": "Mon, 21 Jan 2019 21:28:56 +0000",
            "description": "It’s hard to get clear about the direction of your life--or do ANYTHING--when you FEEL STUCK, unfocused, or totally overwhelmed! You know what else is hard? When you think you’ve got it “figured out” and you start down that road--and then things don’t seem to work out. That’s why we brought out the big guns to help us out! Experts at life and getting UNSTUCK! Mike and Ashley Lemieux! On our Phoenix Super Duper Fly Podcast tour stop--this power couple shares some incredible tips and stories that I KNOW will help shift your perspective no matter WHAT you’ve got going on right now.\n\n\nSo get ready to soar through some tough turbulence with @ashleyklemieux @mikelemieux and ERIC TOO! \n\n\nWant to get our FREE special Get Clear about the Direction of Your Life Workbook? Text the word Direction to 31996! And we’ll send it to you!\n\n\nWant to take all this to the next level and see REAL change in your life? Join my Awesome On Demand membership! Learn more:\n\nthealisonshow.com/awesomeondemand\n\nEric closing song is \"Jonny Got a Car\" from the New Wave collection at his pleasantpictures.club\n\nUse code AWESOMEWITHERIC for 20% off!",
            "length": "165208952",
            "sourceUrl": "http://feeds.soundcloud.com/stream/562600638-awesomewithalison-ep-68live-podcast-tour-phoenix-how-to-get-focused-when-youre-not-sure-what-to-do.mp3"
        },
        {
            "title": "Ep. 67: LIVE TOUR PROVO: Getting clear about the direction of your life!",
            "datePublished": "Fri, 11 Jan 2019 22:40:55 +0000",
            "description": "This super duper special episode from our Super Duper Fly Live Podcast tour Provo stop, HAS IT ALL! Amazing interviews with Susan Petersen of @freshlypicked and Kevin Auernig of @sodalicious ? CHECK! Tackling what to do with fear of failure? CHECK! Skills for boosting confidence? CHECK! Tips for getting started? CHECK! Me giving a rousing pep talk about HOW to get clear about the direction of your life with live audience interaction?? DOUBLE CHECK!!! So listen up lovers, join the party, and let’s take off! Clear skies and dancing in the aisles AWAIT! \n\n\nWant to get our FREE special Get Clear about the Direction of Your Life Workbook? Text the word Direction to 31996! And we’ll send it to you!\n\n\nWant to take all this to the next level and see REAL change in your life? Join my Awesome On Demand membership! Learn more:\n\nthealisonshow.com/awesomeondemand\n\nEric's closing song is \"Net Worth\" from the brand new Urban Magic collection. Use code AWESOMEWITHERIC for 20% off your subscription!",
            "length": "167613284",
            "sourceUrl": "http://feeds.soundcloud.com/stream/557653782-awesomewithalison-ep-67-live-tour-provo-getting-clear-about-the-direction-of-your-life.mp3"
        },
        {
            "title": "Ep. 66: I’m too depressed to make goals!",
            "datePublished": "Mon, 31 Dec 2018 17:58:22 +0000",
            "description": "Listen, whether you’re SICK of hearing about goal setting, you’re in a deep depression at the thought of goal setting OR you’re freaking stoked out of your mind to goal set--THIS EPISODE IS GOLD!!! I’ve created the ultimate guide to help you assess the areas of your life that can be hard to quantify and measure--but are essential to feeling awesome and creating a life you love! \n\n\nYou’ll asses where you’ve been in section one, which will help you move into section two--where you create clarity about what you REALLY want in life/ the upcoming year. Then we move into section three, which focuses on making goals in a well-rounded, meaningful way! YES!!! It’s going to be painless I promise! \n\n\nI’ve also got a section in the worksheet--that’s a super cute printable list--where you can fill in empowering thoughts that will serve you all year long! Then you can tape it up on a mirror! Put it on your fridge! GOLD! And I’ve got lots of examples of empowering thoughts in there for you too! IT’S SO GOOD! I’m so excited about this episode! And so excited for you to have it! \n\n\nYou don’t HAVE to download my “Best Year Ever!” Work It Worksheet! BUT doing so will help you immensely! It’s free and it’s fun and you can get it here:\n\n\nhttp://thealisonshow.com/subscribe\n\n\nSO WHAT I’M SAYING IS if you only ever go out of your way to download one thing ever off of the Internet--LET THIS BE IT!\n\n\nI love you! YOU GOT THIS! THIS IS GOING TO BE YOUR BEST YEAR EVER! And I am HERE for it!\n\nEric's closing song is \"Happy Popular\" from the brand new Urban Magic collection at Pleasant Pictures Music club. Use code \"AWESOMEWITHERIC\" for 20% off and to get access to the best music in the world for your content. pleasantpictures.club",
            "length": "127194824",
            "sourceUrl": "http://feeds.soundcloud.com/stream/551705058-awesomewithalison-ep-66-im-too-depressed-to-make-goals.mp3"
        },
        {
            "title": "Ep. 65: Can you feel awesome on demand?!",
            "datePublished": "Thu, 13 Dec 2018 04:32:30 +0000",
            "description": "This is an extra special episode THAT I LOVE! The question is, can you just flip a switch and FEEL better, or awesome? What is the place of negative emotions? AND WHAT DO YOU DO WITH THEM? \n\nI'm always saying, \"You're already as awesome as you need to be!\" BUT WHAT DOES THAT MEAN?!\n\nWe're getting into allll of that today, as I share an exclusive look at my new program Awesome on Demand, why I created it, and what it can do for you! BUT even if you're not interested HA you're going to learn a lot as I share the intro to the program that would normally only be for members!\n\nBiggest takeaway--no one is hiding your awesomeness from you. We are all hiding it from ourselves.\n\nI want to talk about how to uncover it, and how FEELING GOOD IS FUN! I'm so excited for you to get this inside look!\n\nTo check out more about Awesome on Demand\nhttp://thealisonshow.com/awesomeondemand/\n\nEric's closing song is \"In the Bleak Midwinter\" by his band New Shack.",
            "length": "110520056",
            "sourceUrl": "http://feeds.soundcloud.com/stream/544222557-awesomewithalison-episode-65-can-you-feel-awesome-on-demand.mp3"
        },
        {
            "title": "Ep. 64: How to get more time",
            "datePublished": "Thu, 29 Nov 2018 18:19:11 +0000",
            "description": "We can’t give you more than 24 hours in each day! But we can help you figure out what you’re filling those hours with! This episode is about evaluating all the things you THINK you have to do...and asking, “Do I really have to do this?” I outline 4 areas of your life to examine, and then we give you three ideas for how to shift your mindset around time, and what you fill yours with! It’s so good!! \n\nEric's closing song is \"Jolly Old Saint Mick\" from the Holiday collection at Pleasant Pictures Music Club.\n\nUse code: AWESOMEWITHERIC for 20% off all subscriptions at pleasantpictures.club",
            "length": "85957868",
            "sourceUrl": "http://feeds.soundcloud.com/stream/537327819-awesomewithalison-podcast-112818.mp3"
        },
        {
            "title": "Ep. 63: How to make hard changes in your life & find success with Amy Porterfield",
            "datePublished": "Thu, 01 Nov 2018 17:49:25 +0000",
            "description": "Life is all about change. Sometimes life forces that change on you, and other times you realize that if you want things to be different YOU have to change…but that can be HARD!!! How do you do it? Amy Porterfield, host of the wildly popular Online Marketing Made Easy podcast and author of many super successful online courses, is a master at not only helping others to change to build a life and business that they want, but at creating impactful change in her own life as well! Amy opens up about what “leveling up” in her life has looked like, what her catalyst for change was and how it can be yours too! We also talk about commonalities of success, and how to determine what success is FOR YOU rather than trying to fit some mold. You’re going to freaking love this interview and Amy’s beautiful, honest and even jaw-dropping stories!\n\nEric's closing song is \"I Dreamt Three Ships\" from the Holiday Collection at the incomparable pleasantpictures.club.",
            "length": "113634308",
            "sourceUrl": "http://feeds.soundcloud.com/stream/523296843-awesomewithalison-ep-63-how-to-make-hard-changes-in-your-life-find-success-with-amy-porterfield.mp3"
        },
        {
            "title": "Ep. 62: Awesome Questions: Something to ask yourself when you want to quit!",
            "datePublished": "Wed, 24 Oct 2018 14:00:13 +0000",
            "description": "If you want better answers you need to ask better questions! In this episode we are giving you some powerful questions that you can use as tools to help you when you want to quit! Quit what? Life! Your work! Your dreams! ANYTHING! If you're looking for more motivation, energy or just to be comforted as to why it's ok if things are going the way you want right now...you'll love this! \n\nEric's closing song is \"Holiday Fun Times\" from the brand new Holiday Collection at pleasantpictures.club",
            "length": "59602088",
            "sourceUrl": "http://feeds.soundcloud.com/stream/518739531-awesomewithalison-ep-62-awesome-questions-something-to-ask-yourself-when-you-want-to-quit.mp3"
        },
        {
            "title": "Ep. 61: PEP TALK for when LIFE IS A LOT!",
            "datePublished": "Fri, 12 Oct 2018 16:11:10 +0000",
            "description": "SPECIAL EPISODE ALERT! I’m so grateful you’re here! This mini special episode is a quick pep talk for when LIFE IS A LOT! Do you have a busy day? Do you have tons of things you need to accomplish? Are you feeling overwhelmed or inadequate for what life is asking of you right now? Holy hell I feel this way RIGHT NOW! So here’s a pep talk that’s under 10 minutes, and I hope you’ll listen to it whenever you need it. It will help you move from activity to activity with ease and more purpose, and I genuinely believe leave you feeling more awesome than you did before.\n\nMusic by Mr. Pleasant Pictures\npleasantpictures.club",
            "length": "19779752",
            "sourceUrl": "http://feeds.soundcloud.com/stream/513341358-awesomewithalison-ep-61-pep-talk-for-when-life-is-a-lot.mp3"
        },
        {
            "title": "Ep. 60: How everyone and everything is more accessible than you think!",
            "datePublished": "Fri, 28 Sep 2018 02:35:46 +0000",
            "description": "This is not feel-good, hyperbolic—dream it you can achieve it lip service. This is TRUTH: everyone and everything is more accessible than you think. This is the world we live in, this is why your excuses are cute, but meaningless. In this episode we’re sharing WHY and HOW your goals, ideas, plans and people you’d love to work with are more accessible than you think, and what that means for you and your LIFE! We share stories of how we’ve seen this truth manifested in our lives and others, and also five common factors of what will MAKE THINGS HAPPEN for YOU! Listen up, it’s gonna’ be fun! \n\nEric's closing song is \"Easy\" from the Mellow Gold collection at pleasantpictures.club",
            "length": "71830460",
            "sourceUrl": "http://feeds.soundcloud.com/stream/506305494-awesomewithalison-ep-60-how-everyone-and-everything-is-more-accessible-than-you-think.mp3"
        },
        {
            "title": "Ep. 59: Life after the tough stuff (trauma and loss) with Ashley Lemieux of The Shine Project",
            "datePublished": "Fri, 21 Sep 2018 02:53:18 +0000",
            "description": "The reality of life is that either you, or someone you know is currently living though a trauma or loss. Whether it’s a phone call that someone you love has cancer, the death of a loved one, a divorce, a betrayal, the loss of a job, a physical injury…the LIST GOES ON…what do you do? What does life look like the week after, six months after, a year after? How do you help someone who is experiencing this, or how do you help yourself?\n\n \n\nAshley Lemieux of The Shine Project opens up and shares her incredible insight and strength after experiencing what she refers to as her ultimate loss. We focus on what the details of her loss and trauma—and specifically her grief and healing process—looked like directly after, eight months after and now a year and half after losing her children in an unexpected and heart-breaking way. Ashley shares an unbelievable wealth of resources, tools, and lessons that’s she has learned through her experience. And shares them in such a profound and beautiful way so that anyone can relate.\n\n \n\nThis is an incredibly important episode, filled with stories, specific ideas and words that I know will help heal and guide anyone who is suffering right now--or anyone who wants to help others. It is an honor to be able to share Ashley and her beautiful story—and I know you’ll feel empowered, inspired and comforted after listening.\n\nFind Ashley at\n\nhttps://www.instagram.com/theshineproject/\n\nEric's closing song is \"Just Over Those Hills\" from the Triumph collection at pleasantpictures.club",
            "length": "170316200",
            "sourceUrl": "http://feeds.soundcloud.com/stream/502918065-awesomewithalison-ep-59-life-after-the-tough-stuff-trauma-and-loss-with-ashley-lemieux-of-the-shine-project.mp3"
        },
        {
            "title": "Ep. 58:  The power of the teeny tiny pivot",
            "datePublished": "Wed, 12 Sep 2018 20:47:26 +0000",
            "description": "BEHOLD THE POWER OF THE TEENY TINY PIVOT! In this episode we’re helping you see how one teeny tiny change can make huge impact in your life! We are giving you ideas for making that change, as well as ideas for where to try a teeny tiny pivot in your life! Good news, Pleasant Pictures really brings his A-game in this episode, so if you’re an Eric fan you’re in for a treat! It’s fun, it’s easy, and it will help you feel more awesome than you did before!\n\nEric's closing song is \"Lake Side\" from the brand new collection \"Weekend Away\" at pleasantpictures.club",
            "length": "62062796",
            "sourceUrl": "http://feeds.soundcloud.com/stream/498054696-awesomewithalison-ep-58-the-power-of-the-teeny-tiny-pivot.mp3"
        },
        {
            "title": "Ep. 57: The truth about your problems",
            "datePublished": "Wed, 29 Aug 2018 17:27:16 +0000",
            "description": "In this PITHY little episode we’re telling you ONE major truth about any problem that you have! So pick one problem you’ve been dealing with and listen up, because I PROMISE this will help open you up to solutions and feel at least A TAD better. I'm so excited to share this with you and sending it with SO MUCH LOVE!\n\nEric's closing song is \"Everyone is Here\" from the Ambient Beauty collection at the incomparable pleasantpictures.club",
            "length": "57931688",
            "sourceUrl": "http://feeds.soundcloud.com/stream/492370410-awesomewithalison-ep-57-the-truth-about-your-problems.mp3"
        },
        {
            "title": "Ep. 56: Finding your voice, value and contribution with Jessica Dahlquist.",
            "datePublished": "Wed, 22 Aug 2018 15:12:52 +0000",
            "description": "Have you ever heard people talk about their, “story” and thought, “what’s mine?” or “I wish mine was interesting and/or important”? Jessica is one my oldest and best friends, as well as the host of the successful Extraordinary Moms podcast! After interviewing and sharing the stories of over 200 women —Jessica is a freaking EXPERT at helping other people recognize their “story”. In this episode we’ll not only explore what THAT EVEN MEANS, but Jessica will also break down step-by-step how to start understanding what you have to contribute in this world, how to value your unique voice, how to start TAKING ACTION, and I KID YOU NOT will have you believing what you have to offer is more than enough, it’s extraordinary. GAH I’M ALREADY CRYING! You’ll laugh too, and you’re going to be so inspired and love it! \n\nEric's closing song is  \"Boogaloo Wit Me\" in the brand new Weekend Away collection at pleasantpictures.club",
            "length": "142128200",
            "sourceUrl": "http://feeds.soundcloud.com/stream/486472260-awesomewithalison-podcast-81418.mp3"
        },
        {
            "title": "Ep. 55:  Responding vs. Reacting",
            "datePublished": "Wed, 08 Aug 2018 15:39:00 +0000",
            "description": "Would you like more patience, less overwhelm, and to regret fewer things you let fly out of your gorgeous mouth? That was my goal when I started focusing on RESPONDING vs REACTING. In this episode I share this powerful tool that is helping me every single day, in every interaction I have. I hope it helps you feel awesome, and share more of your awesomeness with others! Eric's closing song is \"Do It If You Had To\" from his Pleasant Pictures Music Club. pleasantpictures.club",
            "length": "70203908",
            "sourceUrl": "http://feeds.soundcloud.com/stream/482806314-awesomewithalison-podcast-8718.mp3"
        },
        {
            "title": "Ep. 54:  How to deal with hard people and coaching vs. therapy with life coach Jody Moore",
            "datePublished": "Thu, 26 Jul 2018 18:35:41 +0000",
            "description": "Do not miss this episode I REPEAT DO NOT MISS THIS EPISODE! I squeeze every little bit of coaching and advice I can out of the phenomenal, genius and Mr. Miyagi-like life coach and host of the Better Than Happy podcast, Jody Moore! I ask Jody the questions we get from you guys THE MOST—and also have her teach us how to better self-coach ourselves through the HARDER things in life like tricky family relationships! I ALSO have her explain the point of a life coach, so if you’ve been curious about coaching vs. therapy she holds nothing back! You’re going to freaking love this. Eric's closing song is \"Mountain Morning\" from his music library pleasantpictures.club\n\n I talk about my new free webinar: How to use collaborations to grow your profits and platform!\n\nSIGN UP HERE: http://www.alisonfaulkner.easywebinar.live/registration-6\n\n Find Jody Moore and her podcast here:\nboldnewmom.com/podcast/\n\n And the audible link (for a free book and 30-day trial!) I couldn’t remember is here:\n\naudibletrial.com/awesomewithalison\n\nRob Lowe’s: Stories I Only Tell My Friends",
            "length": "128365148",
            "sourceUrl": "http://feeds.soundcloud.com/stream/477107376-awesomewithalison-ep-54-how-to-deal-with-hard-people-and-coaching-vs-therapy-with-life-coach-jody-moore.mp3"
        },
        {
            "title": "Ep. 53: Mastering growth, confidence and LIFE with Joy Cho!",
            "datePublished": "Thu, 19 Jul 2018 06:02:09 +0000",
            "description": "How can you juggle growing as a human, growing your dream, growing a family, creating a home and ALL THE OTHER THINGS in life without losing your freaking mind?! That’s what we’re learning in this episode from Joy Cho—the incredibly talented founder and creative director of Oh Joy! Which is a blog, lifestyle brand, design studio and all-around joy inducing brand! Joy opens up on how she has found her confidence, the steps she’s taking to continue to grow personally—do you have questions about what it’s like to have a life coach?! Joy shares all the details! And also shares her philosophies on dancing and so much more! You’ll be inspired to take a deep breath and dive into your life with JOY!\n\n\nThis episode is brought to you by @alisonsbrandschool Audio Courses! In which Joy shares her BIZNAZZ wisdom! It's so good! Check them out\nalisonsbrandschool.com/audiocourse\n\nEric Closing song is \"MegaCute Bass\" in the EDM skyline collection at pleasantpictures.club",
            "length": "113233412",
            "sourceUrl": "http://feeds.soundcloud.com/stream/472722972-awesomewithalison-oh-joy-podcast-v1_1.mp3"
        },
        {
            "title": "BONUS AUDIO TRAINING: Alison's 2-Step Plan for Growing Your Empire",
            "datePublished": "Tue, 17 Jul 2018 05:15:02 +0000",
            "description": "THIS IS NOT A REGULAR EPISODE! I REPEAT! This is ONLY for people who are interested in my @alisonsbrandschool goodies OR my 2-Step Plan for Growing Your Empire! I did this as an IG Live and a lot of people loved it and wanted to access it! So here it is! DO NOT LISTEN if you are not interested and don't want to know more about growing an empire and my awesome audio courses. WE HAVE A NEW REGULAR episode coming on Wednesday so don't fret! \n\nI DO THINK this is awesome inspiring content, but it also has a lot of Q&A about my audio courses (that will close on July 27): How to work with brands to build your empire AND How to work with influencers to grow your brand! I wanted to be sure to get answers to the people, SO HERE THEY ARE!\n\nLEARN MORE HERE: alisonsbrandschool.com/audiocourse",
            "length": "140249000",
            "sourceUrl": "http://feeds.soundcloud.com/stream/472712544-awesomewithalison-bonus-audio-training-alisons-2-step-plan-for-growing-your-empire.mp3"
        },
        {
            "title": "Ep. 52: My Anxiety Journey (ding)",
            "datePublished": "Wed, 11 Jul 2018 18:50:44 +0000",
            "description": "We're getting REAL PERSONAL (even more so than usual?!) haha as I share my life-long battle / journey with anxiety. What it has looked like for me, and how it has effected my family and life. I also share the steps I've take in recent years to work towards overcoming it. Even if you don't struggle with depression or anxiety personally, I hope that listening gives you some ideas for how to reach out and help those in your life who do.\n\nIf you are suffering, or feeling too discouraged to continue, PLEASE DON'T GIVE UP. Relief and love are out there. Please know we love you and REACH OUT FOR HELP.\n\nNational crisis text line: 741741\n\nThis episode of the podcast is brought to you by something I'm super excited about but has also brought me a lot of anxiety...my Alison's Brand School audio courses! STOP worrying alone about how to grow and build what you feel called to build. Learn more at alisonsbrandschool.com/audiocourse\n\nEric's closing song is \"First Time in the Fjords,\" from his Pleasant Pictures Music Club. pleasantpictures.club",
            "length": "141151016",
            "sourceUrl": "http://feeds.soundcloud.com/stream/470354448-awesomewithalison-podcast-71018.mp3"
        },
        {
            "title": "Ep. 51:   Fast and Easy Mindfulness Hacks!",
            "datePublished": "Wed, 06 Jun 2018 12:00:02 +0000",
            "description": "Ok, ok, ok, you can’t really “hack” mindfulness, HA! BUT it IS incredibly important and that’s not just according to the Buddhist monks. In this episode we share the definition of “mindfulness,” why EVERYBODY seems to be talking about it, and we also go into the scientifically proven benefits of “MBSR” or Mindfulness Based Stress Reduction. Then we’ve got 7 easy ways to incorporate mindfulness into your day! So listen up, and maybe listen and re-listen again, because different tools will help you on different days, but being freaking present is always freaking important. Eric's closing track is \"Achilles\" from his band New Shack's brand new EP.",
            "length": "103253816",
            "sourceUrl": "http://feeds.soundcloud.com/stream/453712137-awesomewithalison-ep-51-fast-and-easy-mindfulness-hacks.mp3"
        },
        {
            "title": "Ep. 50:  Going after your dreams like a barracuda with Rachel Hollis",
            "datePublished": "Thu, 31 May 2018 16:48:07 +0000",
            "description": "Oh my holy crap are you going to LOVE this episode! I had the honor and pleasure of interviewing New York Times bestselling author, and overall all BOSS BABE Rachel Hollis, and she did NOT HOLD BACK! Rachel talks to us all about going after your dreams in the face of rejection and discouragement and it is awesome! She also shares fantastic CONCRETE actions that you can implement today to start getting closer to your goals and dreams. During this episode Rachel offers up two questions to ask yourself that I found to be life-changing, and in addition to ALL that, she’s just a lot of fun. Rachel and I talk about what to do with jealousy (after I admit I’ve been totally jealous of her) ha! and how she wrote her beautiful book that I highly recommend, Girl Wash Your Face! Don’t miss this one. Just don’t. I hope you love it and feel FIRED UP to become a barracuda like Rachel. Eric's closing song is \"Grownup Talk\" from his www.pleasantpictures.club\n\nI'M DOING AWESOME BUNDLE: http://imdoingawesome.com/\n\nSHOW NOTES: http://thealisonshow.com/podcasts/ep-50-going-after-your-dreams-like-a-barracuda-with-rachel-hollis/\nINSTAGRAM: https://www.instagram.com/thealisonshow/\nRACHEL HOLLIS: https://www.instagram.com/msrachelhollis/\nGIRL, WASH YOUR FACE: https://amzn.to/2LOv0Qx",
            "length": "148364012",
            "sourceUrl": "http://feeds.soundcloud.com/stream/451801659-awesomewithalison-ep-50-going-after-your-dreams-like-a-barracuda-with-rachel-hollis.mp3"
        },
        {
            "title": "Ep. 49:  The mind-blowing principle of the adjacent possible",
            "datePublished": "Wed, 23 May 2018 05:42:38 +0000",
            "description": "What's your problem?! No, like actually, what's a problem you're dealing with right now? Are you looking for new ways to approach it? Are you hoping for a different solution than the one the thought-loop in your mind keeps landing on? Then you're going to want to strap on the ol' earbuds and learn about the mind-blowing principle of the adjacent possible! This principle has changed my life over the past few years by changing the way I come up with solutions to problems. It's abstract yet simple, and it's SCIENCE! I hope you love it, I hope it opens up some doors for you and I hope you tell all your friends about it too! Eric's closing song, \"This Boy is in Love,\" is from the soundtrack to the documentary he scored which premieres next month in England! He is also still shamelessly asking for your help on the kickstarter to help finish the film! http://kck.st/2KNB8s3",
            "length": "72060140",
            "sourceUrl": "http://feeds.soundcloud.com/stream/447924039-awesomewithalison-ep-49-the-mind-blowing-principle-of-the-adjacent-possible.mp3"
        },
        {
            "title": "Ep. 48: When will it be enough?!",
            "datePublished": "Wed, 16 May 2018 17:39:13 +0000",
            "description": "Do you ever feel like it WILL NEVER BE ENOUGH? Enough time, enough money, enough energy? No? Me neither…HAHA. PYSCH! Feelings of not being smart enough, beautiful enough, good enough, or “you fill in the blank” enough, can rule our lives if we let them. And here’s a spoiler—they will destroy you. So today we are talking about QUICK mind shifts you can make so you can get more ENOUGH in your life. We love you and we hope this helps you feel more awesome and ENOUGH than you did before. Eric's closing track is \"Crushing Hard\" from the Insufferable Groo soundtrack that he scored/produced. Please help us finish the documentary and to get Stephen Groo and his wife to England for the premiere! http://kck.st/2KNB8s3",
            "length": "65003744",
            "sourceUrl": "http://feeds.soundcloud.com/stream/444934929-awesomewithalison-ep-48-when-will-it-be-enough.mp3"
        },
        {
            "title": "Ep. 47: How to freaking get results!!!",
            "datePublished": "Wed, 09 May 2018 20:21:46 +0000",
            "description": "If you want to see different results you need to do things differently! Whether it's in health, relationships, business, feeling awesome, WHATEVER, we've got ONE major way you can start seeing more of the results you want and less of the crap you don't! This episode is jam packed with quick changes you can make RIGHT THIS SECOND to get you one step closer the feeling as awesome as you are! Eric's closing song is \"Beachy Head\" from the Orchestral Anthem playlist from his pleasantpictures.club.",
            "length": "84647648",
            "sourceUrl": "http://feeds.soundcloud.com/stream/441749973-awesomewithalison-podcast-5818.mp3"
        },
        {
            "title": "Ep. 46:  What’s a “new normal”? And tips for adjusting to it!",
            "datePublished": "Wed, 02 May 2018 05:07:02 +0000",
            "description": "You might be adjusting to a new normal right now, and not even know it! In this episode we’re talking about how both HUGE and seeming small life changes can cause us to feel totally whack, and then we’re giving you 5 suggestions for adjusting! This insight comes from my experiences suffering pretty severely from post-partum anxiety as well as my experience with learning to adjust to life after being hit by a car. But don’t worry, we still have a good time! And no matter where you’re at in life we think these ideas will help you feel a little more awesome than you did before! See you on the other side! Eric's closing track is \"Too Good\" from pleasantpictures.club. And Eric also says \"Don't lessen your content with subpar music, let us help you find the perfect tracks!\"",
            "length": "97813532",
            "sourceUrl": "http://feeds.soundcloud.com/stream/438145875-awesomewithalison-ep-46-whats-a-new-normal-and-tips-for-adjusting-to-it.mp3"
        },
        {
            "title": "Ep. 45: How to be a rock star at making decisions!",
            "datePublished": "Wed, 25 Apr 2018 17:01:01 +0000",
            "description": "Successful people make better decisions. So how do you make better decisions? We’re diving in and showing you! Eric takes the lead this time (watch out he’ll rock your world) and shares 3 tips for making better decisions that he’s learned from some decision-making masters! Have something weighing on your mind? By the end of this episode you’ll be ready to nail that decision so hard people will start singing, “STOP! Hammer time!” when you walk by. This episode is brought to you by Pleasant Pictures Music Club with the closing song \"All In\" coming from the Year of Music. pleasantpictures.club",
            "length": "65675036",
            "sourceUrl": "http://feeds.soundcloud.com/stream/435041421-awesomewithalison-ep-45-how-to-be-a-rock-star-at-making-decisions.mp3"
        },
        {
            "title": "Ep. 44: How to overcome crippling self-doubt!",
            "datePublished": "Wed, 18 Apr 2018 16:03:22 +0000",
            "description": "Trying to be your most awesome self can be a freaking rollercoaster! One minute you can be POSITIVE you’re a genius and your world domination is imminent, and then the next you can be struck with crippling self-doubt! So what do you do when you’re so full of doubt you feel paralyzed? LISTEN TO THIS EPISODE!!! We’re talking all about how to ward off that doubt in the first place, as well as what to do when you’re stuck right in the middle of it! Don’t doubt me on this, I’m an expert at doubting myself. HAHA Listen and enjoy! Eric's closing song is \"Hungry for the Magic\" from his pleasantpictures.club",
            "length": "97376096",
            "sourceUrl": "http://feeds.soundcloud.com/stream/431216754-awesomewithalison-ep-44-overcoming-crippling-self-doubt.mp3"
        },
        {
            "title": "Ep. 43: I want more motivation!",
            "datePublished": "Wed, 11 Apr 2018 21:17:56 +0000",
            "description": "Have you ever wanted more energy, passion, or just plain old motivation to do the things you want to do? Or maybe even to just get out of bed?! Then this episode is FOR YOU! We're talking about what \"motivation\" really means, and asking, \"Is that really what you need?\" Prepare to get pumped! Eric's closing song is \"Up For Days\" in the Triumph playlist of his pleasantpictures.club",
            "length": "77635100",
            "sourceUrl": "http://feeds.soundcloud.com/stream/428344002-awesomewithalison-ep-43-i-want-more-motivation.mp3"
        },
        {
            "title": "Ep. 42: 10 Things We've Learned in 10 Years of Marriage!",
            "datePublished": "Thu, 22 Mar 2018 04:04:53 +0000",
            "description": "It's been 10 freaking years of marriage and boy do we think we know a thing or two!! Ha! No, we know we know nothing, BUT! We are answering your super awesome questions on how we handle keeping the fiery flame of love burning, what to do if you're on a different growth path than your partner, and why I think we need to just all chillax. So grab your loved one and put on something unmentionable and buckle up for a wild episode! Closing song is \"Seabird\" from the \"I Dream in Acoustic\" playlist on Eric's pleasantpictures.club",
            "length": "133767848",
            "sourceUrl": "http://feeds.soundcloud.com/stream/417413505-awesomewithalison-ep-42-10-things-weve-learned-in-10-years-of-marriage.mp3"
        },
        {
            "title": "Ep. 41: I Got Hit By a Car pt. 2",
            "datePublished": "Wed, 28 Feb 2018 18:05:59 +0000",
            "description": "In this episode I’m reflecting over the past two months, sharing all the positive, universal life lessons I’ve been able to take from this tough experience—and how I think they’re applicable for you too! I also share something from the ugly side of trauma, that I didn’t realize would happen, in an effort for us all to be more aware. And then we end this puppy with 3 useful tools that you can use when you get hit by any type of “car” in your life! My goal for this episode is that you’re able to look at something hard in your own life, and see aspects of it in a new light! This episode is sponsored by Alison’s Brand School and my Build an Awesome Brand Workshop. If you’re an entrepreneur looking for clarity, engagement and to build your business, I want to party with you on March 23. Learn more at alisonsbrandschool.com Music is by Pleasant Pictures Music Club. www.pleasantpictures.club Eric's closing song is \"Cherry,\" a new single from his band New Shack.",
            "length": "127833752",
            "sourceUrl": "http://feeds.soundcloud.com/stream/406590336-awesomewithalison-ep-41-i-got-hit-by-a-car-pt-2.mp3"
        },
        {
            "title": "Ep. 40: I Got Hit By a Car pt. 1",
            "datePublished": "Wed, 21 Feb 2018 06:47:13 +0000",
            "description": "On December 20, 2017 I was hit by a car while jogging. It’s been two months and I’m feeling well enough to share the details of what happened, and what that experience was like for me. As well as the insights and lessons I’m learning along the way. Being able to share what I’ve learned and what I’m still learning from this difficult experience helps make it more meaningful for me, and I sincerely hope it might help you with a difficult experience, or any type of “hit” that you might have had or are experiencing in your life! I basically needed every tool we’ve talked about on the podcast in the past year, and some new ones too! This episode is sponsored by Alison’s Brand School and my Build an Awesome Brand Workshop. If you’re an entrepreneur looking for clarity, engagement and to build your business, I want to party with you on March 23. Learn more at alisonsbrandschool.com Music is by my sexy husband and his Pleasant Pictures Music Club. Closing song is \"You Take Me.\" pleasantpictures.club",
            "length": "143567876",
            "sourceUrl": "http://feeds.soundcloud.com/stream/381911699-awesomewithalison-ep-40-the-i-got-hit-by-a-car-story.mp3"
        },
        {
            "title": "Ep. 39: How to give the greatest gift: forgiveness!",
            "datePublished": "Tue, 19 Dec 2017 17:27:53 +0000",
            "description": "RUH-ROH! It's the end of the year, and it felt like a really good time to dive deeper into the topic of forgiveness, and what it actually means and doesn't mean. In this episode we're looking at what you can do to forgive yourself and others even when you don't have an apology--and might never get one. Oh I know it sounds SO SERIOUS, but it's also a lot of fun, and can help you in your day-to-day life! We hope you'll forgive us if you don't love this episode as much as we do...HA! Kidding you're gonna love it. Eric's closing song is \"Ocean Cliff\" from his upcoming Pleasant Pictures Music Club.",
            "length": "93244988",
            "sourceUrl": "http://feeds.soundcloud.com/stream/371729327-awesomewithalison-podcast-121417.mp3"
        },
        {
            "title": "Ep: 38. Negative Emotion Flip: Stress and Overwhelm",
            "datePublished": "Wed, 29 Nov 2017 14:55:55 +0000",
            "description": "It’s that time of the year! Or rather it’s always the time of year for stress and overwhelm! So we’re back with another negative emotion flip! We’re not talking about things you must DO to combat stress and overwhelm but rather better ways to think about them. Or in other words, we’re taking those negative emotions and flipping them on their head. This time we’re looking at how stress and that feeling of overall panic can give us some very helpful insight. And we’re also sharing some resources we’ve found for focusing our energy pulling our crap together! It’s gonna’ be awesome and we hope you love it. Eric's closing song is \"A Walk in the Redwoods\" from his upcoming Pleasant Pictures Music Club.",
            "length": "66910088",
            "sourceUrl": "http://feeds.soundcloud.com/stream/362513030-awesomewithalison-ep-38-negative-emotion-flip-stress-and-overwhelm.mp3"
        },
        {
            "title": "Ep. 37: 6 easy ways to make yourself miserable!",
            "datePublished": "Wed, 15 Nov 2017 06:46:44 +0000",
            "description": "Now, in no way do we WANT you to be miserable, but we recently realized there’s lots of simple things we do, every single day, that contribute to unnecessary suffering. So, we are sharing 6 EASY ways that you can make yourself miserable, in the hopes that we can all try to stop doing those things! Or I mean, if you want to be miserable you can keep doing them I guess. Either way they will help you be more self-aware! This episode is sponsored by ME and my awesome new audio courses that will blow your mind. Learn more at alisonsbrandschool.com \nEric's closing song is Heart in the Rain by his band New Shack.",
            "length": "125928452",
            "sourceUrl": "http://feeds.soundcloud.com/stream/356025068-awesomewithalison-podcast-111417.mp3"
        },
        {
            "title": "Ep. 36: Up your game: taking things to the next level!",
            "datePublished": "Thu, 02 Nov 2017 16:52:46 +0000",
            "description": "If you’re not growing you’re dying! That’s why taking things to the next level is critical. So if you’ve got an area of your life that you’re looking to up your game in…get stoked! We’re sharing 7 ideas that will help you get one step closer to WHATEVER your goal is in absolutely any area of your life. They are concrete, awesome, and bound to help you do what you feel called to do. This episode is sponsored by ME and my ab fab new audio courses that will blow your mind. Learn more at alisonsbrandschool.com Closing song is \"You Back\" by Stuart Maxfield from the upcoming Pleasant Pictures Music Club.",
            "length": "125136056",
            "sourceUrl": "http://feeds.soundcloud.com/stream/350205826-awesomewithalison-ep-36-up-your-game-taking-things-to-the-next-level.mp3"
        },
        {
            "title": "Ep. 35: How to OWN your life more fully!",
            "datePublished": "Thu, 26 Oct 2017 05:15:44 +0000",
            "description": "Do you want to be the boss of your life? Of course you do. That’s why we’re sharing our definition of “ownership” and how it applies to creating a life you love. We also share 7 ways to own your life more fully and the benefits of ownership in your life. Then we throw some practical application tips at you so you can start reaping the awesomeness of more ownership in your life TODAY. We hope you love it. Eric's closing song is \"Sixty\" by his band New Shack.",
            "length": "103763288",
            "sourceUrl": "http://feeds.soundcloud.com/stream/348637446-awesomewithalison-podcast-102517.mp3"
        },
        {
            "title": "Ep. 34: The Biggest Secret of Adulthood!",
            "datePublished": "Thu, 19 Oct 2017 23:35:15 +0000",
            "description": "Do you feel like you don’t know what you’re doing? Or that you’re overwhelmed with indecision about something?! Well we are unveiling the BIGGEST secret of adulthood—and it’s going to HELP YOU OUT! Click bait?! HARDLY! But we also spend a healthy amount of time sharing some television shows we are loving that have been helping us cope with adulthood too. And as always we offer a few actionable takeaways like 3 questions you can ask yourself when you’re feeling stuck or disillusioned, and we know that they will help you move to a place of action and more awesomeness!  If you want to get a free download of any of the books we mention during this episode be sure to hit up audibletrial.com/awesomewithalison and get a free audio book PLUS a 30 day free trial. Invest your time in good books and you'll be rich with awesomeness! Eric's closing song is \"Operation\" by his band New Shack.",
            "length": "91334468",
            "sourceUrl": "http://feeds.soundcloud.com/stream/347705162-awesomewithalison-ep-34-the-biggest-secret-of-adulthood.mp3"
        },
        {
            "title": "Ep. 33: Unsung Strengths: Being a Supporter!",
            "datePublished": "Wed, 04 Oct 2017 16:15:39 +0000",
            "description": "Things like hustle, achievement, and action get A LOT of praise, air time, and attention. But today we are singing praises to what we are calling an unsung strength: being a supporter! In this episode we want to hold up a mirror and help you see how AMAZING and needed your supportive qualities are, and show those of you who excel at this just how awesome you are. \n\nAnd for those of you who are like me, and rely heavily on supportive people, we are giving some pointers on how to be more of a cheerleader and appreciate the supportive people in your life. I think this episode is going to make you love yourself even more, and feel really awesome after, so we hope you enjoy! If you want to get a free download of any of the books we mention during this episode be sure to hit up audibletrial.com/awesomewithalison and get a free audio book PLUS a 30 day free trial. Invest your time in good books and you'll be rich with awesomeness! Eric's closing song is \"Plastic Pool\" by his band New Shack.",
            "length": "87353696",
            "sourceUrl": "http://feeds.soundcloud.com/stream/345340626-awesomewithalison-ep-33-unsung-strengths-being-a-supporter.mp3"
        },
        {
            "title": "Ep. 32: Negative Emotion Flips: Jealousy, Sadness & Hopelessness",
            "datePublished": "Wed, 27 Sep 2017 16:03:28 +0000",
            "description": "This is THE BEST EPISODE EVER! Or I mean, probably like the most helpful episode ever! We are looking at 3 very common, and seemingly negative emotions: jealously, sadness & hopelessness, and examining how these emotions can be used for our good! So we are totally FLIPPING these emotions on their head, and showing how they can help you get clear about the life you want, have more empathy and inspire you to do more of what you love. Yes! It's just that good. If you want to get a free download of any of the books we mention during this episode be sure to hit up audibletrial.com/awesomewithalison and get a free audio book PLUS a 30 day free trial. Invest your time in good books and you'll be rich with awesomeness! Eric's sad closing song is \"Inside Out\" by his band New Shack.",
            "length": "72991388",
            "sourceUrl": "http://feeds.soundcloud.com/stream/344147884-awesomewithalison-ep-32-negative-emotion-flips-jealously-sadness-hopelessness.mp3"
        },
        {
            "title": "Ep. 31: Freaking forgive yourself already!",
            "datePublished": "Wed, 20 Sep 2017 15:18:51 +0000",
            "description": "Today we are talking about the power of forgiving yourself—and not just from a touchy feely standpoint, but from an it will benefit the world type of view. Forgiving yourself is one of the best ways to stop being so self involved. Don't believe us? Listen up! We share personal experiences we've had from learning to forgive ourselves, and how it has helped us, as well as 3 actionable ways you can get better at forgiving yourself right now! Eric's closing song is \"House of Frankenstein\" by his band New Shack",
            "length": "90329096",
            "sourceUrl": "http://feeds.soundcloud.com/stream/343097104-awesomewithalison-podcast-91817.mp3"
        },
        {
            "title": "Ep. 30: How to never waste your time!",
            "datePublished": "Wed, 06 Sep 2017 18:09:25 +0000",
            "description": "Ooooooh boy do I HATE feeling like I'm wasting my time! Nothing gets me frustrated faster, or annoyed quicker than feeling like I'm not using my time wisely! And because this is SUCH a big trigger for negative feelings in my life, I've been working on ways to overcome this--and discovering methods for NEVER feeling like my time is wasted. So I'm sharing my tips and tricks, as well as 3 questions you can ask yourself to help turn every situation into one you can learn from! Gems friends, GEMS! Eric's closing song is \"Sunburn\" from his project OCEANEAR.",
            "length": "93775340",
            "sourceUrl": "http://feeds.soundcloud.com/stream/341195096-awesomewithalison-ep-30-how-to-never-waste-your-time.mp3"
        },
        {
            "title": "Ep. 29: Why meditation isn’t lame and stupid!",
            "datePublished": "Wed, 30 Aug 2017 04:56:17 +0000",
            "description": "Consider this episode a beginner's guide to meditation! Or if you're a meditation master we've got some different ideas for expanding your mind! So whether meditation excites you or the thought of it makes you want to punch a wall, we are sharing how mediation can help you lose weight, reach goals, be a better human and we're also giving you three tips for getting started. It's gold people! You'll also learn how we, as humans, are stimulation junkies and how we can try to combat that in our daily lives. I can 100% guarantee you'll get at least one lil nugget of value so we hope you listen and feel awesome! Eric's closing song is \"When You Came (Evermore Yours) by his project Present as Lord.",
            "length": "94385036",
            "sourceUrl": "http://feeds.soundcloud.com/stream/340100752-awesomewithalison-ep-29-why-meditation-isnt-lame-and-stupid.mp3"
        },
        {
            "title": "Ep. 28: PUMP UP: Why it doesn’t matter that other people are doing what you want to do!",
            "datePublished": "Thu, 17 Aug 2017 04:45:03 +0000",
            "description": "This week we are sharing a PUMP UP with you, and that means this episode is intended to PUMP (clap!) you up! We are breaking down why it doesn't matter if there are other \"more talented\" people doing or saying what you want to do, and how/why you should bring your gifts to the table! So listen up if you've been hesitating. I also share some more propaganda for self-love, and how we (as just one human) can combat all the hate and hurt happening in the world right now. It's a good one! Be sure to also chime in on our little survey, haha and tell us if you're #teameric or #teamalison in regards to the story we share. Haha! We hope you listen and feel awesome! Eric's closing song is \"Come Closer\" by his project Pixel Pony.",
            "length": "75330992",
            "sourceUrl": "http://feeds.soundcloud.com/stream/338229201-awesomewithalison-ep-28-pump-up-why-it-doesnt-matter-that-other-people-are-doing-what-you-want-to-do.mp3"
        },
        {
            "title": "Ep. 27: Teach Me Your Ways: Traits of an Awesome Leader with Mayor John Curtis",
            "datePublished": "Wed, 09 Aug 2017 14:54:59 +0000",
            "description": "Awesome leadership skills can help you in every aspect of life! In your job, as a parent, as a member of the community--the world needs good leaders! We love our local mayor John Curtis, and we are graced with his prestigious presence as he \"Teaches us his ways!\" and shares things he's learned about leadership as both the mayor of Provo as well as building his multi-million dollar business. He's not your average politician, he's got polka dot socks, and instead of getting all political we get straight up philosophical. You'll learn simple actionable ideas you can implement today! Eric's closing song is \"Morning's Light\" by his project Present as Lord.",
            "length": "117079508",
            "sourceUrl": "http://feeds.soundcloud.com/stream/337149078-awesomewithalison-ep-27-teach-me-your-ways-traits-of-an-awesome-leader-with-mayor-john-curtis.mp3"
        },
        {
            "title": "Ep. 26: Teach Me Your Ways: Overcoming obstacles with Craig Faulkner!",
            "datePublished": "Wed, 02 Aug 2017 17:20:40 +0000",
            "description": "Teach me your ways is a new series on the podcast where we interview people who are NAILING something at life! For our first one we're talking to my papa Craig Faulkner and he shares 3 obstacles he's faced in his life (they're gonna surprise you!) and his tips for overcoming them! Prepare to have your mind expanded and to feel way more awesome and inspired than you did before! \nEric's closing song is \"Neptune\" by his band New Shack.",
            "length": "93649016",
            "sourceUrl": "http://feeds.soundcloud.com/stream/335755087-awesomewithalison-podcast-73117.mp3"
        },
        {
            "title": "Ep. 25: Big Picture Thinking vs. Small Picture thinking",
            "datePublished": "Thu, 20 Jul 2017 04:40:30 +0000",
            "description": "In this episode we are going to blow your mind...well at least TRY to blow your mind from small picture to BIG PICTURE thinking! We're going to outline how small picture thinking can limit us, what some attributes are of both types of thinking, and also share 3 tactical tools you can use TODAY to expand your horizons! We hope you get some good ideas on how to shift your perspective and get where you want to be! Eric's closing song is \"Stupid Heart\" by his project Kissed Out.",
            "length": "97856336",
            "sourceUrl": "http://feeds.soundcloud.com/stream/333978324-awesomewithalison-ep-25-big-picture-thinking-vs-small-picture-thinking.mp3"
        },
        {
            "title": "Ep. 24: I'M FREAKING GRATEFUL: A gratitude practice to help you love your life!",
            "datePublished": "Wed, 12 Jul 2017 07:38:48 +0000",
            "description": "This is a special episode that you can use on the daily! We are sharing a gratitude practice that you can implement every day to see real, amazing changes in your life and well-being. It's intended to be used when you're moving your body, but don't fret if you're driving or can't get mobile, just lay back and take a journey in your mind. We hope you use it, love it, and find awesome in it. Eric's music is all up in this joint. No but really, it's all Eric's original music.  Enjoy",
            "length": "32884040",
            "sourceUrl": "http://feeds.soundcloud.com/stream/332834543-awesomewithalison-ep-24-im-freaking-grateful-a-gratitude-practice-to-help-you-love-your-life.mp3"
        },
        {
            "title": "Ep. 23: WHAT IS a gratitude practice?! And how can it change your life?! We'll tell you!",
            "datePublished": "Wed, 12 Jul 2017 07:36:20 +0000",
            "description": "Hold on to your thank you notes! We are spilling all the facts on how insanely impactful a gratitude practice can be in reducing anxiety, depression, and just overall making your life better! We're also giving you details on the gratitude practice we're gifting you in episode 24! So listen up because there's gold in 'dem there hills! Eric's closing song is \"Airplane\" by his band New Shack.",
            "length": "53106320",
            "sourceUrl": "http://feeds.soundcloud.com/stream/332834383-awesomewithalison-ep-23-what-is-a-gratitude-practice-and-how-can-it-change-your-life-well-tell-you.mp3"
        },
        {
            "title": "Ep. 22: Six ideas to help you snap out of a funk!",
            "datePublished": "Thu, 29 Jun 2017 16:41:32 +0000",
            "description": "Listen to this episode when you're feeling a case of the funks creepin up on ya! OR better yet, listen to it RIGHT THIS SECOND so the next time you just can't seem to find the pep in your step you'll have six, yes SIX, new tools for kickstarting your awesome. Eric and Alison share some of their personal tried and true methods for warding off the blahs. Eric's closing song is New Shack's brand new single \"Bit Map.\"",
            "length": "62534684",
            "sourceUrl": "http://feeds.soundcloud.com/stream/330660854-awesomewithalison-podcast-62817.mp3"
        },
        {
            "title": "Ep. 21: How I decide who to do business with, and how it’s applicable to your life!",
            "datePublished": "Wed, 21 Jun 2017 06:32:07 +0000",
            "description": "This episode is all about how to create healthy boundaries to set your relationships up for success! Because if you're not happy in a relationship, that's on you! I'm sharing what has taken me the last 3 years to figure out when it comes to business collaborations, but I think you'll see the parameters I've put in place for myself are applicable to any type of relationship. As always, Eric chimes in and drops the knowledge bombs. We hope listen and feel awesome! Eric's closing song is \"Tongue Tied\" by his project Pixel Pony.",
            "length": "81475328",
            "sourceUrl": "http://feeds.soundcloud.com/stream/329221543-awesomewithalison-ep-21-how-i-decide-who-to-do-business-with-and-how-its-applicable-to-your-life.mp3"
        },
        {
            "title": "Ep. 20: A quick thought from #cancerwithcraig",
            "datePublished": "Thu, 08 Jun 2017 04:41:12 +0000",
            "description": "I spent last week in the hospital with my dad who is recovering from a stem cell transplant. While chatting with him he shared an idea with me about service that I absolutely had to share with you! I'm also letting you guys know about his new podcast called Cancer With Craig: Managing Illness as a Project. The first episode is up on iTunes! I hope you check it out and I hope you feel a little more awesome. Eric's closing song is \"Lonely Pocket Self\" by New Shack.",
            "length": "26536520",
            "sourceUrl": "http://feeds.soundcloud.com/stream/327083373-awesomewithalison-ep-20-a-quick-thought-from-cancerwithcraig.mp3"
        },
        {
            "title": "Ep. 19: Confidence is a muscle, let’s WERK IT OUT!",
            "datePublished": "Thu, 01 Jun 2017 05:16:27 +0000",
            "description": "Yes, you're awesome, but there's probably at least one area in your life where you'd like to boost your confidence! In this episode we are offering confidence building exercises, sharing where we think true confidence comes from, and going down and deep. You're going to love it, and we hope it helps you feel awesome. Eric's closing song is \"Dream About\" by his project Present as Lord.",
            "length": "107160464",
            "sourceUrl": "http://feeds.soundcloud.com/stream/325479145-awesomewithalison-ep-19-confidence-is-a-muscle-lets-werk-it-out.mp3"
        },
        {
            "title": "Ep. 18: What to do with OPP: Other People’s Problems!",
            "datePublished": "Thu, 18 May 2017 06:23:25 +0000",
            "description": "Have you ever been excited to start something or try a new venture, only to get bummed out by the lack of support from loved ones and friends? In this episode we're talking about not letting OPP's--other people's problems--keep you from doing what you know you should! Prepare yourself for a pungent visual. Eric's closing song is \"Heart in the Rain\" by his band New Shack.",
            "length": "64036928",
            "sourceUrl": "http://feeds.soundcloud.com/stream/323180873-awesomewithalison-ep-18-what-to-do-with-opp-other-peoples-problems.mp3"
        },
        {
            "title": "Ep. 17: 3 good branding principles that will make your LIFE better!",
            "datePublished": "Thu, 11 May 2017 04:47:32 +0000",
            "description": "You don't need to have a business or even be interested in branding to have these 3 principles totally make an impact in your life! Of course if you are interested in building something this will totally be a two for one! But either way these ideas are as true for brands as they are for humans! We hope you try them and feel awesome. Eric's closing song is \"Good Camera\" by his project OCEANEAR.",
            "length": "90380288",
            "sourceUrl": "http://feeds.soundcloud.com/stream/322035492-awesomewithalison-ep-17-3-good-branding-principles-that-will-make-your-life-better.mp3"
        },
        {
            "title": "Ep. 16: Let's talk about money, honey!",
            "datePublished": "Thu, 27 Apr 2017 06:07:17 +0000",
            "description": "Ok we are doing it. We're talking about how we make money, how we've made money, and how to figure out YOUR relationship with money so you can make more of it! Because it's not bad, it's awesome! Eric's closing song is \"Stereo Sedation\" by his band New Shack.",
            "length": "120865052",
            "sourceUrl": "http://feeds.soundcloud.com/stream/319691923-awesomewithalison-ep-16.mp3"
        },
        {
            "title": "Ep. 15: How to make a \"Best Self\" checklist!",
            "datePublished": "Wed, 19 Apr 2017 21:50:22 +0000",
            "description": "We're sharing things we've noticed help us perform at our highest level, and keep us feeling awesome! And then we're giving you the how-to on creating a \"Best Self\" checklist of your own!  Eric's closing song is his band New Shack's cover of 1979 by The Smashing Pumpkins.",
            "length": "82268372",
            "sourceUrl": "http://feeds.soundcloud.com/stream/318349581-awesomewithalison-podcast-4182018.mp3"
        },
        {
            "title": "Ep. 14: Do you go out when you should go in?",
            "datePublished": "Thu, 06 Apr 2017 01:15:26 +0000",
            "description": "You're gonna love this! When you need validation, comfort, strength, or support, do you go to OUTSIDE sources? We're talking about why it can be better to look IN first, and sharing 5 ideas on how to do that. Prepare to get aware! Eric's closing song is \"Lights Go Out\" by his past project Pixel Pony.",
            "length": "75103400",
            "sourceUrl": "http://feeds.soundcloud.com/stream/316321336-awesomewithalison-ep-14-do-you-go-out-when-you-should-go-in.mp3"
        },
        {
            "title": "Ep. 13: What we’re working on: Why it’s good to just get started!",
            "datePublished": "Wed, 29 Mar 2017 06:16:09 +0000",
            "description": "In this episode we're sharing some fun updates that we are excited about in our businesses, and reflecting back on how they would have never happened if we hadn't just gotten started! Hopefully you'll feel empowered to get a move on whatever it is you want to do! Eric's closing song is \"Universe\" by his project OCEANEAR.",
            "length": "85905668",
            "sourceUrl": "http://feeds.soundcloud.com/stream/315001527-awesomewithalison-ep-13-what-were-working-on-why-its-good-to-just-get-started.mp3"
        },
        {
            "title": "Ep. 12: 9 things we’ve learned from being married for 9 years!",
            "datePublished": "Wed, 22 Mar 2017 16:10:35 +0000",
            "description": "It's our anniversary!!! We're not pretending that we are marriage experts, but we have been happily married for 9 awesome years! And we do like each other enough to do a podcast together--so we're sharing a few things we've learned. We hope our experiences help you have a more awesome relationship with someone you love. Or you can just laugh at us. Either way, we hope you enjoy! Eric's closing song is \"A Million Pieces\" by his band New Shack.",
            "length": "83848988",
            "sourceUrl": "http://feeds.soundcloud.com/stream/313728598-awesomewithalison-ep-12-9-things-weve-learned-from-being-married-for-9-years.mp3"
        },
        {
            "title": "Ep. 11: Ideas for unplugging and being freaking present!",
            "datePublished": "Thu, 09 Mar 2017 04:24:04 +0000",
            "description": "In this quick lil episode we share some ideas for making sure the people you love the most aren't getting the worst of you, and what we do to unplug and live IN THE NOW. Eric's closing track is \"Disassembly\" by New Shack.",
            "length": "51435920",
            "sourceUrl": "http://feeds.soundcloud.com/stream/311129184-awesomewithalison-ep-11-tips-for-unplugging-and-being-freaking-present.mp3"
        },
        {
            "title": "Ep. 10: You're so rich and you don't even know it!",
            "datePublished": "Tue, 28 Feb 2017 07:33:40 +0000",
            "description": "Often we are rich in resources that we don't even realize because we can only see our obstacles and excuses. So to help free your mind a bit, I share the four types of resources I think you can feel depleted of, and also share some exercises you can do to expand your horizons (from the comfort of your living room) and find more resources around you. You're gonna feel RICH! Or at least rich in awesomeness. Eric's closing song is \"ABC\" by New Shack.",
            "length": "89892704",
            "sourceUrl": "http://feeds.soundcloud.com/stream/309924825-awesomewithalison-podcast-22717.mp3"
        },
        {
            "title": "Ep. 9: Five Years to Live with Melanie Day",
            "datePublished": "Wed, 22 Feb 2017 17:42:00 +0000",
            "description": "We've got special guest Melanie Day sharing her awesomeness and inspiration to live life to the fullest from the perspective of a cancer victim. Melanie has five years to live and isn't wasting any more time! She shares the habits she let go of with her diagnosis, her insight from doing chemo while pregnant--as well as giving us all tips for how to support a loved one with cancer, and divulges her plans for making every day exactly what she wants it to be! Find and support Melanie and her family of five at fiveyearstolive.org Eric's closing song is \"Love and Kindness\" by Present as Lord.",
            "length": "98511968",
            "sourceUrl": "http://feeds.soundcloud.com/stream/309025531-awesomewithalison-ep-9-five-years-to-live-with-melanie-day.mp3"
        },
        {
            "title": "Ep. 8: Ok, ok! I'll finally talk about my weight loss!",
            "datePublished": "Wed, 15 Feb 2017 18:43:30 +0000",
            "description": "I've been getting lots of questions about my recent weight loss, and like everything I do, I didn't want to say anything until I could say everything! So here you have it, my 20+ year struggle with my weight, and how I've finally found happiness and peace regardless of what I weigh. Eric's closing song is \"Minus Yours\" by Kissed Out.",
            "length": "119980784",
            "sourceUrl": "http://feeds.soundcloud.com/stream/307650862-awesomewithalison-ep-8-ok-ok-ill-finally-talk-about-my-weight-loss.mp3"
        },
        {
            "title": "Ep. 7: Are you in a \"Yes!\" phase or a \"No!\" phase?",
            "datePublished": "Wed, 08 Feb 2017 09:58:30 +0000",
            "description": "I go through what I call \"Yes!\" phases, and \"No!\" phases. And I think it’s helpful to define what type of phase you’re in so you don’t feel depleted and discouraged, and you’re putting out the right type of energy. So I offer some questions to help you determine if you're grooving in a \"yes\" or \"no\" phase, and some ideas for what to do in each! Eric's closing song is \"Send Your Mother My Best\" by Present as Lord.",
            "length": "81161732",
            "sourceUrl": "http://feeds.soundcloud.com/stream/306685736-awesomewithalison-ep-7-are-you-in-a-yes-phase-or-a-no-phase.mp3"
        },
        {
            "title": "Ep. 6: What's fear got to do, got to do with it?!",
            "datePublished": "Wed, 01 Feb 2017 19:18:50 +0000",
            "description": "In this episode we introduce some new segments, and then chat about fear, and if it's possible to cultivate courage! SPOILER, we think it is, and we share some ideas for how! Eric's closing song is \"Blue Hot\" by New Shack. Here is the link to the music video: https://www.youtube.com/watch?v=TWh4dFvZl08",
            "length": "66462212",
            "sourceUrl": "http://feeds.soundcloud.com/stream/305375945-awesomewithalison-ep-6-whats-fear-got-to-do-got-to-do.mp3"
        },
        {
            "title": "Ep. 5: Alison's Top 5 Lessons Learned in 2016",
            "datePublished": "Wed, 25 Jan 2017 20:27:21 +0000",
            "description": "2016 happened, I learned some lessons, I shared them. Why one earth anyone cares I'll never know. But hopefully you find something helpful. Eric's closing song: \"The Finite,\" by OCEANEAR.",
            "length": "50129876",
            "sourceUrl": "http://feeds.soundcloud.com/stream/304234442-awesomewithalison-ep-5-alisons-top-5-lessons-learned-in-2016.mp3"
        },
        {
            "title": "Ep. 4: What if things don't turn out how you want?",
            "datePublished": "Wed, 18 Jan 2017 17:32:14 +0000",
            "description": "It's hard to feel awesome when things don't go the way you want them to. So in this episode we talk about things that went horribly wrong, or if not HORRIBLY wrong, at least not as we would have liked. We cover being excluded, people being mean, and not getting opportunities we thought we needed. Then we share why we're happy they happened and what we've learned. Hopefully it will help you see a not-so-fun thing happening in your life in a new way so you can start feeling a little bit more awesome! Eric's closing song: \"Little Boys\" by New Shack",
            "length": "63652808",
            "sourceUrl": "http://feeds.soundcloud.com/stream/303337757-awesomewithalison-ep-4-what-if-things-dont-turn-out-how-you-want.mp3"
        },
        {
            "title": "Ep. 3: Are you having enough fun?! w/ special guest Susan Petersen!",
            "datePublished": "Wed, 04 Jan 2017 00:31:27 +0000",
            "description": "Is having fun THAT important? Yes, yes it is! That's why Susan Petersen of Freshly Picked and Alison share some of their most fun memories, and give tips for reclaiming your sense of fun, even if you can't remember what that is. Eric's closing song: \"It's the Alison\" by the Alison Show",
            "length": "92354048",
            "sourceUrl": "http://feeds.soundcloud.com/stream/300818568-awesomewithalison-ep-3-are-you-having-enough-fun-w-special-guest-susan-petersen.mp3"
        },
        {
            "title": "Ep. 2: Our story, and taking the leap to work for yourself!",
            "datePublished": "Wed, 04 Jan 2017 00:29:09 +0000",
            "description": "Ever wonder how we got started working for ourselves? We're gonna share the nitty gritty details of what creating two businesses with 3 kids looks like and the lessons we've learned! We also share our top piece of advice to help you get started on whatever your dream project is. Regardless of whether you're interested in becoming an entrepreneur, we've got some ideas on how to create the life you want! Eric's closing song: \"Dead Lips\" by New Shack",
            "length": "109438208",
            "sourceUrl": "http://feeds.soundcloud.com/stream/300818263-awesomewithalison-ep-2-taking-the-leap-to-work-for-yourself-or-how-to-do-whatever-you-feel-like-doing.mp3"
        },
        {
            "title": "Ep. 1: How to slay your goals and get stuff done!",
            "datePublished": "Wed, 28 Dec 2016 06:12:11 +0000",
            "description": "Sure, sure setting goals is cute, but what about actually accomplishing them? In this episode we share 5 tips on how to GET ER DONE. Brace yourself for a productivity boost! Eric's closing song: \"Queen of Hearts\" by New Shack",
            "length": "58469888",
            "sourceUrl": "http://feeds.soundcloud.com/stream/299870403-awesomewithalison-episode-1-how-to-slay-your-goals.mp3"
        }
    ]
}