{
    "artwork": "http://is5.mzstatic.com/image/thumb/Music62/v4/93/89/14/938914a8-f895-6bd3-3d83-717139ff02ca/source/100x100bb.jpg",
    "description": "The BBC Natural History Unit produces a wide range of programmes that aim to immerse a listener in the wonder, surprise and importance that nature has to offer.",
    "feedURL": "https://podcasts.files.bbci.co.uk/p02nrv7r.rss",
    "podcastURL": "http://www.bbc.co.uk/programmes/p02nrv7r",
    "title": "Best of Natural History Radio",
    "episodes": [
        {
            "title": "Living World : My Living World : Woodcock",
            "datePublished": "Sun, 22 Mar 2020 10:00:00 +0000",
            "description": "Wildlife filmmaker Hannah Stitfall and wildlife film researcher Dom Davies enjoy a close encounter with one of our most mysterious birds, the woodcock, when they review another selection from the LIVING WORLD archive. The woodcock is a wader which spends most of its life in woodland where its wonderful mottled plumage makes it very hard to see, especially as they are nocturnal so most active at night. The population swells in winter when over a million more migrate here from Scandinavia and Russia in search of earthworms and insects which they probe from the ground with their long bills. Hannah and Dom also discuss another remarkable feature of these birds which is their strange roding flight call.",
            "length": "20720000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p08675t3.mp3"
        },
        {
            "title": "Living World : My Living World : Winter Flies",
            "datePublished": "Tue, 10 Mar 2020 17:09:00 +0000",
            "description": "Where do flies go in winter and what happens to them? Wildlife filmmaker Hannah Stitfall and wildlife film researcher Billy Clark review another selection from the Living World archive to try and find out the answer. The original programme was recorded beside an icy pond in a woodland near Kidderminster where, with the help of pooters and ‘ghostbuster gear’, a surprising number of flies are discovered in winter including the stunning-looking dollies, best known for their metallic green sheen and long dancing legs!",
            "length": "20704000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p08675qj.mp3"
        },
        {
            "title": "Living World : My Living World : The Spined Loach",
            "datePublished": "Sun, 29 Dec 2019 10:00:00 +0000",
            "description": "Keen naturalist Hannah Stitfall is joined by wildlife film researcher Dom Davies to review another programme from the LIVING WORLD archive. The subject today is Spined Loach - a fish you might never heard of because, whilst locally they are abundant, they are classified as a rare protected species and are only found in a handful of places in the UK. Also known as the Spotted Weather Loach because of their ability to detect changes in atmospheric or barometric pressure brought about by changes in the weather, they half bury themselves in fine organic sediment at the bottom of rivers or lakes during the day and then at night sieve the sediment, eating small shrimps and ejecting the mud and sand through their gills. As Hannah and Dom discover, these little fish also have some amazing survival techniques which enable them to survive low oxygen levels, whilst the spines which protrude from under their eyes are thought to help ward off predators.",
            "length": "20704000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p07wc6gc.mp3"
        },
        {
            "title": "Living World : My Living World : Jackdaw Roost",
            "datePublished": "Sun, 15 Dec 2019 10:00:00 +0000",
            "description": "In this episode from 2011 Joanna Pinnock wonders what makes jackdaws roost together, and to find out more heads to the Cambridgeshire countryside with corvid scientist Dr Alex Thornton. Arriving in the dead of night they await one of nature’s spectacles, of thousands of jackdaws simultaneously leaving their night roost in a cacophony of sound. It is one of those winter spectacles often overlooked but rivalling any in the natural world. So what is actually going on here? For Hannah and Billy this gives them the opportunity to discuss corvid activity. Science is beginning to unravel the biology and social intelligence of corvids, recently dubbed feathered apes, but there is a lot still to learn about these familiar if mysterious jackdaws. If the morning was a spectacle, how will that compare with the evening gathering at the roost; some roosts have been recorded in the Domesday Book and are still being used centuries later?",
            "length": "20704000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p07wc3x7.mp3"
        },
        {
            "title": "Natural Histories : Aye-Aye",
            "datePublished": "Fri, 29 Nov 2019 12:00:00 +0000",
            "description": "Think sprite or hobgoblin and you are nearly there when it comes to the Aye-Aye, surely one of the weirdest looking creatures on earth? With its large saucer-like eyes, massive ears, and long skeletal middle finger which its uses to tap for grubs on logs, this lemur both fascinates and terrifies us. Endemic to the forests of Madagascar, some local people believe that if one looks at you, someone in your village will die. They even hang up an aye-aye on the edge of the village in some areas to ward off evil spirits. We are responsible for the demise of the aye-aye in other ways; by destroying the forests on which it depends. But as we hear, get up close to an aye-aye and you’ll meet one of the most alluring and watchable mammals on the planet. Not merely a creature in close harmony with its disappearing world, but as Brett Westwood and Verity Sharp discover an ambassador for conservation which still has us in its thrall.",
            "length": "26528000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p07wc9q1.mp3"
        },
        {
            "title": "Natural Histories : Pigeon",
            "datePublished": "Fri, 22 Nov 2019 17:22:00 +0000",
            "description": "The relationship between humans and pigeons is one of the oldest on the planet. They have been our co-workers; delivering messages, assisting during the war, providing a source of food, a sport and obsession for many, and a suitable religious sacrifice. They helped Darwin with his theory of Natural Selection, have become a powerful symbol of peace and helped us unravel some of the mysteries of navigation. Yet many of us still regard them as vermin, as “rats with wings”. Brett Westwood and Verity Sharp probe into this paradox, and explore how pigeons have helped us and what they can reveal about the homing instinct and what it means for us to feel at home",
            "length": "26464000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p07w0lc8.mp3"
        },
        {
            "title": "Natural Histories : Fern",
            "datePublished": "Fri, 15 Nov 2019 17:52:00 +0000",
            "description": "For a plant that we generally associate with shady, damp places, a plant that has no flowers or scent, the Fern has drawn us into her fronds and driven an obsession that is quite like any other. Pteridomania or Fern Madness swept through Victorian Britain in part thanks to the availability of plate glass from which manufacturers could build glass cases for growing ferns. The trade in ferns all but wiped out some species from parts of the UK and fern hawkers sold specimens on street corners in London. Brett Westwood and Verity Sharp trace our relationship with the fern on a journey from a slide of spores in Durham, to the art of Nature Printing via a garden fernery and discover that the fern is still weaving its magic spell over us.",
            "length": "26432000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p07tz87r.mp3"
        },
        {
            "title": "Natural Histories : Poppy",
            "datePublished": "Fri, 08 Nov 2019 17:48:00 +0000",
            "description": "Poppies are associated with many things but to most people they are a symbol of remembrance or associated with the opium trade. Natural Histories examines our fascination with the flower. Lia Leendertz visits the Royal Botanic Gardens Kew where James Wearn shows her a collection of poppy paraphernalia from around the world. Andrew Lack, of Oxford Brookes University and author of Poppy, explains how the flower made its way to the British Isles with the introduction of agriculture, and Joe Crawford of Exeter University describes the popularity of the opium poppy in 19th century Britain, especially among female poets. A vibrant opium trade led British horticulturalists to try and establish a home grown opium crop - without success. Fiona Stafford appraises the poppy in art encouraging us to look again at Monet's late 19th century painting of a poppy field in northern France. It was painted just a few decades before the outbreak of the Great War which established the red poppy as a permanent reminder of the bloodshed of fallen soldiers.",
            "length": "26576000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p07tz89f.mp3"
        },
        {
            "title": "Natural Histories : Chicken",
            "datePublished": "Fri, 01 Nov 2019 17:45:00 +0000",
            "description": "How did we get from the gorgeous red junglefowl scratching away in the jungles of south-east Asia to the chicken now eaten in its millions? Brett Westwood and Joanna Pinnock trace the trail. The story's told by Greger Larson, Director of the Palaeogenomics & Bio-Archaeology Research Network; Annie Potts, Director, New Zealand Centre for Human-Animal Studies; Dr Joanne Edgar, University of Bristol School of Veterinary Sciences and by a visit to meet real red junglefowl, the original chicken, at the Pheasantry at Sudeley Castle in Gloucestershire.",
            "length": "26656000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p07tz85w.mp3"
        },
        {
            "title": "Natural Histories : Bee",
            "datePublished": "Fri, 25 Oct 2019 16:40:00 +0000",
            "description": "Bees have been the subject of fascination and reverence since ancient times. Natural Histories explores the story of bees and why humans like to compare themselves to them, seeing ourselves as either virtuous workers or moral examples. The ancient Greek poets thought of themselves as bees who foraged and chose the sweetest words to produce great art, while the Victorians admired bees for their industry and selflessness. But with news of declining bee populations around the world, Natural Histories talks to those who monitor the decline of some species and try to address the ecological problems causing their demise, as well as to honeybee keepers who say that in the cities, bees are actually thriving.",
            "length": "26448000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p07tz851.mp3"
        },
        {
            "title": "Natural Histories : Sloth",
            "datePublished": "Fri, 18 Oct 2019 16:36:00 +0000",
            "description": "The dreamy smile of the sloth has made it wildly popular, but once its slowness was condemned and saw it named after one of the seven deadly sins. Brett Westwood and Joanna Pinnock talk to those who really know, understand and live with sloths and ask if we're still projecting our own feelings onto them. Our changing attitudes to sloths tell us more about ourselves than about this harmless animal. Dr Rebecca Cliffe, founder of the Sloth Conservation Foundation and a leading researcher, is in the rainforest in Costa Rica with them right now. She describes how local people feel about them, while she sits under a tree with a sloth at the top. Joanna Pinnock tries for her own encounter with Marilyn the sloth and her baby Elio at ZSL London Zoo, and experiences the magic of sloths at first hand. William Hartston, author of Sloths: A Celebration of the World’s Most Misunderstood Mammal. explains the vexed history of sloth first as a sin then its next incarnation as a harmless South American treetop dweller named after that sin, and the repercussions for the animal down the centuries. He also shares his opinion on the best sloth in film. And it's not Sid from Ice Age. And the poet Debbie Lim reads her poem Gift of the Sloth, describing other ways in which they deserve our admiration, but again not for the reasons that the current popular image of sloths would seem to suggest.",
            "length": "26800000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p07tz89z.mp3"
        },
        {
            "title": "Living World : My Living World : Stone Curlew",
            "datePublished": "Sun, 13 Oct 2019 11:00:00 +0000",
            "description": "Wildlife film maker Hannah Stitfall is joined by Dom Davies, a wildlife film researcher to discuss another pick from the Living World archive. Today their subject is Stone Curlews and a programme in which the presenter Joanna Pinnock travels to Wiltshire in search of these crepuscular waders whose haunting calls can be heard after dusk. She is joined by Nick Adams of the RSPB who has been working with local farmers on a conservation project to improve the habitat for these birds and restore the population which became seriously depleted in the mid-1980s. For Hannah and Dom the programme offers a rare encounter with a bird that few of us will have seen or heard.",
            "length": "20576000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p07m8fpt.mp3"
        },
        {
            "title": "Living World : My Living World : Winter Ladybirds",
            "datePublished": "Sun, 29 Sep 2019 11:00:00 +0000",
            "description": "Zoologist and wildlife film maker Hannah Stitfall is joined by Billy Clark, a researcher with the BBC Natural History Unit to discuss another selection from the LIVING WORLD archive. Today the subject is over-wintering ladybirds and the challenges these most familiar of insects face during dormancy. They also discuss the origin of the name 'Ladybird', the diverse range of species we have, threats from an alien species and a ladybird survey that is looking for your help.",
            "length": "20656000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p07ly3xc.mp3"
        },
        {
            "title": "Planet Puffin. Episode 12: The Puffin Rescuers",
            "datePublished": "Mon, 29 Jul 2019 15:49:00 +0000",
            "description": "In the final episode, Becky Ripley and Emily Knight search for pufflings that have run into trouble on their journey from their burrows to the sea, guided by the light of the moon.",
            "length": "17168000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p07j5771.mp3"
        },
        {
            "title": "Planet Puffin. Episode 11 Leaving the Nest",
            "datePublished": "Mon, 15 Jul 2019 20:00:00 +0000",
            "description": "The season is ending. Becky Ripley and Emily Knight go in search of the last pufflings left in the burrows on the Isle of May to give them a quick check-up before the birds leave their family homes and head out to sea.",
            "length": "14528000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p07gyl84.mp3"
        },
        {
            "title": "Planet Puffin. Episode 10: Puffin Decoys",
            "datePublished": "Mon, 08 Jul 2019 20:00:00 +0000",
            "description": "How do you draw puffins to an island they abandoned long ago? Emily Knight and Rebecca Ripley are on Ramsey Island off the west coast of Wales. Here they're trying a very loud solution - blasting out the sound of puffins, from boom bass speakers.",
            "length": "7904000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p07gbpkl.mp3"
        },
        {
            "title": "Planet Puffin. Episode 9: Nuffin' Like a Puffin",
            "datePublished": "Sun, 07 Jul 2019 13:45:00 +0000",
            "description": "Emily Knight and Rebecca Ripley are taking a break from the island in this episode, If you think puffins are just small penguins, Warhorse author Sir Michael Morpurgo is here to tell you how wrong you are in this tale of how Puffin Books led him to love the birds.",
            "length": "6112000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p07gbpjy.mp3"
        },
        {
            "title": "Planet Puffin. Episode 8: The Plastic Problem",
            "datePublished": "Mon, 01 Jul 2019 09:39:00 +0000",
            "description": "Becky Ripley and Emily Knight find the Isle of May's beaches awash with plastic waste and discover its not just plastic we can see that is damaging, but tiny fragments shed from our clothes too.",
            "length": "17008000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p07fnkz9.mp3"
        },
        {
            "title": "Planet Puffin. Episode 7: Beyond Cuteness",
            "datePublished": "Mon, 01 Jul 2019 09:35:00 +0000",
            "description": "This week Emily and Becky take a break from the Isle of May. In their absence, award-winning author Adam Nicolson presents a rich, visual piece of writing that celebrates the real puffin that's there to be seen when you look past the looks.",
            "length": "5168000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p07fnkxq.mp3"
        },
        {
            "title": "Planet Puffin. Episode 6: Netting Puffins",
            "datePublished": "Mon, 01 Jul 2019 09:30:00 +0000",
            "description": "Becky Ripley and Emily Knight return to the Isle of May, where they string up a giant net to catch puffins as they fly past. When the fish in their beaks are sent flying, they go running to gather them up in the name of science.",
            "length": "10560000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p07fnkzs.mp3"
        },
        {
            "title": "Living World : My Living World : The UK's Rarest Frog",
            "datePublished": "Sun, 30 Jun 2019 10:28:00 +0000",
            "description": "New series in which Hannah Stitfall and a guest discuss one of her picks from the LIVING WORLD archive. Today they eavesdrop on an encounter at a secret location in Norfolk with the UK’s rarest frog, the pool frog. The frogs were introduced here from Sweden over a decade ago, after the last native East Anglian pool frogs died out in the wild and their progress has been carefully monitored. As well as the frogs there’s a very smelly encounter with a couple of grass snakes!",
            "length": "20688000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p07fns69.mp3"
        },
        {
            "title": "Living World : My Living World : Skomer",
            "datePublished": "Sun, 16 Jun 2019 10:24:00 +0000",
            "description": "New series. Wildlife film maker Hannah Stitfall and guest discuss one of her selections from the LIVING WORLD archive. Today the subject is Skomer Island off the coast of Wales and its city of sea birds, as well as the ‘clowns of the air’, an endemic vole and strange cries at night.",
            "length": "20688000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p07fns8d.mp3"
        },
        {
            "title": "Planet Puffin. Episode 5: Rough Seas and a Wreck",
            "datePublished": "Thu, 06 Jun 2019 15:29:00 +0000",
            "description": "High winds and choppy waters slow Emily Knight and Becky Ripley's return to the island, raising fears for some of the seabirds' chicks, and there's news of a mass puffin death in Alaska",
            "length": "10352000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p07cf6s5.mp3"
        },
        {
            "title": "Planet Puffin. Episode 4: The Seabirds' Sound Bath",
            "datePublished": "Thu, 06 Jun 2019 15:20:00 +0000",
            "description": "Becky Ripley and Emily Knight invite you to sink deep in sound as they present an immersive wildlife experience from master recordist Chris Watson",
            "length": "14736000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p07cf52r.mp3"
        },
        {
            "title": "Planet Puffin. Episode 3: Grovelling for Pufflings",
            "datePublished": "Thu, 23 May 2019 10:57:00 +0000",
            "description": "Becky and Emily find themselves deep in a game of puffin roulette, all in the name of science. They go grovelling underground into puffin burrows to count how many chicks have been laid in this year's breeding season and the pufflings' protective parents don't shy away from an attack.\n\nFollow the story via #PlanetPuffin",
            "length": "15984000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p07b37rq.mp3"
        },
        {
            "title": "Planet Puffin. Episode 2 The Puffins’ Return",
            "datePublished": "Wed, 15 May 2019 15:34:00 +0000",
            "description": "Emily Knight & Becky Ripley, from Blue Planet II: The Podcast, explore the Scottish puffin paradise where they’ll be following breeding season in #planetpuffin. In episode 2 the duo stake out in a hide on the Isle of May to monitor how many puffins have survived the cold winter months. Spring is here, and the breeding season is about to kick off.",
            "length": "21104000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p0799qq1.mp3"
        },
        {
            "title": "Planet Puffin. Episode 1 Island Life",
            "datePublished": "Wed, 15 May 2019 15:28:00 +0000",
            "description": "Emily Knight & Becky Ripley, from Blue Planet II: The Podcast, drop anchor at Scotland’s Ilse of May as the puffins return after a winter at sea and the year’s breeding season is getting under way. \n\nThey meet reserve manager Steely for a tour around the island’s three famous lighthouses and hear the ghastly story that could have put its first burning beacon of flames to rest.\n\nAnd a husband and wife who dedicated decades to studying puffins on the Isle of May reveal how much there’s left to discover about the mysterious life of the island’s puffins.\n\nAs they report through the summer, Emily and Becky would love to hear your puffin stories: #planetpuffin\n\nJoin them for a slice of island life, where stories of the past are met by the cries of seabirds.",
            "length": "16992000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p0799qrx.mp3"
        },
        {
            "title": "Welcome to Planet Puffin",
            "datePublished": "Wed, 15 May 2019 15:02:00 +0000",
            "description": "Follow the fortunes of a Scottish puffin colony across this year’s breeding season with Emily Knight & Becky Ripley, from Blue Planet II: The Podcast, in #planetpuffin",
            "length": "2288000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p0799jvs.mp3"
        },
        {
            "title": "Lindsey Chapman's Living World From the Archives - Cuddy's Duck",
            "datePublished": "Sun, 31 Mar 2019 09:00:00 +0000",
            "description": "The eider duck, known locally as \"Cuddy's\" duck, is regarded as the first bird in the world to have been given conservation protection, when St Cuthbert offered the eider duck sanctuary on the Farne Islands in the seventh century. Today, they breed in vast numbers off the Northumbrian coast, and Brett Westwood travels to Amble harbour to see the duck's colourful breeding plumage, and listen to the famous \"crooning\" calls of the males in the company of the RSPB's Paul Morrison and biologist Hilary Broker-Carey\n\nSince the programme was first broadcast the eider duck has been part of a discussion on Marine Conservation Zones. Wildlife presenter Lindsey Chapman revisits this Living World from 2002 before bringing the story up to date for today's audience.\n\nProducer Andrew Dawes",
            "length": "21392000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p074jgp0.mp3"
        },
        {
            "title": "Lindsey Chapman's Living World From the Archives - Hares",
            "datePublished": "Mon, 25 Mar 2019 13:00:00 +0000",
            "description": "We all know about the myth of the Mad March Hare, but what is the background to it? Is there any biological reason for the name? Lionel Kelleway meets Gill Turner, who has observed the behaviour of brown hares since the late 1990's to explore this question. Together, they marvel at the antics of the brown hare - one of the first signs of spring - on a very special farm in Hertfordshire. \n\nIn the years since the programme was first broadcast, the situation of brown hares has changed considerably. Wildlife presenter Lindsey Chapman revisits this Living World from 2011 before bringing the story gently up to date for today's listener.\n\nProducer Andrew Dawes",
            "length": "21664000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p074jhfx.mp3"
        },
        {
            "title": "Lindsey Chapman's Living World From the Archives - Hares",
            "datePublished": "Mon, 25 Mar 2019 12:35:00 +0000",
            "description": "We all know about the myth of the Mad March Hare, but what is the background to it? Is there any biological reason for the name? Lionel Kelleway meets Gill Turner, who has observed the behaviour of brown hares since the late 1990's to explore this question. Together, they marvel at the antics of the brown hare - one of the first signs of spring - on a very special farm in Hertfordshire. \n\nIn the years since the programme was first broadcast, the situation of brown hares has changed considerably. Wildlife presenter Lindsey Chapman revisits this Living World from 2011 before bringing the story gently up to date for today's listener.\n\nProducer Andrew Dawes",
            "length": "21664000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p074jgqn.mp3"
        },
        {
            "title": "Lindsey Chapman's Living World From the Archives - Bobby Tulloch",
            "datePublished": "Thu, 21 Mar 2019 11:12:00 +0000",
            "description": "In the 50 years of Living World has traveled across almost every corner of the British Isles, sometimes it is a contributor rather than the wildlife which attracts attention. In this Living World from 1974 Peter France headed up to Shetland to meet the late Bobby Tulloch, who was then working for the RSPB. When Living World visited the arrival of the Shetland Oil industry was just in its planning stage and so this unique archive programme provides a glimpse back to those days. Bobby Tulloch himself rose to fame a few years before Living World visited as the finder of a snowy owl nest of Fetlar, the first ever substantiated record in Britain. In this programme Bobby takes Peter to the snowy owl site, along the way exploring some of the other wildlife in this 'Land of the Simmer Dim'\n\nIn the decades since this episode was first broadcast, Shetland's wildlife has changed and adapted. Today there is a museum containing Bobby Tulloch's archive, The Old Haa Museum and Visitor Centre on the island of Yell. Wildlife presenter Lindsey Chapman revisit this Living World and gently update the story for today's audience. \n\nProducer Andrew Dawes",
            "length": "21456000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p0745zw2.mp3"
        },
        {
            "title": "Lindsey Chapman's Living World From the Archives - Stoats",
            "datePublished": "Mon, 11 Mar 2019 17:39:00 +0000",
            "description": "One of our most engaging mustelids, the stoat is the subject of this Living World from 2003. Normally stoats are more often only seen in open countryside dashing across open ground and out of sight. Yet in North Yorkshire stoats have made their home closer to humans, within the ruins of Mount Grace Priory near Osmotherley. To find out more Lionel Kelleway headed to Europe's best preserved Carthusian Priory where in the company of stoat expert Robbie MacDonald, and Priory custodian Becky Wright they head off to find out more and in the course of their visit explain some of the fascinating and unique stoat biology and behaviour.\n\nIn the years since this episode was first broadcast, our knowledge of these engaging mustelids has developed, allowing wildlife presenter Lindsey Chapman to revisit this Living World and gently update the story for today's audience.\n\nProducer Andrew Dawes",
            "length": "21504000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p0736x5z.mp3"
        },
        {
            "title": "Lindsay Chapman's Living World from the Archives - The Green Isle",
            "datePublished": "Sun, 03 Mar 2019 11:00:00 +0000",
            "description": "The Island of Islay is probably best known for the production of fine peaty whiskies. Yet each winter thousands of geese and other northern birds find refuge on this Scottish island. It also has Britain's most thriving colony our rarest corvid the choughs. In 1987 Michael Scott headed over to Islay for Living World to see for himself why this island attracts more than its fair share of birds. Here he joined Dave Dick and Peter Moore from the RSPB.\n\nIn the 30 years since the programme was first broadcast, there have been many changes on Islay which allows wildlife presenter Lindsey Chapman to revisit this Living World and gently update the story for today's audience.\n\nProducer Andrew Dawes",
            "length": "21424000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p0726c82.mp3"
        },
        {
            "title": "Lindsey Chapman's Living World From the Archives - Wild Boar",
            "datePublished": "Sun, 30 Dec 2018 09:00:00 +0000",
            "description": "The wild boar has had a checkered history in the British countryside. This once native species was hunted out of existence in the 13th Century and despite a number of reintroductions finally disappeared from our fauna in the 17th Century. And for the next 300 years the sound of boar, the onomatopoeia collective term for boar is , sound, lay silent across the landscape. Until around 20 years ago, when wild boar once again roamed some areas of the British countryside. But how did they get there?  To find out more, in this Living World, Lionel Kelleway heads to the Forest of Dean in Gloucestershire on the trail of this shy and evasive animal, which although now firmly re-established in the British landscape is surprisingly hard to track down. Lionel enlists the help of boar expert, Dr Martin Goulding and after a day in the woods, the result was a surprise to both of them.\n\nIn the decade since the programme was first broadcast, the situation of wild boar has of course changed. Wildlife presenter Lindsey Chapman revisits this Living World from 2007 before bringing the story up to date for today's audience.\n\nProducer Andrew Dawes",
            "length": "21504000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p06tw3gp.mp3"
        },
        {
            "title": "Lindsey Chapman's Living World From the Archives - Winter Ravens",
            "datePublished": "Sun, 23 Dec 2018 09:00:00 +0000",
            "description": "The raven is both agile and majestic in flight but shrouded in mystery, superstition and folk law. How was it that our biggest member of the crow family, a bird once protected as an important scavenger in ancient times, was then persecuted almost to extinction in the British Isles, with less that 1000 pairs clinging onto a precarious future in few remote hills in upland Britain? In this Living World from 2010, Lionel Kelleway travels to the syperstones in Shropshire where thankfully the raven is making a remarkable comeback. Here he meets up with Leo Smith and Tom Wall from the Shropshire Raven Study Group, a group who have been studying these magnificent birds for nearly 20 years. As they walk to an old raven nest in wet woodland, they encounter many ravens on the wing. But the tide has turned and now Shropshire is home to a remarkable wildlife spectacle, a raven roost in a private woodland where Lionel is chorused by over 60 ravens wheeling and displaying in the gathering dusk. \n\nSince the programme was broadcast, the Shropshire Raven Study group has completed it's work. In this revised episode wildlife presenter Lindsey Chapman updates the listener with this corvid success story. \n\nProduced by Andrew Dawes",
            "length": "21584000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p06tw3kr.mp3"
        },
        {
            "title": "Lindsey Chapman's Living World From the Archives - Caledonian Pine forest",
            "datePublished": "Sun, 16 Dec 2018 09:00:00 +0000",
            "description": "Standing next to a tree which was likely a sapling when wolves roamed freely in Scotland is a humbling experience. And so it was that Lionel Kelleway began this Living world from 2002. Joining Lionel next to a venerable 'granny tree' is renowned naturalist Roy Dennis MBE who explains that today just 1% of the original 1.5 million hectares survives. Unraveling the complexities of what happened to this huge tract of the Caledonian Forest which the Romans called 'silva caledonia' is revealed as the duo trudge across the landscape looking for ecological clues and to revel in the abundant wildlife that still thrives here, from pine marten to Scottish crossbill.\n\nBut what of the future? To bring the story up to date since this programme was first broadcast in 2002, wildlife presenter Lindsey Chapman refreshes the story for today's audience, including some ambitious plans to rewild the area once more.\n\nProducer Andrew Dawes",
            "length": "21504000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p06tw3hh.mp3"
        },
        {
            "title": "Lindsey Chapman's Living World From the Archives - Avocet",
            "datePublished": "Sun, 09 Dec 2018 09:00:00 +0000",
            "description": "As the logo of the RSPB, the slender black and white avocet is a familiar bird in winter on the river Exe in Devon, but not in the summer. By the mid Victorian era the avocet had all but stopped breeding in Britain and it was not until 1947 that the first avocet bred again in Suffolk. Since then the breeding population has increased dramatically with over 1000 breeding pairs as their range has expanded out of the South East corner of Britain. To discover more in this episode from 2001, Lionel Kelleway heads off to the Exe on a winters day, where he joins Malcolm Davies from the RSPB. Beginning at low tide, Lionel and Malcom discuss what has happened to avocet numbers since their return as a breeding species although they do not breed in the South West. but in winter avocet arriving from the Continent can swell numbers towards 7000.\n\nMuch has changed since the programme was first broadcast, therefore in this revised episode, wildlife presenter Lindsey Chapman revisits this Living World from 2001, bringing the story up to date for today's audience. \n\nProducer Andrew Dawes",
            "length": "21472000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p06tw2l9.mp3"
        },
        {
            "title": "Lindsey Chapman's Living World From the Archives - Dungeness",
            "datePublished": "Sun, 21 Oct 2018 08:00:00 +0000",
            "description": "The shifting shingle world of Dungeness is a remarkable place. There are four internationally important shingle peninsulas in the world. Two in Germany, one in America, (Cape Canaveral) and yes you've guessed it, Dungeness in Kent. The unique landscape of Dungeness has been studied since Medieval times giving scientists such as Erica Towner and David Harper from Sussex University a wealth of historical data to work from. \n\nWhich is why Peter France joined Erica and David on a timeline walk from the sea edge to dry land in this Living World. Along the way, Peter discovers shingle is a very underrated habitat and far from being like a desert the area is teeming with life. Dungeness has also the RSPB's oldest nature reserve created in 1932 from land bought in 1930 on Denge Beach. As part of their journey the trio look at the nuclear power stations on Dungeness, which were built on good former shingle sites of Special Scientific Interest. That destroyed the shingle but on the positive side, the power stations provide cliff habitat for redstarts and rare lichens, and their warm discharge water provides feeding areas for birds. As can be imagined on a shingle headland, tree cover is limited, though visiting ancient holly bushes on Ministry of Defence land usually not open to the public provides a startling glimpse into the past.\n\nLindsey Chapman revisits this edited Living World from 1990 to gently bring the story of Dungerness and it's wildlife up to date with a unique wildlife project.",
            "length": "21872000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p06k61f9.mp3"
        },
        {
            "title": "Lindsey Chapman's Living World From the Archives - The Oak Tree Planters",
            "datePublished": "Sun, 14 Oct 2018 08:00:00 +0000",
            "description": "The jay is one of Britain’s most colourful birds. A kaleidoscope of fawns, pinks, greys, black and white, alongside striking blue wing patches which, if you’re lucky enough to get close to see, alter in graduated shades of blue and prove unmistakable in a discarded feather. Colourful they may be, for many of us though the normal view of a jay is as it disappears into woodland raucously screeching and alerting us to its presence. In autumn however, jays have other things on their mind, like collecting acorns for the winter larder. And it was in autumn at the time of peak activity that finds Brett Westwood heading to the Wyre Forest to watch the bird nicknamed the \"colourful crow\". Joining Brett is ornithologist John Tulley who explains that jays have excellent memories and will return to most of the acorns they bury - but not all - making them a key species when it comes to the rejuvenation of Britain's forests. even uphill.\n\n\n\nLindsey Chapman hosts this revised Living World from 2004 by gently bringing the story up to date for today's listener.",
            "length": "21744000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p06k61bs.mp3"
        },
        {
            "title": "Lindsey Chapman's Living World From the Archives - Underwater Architects",
            "datePublished": "Sun, 07 Oct 2018 08:00:00 +0000",
            "description": "Today’s fashion for self-built homes may have started a few decades ago, but for nearly 200 million years, a family of insects have been quietly developing their own, des res. Depending on where you come from, they are sometimes known as ‘straw worms’, or ‘case worms’, but for most they are simply called ‘caddis’. The origin of the word \"caddis\" is unclear, but it seems to date back as far as Izaak Walton's 1653 book The Complete Angler, where the angling hero notes how to fish for roach or dace using \"case-worms or cadis\" as bait. \n\n\n\nThere are almost 200 species of caddisfly in the UK, the largest of which is more than 3cm long. In this episode of Living World, Lionel Kelleway hopes to find just a few of this number when he is joined on Lake Windermere by caddisfly expert Ian Wallace, who attempts to guide Lionel through these curious pond, lake and river dwelling insects. Along the way they discover some of the intricate biology which leads to the creation of their self built homes, a process that has even been adopted by jewelry designers in recent years. \n\n\n\nLindsey Chapman hosts this revised Living World from 2007 and gently brings the story up to date for today's audience.",
            "length": "21952000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p06k616r.mp3"
        },
        {
            "title": "Lindsey Chapman's Living World From the Archives - The World's Largest Slug",
            "datePublished": "Sun, 30 Sep 2018 08:00:00 +0000",
            "description": "In this episode, Lindsey Chapman will bring this story up to date since this episode was first broadcast in 2008, offering some up to date thoughts on all things molluscan.\n\n\n\nIt is not often on the Living World that the largest or biggest of any species is discovered. Yet in this episode Lionel Kelleway is in search of a large slimy creature. Though locally common across Britain's ancient woodlands, this slug is very much at home in the warm damp woodlands of Dartmoor and is the world’s largest ground slug, the “Ash-Black” slug. This mollusc is known to reach up to a length of 25 to 30 centimetres. Lurking under the bark of dead trees during the day, at night they slip obsequiously into the open looking for fungi of all kinds to eat. Guiding Lionel is renowned Dartmoor, naturalist John Walters who explains these large slugs are quite easy to identify by their characteristic dark edged sole, with a pale, ash coloured stripe running through the middle. Their presence is an important part of the ecosystems that keep ancient woodland alive. As if encountering this leviathan was not enough, the duo also stumble across Britain's largest ground beetle, Carabus intricatus.",
            "length": "21920000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p06k6145.mp3"
        },
        {
            "title": "Lindsey Chapman's Living World From the Archives - Hen Harrier",
            "datePublished": "Sun, 23 Sep 2018 08:00:00 +0000",
            "description": "Ghosts of the Moor are how the pale grey male hen harrier is sometimes referred to as it glides seemingly without effort across an upland landscape. To find out more and to revel in actually seeing a hen harrier on the wing, in this episode Brett Westwood & lolo Williams are on the Berwyn Moors in Wales in search of this enigmatic bird of prey. lolo has brought Brett to this particular spot as since seeing his first hen harrier here as a young boy, lolo has returned every year to study their ecology and biology. As the duo watch harriers on the moor, lolo expands his understanding of how harriers utilise this unique man made habitat, especially in early spring when the males perform their spectacular \"sky dances\" to attract the female. Not everyone is as pleased to have hen harriers on their moorland so discussion falls to how rare in England & Scotland they are due to loss of habitat to conifer plantations or sheep, as well as conflict on grouse moors.\n\n\n\nIn this episode, Lindsey Chapman will bring this story up to date since the episode was first broadcast, offering some recent updates into one of our most enigmatic raptors..",
            "length": "21888000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p06k6130.mp3"
        },
        {
            "title": "Lindsey Chapman's Living World From the Archives - Blackbirds",
            "datePublished": "Sun, 01 Jul 2018 08:00:00 +0000",
            "description": "Possibly our most familiar songster,a blackbird singing high up on a rooftop is one of the real pleasures of living cheek by jowl with the natural world. These woodland edge members of the thrush family have over centuries become a garden specialist, enriching a morning walk or evening spent after work listening to the mellifluous tunes of the male blackbird. For this Living World nature presenter Lindsey Chapman relives the magic Lionel Kelleway discovered in the Hopetoun Estate near Edinburgh in Scotland.\n\n\n\nBeginning early in the morning, Lionel meets up with Will Cresswell a behavioural ecologist and discuss what is going on by this competitive singing between male blackbirds. In spring through to early summer, blackbirds can sing throughout the day and, which is not common in song birds, sing into the night. This energy sapping process is to proclaim their territorial rights to any other birds attempting to move in. Of course the song is only the beginning of the fascinating process of the breeding cycle and the creation of next generation of blackbirds. Along the way to unpick this story Lionel and Will look for evidence of nests to discuss breeding success, the risk the eggs and chicks face from predation, and why territories are important.\n\n\n\nIn this episode, Lindsey Chapman will bring this story up to date since this programme was first broadcast, offering some recent updates into one of our most familiar and recognisable birds.",
            "length": "21824000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p06b64xz.mp3"
        },
        {
            "title": "Lindsey Chapman's Living World From the Archives - Woolston Eyes",
            "datePublished": "Sun, 24 Jun 2018 08:00:00 +0000",
            "description": "Often we think of nature reserves are a product of preserving pristine or unique habitat for wildlife. Yet many nature reserves are products of reclaiming man made activity and letting nature take its course, with a little help. For this Living World wildlife presenter Lindsey Chapman relives the magic of a once industrial landscape which Lionel Kelleway explored in 2000.\n\n\n\nLionel visits Woolston Eyes nature reserve near to Warrington where he meets up with Brian Martin who at the time of recording had been at the reserve for over 20 years recording the wildlife. This reserve is owned by the Manchester Ship Canal company and for years was used as a site to deposit dredging’s from the canal. Over the decades as Lionel discovered the site became a hotch potch of heaps and shallow areas which since 1980 when the site began the long process of conversion from the devastation of canal spoil into a wildlife haven, yet only a stone’s throw from the Warrington urban area. \n\n\n\nAlong the way Lionel discovers some of the species which had moved in to make this their home, such sedge warbler and black necked grebe which the site has become an important breeding area for. In summer many butterflies, moths, other insects can be found, including dragonflies making use of the lagoon ponds which have been created on site.\n\n\n\nTo bring this story up to date since this programme was first broadcast; Lindsey Chapman offers some recent updates into the denizens of Woolston Eyes",
            "length": "21824000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p06b64z3.mp3"
        },
        {
            "title": "Chris Packham celebrates Tweet of the Day",
            "datePublished": "Sun, 17 Jun 2018 09:00:00 +0000",
            "description": "The thought of spring without Springwatch on the BBC would be unthinkable, and Springwatch without it's erudite host Chris Packham likewise. Chris has also been a long time supporter of another BBC institution on Radio 4, Tweet of the Day, first presenting this series in 2013. What better then than for Chris to record especially for Tweet of the Day, a loose tie in with Springwatch, celebrating the birds that may be seen in Sherborne while the team were on air. But in this episode Chris also answers some more searching questions, such as who from the world of natural history would he invite to dinner, with a surprising answer.\n\n\n\nYou can hear Chris's episodes on the Radio 4 website along with a lot more thoughts of all things avian via the Tweet of the Week pages.",
            "length": "13520000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p06b68dd.mp3"
        },
        {
            "title": "Lindsey Chapman's Living World From the Archives - Catch the Pigeon",
            "datePublished": "Sun, 17 Jun 2018 08:00:00 +0000",
            "description": "The humble pigeon is an often overlooked bird. We pass by it often without a second glance as we rush along our busy city streets, but if we stop and wonder, how does the pigeon know where it is and how does it get from A to B?\n\n\n\nThis episode from 2008 finds Lionel Kelleway discovering the biology behind pigeon migration with Oxford University's Chris Armstrong. Starting their recording at the University's Wytham Field Station Lionel meets some of the pigeons used in the study which far from being small-brained birds show they have a wide array of navigational tools at their disposal...a magnetic sense...a sun compass...a keen sense of smell. By attaching miniature GPS loggers to pigeon's backs Chris hopes to find out how they navigate home, however as Lionel finds out for himself, many aspects of a birds amazing navigational ability is still to be unravelled. \n\n\n\nSo what has happened in the last 10 years since the programme aired? Lindsey Chapman brings the story up to date by offering some recent discoveries into this fascinating research into bird migration.",
            "length": "21680000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p06b60jl.mp3"
        },
        {
            "title": "Living World From the Archives - The Machair Of The Western Isles",
            "datePublished": "Sun, 10 Jun 2018 08:00:00 +0000",
            "description": "The machair is a unique coastal grassland, rich in wildflowers, that form one of the rarest habitats in Europe, and for this Living World wildlife presenter Lindsay Chapman relives the magic of this man made but fragile landscape which Brett Westwood experienced on this visit to South Harris in 2004.\n\n\n\nBrett meets up with Martin Scott from the RSPB who guides him across this sea washed habitat to discuss the special nature of botanically rich grasslands. This grassland is a result of many centuries of grazing by farm animals through the crofting system, the programme unearth how that grazing benefits not only the wild flowers, but the birdlife too. Along the way Brett discovers wonderful flora such as meadowsweet, silverweed and knapweed. But on a cold wet day their quest to find the great yellow bumblebee does prove problematic. This habitat is unique to western and northern Scotland and today faces considerable threats, from changes in the traditional crofting system to the introduction of hedgehogs and mink which can affect ground nesting birds making their home in the Machair, and controversial projects to remove them.\n\n\n\nTo bring this story up to date since this programme was first broadcast, Lindsey Chapman offers some recent updates into the magical world of the Machair.",
            "length": "21872000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p068w26y.mp3"
        },
        {
            "title": "Living World from the Archives - Celtic Rainforest",
            "datePublished": "Sun, 25 Mar 2018 09:00:00 +0000",
            "description": "High in the hills of the Snowdonia National Park in Wales, can be found a rare and fascinating habitat. We all know of the importance of the Tropical Rainforests, however these Celtic Rainforests are in a way even rarer, with Britain being home to most of the best preserved examples in the World. The Valley is changing and time could possibly be running out for these remarkable and sensitive habitats, which have been suffering from pollution and climate change since the dawn of the Industrial Age. \n\n\n\nBrett Westwood relives programmes from The Living World archives, this episode from 2011. Wales is home to a remarkable and rare forest. Paul Evans joins Ray Woods from Plantlife Cymru in Snowdonia.\n\n\n\nIn an area where 200 days of rain each year is normal, Paul and Ray don their waterproofs and venture up the valley of the Rhaeadr Ddu, the Black Waterfall. The landscape in this valley is dominated by water, not only from the exceptional rainfall this area is known for, but from the river thundering along many rapids and waterfalls providing a constant mist of high humidity within the Atlantic wood enveloping the valley. Linked to a mild climate in this part of Wales, everything in the woodland is a carpeted in a magical sea of emerald green moss, fungi and lichen. \n\n\n\nThis valley is home to some rare and exotic plants, the filmy ferns are however special in this landscape. Ray and Paul eventually make it to the side of the huge Rhaeadr Ddu waterfall itself, where, as the roar of the water almost drowns their voices, there on a single rocky outcrop, bathed in constant spray they discover the rare, minute and exotically beautiful Tunbridge Filmy-fern. Nearby a Wilson's Filmy-fern is found on a single boulder of an ancient moss encrusted dry stone wall. How did this Filmy-fern get here is a point of discussion.",
            "length": "21120000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p05yf7pz.mp3"
        },
        {
            "title": "Living World from the Archives - The Celtic Rainforest",
            "datePublished": "Sun, 25 Mar 2018 09:00:00 +0000",
            "description": "High in the hills of the Snowdonia National Park in Wales, can be found a rare and fascinating habitat. We all know of the importance of the Tropical Rainforests, however these Celtic Rainforests are in a way even rarer, with Britain being home to most of the best preserved examples in the World. The Valley is changing and time could possibly be running out for these remarkable and sensitive habitats, which have been suffering from pollution and climate change since the dawn of the Industrial Age. \n\n\n\nBrett Westwood relives programmes from The Living World archives, this episode from 2011. Wales is home to a remarkable and rare forest. Paul Evans joins Ray Woods from Plantlife Cymru in Snowdonia.\n\n\n\nIn an area where 200 days of rain each year is normal, Paul and Ray don their waterproofs and venture up the valley of the Rhaeadr Ddu, the Black Waterfall. The landscape in this valley is dominated by water, not only from the exceptional rainfall this area is known for, but from the river thundering along many rapids and waterfalls providing a constant mist of high humidity within the Atlantic wood enveloping the valley. Linked to a mild climate in this part of Wales, everything in the woodland is a carpeted in a magical sea of emerald green moss, fungi and lichen. \n\n\n\nThis valley is home to some rare and exotic plants, the filmy ferns are however special in this landscape. Ray and Paul eventually make it to the side of the huge Rhaeadr Ddu waterfall itself, where, as the roar of the water almost drowns their voices, there on a single rocky outcrop, bathed in constant spray they discover the rare, minute and exotically beautiful Tunbridge Filmy-fern. Nearby a Wilson's Filmy-fern is found on a single boulder of an ancient moss encrusted dry stone wall. How did this Filmy-fern get here is a point of discussion.",
            "length": "21120000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p060lz66.mp3"
        },
        {
            "title": "Living World from the Archives - Essex Geese",
            "datePublished": "Sun, 18 Mar 2018 10:00:00 +0000",
            "description": "Around 100,000 dark bellied brent geese head to Britain every winter to escape the extreme cold weather of their arctic breeding grounds in Russia. Britain is therefore an important wintering ground for these geese with many thousands heading to the Essex Marshes. But what brings them here and what are the management needs of this populated area of the South East coastal? \n\n\n\nTo find out for himself, as Brett Westwood introduces in this Living World episode first broadcast in 2005, Peter France heads over to the Essex coastline in the company of ecologist Graeme Underwood from Essex University and Chris Tyas from the RSPB. Overlooking the wide marginal landscape wedged between the sea and the land they discuss mudflats and difference between marine and freshwater marshes. An ever changing landscape that requires specific management with all the challenges of creating the best habitat for all plants and animals here, including the thousands of dark bellied brent geese, in front of them.",
            "length": "20976000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p05yf7rb.mp3"
        },
        {
            "title": "Living World from the Archives - Essex Geese",
            "datePublished": "Sun, 18 Mar 2018 10:00:00 +0000",
            "description": "Around 100,000 dark bellied brent geese head to Britain every winter to escape the extreme cold weather of their arctic breeding grounds in Russia. Britain is therefore an important wintering ground for these geese with many thousands heading to the Essex Marshes. But what brings them here and what are the management needs of this populated area of the South East coastal? \n\n\n\nTo find out for himself, as Brett Westwood introduces in this Living World episode first broadcast in 2005, Peter France heads over to the Essex coastline in the company of ecologist Graeme Underwood from Essex University and Chris Tyas from the RSPB. Overlooking the wide marginal landscape wedged between the sea and the land they discuss mudflats and difference between marine and freshwater marshes. An ever changing landscape that requires specific management with all the challenges of creating the best habitat for all plants and animals here, including the thousands of dark bellied brent geese, in front of them.",
            "length": "20976000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p060lzcj.mp3"
        },
        {
            "title": "Living World from the Archives - A Starling Eruption",
            "datePublished": "Sun, 11 Mar 2018 10:00:00 +0000",
            "description": "The famous evening murmuration, fantastic formations of huge flocks of starlings coming in to roost, brings hundreds of visitors to the levels each winter. But far fewer people see the spectacle of the dawn eruption when the starlings take off en masse to start their day foraging in the surrounding fields. \n\n\n\nBrett Westwood relives programmes from The Living World archives. This episode from 2014 sees Trai Anfield immerses herself in a starling spectacle many people have never seen. Each year the reedbeds of the Somerset Levels become the winter home for hundreds of thousands of starlings. Making their way from across the UK and Europe these birds have found a safe haven to roost with plenty of food nearby. Simon Clarke of Natural England talks Trai Anfield through the spectacle on Shapwick Heath. When it is all over and three quarters of a million starlings have departed for the day, thoughts turn to the reedbed and the effect the presence of so many birds has on their winter roost site and the animals they share it with.",
            "length": "21088000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p05yf7wh.mp3"
        },
        {
            "title": "Living World from the Archives - A Starling Eruption",
            "datePublished": "Sun, 11 Mar 2018 10:00:00 +0000",
            "description": "The famous evening murmuration, fantastic formations of huge flocks of starlings coming in to roost, brings hundreds of visitors to the levels each winter. But far fewer people see the spectacle of the dawn eruption when the starlings take off en masse to start their day foraging in the surrounding fields. \n\n\n\nBrett Westwood relives programmes from The Living World archives. This episode from 2014 sees Trai Anfield immerses herself in a starling spectacle many people have never seen. Each year the reedbeds of the Somerset Levels become the winter home for hundreds of thousands of starlings. Making their way from across the UK and Europe these birds have found a safe haven to roost with plenty of food nearby. Simon Clarke of Natural England talks Trai Anfield through the spectacle on Shapwick Heath. When it is all over and three quarters of a million starlings have departed for the day, thoughts turn to the reedbed and the effect the presence of so many birds has on their winter roost site and the animals they share it with.",
            "length": "21088000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p060lzfy.mp3"
        },
        {
            "title": "Living World from the Archives - Snowdrops",
            "datePublished": "Sun, 04 Mar 2018 10:00:00 +0000",
            "description": "There are 19 species of the wild snowdrop in the world, all in the genus Galanthus. Wild snowdrops are found across much of Europe from Spain to the Caucasus , with Turkey being a hot spot for these 'milk flowers', but they are not found in Britain. What we think of as British wild snowdrops which herald the beginning of spring, are an introduced species or escapees from garden collections. Over the centuries gardeners have selected over 1000 distinct cultivars and that number is increasing every year. And so it takes a certain special kind of person to become a galanthophile, or a lover of snowdrops.\n\n\n\nBrett Westwood relives programmes from the Living World archives and in this episode from 2004 Brett himself travels to Somerset to explore the fascinating world of snowdrops with one such galanthophile Christine Skelmesdale. They start by discussing the snowdrop cultivars in Christine's garden before moving on to 'Snowdrop Valley' (or the more correctly called Avill Valley) on Exmoor. Christine explains the origins of UK snowdrops as imports from abroad, and that far from being native, snowdrops are a naturalised alien, though wonderful, plant.",
            "length": "21088000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p05yf7rv.mp3"
        },
        {
            "title": "Living World from the Archives - Mountain Hares",
            "datePublished": "Sun, 07 Jan 2018 09:00:00 +0000",
            "description": "The Mountain Hare, sometimes called the Arctic or Blue Hare, is a native of Scotland but to most people's surprise a colony also live in England. \n\n\n\nBrett Westwood relives programmes from The Living World archives. This episode from 2005 Sarah Pitt heads into a wintry Peak District with the late Derek Yaldon in search of mountain hares, one of the great relics of the ice age. Nestled into the hills and as white as white during the winter these animals are very at home straddling the Pennine Way. But how did they get here? To discover this Sarah Pitt is led by zoologist Derek Yalden deep into wintry moors to find these animals, and much to his surprise is given a special device by Sarah to enable him to see the hares at night, something he's never done before. So a double surprise. Hares by day and hares by night. It certainly seems from Sarah and Derek's encounter that the night time is the right time for Mountain Hares.",
            "length": "20928000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p05rmkv1.mp3"
        },
        {
            "title": "Living World from the Archives - Winter Ponds",
            "datePublished": "Sun, 31 Dec 2017 09:00:00 +0000",
            "description": "Brett Westwood relives programmes from the Living World archives. This episode from 2012 sees Miranda Krestovnikoff with Jeremy Biggs then from Pond Conservation (now known as Freshwater Habitats Trust) for a special Living world devoted to the ponds of the New Forest. \n\n\n\nJeremy has chosen these as some of the finest of their type because they are keep open by grazing ponies and deer, don't suffer from pollution from roads or agricultural run-off , and are some of the cleanest ponds in the United Kingdom. When they go pond-dipping , kneeling in muddy water in chest-waders, he proves it by finding some of our rarest plants and animals including the mud snail which thrives in shallow pools whose margins dry out in summer . Damselfly larvae prowl among the plants and there are even newts active in January , animals which have grown too slowly in the previous summer and are spending the winter as youngsters. Best of all, in the shallows of the pond are clumps of the year's first frogspawn, in mid -January. \n\n\n\nThis pond contains water all year round, but temporary ponds are a speciality of the New Forest. At Burley, Jeremy shows Miranda a roadside pool which fills with water in winter but is a grassy hollow in summer. Here they dip for one of Britain's rarest animals , the delicate fairy shrimp which can only survive in pools which dry out. These beautiful creatures are some of the oldest living animals on the planet, virtually unchanged in appearance from their ancestors 400 million years ago. Their eggs can survive in soil until the rains fill their ponds again in autumn and a new generation hatches to swim safe from fishes in the New Forest's temporary ponds.",
            "length": "21184000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p05rmkzz.mp3"
        },
        {
            "title": "Living World from the Archives - Ancient Holly",
            "datePublished": "Sun, 24 Dec 2017 09:00:00 +0000",
            "description": "Brett Westwood relives programmes from the Living World archives. In this episode from 2011 Joanna Pinnock travels up to the Stiperstone Hills of Shropshire where she meets up with Sara Bellis and Carl Pickup from the Shropshire Wildlife Trust at a remarkable site, The Hollies. \n\n\n\nHere high up on the windswept hills, Joanna encounters ancient holly trees, which could be as old as 400 years. Holly, naturally an understory tree of more developed woodland, is not suited to grow up here in the cold windy conditions. But how and why these trees came to be here is something of a mystery. It is thought these holly trees are a living link to a past age in this landscape, where lead mining was once common and over 2 centuries ago there were thousands of people eking a subsistence living up here. Possibly the hollies we seen now, gnarled and twisted though they are, are all that remains of a woodland which at one time covered all the hills around here. That woodland was subsequently cleared for whatever reason, leaving the holly trees as a valuable source of winter fodder. With the altitude and animal grazing on the hills these days, young holly cannot regenerate, so this landscape is one of preservation not conservation.\n\n\n\nBut the story ends with a surprise, the cuckoo trees up here. Sometimes known as bonded trees, here Joanna witnesses the growing of full height rowan trees, inside the trunks of older holly trees. How did the rowan trees get there, well, it all has something to do with winter thrushes, as is revealed in the programme.",
            "length": "21056000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p05rmky3.mp3"
        },
        {
            "title": "Living World from the Archives - Godwits",
            "datePublished": "Sun, 17 Dec 2017 09:00:00 +0000",
            "description": "Black-tailed godwits are an elegant long legged bird about the size of a pigeon. In the summer they are found in the arctic where the Icelandic race of this species then migrates to Britain to spend the winter in relatively warmer weather. For this week's Living World Brett Westwood relives programmes from the Living World archives with an episode from 2013 which sees Chris Sperring visit a private estate in Hampshire where 2000 black tailed godwit visit their flooded water meadows along the River Avon in winter. Here Chris is guided by Pete Potts from Operation Godwit.",
            "length": "21120000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p05r7r3p.mp3"
        },
        {
            "title": "Living World from the Archives - Sika Deer",
            "datePublished": "Sun, 22 Oct 2017 08:00:00 +0000",
            "description": "Brett Westwood relives programmes from 50 years of the Living World archives. In this episode from 2009, Lionel Kelleway is in Dorset with Dr Anita Diaz from Bournemouth University, for the sika deer rut.\n\n\n\nLionel heads to Purbeck in Dorset with Dr Anita Diaz to experience the sights and unusual sounds of sika at the start of the rutting season. Sika Deer are aliens to the UK but now are well established as part of the British landscape, though Purbeck has one of the larger concentrations. As the night draws in, the sika come off the salt marsh around Poole Harbour to graze the grasslands of Purbeck. This being the rutting season, the sika are noisily proclaiming their status, with a call once described as a mournful whale song across the English countryside.",
            "length": "21104000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p05fjbg2.mp3"
        },
        {
            "title": "Living World from the Archives - Mellow Fruitfulness",
            "datePublished": "Sun, 15 Oct 2017 08:00:00 +0000",
            "description": "Brett Westwood relives programmes from 50 years of the Living World archives. In this episode from 1988 Peter France is on the South Downs with ecologist David Streeter.\n\n\n\nHips haws and honeysuckle berries enliven the hedgerows. On the ground toadstools appear as if by magic and acorns rain from above - all to ensure future generations of their kind. David Streeter and Peter France sample the fruits of autumn while delving into the many evolutionary mechanisms plants employ to move the next generation across the landscape, with a little help of course.",
            "length": "20976000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p05fjbbr.mp3"
        },
        {
            "title": "Living World from the Archives - The Late Arrivals",
            "datePublished": "Sun, 08 Oct 2017 08:00:00 +0000",
            "description": "Brett Westwood relives programmes from the Living World archives, this week an episode from 2008. \n\n\n\nMore familiar in our gardens and parks, the red admiral butterfly is found throughout the British Isles and is one of the highlights of the butterfly season. It is an unmistakable butterfly with its black wings, and striking red bands. But how do they get here? \n\n\n\nWell for this Living World, Lionel Kelleway travels to Lulworth Cove in Dorset where, standing on the cliffs and fully expecting to be looking out for autumnal bird migration, instead he witnesses the small bands of Red Admiral butterflies flying in from the sea as they migrate from mainland Europe. With Lionel is Richard Fox from Butterfly Conservation, who explains what's happening.",
            "length": "20944000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p05fjbdj.mp3"
        },
        {
            "title": "Living World from the Archives - Hamsterley Forest",
            "datePublished": "Sun, 01 Oct 2017 08:00:00 +0000",
            "description": "Brett Westwood relives programmes from The Living World archives. In this episode from 1991 Michael Scott travels to Country Durham where in Hamsterley Forest he meets botanist David Bellamy and Ranger Brian Walker on a tour of the area. \n\n\n\nA combination of careful management and a degree of good luck have turned Hamsterley Forest, Co Durham, into a haven for wildlife. Along with almost 100 different varieties of tree, ferns, and other fascinating plants, the wood pasture and meadows provide ideal habitats for birds like the crossbill, siskin, curlew and nightjar.",
            "length": "21088000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p05fjb8g.mp3"
        },
        {
            "title": "Living World from the Archives - Waxcap Grasslands",
            "datePublished": "Sun, 24 Sep 2017 08:00:00 +0000",
            "description": "Brett Westwood relives programmes from the Living World archives. In this 2011 episode Paul Evans joins Bruce Langridge from the National Botanic Garden of Wales and Dr Gareth Griffiths, a mycologist from Aberystwyth University on a fungal foray with a difference, as they look for jewel like waxcap fungi  hidden amongst grass.",
            "length": "20928000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p05fjbgx.mp3"
        },
        {
            "title": "Bone Stories : Ben Garrod Reveals Five Bone Stories",
            "datePublished": "Sat, 19 Aug 2017 23:30:00 +0000",
            "description": "First broadcast on Radio 4 as a five part series, evolutionary biologist Ben Garrod follows a trail of five clues, beginning with a bone or skeleton and leading to a series of fascinating revelations. \n\n\n\nBrought together into one single episode, Ben first explores the link between an 18th century skeleton in the Hunterian Museum and Brendan Holland from County Tyrone, before turning his attention to a storm, a Norfolk beach and the unearthed bones of the oldest mammoth found in the UK. Next Ben reveals how studies of the skeletons of the Long Bow Archers who sank with the Mary Rose in 1545 could help medical science, before heading through time to reveal how the skeletal remains of the Dodo may hold the key to life beyond the grave. Finally Ben discovers how the jaws of a man-eating tiger are vital evidence in understanding the role of predation on human evolutionary behaviour.",
            "length": "65712000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p059tm99.mp3"
        },
        {
            "title": "Bone Stories : (Episode 5 of 5) Man-eating Tiger",
            "datePublished": "Fri, 18 Aug 2017 23:30:00 +0000",
            "description": "Evolutionary biologist Ben Garrod stares into the jaws of a man-eating tiger and learns how samples from the bones are providing vital evidence in understanding the role of predation on our evolutionary behaviour. Were our early ancestors primarily hunters or hunted?",
            "length": "13472000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p059tm7j.mp3"
        },
        {
            "title": "Bone Stories : (Episode 4 of 5) Dodo",
            "datePublished": "Thu, 17 Aug 2017 23:30:00 +0000",
            "description": "The Dodo is byword for extinction, or at least it has been. Evolutionary biologist Ben Garrod discovers how the skeletal remains of this extinct bird may hold the key to life beyond the grave and that extinction could be a thing of the past.",
            "length": "13408000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p059tm69.mp3"
        },
        {
            "title": "Bone Stories : (Episode 3 of 5) the Mary Rose Archer",
            "datePublished": "Wed, 16 Aug 2017 23:30:00 +0000",
            "description": "Evolutionary biologist Ben Garrod tries his hand at pulling a medieval long bow and discovers how studies of the skeletons of the archers who sank with the Mary Rose could help patients with dyspraxia.",
            "length": "13424000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p059tm45.mp3"
        },
        {
            "title": "Bone Stories : (Episode 2 of 5) West Runton Mammoth",
            "datePublished": "Tue, 15 Aug 2017 23:30:00 +0000",
            "description": "Evolutionary biologist Ben Garrod heads to a Norfolk beach to hear how a raging storm led to the discovery of one of the oldest mammoth skeletons ever to have been found in the UK  and the best preserved skeleton of this species in the world. The skeleton revealed a treasure trove of information about life some 600,000 to 700,000 years ago.",
            "length": "13392000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p059tm2p.mp3"
        },
        {
            "title": "Bone Stories : (Episode 1 of 5) The Irish Giant",
            "datePublished": "Mon, 14 Aug 2017 23:30:00 +0000",
            "description": "Evolutionary Biologist Ben Garrod follows a trail of clues beginning with a bone or skeleton and leading to a fascinating revelation. In this programme, Ben explores the link between an 18th century skeleton in the Hunterian Museum and Brendan Holland from County Tyrone who reached a height of 6’10” and has been diagnosed with gigantism. Ben follows a trail of clues and discovers how recent findings could mean that in the future there are no more Irish giants.",
            "length": "13392000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p059tm10.mp3"
        },
        {
            "title": "Living World from the Archives - Glow Worms",
            "datePublished": "Sun, 09 Jul 2017 07:00:00 +0000",
            "description": "Brett Westwood relives programmes from The Living World archives. In this episode from 2013, Chris Sperring is in Buckinghamshire with Robin Scagell on a glow worm safari.",
            "length": "20832000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p055t1b4.mp3"
        },
        {
            "title": "Living World from the Archives - The Shell Nesting Bee",
            "datePublished": "Sun, 02 Jul 2017 07:00:00 +0000",
            "description": "Brett Westwood relives programmes from The Living World archives. In this episode from 2014, Trai Anfield is in Dorset with naturalist John Walters.",
            "length": "20704000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p055t1j9.mp3"
        },
        {
            "title": "Living World from the Archive - The Night Island",
            "datePublished": "Sun, 25 Jun 2017 07:00:00 +0000",
            "description": "Brett Westwood relives programmes from The Living World archives. In this episode from 2012, Chris Sperring heads to Skomer Island with ecologist David Boyle",
            "length": "20720000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p055t1dx.mp3"
        },
        {
            "title": "Living World from the Archives - The Adders of Loch Lomond",
            "datePublished": "Sun, 18 Jun 2017 09:00:00 +0000",
            "description": "In this programme from 2014, Trai Anfield joins Chris McInerny adder spotting on the eastern edges of Loch Lomond.",
            "length": "20640000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p055nxbx.mp3"
        },
        {
            "title": "Living World from the Archives - The Nest Finder of Dartmoor",
            "datePublished": "Sun, 11 Jun 2017 08:00:00 +0000",
            "description": "Brett Westwood introduce Living World from the Archives - The Nest Finder of Dartmoor",
            "length": "20672000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p055fsw8.mp3"
        },
        {
            "title": "The Listeners (Series 3, Ep 3)",
            "datePublished": "Tue, 05 Jan 2016 21:30:00 +0000",
            "description": "A Musician, a Poet and a Quaker share their listening experiences; discuss the difference between hearing and listening and reveal how listening is more than just an aural experience; it’s something much deeper motivating their work and their lives. The musician is Dame Evelyn Glennie, whose vision is to teach the world to listen by encouraging everyone to discover new ways of listening. As a result of hearing problems when she was a child, Evelyn learned to ‘feel ‘ sounds, not just hear them. Using different instruments she demonstrates how sounds and reverberations can affect us; emotionally and physically. Katrina Porteus’s earliest memory is the sound of a blackbird singing whilst she was in her pram. Since then listening has had a huge influence on her work as a poet; much of her work is about the fishing communities and landscape of County Durham and Northumberland. Like Evelyn, Katrina feels sounds; they are “the heartbeat of a place”. On the written page, there is silence between the words of a poem. “If we get it right we can find silence where we can really listen” says Hermione Legg, who has been a Quaker since she was child and regularly attends meetings which are opportunities for a community to come together in worship. There is no creed and much of the meeting is silent. The silence offers an opportunity to listen. Listening is also about communication. “If I’m listened to, I feel I have worth” says Hermione “Why speak if no one’s going to listen … Life would have no meaning without us listening.” Producer Sarah Blunt.",
            "length": "26656000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p03c4p1h.mp3"
        },
        {
            "title": "Would You Eat an Alien? - Alien Persons",
            "datePublished": "Wed, 30 Dec 2015 21:30:00 +0000",
            "description": "In this four part series Christine Nicol, professor of Animal Welfare at the University of Bristol, explores the fascinating and challenging subject of animal sentience and welfare. To help delve into the nuances we set up an intriguing scenario: Jake the Spacemen (aka comedian Jake Yapp) has crash-landed on a remote planet and doesn't have much food to keep him going until he is rescued. Fortunately, the planet is teeming with alien life forms that are edible, but which ones should he eat? He wants to cause the minimum amount of pain and distress to the creatures, so what does he need to know about the nature of the beings on the planet? Can they feel pain? If so, how can he minimise suffering? Will eating an alien cause distress to others? Is the alien so aware and sensitive to its environment that Jake needs to consider whether it is a non-human person?\n\n\n\n\n\nChristine will interview animal welfare scientists, philosophers and wildlife biologists to get under the skin of animal sentience and the potential consequences of accepting that animals are conscious, aware creatures. These big questions generate surprising and challenging insights into our attitudes to other life. When you know absolutely nothing about the alien in front of you, what do you need to know before eating it?",
            "length": "26720000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p038xgv1.mp3"
        },
        {
            "title": "The Listeners (Series 3, Ep 2)",
            "datePublished": "Tue, 29 Dec 2015 21:30:00 +0000",
            "description": "Fiona Gameson has been blind since she was about 3 and half years old, and since childhood has used echolocation to help navigate her surroundings. Echolocation is used by bats and dolphins and some other marine mammals to navigate and hunt their prey. It involves producing a sonar emission (mouth clicks in Fiona’s case) and listening to the echoes to hear and “see” their surroundings. Lore Thaler a lecturer at Durham University has been studying human echolocation and we hear about her work with individuals like Fiona. We also hear from Christopher Willis Clark, a senior scientist and Professor at Cornell University and in the Bioacoustics Research Programme at Cornell Laboratory of Ornithology where he studies the acoustic behaviour of birds, fish, elephants and whales. He too is familiar with the notion of ‘seeing with sound’, of creating ‘maps’ from sounds and using these to navigate underwater. Above the waves, poet Katrina Porteus discusses how listening to the soundscape of places has influenced her work and Trevor Cox, Professor of Acoustic Engineering at Salford University recalls some of his favourite listening experiences in reverberant spaces and explains how the acoustics in a badly designed lecture hall in the late 1800's was the starting point for the study of architectural acoustics along with some hand claps and a saxophone in Trevor’s case! Producer Sarah Blunt.",
            "length": "26608000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p03c4ntz.mp3"
        },
        {
            "title": "Would You Eat an Alien? - Sociable Aliens",
            "datePublished": "Wed, 23 Dec 2015 21:30:00 +0000",
            "description": "In this four part series Christine Nicol, professor of Animal Welfare at the University of Bristol, explores the fascinating and challenging subject of animal sentience and welfare. To help delve into the nuances we set up an intriguing scenario: Jake the Spacemen (aka comedian Jake Yapp) has crash-landed on a remote planet and doesn't have much food to keep him going until he is rescued. Fortunately, the planet is teeming with alien life forms that are edible, but which ones should he eat? He wants to cause the minimum amount of pain and distress to the creatures, so what does he need to know about the nature of the beings on the planet? Can they feel pain? If so, how can he minimise suffering? Will eating an alien cause distress to others? Is the alien so aware and sensitive to its environment that Jake needs to consider whether it is a non-human person?\n\n\n\n\n\nChristine will interview animal welfare scientists, philosophers and wildlife biologists to get under the skin of animal sentience and the potential consequences of accepting that animals are conscious, aware creatures. These big questions generate surprising and challenging insights into our attitudes to other life. When you know absolutely nothing about the alien in front of you, what do you need to know before eating it?",
            "length": "26656000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p038xg16.mp3"
        },
        {
            "title": "The Listeners (Series 3, Ep1)",
            "datePublished": "Tue, 22 Dec 2015 21:30:00 +0000",
            "description": "Listening is about more than hearing as we discover in this new series of 3 programmes. The first programme explores three very different experiences of listening to speech with a poet, a speech dialect coach and Chair of Samaritans.\n\n\n\nJan Haydn Rowles is an accent and dialect coach whose interest in dialect began when she noticed how her parents who were born in different counties spoke with different accents; and that the same was true of her and her siblings. Jan not only hears sounds she sees them; “When I listen to a person’s voice I don’t see it, I hear it” and she offers a fascinating insight into her visual experiences of sound.\n\n\n\nKatrina Porteus has spent much of her life in County Durham and Northumberland writing about the fishing communities and coastal landscape where she lives. ‘A poem begins and ends in listening’ she says. For Katrina, listening extends to the sounds of the words; whether they be soft sounds or hard sounds, and beyond the meaning of the words to the rhythm of language and the music of the dialect as we discover.\n\n\n\nJenni McCartney is our third listener. She has been working with Samaritans for over 30 years, first as a volunteer and now as Chair. “Listening is absolutely crucial to what we do” she says, Started by Chad Varra in 1953, Samaritans is a charity which provides confidential emotional support for people who are experiencing feelings of distress, despair or suicidal thoughts, and is available 24 hours a day, every day. At its simplest, Samaritans is about listening. “Every 6 seconds somebody contacts Samaritans”. Listening perhaps has never been more important.\n\n\n\nProducer Sarah Blunt",
            "length": "26608000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p03c4ngy.mp3"
        },
        {
            "title": "Would You Eat an Alien? - Emotional Aliens",
            "datePublished": "Wed, 16 Dec 2015 21:30:00 +0000",
            "description": "In this four part series Christine Nicol, professor of Animal Welfare at the University of Bristol, explores the fascinating and challenging subject of animal sentience and welfare. To help delve into the nuances we set up an intriguing scenario: Jake the Spacemen (aka comedian Jake Yapp) has crash-landed on a remote planet and doesn't have much food to keep him going until he is rescued. Fortunately, the planet is teeming with alien life forms that are edible, but which ones should he eat? He wants to cause the minimum amount of pain and distress to the creatures, so what does he need to know about the nature of the beings on the planet? Can they feel pain? If so, how can he minimise suffering? Will eating an alien cause distress to others? Is the alien so aware and sensitive to its environment that Jake needs to consider whether it is a non-human person?\n\n\n\n\n\nChristine will interview animal welfare scientists, philosophers and wildlife biologists to get under the skin of animal sentience and the potential consequences of accepting that animals are conscious, aware creatures. These big questions generate surprising and challenging insights into our attitudes to other life. When you know absolutely nothing about the alien in front of you, what do you need to know before eating it?",
            "length": "26688000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p038xf7q.mp3"
        },
        {
            "title": "Would You Eat an Alien? - Pain or No Pain",
            "datePublished": "Wed, 09 Dec 2015 21:30:00 +0000",
            "description": "In this four part series Christine Nicol, professor of Animal Welfare at the University of Bristol, explores the fascinating and challenging subject of animal sentience and welfare. To help delve into the nuances we set up an intriguing scenario: Jake the Spacemen (aka comedian Jake Yapp) has crash-landed on a remote planet and doesn't have much food to keep him going until he is rescued. Fortunately, the planet is teeming with alien life forms that are edible, but which ones should he eat? He wants to cause the minimum amount of pain and distress to the creatures, so what does he need to know about the nature of the beings on the planet? Can they feel pain? If so, how can he minimise suffering? Will eating an alien cause distress to others? Is the alien so aware and sensitive to its environment that Jake needs to consider whether it is a non-human person?\n\n\n\n\n\nChristine will interview animal welfare scientists, philosophers and wildlife biologists to get under the skin of animal sentience and the potential consequences of accepting that animals are conscious, aware creatures. These big questions generate surprising and challenging insights into our attitudes to other life. When you know absolutely nothing about the alien in front of you, what do you need to know before eating it?",
            "length": "26752000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p038xdl6.mp3"
        },
        {
            "title": "3D Bio-Printing",
            "datePublished": "Tue, 07 Apr 2015 10:30:00 +0000",
            "description": "Presenter Howard Stableford investigates whether 3D printing can bring real benefit to the natural world. Along the way he discovers a 3D printed reef structure and scientific applications. With species extinction in the natural world a reality, Howard then asks the bigger question: are we near the point when we could reproduce a living species?\nProducer: Andrew Dawes",
            "length": "26720000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02rwylx.mp3"
        },
        {
            "title": "Soundstage - Dawn Chorus",
            "datePublished": "Fri, 27 Mar 2015 14:00:00 +0000",
            "description": "Wildlife sound recordist Chris Watson introduces the sounds of a dawn chorus recorded near Aldeburgh in Suffolk in the last in this series of immersive soundscapes.\nProduced by Sarah Blunt",
            "length": "13200000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02rx2vv.mp3"
        },
        {
            "title": "Soundstage - Glacial Melt",
            "datePublished": "Thu, 26 Mar 2015 14:00:00 +0000",
            "description": "The extraordinary and powerful sounds of a glacier calving are captured by wildlife sound recordist, Chris Watson in this immersive soundscape.\nProduced by Sarah Blunt",
            "length": "13232000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02rwq96.mp3"
        },
        {
            "title": "Soundstage - The Wash",
            "datePublished": "Wed, 25 Mar 2015 14:00:00 +0000",
            "description": "Wildlife sound recordist Chris Watson introduces the extraordinary sounds which accompany the movement of the tides on the Wash, in this series of immersive soundscapes.\nProduced by Sarah Blunt",
            "length": "13216000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02rwr30.mp3"
        },
        {
            "title": "Soundstage - St James' Park",
            "datePublished": "Tue, 24 Mar 2015 14:00:00 +0000",
            "description": "Wildlife sound recordist Chris Watson introduces the sounds of the city on Match Day in Newcastle upon Tyne in the second in a series of immersive soundscapes.\nProduced by Sarah Blunt",
            "length": "13232000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02rwv7f.mp3"
        },
        {
            "title": "Soundstage - Midnight at the oasis",
            "datePublished": "Mon, 23 Mar 2015 14:00:00 +0000",
            "description": "Wildlife sound recordist Chris Watson narrates the first in a series of audio postcards capturing spectacular wild sound events, beginning in the Kalahari desert.\nProduced by Sarah Blunt",
            "length": "13264000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02rx158.mp3"
        },
        {
            "title": "Living World - Dabbling Ducks, 1st March '15",
            "datePublished": "Sun, 01 Mar 2015 07:00:00 +0000",
            "description": "In winter, the UK's estuaries and wetlands play host to many species of 'dabbling,' or surface feeding, ducks. Chris Sperring visits the Wildfowl and Wetlands Trust reserve at Slimbridge in Gloucestershire to find out more about them.",
            "length": "20928000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02rwq66.mp3"
        },
        {
            "title": "Living World, Giant Fungus",
            "datePublished": "Sun, 22 Feb 2015 07:00:00 +0000",
            "description": "Chris Sperring and Michael Jordan of the Association of British Fungus Groups go in search of giant bracket fungus in Dommett Wood in Somerset.\nBracket fungus grow on a variety of native trees. The vegetative part of the fungus, known as mycelium, grows under the bark of fallen wood or living trees, and will eventually break down and rot the host tree. However, the part that can most easily be seen is the fruiting body of bracket fungus. These fruiting bodies, growing on tree trunks and fallen logs, allow the fungus to reproduce and exist to produce and liberate millions of microscopic spores.",
            "length": "20768000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02rwvgw.mp3"
        },
        {
            "title": "The Living World: Wood Mice of Wytham",
            "datePublished": "Sun, 15 Feb 2015 07:00:00 +0000",
            "description": "In the company of Marc Brouard and Nigel Fisher, Conservator of Wytham Woods, Trai Anfield hears how these small mammals have a vital role to play in the ecology of the woodland.\nWytham Woods, is reputedly, the most studied woodland in World. Marc Brouard is the latest in a long line of scientific researchers to undertake field studies on small mammals. In 1943 Charles Elton, known as 'the father of modern ecology', studied wood mice and bank voles and his work was followed up by H.N. Southern who examined the impact of predation by tawny owls on populations of small mammals. Marc aims to understand how the characteristics of individual wood mice and bank voles can affect the survival of each species.",
            "length": "20992000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02rwpwq.mp3"
        },
        {
            "title": "The Cliff, Ep4",
            "datePublished": "Thu, 12 Feb 2015 14:00:00 +0000",
            "description": "Martin Palmer, Secretary General of The Alliance of Religions and Conservation reflects on the spiritual responses evoked by cliffs in religious stories and traditions.",
            "length": "13264000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02rwrmm.mp3"
        },
        {
            "title": "The Cliff, Ep3",
            "datePublished": "Wed, 11 Feb 2015 14:00:00 +0000",
            "description": "Geologist Zoe Shipton explains how cliffs can be read like books to reveal the geological history of the earth.",
            "length": "13376000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02rwrm2.mp3"
        },
        {
            "title": "The Cliff, Ep2",
            "datePublished": "Tue, 10 Feb 2015 14:00:00 +0000",
            "description": "Skellig Michael or Great Skellig is the larger of the two Skellig islands situated some 12km off the coast of Portmagee in south west Ireland. It’s a spectacular rocky pinnacle towering over 200 metres above sea level. Illustrated with recordings he made on location, wildlife sound recordist Chris Watson recalls his ascent of Skellig Michael.",
            "length": "13296000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02rwsbp.mp3"
        },
        {
            "title": "The Cliff, Ep1",
            "datePublished": "Mon, 09 Feb 2015 14:00:00 +0000",
            "description": "Alan Read, Professor of Theatre at Kings College London explores the Dreadful Trade on Shakespeare’s Cliff in the first of a new series about our relationship with Cliffs.",
            "length": "13344000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02rwsbd.mp3"
        },
        {
            "title": "Living World - Winter Seashore",
            "datePublished": "Sun, 08 Feb 2015 07:00:00 +0000",
            "description": "Trai Anfield visits a wintry Bovisand Bay in South Devon in the company of Keith Hiscock, Associate Fellow of the Marine Biological Association.\nThey rummage amongst the storm strewn seaweed making up the strand line at the top of the beach. It is here that insects and crustaceans flourish in the food rich and clement micro world, in turn drawing in birds like wagtails and turn stones.\nDown in the inter-tidal zone, along with finding a host of marine molluscs are the excitingly named volcano barnacles and beautifully coloured beadlet anenomies.",
            "length": "21040000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02rwsqn.mp3"
        },
        {
            "title": "An Image of Sound",
            "datePublished": "Sat, 07 Feb 2015 16:00:00 +0000",
            "description": "Photographer Andrew Heptinstall goes on a quest to represent sound within a photographic image, which takes him from the camera, into the mind and back again.",
            "length": "13600000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02rwqg0.mp3"
        },
        {
            "title": "The Living World - Spined Loach",
            "datePublished": "Sun, 01 Feb 2015 07:00:00 +0000",
            "description": "The spined loach is a small freshwater fish that spends most of the time buried in the silt of riverbeds. It is believed be in the UK as a result of the melting from the last Ice Age when the UK was connect to Europe. After the Ice Age rescinded, the ocean water levels increased for a time before decreasing enough to essentially separating some of the species from the rest that live in Europe. Brett Westwood joins Environment Agency Fisheries Officer Andy Beal and his team conducting a survey of this secretive and rare animal at Morton's Leam; a 15th Century river artificial course of the River Nene in Cambridgeshire.\nProduced by Jamie Merritt",
            "length": "20880000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02rwyc1.mp3"
        },
        {
            "title": "Shared Planet - Natural Symbols 20 Jan '14",
            "datePublished": "Tue, 20 Jan 2015 11:30:00 +0000",
            "description": "The final programme in the series recorded in the Natural History Museum in London. Four experts from different fields chose an object that symbolises our relationship with nature.",
            "length": "26752000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02rwtfp.mp3"
        },
        {
            "title": "The Diaries of Brett Westwood: Canal - 16 Jan '15",
            "datePublished": "Fri, 16 Jan 2015 13:45:00 +0000",
            "description": "When Brett Westwood began a wildlife diary at the age of 15, little did he think that he'd still be writing notes, nearly 40 years later about the same local patch in North Worcestershire.\nThe River Stour has its source in the industrial Black Country and flows through Brett's local patch on its way to the Severn, about 9 miles away. Today, although it is polluted, the river is far clearer than in years gone by, thanks to rigorous controls on pollutants. With their absence, fish have returned and damselflies such as the white-legged damsel which is sensitive to pollution, skim across the surface.",
            "length": "13376000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02rwy7c.mp3"
        },
        {
            "title": "The Diaries of Brett Westwood: Woodland - 15 Jan '15",
            "datePublished": "Thu, 15 Jan 2015 13:45:00 +0000",
            "description": "When Brett Westwood began a wildlife diary at the age of 15, little did he think that he'd still be writing notes, nearly 40 years later about the same local patch in North Worcestershire.\nFairy Glen is a small natural woodland in Brett's patch carpeted with bluebells in spring. This was once oak has become a sycamore wood. However it's now a great place to spot warblers; chaffinches and bramblings feeding on aphids in spring, and during his visit Brett watches a pair of Nuthatches bringing back food for their young to their nest hole in the trunk of a tree.",
            "length": "13200000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02rwqq3.mp3"
        },
        {
            "title": "The Diaries of Brett Westwood: Sewage",
            "datePublished": "Wed, 14 Jan 2015 13:45:00 +0000",
            "description": "When Brett Westwood began a wildlife diary at the age of 15, little did he think that he'd still be writing notes, nearly 40 years later about the same local patch in North Worcestershire.\nn this programme, Brett visits a farm at Whittington. When he was a teenager, sewage was pumped out onto an area of about a square mile where cattle were grazed. In icy winters the fields did not freeze owing to the warmth provided by the sewage and the life breeding in it! Unusual for the West Midlands in winter, a regular flock of up to 200 curlews were joined by a pink-footed goose, pintails, wigeon, and in winter 1976 two spotted redshanks.",
            "length": "13264000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02rx2b9.mp3"
        },
        {
            "title": "The Diaries of Brett Westwood: Valley - 13 Jan '15",
            "datePublished": "Tue, 13 Jan 2015 13:45:00 +0000",
            "description": "When Brett Westwood began a wildlife diary at the age of 15, little did he think that he'd still be writing notes, nearly 40 years later about the same local patch in North Worcestershire.\nIn this programme, Brett visits the valley. Since Brett started visiting his local patch, the landscape here has been changed more radically than any other area in the patch, not as a result of management, but of nature taking its course. The valley is a sandstone dip between two horse pastures and its steep sides have deterred any cropping or grazing.",
            "length": "13280000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02rwv2g.mp3"
        },
        {
            "title": "Shared Planet - Half and Half 13 Jan '14",
            "datePublished": "Tue, 13 Jan 2015 11:30:00 +0000",
            "description": "The world has lost so much wildlife some conservationists think half the earth should be set aside for nature to ensure the world can continue to provide all the services we need such as clean water, unpolluted air and soils, healthy food and so on. But one recent study shows that 50% of wildlife has disappeared in the last 40 years. As human population grows and pressure on resources increases many feel there needs to be a bold plan to ensure we can share the planet with other forms of life so that they and us can continue. One proposition is called Half Earth - make half of the earth just for nature. The vision is for a meandering network of nature corridors that open out into huge parks set aside for wildlife. In a special programme from the Natural History Museum in London Monty Don and a panel of experts in subjects ranging from conservation science to urban planning and economics discuss whether this could work?",
            "length": "26736000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02rwszj.mp3"
        },
        {
            "title": "The Diaries of Brett Westwood: Farmland - 12 Jan '15",
            "datePublished": "Mon, 12 Jan 2015 13:45:00 +0000",
            "description": "When Brett Westwood began a wildlife diary at the age of 15, little did he think that he'd still be writing notes, nearly 40 years later about the same local patch in North Worcestershire.\nIn the first programme Brett visits an area of arable and pasture land where corn buntings sang their crackly songs, grey partridges creaked in spring dusks and the pee-wit cries of lapwing were regular sounds.",
            "length": "13264000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02rx093.mp3"
        },
        {
            "title": "Shared Planet - Future of Coral",
            "datePublished": "Tue, 06 Jan 2015 11:30:00 +0000",
            "description": "Coral reefs are renowned for their beauty and diversity, and they provide us with a wondrous spectacle, but as the seas warm and become more acidic will they survive?",
            "length": "26704000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02rwqhd.mp3"
        },
        {
            "title": "Shared Planet - Lemurs Out on a Limb",
            "datePublished": "Mon, 05 Jan 2015 21:30:00 +0000",
            "description": "The lemurs of Madagascar are the most endangered mammals on earth - driven to the edge of survival by habitat loss and hunting. How can we save them from extinction?",
            "length": "26528000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02rwyxb.mp3"
        },
        {
            "title": "Shared Planet - Pit Stops and Stopovers",
            "datePublished": "Tue, 23 Dec 2014 11:30:00 +0000",
            "description": "Migrating birds exemplify our problem to share the planet with wildlife. These birds fly thousands of kilometers with many species needing protected stop over places to feed.",
            "length": "26560000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02rwql1.mp3"
        },
        {
            "title": "Shared Planet - Sharing with Wolves",
            "datePublished": "Tue, 16 Dec 2014 11:30:00 +0000",
            "description": "Few creatures have infiltrated our psyche as much as wolves. They haunt our imagination and appear in our stories, myths and legends. They are at once the embodiment of the devil and of the wild, enough dog that we relate to them, but also rugged, unpredictable and wild. They roam vast, untamed landscapes and then appear in our midst, hunting sheep and spreading fear.\nOur relationship has been so conflicting that they were almost eradicated from the earth by the end of the 19th Century. But since being protected they are slowly coming back in both Europe and America. Are we now able to live with them? Do we want to? Monty Don explores the enigma that is the wolf and looks at how our attitudes have shaped their destiny.",
            "length": "26512000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02rwsyd.mp3"
        },
        {
            "title": "Shared Planet Orangutans and Drones",
            "datePublished": "Tue, 09 Dec 2014 11:30:00 +0000",
            "description": "Orang-utans live in the peat rainforests of Malaysia and Indonesia. It can be tough terrain to travel through on foot so studying and surveying wild orang-utans is difficult and dangerous. Can drones help to answer questions about the number and distribution of the 'people of the forest' and monitor illegal logging of this endangered ape's habitat? This week Shared Planet explores the potential of drones to help us share the planet with orang-utans - but also explores the possible pitfalls of using this controversial technology.",
            "length": "26848000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02rwzmf.mp3"
        },
        {
            "title": "Shared Planet - Drought in East Africa",
            "datePublished": "Tue, 02 Dec 2014 11:30:00 +0000",
            "description": "As East Africa gets hotter and drier livestock are increasingly being grazed inside wildlife reserves. Inevitably this leads to predation by big cats. What does the future hold for the pastoralists, wildlife and the say of life of the Samburu? Monty Don explores this increasingly difficult issue with a field report from Samburu where a severe drought is taking its toll. Climate change predictions show that conditions will get worse and wildlife experts discuss the challenges ahead for nature and people.",
            "length": "26608000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02rwsmn.mp3"
        },
        {
            "title": "Shared Planet - Snapping Turtles",
            "datePublished": "Tue, 25 Nov 2014 11:30:00 +0000",
            "description": "What do elephants, snapping turtles and guillemots have in common? They are all examples of 'long-lived' animals with some species living longer than the careers of the scientists who study them. In this episode of Shared Planet Monty Don talks to Tim Birkhead and Phyllis Lee, both scientists who have studied the behaviour of long-lived species and both argue that you discover insights into long-lived animals can will help their conservation and our ability to share the planet with them.\nPresented by Monty Don.\nProduced by Mary Colwell.",
            "length": "26608000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02rwzzw.mp3"
        },
        {
            "title": "Living World - Whooper Swans",
            "datePublished": "Sun, 23 Nov 2014 07:00:00 +0000",
            "description": "When freezing temperatures descend on Iceland, majestic whooper swans migrate south to the Highlands of Scotland where they flock together on wet land, whooping musically to one another in high and low tones. The beauty of the whooper swan has long been revered and over the winter months the Insh Marshes Nature Reserve plays host to this spectacular gathering. Living World presenter Trai Anfield and the RSPB's Catherine Vis-Christie take to the marshes to see how these elegant birds are faring after their long journey to Scottish shores.\nProduced by Tom Bonnett",
            "length": "20656000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02rwr8t.mp3"
        },
        {
            "title": "Shared Planet - Mangroves",
            "datePublished": "Tue, 18 Nov 2014 11:30:00 +0000",
            "description": "Mangroves have been destroyed worldwide, we are trying to restore them. Is that possible? Can we really restore nature back to what it once was?",
            "length": "26432000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02rwzwb.mp3"
        },
        {
            "title": "Living World - Dry Stone Walls",
            "datePublished": "Sun, 16 Nov 2014 07:00:00 +0000",
            "description": "Mary Colwell travels to White Peak to meet Sarah Henshall, lead ecologist with Buglife and Simon Nicholas, the local Ranger for the National Trust, to discover the 350 million year old limestone that forms the walls and search for the mini beasts that live in their depths.",
            "length": "20704000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02rwt07.mp3"
        },
        {
            "title": "Shared Planet: Blue Whales",
            "datePublished": "Tue, 11 Nov 2014 11:30:00 +0000",
            "description": "Blue whales are increasingly being hit by ships, especially off the coast of California. As whale numbers recover from hunting and the number of ships that ply the oceans increases this is a growing problem. What can be done? Monty Don explores this little known threat to whales, a threat that is found in all oceans all over the world and effects most species of whale. It seems that the welcome news that whale numbers are slowly rising is being countered by concern over ship strikes, most of which are fatal. A simple solution is to slow the speed of ships down to around 10 knots, but this has financial implications for the shipping industry, so a balance has to be struck. Technology could help, but it is expensive, not reliable in choppy seas and in the case of sonar could fill the ocean with more noise. How can we share the oceans with giants and still move 90% of traded goods by boat?",
            "length": "26480000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02rx2wn.mp3"
        },
        {
            "title": "Living World - Great Crested Newt",
            "datePublished": "Sun, 09 Nov 2014 07:00:00 +0000",
            "description": "As the weather starts to chill, Chris Sperring travels to the Somerset Levels to seek out a last glimpse of the great crested newt as it prepares for hibernation. It's at this time of year we discover why ponds that dry up are important for their breeding and how far they are prepared to travel to find a good place to haul up for winter.",
            "length": "20832000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02rx2rh.mp3"
        },
        {
            "title": "Shared Planet Beavers in Business",
            "datePublished": "Tue, 04 Nov 2014 11:30:00 +0000",
            "description": "The European beaver was hunted to extinction for its fur, meat and the aromatic secretions from sacs near its anal glands. Now it is coming back throughout Europe , either naturally or by being introduced, as here in the UK. Wherever they settle they transform the landscape by building dams and channels and create a landscape of pools and watercourses that hold back flood water, pollution and silt from entering the main rivers. In these times of severe weather events and flooding beavers are doing for free what landscape engineers would do at great cost. Viewing nature in terms of the services it provides, or evaluating nature in financial terms, is a growing movement in conservation. Nature can be seen on balance sheets and hopefully respected for all that it gives us for free. But there is concern that monetising nature leaves it open to the ruthless world of finance and trading and diverts attention away from the real aims of conservation.",
            "length": "26448000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02rwrk3.mp3"
        },
        {
            "title": "Living World: Eastern Wolves",
            "datePublished": "Sun, 02 Nov 2014 07:00:00 +0000",
            "description": "Algonquin National Park in Ontario is home to the Eastern Wolf and a magnet for visitors to this wilderness national park. Canadian reporter Sian Griffiths meets David Legros in the park and is taken on a wolf howl expedition too look for this shy and retreating animals. The park organises public wolf-howls to bring members of the public closer to and give richer encounters with this wonderful creature. The Living World has special access to the park and the rangers for this exclusive nature walk with a difference. \nProduced by Jamie Merritt",
            "length": "20736000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02rwyfy.mp3"
        },
        {
            "title": "Shared Planet - Albatrosses and Fishing",
            "datePublished": "Tue, 28 Oct 2014 11:30:00 +0000",
            "description": "Albatrosses are giant flying seabirds that inhabit the southern oceans. Many species have been studied intensively over decades on their breeding grounds in the sub-Antarctic and the Pacific. Clever studies involving satellite tracking and simple observations from ships have shown they can disperse and forage across the whole of the southern ocean. Monitoring of their populations has shown a marked decline in their numbers since the 1980's so much so all albatross species are now threatened. A key cause of albatross decline was found quickly after the decline in populations was noticed; long-line fishing hooks baited with squid and floating on the surface after being deployed was an easy meal for an ocean scavenger and often their last. Shared Planet visits this story many years after it broke to report a cautious success on the high level conservation measures that were put in place involving biologists and the fishing industry.",
            "length": "26784000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02rwrc0.mp3"
        },
        {
            "title": "The Spirit Child",
            "datePublished": "Mon, 27 Oct 2014 16:30:00 +0000",
            "description": "Paul Evans narrates a ghostly tale inspired by the true story of Alice Glaston who was the youngest person to be hung in Tudor England. Starring Bettrys Jones.\nProduced by Sarah Blunt",
            "length": "26480000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02rwsnv.mp3"
        },
        {
            "title": "Living World: Nightjars",
            "datePublished": "Sun, 26 Oct 2014 07:00:00 +0000",
            "description": "Chris Sperring is in Somerset during the last days of summer to find a bird that is one of the first to leave before the autumn. As the light fades a strange whirring sound fills the air and silent masters of flight hawk for moths and other airborne insects. \nProduced by Ellie Sans",
            "length": "20672000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02rwt10.mp3"
        },
        {
            "title": "Shared Planet: Hen Harriers - Trust",
            "datePublished": "Tue, 21 Oct 2014 10:30:00 +0000",
            "description": "Hen harriers are persecuted in the British Isles because they eat grouse. Seals cause problems for salmon fishermen; lions eat the livestock of pastoralists in Africa and so on. All over the world there are conflicts between people and wildlife, often with devastating consequences. In Shared Planet this week Monty Don looks at how we are approaching solving these issues, who is taking the bull by the horns and getting people around a table to come up with a shared solution? Conflict resolution is growing area that brings together scientists, local people, businesses, NGOs and many others who are affected by wildlife conflict. It is a demanding task finding a solution that all parties feel they can accept, on a par with the negotiations undertaken with trade unions by ACAS. This new area for conservation brings political and social science to sit alongside traditional conservation ideas. Monty Don investigates.",
            "length": "26720000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02rwqm0.mp3"
        },
        {
            "title": "Shared Planet - Insects and Lights",
            "datePublished": "Tue, 14 Oct 2014 10:30:00 +0000",
            "description": "Artificial lighting is ubiquitous in the developed world - but the effects of night time illumination on wildlife are not yet fully understood.\nWhile we know that artificial light changes the behaviour of some animals we're still a long way from knowing whether those changes can damage wildlife populations.\nMonty Don finds out what we do know with particular regard to an important but often overlooked group of animals - insects.",
            "length": "26816000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02rwrvr.mp3"
        },
        {
            "title": "Shared Planet - Mahogany",
            "datePublished": "Tue, 07 Oct 2014 10:30:00 +0000",
            "description": "Beautiful and durable, mahogany has been highly prized and traded internationally for centuries. Reaching the impressive height of 60 metres or more they are true giants of the forest. Selective logging of mahogany was unchecked across much of its range until international agreements restricted its trade. But has this been enough? Monty Don finds out more about the big-leaf mahogany and whether we can continue to use its beautiful wood without forfeiting its future.",
            "length": "26608000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02rwsf7.mp3"
        },
        {
            "title": "Shared Planet - Ocean Plastics",
            "datePublished": "Tue, 30 Sep 2014 10:30:00 +0000",
            "description": "Plastic litter has the knack of finding its way into the ocean. Unfortunately this means that seabirds that have, until relatively recently, been safe to assume that the objects floating on the surface are food are getting a stomach full of trash. Shared Planet finds out how bad the situation is for seabirds like the fulmar and the simple things we can do to reduce the problem.",
            "length": "26352000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02rx0b3.mp3"
        },
        {
            "title": "Shared Planet - Less Wildlife?",
            "datePublished": "Tue, 23 Sep 2014 10:30:00 +0000",
            "description": "The diversity and abundance of wildlife is declining across the world. As people grow older they notice the changes but for each new generation the baseline is reset. Is each generation getting used to living with less and less wildlife?",
            "length": "26800000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02rx1wr.mp3"
        },
        {
            "title": "Gossip From The Garden Pond",
            "datePublished": "Sun, 21 Sep 2014 18:45:00 +0000",
            "description": "Ep: 3 of 3\nIn the last of three tales written by Lynne Truss, the Garden Spider (Amanda Root) and the Great Pond Snail (James Fleet) reveal the funny side of life in a garden pond.  \nProducer: Sarah Blunt",
            "length": "26640000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02rwqxs.mp3"
        },
        {
            "title": "Shared Planet",
            "datePublished": "Tue, 16 Sep 2014 10:30:00 +0000",
            "description": "Shared Planet - Ground Nesting Birds\nGround nesting birds such as terns are particularly vulnerable to being disturbed. People are increasingly accessing the countryside for all sorts of recreation from walking and mountain biking to bird watching and photography. Is disturbance really a problem for wildlife? And how can we limit the effect while still encouraging fun and healthy ways to spend our time. Monty Don asks whether dog walkers and ground nesting seabirds can share the same space and it seems yes, if the birds can make a choice.",
            "length": "26656000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02rwr0h.mp3"
        },
        {
            "title": "Gossip From The Garden Pond",
            "datePublished": "Sun, 14 Sep 2014 18:45:00 +0000",
            "description": "Ep 2 of 3:\nIn the second of three tales written by Lynne Truss, the Water Boatman (Sandi Toksvig) and the Great Diving Beetle (David Ryall) reveal the funny side of life in a garden pond. \nProducer: Sarah Blunt",
            "length": "26608000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02rwtl8.mp3"
        },
        {
            "title": "Shared Planet - Giant Otters",
            "datePublished": "Tue, 09 Sep 2014 10:30:00 +0000",
            "description": "The fate of the Pantanal rests largely in the hands of Brazil's emerging economy. Monty Don explores the future of the Pantanal and its resident the giant otter.\nProducer: Mary Colwell",
            "length": "26752000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02rwsxq.mp3"
        },
        {
            "title": "Gossip From The Garden Pond",
            "datePublished": "Mon, 08 Sep 2014 11:44:00 +0000",
            "description": "Ep: 1 of 3\nIn the first of three tales written by Lynne Truss, the Tadpole (Julian Rhind-Tutt) and the Dragonfly (Alison Steadman) reveal the funny side of life in a garden pond.\nProducer: Sarah Blunt",
            "length": "26592000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02rws9b.mp3"
        },
        {
            "title": "Penguin Post Office Ep5",
            "datePublished": "Fri, 05 Sep 2014 13:00:00 +0000",
            "description": "In the final programme in the series, wildlife cameraman and narrator Doug Allan joins a film crew on Goudier island to film leopard seals hunting Gentoo penguins, but in Antarctica nothing is ever guaranteed!\nProducer: Sarah Blunt",
            "length": "12944000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02rwrcm.mp3"
        },
        {
            "title": "Penguin Post Office Ep4",
            "datePublished": "Thu, 04 Sep 2014 13:00:00 +0000",
            "description": "Life is tough not only for a colony of Gentoo penguins on a tiny island in Antarctica, but also for the team who are filming their lives. Narrator Doug Allan.\nProducer: Sarah Blunt",
            "length": "12944000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02rwv4x.mp3"
        },
        {
            "title": "Penguin Post Office Ep3",
            "datePublished": "Wed, 03 Sep 2014 13:00:00 +0000",
            "description": "With their ship locked in ice a film crew attempt to walk across the frozen Antarctic waters to film a colony of Gentoo penguins on a tiny island. Narrator cameraman Doug Allan.\nProducer: Sarah Blunt",
            "length": "12944000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02rwqqq.mp3"
        },
        {
            "title": "Penguin Post Office Ep2",
            "datePublished": "Tue, 02 Sep 2014 13:00:00 +0000",
            "description": "Fierce storms and dense sea ice provide more challenges to a film crew trying to reach a tiny Antarctic island to film a colony of Gentoo penguins. Narrator cameraman Doug Allan.\nProducer: Sarah Blunt",
            "length": "12944000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02rwymm.mp3"
        },
        {
            "title": "Shared Planet - Belugas",
            "datePublished": "Tue, 02 Sep 2014 10:30:00 +0000",
            "description": "As demand for oil continues to increase conflict with wildlife is inevitable. Monty Don explores this in the context of a population of beluga whales in Canada's St Lawrence River.\nProducer: Mary Colwell",
            "length": "26720000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02rwsg3.mp3"
        },
        {
            "title": "Penguin Post Office Ep1",
            "datePublished": "Mon, 01 Sep 2014 13:00:00 +0000",
            "description": "Wildlife cameraman Doug Allan narrates the first of five programmes following the adventures of a film crew who travel to Antarctica to film a colony of Gentoo penguins.\nProducer:  Sarah Blunt",
            "length": "12896000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02rwt0p.mp3"
        },
        {
            "title": "The Listeners Srs 2",
            "datePublished": "Tue, 19 Aug 2014 10:30:00 +0000",
            "description": "Ep 3 of 3: Listening is about more than hearing as we discover with four individuals for whom listening is very much the focus of their lives. \nPresented by Matthew Watson.\nProduced by Sarah Blunt.",
            "length": "26592000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02rwsjq.mp3"
        },
        {
            "title": "Living World: Guillemots of Skomer",
            "datePublished": "Sun, 17 Aug 2014 06:00:00 +0000",
            "description": "Skomer Island lies off the south east coast of Wales and is home to thousands of seabird.\nIn the early decades of the 20th Century there were 100,000 guillemots on Skomer, but numbers plummeted to just 2000 after the second world war, probably due to oil pollution in the sea.\nNow numbers are slowly recovering with the current estimated to be around 25,000; but the increase in storms may be a problem for them in the future.\nProfessor Tim Birkhead from Sheffield University has led a 42 year study of the birds and reveals some of their secrets.\nProduced and presented by Mary Colwell.",
            "length": "20960000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02rwzk2.mp3"
        },
        {
            "title": "The Listeners Srs 2",
            "datePublished": "Tue, 12 Aug 2014 10:30:00 +0000",
            "description": "Ep 2 of 3: Listening is about more than hearing as we discover with people who listen to sounds. \nPresented by Matthew Watson.\nProduced by Sarah Blunt.",
            "length": "26640000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02rwrgb.mp3"
        },
        {
            "title": "Living World: Green Hairstreak",
            "datePublished": "Sun, 10 Aug 2014 06:00:00 +0000",
            "description": "The Green Hairstreak butterfly is small, bright green and feisty. The males fight for females, spiralling in the air at break neck speed. This lovely butterfly was not recorded in the Pentland Hills, south of Edinburgh, until 20 years ago but now populations are being discovered in more and more places. Sensitive management is helping bring back this bright jewel to the bilberry and heather clad hills. By excluding sheep and letting gorse and bilberry grow together the right conditions now exist. Green Hairstreak only appear on the wing in May and Victor Partirdge takes Mary Colwell to see where he first spotted them in the Pentland Hills. \nProduced and Presented by Mary Colwell",
            "length": "20768000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02rws5v.mp3"
        },
        {
            "title": "The Listeners Srs 2",
            "datePublished": "Tue, 05 Aug 2014 10:30:00 +0000",
            "description": "Ep 1 of 3:  Professional listeners reveal how there's far more to listening than hearing. \nPresented by Matthew Watson\nProduced by Sarah Blunt",
            "length": "26640000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02rwvp2.mp3"
        },
        {
            "title": "Living World: The Rock Iguana",
            "datePublished": "Sun, 03 Aug 2014 06:00:00 +0000",
            "description": "In the second programme from the Turks and Caicos islands, Tom Heap meets up with marine biologist Mark Parrish to look at the problems facing the critically endangered Rock Iguana.\nMark Parrish is a marine biologist who runs a local eco-tourism business. He tells Tom Heap about the problems facing this critically endangered species, particularly the tendency of feral cats to predate on the young lizards. Cats have been spotted crossing onto the island but the warden Alex Williams is determined to keep the local population safe. He takes Tom to see Rocky, the dominant male, his harem of mates and the young challenger to his crown. \nPresented by Tom Heap \nProduced by Alasdair Cross",
            "length": "21024000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02rwpqd.mp3"
        },
        {
            "title": "Shared Planet: National Parks",
            "datePublished": "Tue, 29 Jul 2014 10:30:00 +0000",
            "description": "The term National Park can be applied to different types of areas depending on where they are situated, some have more protection for wildlife than others. In the United States the traditional National Parks such as Yellowstone or Yosemite enjoy a high level of protection with many restrictions on what people can do. Contrast that with British National Parks which are working landscapes with villages, farms and even industry. \nIn this week's Shared Planet Monty Don looks at where wildlife fits into this complex mix of wilderness and human activity. In reality how do these much-loved protected areas work for wildlife? Beautiful scenery does not necessarily equal abundant wildlife. And in more human centred National parks, do our needs override those of animals and plants. In the Cairngorms National park plans are underway to build 15000 houses and Loch Lomond has given the go ahead for a gold mine.\nProduced by Mary Colwell",
            "length": "26448000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02rwv0w.mp3"
        },
        {
            "title": "Living World: Pygmy Boa Constrictor",
            "datePublished": "Sun, 27 Jul 2014 06:00:00 +0000",
            "description": "In the first of two programmes from the Turks and Caicos Islands, Tom Heap joins local naturalist Bryan Naqqi Manco for a night safari in search of the Caicos pygmy boa constrictor.\nPresented by Tom Heap.\nProduced by Alasdair Cross.",
            "length": "20912000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02rwpy0.mp3"
        },
        {
            "title": "Shared Planet: Zoos In The Wild",
            "datePublished": "Tue, 22 Jul 2014 10:30:00 +0000",
            "description": "Ep 8 of 30: As more land is developed for industry and housing or converted to produce food the areas we have fenced off for nature are increasingly important. But are the worlds nature reserves essentially made into a fortress to protect the area from development able to function on their own, or do they need constant management. Are they \"zoos in the wild\". Monty Don hears from Hluhluwe-iMfolozi Park in South Africa, the reserve that helped replenish Southern Africa's white rhinoceros population and finds out whether size really does matter for our protected areas. \nProducer: Brett Westwood",
            "length": "26672000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02rwry9.mp3"
        },
        {
            "title": "Shared Planet: Urban Wildlife",
            "datePublished": "Tue, 15 Jul 2014 10:30:00 +0000",
            "description": "Ep 7 of 30:  Wildlife in urban areas can be surprisingly diverse – particularly when neighbouring more natural areas. Can the urban jungle actually be better than some rural areas for bees and birds? In this episode Monty Don hears from scientists working to find out just how important our urban areas are for wildlife. \nPresented by Monty Don and produced by Brett Westwood.",
            "length": "26880000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02rx2n1.mp3"
        },
        {
            "title": "Shared Planet: Overland Migration",
            "datePublished": "Tue, 08 Jul 2014 10:30:00 +0000",
            "description": "Ep 6 of 30:  Overland migrations of terrestrial mammals form some of the most impressive natural spectacles in the world. But humans have been making it more and more difficult for animals to move long distances overland. Roads and railways cause mortalities, fences block the way, growing towns and cities disrupt routes. Monty Don hears from projects in the USA designed to help the pronghorn antelope continue on its lengthy migration and how a road planned for the Serengeti might affect the wildebeest migration.\nPresented by Monty Don.\nProduced by Brett Westwood.",
            "length": "26336000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02rwsr6.mp3"
        },
        {
            "title": "Shared Planet: Hector's Dolphin",
            "datePublished": "Tue, 01 Jul 2014 10:30:00 +0000",
            "description": "Ep 5 of 30: Hector's dolphin is the world smallest marine cetacean and one of the most endangered. It's a shallow water specialist endemic to New Zealand that shares its space with commercial and recreational fishing. In this episode of Shared Planet Monty Don finds out why Hector's dolphin is so vulnerable and what's being done to protect it. \nProduced by Mary Colwell",
            "length": "26496000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02rx0fc.mp3"
        },
        {
            "title": "Shared Planet: Conservation Triage",
            "datePublished": "Tue, 24 Jun 2014 10:30:00 +0000",
            "description": "How does the world of conservation set its priorities? Shared Planet reports from Qatar and the effort being spent to save the Spix Macaw from extinction in captivity. Occasionally, when the battle to save a species from extinction has almost been lost, the only alternative is to catch the remaining individuals to be kept safe and bred in captivity with no certainly of ever being returned to the wild. In this episode of Shared Planet Monty Don asks whether last hope fights to prevent single extinctions are viable or do we need to start prioritising conservation funding to secure the future or greater numbers of species?",
            "length": "26800000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02rwq0x.mp3"
        },
        {
            "title": "Shared Planet: The Modern Naturalist",
            "datePublished": "Tue, 17 Jun 2014 10:30:00 +0000",
            "description": "Ep 3 of 30 / Monty Don presents a special Shared Planet in front of an audience from the Hay Festival. Naturalists have always relied on and contributed to the illustrated guide book to observe and record wildlife, but is this so today? The modern naturalist has more than just books at their disposal, with field guides on mobile phones and tablet computers giving more than just words; sounds and moving pictures too. Monty Don asks whether the traditional naturalist skills are disappearing and with them the naturalist, or whether technology in an increasingly crowded world are liberating naturalists to observe and record wildlife in a different way generating a new generation of naturalists fit for the planet they share with nature.\nPresented by Monty Don.\nProducer by Mary Colwell.",
            "length": "26752000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02rwt5l.mp3"
        },
        {
            "title": "Shared Planet: Nature and the Written Word",
            "datePublished": "Wed, 11 Jun 2014 11:02:00 +0000",
            "description": "Ep 2 of 30 / Monty Don presents a special Shared Planet in front of an audience from the Hay Festival. Nature has always inspired writers across the generations and cultures. The natural world has been the subject, generated the characters and been there as the canvas on which the rest of the story is written. In this special edition of Shared Planet Monty Don explores the presence of the natural world in fiction and factual writing, past and present and whether any landmarks in human history change the way in which we write about the natural world around us.\nPresented by Monty Don.\nProduced by Mary Colwell",
            "length": "26800000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02rwr8h.mp3"
        },
        {
            "title": "Shared Planet: Disclosure",
            "datePublished": "Tue, 03 Jun 2014 10:30:00 +0000",
            "description": "Monty Don explores the difficulties in keeping secrets and the effects of secrecy on rare orchids and rhinos. For the lady's slipper orchid in England, reduced to a single plant, secrecy was considered the only solution for many years, but when collectors discovered its site, conservation strategy changed. Rhinos, like other creatures with a price on their heads are very vulnerable and even in the 21st century; secrecy still plays a part in their conservation.",
            "length": "26720000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02rx281.mp3"
        },
        {
            "title": "A Shell Nesting Bee",
            "datePublished": "Sun, 18 May 2014 06:00:00 +0000",
            "description": "Solitary bees build their nests in some interesting places, but none more so than Osmia bicolor, a mason bee that's preferred real estate is the empty shells of snails. Emerging in spring a few weeks after the males, the mated female spends two days lining and provisioning the shell before laying her eggs and sealing the shell. But she's not finished yet. Perhaps to prevent hungry predators in search of its original slimy occupant from destroying her nest, the snail bee hides the shell under a wigwam of twigs and sticks. Join presenter Trai Anfield and naturalist John Walters as they look for this pioneering little bee on the chalk hillsides above Cerne Abbas.",
            "length": "20688000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02rwr6f.mp3"
        },
        {
            "title": "Living World - Springtime in the Hazel Coppice",
            "datePublished": "Sun, 11 May 2014 06:00:00 +0000",
            "description": "The ancient tradition of coppicing, the periodic cutting of trees and allowing the stumps to regrow, was once common throughout lowland Britain but has been on the wane since the late 1800's. The mosaic habitat of coppiced woodland provides opportunities for a wide variety of wildlife to thrive. With more light reaching the forest floor, recently cut areas are awash with springtime flowers. As the trees regrow they provide habitat for the sleepy and secretive dormouse and many woodland butterflies. Presenter Chris Sperring visits a traditionally managed hazel coppice in Dorset and is joined by coppicer David Partridge and botanist Andy Byfield.",
            "length": "20704000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02rwyz2.mp3"
        },
        {
            "title": "Living World - Adders of Loch Lomond",
            "datePublished": "Sun, 04 May 2014 06:00:00 +0000",
            "description": "On the eastern edge of Loch Lomond adders are preparing for another summer. Spring-time sun has coaxed them from their winter hibernacula and as the weather warms males have begun to look for potential mates. The adder is one of the most studied and yet misunderstood British animals. With distinct markings and predictable habits individual adders can be tracked for years by the people who know how, exposing their mysterious behaviours. Yet adders are still despised by some, unaware that their docile and cautious nature makes the risk of their painful, but very rarely dangerous, bite very small. Trai Anfield joins Chris McInerny on a showery, but warm early April morning to seek out these beautiful and captivating reptiles. \nProduced by Ellie Sans",
            "length": "20944000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02rwvdv.mp3"
        },
        {
            "title": "Living world - Mendip Voles",
            "datePublished": "Sun, 27 Apr 2014 06:00:00 +0000",
            "description": "Chris Sperring this week joins Dr Fiona Mathews, Senior Lecturer in Mammalian Biology at Exeter University on a quest to unravel the secrets behind one of the most abundant if secretive mammals in the UK – the vole. At nearly 1000 feet above sea level, the Mendip Hills is a hotspot for both field and bank voles and as Chris and Fiona set out to see a vole for themselves it proves much harder than they think. Despite an estimated population of 75 million field voles in the UK these animals lead a precarious and all too brief life. Living for just a few months voles are prolific breeders and populations can fluctuate up to tenfold on a three to four year cycle which can have drastic effects on the species which prey on them including arguably Britain's most loved bird, the barn owl.",
            "length": "20800000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02rwsvl.mp3"
        },
        {
            "title": "Nature: Bigfoot - Not a Bear",
            "datePublished": "Tue, 18 Mar 2014 11:30:00 +0000",
            "description": "A \"Nature\" with a bit of a difference. Instead of looking at rare species and conservation measures, this week's programme focuses on perhaps the most elusive (if not non-existent) creature of all – Bigfoot, the supposed ape like or hominid creature that people believe lives in the North West of the United States. With reports of sightings of strange man-like beasts that go back as far as 1920 if not stretching back into the 18th century, and the 1967 film shot at Bluff Creek in California, there's as much interest in finding evidence of Bigfoot today as there's ever been amongst those convinced of its existence. But rebuffs of misidentification, assumption and hoaxes abound. \nInvited to the annual Beachfoot Camp 2013, BBC journalist Matthew Hill hears of Bigfoot encounters from people who've had experiences across decades and heads out with Bigfoot researchers with the latest technology in their quest to be the ones to capture that one piece of vital indisputable evidence.",
            "length": "26880000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02rwq9h.mp3"
        },
        {
            "title": "Nature: The Midland Brown Snake - Dead or Alive",
            "datePublished": "Tue, 11 Mar 2014 11:30:00 +0000",
            "description": "The Midland Brown Snake found in the eastern United States, like many snake species migrates between winter hibernation areas and summer habitat in the Spring and Autumn. In many areas, even including the more rural areas, this means having to cross roads. To this small harmless snake the length of a pencil, a tarmacadamed road surface which holds the heat seems the ideal spot to pause to raise the body temperature on that journey but is also the cause of its demise. Its size and colouration means it is effectively invisible to passing traffic. While the Midland Brown Snake is not under conservation concern, the number of snakes being killed each year is high and some populations are endemic to specific areas. Howard Stableford joins a research team in an Eastern Illinois state park to find out how they are monitoring this beautiful snake, whether dead or alive, and how their information may help other populations of this snake or other reptiles at threat from roads.",
            "length": "26944000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02rwr1c.mp3"
        },
        {
            "title": "Nature: James and the Giant Atlas Cedars",
            "datePublished": "Tue, 04 Mar 2014 11:30:00 +0000",
            "description": "In August 2013, the International Union for Conservation of Nature (IUCN) reclassified the Atlas Cedar from 'least concern' to 'endangered species'. Drought as well as local pressures from grazing, logging and pests are threatening the survival of Morocco's endemic forests of Atlas Cedars. Professional tree climber James Aldred is passionate about trees and tree climbing. It's not so much the technical challenges of climbing that James enjoys but the opportunity to explore the character, structure and ecology of the tree. James travels to Morocco to explore these ancient forests and reflect on the challenges facing them. He also finds a suitable tree to climb and sleep in overnight. From his tree top hammock, he watches a spider abseiling on its silken thread and hears owls calling through the darkness. He wakes before sunrise and climbs to the top of the tree to look out across this vast ancient forest in the early morning light. It’s an unforgettable experience.",
            "length": "26624000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02rwt1f.mp3"
        },
        {
            "title": "Living World - Crossbills",
            "datePublished": "Sun, 02 Mar 2014 07:00:00 +0000",
            "description": "Crossbills are finches with large heads and bright colours: the males are red and the females are olive green. What makes them so unusual is that the tips of their beaks are crossed over; allowing them to rip into pine cones and extract the seeds. Different species of crossbills have different sized bills, which have evolved in association with the species of cones they eat. The Common Crossbill is found across the UK all year round and its numbers have been boosted by the planting of commercial conifers such as pine and larch. A real prize for birdwatchers is the larger and much rarer Parrot Crossbill, which has a very deep bill and can tackle the biggest and thickest cones. Presenter Trai Anfield and ornithologist Ian Newton, who has studied the movements of crossbills, take the rare opportunity to track down this flock, which probably irrupted from the breeding forests in Scandinavia.",
            "length": "21088000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02rwvb6.mp3"
        },
        {
            "title": "Nature: Bewitched by Dragonflies",
            "datePublished": "Tue, 25 Feb 2014 11:30:00 +0000",
            "description": "In 1985, a dragonfly landed on Ruary Mackenzie Dodds. Up until this time, he had never had much interest in insects, but so astonished and bewitched was he by \"this beautiful\" insect which had landed on his shirt, that he decided to find out more about dragonflies and in time that led to the founding of The Dragonfly Project to enthuse and educate people about dragonflies. In August 2013, Ruary 'handed over the baton' of the Dragonfly Project to The British Dragonfly Society who will continue this work alongside their own work to conserve dragonflies and their wetland habitats, but Ruary's eagerness to share his enthusiasm for these insects continues \"I don't know what it is about dragonflies ... they absolutely electrify me ... I get so excited when I see them in the air\". In this programme, Ruary searches for dragonflies and their larvae amongst the reeds and watery places of Wicken Fen in Cambridgeshire and offers a fascinating insight into their lives. \nProducer Sarah Blunt",
            "length": "26640000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02rws3m.mp3"
        },
        {
            "title": "Living World - A Starling Eruption",
            "datePublished": "Sun, 23 Feb 2014 07:00:00 +0000",
            "description": "Each year the reedbeds of the Somerset Levels become the winter home for hundreds of thousands of starlings. Making their way from across the UK and Europe these birds have found a safe haven to roost with plenty of food nearby. The famous evening murmuration, fantastic formations of huge flocks of starlings coming in to roost, brings hundreds of visitors to the levels each winter. But far fewer people see the spectacle of the dawn eruption when the starlings take off en masse to start their day foraging in the surrounding fields. Simon Clarke of Natural England talks Trai Anfield through the spectacle on Shapwick Heath. When it is all over and three quarters of a million starlings have departed for the day, thoughts turn to the reedbed and the effect the presence of so many birds has on their winter roost site and the animals they share it with.",
            "length": "21152000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02rwvr3.mp3"
        },
        {
            "title": "Nature: In search of Humpback whales",
            "datePublished": "Tue, 18 Feb 2014 11:30:00 +0000",
            "description": "Every year between January and April, Humpback whales from all around the North Atlantic Ocean gather in an area called Silver Bank 100km north of the Dominican Republic to breed. After calving, the whales migrate north from these lower latitudes to their high latitude, summer feeding grounds. \nIn June, wildlife sound recordist Chris Watson travelled to Husavik on the north coast of Iceland where he joined a whale watching trip to look for Humpback whales on their feeding grounds – and perhaps even see some of the same animals which he had recorded on their breeding grounds earlier in the year. \nProducer Sarah Blunt",
            "length": "26672000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02rwsx1.mp3"
        },
        {
            "title": "Living World - Long-tailed Tits: The Winter Flock",
            "datePublished": "Sun, 16 Feb 2014 07:00:00 +0000",
            "description": "Seeing a flock of black and white striped, powder puff pink flanked long-tailed tits bouncing through the grey and brown winter landscape is a cheering sight. Scruffy and bandit faced they are often heard before they are seen with piping calls to keep the flock together. Charging around in family groups these diminutive birds will spend the coldest winter nights roosting together, lined up along a branch jostling for the best position. Naturalist John Walters takes Chris Sperring to the southern fringes of Dartmoor to introduce him to one particular family group.",
            "length": "20784000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02rwtty.mp3"
        },
        {
            "title": "Nature: Arctic terns at 66 Degrees North",
            "datePublished": "Tue, 11 Feb 2014 11:30:00 +0000",
            "description": "In the second of three programmes recorded in Iceland, wildlife sound recordist Chris Watson goes in search of Arctic Terns, which travel here from Antarctica to breed; the longest regular migration of any animal. Chris takes a 3 hour ferry journey from the mainland to the island of Grimsey which lies on the Arctic Circle to record some of these remarkable migrants. Scientists are becoming increasingly concerned about the number of breeding colonies which have failed in Iceland in the past decade and Chris hears about the reasons why and what steps need to be taken to help the situation. \nProducer Sarah Blunt",
            "length": "26672000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02rwv2y.mp3"
        },
        {
            "title": "Living World - Lepidopteran Winter",
            "datePublished": "Sun, 09 Feb 2014 07:00:00 +0000",
            "description": "Each year Britain's butterflies and moths attempt to make it through the cold, dark and often wet winter months. Some species will spend the winter as eggs, others as caterpillars or pupae but some get a head start on the spring flowers by spending the winter as adults. Being at their largest and most conspicuous in a time of hunger for many insectivorous predators, is a risky strategy for butterflies. Richard Fox of butterfly conservation explains how Lepidoptera pass the winter months and takes presenter Chris Sperring to a winter hideaway for a group of adult peacock butterflies, which have some surprising strategies to keep predators at bay.",
            "length": "20944000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02rwsl8.mp3"
        },
        {
            "title": "Nature: Islands of Ice and Fire",
            "datePublished": "Tue, 04 Feb 2014 11:30:00 +0000",
            "description": "In the first of new series of NATURE, we join wildlife sound recordist Chris Watson in Iceland. When it comes to dynamic landscapes, there's perhaps nowhere in the world more exciting than Iceland; with its vast groaning glaciers, spouting geysers, thundering glacial waterfalls, hissing thermal vents and erupting volcanoes – and it's the sounds of this landscape which Chris is keen to capture.\nProduced by Sarah Blunt",
            "length": "26672000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02rwsrp.mp3"
        },
        {
            "title": "Living World - Grey Seals of Blakeney",
            "datePublished": "Sun, 02 Feb 2014 07:00:00 +0000",
            "description": "A small group of female grey seals first chose the naturally managed sand spit Blakeney Point, on the North Norfolk coast as spot to haul out and give birth to their pups back in 2001. That year twenty-five pups were born and since then the new colony has grown year on year.  Twelve years after the first pups were born at Blakeney the colony is thriving. By the end of December 2013, over fourteen hundred pups had been born with more on the way. Although delighted with the success of the new residents this burgeoning population has led to major challenges for the landowner, the National Trust to keep both the grey seals and the curious public safe from one another.\nTo add to the challenge early December saw the biggest tidal surge in 60 years hit the north Norfolk, inundating many of the nature reserves along the coastline, including Blakeney.\nPresenter, Trai Anfield goes to Norfolk to see how well the Blakeney grey seals weathered the surge and to witness the drama.",
            "length": "20848000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02rx29j.mp3"
        },
        {
            "title": "Shared Planet - 28 Jan 14 - Ocean Governance",
            "datePublished": "Tue, 28 Jan 2014 11:30:00 +0000",
            "description": "In today's Shared Planet we ask who is responsible for the life in the ocean? Featuring a field report from Scotland, Monty Don explores the problems faced by life trying to compete with us for resources in an area with little or no regulation. The Isle of May is home to a quarter of a million seabirds in the breeding season, yet come the winter months most disperse out to the open sea to spend weeks at the mercy of storms and cold weather. The birds need a rich food supply to survive, yet the fish stocks and all other life in the sea is at the mercy of humanity. Suffering from what is known as \"The Tragedy of the Commons\", no one owns the oceans and therefore no one has responsibility for them, they are open to exploitation from many nations. Can the seabirds, whales, dolphins, turtles and all the other life that lives in the open ocean be protected? And if so by whom?",
            "length": "26816000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02rwrfy.mp3"
        },
        {
            "title": "Shared Planet - 21 Jan 14 - Medicinal Planet",
            "datePublished": "Tue, 21 Jan 2014 11:30:00 +0000",
            "description": "Many commercially available medicines today can trace their origins to compounds found in the natural world, yet many of those natural compounds are found in rare species, often in natural environments that are now vulnerable due to human activity. Are we in danger of losing these potentially valuable resources before they are even discovered? Monty Don explores this question through a field report from the Elan Valley in mid Wales where a tree lungwort, ravished by pollution and climate change, could provide a potential cure for Creutzfeldt-Jakob disease in humans. With increased pressure from human activities in natural areas, what can be done now to ensure the survival of the unknown for future generations?",
            "length": "26704000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02rwz8l.mp3"
        },
        {
            "title": "Shared Planet  - 14 Jan 14 - Community Protection",
            "datePublished": "Tue, 14 Jan 2014 11:30:00 +0000",
            "description": "Worldwide, with an increasing human population using more and more natural resources, it is often local people and local communities who are the first to notice when something is out of balance in the natural world. In Britain it was otter hunt records that first led to the realisation that otter numbers were in steep decline in the late 1950's. So how much influence can a local community have in protecting a species for the benefit of the wider community? In this programme Monty Don explores this question through a field report looking at the decline in Napoleon wrasse around the coral reefs of Palau after commercial fishing arrived from other parts of Micronesia in the 1980's. Local fishermen noticed the wrasse were disappearing and brought about their own initiatives to protect the species.",
            "length": "26688000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02rwt3w.mp3"
        },
        {
            "title": "Shared Planet - 07 Jan 14 - Deer Management",
            "datePublished": "Tue, 07 Jan 2014 11:30:00 +0000",
            "description": "It is estimated that in the United Kingdom, numbers of certain deer species in our countryside has almost tripled in the last 20 years. Deer are possibly the most likely mammal we are ever likely to see in the wider countryside. However in many areas deer are blamed for destroying crops and woodland, and the booming populations will fuel concerns they are having a harmful impact on other wildlife. Add to this an increasing human population pushing ever deeper into deer habitat, are we at a point whereby the management of deer in Western Europe has become a critical issue? Monty Don explores this question a field report looking at the damage deer can do in our increasingly urbanised landscape.",
            "length": "26816000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02rwz0j.mp3"
        },
        {
            "title": "Shared Planet - 31 Dec 13 - Do We Care Too Much About Nature?",
            "datePublished": "Tue, 31 Dec 2013 11:30:00 +0000",
            "description": "\"Do we care too much about nature?\" This is the question we will be asking in a special edition of Shared Planet recorded with a live audience in the Great Hall at the University of Bristol. Together with questions asked by Shared Planet listeners and members of the public in the audience Monty Don hosts two guests John Burton, Chief Executive Officer of The World Land Trust and Hannah Stoddart, Head of the Economic Justice and Policy team at Oxfam GB. And of course Shared Planet correspondent Kelvin Boot will make an appearance.",
            "length": "26688000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02rwtm4.mp3"
        },
        {
            "title": "Shared Planet - 24 Dec 13 - Are There Too Many People For Wildlife to Thrive?",
            "datePublished": "Tue, 24 Dec 2013 11:30:00 +0000",
            "description": "\"Are there too many people on earth for wildlife to thrive?\" This is the question we will be asking in a special edition of Shared Planet recorded with a live audience in the Great Hall of the University of Bristol. Together with questions asked by Shared Planet listeners and members of the public in the Great Hall, Monty hosts guests Fred Pearce, an environment writer and author of The Last Generation: How nature will take her revenge for climate change and Kieran Suckling, Executive Director of the Center for Biological Diversity. And of course Shared Planet correspondent Kelvin Boot will make an appearance.",
            "length": "26560000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02rwstl.mp3"
        },
        {
            "title": "Shared Planet - 17 Dec 13 - Noise in the Environment",
            "datePublished": "Tue, 17 Dec 2013 11:30:00 +0000",
            "description": "Does human produced noise remove us from the natural world? Monty Don explores this question through the difficulty of hearing natural sounds in the countryside.",
            "length": "26736000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02rwvt4.mp3"
        },
        {
            "title": "Shared Planet - 10 Dec 13 - Eco-Tourism",
            "datePublished": "Tue, 10 Dec 2013 11:30:00 +0000",
            "description": "Humans in the form of scientific research or for artistic endeavour have for centuries travelled the world in search of new landscapes and places. It was not until the arrival of cheap air travel in the 1970's that far flung remote areas became accessible to anyone. Seeing and engaging with a wild landscape or animal has been shown to improve our desire to protect nature. But as the sheer numbers of people travelling to see wildlife spectacles increases, is it possible that the wildlife they have come to see may be changing their behaviour in response to this pressure. This week's field report comes from a whale and dolphin watching trip in the Azores where tourist boats head off in search of a once in a lifetime wildlife spectacle.",
            "length": "26576000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02rwzbm.mp3"
        },
        {
            "title": "Shared Planet - 03 Dec 13 - Ocean Pollutants",
            "datePublished": "Tue, 03 Dec 2013 11:30:00 +0000",
            "description": "Sea lions in California are developing cancer and the most likely cause is pollution in the ocean. As world population grows and demands on agriculture increase, can we control the amount of damaging chemicals entering rivers and then being taken into the sea? Monty Don explores the problems of keeping our coastal waters free of toxins with. Can we grow food and control disease while still protecting wildlife?",
            "length": "26704000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02rwrdv.mp3"
        },
        {
            "title": "Shared Planet - 26 Nov 13 - Wildlife Conflict",
            "datePublished": "Tue, 26 Nov 2013 11:30:00 +0000",
            "description": "As human population grows there is increasing conflict between people and nature. Competition for space and resources is intense in many areas and increasingly some species are regarded as pests when they raid crops, damage forestry or compete with us for game. Identified as one of the greatest challenges for conservation in the 21st Century, solutions are actively being sought. Whether it is living with big cats, birds of prey or reptiles, solutions will require conservationists to sit down with those who want to eradicate unwanted wildlife and be willing to accept compromise. Monty Don explores where the hotspots are, what is happening to broker solutions and what the future looks like in an increasingly crowded world.",
            "length": "26432000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02rwsc6.mp3"
        },
        {
            "title": "Living World - Barnacle Geese of Caerlaverock",
            "datePublished": "Sun, 24 Nov 2013 07:00:00 +0000",
            "description": "After a long summer spent raising their young in the Arctic, barnacle geese need a safe place in warmer climes to fatten up before the breeding season begins again. Every winter the whole population of Svalbard barnacle geese make their way to one place in the UK; the Solway Firth on the west coast of Scotland. One of the best places to see them is the Wildfowl and Wetland Trust centre at Caerlaverock. Each day the barnacle geese gorge themselves in the fields around the centre. Just before dusk, quiet falls over the feeding birds, signalling it is time to return en masse to roost in the salt flats out of the way of opportunistic predators. Presenter Trai Anfield joins Brian Morrell to find out how their long journey has affected them and witness this incredible spectacle.",
            "length": "20976000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02rwpxd.mp3"
        },
        {
            "title": "Shared Planet - 19 Nov 13 - Traditional Societies",
            "datePublished": "Tue, 19 Nov 2013 11:30:00 +0000",
            "description": "Traditional societies and the wildlife that depends on them are disappearing.  Can we preserve these fragile species?  Or is the pressure to develop too great in our world?  This week's field report comes from Ethiopia where one of the most endangered birds in the world, the Ethiopian Bush Crow, teeters on the verge of extinction as the traditional societies they rely upon disappear. This beautiful bird needs a particular regime of grazing and scrub to survive, but the societies that provide the right habitat are fast disappearing as development and modernisation takes over.   Monty Don explores, with renowned writer Jared Diamond, the value of traditional societies and what we lose when they finally vanish.",
            "length": "26592000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02rwrs5.mp3"
        },
        {
            "title": "Living World - Winged Buffet",
            "datePublished": "Sun, 17 Nov 2013 07:00:00 +0000",
            "description": "Every autumn Spurn Point National Nature Reserve is inundated with small migrating birds from continental Europe. Exhausted from their journey across the North Sea blackbirds, redwings, stonechats and other small birds make easy picking for one of the UK's most charismatic birds of prey. Also the smallest falcon in the UK, merlin are dynamic and quick - blink and you'll miss them as they dash past on the hunt.\nChris Sperring meets Peter Wright, former head ranger of the Yorkshire Dales National Park and an expert in merlin having studied them in their upland breeding habitat for many years. Chris and Peter join Andy Gibson, the Outer Humber officer for the Yorkshire Wildlife Trust who shows them what attracts merlin - and other birds of prey to Spurn Point National Nature Reserve.",
            "length": "20944000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02rwvj0.mp3"
        },
        {
            "title": "Shared Planet - 12 Nov 13 - Sequoia: Nowhere to go",
            "datePublished": "Tue, 12 Nov 2013 11:30:00 +0000",
            "description": "Climate change is causing some National parks in America to re-think their boundaries. As the earth warms many species try to move to cooler climates but national parks are rooted in one place. The Sequoia National Park in California runs mainly east-west but now plans are being formed to shift it to run north-south, allowing species that need cooler temperatures to thrive. But in an increasingly crowded world, and with climate change continuing to change the earth, can we protect our treasured areas? Monty Don explores how climate change, national parks, wildlife and people are sharing the earth.",
            "length": "26240000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02rwpt6.mp3"
        },
        {
            "title": "Living World - Fairy Rings",
            "datePublished": "Sun, 10 Nov 2013 07:00:00 +0000",
            "description": "Both mysterious and fascinating fairy rings are steeped in mythology. In this episode of the Living World Chris Sperring accompanies fungi expert Lynne Boddy from Cardiff University to the National Botanical Garden of Wales to bust the myths and explore the little known subterranean world of fairy rings. Each ring is formed of a single individual fungus and are at their most obvious when their mushrooms appear above ground on pasture and in woodland.",
            "length": "20800000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02rwrjn.mp3"
        },
        {
            "title": "Shared Planet - 05 Nov 13 - Human Rubbish and Wildlife",
            "datePublished": "Tue, 05 Nov 2013 11:30:00 +0000",
            "description": "More and more rubbish is put in landfill every year. Can rubbish tips and industrial sites be modified to help wildlife thrive in an increasingly crowded and consumerist world? The UK produces more than 100 million tonnes of rubbish annually, including 15 million tonnes of food. Much of this ends up in landfill; how can these sites be used to help wildlife? This week's field report comes from Essex, from a reclaimed landfill site which is now a wildlife haven. But is this a one-off or can it be replicated around the world? Monty Don explores the world of waste and wildlife in a world where human population is growing and consumerism increasing.",
            "length": "26816000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02rwr83.mp3"
        },
        {
            "title": "Living World - The Ivy Bee",
            "datePublished": "Sun, 03 Nov 2013 07:00:00 +0000",
            "description": "This week on the Living World Chris Sperring accompanies entomologist Richard Comont to Dry Sandford Pitts in Oxfordshire in search of a relative newcomer to the UK. Only named as a new species in 1993 and first recorded on British shores in 2001 the ivy bee (Colletes hederae) has been working its way north ever since.\nA real autumnal species the ivy bee is only active between September and November so its short year begins and ends within the space of a few weeks. As the name suggests its primary food source is the pollen from ivy blossom - the last of the year's flowers. Unlike honeybees or bumble bees the ivy bee is solitary - the female prepares a nest-hole on her own in which to lay her eggs which she will provision with ivy pollen. The ivy bee seems to be bucking the trend of general decline in bee populations and spreading northwards as its range expands. Dry Sandford Pits is one of the most northerly of its known locations. Where will it be spotted next?",
            "length": "20720000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02rwrcc.mp3"
        },
        {
            "title": "Shared Planet - 29 Oct 13 - Restriction & Choice",
            "datePublished": "Tue, 29 Oct 2013 11:30:00 +0000",
            "description": "In Australia some housing estates put restrictions on what people can do to protect koalas. They can't own dogs or cats for example and the Koala's needs are paramount. But how many people are prepared to give up lifestyle choices so that wildlife can thrive? Or are the needs and rights of people greater than those of species under threat? Monty Don explores whether people are prepared to forgo personal choice for wildlife in a world where human population is increasingly putting pressure on many species.",
            "length": "26848000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02rwsv0.mp3"
        },
        {
            "title": "Living World - Segestria Florentina",
            "datePublished": "Sun, 27 Oct 2013 07:00:00 +0000",
            "description": "In the first Living World of the autumn run, Chris Sperring travels to Exeter to find a species hidden within the walls of Exeter Cathedral. First found at the Cathedral as far back as 1890, the large tube-web spider or Segestria florentina, is the largest European spider from the Segestriidae family and one of the largest spiders found in the UK. Chris Sperring and Peter Smithers, Professor at the School of Biological Sciences at Plymouth University, go on a quest (with a surprising array of props) to find the species concealed amongst the Cathedral's gothic architecture.",
            "length": "20944000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02rwt1x.mp3"
        },
        {
            "title": "Shared Planet - 22 Oct 13 - Fragility & Niche",
            "datePublished": "Tue, 22 Oct 2013 10:30:00 +0000",
            "description": "Some wildlife is fragile and will die out if it loses particular conditions. Some butterflies need a particular rare plant, or some birds certain trees for example. This week's field report comes from the heart of England where the needs of the Duke of Burgundy butterfly are revealed, our most endangered butterfly. In an increasingly crowded world is it possible to preserve fragile wildlife with so much demand on space. Monty Don explores whether it is possible for fragile wildlife to thrive in a world where the use of land changes from one generation to another, often linked to demand from an increasing global population.",
            "length": "26864000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02rwyd7.mp3"
        },
        {
            "title": "Shared Planet - 15 Oct 13 - Soil Science",
            "datePublished": "Tue, 15 Oct 2013 10:30:00 +0000",
            "description": "Shared Planet explores the link between a growing human population and wildlife and there is no other part of the natural world that is under as much pressure as the earth's soils. We rely on them to grow healthy crops, which they can only do if they support an appropriate community of bacterial, fungal and invertebrate life. Wildlife too depends on this diverse life that thrives in the soil, everything from birds to plants to insects. The earth worm is the surprising champion of soils and an animal that looks vulnerable in the face of human population pressure.  Monty Don will be in the studio speaking with soil scientist Dr Helaina Black and soil biophysisist Professor Wilfred Otten.",
            "length": "26768000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02rwszr.mp3"
        },
        {
            "title": "The Station",
            "datePublished": "Wed, 09 Oct 2013 10:30:00 +0000",
            "description": "From a dawn solo to the thunderous roar of a midnight train, this vibrant sound portrait follows 24 hours in the life of Newcastle Central Station with recordings by Chris Watson.\nProduced by Sarah Blunt",
            "length": "26672000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02rwyy8.mp3"
        },
        {
            "title": "Shared Planet - 08 Oct 13 - Sharks",
            "datePublished": "Tue, 08 Oct 2013 10:30:00 +0000",
            "description": "Sharks are in decline across the world's oceans. It can be argued sharks have an image problem with reports of attacks on swimmers and surfers. Persecution and deliberate killing to clear areas near swimming beaches are only a contributor to shark decline. Legal fishing, by-catch and catching sharks for their fins are large contributors to shark decline. In this programme Monty Don talks to a wildlife cameraman who has filmed sharks for 20 years and recorded his observations of shark decline in his dive logs.  Dr Shelley Clarke and Professor Colin Simpfendorfer talk about the ways in which experts believe we can share the oceans with the large diverse group of fish. Plus a report from Fiji where a single living shark is allegedly worth $50,000 a year in dive tourist revenue.",
            "length": "26528000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02rwybf.mp3"
        },
        {
            "title": "Shared Planet - 01 Oct 13 - Religion & Wildlife",
            "datePublished": "Tue, 01 Oct 2013 10:30:00 +0000",
            "description": "This week Monty Don explores how religious teachings might help people get more involved in conservation. In southern India, the city of Bangalore is the third most populous city in India and one of the fastest growing. As the city expands, the nearby national park - Bannerghatta - is under pressure. People now live in the buffer zone that was designed to separate people and wildlife. Elephants now regularly damage crops and farmland as their traditional sites are settled by people.  Professor Mary Evelyn Tucker, Fazlun Khalid and Bishop James Jones join Monty to explore how religion and conservation fit together.",
            "length": "26752000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02rwpk0.mp3"
        },
        {
            "title": "Shared Planet - 24 Sept 13 - Elephant Poaching in Africa",
            "datePublished": "Tue, 24 Sep 2013 10:30:00 +0000",
            "description": "In this programme a field report from Saba Douglas-Hamilton of Save the Elephants from the Samburu National Park in Kenya. Saba sees first-hand the sight of an elephant shot for its ivory. Monty Don explores some of the wider issues in Africa with David Western, Chairman of the Africa Conservation Centre in Kenya, and speaks with Dr Peter Li, associate professor of East Asian Politics at University of Houston-Downtown.  With many commentators and scientists saying the end markets for ivory are too large to supply from legally traded ivory, what argument will save elephants from the huge market incentive to kill elephants for their ivory?",
            "length": "26640000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02rwzzd.mp3"
        },
        {
            "title": "Shared Planet - 17 Sept 2013 - Wildlife Aliens and Diseases",
            "datePublished": "Tue, 17 Sep 2013 10:30:00 +0000",
            "description": "As trade between different countries and continents increases we move more animals and plants around the world. With them go diseases that can be devastating for local wildlife.",
            "length": "26848000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02rx1qb.mp3"
        },
        {
            "title": "Shared Planet - 10 Sept 13 - Rat Eradication",
            "datePublished": "Tue, 10 Sep 2013 10:30:00 +0000",
            "description": "In this week's programme we have a field report from South Georgia where Tony Martin, Professor in Zoology at Dundee University and working with the South Georgia Heritage Trust, has embarked on a programme to remove 100% of rats on South Georgia. Human activity over the decades and centuries have inadvertently introduced Brown Rats to islands and mainlands and the rats have driven local extinctions of birds and caused havoc on many seabird populations, eating the chicks in the nest. Is the wildlife benefit worth the effort it takes to return such areas to a situation before Brown Rats were introduced?  Monty Don also speaks with environmental author Emma Marris.",
            "length": "26784000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02rx2cw.mp3"
        },
        {
            "title": "Shared Planet - 03 Sept 13 - Crops and Wildlife",
            "datePublished": "Tue, 03 Sep 2013 10:30:00 +0000",
            "description": "In this week's programme we have a field report from England with Simon Potts, Professor of Biodiversity and Ecosystem Services at Reading University. Simon Potts's research looks specifically at how effective bees and other pollinators are and their abundance in agricultural landscapes - a crucial link in food security. Monty Don explores some of the issues with Vandana Shiva in Delhi, a board member of the International Forum on Globalisation and an author of over 20 books about biodiversity, food and economies.",
            "length": "26672000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02rwtb7.mp3"
        },
        {
            "title": "Living World - Native Lime",
            "datePublished": "Sun, 18 Aug 2013 06:00:00 +0000",
            "description": "This week's Living World sees presenter Chris Sperring heading to Hampshire where with native lime tree specialist Hugh Milner they embark on a journey into the remarkable life of the UK's native lime trees. Most people's association with lime is a sticky mess on car windscreens from street planted non-native common lime. This is a hybrid of the 2 native species of lime tree in Britain, the small leaved lime and the large leaved lime. \nThe bark, or more importantly the sap from the bark is also a great delicacy for great spotted woodpeckers, who it is now believed, after drilling their holes, wait until insects become trapped in the sap to take back to their young in the nest. More surprisingly lime trees can walk across a landscape, as they have the ability to regenerate from fallen timber or if branches make contact with the ground. \nProducer: Andrew Dawes",
            "length": "20992000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02rwt75.mp3"
        },
        {
            "title": "Living World - Pine Marten",
            "datePublished": "Sun, 11 Aug 2013 06:00:00 +0000",
            "description": "This week on Living World, presenter Trai Anfield travels to mid Scotland for an encounter with one of Britain's rarest mammals, the pine marten. Here in a remote landscape she meets up with Martyn Jamieson from the Field Studies Council for a safari with a difference, can they find a female with young, high in the tree tops? \nProducer: Andrew Dawes",
            "length": "21072000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02rwrnr.mp3"
        },
        {
            "title": "Living World - Glow Worms",
            "datePublished": "Mon, 05 Aug 2013 12:38:00 +0000",
            "description": "This week on Living World, presenter Chris Sperring is in Buckinghamshire on the lookout for glow worms. Literature is full of references to these enigmatic little beetles who glow when its dark enough not to be able to differentiate colours. With Chris is Robin Scagell who has been studying glow worms for over 40 years and still gets a sense of excitement seeing one in some long grass by a lake near Little Marlow.\nWhile recording the programme, Chris witnessed a male come to a female and mate with her; something that is very rare to see in the wild.\nProducer Andrew Dawes.",
            "length": "21152000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02rwyp5.mp3"
        },
        {
            "title": "Shared Planet - 30 July 13 - What is Sustainability?",
            "datePublished": "Tue, 30 Jul 2013 10:30:00 +0000",
            "description": "In this week's programme we have a report from Gloucestershire on the waxing and waning of Eel populations. Jonathan Porritt, one of the founders of the sustainability charity Forum for the Future will be in the Shared Planet studio to explore the issues and the wider implication of sustainability and Monty also speaks with Pavan Sukhdev, founder of the GIST Advisory - a specialist consulting firm which helps governments and corporations manage their impacts on natural and human capital.",
            "length": "26800000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02rwt4t.mp3"
        },
        {
            "title": "Living World - Coquet Terns",
            "datePublished": "Mon, 29 Jul 2013 15:55:00 +0000",
            "description": "Presenter Trai Anfield travels to Coquet Island off the Northumberland coast for this week's Living World for an encounter with the rare roseate tern in its last UK breeding colony. \nProduced by Andrew Dawes",
            "length": "20960000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02rwz25.mp3"
        },
        {
            "title": "Shared Planet - 23 July 13 - Oil & Wildlife",
            "datePublished": "Tue, 23 Jul 2013 10:30:00 +0000",
            "description": "In this week's programme we have a report from the Arabian Gulf off the coast of Qatar where we witness oil rig legs encrusted with life, pods of dolphins and work monitoring the arrival of migrant whale sharks to the area. David Paterson, Executive Director of the Marine Alliance for Science and Technology for Scotland is in the Shared Planet studio to explore the issues, and macro-economist and professor of Economics, Alejandro Nadal also speaks with Monty.",
            "length": "26848000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02rwq74.mp3"
        },
        {
            "title": "Shared Planet - 16 July 13 - Living with Carnivores",
            "datePublished": "Tue, 16 Jul 2013 10:30:00 +0000",
            "description": "In this week's programme we report from India where John Aitchison revels in the sight of two tigers, who magnificent though they are, are now in effect in an island population, separated from the farmland that surrounds the Bandhavgarh National Park by an electric fence. Lion biologist Craig Packer from the University of Minnesota will be speaking to Monty about his observations in Tanzania where upward of 100 people a year are being killed by lions raiding villages.  And David Macdonald, Professor of Wildlife Conservation at Oxford University, will be exploring this area of conflict with Monty in the Shared Planet studio.",
            "length": "26912000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02rwq4d.mp3"
        },
        {
            "title": "Shared Planet - 09 July 13 - Building in Wildlife",
            "datePublished": "Tue, 09 Jul 2013 10:30:00 +0000",
            "description": "The focus is towns and cities in this week's programme, with a report from North America about their largest Swallow, the Purple Martin. Purple Martins are totally dependent on human habitation east of the Rockies for nest sites. West of the mountain range they largely nest in their ancestral way using abandoned woodpecker cavities. As we clear land to build the world's towns and cities what is the impact on the natural world and are there ideas to embrace wildlife in built environment planning? Monty speaks with leading environmentalist Chris Baines and Kate Henderson, the Chief Executive of the Town and Country Planning Association (TCPA).",
            "length": "26752000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02rwqmp.mp3"
        },
        {
            "title": "Shared Planet - 02 July 13 - Valuing Nature",
            "datePublished": "Tue, 02 Jul 2013 10:30:00 +0000",
            "description": "How much is a honey bee worth? Can you put a price tag on a mountain? Monty Don explores the value of nature. Some believe the only way to preserve nature is to show that it can pay its way in a world driven by money, others disagree saying nature is too precious to be left to the whim of markets. This week there is a report from St. Andrews in Scotland where Trai Anfield discusses the value of estuaries to both nature conversation and human activity, plus there is discussion in the studio with author Tony Juniper and Dr Bill Adams from the Department of Geography at the University of Cambridge.",
            "length": "26784000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02rwvd9.mp3"
        },
        {
            "title": "Shared Planet - 25 June 13 - Global Collapse",
            "datePublished": "Tue, 25 Jun 2013 10:30:00 +0000",
            "description": "In this week’s programme we have a report from Northern Kenya about the Grevy's Zebra, the world’s most stripy Zebra and a species in decline for many different reasons, all of which appear to be attributed with human activity. Monty interviews one of the authors of a recent paper “Can a Collapse of Civilisation be Avoided?”, Professor Paul Ehrlich from Stanford University. Also Dr Joe Smith from The Open University, an expert in environment and the media, explores how the media should keep up with such apocalyptic headlines.",
            "length": "26736000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02rwsw7.mp3"
        },
        {
            "title": "Shared Planet - 18 Jun 13 - Can We Save It All?",
            "datePublished": "Tue, 18 Jun 2013 10:30:00 +0000",
            "description": "A giant hamster in Alsace provides Monty with a puzzling dilemma, how do we decide what to conserve? With so many pressures on so many creatures and habitats how to decide where to put our energy and money is difficult. Monty Don expores the issues, do we save the creatures that appeal to us or those that are most useful? Is a beetle better to save than a hamster?",
            "length": "26576000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02rx1st.mp3"
        },
        {
            "title": "Shared Planet - 11 Jun 13 - The Problem of Population",
            "datePublished": "Tue, 11 Jun 2013 10:30:00 +0000",
            "description": "Monty Don presents Shared Planet, the series that looks at the crunch point between human population and the natural world. In this programme Howard Stableford reports from Conneticut on the complex decline of the once very ubiquitous Chimney Swift, a story Monty Don believes is the paradigm for the series. The wider issues of human population and nature are explored in the studio with Lord May, past president of The Royal Society and from Vienna, Professor Wolfgang Lutz, a specialist in human population dynamics. \n \nProduced by Mary Colwell",
            "length": "26560000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02rx2vh.mp3"
        },
        {
            "title": "Living World 19 May 13: Yuan Yang",
            "datePublished": "Sun, 19 May 2013 06:00:00 +0000",
            "description": "In traditional Chinese culture the mandarin duck is believed to bring lifelong fidelity to couples and frequently used as symbols for wedding presents or in Chinese art. Formerly abundant in their native Far East, numbers of mandarin ducks have declined due to habitat destruction (mainly logging) and over-hunting.   For this Living World, presenter Chris Sperring travels to the river Dart in Devon where starting underneath the busy A38 trunk road he meets up with naturalist John Walters who has been studying a winter roost of mandarin ducks here. In mid-winter up to 100 birds can roost here but in early spring they are beginning to pair up and disperse along the river Dart. Leaving this noisy suburban area, Chris and John then head off up the river to search for pairs of these wonderful tree ducks in the Devonian landscape.",
            "length": "20960000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02rwtk2.mp3"
        },
        {
            "title": "Living World 12 May 13: Tenby Daffodil",
            "datePublished": "Sun, 12 May 2013 06:00:00 +0000",
            "description": "For many the emergence of the daffodil is the real, true harbinger of spring. That flash of yellow across the countryside breathes vitality into a previously grey and dormant winter landscape. There are around 26,000 species of daffodil in the World, however Britain is home to a special collection of true wild daffodils; smaller and less showy than the more usual cultivated stock, but superbly adapted to survive in our cold wet climate.\nFor Living World, presenter Chris Sperring joins botanist Ray Woods in search of one such daffodil, the Tenby daffodil, the National emblem of Wales. This daffodil is unique in that it is found nowhere else on the Planet except around Tenby and southwest Wales. Most often associated with places of habitation, its origins and history are now lost in history, but by the 1800's this species was abundant in hedgerow and field.",
            "length": "20992000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02rx0d2.mp3"
        },
        {
            "title": "Living World 5 May 13: Dawn Chorus Day",
            "datePublished": "Wed, 08 May 2013 10:26:00 +0000",
            "description": "May 5th is International Dawn Chorus day and to celebrate this worldwide event presenter Trai Anfield heads to the Coombes Valley near Leek in Staffordshire to experience the emulsion of sound of a dawn chorus there.\nWell before dawn, for this special Living World, Trai Anfield meets up with Jarrod Sneyd from the RSPB. Here standing in oak woodland their sense of anticipation rises as with the first shimmers of light breaking the eastern horizon, the first pipings of the thrush family begin to break the silence. Slowly and imperceptibly more birds and different species join the awakening woods, the warblers, flycatchers and redstarts are then followed by the seed eaters until, soon after sunrise, the wood is alive with nature's choral sound. Can there be any better way to celebrate the arrival of spring.",
            "length": "21168000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02rwzrp.mp3"
        },
        {
            "title": "Living World 28 April 13: Golden Pheasant",
            "datePublished": "Sun, 28 Apr 2013 06:00:00 +0000",
            "description": "One of Britain's scarcest birds is also one of its most beautiful. The flame-coloured golden pheasant is a riot of red, orange and bronze and is native to Chinese forests. The birds are popular around the world as ornamental species and over the years have been introduced on country estates.\nBrett Westwood joins Paul Stancliffe of the British Trust for Ornithology in search of wild golden pheasants in the conifer woods of Norfolk. Here, in spite of their bright colours, they are very elusive and behave much as they do in their native China, skulking in dense undergrowth and glimpsed only as they dash across rides. As numbers in China are in decline, do our UK pheasants have an international importance? They prefer to run rather than fly and call loudly at dusk in spring, so this visit is the best chance that Paul and Brett have to see one - a bird that's one of the toughest challenges that the countryside can offer.",
            "length": "21104000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02rws01.mp3"
        },
        {
            "title": "A Natural History of Me!",
            "datePublished": "Tue, 16 Apr 2013 10:30:00 +0000",
            "description": "Paul Evans explores the human self after discovering that only one in ten cells in our bodies is human; the rest are microbial cells. So, if we're not all human, what are we? \nProduced by Sarah Blunt",
            "length": "26736000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02rx0dk.mp3"
        },
        {
            "title": "In Pursuit of Spring, Ep 3",
            "datePublished": "Sun, 31 Mar 2013 14:00:00 +0000",
            "description": "Ep 3 of 3. In the third and last programme in the series, ecologist Matthew Oates, like Thomas, ends his journey in Somerset.",
            "length": "13376000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02rwsys.mp3"
        },
        {
            "title": "In Pursuit of Spring, Ep 2",
            "datePublished": "Sat, 30 Mar 2013 16:00:00 +0000",
            "description": "Ep 2 of 3. In the second programme in the series, ecologist Matthew Oates celebrates the centenary of naturalist and poet Edward Thomas’s iconic cycle ride from South London to Somerset over Easter 1913.",
            "length": "26576000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02rwvvm.mp3"
        },
        {
            "title": "In Pursuit of Spring, Ep 1",
            "datePublished": "Fri, 29 Mar 2013 15:45:00 +0000",
            "description": "Ep 1 of 3. Edward Thomas (1878-1917) was arguably the most accomplished and profound writer of English rural prose, with a unique poetic-prose style. Over Easter 1913, Thomas set off on a cycle ride of personal self-discovery across Southern England. This journey was published in 1914 in his book \"In Pursuit of Spring\" and it remains a poignant reminder of one of our greatest countryside writers, who just a few years later would die on the battlefields of World War One.\nThroughout the series of three programmes, naturalist Matthew Oates pursues his own personal homage to Thomas by following in the literacy cycle tracks of the Edwardian writer one hundred years before.  Academic and travel writer Robert MacFarlane, an admirer of Thomas himself, will read passages from Thomas's work which illustrate the man within. \nPresented by Matthew Oates.\nProduced by Andrew Dawes.",
            "length": "13328000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02rwrbm.mp3"
        },
        {
            "title": "Who's The Pest? 19 March 13 Episode 3",
            "datePublished": "Tue, 19 Mar 2013 11:30:00 +0000",
            "description": "Ep 3 of 3. In Episode Three, Erica explores how insect technology can solve human design problems.",
            "length": "26512000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02rwrlk.mp3"
        },
        {
            "title": "Who's The Pest? 12 March 13 - Episode 2",
            "datePublished": "Tue, 12 Mar 2013 11:30:00 +0000",
            "description": "Ep 2 of 3.  In Episode Two, Erica asks whether we should be eating more insects.",
            "length": "26176000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02rwstb.mp3"
        },
        {
            "title": "Who's The Pest? 05 March 13 - Episode 1",
            "datePublished": "Tue, 05 Mar 2013 11:30:00 +0000",
            "description": "Ep 1 of 3.  They make up 80% of the species on earth, and at any time there are ten QUINTILLION of them living.  Meet the six-legged rulers of the world: INSECTS.  Entomologist Erica McAlister is known as Fly Girl to her friends.  As Curator of Flies at the Natural History Museum, she knows what remarkable, strange, and diverse animals insects are.  \nThe insect world is populated by beings with superpowers - an amazing sense of smell, lightning reflexes, the ability to fly at dizzying speed or walk on the ceiling. And these superpowers have implications for us humans - in medicine, defence, food, art and architecture. They can help us to live more healthily, more safely, more sustainably.\nIn Episode One, Erica discovers that bees' sense of smell can be used to detect explosives and disease.",
            "length": "26480000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02rx1y7.mp3"
        },
        {
            "title": "Living World 24 Feb 13: The Wolf Tracker",
            "datePublished": "Tue, 26 Feb 2013 10:38:00 +0000",
            "description": "For this week's Living World, presenter Chris Sperring goes in search of a large carnivore he's never seen before in the wild, the grey wolf. To do this he travels to Sweden where he meets up with Pierre Ahlgren a wildlife ranger in the Vastmanland area of Mid Sweden, where they are also joined by Tom Arnbom from WWF Sweden.",
            "length": "21040000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02rwsmy.mp3"
        },
        {
            "title": "Living World 17 Feb 13: Birds of the Taiga",
            "datePublished": "Tue, 26 Feb 2013 10:19:00 +0000",
            "description": "In January Sweden can be a cold and inhospitable place. Despite winter temperatures dropping to -15, southern Sweden is alive with birdlife. For this week's Living World, Chris Sperring travels to the Vastmanlan area of Sweden where the huge taiga forests begin, forests that stretch east all the way to Alaska. Travelling 40 km north of the town Vasteras he meets up with Torbjorn Hegedus a local ornithologist and Tom Arnbom from WWF Sweden to head out for the day and see what birds they come across in this snowy wooded landscape.",
            "length": "20960000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02rwr91.mp3"
        },
        {
            "title": "Living World 10 Feb 13: Tree Sparrows",
            "datePublished": "Tue, 26 Feb 2013 10:03:00 +0000",
            "description": "Living World: Tree Sparrows.  Trai Anfield heads to RSPB Old Moor reserve to seek out the Tree Sparrow; a bird which only a few generations ago was a common sight in the British countryside.",
            "length": "21088000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02rwvg0.mp3"
        },
        {
            "title": "Saving Species - 12 Feb 13: Rarities & Recordings",
            "datePublished": "Tue, 12 Feb 2013 15:52:00 +0000",
            "description": "Ep 24 of 24.  In the final episode of the current series, Saving Species looks at the Slender-billed curlew; no official confirmed records of its existence have occurred since 2001 although there have been sightings of it in 2010 but photographic evidence was not taken. Horatio Clare follows the route of the bird's migration route from its Siberian breeding grounds to the area around the Mediterranean Basin.\nKelvin Boot finds out about the threat facing many species of moths in the southern part of the UK and Kelvin Jones of the BTO gives the latest movement of the cuckoos sending signals back from Central Africa as they gear up to begin their migration back to the UK. Producer: Sheena Duncan. Presenter: Brett Westwood.",
            "length": "26960000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02rwt3j.mp3"
        },
        {
            "title": "Saving Species - 05 Feb 13: British And Arctic Mammals",
            "datePublished": "Thu, 07 Feb 2013 21:30:00 +0000",
            "description": "Ep. 23 of 24:\nThis week's edition of Saving Species looks at the introduction of quota-regulated cull of Grey Wolves in Sweden as part of plan to to genetically invigorate the currently inbred Swedish wolf population.\nMichael Scott reports on conservation efforts of the Arctic Fox in Iceland.\nPlus, the programme looks at a major project by The Mammal Society which aims to map population levels of various mammals that reside across the British Isles.",
            "length": "26992000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02rwzz5.mp3"
        },
        {
            "title": "Living World 03 Feb 13: Godwits",
            "datePublished": "Mon, 04 Feb 2013 11:15:00 +0000",
            "description": "Living World: Godwits.\nBlack-tailed godwits are an elegant long legged bird about the size of a pigeon. In the summer they are found in the arctic where the Icelandic race of this species then migrates to Britain to spend the winter in relatively warmer weather. Chris Sperring travels to the a flooded meadow near the New Forest to join Pete Potts from Operation Godwit.",
            "length": "20752000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02rx2kl.mp3"
        },
        {
            "title": "Living World 27 Jan 13: Urban Kites",
            "datePublished": "Mon, 04 Feb 2013 10:46:00 +0000",
            "description": "Living World: Urban Kites\nLiving World presented by Trai Anfield is on the outskirts of the Tyneside conurbation following red kites with Harold Dobson from Friends of Red Kites in the north east of England.",
            "length": "20864000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02rwr9b.mp3"
        },
        {
            "title": "Saving Species - 29 Jan 13: Freshwater Eels and Mitten Crabs",
            "datePublished": "Thu, 31 Jan 2013 21:30:00 +0000",
            "description": "Ep22of24. Freshwater eels are explored this week, as Sian Griffiths reports from the Ottawa River Valley in Canada where hydropower dams are disrupting the American eel's migration paths, and Brett Westwood speaks with David Bunt from the Sustainable Eel Group to discuss similar issues with European eels.  Joanna Pinnock looks the furry clawed invasive species; the Chinese mitten crab and the problems they cause for British habitats.  Also in the programme - news from around the world with our regular news reporter, Kelvin Boot.  Presenter: Brett Westwood. Producer: Sheena Duncan. Editor: Julian Hector.",
            "length": "26960000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02rwtdf.mp3"
        },
        {
            "title": "Saving Species - 22 Jan 13: Bonobos & Dragon Trees",
            "datePublished": "Thu, 24 Jan 2013 15:15:00 +0000",
            "description": "Ep21 of 24: This week Saving Species looks at Bonobos - a great ape, related to chimpanzees, and found in the forest of the Congo Basin of the Democratic Republic of Congo.  Theo Webb reports from the Salonga National Park investigating the threat from an increase in hunting for the bushmeat trade.  Also Michael Scott reports on the Dragon Tree, a native species of Madeira, the Canary Islands and Cape Verde. There are only one or two native wild dragon trees left on Madeira and Saving Species finds out from local conservationists what is being done to increase the number of trees in the wild from original seed.  Presenter: Brett Westwood. Producer: Sheena Duncan. Editor: Julian Hector.",
            "length": "26768000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02rws6f.mp3"
        },
        {
            "title": "R4 Afternoon Drama 22 Jan 13: Chapel of Skins",
            "datePublished": "Tue, 22 Jan 2013 15:00:00 +0000",
            "description": "Recorded high up in the Shropshire hills of the Welsh Marches and inspired by a living landscape, the Chapel of Skins is a fictional story about a ghostly meeting of ways. \nCAST: \nPhone Box: Paul Evans\nTrebrodier: Liza Sadovy\nAnchor: Ben Crowe\nQuabbs: Alex Tregear\nWildlife sound recordist: Chris Watson\nDirected and Produced by Sarah Blunt for BBC Natural History Unit in Bristol.",
            "length": "42016000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02rwsk0.mp3"
        },
        {
            "title": "Saving Species - 15 Jan 13: Marine Conservation Zones",
            "datePublished": "Tue, 15 Jan 2013 17:00:00 +0000",
            "description": "Ep20 of 24: Marine Conservation Zones are in the spotlight this week, as Saving Species looks at the importance of protecting our marine life.  In December it was revealed that only 31 of the 127 proposed Marine Conservation Zones (MCZs) have the chance of being implemented for the first tranche.  Kelvin Boot is live in the studio with Brett Westwood, plus Trai Anfield is in Filey Brigg in North Yorkshire to visit a zone that didn't make the cut.  There are also interviews with Matt Frost, the deputy director of the Marine Biological Association and the Environment Minister Richard Benyon.  Presenter: Brett Westwood. Producer: Mary Colwell. Editor: Julian Hector",
            "length": "26800000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02rwr4h.mp3"
        },
        {
            "title": "Saving Species - 08 Jan 13: International Wildlife",
            "datePublished": "Wed, 09 Jan 2013 10:31:00 +0000",
            "description": "Ep 19 of 24: Saving Species investigates the relationship between polar bears and the year on year reduction in sea ice in the Arctic collaborating with BBC2’s series \"The Polar Bear Family and Me\", a trio of films following a polar bear family in the Svalbard archipelago in the Arctic. Ellie Williams looks at the National Elephant Corridor Project in India which is redeveloping historical paths used by Asian elephants to travel between habitats. Plus a report from Dorset where the Game and Wildlife Trust’s Salmon and Trout Research Centre on the river Frome is located.  The centre is carrying out important research through the tagging and monitoring of salmon.  Also in the programme - news from around the world with our regular news reporter, Kelvin Boot.  Presenter: Brett Westwood. Producer: Mary Colwell. Editor: Julian Hector.",
            "length": "26752000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02rwyhc.mp3"
        },
        {
            "title": "Saving Species - 01 Jan 13: Wetland Habitats",
            "datePublished": "Tue, 01 Jan 2013 15:07:00 +0000",
            "description": "Ep 18 of 24:\nSaving Species kick's off the new year with a look at the role of wetland habitats in providing a wintering refuge for wildfowl.  \nJoanna Pinnock makes a dawn visit to Wildfowl and Wetland Trust reserve at Welney in Cambridgeshire to witness the very noisy but magical spectacle of thousands of Whooper and Bewick's swans flighting off from the pools by the reserve centre to head out to feed on the fields for the day. \nChris Sperring is on the Hampshire coast at the Lymington-Keyhaven nature reserve. It's home to important numbers of Dark-bellied Brent Geese amongst many other species of smaller ducks. The geese come to the reserve for the winter from Siberia.\nPlus, news from around the world with our regular news reporter Kelvin Boot.\nPresenter: Joanna Pinnock\nProducer: Sheena Duncan\nEditor: Julian Hector",
            "length": "26864000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02rwz0c.mp3"
        },
        {
            "title": "Saving Species - 25 Dec 12: British Overseas Territories",
            "datePublished": "Tue, 25 Dec 2012 12:00:00 +0000",
            "description": "Ep 17 of 24:\nHoward Stableford is in the chair for this Christmas Day Saving Species with a programme on conservation in some of the British Overseas Territories.\nA report from Ed Drewitt with Dr Ian Stephen about the last chance conservation effort to save the Mountain chicken frog threatened with the Chytrid fungus.\nA report about \"Team Rat\" who are planning in January 2013 to save the albatrosses and petrels that nest on South Georgia from being eaten by rodents.\nHoward looks at the establishment of marine conservation areas around the British oveseas teritories through interviews with Alistair Gammell of the PEW Fondation about and DEFRA Minister for Biodiversity, Richard Benyon.\nPresenter Howard Stableford\nProducer Mary Colwell\nEditor Julian Hector",
            "length": "26336000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02rwrzh.mp3"
        },
        {
            "title": "Saving Species - 18 Dec 12: Wildlife Art/Wildlife Gardening Forum",
            "datePublished": "Tue, 18 Dec 2012 14:02:00 +0000",
            "description": "Ep 16 of 24:\nThis week Brett Westwood looks at the increasing alliance between the arts and conservation. We hear from two artists, one a painter and one a photographer who are using their talents to help raise awareness about highly endangered species. Professor Tim Birkhead tells Brett about a growing movement - New Networks for Nature - which brings many different artists and scientists together to inspire each other. Sarah Pitt brings a report on wildlife gardening, with suggestions for wildlife friendly Christmas presents.\nAlso in the programme - News from around the world with our regular news reporter, Kelvin Boot. And we'll update you on the activities of the Open University's iSpot.\nPresenter: Brett Westwood\nProducer: Mary Colwell\nEditor: Julian Hector",
            "length": "26832000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02rwydr.mp3"
        },
        {
            "title": "Saving Species - 11 Dec 12: Rewilding/Devonshire Beavers",
            "datePublished": "Tue, 11 Dec 2012 17:57:00 +0000",
            "description": "Ep 15 of 24:\nSaving Species takes a look at what could happen if parts of the British countryside were returned to their natural state through a process known as rewilding.\nPresenter: Brett Westwood\nProducer: Sheena Duncan\nEditor: Julian Hector",
            "length": "26640000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02rx00q.mp3"
        },
        {
            "title": "Saving Species - 04 Dec 12: Scottish Species Action Framework",
            "datePublished": "Wed, 05 Dec 2012 16:21:00 +0000",
            "description": "Ep: 14 of 24\nScotland's five year Species Action Framework programme ended in March 2012. This unique programme has advanced conservation and management action for 32 of Scotland's select species - including beaver, red squirrel, sea eagle, capercaillie, freshwater pearl mussel, great yellow bumblebee and woolly willow and invasive non-native species such as North American signal crayfish. \nFor Saving Species Brett Westwood travels up to the Scottish Natural Heritage conference in Edinburgh to discuss the results of this 5 year programme with the movers and shakers in Scotlands wildlife conservation.\nPresented by Brett Westwood.\nProduced by Mary Colwell.",
            "length": "26608000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02rwqtw.mp3"
        },
        {
            "title": "Living World 02 Dec 12 - The Living Deadwood",
            "datePublished": "Sun, 02 Dec 2012 07:00:00 +0000",
            "description": "The Living Deadwood.\nTrai Anfield is in ancient woodland in North Yorkshire known for its deadwood bugs led by passionate invertebrate expert Roger Key.\nProduced by Andrew Dawes",
            "length": "21120000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02rwpzd.mp3"
        },
        {
            "title": "Saving Species - 29 Nov 12: Sausage Lichen/Turkmenistan/Hen Harriers",
            "datePublished": "Thu, 29 Nov 2012 21:30:00 +0000",
            "description": "Brett Westwood travels to the Brecon Beacons to see the a very unusual lichen.  Sausages lichen hang from tree branches as long thin strands like uncombed and sparse straggly hair. This lichen is now being spotted locations in south Wales and there are hopes its fortunes are improving as it spreads east. \nMark Day has been to The Koytendag Nature Reserve (formerly known as the Kugitang Nature Reserve, established in 1986) located in the Lebap province of Turkmenistan. The reserve is home to the globally endangered markhor, a large wild mountain goat. The hope is to bring worldwide recognition and protection for its unique landscapes, and the wealth of rare plants and animals found in Koytendag as well as bringing benefits to local communities through tourism.\nPlus wildlife news round up from Kelvin Boot.\nPresenter: Brett Westwood\nProducer: Sheena Duncan",
            "length": "26896000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02rx1rl.mp3"
        },
        {
            "title": "Living World 25 Nov 12 - Brambles",
            "datePublished": "Sun, 25 Nov 2012 07:00:00 +0000",
            "description": "Brambles.\nJames Brickell is in mid Wales with botanist Ray Woods looking at the fascinating ecology surrounding the humble blackberry.\nProduced by Andrew Dawes",
            "length": "21136000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02rwrn3.mp3"
        },
        {
            "title": "Saving Species - 20 Nov 12: Ash die back/Managing Woodlands",
            "datePublished": "Wed, 21 Nov 2012 18:41:00 +0000",
            "description": "Ep 12 of 24:\nPlant a tree in 73\" became a national slogan and very large numbers of trees have been planted over the decades since.\nAsh die back has been widely reported in many programmes, especially news, in recent weeks and in this programme we ask whether the call to plant trees and desire to create new woodlands has in any way contributed to this fungal attack on Ash trees. We also ask how serious a threat diseases are to our trees.\nAlso in the programme - News from around the world with our regular news reporter, Kelvin Boot. And we'll update you on the activities of the Open University's iSpot.\nPresenter: Brett Westwood\nProducer: Mary Colwell",
            "length": "26944000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02rx1pj.mp3"
        },
        {
            "title": "Living World 18 Nov 12 - Centipedes and millipedes",
            "datePublished": "Sun, 18 Nov 2012 07:00:00 +0000",
            "description": "Alongside Myriapod expert Steve Gregory, Living World is in Oxfordshire on the search for for centipedes and millipedes.\nPresented by Chris Sperring/Produced by Andrew Dawes.",
            "length": "21088000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02rwshh.mp3"
        },
        {
            "title": "IPOR 16 Nov 12: 5/5 The Purple Emperor",
            "datePublished": "Fri, 16 Nov 2012 14:00:00 +0000",
            "description": "In Pursuit of the Ridiculous: Ep 5/5 - The Purple Emperor\nMatthew Oates is a complete fan of the rare purple emperor butterfly but meets his match in Neil Hume, a self-confessed addict of this insectsand its favoured woods. \nProduced by Brett Westwood",
            "length": "13296000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02rwrgp.mp3"
        },
        {
            "title": "IPOR 15 Nov 12: 4/5 Slugs and Snails",
            "datePublished": "Thu, 15 Nov 2012 14:00:00 +0000",
            "description": "In Pursuit of the Ridiculous: 4/5 - Slugs and Snails\nAfter enduring a wet slug-filled summer Matthew Oates meets Mary Seddon, a biologist specialising in slugs and snails to find out why she finds the study of molluscs so compelling. \n \nProduced by Brett Westwood",
            "length": "13296000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02rwrsm.mp3"
        },
        {
            "title": "IPOR 14 Nov 12: 3/5 Rare Orchids",
            "datePublished": "Wed, 14 Nov 2012 19:53:00 +0000",
            "description": "In Pursuit of the Ridiculous: Ep 3/5 - Rare Orchids\nMost natural historians look for species, but today Matthew Oates meets botanists enthusing over some spectacular hybrid orchids with very rare parents. \nProduced by Brett Westwood",
            "length": "13248000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02rwpnp.mp3"
        },
        {
            "title": "IPOR 13 Nov 12: 2/5 Twitching",
            "datePublished": "Wed, 14 Nov 2012 19:40:00 +0000",
            "description": "In Pursuit of the Ridiculous: Ep 2/5 - Twitching\nTo outsiders, twitching can seem the most pointless of natural history activities. Matthew Oates meets Rob Lambert from the University of Nottingham to find out why he twitches. \nProduced by Brett Westwood.",
            "length": "13408000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02rx01s.mp3"
        },
        {
            "title": "IPOR 12 Nov 12 : 1/5 Water Beetle",
            "datePublished": "Wed, 14 Nov 2012 19:27:00 +0000",
            "description": "In Pursuit of the Ridiculous - Ep 1/5: Water Beetle\nIn the first of five programmes about naturalists and their pursuits, Matthew Oates goes hunting with Andy Foster, man obsessed for thirty years by a rare water-beetle. \nProduced by Brett Westwood.",
            "length": "13296000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02rwtzd.mp3"
        },
        {
            "title": "Saving Species - 13 Nov 12: Goliath Grouper/Asiatic Lion/Waxwings",
            "datePublished": "Wed, 14 Nov 2012 19:05:00 +0000",
            "description": "Reporter Mark Brazil travels to the Gir Forest National Park in India to report on the plight of the last lions in Asia. A sanctuary set up in 1972 and now holds about 400 individuals.\nThe Atlantic Goliath Grouper is a huge, majestic fish only found in significant numbers today off the coast of Florida. At up to 2.5m in lenght, they are outsized only by the few remaining sharks and they are critically endangered across their range due to historical overfishing.  Helen Scales meets her first wild goliaths in the company of Dr Sarah Frias-Torres who is studying many aspects of these huge fish including a survey of scuba divers that she hopes will show that a goliath is worth more alive than dead.\nPaul Stancliffe brings the latest information on the invasion of Waxwings in the UK.",
            "length": "26704000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02rwrrm.mp3"
        },
        {
            "title": "Living World 11 Nov 12 - The Harvestman's Garden",
            "datePublished": "Wed, 14 Nov 2012 18:44:00 +0000",
            "description": "Living World goes in search of autumn harvestmen in Yorkshire, a spider looking creepy crawly but as entomologist Paul Richards says, more closley related to a scorpion.\nPresented by Trai Anfield/Produced by Andrew Dawes.",
            "length": "20960000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02rwqc6.mp3"
        },
        {
            "title": "Living World 04 Nov 12 - The Night Island",
            "datePublished": "Wed, 14 Nov 2012 18:28:00 +0000",
            "description": "Living World, presented by Chris Sperring, looks for the Manx Shearwater and Storm Petrel with ecologist David Boyle. To find them they go to Skomer Island after dark.",
            "length": "21024000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02rwr77.mp3"
        },
        {
            "title": "Saving Species - 06 Nov 12: Wildcats/Tooth Fungi",
            "datePublished": "Mon, 12 Nov 2012 18:20:00 +0000",
            "description": "Ep 10 of 24\nSaving Species reporter Karen Partridge travels to Scotland to seek out the Scottish wildcat: an iconic emblem of the unspoilt wilderness of Scotland. It has been suggested that there may be fewer than one hundred pure bred wildcat in Scotland, with some studies concluding that this species may actually be rarer that the Amur tiger or even extinct as a genetic species.\nProfessor Lynne Boddy from Cardiff University travels to the New Forest in search of a very rare fungus, the bearded tooth fungus (Hericium erinaceus). This species is commonly grown commercially however in the wild it is one of the rarest fungi's in the UK and it's importance in the woodland ecosystem as a wood-recycling fungus is giving conservationists cause for concern.",
            "length": "26832000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02rwsh4.mp3"
        },
        {
            "title": "Saving Species - 30 Oct 12: Citizen Science/Giant Harvestman",
            "datePublished": "Tue, 30 Oct 2012 14:58:00 +0000",
            "description": "Citzen Science/Giant Havestman\nSaving Species asks this week what contribution the amateur naturalist makes to our understanding of the natural world through citizen science.",
            "length": "26704000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02rx23f.mp3"
        },
        {
            "title": "Saving Species - 23 Oct 12: British Raptors",
            "datePublished": "Tue, 23 Oct 2012 15:09:00 +0000",
            "description": "Brett Westwood discusses issues arising in our countryside from a rising bird of prey population and possible conflict this brings to other land users.",
            "length": "26832000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02rwslw.mp3"
        },
        {
            "title": "Saving Species (Srs 3) - 16 Oct 12 - Ep 7",
            "datePublished": "Wed, 17 Oct 2012 16:59:00 +0000",
            "description": "Ep 7 of 24\nBrett Westwood talks to heads to filmmakers attending International Wildscreen Film Festival 2012\nto discuss their work and motivations, \nPlus, Brett gets the latest on the multi-wildlife organisation conservation breading project to save the critically-endangered Spoon-billed Sandpiper bird.\nPresenter: Brett Westwood\nProducer: Sheena Duncan\nExec Producer: Julian Hector",
            "length": "26864000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02rwqx2.mp3"
        },
        {
            "title": "Saving Species (Srs 3) - 09 Oct 12 - Ep 6",
            "datePublished": "Tue, 09 Oct 2012 14:05:00 +0000",
            "description": "In this episode of Saving Species we look at one of Britain's favourite birds - the swallow. Ed Drewitt travels to a swallow roost in Southern England, where overnight he joins the The Wetland Trust to trap and ring swallows as they gather in a mass roost to head south. So how have the swallows and other summer migrants done this year? \nChris Sperring travels with entomologist Tristan Bantock to a central London park to track down the rare mediterranean Southern Oak Bush Cricket was first recorded in the UK in 2001. Since then sightings of the bright green, wingless cricket have become more frequent, but still more elusive than its native counterpart. \nDavid Robinson from the Department of Environment, Earth and Ecosystems at the Open University joins Brett Westwood in the studio to discuss in more depth how the Southern Oak Bush Cricket came to be in the UK.",
            "length": "26752000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02rwy65.mp3"
        },
        {
            "title": "Saving Species (Srs 3) - 02 Oct 12 - Ep 5",
            "datePublished": "Tue, 02 Oct 2012 13:02:00 +0000",
            "description": "In this episode of Saving species we focus on the issues facing our rivers and freshwater systems. The Shropshire Wildlife Trust this year highlight them by saillling a curragh down the Severn. John Hughes from the Trust joins Brett Westwood on the water to give them a perfect otter's eye view of the issues facing our crowded countryside and ever increasing demands on this natural resource.",
            "length": "26672000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02rwsnb.mp3"
        },
        {
            "title": "Saving Species (Srs 3) - 25 Sep 12 - Ep 4",
            "datePublished": "Tue, 25 Sep 2012 15:40:00 +0000",
            "description": "Can the world's marine environments remain healthy and functioning under the influence of man, from pollution to over fishing and climate change? In Saving Species this week, Brett Westwood looks in depth at some of the issues and research being carried out into the species which depend upon this often abused natural resource.\nOur reporter Helen Scales travels to the Gambia, where issues of oyster overfishing are having a devastating effect not only on the native oysters but also the coastal mangrove swamps.\nIn Florida, Howard Stableford joins marine researchers for an evening on a sandy beach. And closer to home, we look at the 2012 breeding season of some of our breeding seabirds.\nProducer : Sheena Duncan\nPresenter : Brett Westwood\nEditor : Julian Hector",
            "length": "26432000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02rx2pn.mp3"
        },
        {
            "title": "Saving Species (Srs 3) - 18 Sep 12 - Ep 3",
            "datePublished": "Wed, 19 Sep 2012 11:34:00 +0000",
            "description": "Saving Species presented by Brett Westwood this week poses the question; with increasing pressures to develop our land for housing, transport and industry, is there still room for Britain's wildlife to flourish?\nRecently the Government set out proposals to extend development rights into the Green Belt as an aid to economic growth.  Brett Westwood discovers the importance of brown-field sites on a visit to Canvey Wick in the Thames Estuary accompanied by Sarah Henshall, Brownfield Manager from the charity, Buglife. \nAnd we hear from Dr Chris Baines who discusses whether the plans to build a London to Birmingham high speed rail link could actually benefit wildlife in the longer term.\nProducer : Mary Colwell\nPresenter : Brett Westwood\nEditor : Julian Hector",
            "length": "26720000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02rwr5l.mp3"
        },
        {
            "title": "Saving Species (Srs 3) - 11 Sep 12 - Ep 2",
            "datePublished": "Tue, 11 Sep 2012 15:12:00 +0000",
            "description": "Episode 2 of 24\nSaving Species presented by Brett Westwood this week looks at bats and how research is looking at finding ways to allow them to fly unhindered in our increasingly urbanised land.\nAlso in the programme is a special report about the Sulcata tortoise.  Over the years many tortoises have been a special pet to families across the Globe. However the Sulcata tortoise is now of global concern and to discover more of the conservation efforts to return this species in the wild, Helen Scales travels to Senegal to see the pioneering work by Tomas Diagne.",
            "length": "26784000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02rwqny.mp3"
        },
        {
            "title": "Saving Species (Srs 3) - 04 Sep 12 - Ep 1",
            "datePublished": "Thu, 06 Sep 2012 20:30:00 +0000",
            "description": "1/24 Saving Species is back for another year of live broadcasting about the world of wildlife conservation, presented by Brett Westwood. We kick off the first programme with look back at the summer of 2012. This summer has been one of the wettest on record, has this affected our wildlife? We look at some of the winners and losers in the battle for survival.\nAlso in the programme - Saving Species heads to Dungeness in Kent where a long term project is underway to return the short haired bumblebee to Britain. This formerly widespread bee was last recorded in 1988 and declared extinct in 2000. \nAt the opposite end of the country, Chris Sperring reports from Devon where he joined a public night-time safari to look for one of our most enigmatic and enlightening beetles, the glow-worm. \nPresenter: Brett Westwood\nProducer: Sheena Duncan\nEditor: Julian Hector",
            "length": "26704000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02rwqzp.mp3"
        },
        {
            "title": "The Living World",
            "datePublished": "Sun, 19 Aug 2012 06:00:00 +0000",
            "description": "Little Owls\nMiranda Krestovnikoff goes in search of the little owl, a bird that was introduced in the late 19th century and has since spread throughout England and Wales.",
            "length": "21264000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02rwrx3.mp3"
        },
        {
            "title": "The Living World",
            "datePublished": "Sun, 12 Aug 2012 06:00:00 +0000",
            "description": "Ouzels of the Moor\nMiranda Krestovnikoff is in a valley on Dartmoor searching for the last ring ouzels in southern England where an RSPB study of the birds is investigating their decline.",
            "length": "21280000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02rwvpk.mp3"
        },
        {
            "title": "Nature 07 Aug 12 - Largest Butterfly",
            "datePublished": "Tue, 07 Aug 2012 10:30:00 +0000",
            "description": "Nature: Quest for the World's Largest Butterfly\nQueen Alexandra's Birdwing has a 30cm wingspan. Mark Stratton visits remote Papua New Guinea to find the butterfly and to meet its dedicated tribal conservationists.",
            "length": "27088000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02rwqbh.mp3"
        },
        {
            "title": "The Living World",
            "datePublished": "Sun, 05 Aug 2012 06:00:00 +0000",
            "description": "The UK's Rarest Frog\nJoanna Pinnock is at a secret location in Norfolk, the home of the rare pool frog, reintroduced after becoming extinct.",
            "length": "21072000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02rwtw0.mp3"
        },
        {
            "title": "Nature 31 July 12: Bird Wars on Malta",
            "datePublished": "Tue, 31 Jul 2012 10:30:00 +0000",
            "description": "In Nature, Matthew Hill takes us from the windswept Maltese countryside, to the corridors of Brussels, to investigate allegations of widespread illegal bird hunting on Malta.",
            "length": "26960000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02rwqjv.mp3"
        },
        {
            "title": "The Living World",
            "datePublished": "Sun, 29 Jul 2012 06:00:00 +0000",
            "description": "New Series:\nA Home in the Reeds\nJoanna Pinnock enters the mysterious world of an East Anglian reed-bed in search of the tightly-woven nests of reed warblers, the hosts of the cuckoo.",
            "length": "21136000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02rwr9q.mp3"
        },
        {
            "title": "Amazonia - Keeping It Alive!",
            "datePublished": "Tue, 03 Jul 2012 10:30:00 +0000",
            "description": "Amazonia - Keeping It Alive!\nThe Amazon rainforest covers covering 1.6 million square miles. About 20% has gone in the last 40 years. How can we use the resources it contains, but still keep it alive?\nProducer/Presenter: Mary Colwell\nEditor: Julian Hector",
            "length": "26976000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02rws2x.mp3"
        },
        {
            "title": "The Living World 20 May 12 - Brecon's Bats",
            "datePublished": "Thu, 24 May 2012 15:50:00 +0000",
            "description": "The Living World visits the Usk Valley to see a population of lesser horseshoe bats and an expert who studies them.",
            "length": "20960000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02rwvnd.mp3"
        },
        {
            "title": "The Living World 13 May 12 - Pasqueflower",
            "datePublished": "Sun, 13 May 2012 06:00:00 +0000",
            "description": "The Living World: The Pasqueflower\nJoanna Pinnock is at a nature reserve in Cambridgeshire, developed on a former ancient quarry site, to see one of the largest remaining colonies of pasqueflowers in the country.",
            "length": "21376000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02rwtjd.mp3"
        },
        {
            "title": "The Living World 6 May 12 Bee Flies",
            "datePublished": "Sun, 06 May 2012 06:00:00 +0000",
            "description": "Joanna Pinnock joins naturalist John Walters in Devon to find out more about a bee mimic, the Dark Edged bee fly. Like the cuckoo, its young develop in others' nests. \n \nProducer: Sheena Duncan\nEditor: Julian Hector",
            "length": "21136000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02rwt8c.mp3"
        },
        {
            "title": "Nature 01 May 12 Japanese Sika",
            "datePublished": "Tue, 01 May 2012 10:30:00 +0000",
            "description": "Nature: In Search of the Japanese Sika\nChris Sperring goes in search of sika deer and discovers how conservation groups like the RSPB and National Trust are managing the delicate balance of deer, people and habitats.\nProduced by Karen Parteidge",
            "length": "26880000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02rwvs6.mp3"
        },
        {
            "title": "The Living World 29 Apr 12 Woodman's Butterfly",
            "datePublished": "Sun, 29 Apr 2012 06:00:00 +0000",
            "description": "Sarah Pitt goes in search of the endangered pearl-bordered fritillary with the help of Richard Fox and Gary Pilkington.",
            "length": "21104000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02rwr7r.mp3"
        },
        {
            "title": "Nature 24 Apr 2012 Hedgehogs",
            "datePublished": "Tue, 24 Apr 2012 10:02:00 +0000",
            "description": "Paul Evans investigates the decline of the British hedgehog and finds out that even estimating the population of this familiar creature is a daunting task for scientists.\nProducer: Brett Westwood\nEditor: Julian Hector",
            "length": "26992000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02rx210.mp3"
        },
        {
            "title": "Nature 17 Apr 2012 Lamprey",
            "datePublished": "Tue, 17 Apr 2012 10:30:00 +0000",
            "description": "Lampreys are some of the most primitive vertebrates and our three British species have declined in recent years, but as Brett Westwood discovers, their fortunes could be improving.",
            "length": "26864000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02rwz12.mp3"
        },
        {
            "title": "Nature 10 Apr 2012 Wood And Water",
            "datePublished": "Tue, 10 Apr 2012 10:30:00 +0000",
            "description": "Fish live in trees too. Brett Westwood finds out why conservationists are dropping wood into rivers to improve their wildlife and water quality.",
            "length": "26880000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02rwrtp.mp3"
        },
        {
            "title": "Nature 3 April 12 Drumming Down",
            "datePublished": "Tue, 03 Apr 2012 11:00:00 +0000",
            "description": "As spring woodlands resound with the drumming of woodpeckers, Brett Westwood hears about a new study of the tiny lesser spotted woodpecker, which has declined by nearly 90%. \n \nProducer: Brett Westwood\nEditor: Julian Hector",
            "length": "26864000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02rx16n.mp3"
        },
        {
            "title": "A Life With... Seals",
            "datePublished": "Fri, 30 Mar 2012 13:00:00 +0000",
            "description": "Episode 5 of 5: Seals\nGrey seals are Britain's largest mammal, yet still remain a mystery. \nMary Colwell Meets Sue Sayer on a windy cliff in Cornwall to view the animals she loves so much.\nSue now spends all her time discovering their lives. She used to be a teacher, but as her passion for seals grew she found herself spending more and more time with seals. \nSue eventually gave up her paid job and became a champion of seals.",
            "length": "13632000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02rws0x.mp3"
        },
        {
            "title": "A Life With... Mosses",
            "datePublished": "Thu, 29 Mar 2012 13:00:00 +0000",
            "description": "Episode 4 of 5: Mosses\nWhat makes a young man forgo parties with friends to sit at home every evening and weekend and study the intricate anatomy of mosses? What is it about liverworts, best known for smothering seedlings in greenhouses that pushes the buttons of a naturalist?\nMary Colwell meets Simon Bosenquet who sees the beauty and the importance of the less glamorous parts of the natural world.",
            "length": "13664000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02rwrd4.mp3"
        },
        {
            "title": "Feathered Apes",
            "datePublished": "Wed, 28 Mar 2012 15:42:00 +0000",
            "description": "Corvids are the group of birds that include rooks, jays and crows.  These birds are known by many to be canny and clever, but does that make them intelligent? Some think so.",
            "length": "27008000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02rwpky.mp3"
        },
        {
            "title": "A Life With... Corals",
            "datePublished": "Wed, 28 Mar 2012 13:00:00 +0000",
            "description": "Episode 3 of 5: Corals\nCorals? In Devon? Believe it or not there are lots of corals around the British coastline.\nMary Colwell meets Keith Hiscock: a man who has spent his life learning about Coral around the UK; inspired by re-tracing the steps of Victorian naturalist, Philip Henry Gosse.",
            "length": "13712000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02rwzqw.mp3"
        },
        {
            "title": "A Life With... Water Voles",
            "datePublished": "Tue, 27 Mar 2012 13:00:00 +0000",
            "description": "Episode 2 of 5: Water Voles \nWater voles are famous for being Ratty in Wind in the Willows, but they are disappearing fast from our waterways. Mary Colwell meets a water vole warrior who is determined to save them. Darren Tansley fell in love with water voles as a boy, messing around on a raft his dad made from an old barn door. 40 years later he is still messing about on the river, but now he is creating new, protected homes for water voles and makes sure their sworn enemies, the mink, don't get anywhere near them.\nDarren has a fascinating past. Not only has he always been monitoring and studying water voles he was a long haired eco warrior who played in a rock band and campaigned for Greenpeace. When he realised the conservation world didn't really listen to amateurs he went back to college to get the \"proper\" qualifications. Now his projects are paying off and Darren takes Mary to see water voles that have just returned to a water-way in Essex.",
            "length": "13616000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02rwvbk.mp3"
        },
        {
            "title": "A Life With... Insects",
            "datePublished": "Mon, 26 Mar 2012 13:00:00 +0000",
            "description": "Episode 1 of 5: Insects\nInsects are not everyone's favourite part of the natural world, but a doctor in Norfolk just loves them. Dr Phil Wilkins' day job is a palliative care consultant but his overwhelming passion is insects.\nMary Colwell goes to his home to see his garden designed for insects and to try to understand what the connection is between being a doctor and an entomologist.\nPhil's garden is insect heaven, everything in it is there for a reason, to attract insects and give them what they need to breed, but the surrounding land is intensively farmed fields of crops with barely any insect life at all.\nDr Wilkins wants to heal the land, and bring back a healthy, vibrant natural community. This is one man's battle to save Britain's creepy crawlies for future generations.",
            "length": "13424000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02rwqzb.mp3"
        },
        {
            "title": "The Living World 26 Feb 12 Winter Flies",
            "datePublished": "Sun, 26 Feb 2012 07:00:00 +0000",
            "description": "For Living World, Miranda Krestovnikoff asks \"where do flies go to in winter\" and discovers that many of them are around even in freezing conditions.\n \nProducer: Brett Westwood; Editor: Julian Hector.",
            "length": "21264000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02rwrxs.mp3"
        },
        {
            "title": "The Living World 19 Feb 12 Woodcock",
            "datePublished": "Sun, 19 Feb 2012 07:00:00 +0000",
            "description": "Miranda Krestovnikoff pays a nocturnal visit to the Hampshire countryside for a close encounter with one of our most mysterious birds, the woodcock.",
            "length": "21408000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02rwzs9.mp3"
        },
        {
            "title": "The Living World 12 Feb 12 Ponds in Winter",
            "datePublished": "Sun, 12 Feb 2012 07:00:00 +0000",
            "description": "Miranda Krestovnikoff discovers the life beneath the surface of some very special New Forest ponds in winter and finds rare snails , newts frogspawn and fairy shrimps. \nProducer: Brett Westwood\nEditor: Julian Hector",
            "length": "21104000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02rwrl4.mp3"
        },
        {
            "title": "The Living World 5 Feb 12 Dippers",
            "datePublished": "Sun, 05 Feb 2012 07:00:00 +0000",
            "description": "Miranda Krestovnikoff visits the Brecon Beacons where she explores the watery world of the dipper, a bird shaped by the rivers on which it depends. \n \nProducer: Brett Westwood",
            "length": "21312000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02rwps7.mp3"
        },
        {
            "title": "The Living World 29 Jan 12 Jackdaw Roost",
            "datePublished": "Sun, 29 Jan 2012 07:00:00 +0000",
            "description": "For this week's Living World, Joanna Pinnock heads to a site in Cambridgeshire which is currently part of a long term study into jackdaw behaviour. Here she meets Dr Alex Thornton on a blustery morning before dawn. As first light begins to creep silently over the horizon the first chattering's of a jackdaw roost can be heard. With increasing light, this chatter becomes louder until at some given signal, the jackdaws simultaneously leave their night roost in a cacophony of sound. It is a winter spectacle often overlooked but rivalling any in the natural world. So what is actually going on here?\nProducer: Andrew Dawes.",
            "length": "21344000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02rwsz2.mp3"
        },
        {
            "title": "Yeti's Finger",
            "datePublished": "Wed, 18 Jan 2012 16:45:00 +0000",
            "description": "High up a remote Himalayan Mountain in Nepal is a Buddhist monastery. The monks say there is no doubt yeti's roam the high forest, they see and hear them and they sometimes even attack people. The tantalising prospect of being the first to prove that this mythical ape like creature actually exists has been the goal of many explorers - but the beast has always evaded capture. Then the discovery of a supposed yeti's hand kept in the monastery set off a remarkable chain of events that drew in a mountain explorer, an American oil tycoon, a Hollywood film star and a high tech lab for forensic science in Scotland. But is it a yeti?\nPresenter: Matthew Hill\nProducer: Mary Colwell\nEditor: Julian Hector",
            "length": "26768000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02rws20.mp3"
        },
        {
            "title": "Saving Species Sustaining Life",
            "datePublished": "Fri, 23 Dec 2011 21:00:00 +0000",
            "description": "In a special edition of Saving Species, recorded in front of an audience at the University of Bristol, Brett Westwood chairs a discussion about the building tension between the natural world and the burgeoning human population.\nEvery 2 seconds another child is born. The human population is now over 7 billion and is projected to rise to 9 billion by 2050. All these people will need food, water, energy and materials, is that possible? How can a burgeoning population really live with a flourishing natural world?\nSustaining Life takes the issue of the human population and nature head on.\nPresenter: Brett Westwood\nProducer: Mary Colwell\nEditor: Julian Hector",
            "length": "44880000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02rwtgn.mp3"
        },
        {
            "title": "Saving Species (Srs 2) - 13 Dec 11 - Ep 30",
            "datePublished": "Tue, 13 Dec 2011 14:12:00 +0000",
            "description": "30/30 For the final live programme of the series there will be an update from the BTO on the location of the five tagged cuckoos in the forests of Central Africa. \nAlso on the move but on a much shorter journey are shags. Bob Swann reports from his well-monitored seabird cliffs at North Sutor in Scotland where he has been checking the ring numbers of the shags.\nPeter Burgess from the Devon Wildlife Trust takes Chris Sperring on an end of year update on the beavers who are being used to manage rare culm grassland.\nMark Brazil reports on the conservation of the rare Lear's Macaw. \nKelvin Boot joins Brett in the studio with the latest Wildlife news roundup\nKeep an ear out for the Saving Species special debate on \"Sustaining Life\" pre-recorded for broadcast on Friday 23rd December at 8pm.\nPresenter: Brett Westwood\nProducer: Sheena Duncan\nEditor: Julian Hector",
            "length": "26960000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02rwycq.mp3"
        },
        {
            "title": "Saving Species (Srs 2) - 06 Dec 11 - Ep 29",
            "datePublished": "Tue, 06 Dec 2011 17:13:00 +0000",
            "description": "28/30 Michael Scott reports from the Flanders Moss peat bogs near Stirling. He discovers it's all about the management of water. Howard Stableford sends a second report about Pikas, where American biologists from Arizona State University explain that the Pikas are also critical for the retention of water on the plateau: their burrows, they claim, help prevent flood and drought. \nJane Madgwick, Director of Wetlands International talks about water and the conservation of peat bogs at home and in the Himalayas.\nAnd what are fungi doing wearing tights? it's a parasitic fungus- the powder cap strangler - whose host is another fungus - Brett is in the field to find them.\nPresenter: Brett Westwood\nProducer: Sheena Duncan\nEditor: Julian Hector",
            "length": "27040000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02rwrfc.mp3"
        },
        {
            "title": "Saving Species (Srs 2) 29 Nov 11 - Ep 28",
            "datePublished": "Tue, 29 Nov 2011 16:18:00 +0000",
            "description": "28/30 In this weeks programme Buzzards are implicated as part of the cause in the decline of Brown Hares in North Wales. Hares are not commonly linked to a Buzzards diet - so can this be right. We're in North Wales to find out.\nWe're also in Brazil with Mark Brazil who is exploring the flooded Amazon forest in search of the White Uakari Monkey.\nAnd back in the UK - news that many more of the global species of whales can be found in British waters.\nPresenter Kelvin Boot\nProducer Sheena Duncan\nEditor Julian Hector",
            "length": "27056000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02rwspz.mp3"
        },
        {
            "title": "The Living World - 27 Nov 11 - Cuckoo Trees",
            "datePublished": "Sun, 27 Nov 2011 07:00:00 +0000",
            "description": "The Living World: Cuckoo Trees\nIn early winter, Joanna Pinnock heads up to the Stiperstone Hills in Shropshire. Here she meets up with Sara Bellis and Carl Pickup from the Shropshire Wildlife Trust at a remarkable place, The Hollies. Here high up on the windswept hills, Joanna encounters ancient holly trees, which could be as old as 400 years. Holly, naturally an understory tree of more developed woodland, is not suited to grow up here in the cold windy conditions. But how and why these trees came to be here is something of a mystery.\nProduced by Andrew Dawes",
            "length": "21328000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02rwtkn.mp3"
        },
        {
            "title": "Saving Species (Srs 2) 22 Nov 11 - Ep 27",
            "datePublished": "Tue, 22 Nov 2011 17:50:00 +0000",
            "description": "27/30 This week the programme is all about trees and forests. In the UK this is national tree week. We have a story where a 500 year plan is being rolled out to restore ancient woodland in the British landscape. We also have a report from Italy on the success of designating a forest \"sacred\" to save it. And the Monkey Puzzle tree. A report from Michael Scott on the importance of the genetic diversity of Monkey Puzzles in Scottish gardens and parks to the Chile, the native country of this species.\nPresented by Brett Westwood\nProduced by Mary Colwell\nEditor Julian Hector",
            "length": "27120000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02rx2xs.mp3"
        },
        {
            "title": "The Living World 20 Nov 11 Winter Ladybirds",
            "datePublished": "Sun, 20 Nov 2011 07:00:00 +0000",
            "description": "As ladybirds become dormant in winter, their struggle to survive is examined. Joanna Pinnock joins Dr Helen Roy and Richard Comont in Oxfordshire.\nProduced by Andrew Dawes",
            "length": "21344000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02rwqwh.mp3"
        },
        {
            "title": "Saving Species (Srs2) 08 Nov 11: Ep 25",
            "datePublished": "Thu, 17 Nov 2011 10:46:00 +0000",
            "description": "25/30 Saving Species reports from Tampa Bay on studies following the movements and whereabouts of Sea Horses. How is it the males have been left \"holding the baby\" and why does understanding how the female has got out of rearing off spring help in the conservation of the species.\nWe also get a report on efforts in Israel to stem the decline of marine turtles in the Mediterranean. The Sea Turtle Rescue Centre was set up in 1999 under the auspices of the Israel Nature and Park Authority with the aim to rescuing injured adult turtles and incubating eggs in replica nests.\nPresented by Brett Westwood\nProduced by Sheena Duncan\nEditor Julian Hector",
            "length": "27152000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02rwsqd.mp3"
        },
        {
            "title": "Saving Species (Srs 2) 15 Nov 11 - Ep 26",
            "datePublished": "Tue, 15 Nov 2011 16:58:00 +0000",
            "description": "26/30 Assisi in Italy is the town most strongly associated with Saint Francis - the patron saint of the environment. A fitting place for a unique gathering of world faiths and members of the global conservation community. They were there to inspire one another and find ways of working more closely together to protect the natural world. Karen Partridge joined the delegates and speakers in Assisi and will be in the studio to talk about the upsum of this special meeting of minds.\nAnd we're bring you an exclusive report and an encounter with a bird that is on the brink of extinction. A last ditch effort by two major UK wildlife organisations and collaborators in Russia might, in the long term, turn the fortunes of this most beautiful migrant bird. The Spoon-billed Sandpiper.\nPresented by brett Westwood\nProduced by Mary Colwell\nEditor Julian Hector",
            "length": "27120000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02rwvkl.mp3"
        },
        {
            "title": "The Living World 13-Nov-11 Waxcap Grasslands",
            "datePublished": "Sun, 13 Nov 2011 07:00:00 +0000",
            "description": "West Wales receives a lot of rain, which is perfect for this week's Living World. Paul Evans joins Bruce Langridge from the National Botanic Garden of Wales and Dr Gareth Griffiths, a mycologist from Aberystwyth University on a fungal foray with a difference, as they look for waxcaps hidden amongst grass.\nProduced by Andrew Dawes",
            "length": "21312000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02rwtf2.mp3"
        },
        {
            "title": "The Living World 06 Nov 11: Celtic Rain Forest",
            "datePublished": "Sun, 06 Nov 2011 07:00:00 +0000",
            "description": "High in the hills of the Snowdonia National Park in Wales, can be found a rare and fascinating habitat. For this weeks' Living World, Paul Evans joins Ray Woods from Plantlife Cymru on a voyage of discovery into the Celtic Rainforest.",
            "length": "21328000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02rwsjd.mp3"
        }
    ]
}