{
    "artwork": "http://is5.mzstatic.com/image/thumb/Music62/v4/8f/21/1c/8f211ced-39ee-3694-b32a-d4c4d089bb81/source/100x100bb.jpg",
    "description": "A podcast by people who believe in nothing, interviewing people who believe in everything, for people who don't care to read",
    "feedURL": "http://feeds.soundcloud.com/users/soundcloud:users:69513863/sounds.rss",
    "podcastURL": "http://www.chrisderose.com",
    "title": "Bitcoin Uncensored",
    "episodes": [
        {
            "title": "We're moving off of SoundCloud - Adjust your podcast RSS to the new URL?",
            "datePublished": "Mon, 31 Jul 2017 20:26:24 +0000",
            "description": "What's up party people! \n\nSo, this is a short and hopefully sweet Soundcloud episode. So, let's get to it!\n\nAs you've no doubt noticed, there's not a lot going on in my Soundcloud space. It seems that soundcloud is dying, and perhaps even, that its end is near. This has been announced before, and it's possible that this time will not be substantially different than the last. But, nonetheless, I feel foreced to excersize some prudence here to prevent us from having the wool pulled out underneath us unexpectedly. \n\nAs you all know, I've been spending time in the last few months trying to figure out what's the best direction for the show going forward, and I think my testing is virtually complete. So here's the plan.\n\nLet's first talk about BU. I've copied all this soundcloud content over to libsyn. You can access it via podcast.chrisderose.com. So if and when soundcloud goes dark, you can find this archive, in full, at that address.\n\nFrom there, I have bad news and good news. The bad news is that I'm being forced to rebrand. I really, really, really wanted to keep the show called Bitcoin Uncensored. But without going into a lot of detail, it seems that a handful of sour individuals are really commited to preventing that name from growing. That being said, I thought that keeping bitcoin uncensored was fairly important to people, but it seems that most people are ok with dropping the brand. That surprised me, but pleasently. So, that's the bad news.\n\nNow for the good news: Not much else is changing. The show is going to rebrand to \"DeRose Uncensored\", with a focus on delivering a \"Joe Rogan but with the bitcoin\"  type content. So, if you like the long form format, you're going to be happy with that direction. Many of you in the soundcloud community have made it clear: you want unedited raw audio content. So, I'm making the audio format the primary focus for content going forward. I'll still be doing the youtube, but youtube will serve as a platform for short edited versions of the audio feed.\n\nSo with that, I'm announcing the new podcast feed is available on my patreon. My tests were a big success, and so I'm committed to growing the platform. I've been producing about two shows a week since this soundcloud was last updated, and I've got about four or five long-form episodes up there right now.\n\nI think Patreon will allow the show to grow in a way that brings money in the door to grow, and continue making bigger and better content. And if you're listening this far through, you're probably going to benefit the most from this direction.\n\n. Why not head over to patreon and create an account? It doesn't take very long, and if you sign up today, you'll have a bunch of content already waiting for you, with lots more on the way. I have the FULL and UNEDITED weev interview up, as well as a one and a half hour talk with a prominent dnm guy - plus plenty more content that's not published anywhere else. \n\nSo, that's the update, tell me what you think, and come on over to patreon.com/derose for even more of the content you've come to love here on Soundcloud.\n\nLater party people!",
            "length": "8734281",
            "sourceUrl": "http://www.podtrac.com/pts/redirect.mp3/feeds.soundcloud.com/stream/335693695-bitcoinuncensored-were-moving-off-of-soundcloud-adjust-your-podcast-rss-to-the-new-url.mp3"
        },
        {
            "title": "Paul Sports Freaks Out over ICO's - Where did we go wrong!?",
            "datePublished": "Wed, 12 Jul 2017 18:29:57 +0000",
            "description": "Video Version here: https://www.youtube.com/watch?v=h8kUog09Ey4\n------\nPaul Sports popped into the Coin Dojo today and was shaken by the Wayne Vaughn/Tierion ICO announcement. Discussion quickly turned to \"who's the scammer?\" (Everyone) and \"what isnt a scam\" (iced cream) and of course, \"Coin Dojo is dead\" .\n\nI took paul into my new studio to work through the issues, and what came out - what a pretty decent collaboration on the narrative of Bitcoin, and the maximalists in 2017. See what you think?\n\n\nThis is a template for more regular episodes that I'd like to do with less editing than my recent stuff I'm thinking about calling it \"Unprotected sex with (Guest Name Here)\". But, maybe \"Bitcoin Unprotected\" or \"Bitcoin Uncut\" would get more guests on :) anyways, what do you think of this format, want more of this? leave your comments and tell me.",
            "length": "65990612",
            "sourceUrl": "http://www.podtrac.com/pts/redirect.mp3/feeds.soundcloud.com/stream/332564289-bitcoinuncensored-paul-sports-freak-out.mp3"
        },
        {
            "title": "Andrew Torba of Gab Talks Free Speech and Censorship Online (Unedited)",
            "datePublished": "Mon, 10 Jul 2017 17:29:07 +0000",
            "description": "Check out the youtube version here: https://youtu.be/-52yykbhXUE\n\nAndrew tells us about his long path to gab.im. How he started in Silicon Valley, where leftist progressives want to take the web, and what it's like to be a conservative in California. \n\nWhy are sites like twitter censoring people's tweets, and where is it hipocritical? Feminist Shaming Brigades, Self Censorship, App store censorship and the systemic risk that corporate filters represent online.\n\nAnd.... what can the blockchain do about this?!",
            "length": "63908071",
            "sourceUrl": "http://www.podtrac.com/pts/redirect.mp3/feeds.soundcloud.com/stream/332533506-bitcoinuncensored-andrew-torba-of-gab-talks-free-speech-and-censorship-online-unedited.mp3"
        },
        {
            "title": "Cam Models Pepper and Rino Spill the DIRTY SECRETS of the online Sex Business",
            "datePublished": "Tue, 04 Jul 2017 15:30:05 +0000",
            "description": "This interview got all kinds of problems on release due to the Youtube censors (Gaaaahhh!) Nonetheless, the surviving half of this interview is still up here: https://youtu.be/iF07U7nzAjA\n\nNonetheless, this is the full interview, uncensored. Rino is a gridcoin guy, and Pepper helps him promote it on her cam show. See what you think, is this content too spicy for you? Or was Youtube over-reacting?",
            "length": "88346192",
            "sourceUrl": "http://www.podtrac.com/pts/redirect.mp3/feeds.soundcloud.com/stream/331514518-bitcoinuncensored-cam-models-pepper-and-rino-spill-the-dirty-secrets-of-the-online-sex-business.mp3"
        }
    ]
}