{
    "artwork": "http://is5.mzstatic.com/image/thumb/Music3/v4/28/a4/9e/28a49ea5-4874-b427-b2d6-837090254085/source/100x100bb.jpg",
    "description": "Featuring leading practitioners of the art, craft, and business of entertainment lighting, we serve the need for user-driven information in the hope of creating a forum for sincere, unscripted community interaction.",
    "feedURL": "http://www.castinglightpodcast.com/podcast/?format=rss",
    "podcastURL": "http://www.castinglightpodcast.com/podcast/",
    "publisher": "Jason Marin",
    "title": "Casting Light Podcast",
    "episodes": [
        {
            "title": "Mike Grabowski: a Philly street magician lights Times Square’s biggest night",
            "datePublished": "Sun, 01 Nov 2020 19:15:00 +0000",
            "description": "<p class=\"\">Mike Grabowski is on the show by listener request! He’s a Senior Lighting Designer at <a href=\"https://www.ldg.com/\" target=\"_blank\">LDG</a>, a member of <a href=\"https://www.usa829.org/\" target=\"_blank\">Local USA 829</a>, and has lit innumerable projects for broadcast over the course of his 15 year career. We discussed several of those projects, including the intricacies of his work on Dick Clark’s New Year’s Rockin’ Eve with Ryan Seacrest.</p><p class=\"\">Mike was MTV’s Broadcast Lighting Consultant when they did a major overhaul of their Times Square studio, and we discussed that project in detail. We also discussed some of the unusual techniques he used on History’s Forged in Fire and AMC’s Comic Book Men. In addition, Mike revealed how exposure to street performance and busking in his home of Philadelphia connected him with the world of theater and production, and how working as a draftsperson introduced him to parts of the business beyond theater.</p><p class=\"\">Visit his website <a href=\"https://www.mtgdesigns.net/\" target=\"_blank\">MTG Designs</a> for more information.As always, thanks for downloading and listening!</p>",
            "length": "48949593",
            "sourceUrl": "https://static1.squarespace.com/static/5403888de4b072d122d1b7ad/t/5f9ed12e0e604768db1b4626/1604243863491/Mike+Grabowski.mp3"
        },
        {
            "title": "Eddie Kramer: He knows more about electrics than you",
            "datePublished": "Sun, 18 Oct 2020 10:00:00 +0000",
            "description": "<p class=\"\">Is six circuit multicable code compliant? Why do LED fixtures put load on neutral? What did old-time producers dislike even more than organized labor? Eddie Kramer knows the answers. He’s a member of the electrics crew at Radio City Music Hall, a senior member of the Institute of Electrical and Electronics Engineers, an ETCP Certified Entertainment Electrician, and your host’s Local One brother.</p><p class=\"\">Eddie is from the Lower East Side, and got his start in high school. He worked at The Theatre at the Riverside Church, Club Xenon, and the tiny underground theater that would one day become The Roundabout before finding his home at Radio City. Along the way, he became a member of the ESTA Technical Standards Program, where as a part of several working groups, he’s had input into many of the technical standards that affect our business. <a href=\"https://tsp.esta.org/tsp/index.html\" target=\"_blank\">Visit the ESTA TSP portal to learn more.</a></p><p class=\"\">Thanks for downloading and listening!</p>",
            "length": "45189459",
            "sourceUrl": "https://static1.squarespace.com/static/5403888de4b072d122d1b7ad/t/5f8b59fd1caa0828250bf294/1602968172089/Eddie+Kramer.mp3"
        },
        {
            "title": "OK, Now What?",
            "datePublished": "Fri, 02 Oct 2020 08:08:12 +0000",
            "description": "<p class=\"\">It’s the 50th episode of Casting Light, and we’re doing something different this time. With our business in flux and many people looking for some guidance, we’ve put together an incredible panel to answer the question, “OK, now what?” Reinvention, keeping abreast of industry changes, knowing how to nurture relationships, continuing education, and financial planning all play a part regardless of the state of the business, and our guests discuss all these topics and more on this episode.</p><p class=\"\">We’ve got Laura Frank, a top-flight lighting programmer who became a screens producer when she saw how digital lighting was going to affect the industry, ultimately building her own framework and systems to manage all aspects of media; Brad Schiller, who was one of the people who defined what the job of programmer was before moving on to develop consoles, manage products, and represent the biggest names in lighting manufacturing; David Leonard, who had a full career as a theater educator before moving on to assist the great design team of Jules Fisher and Peggy Eisenhauer, and then becoming a high-end real estate agent; and Marty Postma, who worked as a lighting designer and lighting director for music venues and on national and international concert tours for decades before becoming a sales manager for Robe Lighting.</p><p class=\"\">Be sure to check out Brad’s newly released book, <a href=\"https://www.amazon.com/gp/product/B08FNN7HQ8/ref=dbs_a_def_rwt_bibl_vppi_i0\" target=\"_blank\">“Living the Lighting Life: A Guide to a Career in Entertainment Lighting”</a> in which he delves even deeper into many of the topics we discuss on the show.</p>",
            "length": "56616507",
            "sourceUrl": "https://static1.squarespace.com/static/5403888de4b072d122d1b7ad/t/5f76c4cff4270d1620f27cab/1601619234162/OK+Now+What.mp3"
        },
        {
            "title": "Hillary Knox: lighting director, programmer, and problem solver on stage and in studio",
            "datePublished": "Tue, 22 Sep 2020 08:00:00 +0000",
            "description": "<p class=\"\">Multitalented and multi-genre, Hillary Knox has found himself involved in fascinating projects throughout his career. Growing up in Nashville, he thought he would be a musician – but he soon discovered that the lighting department was where he fit. He cut his teeth working at Opryland before attending Carnegie Mellon University. During his last semester, he interned with the great design team of Jules Fisher and Peggy Eisenhauer, and he’s been on the move ever since.</p><p class=\"\">Hillary was an early adopter and user of the Wholehog II, and that formed the base he built his career on. After a stint at The Obie Company, he made his Broadway debut programming lighting for LD Nigel Levings on Baz Lurhman’s 2002 revival of La Boheme. He was then tapped to program media and projections on Wicked for projection designer Elaine J. McCarthy, an ambitious project in every way.</p><p class=\"\">Today, you’ll find him programming lighting on The Late Show with Stephen Colbert, part of a team that includes lighting designer/lighting director Michael Scricca and programmer Constantine Leonardos. Hillary told us how the show worked and what typical daily operations before mid-March, as well as how studio operations have had to adjust to our current situation, from COVID-19 testing twice week to fully socially distanced positions in the studio.</p><p class=\"\">Thanks for listening!</p>",
            "length": "34982147",
            "sourceUrl": "https://static1.squarespace.com/static/5403888de4b072d122d1b7ad/t/5f69749177b3211fc2b45e6f/1600746692568/Hillary+Knox.mp3"
        },
        {
            "title": "Tony Bonilla Part 2: on building structures, building a team, and building your career",
            "datePublished": "Thu, 10 Sep 2020 16:13:03 +0000",
            "description": "<p class=\"\">Tony Bonilla is back on the podcast! We had so much to discuss during our interview, we had to separate it into two parts. This time, we’re talking about a massive project that Tony and his company <a href=\"https://bnwrigging.com/\" target=\"_blank\">BNW Rigging</a> worked on at The Shed in Hudson Yards, how lighting and rigging can work together wore effectively, and what lighting practitioners should know about rigging.</p><p class=\"\">We discussed what elements designers might want to leave up to the production rigger to specify, the expansion of OSHA certification, and why <a href=\"https://etcp.esta.org/\" target=\"_blank\">ETCP certification</a> is such a good idea for rigging and lighting practitioners. Tony gave us a list of rigging training providers he feels are worth the time and money for those who want to learn more, including <a href=\"https://www.tomcatglobal.com/training\" target=\"_blank\">Tomcat U</a>, a program both he and your host have attended. He also had a lot of thoughts on the industry shutdown, including his thoughts on the resilience of both the people and the demand for what they provide.</p><p class=\"\">Check out <a href=\"https://www.instagram.com/bnwrigging/\" target=\"_blank\">BNW on Instagram</a> and on <a href=\"https://www.facebook.com/BNWRigger\" target=\"_blank\">Facebook</a>, and listen to the first part of our interview if you haven’t yet. Thanks for downloading and listening!</p>",
            "length": "35628817",
            "sourceUrl": "https://static1.squarespace.com/static/5403888de4b072d122d1b7ad/t/5f599657a2693c2baacf0c04/1599706731155/Tony+Bonilla+Pt+2.mp3"
        },
        {
            "title": "Tony Bonilla Part 1: An artist becomes a rigger, a rigger becomes an entrepreneur",
            "datePublished": "Mon, 31 Aug 2020 16:43:44 +0000",
            "description": "<p class=\"\">Fifteen years ago, Tony Bonilla was already an experienced rigger, having toured with theatrical productions and rigged special events. Seeing some gaps in what was being provided in the business, he decided to create his own company: <a href=\"https://bnwrigging.com/\" target=\"_blank\">BNW Rigging</a>. At the time, it was intended to be a D/B/A for his own work and an organization through which he could conduct training. Now, BNW is a multimillion-dollar company, one which has distinguished itself with the design, installation, and operation of massive and unique rigs, as well as the administration of rigging at some of the largest and most unusual event venues in the New York area.</p><p class=\"\">Without people like Tony, and companies like BNW, we could never get our lighting systems off the ground. There is both an art and craft to the kind of rigging that Tony specializes in, and in part one of our interview with him, we were able to discuss his artistic roots in sculpture, how he transitioned into theater, and how and why he created BNW. We also dug into one of his most impressive installations to date: a wedding chapel built out of truss on Aspen Mountain, inspired by the Thorncrown Chapel in Eureka Springs.</p><p class=\"\">Join us for Part 2 of the discussion next time. We’ll have more lighting-specific information, information for other entrepreneurs, and an in-depth discussion about another massive project.</p>",
            "length": "33732474",
            "sourceUrl": "https://static1.squarespace.com/static/5403888de4b072d122d1b7ad/t/5f4d1d70b2f1654a438ee57d/1598889384737/Tony+Bonilla+Pt+1.mp3"
        },
        {
            "title": "Cha See: designing new, vital, non-traditional plays, and helping others in need",
            "datePublished": "Sat, 15 Aug 2020 10:30:00 +0000",
            "description": "<p class=\"\">Coming off a run of standout work, including designing lighting for Aleshea Harris’ <a href=\"https://www.themovementtheatrecompany.org/mainstage-productions\" target=\"_blank\"><strong>What To Send Up When It Goes Down</strong></a>, Donja R. Love’s <a href=\"https://thenewgroup.org/production/one-in-two/\" target=\"_blank\"><strong>one in two</strong></a>, and Sarah Einspanier’s <a href=\"https://www.nytw.org/show/house-plant/\" target=\"_blank\"><strong>House Plant</strong></a>, Cha See joined us to discuss some of her productions in depth – and talk about how the pandemic has affected us all.</p><p class=\"\">We discussed the <a href=\"https://www.seelightingfoundation.com/\" target=\"_blank\">See Lighting Foundation</a>, a project she and colleague Kimie Nishikawa created to help support immigrant theater artists impacted by Covid-19. We also had a chance to discuss the issues facing artists like these: visa holders restricted to working in a single field that is now shut down, and unable to risk applying for unemployment.</p><p class=\"\">Cha’s story starts in the Philippines; she knew she wanted to be a lighting designer, but couldn’t find the education she needed there. Driven by a desire to learn and to create, she emigrated to the United States and earned an MFA from NYU Tisch School of the Arts. Today, she’s based in New York, and designs for theater, opera, dance, environmental performance and on-site installations.</p><p class=\"\">Visit Cha’s site at <a href=\"http://www.seelightingdesign.com\" target=\"_blank\">seelightingdesign.com</a> and her Instagram at <a href=\"https://www.instagram.com/seethruuu/\" target=\"_blank\">instagram.com/seethruuu/.</a> As always, thanks for listening!</p>",
            "length": "42104941",
            "sourceUrl": "https://static1.squarespace.com/static/5403888de4b072d122d1b7ad/t/5f37636fe734c879bc8fd5f1/1597465484112/Cha+See.mp3"
        },
        {
            "title": "Christopher Robinson: lighting for revolutionary productions",
            "datePublished": "Wed, 05 Aug 2020 10:00:00 +0000",
            "description": "<p class=\"\">Our guest Christopher Robinson has a lot going on, or at least did until the business shut down this past March. His position as the associate production electrician on <a href=\"http://hamiltonmusical.com\">Hamilton</a> has taken him all over the country, he is <a href=\"http://www.leslieodomjr.com/\">Leslie Odom Jr’s</a> lighting designer, he creates lighting for music videos and live musical performances, and runs his own gear business: <a href=\"http://www.instagram.com/revolutionarylightingnyc/\">Revolutionary Lighting</a>.</p><p class=\"\">Christopher got a lot farther by working a lot harder – his hustle and drive pushed him to succeed as a designer, programmer, head, and electrician in his native Miami, and it helped him find his way onto Broadway only two months after relocating to New York. We discussed how he got into the business, how he learned so quickly, and what jobs he held in NY before accepting his position on Hamilton. We got to talk about how the installation productions work vs. the touring productions, the transfer to Broadway, and the Puerto Rico benefit. We also discussed his shows at the Kennedy Center and Bowery Ballroom with Leslie Odom Jr, and <a href=\"https://www.youtube.com/watch?v=1lpnz3l1mvs\">I Walk With You</a>, the music video he lit during the pandemic shutdown.</p><p class=\"\">Thanks for downloading and listening!</p>",
            "length": "51161533",
            "sourceUrl": "https://static1.squarespace.com/static/5403888de4b072d122d1b7ad/t/5f2ad4c70080f45f2af0b7f9/1596642543889/Chris+Robinson.mp3"
        },
        {
            "title": "Mike Wood: lighting designer, educator, previs contest creator",
            "datePublished": "Mon, 27 Jul 2020 09:00:00 +0000",
            "description": "<p class=\"\">The Casting Light Podcast is back, and we’re talking with Mike Wood of <a href=\"https://www.mikewoodld.com/\">Mike Wood Lighting Design</a>. Mike is based in Nashville, TN, and works as a lighting designer and lighting director throughout the United States. Joining Mike and your host is <a href=\"https://www.abbymayld.com/\">Abby May</a>, a frequent collaborator of Mike’s.</p><p class=\"\">Mike primarily works in theater, and we discussed his work on “American Prom” for <a href=\"http://uccspresents.org/experience-art/theatreworks\">Theatreworks</a> in Colorado Springs, the outdoor work he and Abby do with <a href=\"http://americanstage.org/park/\">American Stage in the Park</a> in St. Petersburg, FL, and his residency with <a href=\"https://www.cityspringstheatre.com/\">City Springs Theatre Company</a> in Sandy Springs, GA. He is also an educator, and has served on the faculties of Marymount Manhattan College, The Collegiate School, Hillsborough Community College, and Howard W. Blake School of the Arts. We had a chance to talk about some of his education philosophies, as well as discuss his software projects and the seminars he’s created for people who would like to build out their own.</p><p class=\"\">Mike was also the creator of the Theatrical Lighting Previs Contest, the winners of which were announced earlier this month. You can read more about it on <a href=\"https://www.mikewoodld.com/contest2020review/\">Mike’s blog</a>.</p>",
            "length": "49827490",
            "sourceUrl": "https://static1.squarespace.com/static/5403888de4b072d122d1b7ad/t/5f1e05b00f881948c79c05a2/1595803096765/Mike+Wood+Lighting+Design.mp3"
        },
        {
            "title": "Scott Barnes: making movies one cue at a time ",
            "datePublished": "Tue, 18 Oct 2016 17:01:33 +0000",
            "description": "Scott has worked with cowboys, aliens, the Whos down in Whoville, recording stars, and marvelous superheroes of all kinds, and now we're lucky enough to have him on our show.  He's a highly specialized Wholehog programmer, working almost exclusively on big-budget, general release films.  In this episode, we learn how equipment we use on stage and television is adapted and used for everything from interactive scene lighting to stand-ins for supernatural characters.  Scott was one of the pioneers in bringing modern computerized lighting control to film sets, and has set the pace for lighting control technology adoption in film.  We got to talk in–depth about the interactive lighting scheme for Guardians Of The Galaxy, how he used Bad Boys to create an alien invasion in Cowboys And Aliens, and what made the Expo in Iron Man 2 work.  We also got to discuss how he sets up control networks, his best practices for staying ahead of things, and how he fits family life into the insanity of a normal filming schedule.",
            "length": "60207457",
            "sourceUrl": "https://static1.squarespace.com/static/5403888de4b072d122d1b7ad/t/5806317bd2b8576b2d81c5aa/1476800977608/Scott+Barnes.mp3"
        },
        {
            "title": "Chris Landy: experienced TV LD, business owner, cheesemonger",
            "datePublished": "Wed, 05 Oct 2016 04:34:09 +0000",
            "description": "Even before founding Vibrant Design with his wife Ellen Waggett, Chris Landy already had a colorful career as a TV lighting designer.  With a start in theater as a teenager, he moved on to a BFA in theater from Wagner College, an MFA from NYU, and then broke into television at LDG.  The acronyms don't stop there – he's designed lighting for shows on NBC, CBS, MTV, MTV2, VH1, BET, Comedy Central, HBO, Showtime, FX, PBS, Spike, Oxygen, Food Network, LOGO, AMC, FUSE, Style Network, NBATV, MSNBC, CNN, and CMT.  We talked about his style and process, taking a detailed look at his work on Lip Sync Battle, including the show's day–to–day operations.  Chris outlined how Vibrant Design works, his key people, and what he had to do to get it off the ground and grow the business.  We also had a chance to discuss some of his other passions, including Bimi's Cheese Shop, a business he (literally) built in Chatham, NY.",
            "length": "59256978",
            "sourceUrl": "https://static1.squarespace.com/static/5403888de4b072d122d1b7ad/t/57f478d903596ef330a7ad9f/1475639558807/Chris+Landy.mp3"
        },
        {
            "title": "Pete Borchetta Part 2: a new home at Altman Lighting",
            "datePublished": "Sun, 18 Sep 2016 21:02:42 +0000",
            "description": "We're back for more from Pete Borchetta in the second half of our interview with him.  He's been with Altman Lighting for just over a year, but has over two decades of experience in the business.  On the last episode, we discussed his beginnings, his career up until Altman, his work as an educator, and his experience as a consultant.  This time, we're discussing Altman itself, what Pete does there, and why he chose to move back to the NY Metro.  We discussed color and color control in-depth, touching on many of the challenges that color-changing LED and short arc fixtures both cause and solve.  We also discussed the lab at Altman, and how they capture the immense amount of photometric data required for IES files and documentation.  Thanks for joining us again!",
            "length": "62393352",
            "sourceUrl": "https://static1.squarespace.com/static/5403888de4b072d122d1b7ad/t/57defb9cb3db2b3c786e9076/1474231879601/Pete+Borchetta+Pt+2.mp3"
        },
        {
            "title": "Pete Borchetta Part 1: How to rappel into a life in lighting",
            "datePublished": "Tue, 06 Sep 2016 15:38:42 +0000",
            "description": "Pete Borchetta, who's worked everywhere from the Far East to the far end of Ashburton Ave in Yonkers, is kicking things off in the first part of our interview with him.  He's been in the business for 20 years, and in that time, he's been a lighting consultant, educator, product manager, and manufacturer representative.  He's also worked for some of the industry's critical designers and manufacturers, including the venerable Altman Lighting, where he is now Product Manager.  In this episode, we discuss Pete's origins in theater and lighting, and discover how, in college, he and a friend found themselves rappelling down the face of a building with arms fill of inkies.  We discussed his distinguished work as a lighting consultant with Robert Lorelli Associates and how that led to him joining Philips several years ago.  We also discussed his career as a professor and program director at Adelphi University.",
            "length": "60030250",
            "sourceUrl": "https://static1.squarespace.com/static/5403888de4b072d122d1b7ad/t/57cec6539f7456813a37b661/1473169031513/Pete+Borchetta+Pt+1.mp3"
        },
        {
            "title": "Dennis Parichy Part 2: Sharing a legacy, educating the next generation",
            "datePublished": "Fri, 15 Jul 2016 20:02:37 +0000",
            "description": "We are back for part two of an interview with \"The best creator of mood, time and place through light in the contemporary theatre,\" as per the Cambridge Guide to the American Theater.  There was still so much to talk about with Dennis and Mike Baldassari, including Dennis' work with Athol Fugard, his book Illuminating The Play, and his thoughts and philosophy on teaching lighting design.  We had a chance to take a close look at Athol Fugard's play Playland and discuss how Dennis analyzed the script to determine a course of action, and we also discussed his design for Crimes Of The Heart, where he had to take a radically different approach.  We discussed his work with Penn And Teller, from Westside Arts Center through Broadway and major tours, and his work with People's Light and Theater Company.  We also had a chance to talk about how his book came to be, and why it focuses so heavily on the specifics of why and how each show was designed rather than theory.  Thanks for listening to Season 2 of the Casting Light Podcast!",
            "length": "51849099",
            "sourceUrl": "https://static1.squarespace.com/static/5403888de4b072d122d1b7ad/t/57893f3ff5e2313700b7b925/1468612552122/Dennis+Parichy+Pt+2.mp3"
        },
        {
            "title": "Dennis Parichy Part 1: 50 years of illuminating the play",
            "datePublished": "Sat, 02 Jul 2016 09:02:54 +0000",
            "description": "There are few who know more about lighting plays than Dennis Parichy, whose career has brought him into close collaboration with giants of American playwriting.  His lengthy association with Circle Rep, and its founders Marshall W. Mason and Lanford Wilson, yielded legendary productions like Burn This and Talley's Folly.  His collaboration with Athol Fugard was also quite productive, with productions ranging from Scenes from Soweto in 1978 to Valley Song in 1998.  He has an Obie Award, a Drama Desk Award, a Drama-Logue Award, three Tony nominations, and today is an educator at Puchase College Conservatory of Theater Arts.  Previous podcast guest Mike Baldassari joined your host for the interview; Mike drafted for and assisted Dennis for several years after moving to New York, including working on Burn This.  Dennis is a master of using light to illuminate characters and make statements about their motivations, and he described his process for breaking down and analyzing a script to tell him how to proceed.  We also went into detail about some plays he's lit, what he wanted to convey with lighting, and how it was done.  Dennis has also written an amazing lighting design text titled Illuminating The Play; in it, he goes into far more detail about his method for creating lighting, and investigates the entire process from script to cue.  As always, thanks for downloading and listening – we'll be back with Part 2 of the interview soon!",
            "length": "55667149",
            "sourceUrl": "https://static1.squarespace.com/static/5403888de4b072d122d1b7ad/t/57777efd2994ca9e656fae14/1467449177459/Dennis+Parichy+Pt+1.mp3"
        },
        {
            "title": "Kellen McNally: Accuracy in surveys, models, and layouts lead to more successful designs",
            "datePublished": "Thu, 16 Jun 2016 05:54:05 +0000",
            "description": "When a production takes place in a 300 meter long tent that has to be set up with almost no margin for error, or spreads across hundreds of acres where environmental and safety requirements necessitate accurate placement of dozens of elements, who makes it happen?  As we become increasingly dependent on lighting and video previsualization, where do sufficiently accurate 3D models of venues come from?  After years of adjustments, renovations, and changes, what can venues do to get all their drawings and paperwork back on track?  Our guest Kellen McNally of Productions On Point has the answers.  He specializes in surveying, mapping, drafting, modeling, and layout for venues and sites of all kinds and at every step of the way.  We discuss the technology he uses, applications for the kind of services he provides, and why this kind of extreme accuracy in layout will become ever more critical.  We also had a chance to talk about entrepreneurship in the business – until a few years ago, Productions On Point was simply an idea Kellen got after watching a festival site get laid out inefficiently.  As always, thanks for downloading and listening!",
            "length": "50150083",
            "sourceUrl": "https://static1.squarespace.com/static/5403888de4b072d122d1b7ad/t/57623b08d1758ead80beacf0/1466055566024/Kellen+McNally.mp3"
        },
        {
            "title": "David Arch: here comes the general",
            "datePublished": "Wed, 01 Jun 2016 01:15:38 +0000",
            "description": "We want you to join us in the room where it happens with David Arch.  David is a multi-talented lighting director and lighting programmer, and among his credits are 40 Broadway shows including Hamilton.  Those, however, are only one part of a career that has spanned continents, genres and decades.  David got is start designing lighting for bands in his native Australia.  He made his way to the US while on tour with the band Icehouse, and made connections there that would lead to work on major rock tours.  That led to his first jobs on Broadway in 1996 and his career has built steadily since then; it now encompasses live television, major events, rock tours, and international theatricals.  When we sat down with David, he gave us some incredible insights into how the job of programmer came to be, what he had to do with molding it, and how he prefers to work and interact with lighting designers.  He told us about the early days of programming in New York, and how he and the others who were forging this new path found ways to help each other and grow the business.  He also went into detail about how he prepares shows to tour and some things everyone should know about negotiations.  As always, thanks for downloading and listening, and thanks to David for taking the time to join us!",
            "length": "73583393",
            "sourceUrl": "https://static1.squarespace.com/static/5403888de4b072d122d1b7ad/t/574e35e01bbee0f79eb53b12/1464743428485/David+Arch.mp3"
        },
        {
            "title": "Steve Lieberman: tripping the light fantastic",
            "datePublished": "Sun, 03 Apr 2016 00:18:57 +0000",
            "description": "A great light show has been an element of the most well-loved and successful nightclubs and music venues since Jules Fisher and Paul Marantz put together the iconic designs for Studio 54 40 years ago.  It took some time for promoters, club owners, and event producers to catch on, though – when Steve Lieberman entered the business 25 years ago, he didn't know he was getting in on the ground floor of an industry that was about to grow into a global powerhouse.  While he started lighting events and parties with 5000 attendees, he now lights massive, multi-day events that see 150,000 attendees per day.  From Electric Daisy Carnival to Ultra to Coachella, Steve and his company SJ Lighting travel the world using lighting, video, and scenery to create environments for festivals, EDM events, and nightclubs.  Steve joined us to discuss all elements of this unique part of the business, how both it and his career blossomed together, and how he assembles, manages, and operates the massive electronic dance music shows he is known for.  We also discussed his work as a nightclub designer, what documentation and paperwork go into making a club design actually work, and what some of the pitfalls are in that end of the business.  Many thanks to Steve for joining us, and many thanks to you for downloading and listening!",
            "length": "56733388",
            "sourceUrl": "https://static1.squarespace.com/static/5403888de4b072d122d1b7ad/t/57005b48356fb07515ff76ab/1459641181720/Steve+Lieberman.mp3"
        },
        {
            "title": "Daniel Connell: take us to church",
            "datePublished": "Wed, 16 Mar 2016 18:56:12 +0000",
            "description": "Lighting and production design for houses of worship combines the design needs and skills for theater, concerts, and television in a new segment of the industry.  This market is still evolving as more churches and organizations decide to add production to their services, and our guest Daniel Connell casts a long shadow in it.  Daniel worked in theater, concerts, and live events as a designer and technician before finding a home in church production, and he took some time from his busy schedule to tell us about his career, his thoughts on design, and the business itself.  Daniel discovered the lighting business in high school, and soon found his way to Theatrical Lighting Systems in Huntsville, AL.  He worked and toured with rock, Christian, and country music acts, but it was at Church On The Move in Tulsa that he found his true purpose.  Now, he specializes in live events and house of worship installations as both a lighting and production designer.  He described the rise of church production, told us about his design philosophy and inspirations, and shared some advice for people entering the business as both designers and technicians.  Thanks for downloading and listening!",
            "length": "54059702",
            "sourceUrl": "https://static1.squarespace.com/static/5403888de4b072d122d1b7ad/t/56e9a2d245bf2181ec5ae414/1458152193500/Daniel+Connell.mp3"
        },
        {
            "title": "Robert Mokry: on lighting service, guitars, and becoming a businessman",
            "datePublished": "Tue, 01 Mar 2016 23:27:10 +0000",
            "description": "What happens when a fixture is discontinued?  Normally manufacturers will continue support for a given length of time, but no matter how long that is, production/rental shops, venues, and other users don't stop using them.  More importantly, they don't stop needing spare parts for them – and that's where Robert Mokry and LightParts come in.  A reverse logistics company specializing in lighting equipment, their business may not be the stuff of splashy magazine features, but it is critical for their customers: they can provide new old stock parts, refurbished parts, newly manufactured parts they source, repairs for fixtures and consoles, and many other services.  We had a chance to sit down with Robert and discuss the company, how it came to be, and how it became as successful as it is.  We also discussed his career, his start with Blackstone A/V (which later became High End Systems), his work with products including designing the Wybron Nexera system, and how he found his place.  Robert also shared his thoughts on the present and future of the business, how others might find their own niches, and why he thinks that our industry is a solid one in an outsourced, global economy.  Thanks for downloading and listening!",
            "length": "59109514",
            "sourceUrl": "https://static1.squarespace.com/static/5403888de4b072d122d1b7ad/t/56d621a945bf21b64ca4e8f5/1456873927805/Robert_Mokry.mp3"
        },
        {
            "title": "Kelly O'Connell: designing, building, and installing educational theaters",
            "datePublished": "Wed, 17 Feb 2016 14:26:44 +0000",
            "description": "Kelly O'Connell joined the team at YES after working for the past decade as a professional Production Manager, Lighting Designer and Associate Designer in NYC and nationally. She's had to build systems from the tightest off-broadway budget to a fully funded 6000 seat outdoor theater. Most recently Kelly has been a Production Manager for; The Altman Building, Image Technologies Corporation, Shakespeare Festival St. Louis, The NYC Fringe Festival; an Associate Lighting Designer for; Ella (National Tour), Make Me A Song (NYC); and an Assistant Lighting Designer for The Fall of the House of Usher (Opera Francais de New York), The American Dream/The Sandbox (NYC) and The Beebo Brinker Chronicles (NYC). Kelly holds a Bachelor of Fine Arts in Theatrical Lighting Design from Webster University and is a proud Gorlock.   Outside of production, Kelly can be found running in Astoria Park, taking a figure drawing class, or obsessively checking her fantasy football team.",
            "length": "63024505",
            "sourceUrl": "https://static1.squarespace.com/static/5403888de4b072d122d1b7ad/t/56c4798ab654f95a0e559e70/1455716889359/Kelly+OConnell.mp3"
        },
        {
            "title": "Norman Coates Part 2: in service to his industry, his city, and his art",
            "datePublished": "Mon, 01 Feb 2016 15:29:33 +0000",
            "description": "We're back for more with the Director of Lighting at the UNCSA School Of The Arts Design and Production Department!  This time, we discuss an exciting project that serves the area around UNCSA, as well as the lighting students themselves: the Winston–Salem Light Project.  Students create major architectural lighting installations on landmark buildings and in other spaces, and in the process, are introduced to an entirely different part of the business from performance lighting.  We discussed Norman's professional career: his work on Broadway, in regional theater, on corporate events, and for opera, including his work during the summer at the Princeton Festival, and also had a chance to discuss his thoughts on the business itself.  We are immensely thankful that he was able to spend so much time with us.  Thanks for downloading and listening!",
            "length": "50334451",
            "sourceUrl": "https://static1.squarespace.com/static/5403888de4b072d122d1b7ad/t/56ae8fba05caa7d8e60fa030/1454280656483/Norman+Coates+Pt+2.mp3"
        },
        {
            "title": "Norman Coates Part 1: the life of a designer, the responsibilities of an educator",
            "datePublished": "Fri, 15 Jan 2016 16:15:38 +0000",
            "description": "Just over 40 years ago, Norman Coates took a trip from Philadelphia to New York to see a production of Waiting For Godot.  Before the show was over, he knew he'd found the art he truly loved.  Norman's passion for lighting has driven him to create stunning designs on Broadway and off, for national tours, in regional theaters and opera houses all over the US, as well as become the Director of Lighting in the Design and Production Department at UNCSA, a position he has held for over 25 years.  Join us for the first of two episodes with Norman, where we'll hear about his thoughts and philosophy on teaching lighting design, how the program at UNCSA works, and what responsibilities design schools have to their students and to the business.  How much should design schools tailor their coursework for the current state of the industry when the industry is always changing?  If we strive to teach the fundamentals, what are they?  Be sure to come back for the second half of the interview, when we'll discuss the Winston–Salem Light Project, Norman's professional career, and what advice he has for students and new professionals.",
            "length": "48968969",
            "sourceUrl": "https://static1.squarespace.com/static/5403888de4b072d122d1b7ad/t/56986748c647ad16c0477b2d/1452828511789/Norman+Coates+Pt+1.mp3"
        },
        {
            "title": "Haskell Wexler, ASC: Legendary cinematographer, 1922—2015",
            "datePublished": "Fri, 01 Jan 2016 17:31:21 +0000",
            "description": "On December 27, 2015, the legendary cinematographer Haskell Wexler, A.S.C. passed away at the age of 93.  He lived an incredible life, including a tour in the US Merchant Marine during World War II, and had an amazing career running from 1953 through his death, including winning two Academy Awards.  With 80 credits as cinematographer, he was judged to be one of film history's ten most influential cinematographers by members of the International Cinematographers' Guild.  Haskell's first big-budget feature as a cinematographer was Elia Kazan's America, America in 1963.  In 1966 he was cinematographer for Mike Nichols' film adaptation of Who's Afraid of Virginia Woolf?, for which he won the last ever Academy Award for Best Cinematography (Black & White).  The year after that, he was the cinematographer for the Oscar-winning In the Heat of the Night starring Sidney Poitier.  His work on that was extremely notable because it was the first major Hollywood film shot in color to be lit properly for a person of African descent.  In 2014, our friends at the Cinematic Immunity Podcast released a show featuring their interview with Haskell Wexler.  Both in light of his recent passing and the fact we’ve had so little information from the film world on this show, we’d like to share it with you now.  Cinematic Immunity features the art and craft of movie making and the stories that define it.  They are readying their second season for launch now, with more full-length interview shows like this one, as well as episodes that answer questions through a series of comprehensive interviews.",
            "length": "51753436",
            "sourceUrl": "https://static1.squarespace.com/static/5403888de4b072d122d1b7ad/t/56857ddd1c1210feadf2e8cb/1451589085561/Haskell+Wexler+ASC+CI.mp3"
        },
        {
            "title": "Chris Lose: lighting director and programmer on tour, on ships, and in demand",
            "datePublished": "Wed, 16 Dec 2015 00:57:24 +0000",
            "description": "Hailing from Las Vegas, Chris Lose has had a varied and consistently interesting 17-year career in the business.  He found theater in high school, went pro during college, got another education at Vari*Lite, went cruising as a production manager and lighting director, and went on tour as a dimmer tech.  He worked his way into the Cirque Du Soleil family, became the lighting designer at The Joint in the Hard Rock Hotel, then went back out on tour as a lighting director / programmer, first with The Voice, then with Fleetwood Mac.  Through all that time, Chris' skills and positive attitude have seen him get bigger shows, bigger responsibilities, and bigger chances to thrill the audience.  We got to talk about how he built his career, how he got to spend 18 months touring the world with Fleetwood Mac, and what makes a good programmer / lighting director.  We also discussed some of the responsibilities and surprises of his jobs, how a venue like The Joint works, and what he hopes comes next in the world of lighting control.",
            "length": "51979526",
            "sourceUrl": "https://static1.squarespace.com/static/5403888de4b072d122d1b7ad/t/5670b61c57eb8d7f286393aa/1450227228458/Chris+Lose.mp3"
        },
        {
            "title": "Randy Wade: the Morpheus circle is complete",
            "datePublished": "Tue, 01 Dec 2015 17:38:39 +0000",
            "description": "Randy is the Senior Accounts Manager at Morpheus Lights, which is both a major production rental shop as well as the US distributor for Ayrton LED lighting fixtures.  He has been in sales and rentals for 27 years, having gotten his start at Morpheus back in the early 80's and then moving on to work for and with many of the industry's leaders and innovators.  Randy has been back with Morpheus for just over a year, and both he and they are up to some very exciting things!  Randy's career has given him some amazing insight into the business, how it works, and what has changed over time.  We heard about Randy's time as a writer and editor with Performance Magazine, a critical publication at a critical time for our industry, his initial time with Morpheus when he was responsible for handling some of their highest profile clients, and what was required to supply audio for the main stage at Woodstock '94.  We also got to discuss the Ayrton product line that Morpheus distributes, including the MagicPanel, MagicBlade, DreamPanel Twin, and the amazing CosmoPix-R.  Finally, Randy has become a proponent and part of the Event Safety Alliance, a non-profit trade association created by Jim Digby committed to eliminating unsafe behaviors and conditions throughout our industry.  Safety for performers, technicians, and audience members is something that should come first for every member of the business, so check them out.",
            "length": "58753391",
            "sourceUrl": "https://static1.squarespace.com/static/5403888de4b072d122d1b7ad/t/565dab3be4b037abaf1fbc3a/1448979259984/Randy+Wade.mp3"
        },
        {
            "title": "Miriam Nilofa Crowe: creating lighting, creating community, and the business of art",
            "datePublished": "Sun, 15 Nov 2015 09:06:59 +0000",
            "description": "Miriam Crowe has been a lighting designer for nearly 20 years, and has worked at every level of the business, from the Fringe Festival to Broadway.  She is a founding member of Wingspace Theatrical Design, a design collective which promotes collaboration in and fosters larger conversations about design.  She also designs lighting for diverse musical acts, from Rosanne Cash to Lila Downs.  She is based in New York, but has traveled extensively throughout her career for musical and theatrical performances.  Many of the musical acts Miriam designs for do not tour with their own lighting package, so we discussed how she creates a consistent look for her artists while dealing with very different equipment from day to day.  We discussed her design process, as well as some of her recent work as a venue consultant.  We also got to talk about the business of design and the business of theater.  Check out Miriam's full profile and info on the Wingspace Theatrical Design site. Wingspace offers monthly salons at its space in Brooklyn.  Check their website to learn more – there is one scheduled for 11/16 which your host plans to attend.  Thanks for downloading and thanks for listening!",
            "length": "60220869",
            "sourceUrl": "https://static1.squarespace.com/static/5403888de4b072d122d1b7ad/t/56476e42e4b0efb65372454f/1447521858663/Miriam+C.mp3"
        },
        {
            "title": "Chris Conti: managing some of the most exciting developments in the business",
            "datePublished": "Sun, 01 Nov 2015 16:26:41 +0000",
            "description": "When Chris Conti became a PRG Product Manager in 2008, he became part of a team responsible for moving the goalposts on the state of the art.  He is now the manager for PRG Bad Boy, PRG Best Boy, Series 400 Power & Data Distribution System, and the newly launched GroundControl Remote Followspot System, which won Best Debuting Product in Staging and Rigging at LDI.  His position is a fascinating amalgamation of specifier, designer, and advocate.  Chris became part of Vari*Lite after college, and joined PRG during its merger with VLPS.  He gained extensive experience as a touring crew chief and automated lighting technician with Vari*Lite; that helps him and his colleagues as they strive to create proprietary products and solutions that are not only innovative, but also reliable.  Join your host Jason Marin and co-host Theresa Unfried as we sit down with Chris to discuss his current job, how he found his way there, and the present and future of the business.  Thanks for downloading and listening!",
            "length": "57080316",
            "sourceUrl": "https://static1.squarespace.com/static/5403888de4b072d122d1b7ad/t/5635d3fbe4b03f820858ac4f/1446368251589/Chris+Conti.mp3"
        },
        {
            "title": "Vickie Claiborne: control systems expert and educator extraordinaire",
            "datePublished": "Thu, 15 Oct 2015 16:23:07 +0000",
            "description": "When Vickie Claiborne became the head lighting programmer for the opening and closing ceremonies during the 2000 Olympics in Sydney, she was just getting started.  Over the course of her distinguished 25 year career, she has programmed lighting and media for shows – and trained lighting & media programmers – all over the world.  Join us as we discuss how she went from a small theater in Branson, Missouri to the Rock In Rio festival earlier this year, how thoughts on training & education, and how a lighting programmer can get into media programming.  Vickie was Programmer and Training Manager for High End Systems until 2006, where she handled hundreds of shows and trained thousands of programmers on Wholehog 2 and Hog 3 products.  In 2008, she joined PRG Las Vegas as a Product Specialist, where she is responsible for supporting every control system PRG provides as well as the Series 400 Power & Data Distribution System.  She also continues to program and design shows, including the massive New Years Eve event at the Aria resort in Las Vegas.  Vickie's passion for education and helping others led her to write her first book, Media Servers For Lighting Programmers, published by Focal Press.  In the book, as she does in her many other roles, Vickie calls on her vast experience in lighting and media to explain, clarify, and teach.  Vickie is also is a contributing writer for PLSN magazine, covering digital media topics.  If you're attending LDI this year, you can catch Vickie on the four Art Of Programming panels, all taking place on Thursday, 10/22.  She's also on Twitter at vickieclaiborne.  Thanks for checking out our latest episode!",
            "length": "70960780",
            "sourceUrl": "https://static1.squarespace.com/static/5403888de4b072d122d1b7ad/t/562aab22e4b0d2d66409d6d9/1445636898549/Vickie+C_A.mp3"
        },
        {
            "title": "Brad Schiller Part 2: Building The Machines",
            "datePublished": "Thu, 01 Oct 2015 15:04:57 +0000",
            "description": "In order for us to go through the process of creating lighting for theatricals, events, broadcasts, films, and performances, any number of other creative processes needed to happen first – including the specification, design, and engineering of fixtures and control consoles.  We dive into some of those in the second half of our interview with Brad Schiller, and discuss his time as a product manager for High End Systems and Philips Vari*Lite, and his current job as Business Development Manager for Lighting Rental & Touring at Martin Professional.  For more Brad, check out the first half of our interview when we talked about his work as a lighting director, programmer and writer, including his book The Automated Lighting Programmer's Handbook and monthly PLSN column about programming.  If you're attending LDI this year, you can catch Brad on the four Art Of Programming panels, all taking place on Thursday, 10/22.  Brad also writes In The Know, an insider blog about Martin Professional.  Thanks for listening to our latest episode!",
            "length": "53605841",
            "sourceUrl": "https://static1.squarespace.com/static/5403888de4b072d122d1b7ad/t/560d4548e4b0ac178f349e1d/1443710328838/Brad-S+Pt2.mp3"
        },
        {
            "title": "Brad Schiller Part 1: Feeding The Machines",
            "datePublished": "Tue, 15 Sep 2015 13:37:15 +0000",
            "description": "Brad Schiller was there as the job of Automated Lighting Programmer emerged, and he has influenced the job's evolution over the last 25 years as he moved from freelance to High End Systems to Philips Vari*Lite to Martin Professional.  We sat down with Brad and discussed his remarkable career, but the interview was so packed with information that we decided to present it as two episodes.  In this episode, we discuss his philosophy on programming and how he's seen the programmer's role evolve, his work on the 2000 Sydney Olympics Opening and Closing Ceremonies, his time with the band Crystal Method, and how he became part of the High End Systems programming department at a critical time for both he and they.  Brad is also a writer – we discussed Brad's book The Automated Lighting Programmer's Handbook, which has helped many programmers along their way, including your host.  Brad also has a monthly PLSN column about programming, Feeding The Machines.  If you're attending LDI this year, you can catch Brad on the four Art Of Programming panels, all taking place on Thursday, 10/22.  Brad also writes In The Know, an insider blog about Martin Professional.",
            "length": "61651979",
            "sourceUrl": "https://static1.squarespace.com/static/5403888de4b072d122d1b7ad/t/55f81d72e4b0922dfea296bc/1442323871106/Brad-S.mp3"
        },
        {
            "title": "Laura Frank: Building a new paradigm for media management, programming, and planning",
            "datePublished": "Tue, 01 Sep 2015 12:23:45 +0000",
            "description": "Today's televised events tend to lean heavily on video; in some cases, 80% of the scenery is actually a video surface.  How does the content for all that real estate get created, handled and played back seamlessly?  To find out, we sat down with Laura Frank: a screens producer working on some of the highest profile events in the world, including the MTV Video Music Awards, the CMT Music Awards, and Black Girls Rock!, as well as theatricals, corporate events, films, and other events too numerous to mention.  Laura got her start working electrics in New York in the early 90's, and quickly found a home at the lighting desk.  She distinguished herself as a top-flight programmer on the Hog, MA, Virtuoso, and Icon consoles, programming on Broadway, for feature films, and on major events.  When she saw digital lighting on the horizon, she started changing direction, and today works entirely in media.  Through her company, Luminous FX, she provides the full gamut of services needed to turn a great idea into an amazing show: content templates & specification, 3D design visualization, content production, and server programming.  Laura says that in her role as screens producer, she's not a designer, not a technician, but a creative partner.  She discusses and shares the tools and solutions she uses for multi-screen video environments at LFX Studio.  Thanks for joining us for Season 2!",
            "length": "71441280",
            "sourceUrl": "https://static1.squarespace.com/static/5403888de4b072d122d1b7ad/t/55e534cbe4b090d9bdf63867/1441084657306/Laura+Frank.mp3"
        },
        {
            "title": "Bobby Hale: High End fixtures need high-end solutions",
            "datePublished": "Tue, 16 Jun 2015 11:57:32 +0000",
            "description": "How are complex automated lighting fixtures conceived, designed, and built?  Our final guest of Season One, Bobby Hale, has some answers to that question – he is a Business Development Manager with High End Systems, and has been with High End for over 15 years.  While he works in sales now, he was a product manager and engineering operations manager for many of those years in Austin, TX.  During this episode, we look in depth at High End's new SolaSpot Pro 1500 fixture, the history of High End and some of the innovations they brought to the market, and what Bobby does at HES. The SolaSpot Pro 1500 is a white light LED fixture which produces 20,000 lumens using a 400w source, creates an excellent flat field with crisp pattern and shutter edges, and generates very little noise.  We discussed how it, and other products from HES history, came to be, and what high-output white light LED sources can do for us now and in the future.  Join your host Jason Marin and returning co-host Theresa Unfried as we learn about ground-up fixture design, how LED sources can and will replace short arc lamps, and how things work in the design and engineering departments at High End.",
            "length": "60041918",
            "sourceUrl": "https://static1.squarespace.com/static/5403888de4b072d122d1b7ad/t/557f6a7ae4b0bdc1b3846900/1434413779915/Bobby+Hale.mp3"
        },
        {
            "title": "Anne E. McMills: She wrote the book on Assistant Lighting Design",
            "datePublished": "Mon, 01 Jun 2015 14:13:06 +0000",
            "description": "Anne McMills knows well how important the job of Assistant Lighting Designer is.  She has been an Assistant and Associate LD on an incredible array projects over the last 15 years, from Broadway to Vegas to touring to television, and has employed many Assistant and Associate LDs  on her own design projects all over the US.  A unique and interesting combination of skills and knowledge are required for the job, but for all of its importance, there have been few reliable resources for learning about it.  Anne has decided to change that by creating the Assistant Lighting Designer's Toolkit, a resource that provides description, instruction, paperwork, and strategies as well as offering the voices and points of view of dozens of other working professionals.  Join your host Jason Marin and returning co-host Carrie Wood as we discuss Anne's career.  We talked about her theatrical lighting and projection design, her work on with previous guest Fred Bock on The Tonight Show, her experience with architectural lighting design firm E Squared Lighting Design, and her role as head of Lighting Design at San Diego State University.  We also discussed how her book came to be and how she fit writing it into her already busy schedule.",
            "length": "60184023",
            "sourceUrl": "https://static1.squarespace.com/static/5403888de4b072d122d1b7ad/t/556c58cde4b0bb8518881b3a/1433164082157/AnneMcMills.mp3"
        },
        {
            "title": "Panel Discussion at 4 Wall NY: today's DJ's, tomorrow's designers",
            "datePublished": "Sat, 16 May 2015 14:17:20 +0000",
            "description": "To help new people them find their way, Al Ridella and CJ Wescott of 4 Wall Entertainment reached out to DJs and nascent production companies working in events in the NY Metro, and invited them to a panel discussion about this end of the business.  Your host was one of the panelists, as were Zach Lambrinon of Intelligent Lighting at the Waldorf Astoria Hotel, and Zakaria Al-Alami of Arc3 Design and Jazz At Lincoln Center.",
            "length": "48704751",
            "sourceUrl": "https://static1.squarespace.com/static/5403888de4b072d122d1b7ad/t/5556bf04e4b003c250fdfa8a/1431748373896/DJevent-r.mp3"
        },
        {
            "title": "Fred Bock: Making a home at 30 Rock",
            "datePublished": "Fri, 01 May 2015 12:33:03 +0000",
            "description": "Back when he was completing a double major in theater and broadcasting, Fred Bock dreamed that he'd be able to make 30 Rockefeller Center his workplace.  He made that dream into a reality, one that has included working on Rock Center, Today Show, Nightly News, Football Night in America, Macy’s Fourth of July Fireworks Spectacular, Carson Daly New Year's Eve and Saturday Night Live at the NBC studios there.  Most significantly, he also became the lighting designer and lighting director for The Tonight Show With Jimmy Fallon.  Along the way, he was nominated for 3 Prime Time Emmy Awards for his work on Late Night With Conan O'Brien; lit the U.S. Open Tennis Tournament, ESPNU, Difference Makers and NFL Draft Confidential for ESPN; and has been involved with numerous NBC Upfronts.  For much of his career, he has been a part of the FLDA team, specialists in lighting design for multi-camera television production.",
            "length": "58236301",
            "sourceUrl": "https://static1.squarespace.com/static/5403888de4b072d122d1b7ad/t/55436f4be4b03d711b2b34b4/1430482798776/Fred+Bock.mp3"
        },
        {
            "title": "Mike Baldassari Part 2: theater, concerts, touring, and real estate",
            "datePublished": "Wed, 15 Apr 2015 13:43:21 +0000",
            "description": "Concerts and theater share many things, from the uniqueness of any single performance to the dedication of their artists to the techniques used to move them from venue to venue.  One other thing they share is Mike Baldassari, who has lit innumerable concerts on tour, on stage, and on film, and has lit plays and musicals from Broadway to Moscow.  In this episode, we discuss Mike's theatrical and concert lighting designs, the touring he's done, and the state and business of show business.",
            "length": "59512357",
            "sourceUrl": "https://static1.squarespace.com/static/5403888de4b072d122d1b7ad/t/552db85ce4b0ea5ecd75399d/1429059770292/Mike+Baldassari+p2.mp3"
        },
        {
            "title": "Mike Baldassari, Part 1: from The Garden to The Road to The Street",
            "datePublished": "Wed, 01 Apr 2015 13:02:00 +0000",
            "description": "It was 1977, and Mike was headed to a Kiss concert at Madison Square Garden.  The audience blinders came up, 20,000 people cheered, and Mike knew he'd found a home.  Since then, he has lit Broadway musicals, including collaborating on Cabaret with the great Peggy Eisenhauer; television shows, including episodes of Saturday Night Live; theatrical tours, including Camelot; major events live to broadcast, including A (RED) THANK YOU; concerts, including tours with icon Neil Young; and feature films, including Nine.  All that said, Mike's greatest strength may be his ability to draw inspiration and practice from one genre for use in another. ",
            "length": "65062864",
            "sourceUrl": "https://static1.squarespace.com/static/5403888de4b072d122d1b7ad/t/551b4207e4b00eb2216df654/1427849978896/Mike+Baldassari.mp3"
        },
        {
            "title": "Richard Tatum: Stylish spotlights for socialites",
            "datePublished": "Sun, 15 Mar 2015 20:36:39 +0000",
            "description": "Richard Tatum was following the path that many had followed: BFA, MFA, work in theater, work in television – and then he answered an ad in ArtSearch.  That ad brought him into a new world: one of high-end social events, glittering parties, and benefit galas attended by New York's socialites and philanthropists.  Instead of treating lighting for social events like an assembly line, he treats every event as unique, and in so doing he created a career that resulted in him becoming managing partner, lighting designer, and director of production services at L & M Sound and Light.  Join your host Jason Marin and co-host Theresa Unfried as we discuss elements from Richard's career, including events at the Metropolitan Museum of Art, in landmark spaces throughout metro NY, and in the summer playgrounds of the glitterati.",
            "length": "57583479",
            "sourceUrl": "https://static1.squarespace.com/static/5403888de4b072d122d1b7ad/t/5505ebb3e4b04d6f09d5e6ba/1426451399183/Richard+Tatum.mp3"
        },
        {
            "title": "Chris Lee: a life in the theater starts with a single light cue",
            "datePublished": "Sun, 01 Mar 2015 03:30:59 +0000",
            "description": "From the first time he saw a Jules Fisher design on stage, Chris Lee knew what he wanted to be. His passion for theater has taken him to Broadway, the West End, Tokyo, and all around the world, creating lighting for theatricals, film, opera, television, cruise ships, theme parks, and Las Vegas spectacles. During the journey, Chris has been nominated for numerous awards, and he's taken home a Helen Hayes Award and an Artvoice Artie Katherine Cornell Award. Join your host Jason Marin and co-host Theresa Unfried as we discuss elements from Chris' 25-year career in the arts.  We discussed the theatrical projects Martin Short: Fame Becomes Me and Shakespeare's R & J in depth, learned about the process of designing a massive theme park show from the ground up, and got a look at the more corporate world of automobile events.  We also talked about his lengthy and productive relationship with the Signature Theatre; he's designed over 40 shows there.",
            "length": "65622962",
            "sourceUrl": "https://static1.squarespace.com/static/5403888de4b072d122d1b7ad/t/54f27ddee4b01a4293a54de4/1425178120733/Chris+Lee.mp3"
        },
        {
            "title": "John Tees: a gaffer and lighting director with a theatrical heart",
            "datePublished": "Sun, 15 Feb 2015 13:52:59 +0000",
            "description": "Sometimes, it just feels right – John Tees started his professional career at the age of 14, and hasn't slowed down since.  Over the past 35 years, he's built a career as a gaffer, production electrician, and lighting designer, and that career has taken him all over the world.  Today, he splits his time between fashion shows in NY and Miami, corporate events throughout the US, daytime television, and his theatrical home at Second Stage Theater.",
            "length": "54172569",
            "sourceUrl": "https://static1.squarespace.com/static/5403888de4b072d122d1b7ad/t/54dd6c53e4b08189484435f2/1423797408367/JT3.mp3"
        },
        {
            "title": "Shawn Kaufman: from opera to fashion to fixture design",
            "datePublished": "Sun, 01 Feb 2015 20:14:54 +0000",
            "description": "For nearly 20 years, Shawn Kaufman has been creating unforgettable environments on stage and in event spaces around the world.  Shawn as been a lighting designer for opera and theater, has run the lighting departments of major production houses, and is now director of CS Lighting, a division of event production firm CS Global.  He has never shied away from adopting new technologies as long as they served his purpose, and is now responsible for having created his own LED lighting fixture, the SFK.  We and Shawn discussed how the design and manufacturing process of a new unit works, what went into starting the CS Lighting division of CS Global from scratch and what Shawn has been able to bring to events from the theater and opera world.  Finally, we talked about the value of the arts in our culture and the dangers of supporting only top-end arts presentation.",
            "length": "68226809",
            "sourceUrl": "https://static1.squarespace.com/static/5403888de4b072d122d1b7ad/t/54ce8153e4b0c7f1d6b70493/1422819688904/Shawn+Kaufman.mp3"
        },
        {
            "title": "Kevin Campbell: 30 years of visuals, from slide projectors to the D3 media server",
            "datePublished": "Thu, 15 Jan 2015 14:00:00 +0000",
            "description": "Kevin Campbell has always pressed technology into use to serve his purpose: creating mood, atmosphere, light, and artistry with imagery. Visit him at Videovisuals.tumblr.com after the show. Kevin has worked with bands of every size to create imagery and 3D video environments for their tours and one-off performances, with directors to add layers of atmosphere to their theatrical productions, and with event producers to fill parties with psychedelic visuals and light.  He has used NASA 3-gun projectors, built VJ rigs to his own specifications, and worked with one of the greatest video artists of them all, Nam June Paik.",
            "length": "51487235",
            "sourceUrl": "https://static1.squarespace.com/static/5403888de4b072d122d1b7ad/t/54b5c44ce4b04c160a1af959/1421198455709/Kevin+Campbell.mp3"
        },
        {
            "title": "Al Crawford: designer, business owner, educator, empire builder",
            "datePublished": "Fri, 02 Jan 2015 11:22:28 +0000",
            "description": "Al Crawford has his hands in just about everything in the lighting business.  On any given week, he and his team from Arc3 Design might be supervising lighting on an Alvin Ailey American Dance Theater tour, lighting a state dinner at the White House, cueing a theatrical performance, choosing fixtures for a building facade, or reviewing applicants for a design fellowship.  Join your host Jason Marin and returning co-host Theresa Unfried as we discuss Al's company, projects, and workflow.  We discussed what happens in preparation for and during an Alvin Ailey tour, what excites and frustrates him about the state of lighting technology, and where he sees the business going in the future.  We also talked about a few things people entering the business should know, including some information about the Gilbert Hemsley Lighting Fellowship.",
            "length": "64827108",
            "sourceUrl": "https://static1.squarespace.com/static/5403888de4b072d122d1b7ad/t/54a67ddce4b01e05d9a97a02/1420197366491/Al+Crawford.mp3"
        },
        {
            "title": "Seth Bernstein: film shoots, fashion, camera ready events, and video design",
            "datePublished": "Mon, 15 Dec 2014 18:43:53 +0000",
            "description": "It's no accident that some events look great when you see photos from them on Instagram. Seth brings his knowledge of film and video to every project he designs, resulting in seamless integration and a flawless look both on the pro cameras and on the ubiquitous phone camera.  He also uses video as a component in some of his designs, using his experience editing video to create content and to determine how to satisfy his clients. Join Jason and returning co-host Theresa Unfried of TAJ Event Productions as we discuss video and lighting integration, what we should know about cameras, and how Seth makes his projects sparkle.",
            "length": "62294739",
            "sourceUrl": "https://static1.squarespace.com/static/5403888de4b072d122d1b7ad/t/548f2a92e4b06f8a5b848555/1418668690355/Seth+Bernstein.mp3"
        },
        {
            "title": "George Gountas: making the biggest lighting rigs work every time",
            "datePublished": "Mon, 01 Dec 2014 14:05:00 +0000",
            "description": "We to discuss George's career, how he found his way, and what he does to stay present in his families' life while doing the job.  We discussed the job of gaffer in detail, how it it both similar and different from being a production electrician, and how critical joining a labor union can be for people who plan to make a career in the business.",
            "length": "63929861",
            "sourceUrl": "https://static1.squarespace.com/static/5403888de4b072d122d1b7ad/t/547b7a93e4b04a873e3ad4a1/1417378451826/George+Gountas.mp3"
        },
        {
            "title": "Mitchell Bogard: TV LD from Rachael's kitchen to Big Bird's nest",
            "datePublished": "Sat, 15 Nov 2014 21:09:43 +0000",
            "description": "During a career spanning over 35 years, Mitchell has lit a huge number of television shows, theatricals, and dance performances.  His TV work has included lighting Rachael Ray, David Letterman, and Big Bird.  Join your host Jason Marin and co-host Stephanie Shechter as we sit down with Mitchell to discuss his career, daily operations on a television show, and some of the remarkable things he's done.",
            "length": "64779942",
            "sourceUrl": "https://static1.squarespace.com/static/5403888de4b072d122d1b7ad/t/5467bf58e4b027170e73af14/1416085336207/Mitchell+Bogard.mp3"
        },
        {
            "title": "Marty Postma: Concert LD, media designer, lighting & video programmer",
            "datePublished": "Sat, 01 Nov 2014 19:45:38 +0000",
            "description": "Marty has designed lighting and media for some of the largest musical acts around and has toured all over the world with them.  He has also programmed for other designers, on projects ranging from feature films to ice shows to televised galas, and has a reputation for staying cool no matter how much pressure is on.  Join your hosts Jason Marin and Stephanie Shechter as we discuss the challenges of designing, assembling, and touring a concert system, the challenges of working live with an artist in a festival environment, the business of design and handling changing client expectations, and Marty's earlier work in New York's biggest nightclubs.",
            "length": "65947349",
            "sourceUrl": "https://static1.squarespace.com/static/5403888de4b072d122d1b7ad/t/54553810e4b0c28f3a03e010/1414871056130/Marty+Postma.mp3"
        },
        {
            "title": "Eric Cornwell: master of software and lighting design ",
            "datePublished": "Wed, 15 Oct 2014 13:00:00 +0000",
            "description": "Eric has had a long and distinguished lighting design career, working everywhere from Broadway to Beijing.  We discuss the art, business, and life of lighting design, technology's place in the industry, and how Eric became one of the first wave of developers serving the lighting industry.",
            "length": "133842835",
            "sourceUrl": "https://static1.squarespace.com/static/5403888de4b072d122d1b7ad/t/543affe9e4b0747aca2ee0a4/1413152745038/Eric+Cornwell.mp3"
        },
        {
            "title": "Matt DeLong, a Rosco product manager and much more",
            "datePublished": "Wed, 01 Oct 2014 14:26:53 +0000",
            "description": "Have you ever wondered how a product goes from an idea in a user's mind or an inventor's imagination to something you can have shipped overnight, anywhere in the world?  Matt joins us to discuss product development and manufacturing, how users can influence what products and features manufacturers focus on, safety on stage and on set, the changes in the business that have resulted from increased investment, and Rosco Labs itself.",
            "length": "45510656",
            "sourceUrl": "https://static1.squarespace.com/static/5403888de4b072d122d1b7ad/t/542c0e06e4b05bfcb6d358e1/1412173318531/Matt+Delong.mp3"
        },
        {
            "title": "Chris McMeen, an account executive with a passion for theater",
            "datePublished": "Sat, 20 Sep 2014 15:28:10 +0000",
            "description": "Chris came from a theatrical household, and has had a long history with lighting and production rentals.  We talked about the importance of client education, the intricate relationships of manufacturers and dealers, the state of the lighting rental business, and how his love of theater drove his desire to help lighting designers and their teams meet their goals.",
            "length": "53512192",
            "sourceUrl": "https://static1.squarespace.com/static/5403888de4b072d122d1b7ad/t/541d9b07e4b000f167ff98ec/1411226375397/Chris+McMeen.mp3"
        },
        {
            "title": "Guy Smith: designer, programmer, producer",
            "datePublished": "Sat, 06 Sep 2014 15:10:00 +0000",
            "description": "It's a long way from being a professional therapist in Boston to lighting a dance party on the top deck of a 5400 person crusie ship.  Guy Smith joins us to talk about programming dance events, designing on cruise ships, becoming a producer, working internationally, and how he became one of the most sought-after designer/programmers in the business",
            "length": "45350912",
            "sourceUrl": "https://static1.squarespace.com/static/5403888de4b072d122d1b7ad/t/540dd1ffe4b091e569d768bd/1410191871389/Guy+Smith.mp3"
        }
    ]
}