{
    "artwork": "http://is3.mzstatic.com/image/thumb/Music4/v4/94/1e/0b/941e0b4f-f316-2086-6de6-b5f08c76d60b/source/100x100bb.jpg",
    "description": "The CoasterBuzz Podcast brings you the week's amusement industry news with analysis and special guests.",
    "feedURL": "http://feeds.feedburner.com/CoasterBuzzPodcast",
    "podcastURL": "http://podcast.coasterbuzz.com/",
    "publisher": "Jeff",
    "title": "CoasterBuzz Podcast",
    "episodes": [
        {
            "title": "CoasterBuzz Podcast #213 - March 30, 2020",
            "datePublished": "Mon, 30 Mar 2020 00:00:00 GMT",
            "description": "<p>Jeff, Carrie, Mike and Gonch reunite after more than seven years to talk about what they're up to, and ponder the future of amusement parks in a post-pandemic world.</p><img src=\"http://feeds.feedburner.com/~r/CoasterbuzzPodcast/~4/jvCkh9DzKUY\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "89861877",
            "sourceUrl": "http://feedproxy.google.com/~r/CoasterbuzzPodcast/~5/b0jsWn5Gjtk/215"
        },
        {
            "title": "CoasterBuzz Podcast #212 - September 17, 2012",
            "datePublished": "Mon, 17 Sep 2012 03:50:49 GMT",
            "description": "<p>Jeff and Carrie talk about stuff that is loosely related to roller coasters and the amusement industry.</p>\r\n\r\n<ul>\r\n<li>It sure has been a long time since we did this.</li>\r\n<li>The noise in online communities (football and politics).</li>\r\n<li>Cliques, inside jokes, making the community better by participation.</li>\r\n<li>Voting up posts, the scoring game.</li>\r\n<li>The process of moving cross-country, Carrie and Jeff share their stories.</li>\r\n<li>The wing coaster is an interesting \"thing\" now for coaster enthusiasts. Jeff approves of the Dollywood ride.</li>\r\n<li>Cedar Point's new front end, with GateKeeper.</li>\r\n<li>A great year of fundraising for Give Kids The World across several events. Jeff explains why CoasterBuzz supports it, and why you should help.</li>\r\n<li>Another good year coming for new rides. Jeff shows love for Premier Rides.</li>\r\n<li>Is Kentucky Kingdom ever really going to come back?</li>\r\n<li>Attention Conneaut Lake Park: It's a business, not a constant fundraiser.</li>\r\n<li>Jeff would totally pay for a tour of the rotting Six Flags New Orleans.</li>\r\n<li><a href=\"http://coasterbuzz.com/Content/BooBuzz2012\">BooBuzz</a> is coming up October 12 at Cedar Point.</li>\r\n<li><a href=\"https://coasterbuzz.com/JoinClub.aspx\">CoasterBuzz Club is eleven years old!</a></li>\r\n\r\n<li>You can get the latest headlines on CoasterBuzz from the Twitter. Follow us <a href=\"http://twitter.com/coasterbuzz\" target=\"_blank\">@coasterbuzz</a>. You can also <a href=\"http://www.facebook.com/coasterbuzz\" target=\"_blank\">like us on Facebook</a>.</li>\r\n<li>CoasterBuzz Club is $25 per year. <a href=\"https://coasterbuzz.com/JoinClub.aspx\">You can join or renew today.</a> Enjoy CoasterBuzz with no ads.</li>\r\n</ul><img src=\"http://feeds.feedburner.com/~r/CoasterbuzzPodcast/~4/2RNGzzd5_Co\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "33397645",
            "sourceUrl": "http://feedproxy.google.com/~r/CoasterbuzzPodcast/~5/NjK0urld2cY/214"
        },
        {
            "title": "CoasterBuzz Podcast #211 - November 14, 2011",
            "datePublished": "Mon, 14 Nov 2011 04:47:58 GMT",
            "description": "<p>Jeff, Gonch and Mike review this week's news in the amusement industry.</p>\r\n\r\n<ul>\r\n<li>New Orleans can't sell the former Six Flags site. Is it even viable? How is the city doing?</li>\r\n<li>Cedar Fair going to spend $90 million in its amusement parks. Leviathan is the big one at Canada's Wonderland.</li>\r\n<li>US travel goes a long way, some people don't feel like they need to leave the country.</li>\r\n<li>Not a lot of 300-foot roller coasters open, so any new one is an event.</li>\r\n<li>Universal Orlando continues to score big time, mostly because of the Harry Potter attractions. Jeff is playing Lego Harry Potter Years 5-7.</li>\r\n<li>Dollywood's Wild Eagle is track complete. Jeff has high hopes for this B&M flavor, particularly with Dollywood's terrain and tree retention.</li>\r\n<li>Remember what a big deal it was when the first floorless roller coaster opened in 1999?</li>\r\n<li>Speed won't be a part of the new Sahara, which is a bummer.</li>\r\n<li>Dippin' Dots files for bankruptcy.</li>\r\n<li>Jeff is skipping IAAPA this year, but is regretting it, missing people. Hopes to go next year.</li>\r\n<li>Coney Island has a record year, which has to be good for Zamperla. Will the numbers stay up after a year of newness?</li>\r\n<li>Occupy is all about the free camping. <a href=\"http://occupy.sillynonsense.com/\" target=\"_blank\">Occupy Sillynonsense!</a>.</li>\r\n<li>Welfare dollars appear in Orlando from Missouri. Moral and political debate ensues.</li>\r\n<li>Disney hitting much higher margins as room rates jump. Jeff researches some packages. The magic of Disney is mostly paying for as much as possible ahead of time.</li>\r\n<li>When you work from home, every day is pants optional day.</li>\r\n<li><a href=\"https://coasterbuzz.com/JoinClub.aspx\">CoasterBuzz Club is ten years old!</a></li>\r\n\r\n<li>You can get the latest headlines on CoasterBuzz from the Twitter. Follow us <a href=\"http://twitter.com/coasterbuzz\" target=\"_blank\">@coasterbuzz</a>. You can also <a href=\"http://www.facebook.com/coasterbuzz\" target=\"_blank\">like us on Facebook</a>.</li>\r\n<li>CoasterBuzz Club is $25 per year. <a href=\"https://coasterbuzz.com/JoinClub.aspx\">You can join or renew today.</a> Enjoy CoasterBuzz with no ads.</li>\r\n</ul><img src=\"http://feeds.feedburner.com/~r/CoasterbuzzPodcast/~4/M_zNKq5qWPw\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "31145282",
            "sourceUrl": "http://feedproxy.google.com/~r/CoasterbuzzPodcast/~5/YAOsu5nbI4k/213"
        },
        {
            "title": "CoasterBuzz Podcast #210 - October 31, 2011",
            "datePublished": "Mon, 31 Oct 2011 03:41:50 GMT",
            "description": "<p>Jeff, Carrie and Mike review this week's news in the amusement industry.</p>\r\n\r\n<ul>\r\n<li>Obligatory excuses about why we haven't had a show in a month and a half.</li>\r\n<li>As quarterly results come in for amusement park companies, the results just keep getting better and better. So how is it that the economy is allegedly so terrible?</li>\r\n<li>How did Six Flags realize a 44% boost in profit?</li>\r\n<li>The national tone toward the economy is so negative. From the tea bag to the occupy movement, no one actually seems interested in innovating or doing anything.</li>\r\n<li>Carrie talks about perspective: This ain't the Great Depression.</li>\r\n<li>Where did hamburgers come from?</li>\r\n<li>Mike is a Disney Kool-Aid® drinking freak.</li>\r\n<li>Jeff describes his drive back across the country. And his new drill. That thing can screw.</li>\r\n<li>PETA sues SeaWorld for slavery. The whales are apparently making keychains 20 hours a day for sale in the gift shop.</li>\r\n<li>Legoland Florida opened, and Jeff wants to go next year. Mike will skip it because his kids are princess freaks.</li>\r\n<li>Jeff finally understands why Disney has so many parades. His 20-month-old loved the Halloween parade at Cedar Point.</li>\r\n<li>Does anyone know the total number of boat rides inside the gates of Disney World's four parks?</li>\r\n<li>The cast is disappointed about the no-duel rule of Dragon Challenge at Universal's Islands of Adventure. Despite the gruesome accident, we hate that it can't just be chalked up to \"bad things happen.\"</li>\r\n<li>Carrie gives a shout out to the staff of Dorney Park for the VIP tour service.</li>\r\n<li>Several parks out east have their seasons cut short because of the crazy Nor'easter storm that dumped snow on them.</li>\r\n\r\n<li>You can get the latest headlines on CoasterBuzz from the Twitter. Follow us <a href=\"http://twitter.com/coasterbuzz\" target=\"_blank\">@coasterbuzz</a>. You can also <a href=\"http://www.facebook.com/coasterbuzz\" target=\"_blank\">like us on Facebook</a>.</li>\r\n<li>CoasterBuzz Club is $25 per year. <a href=\"https://coasterbuzz.com/JoinClub.aspx\">You can join or renew today.</a> Enjoy CoasterBuzz with no ads.</li>\r\n</ul><img src=\"http://feeds.feedburner.com/~r/CoasterbuzzPodcast/~4/7qSZ1tJBM4A\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "31492625",
            "sourceUrl": "http://feedproxy.google.com/~r/CoasterbuzzPodcast/~5/8ZwVRaO1_Ac/212"
        },
        {
            "title": "CoasterBuzz Podcast #209 - August 22, 2011",
            "datePublished": "Mon, 22 Aug 2011 03:44:44 GMT",
            "description": "<p>Jeff, Mike and Gonch review this week's news in the amusement industry.</p>\r\n\r\n<ul>\r\n<li>Jeff gives a trip report for Silverwood, and it isn't very favorable.</li>\r\n<li>Iron Wolf being retired from Six Flags Great America.</li>\r\n<li>Zippin Pippin starts doing night rides, city has a huge success on its hands.</li>\r\n<li>Disney has a damn good quarter.</li>\r\n<li>So is the economy really as bad as the headlines would lead you to believe? Our bubbles don't indicate that.</li>\r\n<li>Legoland Florida is doing all of the right things prior to opening the park, now giving teachers annual passes. How did Hard Rock Park miss this boat?</li>\r\n<li>Off topic: Don't hate the pretties. Take care of yourself. Don't wait until you can't fit in a roller coaster. Jeff tells a Coke story, with extra sugar.</li>\r\n<li>Six Flags Magic Mountain's Deja Vu moving to Six Flags New England.</li>\r\n<li>Canada's Wonderland announces Leviathan, a 300+ foot B&M roller coaster. Jeff approves. Enthusiasts whine a little.</li>\r\n<li>Cedar Point announces fake dinosaur walk-through, retirement of Paddlewheel Excursions. Cedar Point fans are annoyed, especially if they have kids.</li>\r\n<li>Lightning strike at Discovery Cove sends some people to the hospital.</li>\r\n<li>Off-topic: Hot tennis players.</li>\r\n\r\n<li>The Fall Affair at Holiday World will be September 17, 2011. The registration deadline is approaching! Also, BooBuzz is Friday, October 7. <a href=\"http://coasterbuzz.com/content/Club.aspx\" target=\"_blank\">Get the details!</a></li>\r\n\r\n<li>You can get the latest headlines on CoasterBuzz from the Twitter. Follow us <a href=\"http://twitter.com/coasterbuzz\" target=\"_blank\">@coasterbuzz</a>. You can also <a href=\"http://www.facebook.com/coasterbuzz\" target=\"_blank\">like us on Facebook</a>.</li>\r\n<li>CoasterBuzz Club is $25 per year. <a href=\"https://coasterbuzz.com/JoinClub.aspx\">You can join or renew today.</a> Enjoy CoasterBuzz with no ads.</li>\r\n</ul><img src=\"http://feeds.feedburner.com/~r/CoasterbuzzPodcast/~4/xUxq-2jboMc\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "28661810",
            "sourceUrl": "http://feedproxy.google.com/~r/CoasterbuzzPodcast/~5/orQuIiFGiR0/211"
        },
        {
            "title": "CoasterBuzz Podcast #208 - August 1, 2011",
            "datePublished": "Mon, 01 Aug 2011 03:21:32 GMT",
            "description": "<p>Jeff, Carrie, Mike and Gonch review this week's news in the amusement industry.</p>\r\n\r\n<ul>\r\n<li>Coasting For Kids at the Cedar Fair parks was a big success! We raised more than $62,000 this year.</li>\r\n<li>Ouimet says all the right things, and Gonch is in \"like\" during this dating phase.</li>\r\n<li>Jeff gives Windseeker a big thumbs up, really enjoyed the ride.</li>\r\n<li>Ed Markey ups rhetoric as family of Darien Lake accident victim mourns. When will this guy go away?</li>\r\n<li>Lawsuit delivered to Darien Lake over the fatality, not surprisingly.</li>\r\n<li>Harry Potter bonus hours offered to people who see the midnight showing of the final film at Universal Orlando. Excellent marketing effort!</li>\r\n<li>LA Times writer visits Kennywood, one of our favorites.</li>\r\n<li>California Adventure rehab continues, the entrance is done. Mike was there last weekend, says there are a lot of workarounds to get to stuff. Little Mermaid is his favorite ride.</li>\r\n<li>Geauga Lake Big Dipper: Yes, there are still interested parties.</li>\r\n<li>Mother claims discrimination against her daughter with Down Syndrome at Dorney, who was prohibited riding.</li>\r\n<li>Couple gets stuck on a slingshot ride in Dallas. Jeff wouldn't ride it. Mike wouldn't because he's cheap.</li>\r\n<li>Bad Illinois cop gets busted at Michigan's Adventure for being a drunk idiot.</li>\r\n<li>Six Flags posts excellent gains. So where is the bad economy? Carrie hit Six Flags America and Great Adventure.</li>\r\n<li>\"Marriage is so gay\" shirt causes great controversy at Dollywood.</li>\r\n\r\n<li>You can still donate to the Coasting For Kids 2011 effort! Help us raise money for Give Kids The World. <a href=\"http://www.firstgiving.com/fundraiser/jeff-putz/coastingforkids-cedarpoint\" target=\"_blank\">Donate today!</a></li>\r\n<li>The Fall Affair at Holiday World will be September 17, 2011. Also, BooBuzz is Friday, October 7. <a href=\"http://coasterbuzz.com/content/Club.aspx\" target=\"_blank\">Get the details!</a></li>\r\n\r\n<li>You can get the latest headlines on CoasterBuzz from the Twitter. Follow us <a href=\"http://twitter.com/coasterbuzz\" target=\"_blank\">@coasterbuzz</a>. You can also <a href=\"http://www.facebook.com/coasterbuzz\" target=\"_blank\">like us on Facebook</a>.</li>\r\n<li>CoasterBuzz Club is $25 per year. <a href=\"https://coasterbuzz.com/JoinClub.aspx\">You can join or renew today.</a> Enjoy CoasterBuzz with no ads.</li>\r\n</ul><img src=\"http://feeds.feedburner.com/~r/CoasterbuzzPodcast/~4/57GSsr-gYu4\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "29158341",
            "sourceUrl": "http://feedproxy.google.com/~r/CoasterbuzzPodcast/~5/xNc-p5O6klw/210"
        },
        {
            "title": "CoasterBuzz Podcast #207 - July 11, 2011",
            "datePublished": "Mon, 11 Jul 2011 04:39:22 GMT",
            "description": "<p>Jeff, Mike and Gonch review this week's news in the amusement industry.</p>\r\n\r\n<ul>\r\n<li><a href=\"http://coasterbuzz.com/news/12596/humor-roller-coaster-safety-with-patrick-warburton.aspx\" target=\"_blank\">Roller coaster safety with Patrick Warburton</a> (the guy who does the intro on Disney's Soarin', among other things).</li>\r\n<li>Goofy's Sky School panned at Disney's California Adventure. Gonch suggests that people who enjoy something too much actually end up complaining more than enjoying.</li>\r\n<li>Dania Beach Hurricane might get a new lease on life at Zoo Miami.</li>\r\n<li>Movie news: Matterhorn and Transformers.</li>\r\n<li>Legoland Florida announces schedule, will be closed a few days a week, with short hours.</li>\r\n<li>Green Lantern opens up at Six Flags Magic Mountain. Discussion revolves around capacity.</li>\r\n<li>Latest Walt Disney World rumor among the geeks is that the company wants to sell a stake in the parks. Doesn't make sense for an established park.</li>\r\n<li>Baboon loose in New Jersey, Six Flags Great Adventure says they're not sure if it belongs to them. The headline writes its own jokes.</li>\r\n<li>People busted for selling fake Cedar Point tickets. Happened in Gonch's shady neighborhood.</li>\r\n<li>Worker dies despite fall protection on Magical Midway's Star Flyer.</li>\r\n<li>Kennywood announces a holiday lighting event. Questionable given Pittsburgh winters, but a good idea if they can pull it off in the long term. Too mad Kings Island wasn't able to continue theirs.</li>\r\n<li>Ouimet makes first comments as new Cedar Fair president at annual meeting. Jeff doesn't think we'll see impact from new leadership until next year.</li>\r\n<li>Boy dies in or near Knoebels pool. No clear reason for death yet.</li>\r\n<li>Family of girl who fell from Morey's Ferris wheel sues the park. The recurring theme: Should a park have to protect you from yourself? Mike points out flaws in height used to determine age and maturity measure.</li>\r\n<li>Universal Orlando allegedly being sued for using an unlicensed font in Harry Potter merchandise.</li>\r\n<li>FunSpot USA opens up its spinning mouse roller coaster from Cypress Gardens.</li>\r\n<li>Quassy getting a lot of press for Wooden Warrior. The dynamics of those Timberliner trains probably contribute to the awesomeness.</li>\r\n<li>Man without legs ejected from Ride of Steel at Darien Lake, died. Lots of questions about why he was allowed to ride something that restrains by the legs.</li>\r\n\r\n<li>Coasting For Kids 2011 is go at Cedar Fair parks! Help us raise money for Give Kids The World. <a href=\"http://coasterbuzz.com/content/coastingforkids.aspx\" target=\"_blank\">Register or donate today!</a></li>\r\n<li>The Fall Affair at Holiday World will be September 17, 2011. Also, BooBuzz is Friday, October 7. <a href=\"http://coasterbuzz.com/content/Club.aspx\" target=\"_blank\">Get the details!</a></li>\r\n\r\n<li>You can get the latest headlines on CoasterBuzz from the Twitter. Follow us <a href=\"http://twitter.com/coasterbuzz\" target=\"_blank\">@coasterbuzz</a>. You can also <a href=\"http://www.facebook.com/coasterbuzz\" target=\"_blank\">like us on Facebook</a>.</li>\r\n<li>CoasterBuzz Club is $25 per year. <a href=\"https://coasterbuzz.com/JoinClub.aspx\">You can join or renew today.</a> Enjoy CoasterBuzz with no ads.</li>\r\n</ul><img src=\"http://feeds.feedburner.com/~r/CoasterbuzzPodcast/~4/Ne9tSwUMmhU\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "29954899",
            "sourceUrl": "http://feedproxy.google.com/~r/CoasterbuzzPodcast/~5/FiJJ1IfVVpM/209"
        },
        {
            "title": "CoasterBuzz Podcast #206 - June 27, 2011",
            "datePublished": "Mon, 27 Jun 2011 03:38:14 GMT",
            "description": "<p>Jeff, Mike and Gonch review this week's news in the amusement industry.</p>\r\n\r\n<ul>\r\n<li>What are the reasonable expectations for avoiding injuries at amusement parks? A court says you can't assume anything, and you can sue.</li>\r\n<li>Orlando parks up their gate prices again, now around $85. Gonch wonders if Disney will add a fifth park at some point. Biggest rises were in multi-day tickets.</li>\r\n<li>Jersey recommends dual occupancy and bigger height requirement for Ferris wheels.</li>\r\n<li>What's up with new rides not opening in time?</li>\r\n<li>Fuji-Q opening what they call the steepest roller coaster, a Gerstlauer ride.</li>\r\n<li>Cedar Fair annoyed by Q Investment lawsuits. I think we all are at this point.</li>\r\n<li>Former Disney guy, Matthew Ouimet, named to the president and eventual CEO position at Cedar Fair. Jeff has a wishlist for what he'd like to see him do.</li>\r\n<li>Kennywood's Pitt Fall is up for sale. What's next for them?</li>\r\n<li>Attendance stories for 2010, Universal Orlando wins big, of course.</li>\r\n<li>Chicago's Riverview remembered, remnants found.</li>\r\n<li>Disneyland grad night will move to California Adventure in 2013.</li>\r\n<li>Zippin Pippin brings in 45% more revenue.</li>\r\n<li>Al Weiss retiring after a staggeringly long career with Disney, mostly at Walt Disney World.</li>\r\n<li>Check out <a href=\"http://coasterbuzz.com/news/12592/north-korea-added-to-themeparksie.aspx\" target=\"_blank\">Richard's photos from North Korea</a>.</li>\r\n<li>Coasting For Kids 2011 is go at Cedar Fair parks! Help us raise money for Give Kids The World. <a href=\"http://coasterbuzz.com/content/coastingforkids.aspx\" target=\"_blank\">Register or donate today!</a></li>\r\n<li>The Fall Affair at Holiday World will be September 17, 2011. Also, BooBuzz is Friday, October 7. <a href=\"http://coasterbuzz.com/content/Club.aspx\" target=\"_blank\">Get the details!</a></li>\r\n\r\n<li>You can get the latest headlines on CoasterBuzz from the Twitter. Follow us <a href=\"http://twitter.com/coasterbuzz\" target=\"_blank\">@coasterbuzz</a>. You can also <a href=\"http://www.facebook.com/coasterbuzz\" target=\"_blank\">like us on Facebook</a>.</li>\r\n<li>CoasterBuzz Club is $25 per year. <a href=\"https://coasterbuzz.com/JoinClub.aspx\">You can join or renew today.</a> Enjoy CoasterBuzz with no ads.</li>\r\n</ul><img src=\"http://feeds.feedburner.com/~r/CoasterbuzzPodcast/~4/VRLou8RnzqE\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "31625816",
            "sourceUrl": "http://feedproxy.google.com/~r/CoasterbuzzPodcast/~5/oz-iCSN46x8/208"
        },
        {
            "title": "CoasterBuzz Podcast #205 - June 13, 2011",
            "datePublished": "Mon, 13 Jun 2011 03:40:45 GMT",
            "description": "<p>Jeff, Carrie, Mike and Gonch review this week's news in the amusement industry.</p>\r\n\r\n<ul>\r\n<li>Ferris Wheel mania hits Las Vegas. What audience is Vegas after these days?</li>\r\n<li>SeaWorld attendance is up. Perhaps there's a halo effect from the Harry Potter stuff at Universal Orlando.</li>\r\n<li>New Jersey touts low injury rate, until girl fall to her death from Ferris wheel. No mechanical issues suspected at this point.</li>\r\n<li>Fatal mini train accident attributed to speed. Questions arise about who is at fault. Gonch relates the story to the responsibility issues around the accident in Wisconsin.</li>\r\n<li>Former Santa's Village becomes a zoo-like attraction. Mike says they went from competing with Six Flags to competing with two zoos.</li>\r\n<li>Q Funding loses a proxy fight with Cedar Fair, then asks for another special meeting but is denied. Cedar Fair says it has pissed away $3 million on stuff relating to the Q lawsuits and proxy votes.</li>\r\n<li>Cedar Point's Wildcat has a minor crash, this time at the final brakes.</li>\r\n<li>Universal Orlando is totally Comcastic! NBC-Universal buys up Blackstone's half of the resort.</li>\r\n<li>Six Flags America to retire Skull Mountain. Jeff recalls a story there. Despite some scary news stories over the years, the park's coaster package is somewhat underrated.</li>\r\n<li>Dorney Park snaps up some new land. That park has awesome walk-ons when it's hot and everyone is in the water park.</li>\r\n<li>Dallas beats Miami, Jeff launches into a Lebron slam.</li>\r\n<li>Cedar Fair's CFO quits. Jeff saw it as a retention problem, but Carrie suggests that perhaps he just didn't see any upward mobility without going elsewhere.</li>\r\n<li>Microsoft previews Kinect Disneyland Adventures for Xbox. Jeff doesn't quite get it, but Mike's princess girls totally do.</li>\r\n<li>Water parks: Small kids and their dads.</li>\r\n<li>Jeff took his family to Great Wolf Lodge in Washington, had a good time. It's a fairly solid value, though the food selections need help.</li>\r\n<li>Coasting For Kids 2011 is go at Cedar Fair parks! Help us raise money for Give Kids The World. <a href=\"http://coasterbuzz.com/content/coastingforkids.aspx\" target=\"_blank\">Register or donate today!</a></li>\r\n<li>The Fall Affair at Holiday World will be September 17, 2011... save the date! Also, BooBuzz is Friday, October 7.</li>\r\n\r\n<li>You can get the latest headlines on CoasterBuzz from the Twitter. Follow us <a href=\"http://twitter.com/coasterbuzz\" target=\"_blank\">@coasterbuzz</a>. You can also <a href=\"http://www.facebook.com/coasterbuzz\" target=\"_blank\">like us on Facebook</a>.</li>\r\n<li>CoasterBuzz Club is $25 per year. <a href=\"https://coasterbuzz.com/JoinClub.aspx\">You can join or renew today.</a> Enjoy CoasterBuzz with no ads.</li>\r\n</ul><img src=\"http://feeds.feedburner.com/~r/CoasterbuzzPodcast/~4/VOEDuS7MtNg\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "30492229",
            "sourceUrl": "http://feedproxy.google.com/~r/CoasterbuzzPodcast/~5/dqtqEIjjqgs/207"
        },
        {
            "title": "CoasterBuzz Podcast #204 - May 16, 2011",
            "datePublished": "Mon, 16 May 2011 03:50:13 GMT",
            "description": "<p>Jeff, Carrie, Mike and Gonch review this week's news in the amusement industry.</p>\r\n\r\n<ul>\r\n<li>It has been awhile. Not everyone is feeling it.</li>\r\n<li>Jeff says Q Funding and their lawsuits against Cedar Fair is like that guy who always complains at city council meetings about stuff that he has nothing to do with.</li>\r\n<li>Meanwhile, the testimony of Dick Kinzel and Jack Falfas shows that Falfas didn't resign, and wasn't fired. We find it unbelievable that adults act like this, in a public company, and that the board does nothing about it.</li>\r\n<li>Kentucky Kingdom next year? The mayor wants to issue bonds to help finance the reopening, but has anyone asked if the park even has a future?</li>\r\n<li>Comcast says it will decide if it wants to buy Blackstone's stake in Universal Orlando. Why would they not?</li>\r\n<li>Six Flags planning to split stock, and pay a dividend. Current market cap is over $2 billion. That seems a bit high.</li>\r\n<li>I-Walk trademark suit. Isn't that Steve Jobs' walk? It's a stupid name.</li>\r\n<li>American Eagle turns 30 at Six Flags Great America.</li>\r\n<li>Speaking of, a guy showed up at the park packing heat, and he was arrested because you can't conceal-carry in Illinois. Someone commented he was a thug.</li>\r\n<li>We could do a podcast about stupid people. Or politics.</li>\r\n<li>Blackpool doesn't allow outside food. Gasp! Stilly British press.</li>\r\n<li>Gonch enjoys perks, even warm tap water. American Express has a lounge at Universal Studios Florida. Who spends time in the airport \"presidential club\" stuff?</li>\r\n<li>Disney attendance is up, but room bookings down slightly. We're surprised, because they seemed to have always kept the price at right point to keep the rooms full.</li>\r\n<li>Mike is headed to Disneyland this summer. Jeff is going to wait until next year, when California Adventure is \"done.\" Little Mermaid dark ride is regularly featured on the Disney Parks Blog.</li>\r\n<li>Gonch's secret to getting kids used to theme parks: Start taking them early and often.</li>\r\n<li>Universal Orlando CityWalk is building a mini-golf, and Jeff is excited.</li>\r\n<li>Please get your club memberships in right away for the June events!</li>\r\n<li>The Fall Affair at Holiday World will be September 17, 2011... save the date!</li>\r\n\r\n<li>You can get the latest headlines on CoasterBuzz from the Twitter. Follow us <a href=\"http://twitter.com/coasterbuzz\" target=\"_blank\">@coasterbuzz</a>. You can also <a href=\"http://www.facebook.com/coasterbuzz\" target=\"_blank\">like us on Facebook</a>.</li>\r\n<li>CoasterBuzz Club is $25 per year. <a href=\"https://coasterbuzz.com/JoinClub.aspx\">You can join or renew today.</a> Enjoy CoasterBuzz with no ads.</li>\r\n</ul><img src=\"http://feeds.feedburner.com/~r/CoasterbuzzPodcast/~4/EYhuWVWa-q8\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "29366341",
            "sourceUrl": "http://feedproxy.google.com/~r/CoasterbuzzPodcast/~5/0ZsoXaGrYhc/206"
        },
        {
            "title": "CoasterBuzz Podcast #203 - April 18, 2011",
            "datePublished": "Mon, 18 Apr 2011 03:29:43 GMT",
            "description": "<p>Jeff and Gonch review this week's news in the amusement industry.</p>\r\n\r\n<ul>\r\n<li>Coaster season is officially upon us.</li>\r\n<li>Intimidator 305 opens with a reprofiled first turn. Gonch and Jeff discuss the ups and downs of the love child of Millennium Force and Maverick.</li>\r\n<li>Cedar Fair drama continues with Q, and one side or the other has to be lying about the circumstances of Jack Falfas' departure.</li>\r\n<li>Aside: Comcast, you suck. Try delivering the bandwidth Jeff pays for.</li>\r\n<li>Merlin Entertainments has a good year, and expects another.</li>\r\n<li>The Tokyo Disney parks reopen after the earthquake, with some debate about how important that is.</li>\r\n<li>Vancouver's Playland has a Star Flyer in its future.</li>\r\n<li>Disney World monorail accident lawsuit is settled.</li>\r\n<li><a href=\"http://mousezoom.com/\" target=\"_blank\">MouseZoom soft-launches for fans of Walt Disney World.</a> The site features full-screen, detailed photographs, and a new forum. Go check it out!</li>\r\n<li>Tilikum returns to performing at SeaWorld Orlando. The reaction generally falls into one of three categories.</li>\r\n<li>Merchandise sales push up to 20% of revenue, helped by new rides.</li>\r\n<li>SeaWorld Parks being sued for allegedly ripping off park designs. We don't buy it.</li>\r\n<li><a href=\"http://pointbuzz.com/\" target=\"_blank\">PointBuzz</a> has some construction photos of Windseeker. Check them out!</li>\r\n<li>Disney breaks ground on Shanghai park, opening in 2014. Isner says it'll be the best of Disney and China, implying that they'll get the culture this time.</li>\r\n<li>Kentucky Kingdom denied funding by city, now asking for substantially less.</li>\r\n<li>Dorney gets approval for another recycled ride, but so what? It's a nice park, and the water park is the focus. We love Talon.</li>\r\n<li>Cedar Fair is doing a series of events with Guinness World Record organization.</li>\r\n<li>New rides to watch this year: Texas Giant and Cheetah Hunt. Jeff says the latter will be the surprise hit of the year.</li>\r\n<li>The Fall Affair at Holiday World will be September 17, 2011... save the date!</li>\r\n\r\n<li>You can get the latest headlines on CoasterBuzz from the Twitter. Follow us <a href=\"http://twitter.com/coasterbuzz\" target=\"_blank\">@coasterbuzz</a>. You can also <a href=\"http://www.facebook.com/coasterbuzz\" target=\"_blank\">like us on Facebook</a>.</li>\r\n<li>CoasterBuzz Club is $25 per year. <a href=\"https://coasterbuzz.com/JoinClub.aspx\">You can join or renew today.</a> Enjoy CoasterBuzz with no ads.</li>\r\n</ul><img src=\"http://feeds.feedburner.com/~r/CoasterbuzzPodcast/~4/6ZyhNKo8Rbc\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "28488160",
            "sourceUrl": "http://feedproxy.google.com/~r/CoasterbuzzPodcast/~5/Xpve1GZYBVo/205"
        },
        {
            "title": "CoasterBuzz Podcast #202 - March 21, 2011",
            "datePublished": "Mon, 21 Mar 2011 03:49:18 GMT",
            "description": "<p>Jeff and Gonch review this week's news in the amusement industry.</p>\r\n\r\n<ul>\r\n<li>We sadly say goodbye to a very well-known roller coaster enthusiast. You can remember Moosh by giving to the <a href=\"http://www.lymphoma.org/\" target=\"_blank\">Lymphoma Research Foundation</a>.</li>\r\n<li>Another bust in Orlando for second hand theme park tickets. In theory they don't work because of biometrics associated with the tickets, but how can there even be a secondary market?</li>\r\n<li>Burke and Story can't wait to run a park again. Get the popcorn, we're ready to watch!</li>\r\n<li>The jokes around \"Festival Tennessee\" start coming almost as soon as it was announced. Gonch gives the project no chance of becoming a reality.</li>\r\n<li>Playland needs a new future. Jeff gets on his soapbox about the dogmatic assertion that government shouldn't be in the business.</li>\r\n<li>Plans approved for a giant Ferris Wheel in Las Vegas. The whole city is in a weird state right now, with half-finished stuff.</li>\r\n<li>Meanwhile, the Sahara is going to close in May, apparently without buyers or hope. No word on what happens to Speed. Jeff wonders if he can find the time to visit Adventure Dome next month when he's in town, for the credit.</li>\r\n<li>The Dells worker who dropped a girl 100 feet is convicted of a felony, but we're generally of the opinion that it's problematic for it to be a crime to do your minimum wage job wrong. It was a tragedy, but that's a different issue from whether or not there was a crime. We still think it's a problem with the ride design.</li>\r\n<li><a href=\"http://mousezoom.com/\" target=\"_blank\">MouseZoom soft-launches for fans of Walt Disney World.</a> The site features full-screen, detailed photographs, and a new forum. Go check it out!</li>\r\n<li>Disney's CFO says high gas prices are not going to seriously impact its theme park business.</li>\r\n<li>Tokyo Disney properties closed following tragic quake and tsunami off the coast of Japan. Some guests were stranded at the park for awhile.</li>\r\n<li>Another maintenance worker dies at Animal Kingdom working on Primeval Whirl. We still can't understand how these accidents happen.</li>\r\n<li>Blackstone wants to sell its stake in Universal Orlando. Analysts are down on NBC-Universal Comcast buying it, but why wouldn't they?</li>\r\n<li>Q Funding is suing Cedar Fair again. Yawn.</li>\r\n<li>The Fall Affair at Holiday World will be September 17, 2011... save the date!</li>\r\n\r\n<li>You can get the latest headlines on CoasterBuzz from the Twitter. Follow us <a href=\"http://twitter.com/coasterbuzz\" target=\"_blank\">@coasterbuzz</a>. You can also <a href=\"http://www.facebook.com/coasterbuzz\" target=\"_blank\">like us on Facebook</a>.</li>\r\n<li>CoasterBuzz Club is $25 per year. <a href=\"https://coasterbuzz.com/JoinClub.aspx\">You can join or renew today.</a> Enjoy CoasterBuzz with no ads.</li>\r\n</ul><img src=\"http://feeds.feedburner.com/~r/CoasterbuzzPodcast/~4/BPNcDHW39AI\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "28973121",
            "sourceUrl": "http://feedproxy.google.com/~r/CoasterbuzzPodcast/~5/M3HF3HziyyA/204"
        },
        {
            "title": "CoasterBuzz Podcast #201 - February 28, 2011",
            "datePublished": "Mon, 28 Feb 2011 05:29:27 GMT",
            "description": "<p>Jeff, Carrie and Gonch review this week's news in the amusement industry.</p>\r\n\r\n<ul>\r\n<li>We're a little out of practice.</li>\r\n<li>KP Connection posts off-season photos from Kennywood. Gonch reviews a bit about the new roller coaster there. Jeff wishes there were more local fan sites for amusement parks.</li>\r\n<li>The Disney Dream is like a theme park. Carrie talks about cruises as disease infested capsules. Gonch wants a Fastpass off the boat.</li>\r\n<li>Disney worker arrested for allegedly luring a woman to the resort and raping her. The story doesn't add up very well according to what has been reported.</li>\r\n<li>Cedar Fair gets some credit lubrication. Lubrication is what makes business go.</li>\r\n<li>SeaWorld ready to put trainers back in the water. It has been a year, but Jeff wants to hear more about the safeguards. It will always be dangerous, that's part of the job.</li>\r\n<li>Six Flags America gets a \"Survivor\" live show. Really? Who actually watches anything on CBS?</li>\r\n<li>Ferrari World pats itself on the back for 100 days of operation. Take that, Freestyle!</li>\r\n<li>Six Flags has a very profitable 2010. We think Shapiro really laid the groundwork for that success. And by the way, Gonch thinks that Six Flags America has a nice coaster lineup. Jeff wonders if he ever mentioned that he was on Superman when the chain broke.</li>\r\n<li>Battlestar Galactica dueling roller coaster finally reopens at Universal Singapore. Eleven months seems like a long time to fix a problem. Aside: Remember ragging on Vekoma?</li>\r\n<li>Las Vegas entertains the idea of a new amusement park. Jeff can't stand cab drivers that take you stupid ways.</li>\r\n<li>Cheetah Chase is looking like \"the\" ride for the year. It's like a long Maverick, sort of.</li>\r\n<li>Dorney is getting another hand-me-down ride, this time from California's Great America.</li>\r\n<li>Disney is spending a billion dollars on tech to make your day more efficient and more action packed. What's with people who are worried about doing every last thing when they go to Disney World? Some people suck at vacations.</li>\r\n<li>Lo-Q has a more profitable year. Funny how everything other than the unemployment rate implies that the economy is improving.</li>\r\n<li>Cedar Fair charges a buck an inch for a crappy sub. And they're surprised that their per cap is down?</li>\r\n<li>Universal Orlando's grand achievement, in the form of the Wizarding World of Harry Potter, has amazing results for the year. No shocker there.</li>\r\n<li>Stay tuned... we're announcing something new very soon.</li>\r\n<li>The Fall Affair at Holiday World will be September 17, 2011... save the date!</li>\r\n\r\n<li>You can get the latest headlines on CoasterBuzz from the Twitter. Follow us <a href=\"http://twitter.com/coasterbuzz\" target=\"_blank\">@coasterbuzz</a>. You can also <a href=\"http://www.facebook.com/pages/CoasterBuzz/110968575634\" target=\"_blank\">like us on Facebook</a>.</li>\r\n<li>CoasterBuzz Club is $25 per year. <a href=\"https://coasterbuzz.com/JoinClub.aspx\">You can join or renew today.</a> Enjoy CoasterBuzz with no ads.</li>\r\n</ul><img src=\"http://feeds.feedburner.com/~r/CoasterbuzzPodcast/~4/vjlRFQkZzHU\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "31314146",
            "sourceUrl": "http://feedproxy.google.com/~r/CoasterbuzzPodcast/~5/uywJ7IE7JZo/203"
        },
        {
            "title": "CoasterBuzz Podcast #200 - January 31, 2011",
            "datePublished": "Mon, 31 Jan 2011 05:45:35 GMT",
            "description": "<p>Jeff, Richard and Gonch review this week's news in the amusement industry.</p>\r\n\r\n<ul>\r\n<li>The 200th episode is coincidentally released on the 11th anniversary of the launch of CoasterBuzz.</li>\r\n<li>We didn't have any real expectations for starting the show, and yet here we are more than five years later, still doing. Gonch got his start by being active in the old games site.</li>\r\n<li>The live podcasts, where we met in person, are still some of the best.</li>\r\n<li>CoasterBuzz has only existed in four flavors since it launched. Would like to revise it again before the end of this year.</li>\r\n<li>Jeff worried about all of the wrong things back when CoasterBuzz started.</li>\r\n<li>A Disney-focused site next? It could happen...</li>\r\n<li>Richard calls in from early morning in Dublin. He's been on Formula Rossa at Ferrari World, and he suggests that it probably pushes the limits of what's comfortable to ride.</li>\r\n<li>He also wonders what the long-term prognosis of the park is, because it was virtually empty.</li>\r\n<li>Eye protection is required on Rossa (he's looking at you, Knott's Berry Farm).</li>\r\n<li>Jeff got his Wizarding World of Harry Potter on at Universal's Islands of Adventure. Verdict: Awesome.</li>\r\n<li>Best times to visit Universal Orlando? Check the on-site hotel rates and operating hours.</li>\r\n<li>Harry Potter and the Forbidden Journey is an amazing achievement end to end, queue to ride system.</li>\r\n<li>Aside: Screen actors on the stage.</li>\r\n<li>Unit holders force split from CEO and chair at Cedar Fair. Another board member fills the spot. What's next? Hard to say. The real story comes from the selection of a new CEO to replace Kinzel next year.</li>\r\n<li>Universal kills it with rise in attendance. Jeff learns that Islands of Adventure is all based in literary themes.</li>\r\n<li>Mt. Olympus owner buys up hotels for rehab. Good for the area? The bar isn't very high to begin with.</li>\r\n<li>Jeff takes a moment to complain about how there aren't many roller coasters to ride in the northwest (again).</li>\r\n\r\n<li>You can get the latest headlines on CoasterBuzz from the Twitter. Follow us <a href=\"http://twitter.com/coasterbuzz\" target=\"_blank\">@coasterbuzz</a>. You can also <a href=\"http://www.facebook.com/pages/CoasterBuzz/110968575634\" target=\"_blank\">like us on Facebook</a>.</li>\r\n<li>CoasterBuzz Club is $25 per year. <a href=\"https://coasterbuzz.com/JoinClub.aspx\">You can join or renew today.</a> Enjoy CoasterBuzz with no ads.</li>\r\n</ul><img src=\"http://feeds.feedburner.com/~r/CoasterbuzzPodcast/~4/dUaNILYfklU\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "32914085",
            "sourceUrl": "http://feedproxy.google.com/~r/CoasterbuzzPodcast/~5/TSfzVgoX3bc/202"
        },
        {
            "title": "CoasterBuzz Podcast #199 - January 10, 2011",
            "datePublished": "Mon, 10 Jan 2011 05:22:06 GMT",
            "description": "<p>Jeff, Carrie, Mike and Gonch review this week's news in the amusement industry.</p>\r\n\r\n<ul>\r\n<li>CoasterBuzz has a Windows Phone 7 app. <a href=\"http://coasterbuzz.com/content/windowsphone7app.aspx\" target=\"_blank\">Check it out.</a></li>\r\n<li>Carrie went to Tennessee for the New Year. Did the Dollywood holiday thing, found Thunderhead to be just OK. Doesn't mind saying that she's not that interested in riding in bad weather.</li>\r\n<li>Holy Land in Orlando comes off as completely strange to many.</li>\r\n<li>The Cedar Fair vs. Q Investments saga continues, with mudslinging worthy of a political campaign. Jeff asks who is lying about the Falfas situation: termination or resignation?</li>\r\n<li>Experts say Freestyle Music Park won't reopen. Really?</li>\r\n<li>Disney's queue management isn't just Fastpass, it's getting the crowds to go where there's excess capacity, even if that means parades.</li>\r\n<li>Disneyland and DCA close on two days because of crazy attendance.</li>\r\n<li>Knott's sells \"Hate to Wait\" passes, as the premium virtual queue comes to a Cedar Fair park. Doesn't seem like a particularly good deal to us.</li>\r\n<li>Dudley Doo-Right catches fire at Islands of Adventure. It's a water ride.</li>\r\n<li>Fun Spot expands on International Drive. Mike thinks the karts look cool. Jeff says try the electric carts if they exist near you.</li>\r\n<li>Block Party Bash retired at Disney Hollywood Studios.</li>\r\n<li>Zamperla gets fined for tearing down Shoot The Freak. So goes the Coney Island \"character.\"</li>\r\n<li>If you get photographed at a park, deal with it. You pretty much have no rights in said public place.</li>\r\n<li>Disney prices go up on both coasts for the locals. Gonch says they apparently stayed the same in Orlando for the better part of a decade.</li>\r\n<li>Conneaut Lake Park begs for more money from Pepsi. We all say \"I told you so.\" Just let the place die peacefully.</li>\r\n<li>Cedar Fair attendance up significantly, we suspect it has a lot to do with the Halloween events, combined with the big cap ex in the southern parks.</li>\r\n<li>Legoland Florida is selling a lifetime pass. Only $2,500!</li>\r\n<li>Mike saw Tron. He thought it was cool.</li>\r\n\r\n<li>You can get the latest headlines on CoasterBuzz from the Twitter. Follow us <a href=\"http://twitter.com/coasterbuzz\" target=\"_blank\">@coasterbuzz</a>. You can also <a href=\"http://www.facebook.com/pages/CoasterBuzz/110968575634\" target=\"_blank\">like us on Facebook</a>.</li>\r\n<li>CoasterBuzz Club is $25 per year. <a href=\"https://coasterbuzz.com/JoinClub.aspx\">You can join or renew today.</a> Enjoy CoasterBuzz with no ads.</li>\r\n</ul><img src=\"http://feeds.feedburner.com/~r/CoasterbuzzPodcast/~4/e_M48nEAKg0\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "38741792",
            "sourceUrl": "http://feedproxy.google.com/~r/CoasterbuzzPodcast/~5/9vSpYGpQauY/201"
        },
        {
            "title": "CoasterBuzz Podcast #198 - December 20, 2010",
            "datePublished": "Mon, 20 Dec 2010 04:37:36 GMT",
            "description": "<p>Jeff, Carrie and Gonch review this week's news in the amusement industry.</p>\r\n\r\n<ul>\r\n<li>Crap hunters at Bushkill, lawsuits, Six Flags/cents, Noah's Ark, Orlando weather, Disney icons, Eurofighters, Tommy Lee vs. SeaWorld, Cheetah hunting, Intimidator 305, Cedar Fair vs. Q Investments.</li>\r\n\r\n<li>You can get the latest headlines on CoasterBuzz from the Twitter. Follow us <a href=\"http://twitter.com/coasterbuzz\" target=\"_blank\">@coasterbuzz</a>. You can also <a href=\"http://www.facebook.com/pages/CoasterBuzz/110968575634\" target=\"_blank\">like us on Facebook</a>.</li>\r\n<li>CoasterBuzz Club is $25 per year. <a href=\"https://coasterbuzz.com/JoinClub.aspx\">You can join or renew today.</a> Enjoy CoasterBuzz with no ads.</li>\r\n</ul><img src=\"http://feeds.feedburner.com/~r/CoasterbuzzPodcast/~4/lTGrLpfM1jk\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "30131188",
            "sourceUrl": "http://feedproxy.google.com/~r/CoasterbuzzPodcast/~5/Mpr3nsluqpc/200"
        },
        {
            "title": "CoasterBuzz Podcast #197 - December 6, 2010",
            "datePublished": "Mon, 06 Dec 2010 04:43:06 GMT",
            "description": "<p>Jeff, Carrie and Mike review this week's news in the amusement industry.</p>\r\n\r\n<ul>\r\n<li>Ferrari World, IAAPA 2010, social media and the industry, Facebook likes, the Facebook movie, Six Flags licensing, Orlando ticket pricing, Orlando Thrill Park, SeaWorld Parks layoffs, PARC confusion, Belmont rent is too damn high, unions and wages.</li>\r\n\r\n<li>You can get the latest headlines on CoasterBuzz from the Twitter. Follow us <a href=\"http://twitter.com/coasterbuzz\" target=\"_blank\">@coasterbuzz</a>. You can also <a href=\"http://www.facebook.com/pages/CoasterBuzz/110968575634\" target=\"_blank\">like us on Facebook</a>.</li>\r\n<li>CoasterBuzz Club is $25 per year. <a href=\"https://coasterbuzz.com/JoinClub.aspx\">You can join or renew today.</a> Enjoy CoasterBuzz with no ads.</li>\r\n</ul><img src=\"http://feeds.feedburner.com/~r/CoasterbuzzPodcast/~4/pBTDbbVKOJE\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "29642714",
            "sourceUrl": "http://feedproxy.google.com/~r/CoasterbuzzPodcast/~5/LEA62FG7pdM/199"
        },
        {
            "title": "CoasterBuzz Podcast #196 - November 8, 2010",
            "datePublished": "Mon, 08 Nov 2010 04:45:59 GMT",
            "description": "<p>Jeff, Gonch and Mike review this week's news in the amusement industry.</p>\r\n\r\n<ul>\r\n<li>Mike and Jeff talk about Kinect, and the modern reincarnate of Dance Dance Revolution.</li>\r\n<li>Mike spent time at the Disneyland resort, and talks about ElecTRONica, World of Color, construction and renovations at the Disneyland Hotel.</li>\r\n<li>Halloween was huge for parks all over the US this year. Strange how parks reach the bursting limit now on some weekends. How does this success come in what's allegedly a recession?</li>\r\n<li>Operator in Dells Extreme World accident will not take plea deal. Jeff and Gonch are still troubled by low-wage job that carries potential for felony charges.</li>\r\n<li>Ferrari World opens with the world's fastest roller coaster, and even without riding it, a lot of people are poo-pooing it. It just doesn't look that interesting outside of the speed. Are we jaded or do we just know what kinds of roller coaster sensations we prefer?</li>\r\n<li>Kentucky Kingdom won't open next year because it can't get the funding it wants in time. Live it up another year, Holiday World!</li>\r\n<li>New Cars area coming together at California Adventure. Mike says it's just huge to see in person.</li>\r\n<li>Six Flags sees boost in revenue and says it's backing off the addictive discounting to drive attendance. Gonch and Mike say they didn't see any gate integrity this year in their visits.</li>\r\n<li>Q Funding goes after Dick Kinzel while the company names some promotions, in title at least. Cedar Fair results are definitely better in most ways, though per capita spending and profit is down.</li>\r\n<li>Neat video from the abandoned Six Flags New Orleans appears, then disappears, from YouTube. Looked like it was shot on a DSLR. <a href=\"http://philipbloom.net/\" target=\"_blank\">Philip Bloom</a> shoots some neat stuff on DSLR's (not this one though).</li>\r\n<li>Holiday World posts video of real humans riding the Timberliners on The Voyage.</li>\r\n<li>Speaking of Holiday World, the Fall Affair will return for 2011, with details forthcoming.</li>\r\n<li>The crew misses the good ol' days at Kings Island with Jeff and Maureen, and the ultimate multi-ride ERT. Long live BeastBuzz.</li>\r\n\r\n<li>You can get the latest headlines on CoasterBuzz from the Twitter. Follow us <a href=\"http://twitter.com/coasterbuzz\" target=\"_blank\">@coasterbuzz</a>. You can also <a href=\"http://www.facebook.com/pages/CoasterBuzz/110968575634\" target=\"_blank\">like us on Facebook</a>.</li>\r\n<li>CoasterBuzz Club is $25 per year. <a href=\"https://coasterbuzz.com/JoinClub.aspx\">You can join or renew today.</a> Enjoy CoasterBuzz with no ads.</li>\r\n</ul><img src=\"http://feeds.feedburner.com/~r/CoasterbuzzPodcast/~4/9Piqp2pwZi4\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "29323581",
            "sourceUrl": "http://feedproxy.google.com/~r/CoasterbuzzPodcast/~5/iyscZP30diY/198"
        },
        {
            "title": "CoasterBuzz Podcast #195 - October 25, 2010",
            "datePublished": "Mon, 25 Oct 2010 04:24:21 GMT",
            "description": "<p>Jeff, Gonch and Carrie review this week's news in the amusement industry.</p>\r\n\r\n<ul>\r\n<li>BooBuzz on a Friday night at Cedar Point was an epic success. Gonch hit the haunts, Carrie got her first ride on Dragster while she was disappointed with Breakers Express. Crazy busy weekends for Cedar Point again this year.</li>\r\n<li>Park staffing late in the year is clearly a problem for Cedar Point.</li>\r\n<li>Carrie did the VIP tour at Dorney Park, a perk for her Coasting For Kids fundraising. <a href=\"http://firstgiving.com/jeffputz\" target=\"_blank\">You can still donate to Give Kids The World.</a></li>\r\n<li>SeaWorld Orlando births a new orca. Jeff loves the circle of life stuff, blood and all.</li>\r\n<li>Area around Carowinds wants to clean up and better deal with traffic.</li>\r\n<li>Morey's ditches its giant slide, and we all wonder where they went. Was it the nuckle burns?</li>\r\n<li>Pony Express investigation complete at Knott's, brake fins were apparently painted, contributing to failure. Was someone fired?</li>\r\n<li>Cedar Point says \"changes not required\" to asylum attractions in response to mental illness advocacy group.</li>\r\n<li>Holiday World sets another attendance record. What will the Kentucky Kingdom impact be?</li>\r\n<li>A thrill park on International Drive in Orlando: Viable?</li>\r\n<li>Busch Gardens Tampa is building a low to the ground, multiple launch ride. Gonch is skeptical, Jeff thinks the proximity to scenery can make or break it.</li>\r\n<li>Still no word on what's up with Hollywood Rip Ride Rocket at Universal Studios Florida.</li>\r\n<li>Q Funding calls out Dick Kinzel, wants a vote to split CEO and board duties. Hilariously, the SEC filing references CoasterBuzz.</li>\r\n<li>Church and school groups criticize scorn lover story of haunt attractions at Busch Gardens Tampa. Kids are stupid, sure, but they're not that stupid.</li>\r\n<li>Six Flags Magic Mountain announces Green Lantern. Strange low capacity choice for a park that size.</li>\r\n<li>Legoland Florida is doing a good job keeping the park on the news radar. So not like Hard Rock Park. The Lego brand is very strong right now.</li>\r\n<li>Seattle waterfront Ferris wheel? Jeff is all for it.</li>\r\n\r\n<li>You can get the latest headlines on CoasterBuzz from the Twitter. Follow us <a href=\"http://twitter.com/coasterbuzz\" target=\"_blank\">@coasterbuzz</a>. You can also <a href=\"http://www.facebook.com/pages/CoasterBuzz/110968575634\" target=\"_blank\">like us on Facebook</a>.</li>\r\n<li>CoasterBuzz Club is $25 per year. <a href=\"https://coasterbuzz.com/JoinClub.aspx\">You can join or renew today.</a> Enjoy CoasterBuzz with no ads.</li>\r\n</ul><img src=\"http://feeds.feedburner.com/~r/CoasterbuzzPodcast/~4/qY0TYyD2Y30\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "30040583",
            "sourceUrl": "http://feedproxy.google.com/~r/CoasterbuzzPodcast/~5/5ARzHz1Ixkw/197"
        },
        {
            "title": "CoasterBuzz Podcast #194 - October 11, 2010",
            "datePublished": "Mon, 11 Oct 2010 03:39:44 GMT",
            "description": "<p>Jeff, Gonch, Mike and Carrie review this week's news in the amusement industry.</p>\r\n\r\n<ul>\r\n<li>Carrie says recounts her experience at Phoenix Phall Phunfest at Knoebels. Accommodations are \"challenging\" around that area. Watch out for severed chicken heads.</li>\r\n<li>Canobie Lake Park waiting on the traffic study to proceed with Euro Fighter.</li>\r\n<li>Extreme World civil suit settled out of court, criminal trial of operator yet to come. We're still not comfortable with the precedent of someone doing a minimum wage job being charged with a crime.</li>\r\n<li>Food &amp; Wine Festival begins at Epcot. It's about cheese and wine, not drink around the world advance mode. Sidebar: box wine.</li>\r\n<li>Checketts is out at S&amp;S, no longer holding any stake and not consulting. What's with entrepreneurs that totally let go of something they started?</li>\r\n<li>Cedar Fair sets out concrete financial goals for 2015, and reinstates the distribution. Does the entire sale fiasco seem even more ridiculous? This causes zero confidence for the executive team.</li>\r\n<li>Another orca dies at SeaWorld Orlando, tired debate resumes about \"free\" versus captive animals.</li>\r\n<li>Good clowns protest portrayal of evil clowns at Alton Towers. We all agree that it's probably a scam. And when did clowns become primarily evil? Sidebar: Insane Clown Posse are Evangelical Christians. And still not musicians. Also sidebar: Katy Perry and Elmo on Sesame Street.</li>\r\n<li>Six Flags Discovery Kingdom announces a swing tower. They're the new drop tower.</li>\r\n<li>Minor accident involving rollback on Pony Express at Knott's Berry Farm injures ten people. Expect the state to shut it down and investigate for two years.</li>\r\n<li>Zippin Pippin rises in Green Bay. How many roller coasters did Elvis actually ever ride?</li>\r\n<li>Mental illness advocates ask Cedar Point to shut down its asylum haunted attractions. Mike says it's the fault of Hollywood.</li>\r\n\r\n<li><a href=\"http://coasterbuzz.com/content/BooBuzz2010.aspx\" target=\"_blank\">BooBuzz returns to Cedar Point</a> on Friday, October 15.</li>\r\n\r\n<li>You can get the latest headlines on CoasterBuzz from the Twitter. Follow us <a href=\"http://twitter.com/coasterbuzz\" target=\"_blank\">@coasterbuzz</a>. You can also <a href=\"http://www.facebook.com/pages/CoasterBuzz/110968575634\" target=\"_blank\">like us on Facebook</a>.</li>\r\n<li>CoasterBuzz Club is $25 per year. <a href=\"https://coasterbuzz.com/JoinClub.aspx\">You can join or renew today.</a> Enjoy CoasterBuzz with no ads.</li>\r\n</ul><img src=\"http://feeds.feedburner.com/~r/CoasterbuzzPodcast/~4/PxlgcKwRWI0\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "32386410",
            "sourceUrl": "http://feedproxy.google.com/~r/CoasterbuzzPodcast/~5/1UbwZOmaslc/196"
        }
    ]
}