{
    "artwork": "http://is4.mzstatic.com/image/thumb/Music62/v4/e0/90/51/e0905170-fe39-b329-86cd-ffb7930c1bc5/source/100x100bb.jpg",
    "description": "Guests are invited to choose the eight records they would take to a desert island",
    "feedURL": "https://podcasts.files.bbci.co.uk/p02p7116.rss",
    "podcastURL": "http://www.bbc.co.uk/programmes/p02p7116",
    "title": "Desert Island Discs: Archive 1991-1996",
    "episodes": [
        {
            "title": "Martin Amis",
            "datePublished": "Sun, 29 Dec 1996 11:15:00 +0000",
            "description": "Sue Lawley's guest on Desert Island Discs today is the writer Martin Amis. He describes his books as comedies, but, like London Fields and Other People, they are frequently dark and disturbing.\n\nHe says that he has no choice as to the subjects of his books. \"They come from nowhere and feel like a little gulp in your digestive system\". Although he admits that he's sometimes appalled by the characters he creates, writing itself is something he loves. \n\n[Taken from the original programme material for this archive edition of Desert Island Discs] \n\nFavourite track: Yesterdays by Buddy Rich\nBook: Complete Works by John Milton\nLuxury: Cable Television",
            "length": "36016000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02ppdld.mp3"
        },
        {
            "title": "Jennifer Saunders",
            "datePublished": "Sun, 22 Dec 1996 11:15:00 +0000",
            "description": "The castaway on Desert Island Discs this week is Absolutely Fabulous! Jennifer Saunders began \"doing funny things with props\" in the early 1980s. With her stage partner Dawn French, she toured the clubs and comedy venues making people laugh with acts like The Menopause Sisters. As part of the Comic Strip performers, she burst onto our TV screens as one of the famous, if rather manic, five.\n\nNow through her characters Edina and Patsy, she has created a comedy classic. But as she tells Sue Lawley, Absolutely Fabulous came about because, having taken a year off from French and Saunders, the phone was ominously silent, and she had absolutely nothing else to do.\n\n[Taken from the original programme material for this archive edition of Desert Island Discs] \n\nFavourite track: I Didn't Have The Nerve To Say No by Blondie\nBook: Traveller's Prelude by Freya Stark\nLuxury: Tribute Heads By Elisabeth Frink",
            "length": "30960000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02ppdlh.mp3"
        },
        {
            "title": "Ian Dury",
            "datePublished": "Sun, 15 Dec 1996 11:15:00 +0000",
            "description": "Today's castaway on Desert Island Discs confused the rock critics in the late 1970s with songs like Sweet Gene Vincent, Reasons to be Cheerful and outraged the BBC with Sex and Drugs and Rock and Roll. Ian Dury and the Blockheads were part vaudeville act and part punk rock band. In his songs, he created the characters Clevor Trever and Billericay Dickie and so invented the original Essex Man. He's also a painter and an actor, but as he reveals to Sue Lawley, he's writing songs again and hopes to be back in the charts soon.\n\n[Taken from the original programme material for this archive edition of Desert Island Discs] \n\nFavourite track: Ramblin by Ornette Coleman\nBook: Macmillan Dictionary of Art\nLuxury: Mixing Desk - Solar Powered",
            "length": "32784000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02ppdln.mp3"
        },
        {
            "title": "Robert Winston",
            "datePublished": "Sun, 08 Dec 1996 11:15:00 +0000",
            "description": "On Desert Island Discs today the castaway is Robert Winston.\n\nAs Professor of Fertility Studies at Hammersmith Hospital in London, he has been at the forefront of medical developments in his field. He pioneered the screening of embryos for genetic defects and has frequently made the headlines with his views that all women, including widows, lesbians and those who are HIV positive, should be considered for treatment. \n\n[Taken from the original programme material for this archive edition of Desert Island Discs] \n\nFavourite track: Goldberg Varations - Aria And Reprise From Variation by Johann Sebastian Bach\nBook: The Koran (in Arabic and English)\nLuxury: Glass And Tools To Make A Telescope",
            "length": "36752000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02ppdlq.mp3"
        },
        {
            "title": "Bruce Forsyth",
            "datePublished": "Sun, 01 Dec 1996 11:15:00 +0000",
            "description": "This week's castaway on Desert Island Discs may be nearing 70, but he knows how to play The Generation Game. Bruce Forsyth is one of the great all-rounders - television host, pianist, dancer and comedian. \n\nHe began performing as a child, tap-dancing on the roof of his father's lock-up garages. But, as he tells Sue Lawley, his big night came when he was asked to compere Sunday Night at the Palladium. He has spent more than five decades in showbiz, progressing from Boy Bruce the Mighty Atom, to probably the most successful game show host on television. To quote one of his own famous catchphrases, \"Didn't he do well?\"\n\n[Taken from the original programme material for this archive edition of Desert Island Discs] \n\nFavourite track: I'll Never Love This Way Again by Dionne Warwick\nBook: The collected works by Omar Khayyam\nLuxury: Sand iron (golf club)",
            "length": "36128000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02ppdlt.mp3"
        },
        {
            "title": "Rt Hon Tony Blair MP",
            "datePublished": "Sun, 24 Nov 1996 11:15:00 +0000",
            "description": "Sue Lawley's castaway this week is the Leader of the Opposition, the Right Honourable Tony Blair. He will be describing his beliefs, both political and religious, and revealing the man behind the sound bites.\n\n[Taken from the original programme material for this archive edition of Desert Island Discs] \n\nFavourite track: Recuerdos De La Alhambra by John Williams\nBook: Ivanhoe by Walter Scott\nLuxury: Guitar",
            "length": "33968000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02ppdly.mp3"
        },
        {
            "title": "Tessa Sanderson",
            "datePublished": "Sun, 17 Nov 1996 11:15:00 +0000",
            "description": "Atlanta was her sixth Olympic Games. The first was 20 years before. On Desert Island Discs, Tessa Sanderson reveals the competitive drive that brought her back from retirement at the age of 40 to raise money for Great Ormond Street Hospital in London. She fondly recalls her rivalry with fellow competitor Fatima Whitbread, and remembers the moment she became the first and only British woman to win an Olympic throwing gold medal.\n\n[Taken from the original programme material for this archive edition of Desert Island Discs] \n\nFavourite track: I Will Always Love You by Whitney Houston\nBook: The History of the World by J M Roberts\nLuxury: Toothbrush and toothpaste",
            "length": "34288000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02ppdm3.mp3"
        },
        {
            "title": "Sir Laurens Van Der Post",
            "datePublished": "Sun, 10 Nov 1996 11:15:00 +0000",
            "description": "The castaway in Desert Island Discs this week is a writer, a traveller and an advisor to a Prince and Prime Minister.\n\nNow nearly 90, he'll be talking to Sue Lawley about his early years in South Africa, his incarceration as a Japanese prisoner-of-war and his life-long campaign to save the bushmen of the Kalahari Desert.\n\n[Taken from the original programme material for this archive edition of Desert Island Discs] \n\nFavourite track: Piano Sonata No. 17 in Dm 'Tempest' by Ludwig van Beethoven\nBook: The Golden Bough by James Frazer\nLuxury: Piano",
            "length": "37360000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02ppdm7.mp3"
        },
        {
            "title": "Chris Patten",
            "datePublished": "Sun, 03 Nov 1996 11:15:00 +0000",
            "description": "He's called \"His Excellency\" by some; to others he's \"Fatty Patten\". Next year he will hand over Hong Kong to the Chinese.\n\nChris Patten, this week's castaway on Desert Island Discs, describes the challenges of being the colony's last British Governor. He recalls the moment he won the election for the Conservative Party, but lost his own seat, and how, as Environment Secretary, he found himself implementing \"the single most unpopular policy that any British government has tried to introduce since the last war\" - the poll tax.\n\n[Taken from the original programme material for this archive edition of Desert Island Discs] \n\nFavourite track: Route 66 by The Rolling Stones\nBook: A Brief History of Time by Stephen Hawking\nLuxury: A bath",
            "length": "36928000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02ppdmg.mp3"
        },
        {
            "title": "Jancis Robinson",
            "datePublished": "Sun, 27 Oct 1996 11:15:00 +0000",
            "description": "Sue Lawley's castaway this week is the wine writer Jancis Robinson.\n\nOne of only 200 Masters of Wine in the world, she recalls how her passion was first aroused by a full-bodied Chambolle-Musigny. It was, she says, the first time she realised that wine was an intellectual experience and not just for lubrication. A familiar face on television for her Matters of Taste and Wine Course series, she also edited the prestigious Oxford Companion to Wine. But her main occupation is tasting, and she can sip and spit more than a hundred varieties at a sitting. \n\n[Taken from the original programme material for this archive edition of Desert Island Discs] \n\nFavourite track: Sabat Mater Inflammatus Et Accensus by Giovanni Battista Pergolesi\nBook: Middlemarch by George Eliot\nLuxury: Cellar of wines and a corkscrew",
            "length": "37200000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02ppdmn.mp3"
        },
        {
            "title": "Jackie Charlton",
            "datePublished": "Sun, 20 Oct 1996 10:15:00 +0000",
            "description": "The ball rolled past the gap between him and Gordon Banks and into the back of the net. The Germans were one goal up. \n\nThis week's castaway, Jackie Charlton, recalls the match which was to bring him to his knees in relief and joy as England went on to win the 1966 World Cup. Just one of the crowning moments of a career that could so easily have ended down the pit, except for his talent with the ball. Nicknamed \"The Boss\" because of his straight talking, Jackie describes his relationship with his brother \"Our Kid\" Bobby Charlton and his success as manager of Ireland. \n\n[Taken from the original programme material for this archive edition of Desert Island Discs] \n\nFavourite track: September Song by Frank Sinatra\nBook: Encyclopaedia of How To Survive\nLuxury: Fishing rod",
            "length": "35184000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02ppdms.mp3"
        },
        {
            "title": "Rumer Godden",
            "datePublished": "Sun, 13 Oct 1996 10:15:00 +0000",
            "description": "Always an outsider, she seems to have gone against all the mores of her time; from opening a dancing school in Calcutta to living alone with her children in Kashmir. On Desert Island Discs this week, the writer Rumer Godden describes how her rich life in India (under the Raj) and in Britain has influenced her novels.\n\nShe says she can't remember a time when she didn't write. Now in her late 80s, and after publishing more than 50 books, including Black Narcissus and The River, she's just added another to her list. \n\n[Taken from the original programme material for this archive edition of Desert Island Discs] \n\nFavourite track: Kinderscenen Traumerei by Robert Schumann\nBook: The Atlantic book of British and American Poetry by Edith Sitwell\nLuxury: A widow's cruse filled with whisky",
            "length": "39536000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02ppdmw.mp3"
        },
        {
            "title": "Lewis Wolpert",
            "datePublished": "Sun, 06 Oct 1996 10:15:00 +0000",
            "description": "The castaway on Desert Island Discs this week is Professor Lewis Wolpert. As Chairman of the Committee on the Public Understanding of Science, he is a passionate advocate of the value of science and the increasing need for the recognition and promotion of its importance. He'll be talking to Sue Lawley about his early life in South Africa, his recent struggle with clinical depression and his passion for the views of the 18th-century philosopher David Hume - particularly on the existence of God.\n\n[Taken from the original programme material for this archive edition of Desert Island Discs] \n\nFavourite track: String Quartet No. 15 in A Minor by Ludwig van Beethoven\nBook: Enquiry Concerning Human Understanding and The Principles of Morals by David Hume\nLuxury: Bicycle",
            "length": "35648000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02ppdmz.mp3"
        },
        {
            "title": "Ben Elton",
            "datePublished": "Sun, 29 Sep 1996 10:15:00 +0000",
            "description": "His fourth novel, Popcorn, has been widely-acclaimed by the critics. He's about to begin a nationwide tour with his stand-up comedy routine. And, after the success of his TV series The Young Ones and Blackadder, he's currently writing The Thin Blue Line for BBC1. Yet despite all that, Ben Elton, this week's castaway, says he's more of an enthusiastic 'farty' than a \"smug git in a shiny suit\".\n\nHe muses as to whether his scatter-gun delivery (so mocked by the tabloids) is the result of his fear of the audience, or of a self-righteous belief in his own opinion, and when stranded on a desert island, he will reveal himself as a serious satirist or just a maverick motormouth.\n\n[Taken from the original programme material for this archive edition of Desert Island Discs] \n\nFavourite track: And Your Bird Can Sing by The Beatles\nBook: His wedding photo album\nLuxury: The British Museum",
            "length": "34384000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02ppdn4.mp3"
        },
        {
            "title": "Fran Landesman",
            "datePublished": "Sun, 22 Sep 1996 10:15:00 +0000",
            "description": "She has written songs for her friends Barbra Streisand and Bette Davis, and admires Jarvis Cocker and Damon Albarn. This week, the poet and lyricist Fran Landesman chooses her eight records.\n\nAlthough now in her 60s, retired to her bed and celibate, she is still writing lyrics and performing her poetry and has just published a new collection of her work. From poor little rich girl to a life of bohemian excess, she looks back at her experiences - free love, free speech and mind-expanding drugs - on Desert Island Discs.\n\n[Taken from the original programme material for this archive edition of Desert Island Discs] \n\nFavourite track: Down by Nicki Leighton Thomas\nBook: Rebel Without Applause and Jay Walking by Jay Landesman\nLuxury: Cannabis seeds",
            "length": "31152000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02ppdn7.mp3"
        },
        {
            "title": "Kevin Whately",
            "datePublished": "Sun, 15 Sep 1996 10:15:00 +0000",
            "description": "The castaway on Desert Island Discs this week is the actor Kevin Whately. Having appeared increasingly prominently in three of the most successful series in recent TV history - Auf Wiedersehen, Pet, Inspector Morse and Peak Practice - he's currently 'hot property' in the casting world.\n\nHe'll be talking to Sue Lawley about his boyhood in a remote part of Cumbria, his bold but inspired decision to chuck in accountancy in favour of the stage and his time busking at Oxford Circus to pay his way through drama school.\n\n[Taken from the original programme material for this archive edition of Desert Island Discs] \n\nFavourite track: Symphony No 1 by Jean Sibelius\nBook: The Moor's Last Sigh by Salman Rushdie\nLuxury: Northumbrian pipes",
            "length": "31968000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02ppdn9.mp3"
        },
        {
            "title": "Professor Colin Blakemore",
            "datePublished": "Sun, 08 Sep 1996 10:15:00 +0000",
            "description": "The castaway in Desert Island Discs this week is the scientist Colin Blakemore. A brilliant student, he became an Oxford professor at the age of 35 and since then he has commanded enormous influence through his research and the way he has tried to communicate the importance of science to the world at large.\n\nHe'll be talking to Sue Lawley about his main work - the functioning of the human brain - and about his research on the relationship between vision and brain development. He'll also be describing how his experiments in this area involving animals have made him the target of attacks from animal rights activists. \n\n[Taken from the original programme material for this archive edition of Desert Island Discs] \n\nFavourite track: Die Zauberflote Oittre Nicht - The Magic Flute by Wolfgang Amadeus Mozart\nBook: The Discoverers by Daniel Boorstin\nLuxury: Solar-powered internet (to receive, not send)",
            "length": "36240000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02ppdnd.mp3"
        },
        {
            "title": "Sir Terence Conran",
            "datePublished": "Sun, 01 Sep 1996 10:15:00 +0000",
            "description": "The castaway in Desert Island Discs this week is the designer and entrepreneur Terence Conran. He first came to fame with the Habitat store which introduced British shoppers to consumer delights like the chicken brick and the duvet. Now considered one of the country's most successful restaurateurs - he currently owns seven restaurants and is involved in designing another 17 - he'll be talking to Sue Lawley about his original foray into the restaurant world. His first venture was called The Soup Kitchen - and, misled by its name, attracted all the local tramps on its opening night. \n\nHe'll also be describing how Picasso bought one of the first chairs he designed. Finally, he'll be talking about how, after a somewhat tumultuous personal life, he now feels he has achieved some sort of equanimity.\n\n[Taken from the original programme material for this archive edition of Desert Island Discs] \n\nFavourite track: Keith Jarrett's Koln Concert Part One by Keith Jarrett\nBook: History of the World by H G Wells\nLuxury: An endless supply of A4 paper and 4B pencils",
            "length": "35536000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02ppdnh.mp3"
        },
        {
            "title": "Anita Lasker-Wallfisch",
            "datePublished": "Sun, 25 Aug 1996 10:15:00 +0000",
            "description": "The castaway in Desert Island Discs this week is the cellist Anita Lasker-Wallfisch. One of the most distinguished members of the English Chamber Orchestra, she has toured all over the world with them.\n\nHowever, as she will be telling Sue Lawley, up until the early 1980s, she always refused to visit one country - Germany. For it was from there that her Jewish parents were taken away by the Gestapo, never to be seen again. From the age of 18, she herself was taken away to Auschwitz. There, because she was able to play the cello, she survived, and played in the camp's orchestra. However, when she was later moved to Belsen, she nearly didn't. She'll be talking about playing in the orchestra at Auschwitz, about the importance of music in sustaining life both then and now, and about her feelings towards Germany and the Germans more than 50 years after the events of her early life.\n\n[Taken from the original programme material for this archive edition of Desert Island Discs] \n\nFavourite track: Piano Sonata Opus 111 by Ludwig van Beethoven\nBook: The History of the World by J M Roberts\nLuxury: Cello",
            "length": "36816000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02ppdnm.mp3"
        },
        {
            "title": "André Previn",
            "datePublished": "Sun, 18 Aug 1996 10:15:00 +0000",
            "description": "The castaway in Desert Island Discs this week is the composer and conductor André Previn. He'll be talking to Sue Lawley about how he and his family fled from Nazi Germany and ended up in California. His skill as a jazz musician led to a job at MGM and four Oscars for the film scores he wrote there. However, in the mid-1960s he turned his back on Hollywood and became principal conductor of the London Symphony Orchestra. He'll be discussing this dramatic transition, his famous appearance on the Morecambe and Wise Show and the perils of his now-abandoned celebrity status.\n\n[Taken from the original programme material for this archive edition of Desert Island Discs] \n\nFavourite track: Symphony No 40 In G Minor by Wolfgang Amadeus Mozart\nBook: The collected works by Anton Chekhov\nLuxury: Piano",
            "length": "35664000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02ppdnq.mp3"
        },
        {
            "title": "Quentin Crewe",
            "datePublished": "Sun, 16 Jun 1996 10:15:00 +0000",
            "description": "The castaway in Desert Island Discs this week is the journalist and author Quentin Crewe. Since the age of 29, muscular dystrophy has left him in a wheelchair. Nevertheless, now 70, he can look back on a full and vivid life encompassing a 24,000 mile trip across South America and expeditions across the Sahara and the Saudi Arabian desert. He'll be talking to Sue Lawley about his travels, his close relationship with the Macmillan family, his work as a writer and restaurant critic and also his belief that disability need be no bar to a happy and fulfilled life.\n\n[Taken from the original programme material for this archive edition of Desert Island Discs] \n\nFavourite track: String Quintet In C Major 163 by Franz Schubert\nBook: Essays by Michel de Montaigne\nLuxury: The cellar from Trinity College, Cambridge",
            "length": "34656000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02ppdnw.mp3"
        },
        {
            "title": "Peggy Mount",
            "datePublished": "Sun, 09 Jun 1996 10:15:00 +0000",
            "description": "The castaway in Desert Island Discs this week is the actress Peggy Mount. Now 80 years old, and about to play the nanny in Uncle Vanya at Chichester this summer, she'll be talking to Sue Lawley about her long and distinguished career as one of the nation's favourite battleaxes. With her booming voice, and imposing figure, playing parts like the nurse in Romeo and Juliet and the headmistress in The Happiest Days of your Life, she has earned the affection of millions.\n\n[Taken from the original programme material for this archive edition of Desert Island Discs] \n\nFavourite track: Portrait Of My Love by Matt Munro\nBook: Diary by Noel Coward\nLuxury: Tea in abundance",
            "length": "32416000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02ppdp2.mp3"
        },
        {
            "title": "Gerry Robinson",
            "datePublished": "Sun, 02 Jun 1996 10:15:00 +0000",
            "description": "The castaway in Desert Island Discs this week is a businessman who started life as one of 10 children in a poor family in Donegal, moved with his family to London's East End and started his career at Matchbox Toys in Hackney. From there, he worked his way up the corporate ladder of several large companies until 10 years ago he organised and led a management buy-out of Compass - part of Grand Metropolitan.\n\nNow extremely rich in his own right, he'll be talking to Sue Lawley about the controversy he then attracted. Known as 'The Caterer' because of his business background, he went on to acquire London Weekend Television and controversially to take over the Forte Group. He'll be discussing his early ambitions to be a priest, his days at a seminary, the high-achieving nature of his family and how he coped with the stress of the Granada takeover of the Forte Group. \n\n[Taken from the original programme material for this archive edition of Desert Island Discs] \n\nFavourite track: Norma Casta Diva by Vincenzo Bellini\nBook: The History of the World by J M Roberts\nLuxury: Painting kit (easel, oils, brushes)",
            "length": "34768000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02ppdp4.mp3"
        },
        {
            "title": "Michael White",
            "datePublished": "Sun, 26 May 1996 10:15:00 +0000",
            "description": "The castaway in Desert Island Discs this week is the producer Michael White. Renowned for his theatrical flair - with a string of successes such as Sleuth, The Rocky Horror Show, O, Calcutta and A Chorus Line - he'll be talking to Sue Lawley about the downside of show business as well as the euphoria of the successful first night. He'll also be describing his cosmopolitan but miserable childhood. Sent away to school in Switzerland alone and just seven years old because of chronic asthma, his early years were often lonely and confusing.\n\n[Taken from the original programme material for this archive edition of Desert Island Discs] \n\nFavourite track: Coming In From The Cold by Bob Marley\nBook: A title by Marcel Proust\nLuxury: Bicycle",
            "length": "34048000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02ppdp7.mp3"
        },
        {
            "title": "Janet Holmes à Court",
            "datePublished": "Sun, 19 May 1996 10:15:00 +0000",
            "description": "The castaway in Desert Island Discs this week is Janet Holmes à Court. Recently named Businesswoman of the Year, she'll be talking to Sue Lawley about how, after the sudden death of her husband, the hugely rich Robert Holmes a Court, she was advised to sell up and retire to the beach. Before his death, he had just been starting to turn the tide which had run against him after he'd lost around £400 million in the stock market crash of 1987. Forgetting the beach, she proceeded to take up the reins of the business. Over the last six years, she has created an impressive commercial organisation out of cattle, construction and transport, she owns 10 theatres in London's West End and her cattle company is estimated to own about 1.1% of Australia's land mass. The owner of a desert island herself, she'll be contemplating exile far from the demands of the business world.\n\n[Taken from the original programme material for this archive edition of Desert Island Discs] \n\nFavourite track: Fidelio by Ludwig van Beethoven\nBook: Tourmaline by Randolph Stow\nLuxury: Jar of Vegemite",
            "length": "35824000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02ppdp9.mp3"
        },
        {
            "title": "Hugh Laurie",
            "datePublished": "Sun, 12 May 1996 10:15:00 +0000",
            "description": "Sue Lawley's castaway is actor and comedian Hugh Laurie.\n\nFavourite track: Brown Eyed Girl by Van Morrison\nBook: A self-learn Italian book (slowly)\nLuxury: Family photo album",
            "length": "34176000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02ppdpc.mp3"
        },
        {
            "title": "Pauline Quirke",
            "datePublished": "Sun, 05 May 1996 10:15:00 +0000",
            "description": "BBC TV's Birds Of A Feather is one of the country's favourite comedy programmes, attracting audiences of 14 or 15 million on a Sunday evening. This week, one of its co-stars, Pauline Quirke, will be cast well away from Chigwell as she prepares to set sail for Radio 4's desert island.\n\nKnown more famously perhaps as Sharon of Sharon 'n' Tracey, she'll be talking to Sue Lawley about her poor upbringing in London's East End, her first role as a child arsonist at the age of 10 in Dixon of Dock Green and her most recent appearance as a 22-stone putative murderess in The Sculptress.\n\n[Taken from the original programme material for this archive edition of Desert Island Discs] \n\nFavourite track: I Will Survive by Gloria Gaynor\nBook: Crying With Laughter by Bob Monkhouse\nLuxury: Shampoo",
            "length": "33984000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02ppdpj.mp3"
        },
        {
            "title": "Mitsuko Uchida",
            "datePublished": "Sun, 28 Apr 1996 10:15:00 +0000",
            "description": "This week, Sue Lawley's desert island castaway is the pianist Mitsuko Uchida. She was born in Japan, but, when she was 12, her family moved to Vienna, where she fully immersed herself in the music that she has now become famous for playing - Bach, Beethoven, Schubert and in particular, Mozart. Her aim is to be always faithful to the composer whose work she is trying to interpret.\n\n[Taken from the original programme material for this archive edition of Desert Island Discs] \n\nFavourite track: Cello Suite No 1 in G Major by Johann Sebastian Bach\nBook: A title, in Russian and English, by Leo Tolstoy\nLuxury: Piano",
            "length": "37152000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02ppdpl.mp3"
        },
        {
            "title": "Hanif Kureishi",
            "datePublished": "Sun, 21 Apr 1996 10:15:00 +0000",
            "description": "The castaway in Desert Island Discs this week is the novelist and playwright Hanif Kureishi. He'll be talking to Sue Lawley about his enormously successful screenplay for My Beautiful Laundrette, his novel - televised by the BBC - The Buddha of Suburbia and his love of pop music which he plays at full volume whilst writing. \n\nHe'll also be discussing the racial abuse which dominated his childhood in Bromley, where, as the son of an Indian father and an English mother, and the only Asian boy in his school, he was invited to instigate racial bullying, as often as finding himself to be its target. \n\n[Taken from the original programme material for this archive edition of Desert Island Discs] \n\nFavourite track: In A Silent Way by Miles Davis\nBook: Complete Works by Sigmund Freud\nLuxury: Marijuana seeds",
            "length": "33792000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02ppdpp.mp3"
        },
        {
            "title": "Viscount Rothermere",
            "datePublished": "Sun, 14 Apr 1996 10:15:00 +0000",
            "description": "The castaway in Desert Island Discs this week is Viscount Rothermere. As proprietor of the Daily Mail, the Mail On Sunday, London's Evening Standard and a string of regional newspapers, he is the last of the hereditary grandees who once dominated the newspaper industry. He'll be talking to Sue Lawley about his family's long involvement with newspapers, about his own views on the ethical problems facing the press today and about his ability to see into the future. \n\n[Taken from the original programme material for this archive edition of Desert Island Discs] \n\nFavourite track: How Ya Gonna Keep Em Down On The Farm by Eddie Cantor\nBook: Divine Comedy by Dante Alighieri\nLuxury: A pair of scissors",
            "length": "35648000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02ppdpw.mp3"
        },
        {
            "title": "Dickie Bird",
            "datePublished": "Sun, 07 Apr 1996 10:15:00 +0000",
            "description": "This summer will see what will be a sad day in Test cricket history: Dickie Bird, who has umpired 65 Test matches, 92 one-day internationals and three world cup finals, will be umpiring his last Test match at Lords. \n\nThis week in Desert Island Discs, he will be talking to Sue Lawley about his church-going childhood in Barnsley, and his anxieties about punctuality - arriving as he has done at least four hours before time at Buckingham Palace, Chequers and The Oval.\n\n[Taken from the original programme material for this archive edition of Desert Island Discs] \n\nFavourite track: The Way We Were by Barbra Streisand\nBook: Wisden Almanack for cricketers by Wisden\nLuxury: TV & satellite to watch Test matches",
            "length": "33920000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02ppdq2.mp3"
        },
        {
            "title": "Simon Weston",
            "datePublished": "Sun, 31 Mar 1996 10:15:00 +0000",
            "description": "Nearly 14 years ago, the young Simon Weston set off to serve with his regiment in the Falklands War. On 8th June 1982 in Bluff Cove, his ship was bombed, most of his friends were killed, but he survived.\n\nThis week on Desert Island Discs, he'll be talking to Sue Lawley about that shattering moment, his subsequent rehabilitation and how his disfigurement has affected his life.\n\n[Taken from the original programme material for this archive edition of Desert Island Discs] \n\nFavourite track: What a Wonderful World by Louis Armstrong\nBook: Sharpe's Eagle by Bernard Cornwell\nLuxury: Daily newspapers",
            "length": "33824000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02ppdq5.mp3"
        },
        {
            "title": "Kyra Vayne",
            "datePublished": "Sun, 24 Mar 1996 11:15:00 +0000",
            "description": "The castaway in Desert Island Discs this week is someone who has unexpectedly encountered professional acclaim late in her life. \n\nSinger Kyra Vayne could well be described as one of opera's forgotten voices - until this year when, thanks to the release of some previously-unknown recordings which had lived under her bed in Shepherd's Bush for 30 years, her voice reached a large new audience of admirers. She'll be talking to Sue Lawley about her reaction to the ecstatic reception given to her first CD, how she lived a life of obscurity working in a bank after she abandoned her career and about her life in pre-revolution Russia, where she and her family nearly starved to death before fleeing to England. \n\n[Taken from the original programme material for this archive edition of Desert Island Discs] \n\nFavourite track: Symphony No 9 Final Movement by Ludwig van Beethoven\nBook: A culinary book\nLuxury: Peanuts and treats to tame animals and birds",
            "length": "35120000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02ppdqd.mp3"
        },
        {
            "title": "Lord Alexander",
            "datePublished": "Sun, 17 Mar 1996 11:15:00 +0000",
            "description": "The castaway in Desert Island Discs this week is the Chairman of the National Westminster Bank Lord Alexander. \n\nHe'll be talking to Sue Lawley about how he began his career as a jobbing barrister, doing all manner of work on the western circuit where he earned a reputation which took him to the top of his profession. Among many others, he won cases for Jeffrey Archer and Kerry Packer, and lost one for Ken Livingstone's GLC. In the 1980s he moved to the City as Chairman of the Takeover Panel and then, to his surprise, he was invited to become Chairman of the National Westminster Bank. Tipped by those who know him well to become the next Lord Chancellor if the Conservatives stay in power, he'll be discussing his past, present and future and contemplating castaway life.\n\n[Taken from the original programme material for this archive edition of Desert Island Discs] \n\nFavourite track: Do You Hear The People Sing? by Claude-Michel Schonberg\nBook: Other Men's Flowers by Lord A P Wavell\nLuxury: Paints and canvas",
            "length": "35648000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02ppdqk.mp3"
        },
        {
            "title": "Rt Hon Gordon Brown MP",
            "datePublished": "Sun, 03 Mar 1996 11:15:00 +0000",
            "description": "The castaway in Desert Island Discs this week is the Shadow Chancellor Gordon Brown. He'll be talking to Sue Lawley about how he was an early 'fast-track' pupil - going to Edinburgh University at 16 - their youngest student for 50 years, about the reasons behind his standing aside in favour of Tony Blair in the contest for the Labour leadership, and about his childhood as one of three sons of a Scottish minister.\n\n[Taken from the original programme material for this archive edition of Desert Island Discs] \n\nFavourite track: Brandenburg Concerto 3 Suite No 3 in D Major by Johann Sebastian Bach\nBook: The Story of Art by Sir Ernst Gombrich\nLuxury: Tennis ball machine and racket",
            "length": "35040000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02ppdqp.mp3"
        },
        {
            "title": "Sir Roy Calne",
            "datePublished": "Sun, 25 Feb 1996 11:15:00 +0000",
            "description": "The castaway in Desert Island Discs this week is a surgeon and a painter. \n\nSir Roy Calne - Professor of Surgery at Addenbrooke's Hospital in Cambridge - will be talking to Sue Lawley about his early conviction that transplant surgery was a viable way of treating kidney and liver disease, about his struggles to have his ideas accepted and about the paintings he has done of his patients - many of which have been the subject of several public exhibitions. \n\n[Taken from the original programme material for this archive edition of Desert Island Discs] \n\nFavourite track: Symphony No 9 From The New World (Opus 95) by Antonin Dvořák\nBook: Global Biodiversity by Brian Groombridge\nLuxury: Paints and canvas",
            "length": "35888000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02ppdqx.mp3"
        },
        {
            "title": "Professor George Steiner",
            "datePublished": "Sun, 18 Feb 1996 11:15:00 +0000",
            "description": "The castaway in Desert Island Discs this week is Professor George Steiner. One of the most prominent intellectuals of our time, he'll be talking to Sue Lawley about how the English academic establishment has taken decades to accept him despite his early popularity as a Cambridge lecturer, and about the problem of reconciling the love of beauty with great acts of evil.\nHe'll also be describing how his family left Austria for France in the 1920s and how he was one of only two boys to survive in his class in the largely Jewish lycee he attended in Paris. \n\nWhen asked to select just one record to take to the island, Professor George said that for him, it was all or nothing.\n\n[Taken from the original programme material for this archive edition of Desert Island Discs] \n\nBook: 500 year ahead calendar and appointment book\nLuxury: Computer",
            "length": "36560000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02ppdr2.mp3"
        },
        {
            "title": "Susan Hill",
            "datePublished": "Sun, 11 Feb 1996 11:15:00 +0000",
            "description": "The castaway in Desert Island Discs this week is one of the country's best-known novelists. \n\nAuthor of I'm the King of the Castle, Strange Meeting and The Woman in Black, among many other books, Susan Hill will be talking to Sue Lawley about the inspiration for her recent and highly-acclaimed sequel to Daphne du Maurier's Rebecca; about the loneliness which characterised her childhood and about the relationship between tragedy in her own life and the way she writes about it in her novels.\n\n[Taken from the original programme material for this archive edition of Desert Island Discs] \n\nFavourite track: Tom Bowling by Benjamin Britten\nBook: The Pursuit of Love by Nancy Mitford\nLuxury: The Barnes Collection (paintings)",
            "length": "36880000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02ppdr7.mp3"
        },
        {
            "title": "Eve Arnold",
            "datePublished": "Sun, 04 Feb 1996 11:15:00 +0000",
            "description": "The castaway in Desert Island Discs this week is one of the world's outstanding photojournalists, Eve Arnold. The first American woman member of the famous photographic co-operative, Magnum, she'll be talking about how her passion for photography began with the present of a camera, and how, since then, she has travelled the world in search of arresting pictures, living with hippy communes and with the black power movement, as well as photographing some of the great movie stars, including Paul Newman, Joan Crawford and Marilyn Monroe, with whom she had a close friendship for 10 years.\n\n[Taken from the original programme material for this archive edition of Desert Island Discs] \n\nFavourite track: Flute Concerto No 1 in D Major Op 44R Op 44 by Antonio Vivaldi\nBook: Arabian Nights (1000 and One Nights)\nLuxury: Dark room, film and camera",
            "length": "35344000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02ppdrf.mp3"
        },
        {
            "title": "Julian Barnes",
            "datePublished": "Sun, 28 Jan 1996 11:15:00 +0000",
            "description": "The castaway in Desert Island Discs this week is the writer Julian Barnes. Since his first novel - Metroland - was published when he was 34, he has written another eight and won four literary prizes - most famously perhaps for Flaubert's Parrot. \n\nHe'll be talking to Sue Lawley about his passion for Flaubert, his love for Leicester City, his notions of love and his fear of death.\n\n[Taken from the original programme material for this archive edition of Desert Island Discs] \n\nFavourite track: Requiem Dies Irae (from Requiem) by Wolfgang Amadeus Mozart\nBook: Letters by Gustave Flaubert\nLuxury: Writing equipment",
            "length": "36112000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02ppdrk.mp3"
        },
        {
            "title": "Chili Bouchier",
            "datePublished": "Sun, 21 Jan 1996 11:15:00 +0000",
            "description": "The castaway in Desert Island Discs this week is the only surviving British star of the silent screen. Chili Bouchier will be talking to Sue Lawley about some of the perils of making silent movies and her transition into the talkies with hugely successful films like Carnival and Gypsy. She'll also be describing the ups and downs of a personal life which has been as vivid as her many films - encompassing two disastrous marriages with men who betrayed her, marriage proposals from Howard Hughes and breaking her Hollywood contract with Warner Brothers which meant she was blackballed and unable to make another film.\n\n[Taken from the original programme material for this archive edition of Desert Island Discs] \n\nFavourite track: The World Is Waiting For The Sunrise by Acker Bilk\nBook: In Tune With The Infinite: Fullness of Peace Power by Ralph Waldo Trine\nLuxury: Make-up kit",
            "length": "35280000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02ppdrs.mp3"
        },
        {
            "title": "Jimmy McGovern",
            "datePublished": "Sun, 14 Jan 1996 11:15:00 +0000",
            "description": "The castaway in Desert Island Discs this week is the playwright Jimmy McGovern. He'll be talking to Sue Lawley about the TV series Cracker - one of the top television series of the 1990s - about how much of the central character, Fitz, is modelled on himself, how he feels about the violent world it portrays and about why we are fascinated by criminal psychology. For seven years a writer on Brookside, he'll be describing how the phenomenal success of Cracker led to the reviving of his previously-rejected scripts for films like Priest and Hearts and Minds. He'll also be relating how the man who has since made a living out of words had such a bad stammer as a child that he was largely unintelligible. \n\n[Taken from the original programme material for this archive edition of Desert Island Discs] \n\nFavourite track: When I Fall In Love by Nat King Cole\nBook: Ulysses by James Joyce\nLuxury: Haemorrhoid ointment",
            "length": "33712000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02ppdry.mp3"
        },
        {
            "title": "Christopher Hampton",
            "datePublished": "Sun, 07 Jan 1996 11:15:00 +0000",
            "description": "The castaway in Desert Island Discs this week is the writer Christopher Hampton. He'll be talking to Sue Lawley about his multiplicity of talents - after obtaining a first at Oxford he went straight to the Royal Court Theatre in London where he wrote several highly-regarded plays, among them The Philanthropist. He then went on to win an Oscar for his screenplay of the film Dangerous Liaisons, to translate the work of Ibsen and Chekhov, to write the book for Sunset Boulevard, and, most recently, to direct the film Carrington, which he also wrote.\n\n[Taken from the original programme material for this archive edition of Desert Island Discs] \n\nFavourite track: Requiem: The Lachrymosa by Wolfgang Amadeus Mozart\nBook: A title by Marcel Proust\nLuxury: Pen and paper",
            "length": "35168000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02ppds2.mp3"
        },
        {
            "title": "Lady Margaret Tebbit",
            "datePublished": "Sun, 31 Dec 1995 11:15:00 +0000",
            "description": "The castaway in Desert Island Discs this week is Margaret Tebbit. She'll be talking to Sue Lawley about the night 11 years ago when the IRA detonated a huge bomb at the Grand Hotel in Brighton, where she was staying with her husband for the Tory Party Conference. Since that dreadful night, she has been severely paralysed, and she'll be describing the effect on her life: the dreams she has in which she no longer has to use a wheelchair, the new friends she's made and the old ones who turned out not to be such good friends in adversity and how her previous experience of mental illness - in the form of severe depression - compares with her current physical incapacity.\n\n[Taken from the original programme material for this archive edition of Desert Island Discs] \n\nFavourite track: Nocturne by Evert Taube\nBook: Hillier's Dictionary of Plants by Hillier\nLuxury: An endless team of Man Fridays",
            "length": "35472000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02ppds4.mp3"
        },
        {
            "title": "Petula Clark",
            "datePublished": "Sun, 24 Dec 1995 11:15:00 +0000",
            "description": "The castaway in Desert Island Discs this week is an entertainer who has managed to captivate a generation. Petula Clark will be talking to Sue Lawley about how the British still perceive her as 'our pet' since her early singing days when she was chosen to sing in Trafalgar Square on VE night. Now, arguably the biggest female recording star Britain has ever produced, she is about to take on the lead role in Sunset Boulevard in the West End. In between, hits like The Little Shoemaker, Down Town and Don't Sleep in the Subway ensured she became an international star as well - captivating audiences in America and France.\n\n[Taken from the original programme material for this archive edition of Desert Island Discs] \n\nFavourite track: Piano Concerto 21 in C K 467 - Andante by Wolfgang Amadeus Mozart\nBook: A title by Peter Ustinov\nLuxury: Her piano",
            "length": "34688000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02ppds7.mp3"
        },
        {
            "title": "Barbara Dickson",
            "datePublished": "Sun, 17 Dec 1995 11:15:00 +0000",
            "description": "The castaway this week in Desert Island Discs is the singer and actress Barbara Dickson. She'll be talking to Sue Lawley about how she progressed from being the daughter of a Rothsyth docker to the lead role in Willy Russell's play John, Paul, Ringo and Bert, and later to win an award for her performance in his play Blood Brothers. Along the way, her extraordinary singing voice brought her a string of hit singles, including I Know Him So Well, while recently her acting abilities landed her one of the leading roles in ITV's Band of Gold.\n\n[Taken from the original programme material for this archive edition of Desert Island Discs] \n\nFavourite track: Don't Let Me Be Lonely Tonight by James Taylor\nBook: English & Scottish Ballads by Francis Child\nLuxury: A very large set of solar-powered hair rollers",
            "length": "33456000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02ppdsd.mp3"
        },
        {
            "title": "Alison Steadman",
            "datePublished": "Sun, 03 Dec 1995 11:15:00 +0000",
            "description": "The castaway in Desert Island Discs this week is the actress Alison Steadman. She'll be talking to Sue Lawley about her role as the monstrous Beverly in the BBC's production of Abigail's Party 18 years ago, as well as her talent for improvisation which she has perfected with her director husband, Mike Leigh. She'll also be discussing how daunting she found it recently to take on the role of Mrs Bennett in the BBC's Pride and Prejudice.\n\n[Taken from the original programme material for this archive edition of Desert Island Discs] \n\nFavourite track: Tosca E Lucevan Le Stella by Giacomo Puccini\nBook: One Hundred Years of Solitude by Gabriel Garcia Marquez\nLuxury: Hot lemon flannels (as provided in Chinese restaurants)",
            "length": "34880000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02ppdsg.mp3"
        },
        {
            "title": "George Martin",
            "datePublished": "Sun, 19 Nov 1995 11:15:00 +0000",
            "description": "The castaway in Desert Island Discs this week is a musician who became famous for producing other people's music. George Martin will be talking to Sue Lawley about how he earned money to pay for piano lessons, was helped by a fairy godfather to study at the Guildhall School of Music and went on in 1962 to sign up and produce the group which changed the face of popular music. He'll be discussing his relationship with The Beatles and his extremely productive life since they disbanded 25 years ago.\n\n[Taken from the original programme material for this archive edition of Desert Island Discs] \n\nFavourite track: Bess You Is My Woman Now by George Gershwin\nBook: A book on how to build a boat\nLuxury: An electric keyboard",
            "length": "35552000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02ppdsm.mp3"
        },
        {
            "title": "Umberto Eco",
            "datePublished": "Sun, 12 Nov 1995 11:15:00 +0000",
            "description": "The castaway in Desert Island Discs this week is the writer Umberto Eco. His best-selling novel The Name of the Rose propelled him from the relative obscurity of his post as Professor of Semiotics at Bologna University to worldwide fame at the age of 50.\n\nHe'll be talking to Sue Lawley about how he deals with the demands of his celebrity status, his childhood in Mussolini's Italy and his other works - Foucault's Pendulum and The Island of the Day Before.\n\n[Taken from the original programme material for this archive edition of Desert Island Discs] \n\nFavourite track: Goldberg Varations No 22 by Johann Sebastian Bach\nBook: The New York Phone Book\nLuxury: Laptop computer",
            "length": "35296000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02ppdsw.mp3"
        },
        {
            "title": "Rt Hon Gillian Shephard MP",
            "datePublished": "Sun, 05 Nov 1995 11:15:00 +0000",
            "description": "The castaway in Desert Island Discs this week is the Secretary of State for Education and Employment, Gillian Shephard. \n\nShe'll be talking to Sue Lawley about the importance of her roots in rural Norfolk. Although she briefly left to go to Oxford, she was born and brought up in Norfolk and worked in local parliament there until her late 40s, when she entered Parliament to represent a Norfolk seat. She'll be discussing her own school days, and how they influence her perception of the quality of schools nowadays. \n\n[Taken from the original programme material for this archive edition of Desert Island Discs] \n\nFavourite track: Mass in B Minor: Cum Sancto Spirito by Johann Sebastian Bach\nBook: The Waning of the Middle Ages by Johan H Huizinga\nLuxury: Madame Rochas scent",
            "length": "37424000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02ppdt2.mp3"
        },
        {
            "title": "Elizabeth Jane Howard",
            "datePublished": "Sun, 29 Oct 1995 11:15:00 +0000",
            "description": "The castaway in Desert Island Discs this week is the novelist Elizabeth Jane Howard. In 1950, her first novel The Beautiful Visit was published. Now, some 45 years later and after many other books, she has just completed the concluding book of The Cazalet Chronicles. She'll be talking to Sue Lawley about the problems of combining writing and marriage; she abandoned her three marriages - her first husband, being the naturalist Peter Scott, and her last, the writer Kingsley Amis; and she'll be ruminating on the nature of love and who might experience it. \n\n[Taken from the original programme material for this archive edition of Desert Island Discs] \n\nFavourite track: Requiem Dies Irae by Wolfgang Amadeus Mozart\nBook: All the sonatas by Scarlatti\nLuxury: Piano",
            "length": "39440000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02ppdt5.mp3"
        },
        {
            "title": "Don Black",
            "datePublished": "Sun, 22 Oct 1995 11:15:00 +0000",
            "description": "The castaway in Desert Island Discs this week is one of the country's most successful lyricists, Don Black.\n\nSongs like Born Free and Diamonds are Forever, and musicals like Sunset Boulevard, Billy and Aspects of Love have made him a rich man. But he'll be talking to Sue Lawley of his early memories of his poor but happy Jewish family in the East End of London and how an apprenticeship on the New Musical Express led him into the world of popular music. \n\n[Taken from the original programme material for this archive edition of Desert Island Discs] \n\nFavourite track: The Four Seasons Adagio In G Minor For Organ & Strings by Antonio Vivaldi\nBook: 14,000 Things To Be Happy About by Barbara Ann Kipfer\nLuxury: Snooker table",
            "length": "33472000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02ppdt9.mp3"
        },
        {
            "title": "Richard Hoggart",
            "datePublished": "Sun, 15 Oct 1995 10:15:00 +0000",
            "description": "The castaway in Desert Island Discs this week is the academic and author Richard Hoggart. Nearly 40 years ago, he wrote the hugely influential Uses of Literacy. In it, he argued that the working classes were being short changed - both by rampant consumerism and by the dross he felt was being churned out by the mass media.\n\nCast well away from materialism and the media on the desert island, he'll be talking about how he now feels about his original thesis and about his own working-class background in Leeds, where he was orphaned at an early age.\n\n[Taken from the original programme material for this archive edition of Desert Island Discs] \n\nFavourite track: Fidelio: The Prisoner's Chorus From Act One by Ludwig van Beethoven\nBook: Essays by Michel de Montaigne\nLuxury: Fountain pen and paper",
            "length": "35664000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02ppdtg.mp3"
        },
        {
            "title": "Alan Yentob",
            "datePublished": "Sun, 08 Oct 1995 10:15:00 +0000",
            "description": "The castaway in Desert Island Discs this week is the Controller of BBC1, Alan Yentob. He'll be talking to Sue Lawley about his upbringing in Manchester and London, the Cathedral boarding school where he and his twin brother were the only two Jewish boys and his 27 years at the BBC.\n\nDuring that time he rose steadily through the ranks to become Head of Music and Arts, ending up as the only person to have run both BBC1 and BBC2.\n\n[Taken from the original programme material for this archive edition of Desert Island Discs] \n\nFavourite track: Four Last Songs from Beim Schlafengehen by Richard Strauss\nBook: Essays by Michel de Montaigne\nLuxury: Video recorder",
            "length": "35024000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02ppdtm.mp3"
        },
        {
            "title": "Jenny Pitman",
            "datePublished": "Sun, 01 Oct 1995 10:15:00 +0000",
            "description": "The castaway in Desert Island Discs this week is the racehorse trainer Jenny Pitman. She'll be talking to Sue Lawley about the empathy she feels for the horses she trains and her relationship with their owners. She won the Grand National in 1983 with Corbiere, and she has twice trained the winner of the Cheltenham Gold Cup. In 1995 her charge, Royal Athlete, won the Grand National, crowning her spectacular success as a trainer.\n\n[Taken from the original programme material for this archive edition of Desert Island Discs] \n\nFavourite track: A Four Legged Friend by Roy Rogers\nBook: Veterinary Notes For Horse Owners by M Horace Hayes\nLuxury: Television set",
            "length": "39200000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02ppdtt.mp3"
        },
        {
            "title": "Maurice Saatchi",
            "datePublished": "Sun, 24 Sep 1995 10:15:00 +0000",
            "description": "The castaway in Desert Island Discs this week is the advertising man, Maurice Saatchi. He and his brother Charles created what became the biggest advertising agency in the world. Saatchi & Saatchi masterminded the Conservative victory in 1979 with their slogan 'Labour isn't working'.\n\nHe'll be telling Sue Lawley about the heady days of the 1980s - a red Ferrari would be delivered unannounced to the best names in the business, with the offer of a job with Saatchi & Saatchi. Then, last year, he fell from grace when a boardroom shake-up meant he had to leave the company he had so lovingly created.\n\n[Taken from the original programme material for this archive edition of Desert Island Discs] \n\nFavourite track: Die Dreigroschenoper Surabaya Johnny by Kurt Weill\nBook: Hamlet (1897 edition) by William Shakespeare\nLuxury: Virtual-reality headset",
            "length": "35664000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02ppdv3.mp3"
        },
        {
            "title": "Max Nicholson",
            "datePublished": "Sun, 17 Sep 1995 10:15:00 +0000",
            "description": "The castaway in Desert Island Discs this week is a man who spans our century. Aged 91, Max Nicholson has enjoyed careers in conservation, politics, journalism and the Civil Service.\n\nBut his great passion remains ornithology. As a tiny boy, his parents took him one rainy afternoon to see the stuffed birds in the Natural History Museum, and there his great obsession was born. He was a conservationist before anyone understood the idea of ecology. He's played major parts in the founding of the Nature Conservancy Council, the World Wildlife Fund and Sites of Special Scientific Interest.\n\n[Taken from the original programme material for this archive edition of Desert Island Discs] \n\nFavourite track: Symphony No 6 In F Major Op 68 by Ludwig van Beethoven\nBook: The Phenomenon of Man by Pierre Teilhard De Chardin\nLuxury: Binoculars",
            "length": "39280000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02ppdv6.mp3"
        },
        {
            "title": "John Updike",
            "datePublished": "Sun, 10 Sep 1995 10:15:00 +0000",
            "description": "Sue Lawley's castaway on Desert Island Discs this week is the celebrated American writer John Updike. His novels include Rabbit Run (and three Rabbit follow-ups), Couples and The Witches of Eastwick.\n\nHe is both poet and historian, famous for charting the changes in post-war American society such as increasing marital breakdown and changing attitudes to death. He started his writing career by selling stories to the New Yorker magazine - something his mother had tried for years but had never succeeded. And he'll be telling Sue Lawley about how he overcame a bad stutter, how he has learnt to control his psoriasis and how now, aged 63, he finally feels normal; part of the gang he never was as a teenager. \n\n[Taken from the original programme material for this archive edition of Desert Island Discs] \n\nFavourite track: Sing, Sing, Sing by The Benny Goodman Orchestra\nBook: Complete Works by Marcel Proust\nLuxury: Silken tent (for luxury, not survival)",
            "length": "35904000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02ppdvb.mp3"
        },
        {
            "title": "Wendy Richard",
            "datePublished": "Sun, 09 Jul 1995 10:15:00 +0000",
            "description": "The castaway in Desert Island Discs this week is the actress Wendy Richard, one of the best-known faces on British television. \n\nShe'll be talking to Sue Lawley about a career which started with the Arthur Haines show in the 60s, and took her through a whole series of long-running television programmes - The Newcomers, Are You Being Served? and its sequel Grace and Favour. However, it was 10 years ago that she took the part which was to bring her her greatest popularity - Pauline Fowler in EastEnders.\n\n[Taken from the original programme material for this archive edition of Desert Island Discs] \n\nFavourite track: Land Of Hope And Glory by Edward Elgar/Benson\nBook: Wilt by Tom Sharpe\nLuxury: Tapestry to make",
            "length": "35104000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02ppdvh.mp3"
        },
        {
            "title": "Duke Of Westminster",
            "datePublished": "Sun, 02 Jul 1995 10:15:00 +0000",
            "description": "The castaway in Desert Island Discs this week is Gerald Cavendish Grosvenor, the sixth Duke of Westminster. He'll be talking to Sue Lawley about the responsibilities and pleasures of being one of the country's richest men. Having enjoyed an idyllic childhood on the banks of Loch Ern in County Fermanagh, it was a rude shock to be transplanted to an English prep school at the age of seven. The comparatively early death of his father then meant that by the time he was just 19 he was managing one of Britain's greatest estates, and by 27 he owned it. He'll be discussing the pleasures and the perils of his position, why he is no longer a member of the Conservative Party and his hopes and dreams for his four-year-old son and heir, Hugh.\n\n[Taken from the original programme material for this archive edition of Desert Island Discs] \n\nFavourite track: Albatross by Fleetwood Mac\nBook: Through Russian Snows by G A Henty\nLuxury: Telescope",
            "length": "34352000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02ppdvl.mp3"
        },
        {
            "title": "Jasper Conran",
            "datePublished": "Sun, 25 Jun 1995 10:15:00 +0000",
            "description": "The castaway in Desert Island Discs this week is clothes designer Jasper Conran. Son of Sir Terence Conran and Shirley Conran, he has art, design and business in his blood and was always determined to make his own way in the world of fashion without parental influence. He has said, \"in a family like mine, if you're not successful, you drown\".\n\nHe'll be telling Sue Lawley about his difficult childhood of nannies and his public school where he was bullied for being overweight, all of which he overcame to win a scholarship to the prestigious Parsons School of Art in New York. After that, his career took off and, at the age of 27, he was named Designer of the Year. By the late 1980s he was almost bankrupt and had to re-invent his business to a 1990s-type smaller and more manageable outfit.\n\n[Taken from the original programme material for this archive edition of Desert Island Discs] \n\nFavourite track: Tosca Vissi D' Arte by Giacomo Puccini\nBook: Tales by Hoffman\nLuxury: Vintage Krug Champagne (endless supply)",
            "length": "33968000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02ppdvq.mp3"
        },
        {
            "title": "Sir Magdi Yacoub",
            "datePublished": "Sun, 18 Jun 1995 10:15:00 +0000",
            "description": "The castaway in Desert Island Discs this week is one of the great pioneers of heart transplant surgery - Professor Sir Magdi Yacoub.\n\nHe'll be talking to Sue Lawley about his dedication to his patients, whether heart transplants are now routinely successful and about some of the earlier controversies which his experimental surgery has attracted. He will also be describing his early ambitions to be a doctor, which were discouraged by his father, and how important music is to him. He often has it playing in the operating theatre.\n\n[Taken from the original programme material for this archive edition of Desert Island Discs] \n\nFavourite track: Fantasia For Piano In D Minor by Wolfgang Amadeus Mozart\nBook: Pluto's Republic by Sir Peter Meddower\nLuxury: Hammock",
            "length": "35296000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02ppdvv.mp3"
        },
        {
            "title": "John Lee Hooker",
            "datePublished": "Sun, 11 Jun 1995 10:15:00 +0000",
            "description": "The castaway in Desert Island Discs this week is one of the oldest and deepest voices in rock music - the legendary bluesman John Lee Hooker. The son of a preacher man, he was brought up in Clarksdale, Mississippi, and his first guitar was made from an old inner tube tied to the barn door. By the age of 14, he had his own guitar and ran away to Memphis with two dollars in his pocket for a life touring small blues clubs.\n\nWith hits like Boom Boom, Dimples and Boogie Chillun, he has been one of the major influences on rock stars like Eric Clapton and the Rolling Stones.\n\n[Taken from the original programme material for this archive edition of Desert Island Discs] \n\nFavourite track: Goin Down Slow by B.B. King & Bobby Bland\nBook: A book with pictures (of pretty women)\nLuxury: His guitar",
            "length": "30960000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02ppdw1.mp3"
        },
        {
            "title": "Brian Blessed",
            "datePublished": "Sun, 04 Jun 1995 10:15:00 +0000",
            "description": "The castaway in Desert Island Discs this week is the actor Brian Blessed.\n\nHe'll be talking to Sue Lawley about Z Cars - the series which first brought him to public prominence in the 1960s, about his friendship with the actress Katherine Hepburn and his obsession with climbing mountains - mountains like Everest and Kilimanjaro - when he isn't acting.\n\n[Taken from the original programme material for this archive edition of Desert Island Discs] \n\nFavourite track: Rite of Spring The Adoration Of Earth by Igor Stravinsky\nBook: In Search of the Miraculous by Peter Ouspensky\nLuxury: Scarf given to him by the Dalai Lama",
            "length": "35216000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02ppdw4.mp3"
        },
        {
            "title": "Marianne Faithfull",
            "datePublished": "Sun, 28 May 1995 10:15:00 +0000",
            "description": "The castaway in Desert Island Discs this week is Marianne Faithfull. Singer and actress, she was the original 1960s wild child.\n\nAt the age of 17, when she was still a convent schoolgirl in Reading, she shot to fame with the hit single As Tears Go By; written for her by Mick Jagger and Keith Richards. She was Mick Jagger's mistress, she hung out with Bob Dylan and Jimi Hendrix, she was young, beautiful and rich and she seemed to have it all. But the glamorous life of the pop star turned into a nightmare of drugs, homelessness, suicide attempts and broken marriages.\n\nThe daughter of an Austrian baroness, her life has been full of myths and legends. She'll be telling Sue Lawley about the years of recovery, how she's found happiness in Ireland and her hopes for a Man Friday on her desert island. \n\n[Taken from the original programme material for this archive edition of Desert Island Discs] \n\nFavourite track: Small Axe by Bob Marley & The Wailers\nBook: Robinson Crusoe by Daniel Defoe\nLuxury: Pen from Aspreys with attached magnifying glass",
            "length": "34176000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02ppdw8.mp3"
        },
        {
            "title": "Sir Bernard Ingham",
            "datePublished": "Sun, 21 May 1995 10:15:00 +0000",
            "description": "Sue Lawley's castaway in Desert Island Discs this week is Sir Bernard Ingham. For 11 years, one month and five days, almost from when she came to power to the day she left office, he stood shoulder-to-shoulder with Mrs Thatcher. A former card-carrying member of the Labour Party, he became her Chief Press Secretary, adviser and supporter.\n\nHe was accused by the media of crossing the line between civil service impartiality and political support on that fateful day in Paris in November 1990, just 36 hours before she lost the leadership election. He'll be telling Sue Lawley about his childhood in Yorkshire, his training as a journalist on the Hebden Bridge Times, his transition to Press Secretary for Tony Benn, Maurice MacMillan and Barbara Castle. In 1979, no-one was more astonished than he when he was headhunted to become one of Mrs Thatcher's closest advisers, and finally one of the most influential members of her team.\n\n[Taken from the original programme material for this archive edition of Desert Island Discs] \n\nFavourite track: Violin Concerto in B Minor - Andante by Edward Elgar\nBook: Times Atlas of the World\nLuxury: Colin Cowdrey's bowling machine",
            "length": "35920000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02ppdwc.mp3"
        },
        {
            "title": "Neil Simon",
            "datePublished": "Sun, 14 May 1995 10:15:00 +0000",
            "description": "The castaway in Desert Island Discs this week is one of America's most successful playwrights. Since he opened Come Blow Your Horn on Broadway in 1961, Neil Simon has written at least a play a year, and they include Barefoot in the Park, The Odd Couple, Plaza Suite, Lost in Yonkers, as well as the hit musicals Sweet Charity and They're Playing Our Song.\n\nHe'll be telling Sue Lawley about his childhood in the Bronx, his days in the army, and how as one of New York's most famous literary sons, he now spends most of his time in Los Angeles.\n\n[Taken from the original programme material for this archive edition of Desert Island Discs] \n\nFavourite track: A Foggy Day by Fred Astaire\nBook: How To Swim\nLuxury: Large harmonica",
            "length": "35104000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02ppdwh.mp3"
        },
        {
            "title": "Dr George Carey",
            "datePublished": "Sun, 07 May 1995 10:15:00 +0000",
            "description": "The castaway in Desert Island Discs this week is the Archbishop of Canterbury, Dr George Carey. The son of a hospital porter, he'll be talking to Sue Lawley about his childhood in London during the war, his interrupted schooling which meant he left school at 15 with no qualifications and how when he decided he wanted to enter the church, he went on to acquire a clutch of 'O' and 'A' Levels in the space of a year.\n\nNever one to shirk a challenge, he'll also be describing his feelings when he was invited to become Archbishop of Canterbury and discussing some of the issues which face the church today.\n\n[Taken from the original programme material for this archive edition of Desert Island Discs] \n\nFavourite track: O Praise Ye The Lord (Laudate Dominum) by Hubert Parry\nBook: Four Quartets by T S Eliot\nLuxury: Computer and an empty bottle",
            "length": "34464000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02ppdwl.mp3"
        },
        {
            "title": "Pete Waterman",
            "datePublished": "Sun, 30 Apr 1995 10:15:00 +0000",
            "description": "The castaway in Desert Island Discs this week has a classic rags-to-riches story to relate. Born into a poor family in Coventry, record producer Pete Waterman is nowadays estimated to be worth at least 60 million pounds, and is the proud possessor of 10 Ferraris, 15 Jaguars and several houses and railway engines.\n\nHe'll be telling Sue Lawley how, with no formal education - and still unable to do joined-up writing - he and his company wrote and produced enough hit records in the mid-1980s to have one in the Top Forty every week for four years.\n\n[Taken from the original programme material for this archive edition of Desert Island Discs] \n\nFavourite track: Tannhauser Overture by Richard Wagner\nBook: R.C.T.S. History of Great Western Railway Engines\nLuxury: Havana cigars and matches",
            "length": "34624000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02ppdwr.mp3"
        },
        {
            "title": "George Lloyd",
            "datePublished": "Sun, 23 Apr 1995 10:15:00 +0000",
            "description": "The castaway choosing his eight desert island discs this week will also be relating a story of early triumph, 25 years of obscurity and a revival of fortunes at the age of 81 which has made him one of the country's most successful classical composers. He is George Lloyd, and he'll be talking to Sue Lawley about the shell-shock and bad luck which put paid to his early promise - his years growing carnations and mushrooms - and then, thanks to the late John Ogdon's intervention, his re-emergence to a rapturous reception by both the public and the musical establishment. \n\nHe'll also be describing the unexpected places where his music has been enjoying an airing - could it really be true that his symphonies are now to be heard in discos and pubs?\n\n[Taken from the original programme material for this archive edition of Desert Island Discs] \n\nFavourite track: Jesu Joy Of Man's Desiring by Johann Sebastian Bach\nBook: Piers Plowman (In Middle English) by William Langland\nLuxury: Romney's portrait of Lady Hamilton",
            "length": "36368000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02ppdwx.mp3"
        },
        {
            "title": "Hugh Grant",
            "datePublished": "Sun, 16 Apr 1995 10:15:00 +0000",
            "description": "The castaway in Desert Island Discs this week is the actor Hugh Grant. \n\nThe star of the enormously successful Four Weddings and a Funeral, he'll be talking to Sue Lawley about his life before he was propelled into international celebrity status. Now firmly established as a cinematic symbol of a certain type of Englishman, he had his first big break in the Merchant Ivory film Maurice, after stints in repertory at Nottingham, writing commercials and filming what he calls Europuddings in Spain, where he met his girlfriend Elizabeth Hurley.\n\n[Taken from the original programme material for this archive edition of Desert Island Discs] \n\nFavourite track: Something Stupid by Frank & Nancy Sinatra\nBook: King Ottokar's Sceptre (The Adventures of Tin Tin) by Herge\nLuxury: Supply of handkerchiefs",
            "length": "35072000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02ppdwz.mp3"
        },
        {
            "title": "James Bowman",
            "datePublished": "Sun, 09 Apr 1995 10:15:00 +0000",
            "description": "The castaway in Desert Island Discs this week is the country's most distinguished counter-tenor James Bowman. He'll be talking to Sue Lawley about how he uses his voice as an instrument, producing the unusually high falsetto sound which characterises counter-tenor parts. He'll also be describing his association with Benjamin Britten, who offered him his first part - as Oberon in Britten's opera A Midsummer Night's Dream. Britten went on to write parts for him in Death in Venice and The Journey of the Magi, all of which have contributed to his highly successful career.\n\n[Taken from the original programme material for this archive edition of Desert Island Discs] \n\nFavourite track: Symphony No 2 in D, Op 73 by Johannes Brahms\nBook: Rebecca by Dame Daphne Du Maurier\nLuxury: Fabergé egg",
            "length": "34896000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02ppdx3.mp3"
        },
        {
            "title": "Nina Bawden",
            "datePublished": "Sun, 02 Apr 1995 10:15:00 +0000",
            "description": "The castaway in Desert Island Discs this week is the novelist Nina Bawden. She'll be talking to Sue Lawley about the autobiographical aspects of both her adult books - such as Afternoon of a Good Woman and Circles of Deceit - and her children's books like Carrie's War and The Peppermint Pig. All contain tales with twists and turns from her own experience - evacuation during the war, her years as a magistrate and the tragic death of her schizophrenic son. She'll be talking to Sue Lawley about her life and books.\n\n[Taken from the original programme material for this archive edition of Desert Island Discs] \n\nRecord: Symphony No 9 In D Minor Final Movement\nBook: The Decline And Fall Of The Roman Empire by Edward Gibbon\nLuxury: Plain paper, plastic folders and ballpoint pens",
            "length": "39520000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02ppdx9.mp3"
        },
        {
            "title": "Felix Aprahamian",
            "datePublished": "Sun, 19 Mar 1995 11:15:00 +0000",
            "description": "The castaway in Desert Island Discs this week is the music writer and critic Felix Aprahamian. He'll be talking to Sue Lawley about how, as a music critic on the Sunday Times for over 40 years, he has lived at the epicentre of 20th-century musical life - meeting such luminaries as Poulenc, Messiaen, Delius and the French organist and composer, Charles-Marie Widor. He'll also be discussing his views on the contemporary music scene, and describing his house in North London where, now aged 80, he lives surrounded by musical artefacts, literature and scores that have accumulated over his long career.\n\n[Taken from the original programme material for this archive edition of Desert Island Discs] \n\nFavourite track: Christ Der Ein'ge Gottes Sohn by Johann Sebastian Bach\nBook: Du Cote De Chez Swann by Marcel Proust\nLuxury: Swiss army knife",
            "length": "36624000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02ppdxf.mp3"
        },
        {
            "title": "Nigel Nicolson",
            "datePublished": "Sun, 12 Mar 1995 11:15:00 +0000",
            "description": "The castaway in Desert Island Discs this week is the writer and publisher Nigel Nicolson. He'll be talking to Sue Lawley about his parents Harold Nicolson and Vita Sackville-West and their unconventional marriage which was based on deep mutual love but also allowed both of them to enjoy homosexual affairs. His book Portrait of a Marriage - famously televised by the BBC - tells their story. He'll also be describing his isolated upbringing at Sissinghurst Castle, his relationship with his mother and how he co-founded the publishing house Weidenfeld and Nicolson.\n\n[Taken from the original programme material for this archive edition of Desert Island Discs] \n\nFavourite track: Bolero by Maurice Ravel\nBook: A Guide To The Universe (Astronomy)\nLuxury: Telescope",
            "length": "35760000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02ppdxk.mp3"
        },
        {
            "title": "Professor Eric Hobsbawm",
            "datePublished": "Sun, 05 Mar 1995 11:15:00 +0000",
            "description": "The castaway in Desert Island Discs this week is the historian Professor Eric Hobsbawm. A life-long Communist and author of a series of books on the history of the 19th century which is regarded by many as a seminal work of scholarship, he has now turned his attention to the 20th century. He'll be talking to Sue Lawley about his views on the major historical events of the century, its future and his part in it.\n\n[Taken from the original programme material for this archive edition of Desert Island Discs] \n\nFavourite track: Slow Grind by The Kenny Barron Trio\nBook: Canto General by Pablo Neruda\nLuxury: Binoculars",
            "length": "36400000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02ppdxm.mp3"
        },
        {
            "title": "Christopher Lee",
            "datePublished": "Sun, 26 Feb 1995 11:15:00 +0000",
            "description": "The castaway in Desert Island Discs this week is British cinema's king of horror - Christopher Lee. He'll be talking to Sue Lawley about his disappointment at not being able to follow what he considers his true vocation, that of an opera singer, and about his 50-year career which has encompassed 230 films, 27 plays and numerous radio and television appearances.\n\n[Taken from the original programme material for this archive edition of Desert Island Discs] \n\nFavourite track: Rinaldo by George Frideric Handel\nBook: The Sword In The Stone by T H White\nLuxury: A set of golf clubs",
            "length": "36272000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02ppdxt.mp3"
        },
        {
            "title": "Jimmy Knapp",
            "datePublished": "Sun, 19 Feb 1995 11:15:00 +0000",
            "description": "The castaway in Desert Island Discs this week is Jimmy Knapp, General Secretary of the Rail, Maritime and Transport Union. He'll be talking to Sue Lawley about his Scottish childhood, his poor, working-class background and his rise from signalman to one of the most powerful and controversial trade union leaders in the country. He'll also be discussing his views on public ownership, the future of Clause 4 and such personal matters as his Scottishnesss, love of Spain and his much-maligned dress sense. \n\n[Taken from the original programme material for this archive edition of Desert Island Discs] \n\nFavourite track: Yesterday by The Beatles\nBook: The Socialist Sixth of the World by Hewlett Johnson\nLuxury: Case of 'Talisker' whisky",
            "length": "36640000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02ppdxw.mp3"
        },
        {
            "title": "Sir Adrian Cadbury",
            "datePublished": "Sun, 29 Jan 1995 11:15:00 +0000",
            "description": "The castaway in Desert Island Discs this week is Sir Adrian Cadbury, for nearly 20 years chairman of the famous chocolate factory that bears his family name.\n\nHe'll be talking to Sue Lawley about his Quaker background and his experiences of rowing for Britain in the 1952 Olympics, as well as discussing his views on the standards and values which dominate British business life today.\n\n[Taken from the original programme material for this archive edition of Desert Island Discs] \n\nFavourite track: Symphony no 1 No 1 in C Major, Opus 21 by Ludwig van Beethoven\nBook: Dr. Johnson's Lexicographic Works by Dr Samuel Johnson\nLuxury: Fibreglass sculling boat",
            "length": "37536000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02ppdy0.mp3"
        },
        {
            "title": "Dr Richard Dawkins",
            "datePublished": "Sun, 22 Jan 1995 11:15:00 +0000",
            "description": "The castaway in Desert Island Discs this week is the biologist Dr Richard Dawkins. Author of popular science books such as The Selfish Gene and The Blind Watchmaker, he'll be talking to Sue Lawley about his scientific beliefs which are firmly rooted in the conviction that Darwin's theory of evolution provides the starting point for all we need to know about our world. He'll be discussing the implications of his theories, as well as choosing eight records for his island exile. \n\n[Taken from the original programme material for this archive edition of Desert Island Discs] \n\nFavourite track: String Quintet In C Major 163 by Franz Schubert\nBook: The Jeeves Omnibus by P G Wodehouse\nLuxury: Computer (solar-powered)",
            "length": "35424000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02ppdy5.mp3"
        },
        {
            "title": "Phil Redmond",
            "datePublished": "Sun, 15 Jan 1995 11:15:00 +0000",
            "description": "The castaway in Desert Island Discs this week is the creator, writer and producer of two of British television's most enduring and influential series - Grange Hill and Brookside.\n\nPhil Redmond will be talking to Sue Lawley about his Liverpool roots and his rise from a poor working-class background to become one of the country's highest-paid television executives. He'll also be discussing how the programmes he produces continue to attract controversy, criticism and audiences and what he thinks of the future for radio and television. \n\n[Taken from the original programme material for this archive edition of Desert Island Discs] \n\nFavourite track: Theme From Brookside by Steve Wright & Mike Timoney\nBook: (Instead of Shakespeare) Collected works by Charles Dickens\nAlternative to Bible: None - Bible not taken\nLuxury: Magnifying glass",
            "length": "33312000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02ppdy7.mp3"
        },
        {
            "title": "Patricia Hodge",
            "datePublished": "Sun, 08 Jan 1995 11:15:00 +0000",
            "description": "The castaway in Desert Island Discs this week is the actress Patricia Hodge. Currently in her prime as Miss Jean Brodie in the West End, she'll be talking to Sue Lawley about how John Mortimer selected her for her first prominent role as barrister Phyllida Trent in Rumpole of the Bailey. She went on to portray several aloof, beautiful women, but denies that she is by nature remote. She'll also be reminiscing about her childhood in Grimsby, where her parents ran a large three-star hotel, making her upbringing a little different from that of her contemporaries.\n\n[Taken from the original programme material for this archive edition of Desert Island Discs] \n\nFavourite track: Candide Make Our Garden Grow by David Eisler & Erie Mills\nBook: Compendium of Plays by Harold Pinter\nLuxury: A supply of embroidery",
            "length": "35344000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02ppdyh.mp3"
        },
        {
            "title": "Alan Clark",
            "datePublished": "Sun, 01 Jan 1995 11:15:00 +0000",
            "description": "The castaway in Desert Island Discs this week is the politician, historian and diarist Alan Clark. He'll be talking to Sue Lawley about the impact his alarmingly frank diaries - published in 1993 - made on his colleagues, friends and enemies. Also, on the island he'll be ruminating on love, pain, parents, political ambition and the many attractions of his island exile.\n\n[Taken from the original programme material for this archive edition of Desert Island Discs] \n\nFavourite track: Saul The Dead March by George Frideric Handel\nBook: A History of Western Philosophy by Bertrand Russell\nLuxury: Piano",
            "length": "36304000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02ppdyk.mp3"
        },
        {
            "title": "David Jason OBE",
            "datePublished": "Sun, 25 Dec 1994 11:15:00 +0000",
            "description": "The castaway on Desert Island Discs this week is one of Britain's best-loved actors, David Jason. He will be talking to Sue Lawley about the rocky route from his first job as an electrician, through Bromley Rep, summer seasons and pantos, to the moment he was spotted for a television show called Do Not Adjust Your Set. Some success followed this, but it was when the BBC offered him the part of Delboy in Only Fools and Horses, to be followed 10 years later by the avuncular Pop Larkin in The Darling Buds of May, that the nation took him to their hearts. He went on to win a BAFTA for his role in Porterhouse Blue, and, more recently, acclaim for his portrait of Inspector Frost.\n\n[Taken from the original programme material for this archive edition of Desert Island Discs] \n\nFavourite track: Help! by The Beatles\nBook: The Complete Boatbuilder's Book\nLuxury: A complete carpenter's toolbox",
            "length": "32224000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02ppdym.mp3"
        },
        {
            "title": "Penelope Hobhouse",
            "datePublished": "Sun, 18 Dec 1994 11:15:00 +0000",
            "description": "The castaway in Desert Island Discs this week is one of the country's famous experts on gardens and garden design, Penelope Hobhouse. She will be talking to Sue Lawley about her childhood in Ulster, where she was brought up steeped in the politics of the province. From there, she went to Cambridge, married, and settled down to look after the garden of the beautiful house in Somerset which marriage had brought with it. Twenty-five years later, she wrote her first book which was about that garden and since then she has been in constant demand as a lecturer and author. \n\n[Taken from the original programme material for this archive edition of Desert Island Discs] \n\nFavourite track: The Marriage Of Figaro - Dove Sono, Act 3 by Wolfgang Amadeus Mozart\nBook: The Golden Bowl by Henry James\nLuxury: Laptop computer",
            "length": "34960000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02ppdyr.mp3"
        },
        {
            "title": "Margaret Forster",
            "datePublished": "Sun, 04 Dec 1994 11:15:00 +0000",
            "description": "The castaway in Desert Island Discs this week is the writer Margaret Forster. Her second novel - Georgy Girl - was published in the 1960s and made into a popular film; another 20 books - both fiction and non-fiction - followed and her recent biography of Daphne du Maurier attracted much critical acclaim. She'll be talking to Sue Lawley about her early life in Carlisle, the stresses of working motherhood and the problems of having her husband, Hunter Davies, formerly confined to a newspaper office, now working at home.\n\n[Taken from the original programme material for this archive edition of Desert Island Discs] \n\nFavourite track: In The Bleak Midwinter by Gustav Holst/Rossetti\nBook: A House For Mr Biswas by V S Naipaul\nLuxury: Unlimited supply of A4 white paper & cartridges for fountain pen",
            "length": "35264000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02ppdyv.mp3"
        },
        {
            "title": "Sir Howard Hodgkin",
            "datePublished": "Sun, 27 Nov 1994 11:15:00 +0000",
            "description": "The castaway in Desert Island Discs this week is the painter Sir Howard Hodgkin. He'll be talking to Sue Lawley about the hard road to recognition in this country - which he describes as being 'enemy territory' for painters. At 62, he has now achieved fame, fortune and to him a somewhat irksome knighthood. He'll be describing his problematic schoolboy years, his total commitment to art and what he considers to be the impact of his own work.\n\n[Taken from the original programme material for this archive edition of Desert Island Discs] \n\nFavourite track: Youkali by Teresa Stratas\nBook: Journal De Eugene Delacroix by Eugene Delacroix\nLuxury: Mayonnaise - permanent supply",
            "length": "35952000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02ppdyx.mp3"
        },
        {
            "title": "Glenys Kinnock",
            "datePublished": "Sun, 20 Nov 1994 11:15:00 +0000",
            "description": "The castaway in Desert Island Discs this week is Glenys Kinnock. She'll be talking to Sue Lawley about her upbringing in Wales, her role during the years of Neil Kinnock's leadership of the Labour Party and her own reincarnation as a politician on the European stage as an MEP.\n\n[Taken from the original programme material for this archive edition of Desert Island Discs] \n\nFavourite track: Was A Sunny Day by Paul Simon\nBook: Atlas of the Third World\nLuxury: Toilet bag full of skin-barrier creams",
            "length": "33696000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02ppdyz.mp3"
        },
        {
            "title": "Berthold Goldschmidt",
            "datePublished": "Sun, 13 Nov 1994 11:15:00 +0000",
            "description": "The castaway in Desert Island Discs this week is the composer and conductor Berthold Goldschmidt. Born in Hamburg 91 years ago, he enjoyed a brilliant early career working with many famous musicians in Germany and Russia. But he'll be telling Sue Lawley how, as a Jew, he was forced to flee the Nazis and take refuge in Britain. Sadly, the musical establishment of his adopted homeland found his music old-fashioned and neglected him until the 1980s, when his music started to be rediscovered and widely appreciated.\n\nNow experiencing a highly-successful revival all over Europe and America, as well as having his work recorded and performed at the Proms, he is greatly enjoying his new-found recognition.\n\n[Taken from the original programme material for this archive edition of Desert Island Discs] \n\nFavourite track: Goldberg Varations BWV 988 - No 26 by Johann Sebastian Bach\nBook: Joseph and His Brothers by Thomas Mann\nLuxury: Vanity case including metal mirror and shaving kit",
            "length": "37152000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02ppdz3.mp3"
        },
        {
            "title": "Archbishop Desmond Tutu",
            "datePublished": "Sun, 06 Nov 1994 11:15:00 +0000",
            "description": "The castaway in Desert Island Discs this week is the Anglican Archbishop of Cape Town, the Most Reverend Desmond Tutu. He'll be talking to Sue Lawley about his childhood and his first realisations that black children were treated very differently from their white counterparts, as well as his initial work as a teacher, which he gave up when he realised he was expected merely to train his black pupils for a life of service. He'll also be talking about the new freedom and responsibilities of South Africa following the election of Nelson Mandela earlier this year, and describing his optimism for its success. \n\n[Taken from the original programme material for this archive edition of Desert Island Discs] \n\nFavourite track: We Are The World by U.S.A. For Africa\nBook: Parting The Waters by Branch Taylor\nLuxury: Ice-cream maker (especially for rum and raisin flavour)",
            "length": "36128000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02ppdz7.mp3"
        },
        {
            "title": "Kathleen Hale",
            "datePublished": "Sun, 30 Oct 1994 11:15:00 +0000",
            "description": "The castaway this week in Desert Island Discs is the writer and illustrator Kathleen Hale. Mainly renowned for that hero of children's literature - Orlando, the Marmalade Cat - and now 96 years old, she'll be talking to Sue Lawley about the excitement and glamour of her bohemian girlhood after the First World War. As secretary to the painter Augustus John, she lived a turbulent but fascinating life at the heart of artistic London.\n\nMarriage and motherhood introduced stability into her life, but boredom with the children's books then on offer led her to create Orlando - the cat who went on to star in 18 beautifully-illustrated and charmingly-written books - considered by many to be the epitome of good children's literature.\n\n[Taken from the original programme material for this archive edition of Desert Island Discs] \n\nFavourite track: La Sardana De Les Monges by La Principal De Perelada\nBook: A La Recherche Du Temps Perdu by Marcel Proust\nLuxury: A gilabra (cloak of gold)",
            "length": "36560000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02ppdzc.mp3"
        },
        {
            "title": "Lynda La Plante",
            "datePublished": "Sun, 23 Oct 1994 11:15:00 +0000",
            "description": "The castaway in Desert Island Discs this week is Lynda La Plante - the creator of much-admired television series like Prime Suspect, Widows and Civvies. \n\nAlso the author of five novels, she'll be talking to Sue Lawley about how she made the transition from acting in repertory for six years, as well as Brian Rix's Whitehall farces, to becoming one of television's most prolific and successful writers.\n\n[Taken from the original programme material for this archive edition of Desert Island Discs] \n\nFavourite track: Nessun Dorma from Turandot by Giacomo Puccini\nBook: Fairy Stories by Honore de Balzac\nLuxury: Mouth organ",
            "length": "35360000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02ppdzn.mp3"
        },
        {
            "title": "Sir George Christie",
            "datePublished": "Sun, 16 Oct 1994 10:15:00 +0000",
            "description": "The castaway in Desert Island Discs this week is the Chairman of Glyndebourne, Sir George Christie. As Master of one of Europe's most distinguished opera houses, famous as a mainstay of the English social scene, as well as a centre of creativity and innovation, he has recently overseen its complete rebuilding. He'll be talking to Sue Lawley about the place in which he has spent his whole life and how he faces the prospect of retirement.\n\n[Taken from the original programme material for this archive edition of Desert Island Discs] \n\nFavourite track: Idomeneo: Zeffiretti Lushinghieri by Wolfgang Amadeus Mozart\nBook: Origin of Species by Charles Darwin\nLuxury: Radio 4's The Archers - all the recordings from the beginning",
            "length": "32848000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02ppdzq.mp3"
        },
        {
            "title": "Jeanette Winterson",
            "datePublished": "Sun, 09 Oct 1994 10:15:00 +0000",
            "description": "The castaway in Desert Island Discs this week is the writer Jeanette Winterson. Her first book Oranges Are Not the Only Fruit was based on her Lancashire childhood where she grew up as the adopted daughter of evangelical parents. She'll be talking to Sue Lawley about her upbringing - in which her parents saw her as a child they could dedicate to God, about how she left home at 15 after falling in love with another woman and about how she finally managed to get herself into Oxford.\n\nHer first book won the Whitbread Prize and has been followed by more books and more prizes, all of which have attracted criticism and acclaim in equal measures.\n\n[Taken from the original programme material for this archive edition of Desert Island Discs] \n\nFavourite track: Di, Cor Mio from Act 1 of Alcina by George Frideric Handel\nBook: Four Quartets by T S Eliot\nLuxury: A case of Krug champagne",
            "length": "35056000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02ppdzz.mp3"
        },
        {
            "title": "Professor James Fenton",
            "datePublished": "Sun, 02 Oct 1994 10:15:00 +0000",
            "description": "The castaway in Desert Island Discs this week is the poet and writer James Fenton. He'll be talking to Sue Lawley about his early life as a boy chorister, the death of his mother when he was just 10 and about his experiences as a foreign correspondent. It was in this capacity that he travelled with the Viet Cong when they captured Saigon, and fled from the Khmer Rouge when they entered Phnom Penh. \n\nHe has also worked as a political and literary journalist and as a theatre critic. He'll be ruminating on the joys of his present incarnation as Professor of Poetry at Oxford University.\n\n[Taken from the original programme material for this archive edition of Desert Island Discs] \n\nFavourite track: Requiem Dies Irae by Giuseppe Verdi\nBook: Divine Comedy by Dante Alighieri\nLuxury: Snorkel, mask and harpoon",
            "length": "36304000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02ppf03.mp3"
        },
        {
            "title": "Mary Stott",
            "datePublished": "Sun, 25 Sep 1994 10:15:00 +0000",
            "description": "The castaway in Desert Island Discs this week is a journalist and feminist. Mary Stott became Women's Editor of the Guardian newspaper in 1957 and under her editorship, the women's pages were transformed. Her commissioning of many distinguished writers as well as her encouragement to her readers themselves to write first-hand accounts of their experiences led to the foundation of many important women's organisations. Now 87, she'll be talking to Sue Lawley about her enduring support of feminist issues, her memories of the suffragette movement and her love of singing.\n\n[Taken from the original programme material for this archive edition of Desert Island Discs] \n\nFavourite track: St John's Passion Rest Calm, Oh Body Pure And Holy by Johann Sebastian Bach\nBook: The Act of Creation by Arthur Koestler\nLuxury: Watercolours for painting",
            "length": "36320000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02ppf0b.mp3"
        },
        {
            "title": "John Tavener",
            "datePublished": "Sun, 18 Sep 1994 10:15:00 +0000",
            "description": "The castaway in Desert Island Discs this week is the composer John Tavener. He'll be talking to Sue Lawley about the varied inspirations for his music and about how he regards the work of composition as an act of prayer. His music has won the admiration of both serious musicians and the general public - last year his work for cello and strings, The Protecting Veil, held the number one place in the classical charts for several months. Now nearly 50, his was a precocious talent - one of his earliest works was recorded successfully when he was only 24, thanks to the support of the Beatles.\n\n[Taken from the original programme material for this archive edition of Desert Island Discs] \n\nFavourite track: Akathist of Thanksgiving by John Tavener\nBook: Apophthegmata Patrum (early writing of Egyptian fathers)\nLuxury: Upright piano",
            "length": "36784000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02ppf0d.mp3"
        },
        {
            "title": "Joanna Trollope",
            "datePublished": "Sun, 11 Sep 1994 10:15:00 +0000",
            "description": "The castaway in Desert Island Discs this week is the novelist Joanna Trollope. She'll be talking to Sue Lawley about how she made the move from writing historical romances to contemporary novels like The Rector's Wife, A Village Affair and A Spanish Lover, which have turned her into one of the country's most successful writers. She'll also be describing how she dislikes her books being described as 'aga-sagas' and discussing how much the events of her characters' lives mirror her own experiences.\n\n[Taken from the original programme material for this archive edition of Desert Island Discs] \n\nFavourite track: Mass In C Minor - Laudamus Te by Wolfgang Amadeus Mozart\nBook: The Oxford Book of English Verse by Helen Gardiner\nLuxury: A bed and white Egyptian sheets",
            "length": "34944000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02ppf0g.mp3"
        },
        {
            "title": "Rabbi Hugo Gryn",
            "datePublished": "Sun, 10 Jul 1994 10:15:00 +0000",
            "description": "The castaway in Desert Island Discs this week is Rabbi Hugo Gryn. He'll be talking to Sue Lawley about how his happy and secure childhood in Czechoslovakia was devastated by Nazism and how he survived two years in concentration camps. He'll also be discussing how his commitment to bettering relations between people of differing faiths is rooted in his experience of persecution during the Second World War.\n\n[Taken from the original programme material for this archive edition of Desert Island Discs] \n\nFavourite track: Kol Haoalm Kulo Gesher Tzar M' Od by Israel Zohar\nBook: Biography of Churchill by Martin Gilbert\nLuxury: A parking space",
            "length": "35616000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02ppf0k.mp3"
        },
        {
            "title": "Derek Jameson",
            "datePublished": "Sun, 03 Jul 1994 10:15:00 +0000",
            "description": "The castaway in Desert Island Discs this week is the journalist and broadcaster Derek Jameson. He'll be talking to Sue Lawley about his early poverty-stricken years in an East End foster home and his discovery, at the age of eight, that one of the girls in the home he had thought of as his older sister was, in fact, his mother. He'll also be describing how an aptitude for reading and writing, the encouragement of a concerned teacher and his own determination led him into journalism, where he started his career as an outdoor messenger at Reuters. From there, he went on to edit three Fleet Street newspapers and more recently, to become a popular radio personality.\n\n[Taken from the original programme material for this archive edition of Desert Island Discs] \n\nFavourite track: Tosca Aria - E Lucevan Le Stelle by Giacomo Puccini\nBook: The Grapes of Wrath by John Steinbeck\nLuxury: Word processor",
            "length": "34768000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02ppf0n.mp3"
        },
        {
            "title": "John Drummond",
            "datePublished": "Sun, 26 Jun 1994 10:15:00 +0000",
            "description": "The castaway in Desert Island Discs this week is the Director of the Promenade Concerts John Drummond. He'll be talking to Sue Lawley about his years at the BBC, starting as a general trainee, leaving it to become Director of the Edinburgh Festival and returning as Controller of Music and then Controller of Radio Three. He'll be discussing his passionate attachment to fine music and musicianship and his conviction that such music should not just be heard, but must be properly listened to.\n\n[Taken from the original programme material for this archive edition of Desert Island Discs] \n\nFavourite track: Soave Sia Il Vento from Cosi fan Tutte by Wolfgang Amadeus Mozart\nBook: Encyclopaedia of the libretti of all the well-known operas\nLuxury: Small theatre",
            "length": "37104000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02ppf0q.mp3"
        },
        {
            "title": "Brian Sewell",
            "datePublished": "Sun, 19 Jun 1994 10:15:00 +0000",
            "description": "The castaway in Desert Island Discs this week is the controversial art critic Brian Sewell. He'll be talking to Sue Lawley about how he did not go to school until he was 11, hated it when he got there, but managed, much against the wishes of the school, to teach himself history of art. He'll also be describing how he felt when his friend and mentor, Sir Anthony Blunt, the Keeper of the Queen's Pictures, was denounced as a spy in 1979. Sewell was thrust into the public eye as Blunt's protector. He's been there ever since - attacking what he regards as the excesses of contemporary art, and attracting much criticism himself as a result of his attitudes.\n\n[Taken from the original programme material for this archive edition of Desert Island Discs] \n\nFavourite track: Fidelio Aria - 'Komm Hoffnung' by Ludwig van Beethoven\nBook: Songs from the 1880s with piano accompaniment by Franz Schubert\nLuxury: Pieta sculpture by Michelangelo",
            "length": "35440000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02ppf0w.mp3"
        },
        {
            "title": "Zoe Wanamaker",
            "datePublished": "Sun, 12 Jun 1994 10:15:00 +0000",
            "description": "The castaway in Desert Island Discs this week is the actress Zoe Wanamaker. She'll be talking to Sue Lawley about the roles she has taken on in theatre and television - in Love Hurts, Prime Suspect and, more recently, in the West End hit Dead Funny. She'll also be describing how she has tried to cope with the death of her father - the distinguished actor Sam Wanamaker - at the end of last year.\n\n[Taken from the original programme material for this archive edition of Desert Island Discs] \n\nFavourite track: Requiem Offertorio by Giuseppe Verdi\nBook: Greek Myths by Robert Graves\nLuxury: Samson tobacco and liquorice Rizla papers",
            "length": "32368000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02ppf10.mp3"
        },
        {
            "title": "Milton Shulman",
            "datePublished": "Sun, 05 Jun 1994 10:15:00 +0000",
            "description": "The castaway in Desert Island Discs this week is Milton Shulman. He'll be talking to Sue Lawley about how he came to Britain from Toronto as an Intelligence Officer during the Second World War, after which he wrote a book called Defeat in the West, which was based on interviews he conducted with defeated German officers. It was this book which brought him to the attention of Lord Beaverbrook, leading to his promotion from humble diarist on the London Evening Standard to its film critic. He then went on to become the paper's chief theatre critic - a job he did for 38 years, during which time he reckons to have been to 5,500 first nights, but, to his mind, no great plays.\n\n[Taken from the original programme material for this archive edition of Desert Island Discs] \n\nFavourite track: Capriccio Italien by Pyotr Ilyich Tchaikovsky\nBook: The Cookery Book by Constance Spry\nLuxury: Tennis racket and ball machine",
            "length": "36384000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02ppf12.mp3"
        },
        {
            "title": "Peter Scudamore",
            "datePublished": "Sun, 29 May 1994 10:15:00 +0000",
            "description": "The castaway in Desert Island Discs this week is the jockey Peter Scudamore. The son of a jockey who had won the Grand National and the Cheltenham Gold Cup - Scu, as he is known throughout the racing fraternity - resisted all attempts to turn him into an estate agent, and followed in his father's footsteps. Having broken nearly every bone in his body, he retired in 1993 after a career which encompassed 1,678 National Hunt victories and the title of Champion Jockey a record eight times. He'll be talking to Sue Lawley about jockeys, jumping and his new career, journalism.\n\n[Taken from the original programme material for this archive edition of Desert Island Discs] \n\nFavourite track: Laid by James\nBook: Book of Verse by Rudyard Kipling\nLuxury: Snorkeling equipment",
            "length": "32544000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02ppf14.mp3"
        },
        {
            "title": "Britt Ekland",
            "datePublished": "Sun, 22 May 1994 10:15:00 +0000",
            "description": "The castaway in Desert Island Discs this week is the actress Britt Ekland. She'll be talking to Sue Lawley about her miraculous transformation from an overweight, buck-toothed ugly duckling with large ears to a beautiful peroxided teenager. She'll also be describing her turbulent marriage to Peter Sellers and her passionate affair with the rock star Rod Stewart.\n\n[Taken from the original programme material for this archive edition of Desert Island Discs] \n\nFavourite track: Mother by John Lennon & Plastic Ono Band\nBook: Recent editions of magazines, e.g. Vanity Fair; Vogue\nLuxury: Case of Evian water filled with champagne",
            "length": "33488000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02ppf17.mp3"
        },
        {
            "title": "Kate Adie",
            "datePublished": "Sun, 15 May 1994 10:15:00 +0000",
            "description": "The castaway in Desert Island Discs this week is the BBC's Chief News Correspondent Kate Adie. She'll be talking to Sue Lawley about the pleasures and perils of a job which has taken her to some of the world's most dangerous trouble spots. She'll also be describing how she felt when she was recently reunited with her natural mother after having been happily brought up by her adoptive family in Sunderland.\n\n[Taken from the original programme material for this archive edition of Desert Island Discs] \n\nFavourite track: Symphony No 6 In E Minor by Ralph Vaughan Williams\nBook: Canterbury Tales by Geoffrey Chaucer\nLuxury: Large Victorian bath with claw feet",
            "length": "36320000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02ppf1c.mp3"
        },
        {
            "title": "Sir John Wilson",
            "datePublished": "Sun, 08 May 1994 10:15:00 +0000",
            "description": "The castaway in Desert Island Discs this week is a man who has devoted his life to helping those who share his own disability - blindness. Sir John Wilson lost his sight at the age of 12 in an accident in his school chemistry laboratory. He'll be talking to Sue Lawley about how, undaunted, he went on to win a scholarship to Oxford, and then, at the age of 30, mortgaged his home and set up the Royal Commonwealth Society for the Blind. Since then, he has travelled an average of 50,000 miles a year, helping to restore or save the sight of millions of people the world over. Last year he was awarded the Albert Schweizer International Award for Medicine. \n\n[Taken from the original programme material for this archive edition of Desert Island Discs] \n\nFavourite track: Mass in B Minor: The Sanctus by Johann Sebastian Bach\nBook: A chess strategy book (in braille)\nLuxury: A sonic probe",
            "length": "36400000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02ppf1g.mp3"
        },
        {
            "title": "Garrison Keillor",
            "datePublished": "Sun, 01 May 1994 10:15:00 +0000",
            "description": "The castaway in Desert Island Discs this week is the American writer and broadcaster Garrison Keillor. He'll be talking to Sue Lawley about his childhood in the small town of Anoka in Minnesota, on which his stories in his bestseller, Lake Wobegon Days, were based. One of six children of Protestant fundamentalist parents, he'll be remembering his home life where story-telling was an intrinsic element, and in which alcohol, television, parties and socialising were all forbidden.\n\n[Taken from the original programme material for this archive edition of Desert Island Discs] \n\nFavourite track: Abide With Me Fast Falls The Evertide by Huddersfield Choral Society\nBook: Thesaurus by Roget\nLuxury: Set of china (four place settings)",
            "length": "36416000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02ppf1l.mp3"
        },
        {
            "title": "Trevor McDonald",
            "datePublished": "Sun, 24 Apr 1994 10:15:00 +0000",
            "description": "The castaway in Desert Island Discs this week has recently topped the polls as the country's most popular newscaster. He is ITN's Trevor McDonald, and he'll be talking to Sue Lawley about a West Indian childhood which was dominated by English influences, a career which started in Caribbean local radio and television and how he copes with his emotions when having to report on particularly gruelling news stories.\n\n[Taken from the original programme material for this archive edition of Desert Island Discs] \n\nFavourite track: Violin Concerto in D Opus 61 by Ludwig van Beethoven\nBook: Anthology of Poetry\nLuxury: Box of paints, brushes, paper",
            "length": "34240000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02ppf1n.mp3"
        },
        {
            "title": "Alan Hacker",
            "datePublished": "Sun, 17 Apr 1994 10:15:00 +0000",
            "description": "The castaway in Desert Island Discs this week is a musician who started his professional career as a clarinettist with the London Philharmonic Orchestra. \n\nHowever, when he was 26, Alan Hacker was permanently disabled by a thrombosis on his spinal column. He'll be talking to Sue Lawley about how, since then, although confined to a wheelchair, he has been determined to prove his disability is not a handicap but just a nuisance. He'll be describing how he has carved out a niche for himself as a conductor, teacher and pioneer in the study of early music and is now a leading guest conductor of the Stuttgart Opera. \n\n[Taken from the original programme material for this archive edition of Desert Island Discs] \n\nFavourite track: London Symphony by Franz Joseph Haydn\nBook: Middlemarch by George Eliot\nLuxury: Hovercraft wheelchair with capuccino machine",
            "length": "36304000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02ppf1t.mp3"
        },
        {
            "title": "Roger McGough",
            "datePublished": "Sun, 10 Apr 1994 10:15:00 +0000",
            "description": "The castaway in Desert Island Discs this week is the poet Roger McGough. He'll be talking to Sue Lawley about his boyhood in Liverpool where he showed little aptitude for literature - it wasn't until he went to Hull University that he discovered his true vocation. It was one that was to take him, via a best-selling number one record, Lily the Pink, with the group The Scaffold, to become one of the country's most enduringly successful poets.\n\n[Taken from the original programme material for this archive edition of Desert Island Discs] \n\nFavourite track: Foghorns On The Mersey\nBook: Times Atlas of the Night Sky\nLuxury: Black cab",
            "length": "34512000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02ppf1y.mp3"
        },
        {
            "title": "Sir Ranulph Fiennes",
            "datePublished": "Sun, 03 Apr 1994 10:15:00 +0000",
            "description": "The castaway in Desert Island Discs this week is the explorer Sir Ranulph Fiennes. Over the last 23 years, he has navigated the White Nile in a hovercraft, travelled around the world through both poles, discovered a lost city and, most recently, he nearly perished in Antarctica. He'll be talking to Sue Lawley about his unhappy schooldays at Eton, his thwarted ambition to emulate his father's military career and the problems he has had with his companions on expeditions. \n\n[Taken from the original programme material for this archive edition of Desert Island Discs] \n\nFavourite track: Love Changes Everything by Michael Ball\nBook: Gormenghast by Mervyn Peake\nLuxury: Antisan for insect bites",
            "length": "34528000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02ppf21.mp3"
        },
        {
            "title": "Conrad Black",
            "datePublished": "Sun, 27 Mar 1994 10:15:00 +0000",
            "description": "The castaway in Desert Island Discs this week owns the Daily Telegraph and The Spectator - amongst two or three hundred other newspapers and magazines the world over. He is Canadian-born tycoon Conrad Black, and he'll be talking to Sue Lawley about the notorious misbehaviour of his school days, the tuition his father gave him in the ways of corporate finance and how he views his powerful position in the British establishment.\n\n[Taken from the original programme material for this archive edition of Desert Island Discs] \n\nFavourite track: Emperor Concerto in E Flat Major Opus 73 by Ludwig van Beethoven\nBook: The Oxford Book of Verse, especially 'Apologia' (Newman)\nLuxury: Model of HMS Hood",
            "length": "35792000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02ppf24.mp3"
        },
        {
            "title": "Christina Dodwell",
            "datePublished": "Sun, 06 Mar 1994 11:15:00 +0000",
            "description": "The castaway in Desert Island Discs is the explorer Christina Dodwell. Born in West Africa, she spent her early years running wild in the Bush. When her family returned to Camberley and the restriction of English boarding schools, Christina reacted by being expelled from a large number of them. She later ran away from the restrictions of London life in search of adventure on the African subcontinent, and she'll be talking to Sue Lawley about her subsequent travels, the exhilaration of the lone voyager, the joy and the fear.\n\n[Taken from the original programme material for this archive edition of Desert Island Discs] \n\nFavourite track: One Of These Days by Pink Floyd\nBook: The Prophet by Kahlil Gibran\nLuxury: Pen and paper",
            "length": "32688000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02ppf28.mp3"
        },
        {
            "title": "Frances Partridge",
            "datePublished": "Sun, 27 Feb 1994 11:15:00 +0000",
            "description": "The castaway in Desert Island Discs this week is as old as this century and is said to be the last survivor of the much written-about Bloomsbury set. She is Frances Partridge and she'll be talking to Sue Lawley about her colourful life, unconventional beliefs and friendships with such influential writers and philosophers of her time as Bertrand Russell, Wittgenstein, EM Forster, Lytton Strachey and Maynard Keynes. \n\n[Taken from the original programme material for this archive edition of Desert Island Discs] \n\nFavourite track: Sinfonia Concertante In E Flat For Volin & Viola by Wolfgang Amadeus Mozart\nBook: Memoirs by Duc de Saint-Simon\nLuxury: Flower press",
            "length": "35568000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02ppf2b.mp3"
        },
        {
            "title": "Rt Hon Kenneth Clarke MP",
            "datePublished": "Sun, 20 Feb 1994 11:15:00 +0000",
            "description": "The castaway in Desert Island Discs this week is the Chancellor of the Exchequer Kenneth Clarke. He'll be talking to Sue Lawley about his reputation as something of a bruiser, his childhood as the son of a Northamptonshire miner and about his aspirations to the top job in politics - a job which would crown a career which has encompassed six senior Cabinet posts in under 10 years.\n\n[Taken from the original programme material for this archive edition of Desert Island Discs] \n\nFavourite track: Night In Tunisia by Charlie Parker\nBook: The Life of Lord Melbourne by Lord David Cecil\nLuxury: Tenor sax",
            "length": "37472000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02ppf2f.mp3"
        },
        {
            "title": "Rosemary Verey",
            "datePublished": "Sun, 13 Feb 1994 11:15:00 +0000",
            "description": "The castaway in Desert Island Discs this week is the gardener Rosemary Verey. Passionate about planting and growing flowers and herbs as a child in the 1930s, it wasn't until the 1950s, with her four children away at school, that she began a serious study of horticulture. Completely self-taught, she has gone on to develop a career designing some of Britain's most beautiful gardens and numbers Prince Charles and Elton John amongst her clients.\n\n[Taken from the original programme material for this archive edition of Desert Island Discs] \n\nFavourite track: Papillons by Robert Schumann\nBook: A Celebration of Gardens by Sir Roy Strong\nLuxury: Waterproof pens, paper and folders",
            "length": "33952000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02ppf2j.mp3"
        },
        {
            "title": "Douglas Adams",
            "datePublished": "Sun, 06 Feb 1994 11:15:00 +0000",
            "description": "The castaway in Desert Island Discs this week is Douglas Adams, creator of the anarchic world conjured up by The Hitchhiker's Guide to the Galaxy. He'll be talking to Sue Lawley about how, as a child, he found it difficult to communicate with the adult world, and didn't speak until he was four years old. But as his confidence grew, he set his sights on being a nuclear physicist - an ambition later replaced by a burning desire to be John Cleese in Monty Python's Flying Circus. In fact, he has become a hugely-successful author, a passionate amateur naturalist and a rock star manque.\n\n[Taken from the original programme material for this archive edition of Desert Island Discs] \n\nBook: Omnibus of Golfing Stories by P G Wodehouse\nLuxury: Martin D28 left-handed guitar",
            "length": "34528000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02ppf2m.mp3"
        },
        {
            "title": "Dame Cicely Saunders",
            "datePublished": "Sun, 30 Jan 1994 11:15:00 +0000",
            "description": "The castaway in Desert Island Discs this week is the founder of the Hospice Movement Dame Cicely Saunders. She'll be talking to Sue Lawley about her schooldays at Roedean, how she trained as a nurse and much later, as a doctor. When she was 29 she fell in love with a young patient dying of cancer, who bequeathed her a legacy of £500. Starting with that bequest, she raised enough money for a new kind of hospice dedicated to care for the dying. There are now 190 similar hospices throughout the country.\n\n[Taken from the original programme material for this archive edition of Desert Island Discs] \n\nFavourite track: Symphony No 7 in A Major by Ludwig van Beethoven\nBook: The Oxford Dictionary of Quotations\nLuxury: Pen and paper",
            "length": "36496000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02ppf2s.mp3"
        },
        {
            "title": "Willy Russell",
            "datePublished": "Sun, 23 Jan 1994 11:15:00 +0000",
            "description": "The castaway in Desert Island Discs this week is the playwright Willy Russell. He'll be talking to Sue Lawley about the route his career has taken - from hairdressing, via teaching in Toxteth to a living as one of the country's most successful dramatists. He'll also be talking about his play about the Beatles, John, Paul, George, Ringo & Bert, which, 20 years ago, transferred to the West End and became a huge hit and how, since then, Educating Rita, Shirley Valentine and Blood Brothers have all brought him success and acclaim.\n\n[Taken from the original programme material for this archive edition of Desert Island Discs] \n\nFavourite track: I Get Along Without You Very Well by Hoagy Carmichael\nBook: A Latin Primer\nLuxury: English meadow with an oak tree",
            "length": "34848000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02ppf2x.mp3"
        },
        {
            "title": "Sir Harrison Birtwistle",
            "datePublished": "Sun, 16 Jan 1994 11:15:00 +0000",
            "description": "The castaway in Desert Island Discs this week is the internationally-acclaimed composer Sir Harrison Birtwistle. He'll be talking to Sue Lawley about his childhood in Lancashire, the solitude he craves when he writes his music and how he copes with the difficulties audiences encounter with some of his compositions. \n\n[Taken from the original programme material for this archive edition of Desert Island Discs] \n\nFavourite track: Sherry by Frankie Valli\nBook: A Latin Primer\nLuxury: Chainsaw",
            "length": "35776000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02ppf34.mp3"
        },
        {
            "title": "Ian Hislop",
            "datePublished": "Sun, 09 Jan 1994 11:15:00 +0000",
            "description": "The castaway in Desert Island Discs this week is Ian Hislop. He'll be talking to Sue Lawley about the seven turbulent years of his editorship of Private Eye, as well as his early attempts at stand-up comedy before he became somewhat more successful at sit-down comedy as team captain of BBC TV's Have I Got News For You?\n\n[Taken from the original programme material for this archive edition of Desert Island Discs] \n\nFavourite track: The Marriage Of Figaro Se Vuol Ballare, Signor Contino by Wolfgang Amadeus Mozart\nBook: Civilisation by Kenneth Clarke\nLuxury: Frosties",
            "length": "35168000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02ppf37.mp3"
        },
        {
            "title": "Oliver Sacks",
            "datePublished": "Sun, 02 Jan 1994 11:15:00 +0000",
            "description": "The castaway in Desert Island Discs this week is Dr Oliver Sacks. Now a distinguished Professor of Neurology, he was immortalised by Robin Williams in the film Awakenings. Inspired by Dr Sacks' book of the same name, it tells the story of the summer of 1969, when the catatonic patients he was treating at the time responded to an apparent miracle drug and came alive. He'll be talking about the excitements and disappointments of that summer and also about some of the 100s of extraordinary case histories which have formed the basis of his many other books. \n\n[Taken from the original programme material for this archive edition of Desert Island Discs] \n\nFavourite track: Chu Chin Chow Here Be Oysters by Martin Lawrence\nBook: Dictionary of Musical Themes\nLuxury: Scuba diving kit",
            "length": "36496000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02ppf3g.mp3"
        },
        {
            "title": "Lord Ashley",
            "datePublished": "Sun, 26 Dec 1993 11:15:00 +0000",
            "description": "Twenty-six years ago, the then Labour MP Jack Ashley entered a world of silence - a minor operation on his ears went disastrously wrong and he lost his hearing completely. But, thanks to a complex operation, Jack Ashley, now Lord Ashley, can hear the voices of his grandchildren for the first time.\n\nIn Desert Island Discs this week he'll be talking to Sue Lawley about the struggles of his early poverty-stricken years, the misery of losing his hearing, and the dogged determination which has earned him the reputation as one of Britain's best-known and best-loved campaigners for the disabled and disadvantaged. \n\n[Taken from the original programme material for this archive edition of Desert Island Discs] \n\nFavourite track: Messiah: Hallelujah Chorus by George Frideric Handel\nBook: A Book About Warfare\nLuxury: Smoked salmon and wine",
            "length": "35968000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02ppf3m.mp3"
        },
        {
            "title": "Phil Collins",
            "datePublished": "Sun, 19 Dec 1993 11:15:00 +0000",
            "description": "The castaway in Desert Island Discs this week is the rock star Phil Collins. He'll be talking to Sue Lawley about his rise to fame as the lead singer of the group Genesis and his subsequent transition to a dazzling solo career. As someone who has sold over 35 million records worldwide, his success has brought him riches, and, apparently, happiness. He'll be discussing how the Mr Nice Guy of the rock world manages money, marriage and making music.\n\n[Taken from the original programme material for this archive edition of Desert Island Discs] \n\nFavourite track: Helpless Heart by Paul Brady\nBook: Prehistory of the Far Side by Gary Larson\nLuxury: Piano",
            "length": "34896000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02ppf3q.mp3"
        },
        {
            "title": "Taki",
            "datePublished": "Sun, 28 Nov 1993 11:15:00 +0000",
            "description": "The castaway in Desert Island Discs this week is proud to describe himself as a playboy - he is Taki Theodoracopulos - the millionaire journalist who pens the Spectator's High Life column every week. He'll be talking to Sue Lawley about his boyhood in Greece, where his father was a self-made shipping magnate, his subsequent life of tennis and nightclubs with the international jet-set and the abrupt end to this existence when he spent two months in Pentonville Prison after being found in possession of cocaine at Heathrow Airport.\n\n[Taken from the original programme material for this archive edition of Desert Island Discs] \n\nFavourite track: Lilli Marlene by German Soldiers\nBook: Essential Hemingway by Ernest Hemingway\nLuxury: Boxing punchbag",
            "length": "34144000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02ppf40.mp3"
        },
        {
            "title": "Doris Lessing",
            "datePublished": "Sun, 21 Nov 1993 11:15:00 +0000",
            "description": "The castaway in Desert Island Discs this week has been described by some critics as Britain's greatest living writer. Doris Lessing will be talking to Sue Lawley about her early life in Southern Rhodesia, from where she was eventually exiled because of what the authorities called her 'subversive activities'.\n\nShe'll also be describing the bleak London where she arrived in 1950, clutching her small son, with 40 pounds in her pocket and the manuscript of her first novel, The Grass is Singing.\n\n[Taken from the original programme material for this archive edition of Desert Island Discs] \n\nFavourite track: Tea For Two by Louis Armstrong & The All Stars\nBook: A Thousand and One Nights\nLuxury: Magic carpet",
            "length": "35904000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02ppf43.mp3"
        },
        {
            "title": "Shirley Anne Field",
            "datePublished": "Sun, 14 Nov 1993 11:15:00 +0000",
            "description": "The castaway in Desert Island Discs this week is the actress Shirley-Anne Field. She'll be talking to Sue Lawley about her Dickensian upbringing in different children's homes in the North of England and her extraordinary success as an actress in the 1960s, when she starred in The Entertainer and Saturday Night and Sunday Morning. She'll also be reminiscing about her friendship with John F Kennedy and an ill-fated date with Frank Sinatra.\n\n[Taken from the original programme material for this archive edition of Desert Island Discs] \n\nFavourite track: Piano Concerto 1 in C by Ludwig van Beethoven\nBook: Reader's Digest\nLuxury: Large Chippendale mirror",
            "length": "34832000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02ppf4b.mp3"
        },
        {
            "title": "Sybil Marshall",
            "datePublished": "Sun, 07 Nov 1993 11:15:00 +0000",
            "description": "The castaway in Desert Island Discs this week has just produced her first novel in her 80th year. Sybil Marshall will be talking to Sue Lawley about this achievement, about her life in her beloved Fenlands of East Anglia, and about the village school she ran which revolutionised primary-school teaching methods.\n\n[Taken from the original programme material for this archive edition of Desert Island Discs] \n\nFavourite track: Exsultate Jubilate Hallelujah Chorus by Wolfgang Amadeus Mozart\nBook: Huckleberry Finn by Mark Twain\nLuxury: Inexhaustible supply of laundered Swiss lawn handkerchiefs",
            "length": "35344000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02ppf4d.mp3"
        },
        {
            "title": "Judge Stephen Tumin",
            "datePublished": "Sun, 31 Oct 1993 11:15:00 +0000",
            "description": "The castaway in Desert Island Discs this week is Her Majesty's Chief Inspector of Prisons, Judge Stephen Tumim. He'll be talking to Sue Lawley about many of the controversial issues surrounding the prison service today, as well as about his own private passions for books and painting.\n\n[Taken from the original programme material for this archive edition of Desert Island Discs] \n\nFavourite track: Jerusalem by Blake/Parry\nBook: Tristram Shandy by Laurence Sterne\nLuxury: Marble bust of Laurence Sterne",
            "length": "35360000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02ppf4j.mp3"
        },
        {
            "title": "Kenny Everett",
            "datePublished": "Sun, 24 Oct 1993 11:15:00 +0000",
            "description": "The castaway in Desert Island Discs this week is the disc jockey Kenny Everett. He'll be talking to Sue Lawley about his Merseyside childhood, his discovery of classical music and his dependence on radio, all of which led him to an anarchic and erratic career on television and radio. He'll also be discussing his unorthodox life which has encompassed a suicide attempt, drugs and the break-up of his 12-year marriage after he came out as a homosexual.\n\n[Taken from the original programme material for this archive edition of Desert Island Discs] \n\nFavourite track: Symphonic Prelude by Giacomo Puccini\nBook: Eagle annual\nLuxury: Bathroom suite",
            "length": "34992000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02ppf4p.mp3"
        },
        {
            "title": "Raymond Seitz",
            "datePublished": "Sun, 17 Oct 1993 10:15:00 +0000",
            "description": "The castaway in Desert Island Discs this week is the present American Ambassador in London, Raymond Seitz. The first career diplomat ever to be appointed to the job, he'll be talking to Sue Lawley about how he also scored a first by surviving the transition from President Bush to President Clinton earlier this year. He'll also be discussing the role of the American Ambassador in a shifting political climate and describing life in the Ambassador's residence, Winfield House in Regent's Park.\n\n[Taken from the original programme material for this archive edition of Desert Island Discs] \n\nFavourite track: Clarinet Quintet In A Major K581 Second Movement by Wolfgang Amadeus Mozart\nBook: The Oxford Anthology of Modern Poetry\nLuxury: Big box full of family albums",
            "length": "34736000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02ppf4s.mp3"
        },
        {
            "title": "Lesley Garrett",
            "datePublished": "Sun, 10 Oct 1993 10:15:00 +0000",
            "description": "The castaway in Desert Island Discs this week is the opera singer Lesley Garrett. She'll be talking to Sue Lawley about her musical Yorkshire family - both her grandfathers were musical entertainers - and how she learnt to read music before she could read books. Having won a scholarship to the Royal Academy of Music, she moved straight into performing and was snapped up by the English National Opera. She'll be discussing her favourite roles and her passionate belief that opera should lose its elitist image.\n\n[Taken from the original programme material for this archive edition of Desert Island Discs] \n\nFavourite track: Broadway Babe\nBook: Photograph album\nLuxury: Tightrope",
            "length": "36416000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02ppf4y.mp3"
        },
        {
            "title": "Rt Hon Virginia Bottomley MP",
            "datePublished": "Sun, 03 Oct 1993 10:15:00 +0000",
            "description": "The castaway in Desert Island Discs this week is the Secretary of State for Health, Virginia Bottomley. She'll be talking to Sue Lawley about the stresses and strains of her job, her public image as a do-gooder and her large extended family with its annual holidays on the Isle of Wight.\n\n[Taken from the original programme material for this archive edition of Desert Island Discs] \n\nFavourite track: Exsultate Jubilate by Wolfgang Amadeus Mozart\nBook: Norton's Star Atlas\nLuxury: Radio 4's Today programme",
            "length": "35552000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02ppf51.mp3"
        },
        {
            "title": "Lord Palumbo",
            "datePublished": "Sun, 26 Sep 1993 10:15:00 +0000",
            "description": "The castaway in Desert Island Discs this week is the Chairman of the Arts Council Lord Palumbo. Property developer and long-time patron of the arts, he will be talking to Sue Lawley about his passion for collecting, which extends from motor cars to houses built by famous 20th century architects, of which he owns four. He will also be discussing his 30-year mission to redevelop the Mansion House site in the City of London.\n\n[Taken from the original programme material for this archive edition of Desert Island Discs] \n\nFavourite track: Symphony No 7 by Jean Sibelius\nBook: On The Road by Jack Kerouac\nLuxury: Telescope",
            "length": "35280000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02ppf55.mp3"
        },
        {
            "title": "Paul Merton",
            "datePublished": "Sun, 19 Sep 1993 10:15:00 +0000",
            "description": "The castaway in Desert Island Discs this week is Paul Merton. He'll be talking to Sue Lawley about his enduring but secret ambition to be a comedian and the feeling he's had throughout his life that he would always make it somehow. He'll be describing his painful beginnings at London's Comedy Store, and his graduation from there to radio and television, where he now has his own series on Channel 4, as well as appearing on Radio Four's Just A Minute and I'm Sorry I Haven't A Clue and being part of the regular team of BBC2's Have I Got News For You?\n\n[Taken from the original programme material for this archive edition of Desert Island Discs] \n\nFavourite track: Spreading by Kronos Quartet\nBook: Buster Keaton Biography by Rudi Blesh\nLuxury: Bed",
            "length": "33136000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02ppf58.mp3"
        },
        {
            "title": "Isabel Allende",
            "datePublished": "Sun, 12 Sep 1993 10:15:00 +0000",
            "description": "The castaway in Desert Island Discs this week is the novelist Isabel Allende. One of the most widely-read Latin American writers, she'll be talking to Sue Lawley about her native Chile, from where she is now voluntarily exiled, and about her childhood home where she lived with her clairvoyant grandmother and on which she based her first book The House of the Spirits.\n\n[Taken from the original programme material for this archive edition of Desert Island Discs] \n\nFavourite track: Carmina Burana Ecce Gratum by Carl Orff\nBook: All correspondence between her and her mother\nLuxury: Paper and pencils",
            "length": "35696000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02ppf5f.mp3"
        },
        {
            "title": "Nicholas Hytner",
            "datePublished": "Sun, 11 Jul 1993 10:15:00 +0000",
            "description": "The castaway in Desert Island Discs this week is the theatre director Nicholas Hytner. He'll be talking to Sue Lawley about his string of directorial successes, which include Miss Saigon, Wind in the Willows, Carousel and The Importance of Being Ernest. He'll also be discussing the health of the modern musical today and the problems of directing both drama and opera.\n\n[Taken from the original programme material for this archive edition of Desert Island Discs] \n\nFavourite track: Don Giovanni Ah Taci, Ingiusto Core by Wolfgang Amadeus Mozart\nBook: The collected works by Samuel Taylor Coleridge\nLuxury: Large supply of total block suncream",
            "length": "34784000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02ppf5j.mp3"
        },
        {
            "title": "Peter Mayle",
            "datePublished": "Sun, 04 Jul 1993 10:15:00 +0000",
            "description": "The castaway in Desert Island Discs this week is the writer Peter Mayle. Renowned for his best-selling books about life as an Englishman in France, he'll be talking to Sue Lawley about his years in advertising, and how he coined the catchphrase Nice one, Cyril', and also about the recent television adaptation of a Year in Provence, which attracted widespread criticism. Criticism and controversy have been a feature of his life since the massive success of his books and he'll be answering many of the charges levelled against him, amongst them the allegation that he has made fun of the French, presenting them as laughable stereotypes as well as attracting hordes of sightseers to disturb the peace of Provence.\n\n[Taken from the original programme material for this archive edition of Desert Island Discs] \n\nFavourite track: Caruso by Luciano Pavarotti\nBook: The Leopard by Giuseppe di Lampedusa\nLuxury: The menu from his favourite Parisien restaurant",
            "length": "35312000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02ppf5n.mp3"
        },
        {
            "title": "Sir Leon Brittan",
            "datePublished": "Sun, 27 Jun 1993 10:15:00 +0000",
            "description": "The castaway in Desert Island Discs this week is Sir Leon Brittan. He'll be talking to Sue Lawley about life as one of Britain's European Commissioners in Brussels, where he has been for the last five and a half years, since his resignation over the Westland affair. He'll also be looking back on his glittering early career - winning an Exhibition to Cambridge at 16, a double first in English and Law, and becoming, at 41, the youngest member of the Cabinet.\n\n[Taken from the original programme material for this archive edition of Desert Island Discs] \n\nFavourite track: Sonnet No 116 by William Shakespeare\nBook: The collected works by Geoffrey Chaucer\nLuxury: Collection of large-scale Ordnance Survey maps of England",
            "length": "36560000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02ppf5r.mp3"
        },
        {
            "title": "Joan Baez",
            "datePublished": "Sun, 20 Jun 1993 10:15:00 +0000",
            "description": "Sue Lawley's castaway is musician and campaigner Joan Baez.\n\nFavourite track: Salut! Demeure Chaste Et Pure by Charles Gounod\nBook: Diary by Anne Frank\nLuxury: Personal pouch with a silver lion in it",
            "length": "34448000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02ppf5z.mp3"
        },
        {
            "title": "Rt Hon Betty Boothroyd MP",
            "datePublished": "Sun, 13 Jun 1993 10:15:00 +0000",
            "description": "The castaway in Desert Island Discs this week is the Speaker of the House of Commons, Betty Boothroyd. She'll be talking to Sue Lawley about her Yorkshire childhood, her venture south to join a dance troupe, and her much-vaunted but nevertheless fleeting appearance as a Tiller Girl. She'll also be discussing how she made history last year when she became the first woman to be elected Speaker, and also the first to be elected from the opposition benches since 1835.\n\n[Taken from the original programme material for this archive edition of Desert Island Discs] \n\nFavourite track: Rock-A-Bye by Judy Garland\nBook: A Suitable Boy by Vikram Seth\nLuxury: Mace of the House of Commons",
            "length": "34992000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02ppf64.mp3"
        },
        {
            "title": "Frank Bruno",
            "datePublished": "Sun, 06 Jun 1993 10:15:00 +0000",
            "description": "The castaway in Desert Island Discs this week is the boxer Frank Bruno.\n\nHe'll be talking to Sue Lawley about how he got into trouble as a young boy for fighting with his contemporaries and ultimately with one of his sports teachers, after which he was sent to a special school where boxing was to become his salvation. He'll also be discussing the vicious nature of the sport and the rigorous training programme he undergoes before every fight.\n\n[Taken from the original programme material for this archive edition of Desert Island Discs] \n\nFavourite track: When The Going Gets Tough The Tough Get Going by Billy Ocean\nBook: Robinson Crusoe by Daniel Defoe\nLuxury: Picture of the family",
            "length": "32304000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02ppf67.mp3"
        },
        {
            "title": "Kaye Webb",
            "datePublished": "Sun, 30 May 1993 10:15:00 +0000",
            "description": "The castaway in Desert Island Discs this week is a publisher.\n\nKaye Webb was made editor of Puffin Books in the 1960s, and held the job for nearly 20 years. She'll be talking to Sue Lawley about those years and also about the crowded professional life which preceded them. As an assistant editor for the pocket magazine Lilliput in the 1930s, she commissioned contributions from distinguished authors such as Evelyn Waugh, George Bernard Shaw and Dylan Thomas.\n\n[Taken from the original programme material for this archive edition of Desert Island Discs] \n\nFavourite track: Sea Pictures - Where Corals Lie by Edward Elgar\nBook: Messages - poetry by Naomi Lewis\nLuxury: Very big photograph album on a wheeling table",
            "length": "35456000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02ppf69.mp3"
        },
        {
            "title": "Lord Weinstock",
            "datePublished": "Sun, 23 May 1993 10:15:00 +0000",
            "description": "The castaway in Desert Island Discs this week is a businessman.\n\nBorn into a family of Polish-Jewish immigrants, he was orphaned at the age of nine and brought up by his older brothers. He studied at the London School of Economics and married the daughter of a manufacturer - the owner of a small electrical company. By the age of 34, he was its Managing Director. Today that company is a huge institution - GEC - which its Managing Director Lord Weinstock has steered safely through the choppy waters of nine changes of government and six Prime Ministers. He'll be talking to Sue Lawley about his life and work and about his passionate love of music.\n\n[Taken from the original programme material for this archive edition of Desert Island Discs] \n\nFavourite track: Requiem - Recordare by Giuseppe Verdi\nBook: If This Be A Man by Primo Levi\nLuxury: Photograph album - family, friends, colleagues",
            "length": "36096000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02ppf6f.mp3"
        },
        {
            "title": "Eva Burrows",
            "datePublished": "Sun, 16 May 1993 10:15:00 +0000",
            "description": "Sue Lawley's castaway is General of the Salvation Army Eva Burrows.\n\nFavourite track: St Matthew Passion Konnen Tranen Meiner Wangen by Johann Sebastian Bach\nBook: Faber Book of Religious Verse\nLuxury: Game of Scrabble with paper and pencil",
            "length": "36368000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02ppf6j.mp3"
        },
        {
            "title": "John Cole",
            "datePublished": "Sun, 09 May 1993 10:15:00 +0000",
            "description": "Sue Lawley's castaway is journalist and broadcaster John Cole.\n\nFavourite track: The Ode To Joy (Symphony No 9) by Ludwig van Beethoven\nBook: A La Recherche Du Temps Perdu by Marcel Proust\nLuxury: Typewriter",
            "length": "36336000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02ppf6q.mp3"
        },
        {
            "title": "John Boorman",
            "datePublished": "Sun, 02 May 1993 10:15:00 +0000",
            "description": "Sue Lawley's castaway is film director John Boorman.\n\nFavourite track: Symphony No 7 Second Movement by Ludwig van Beethoven\nBook: Memories, Dreams and Reflections by Karl Jung\nLuxury: Telescope",
            "length": "35568000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02ppf6w.mp3"
        },
        {
            "title": "Baroness Blackstone",
            "datePublished": "Sun, 25 Apr 1993 10:15:00 +0000",
            "description": "The castaway in Desert Island Discs this week is Baroness Blackstone.\n\nShe'll be talking to Sue Lawley about her political radicalisation at the London School of Economics in the 1960s, the difficulties of working motherhood and the different demands of her varied professional life encompassing the academic, political and public worlds.\n\n[Taken from the original programme material for this archive edition of Desert Island Discs] \n\nFavourite track: Cosi fan Tutte Soave Sia Il Vento by Wolfgang Amadeus Mozart\nBook: Middlemarch by George Eliot\nLuxury: Tennis wall, balls and racket",
            "length": "34960000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02ppf72.mp3"
        },
        {
            "title": "Anton Edelmann",
            "datePublished": "Sun, 18 Apr 1993 10:15:00 +0000",
            "description": "Sue Lawley's castaway is chef Anton Edelmann.\n\nFavourite track: Clarinet Concerto in A by Wolfgang Amadeus Mozart\nBook: Tibetan Book of Living and Dying by Rinpoche\nLuxury: Wok",
            "length": "34816000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02ppf76.mp3"
        },
        {
            "title": "Lord Oaksey",
            "datePublished": "Sun, 11 Apr 1993 10:15:00 +0000",
            "description": "The castaway in Desert Island Discs this week is the jockey and racing journalist Lord Oaksey. He'll be talking to Sue Lawley about how he decided to give up a career in the law to become a junior racing correspondent on the Daily Telegraph and about his time as an amateur jockey when he rode 200 winners and nearly won the Grand National in 1963.\n\n[Taken from the original programme material for this archive edition of Desert Island Discs] \n\nFavourite track: Jerusalem by Blake/Parry\nBook: Mr Mulliner's Memoirs by P G Wodehouse\nLuxury: Cargo of champagne",
            "length": "34240000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02ppf79.mp3"
        },
        {
            "title": "Richard Gregory",
            "datePublished": "Sun, 04 Apr 1993 10:15:00 +0000",
            "description": "The castaway in Desert Island Discs this week is Professor Richard Gregory. He is a scientist who comes from a long line of academics - his father was an astronomer who recruited him at an early age to help build a homemade aeroplane, the 'flying flea', but luckily the project was abandoned before its fatal design fault was discovered. Professor Gregory has gone on since then to invent robots, hearing aids, special telescopes for astronauts, and to set up his famous foundation - the Exploratory in Bristol - which is visited by thousands of people every year.\n\nHe'll be talking to Sue Lawley about his passion for investigation and invention and about his mission to lift the fog of ignorance which surrounds so many people when it comes to scientific matters.\n\n[Taken from the original programme material for this archive edition of Desert Island Discs] \n\nFavourite track: Piano Sonata No 30 in E Opus 109 by Ludwig van Beethoven\nBook: An astronomy book by Patrick Moore\nLuxury: Astronomical telescope",
            "length": "36208000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02ppf7f.mp3"
        },
        {
            "title": "David Croft",
            "datePublished": "Sun, 14 Mar 1993 11:15:00 +0000",
            "description": "Sue Lawley's castaway is writer David Croft.\n\nFavourite track: Not While I'm Around by Cleo Laine\nBook: Collected Poems by Sir John Betjeman\nLuxury: Piano",
            "length": "32912000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02ppf7h.mp3"
        },
        {
            "title": "Ken Livingstone MP",
            "datePublished": "Sun, 07 Mar 1993 11:15:00 +0000",
            "description": "Sue Lawley's castaway is politician Ken Livingstone.\n\nFavourite track: Joe Hill by Paul Robeson\nBook: The Myths of Avalon by Marion Zimmer Bradley\nLuxury: The BBC World Service",
            "length": "35760000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02ppf7l.mp3"
        },
        {
            "title": "Elijah Moshinsky",
            "datePublished": "Sun, 28 Feb 1993 11:15:00 +0000",
            "description": "Sue Lawley's castaway is director Elijah Moshinsky.\n\nFavourite track: Requiem: Agnes Dei by Giuseppe Verdi\nBook: Michael Frayn translation of Complete Plays by Anton Chekhov\nLuxury: A duvet",
            "length": "34640000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02ppf7p.mp3"
        },
        {
            "title": "Sir Robin Butler",
            "datePublished": "Sun, 21 Feb 1993 11:15:00 +0000",
            "description": "Sue Lawley's castaway is civil servant Sir Robin Butler.\n\nFavourite track: Messiah I Know That My Redeemer Liveth by George Frideric Handel\nBook: Rise and Fall of the Great Powers by Paul Kennedy\nLuxury: A bag of golf clubs and golf balls",
            "length": "35104000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02ppf7r.mp3"
        },
        {
            "title": "Anthony Storr",
            "datePublished": "Sun, 31 Jan 1993 11:15:00 +0000",
            "description": "Sue Lawley's castaway is psychiatrist Anthony Storr.\n\nFavourite track: String Quintet No 3 in G Minor by Wolfgang Amadeus Mozart\nBook: A La Recherche Du Temps Perdu by Marcel Proust\nLuxury: Piano",
            "length": "36816000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02ppf7v.mp3"
        },
        {
            "title": "Evelyn Glennie",
            "datePublished": "Sun, 24 Jan 1993 11:15:00 +0000",
            "description": "The castaway in Desert Island Discs this week is the musician Evelyn Glennie. Profoundly deaf since the age of 12, her extraordinary talent as a virtuoso percussionist has taken her all over the world, giving performances on hundreds of instruments, from the tambourine and the tubular bells to the marimba and the drums.\n\nShe'll be talking to Sue Lawley about her determination to become a musician against much discouragement and how she has come to perceive her deafness as an irrelevance.\n\n[Taken from the original programme material for this archive edition of Desert Island Discs] \n\nFavourite track: Concerto No2 For Piano In C Minor by Sergei Rachmaninov\nBook: Way of the Peaceful Warrior by Dan Millman\nLuxury: Chocolate",
            "length": "35600000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02ppf7x.mp3"
        },
        {
            "title": "Dervla Murphy",
            "datePublished": "Sun, 17 Jan 1993 11:15:00 +0000",
            "description": "Sue Lawley's castaway is cyclist and writer Dervla Murphy.\n\nFavourite track: Triple Concerto in C Major by Ludwig van Beethoven\nBook: Diary by Samuel Pepys\nLuxury: A still (to distill berries, etc. into drink)",
            "length": "36848000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02ppf81.mp3"
        },
        {
            "title": "Barbara Mills QC",
            "datePublished": "Sun, 10 Jan 1993 11:15:00 +0000",
            "description": "Sue Lawley's castaway is QC Barbara Mills.\n\nFavourite track: Un Ballo In Maschera: E Scherzo Od E Follia by Giuseppe Verdi\nBook: History of the Crusades by Stephen Runciman\nLuxury: Tennis court, balls, racket and wall",
            "length": "36112000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02ppf84.mp3"
        },
        {
            "title": "Elizabeth Jennings",
            "datePublished": "Sun, 03 Jan 1993 11:15:00 +0000",
            "description": "Sue Lawley's castaway is poet Elizabeth Jennings.\n\nFavourite track: Horn Concerto No 4 In E Flat Major K 495 by Wolfgang Amadeus Mozart\nBook: The New Oxford Book of American Verse by Richard Elman\nLuxury: Pad, felt pens and biros",
            "length": "35136000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02ppf86.mp3"
        },
        {
            "title": "Stephen Hawking",
            "datePublished": "Fri, 25 Dec 1992 11:15:00 +0000",
            "description": "The castaway this week in a special extended edition of the programme is Stephen Hawking, author of the best-selling A Brief History of Time and Lucasian Professor of Mathematics at Cambridge University. He will be talking to Sue Lawley about his life and work, and the illness which has left him severely disabled for 25 years, as well as selecting the eight records he would choose to take to the mythical island.\n\n\n\n[Taken from the original programme material for this archive edition of Desert Island Discs] \n\n\n\nFavourite track: Requiem by Wolfgang Amadeus Mozart\n\nBook: Middlemarch by George Eliot\n\nLuxury: Crème brûlée",
            "length": "40240000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02ppf89.mp3"
        },
        {
            "title": "Paul Smith",
            "datePublished": "Sun, 20 Dec 1992 11:15:00 +0000",
            "description": "Sue Lawley's castaway is designer Paul Smith.\n\nFavourite track: Queen of the Slipstream by Van Morrison\nBook: Beano Annual 1974\nLuxury: Notebook and pencil",
            "length": "33440000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02ppf8j.mp3"
        },
        {
            "title": "Professor Ghillean Prance",
            "datePublished": "Sun, 13 Dec 1992 11:15:00 +0000",
            "description": "Sue Lawley's castaway is botanist Professor Ghillean Prance.\n\nFavourite track: Amazing Grace by The Royal Scots Dragoon Guards\nBook: The Natural History of Selborne by Gilbert White\nLuxury: Accordian",
            "length": "36208000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02ppf8m.mp3"
        },
        {
            "title": "Carmen Callil",
            "datePublished": "Sun, 06 Dec 1992 11:15:00 +0000",
            "description": "Sue Lawley's castaway is publisher and writer Carmen Callil.\n\nFavourite track: Adagio In E Flat by Franz Schubert\nBook: Maurice Guest by Henry Handel Richardson\nLuxury: Film - The Commitments",
            "length": "34656000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02ppf8v.mp3"
        },
        {
            "title": "Lord Tebbit",
            "datePublished": "Sun, 29 Nov 1992 11:15:00 +0000",
            "description": "Sue Lawley's castaway is politician Lord Tebbit.\n\nFavourite track: Chorus Of Hebrew Slaves by Giuseppe Verdi\nBook: History of the English-Speaking Peoples by Sir Winston Churchill\nLuxury: Drinking fountain with two taps - Sancerre and Claret",
            "length": "36640000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02ppf8z.mp3"
        },
        {
            "title": "John Eliot Gardiner",
            "datePublished": "Sun, 22 Nov 1992 11:15:00 +0000",
            "description": "Sue Lawley's castaway is conductor John Eliot Gardiner.\n\nFavourite track: Peter's Denial (St. Matthew Passion) by Johann Sebastian Bach\nBook: Memoirs by Hector Berlioz\nLuxury: Sancerre",
            "length": "36256000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02ppf95.mp3"
        },
        {
            "title": "Christabel Bielenberg",
            "datePublished": "Sun, 08 Nov 1992 11:15:00 +0000",
            "description": "Sue Lawley's castaway is writer Christabel Bielenberg.\n\nFavourite track: Deep River by Paul Robeson\nBook: War and Peace by Leo Tolstoy\nLuxury: A comfortable chair",
            "length": "35456000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02ppf98.mp3"
        },
        {
            "title": "General H Norman Schwarzkopf",
            "datePublished": "Sun, 01 Nov 1992 11:15:00 +0000",
            "description": "Sue Lawley's castaway is the Gulf War General H Norman Schwarzkopf.\n\nFavourite track: Battle Hymn Of The Republic by Howe-Steffe\nBook: The Prophet by Kahlil Gibran\nLuxury: His dog, Bear",
            "length": "35440000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02ppf9d.mp3"
        },
        {
            "title": "Gavin Laird",
            "datePublished": "Sun, 25 Oct 1992 11:15:00 +0000",
            "description": "Sue Lawley's castaway is trade unionist Gavin Laird.\n\nFavourite track: Symphony No 3 in C Minor (Organ Symphony) by Camille Saint-Saëns\nBook: Diary by Samuel Pepys\nLuxury: Year's recording of the Today programme",
            "length": "34672000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02ppf9h.mp3"
        },
        {
            "title": "Julie Andrews",
            "datePublished": "Sun, 18 Oct 1992 10:15:00 +0000",
            "description": "The castaway in Desert Island Discs this week is Julie Andrews, the star of such film favourites as Mary Poppins and The Sound of Music. Julie Andrews discovered she had an unusual talent for singing quite early and first appeared on stage alongside her step-father and her mother in their act, touring the Variety theatres of Great Britain in the 1940s and early 1950s. She had an enormous hit in a show at the London Hippodrome Theatre when she was just a teenager, and then appeared regularly on Educating Archie, one of radio's biggest programmes in the 1950s.\n\nBut it was appearing on Broadway that led her to being cast in the stage version of My Fair Lady, with Rex Harrison that really began to establish her as an international star, and then her first movie role, as Mary Poppins, which won her an Oscar that brought her to the attention of millions worldwide.\n\n[Taken from the original programme material for this archive edition of Desert Island Discs] \n\nFavourite track: Piano Concerto in G by Maurice Ravel\nBook: The Once and Future King by T H White\nLuxury: Piano",
            "length": "36480000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02ppf9n.mp3"
        },
        {
            "title": "Rt Hon Lord Sainsbury",
            "datePublished": "Sun, 11 Oct 1992 10:15:00 +0000",
            "description": "Sue Lawley's castaway is businessman and politician Lord Sainsbury.\n\nFavourite track: String Quintet In C Second Movement by Franz Schubert\nBook: The New Oxford Book of English Verse\nLuxury: Bed",
            "length": "34288000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02ppf9t.mp3"
        },
        {
            "title": "Juliet Stevenson",
            "datePublished": "Sun, 04 Oct 1992 10:15:00 +0000",
            "description": "Sue Lawley's castaway is actress Juliet Stevenson.\n\nFavourite track: Sonata No 3 in G Minor by Johann Sebastian Bach\nBook: Complete Works by W B Yeats\nLuxury: Masaccio Frescos in the Brancacci Chapel",
            "length": "36432000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02ppf9z.mp3"
        },
        {
            "title": "Chad Varah",
            "datePublished": "Sun, 27 Sep 1992 10:15:00 +0000",
            "description": "Sue Lawley's castaway is founder of the Samaritans Chad Varah.\n\nFavourite track: Aria: Dulcis Amor by George Frideric Handel\nBook: The New Oxford Book of English Verse\nLuxury: Own bathroom run by solar power with hot and cold water and a video player attached",
            "length": "37728000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02ppfb4.mp3"
        },
        {
            "title": "Raymond Blanc",
            "datePublished": "Sun, 20 Sep 1992 10:15:00 +0000",
            "description": "Sue Lawley's castaway is chef Raymond Blanc.\n\nFavourite track: Hungarian Dance No 1 in G Minor by Johannes Brahms\nBook: The Little Prince by Antoine de Saint-Exupery\nLuxury: A good luck stone (from his wife)",
            "length": "36096000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02ppfb6.mp3"
        },
        {
            "title": "Penelope Leach",
            "datePublished": "Sun, 13 Sep 1992 10:15:00 +0000",
            "description": "Sue Lawley's castaway is psychologist Penelope Leach.\n\nFavourite track: Prelude No 6 In D Minor by Johann Sebastian Bach\nBook: Complete Works by Sigmund Freud\nLuxury: Coffee",
            "length": "36944000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02ppfbb.mp3"
        },
        {
            "title": "Bob Geldof",
            "datePublished": "Sun, 06 Sep 1992 10:15:00 +0000",
            "description": "Sue Lawley's castaway is musician Bob Geldof.\n\nFavourite track: In The Garden by Van Morrison\nBook: Diary by Samuel Pepys\nLuxury: The Metropolitan Museum of New York",
            "length": "34384000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02ppfbf.mp3"
        },
        {
            "title": "Rt Hon David Mellor MP",
            "datePublished": "Sun, 26 Jul 1992 10:15:00 +0000",
            "description": "Sue Lawley's castaway is politician David Mellor.\n\nFavourite track: Tristan und Isolde - Liebestod by Richard Wagner\nBook: The Mayor of Casterbridge by Thomas Hardy\nLuxury: Telephone (disconnected)",
            "length": "36016000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02ppfbh.mp3"
        },
        {
            "title": "Sir Peregrine Worsthorne",
            "datePublished": "Sun, 19 Jul 1992 10:15:00 +0000",
            "description": "The castaway in Desert Island Discs this week is newspaper columnist Sir Peregrine Worsthorne. Outspoken and flamboyant, he believes that the columnists' brief is to supply opinions for those who haven't the time to think. He'll be talking to Sue Lawley about his life and work and remembering how his use of a four-letter word on primetime television blighted his career for several years.\n\n[Taken from the original programme material for this archive edition of Desert Island Discs] \n\nFavourite track: Partita No 1 in B Flat Major by Johann Sebastian Bach\nBook: Vile Bodies by Evelyn Waugh\nLuxury: Hallucinogenic drugs",
            "length": "35904000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02ppfbl.mp3"
        },
        {
            "title": "Mohamed Amin",
            "datePublished": "Sun, 12 Jul 1992 10:15:00 +0000",
            "description": "Sue Lawley's castaway is photo-journalist Mohamed Amin.\n\nFavourite track: Nun Sag Ich Dir Zum Ersten Mal by Arnold Schoenberg\nBook: Geometry Tutor\nLuxury: Piano",
            "length": "34496000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02ppfbp.mp3"
        },
        {
            "title": "Clare Short MP",
            "datePublished": "Sun, 05 Jul 1992 10:15:00 +0000",
            "description": "Sue Lawley's castaway is politician Clare Short.\n\nFavourite track: Nun Sag Ich Dir Zum Ersten Mal by Arnold Schoenberg\nBook: Geometry Tutor\nLuxury: Piano",
            "length": "34784000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02ppfbr.mp3"
        },
        {
            "title": "Vivienne Westwood",
            "datePublished": "Sun, 28 Jun 1992 10:15:00 +0000",
            "description": "The castaway in Desert Island Discs this week is fashion designer Vivienne Westwood. Avant-garde, surprising and often shocking, Vivienne first drew media attention when, in the late 1970s, she founded the punk movement with Malcolm McLaren. These days, though hardly orthodox, she has become more mainstream - in 1990 and 1991 she was named Designer of the Year, and she has just been awarded an OBE in the most recent Honours list. She'll be talking to Sue Lawley about her impressive career and revealing that, though fashion has been her life, her first love has always been books.\n\n[Taken from the original programme material for this archive edition of Desert Island Discs] \n\nFavourite track: Sleeping Beauty Panorama, Act 2 by Pyotr Ilyich Tchaikovsky\nBook: A La Recherche Du Temps Perdu by Marcel Proust\nLuxury: Multi-lingual dictionary",
            "length": "37472000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02ppfbx.mp3"
        },
        {
            "title": "Terry Waite",
            "datePublished": "Sun, 21 Jun 1992 10:15:00 +0000",
            "description": "In 1987, as an Ambassador of the Anglican Church trying to engineer the freedom of men held in Lebanon, Terry Waite was taken hostage himself. Nearly five years later, courageous and resilient, he emerged from a captivity of appalling deprivation and isolation. This week on Desert Island Discs he will be talking to Sue Lawley about those years and recalling the three vows he took - no regrets, no self-pity, no sentimentality - which he believes saved his sanity.\n\n[Taken from the original programme material for this archive edition of Desert Island Discs] \n\nFavourite track: Sleep by Benjamin Luxon\nBook: Complete Cambridge Histories\nLuxury: Chess computer",
            "length": "37808000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02ppfc0.mp3"
        },
        {
            "title": "Robert Lindsay",
            "datePublished": "Sun, 14 Jun 1992 10:15:00 +0000",
            "description": "The castaway in Desert Island Discs this week is actor Robert Lindsay. Born in Derbyshire 42 years ago, he's recognised today as one of Britain's most versatile performers. He'll be talking to Sue Lawley about his schooldays at a secondary modern and the art master who introduced him and the rest of the school to drama. He'll also be recalling the days when he couldn't walk down the street without being mobbed, so famous was he for his role as Wolfie in the BBC's television sitcom Citizen Smith.\n\n[Taken from the original programme material for this archive edition of Desert Island Discs] \n\nFavourite track: Also Sprach Zarathustra by Richard Strauss\nBook: Sons and Lovers by D.H. Lawrence\nLuxury: Computer chess set",
            "length": "35248000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02ppfc5.mp3"
        },
        {
            "title": "Duncan Goodhew",
            "datePublished": "Sun, 07 Jun 1992 10:15:00 +0000",
            "description": "The castaway in Desert Island Discs this week is the swimmer Duncan Goodhew. He'll be talking to Sue Lawley about his early life, which was dogged by misadventure - a fall from an apple tree left him permanently and completely bald; and in his early teens, he was discovered to be dyslexic. Nevertheless, these setbacks merely strengthened his resolve to succeed at swimming, and to go on and win a gold medal for the 100 metres breast-stroke at the Moscow Games.\n\n[Taken from the original programme material for this archive edition of Desert Island Discs] \n\nFavourite track: O Mio Babbino Caro by Giacomo Puccini\nBook: Lord of the Rings by J R R Tolkien\nLuxury: Wig",
            "length": "34048000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02ppfc8.mp3"
        },
        {
            "title": "Prunella Scales",
            "datePublished": "Sun, 31 May 1992 10:15:00 +0000",
            "description": "The castaway in Desert Island Discs this week is one of the country's favourite actresses - Prunella Scales. She's most easily recognised as Sybil Fawlty, wife of John Cleese, the manic hotelkeeper in the television series Fawlty Towers, but it's a role which represents a very small part of all she's done. Since her debut in Bristol 40 years ago, she has never been out of work, and recently she's scaled new heights with her portrayal of the Queen in Alan Bennett's A Question of Attribution. She'll be talking to Sue Lawley about the problems associated with playing such a well-known and much-loved figure, and also about the rest of her long and successful career.\n\n[Taken from the original programme material for this archive edition of Desert Island Discs] \n\nFavourite track: Ruht Wohl Ihr Heiligen Gebeine by Johann Sebastian Bach\nBook: Complete works in German by William Shakespeare and The Bible in Russian and a Russian dictionary\nLuxury: A huge tapestry kit",
            "length": "36400000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02ppfcf.mp3"
        },
        {
            "title": "Lord Chief Justice Taylor",
            "datePublished": "Sun, 24 May 1992 10:15:00 +0000",
            "description": "The castaway in Desert Island Discs this week is the country's most senior serving judge Lord Taylor of Gosforth. Recently appointed the Lord Chief Justice of England, he'll be discussing the public's perception of the English legal system, following the recent series of miscarriages of justice; and also, his plans to open up areas of the law and to rid the system of some of its more antiquated trappings, such as wigs and robes. He'll also be talking to Sue Lawley about how, as an accomplished musician, he might well have become a professional pianist rather than the Lord Chief Justice.\n\n[Taken from the original programme material for this archive edition of Desert Island Discs] \n\nFavourite track: Symphony No 41 in C K 551 by Wolfgang Amadeus Mozart\nBook: War and Peace by Leo Tolstoy\nLuxury: Piano",
            "length": "36400000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02ppfch.mp3"
        },
        {
            "title": "Michael Grade",
            "datePublished": "Sun, 17 May 1992 10:15:00 +0000",
            "description": "The castaway in Desert Island Discs this week is television executive Michael Grade. As a member of the famous Grade dynasty, he grew up in the showbiz atmosphere of London's West End. He'll be talking to Sue Lawley about being brought up by his formidable grandmother after his mother left him when he was very young; and about his career, which has taken him from Daily Mirror sports journalist to Hollywood producer, to the Controller of BBC1 and to his present position as the Chief Executive of Channel 4.\n\n[Taken from the original programme material for this archive edition of Desert Island Discs] \n\nFavourite track: Beim Schlafengehen Four Last Songs by Richard Strauss\nBook: The Wind in the Willows by Kenneth Grahame\nLuxury: Sports results",
            "length": "35200000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02ppfcp.mp3"
        },
        {
            "title": "Will Carling",
            "datePublished": "Sun, 10 May 1992 10:15:00 +0000",
            "description": "The castaway in Desert Island Discs this week is rugby player Will Carling. He'll be talking to Sue Lawley about how, as a six year old, he dreamed of captaining England, and then, having achieved his ambition at the startlingly early age of 22, he went on to take his team to the final of the World Cup and to win the Grand Slam for the last two years running.\n\n[Taken from the original programme material for this archive edition of Desert Island Discs] \n\nFavourite track: What A Wonderful World by Louis Armstrong\nBook: The Hobbit by J R R Tolkien\nLuxury: Flotation tank",
            "length": "33040000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02ppfcs.mp3"
        },
        {
            "title": "Henrietta, Marchioness Of Tavistock",
            "datePublished": "Sun, 03 May 1992 10:15:00 +0000",
            "description": "This week's castaway in Desert Island Discs is Henrietta, Marchioness of Tavistock. She'll be talking to Sue Lawley about, amongst other things, her idyllic childhood, her passion for breeding horses and explaining why she initially refused to live with her husband in his family's ancestral home, Woburn Abbey.\n\nFavourite track: Cavalleria Rusticana Intermezzo by Pietro Mascagni\nBook: History of the English-Speaking Peoples by Sir Winston Churchill\nLuxury: Triangular pillow",
            "length": "35136000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02ppfcz.mp3"
        },
        {
            "title": "Anthony Rolfe Johnson",
            "datePublished": "Sun, 26 Apr 1992 10:15:00 +0000",
            "description": "The castaway in Desert Island Discs this week is the distinguished tenor Anthony Rolfe Johnson. He'll be talking to Sue Lawley about his Methodist upbringing in the East End of London, his years as a farmer in Sussex and explaining why he was 29 years old before he took his enormous talent for singing seriously.\n\n[Taken from the original programme material for this archive edition of Desert Island Discs] \n\nFavourite track: Gloria In Excelis Deo by Johann Sebastian Bach\nBook: Welsh-English Dictionary\nLuxury: Parquet floor and tap shoes",
            "length": "38304000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02ppfd4.mp3"
        },
        {
            "title": "Sir Ernst Gombrich",
            "datePublished": "Sun, 05 Apr 1992 10:15:00 +0000",
            "description": "The castaway on Desert Island Discs this week is art historian Sir Ernst Gombrich. His most famous book, The Story of Art, was written more than 40 years ago, yet it remains the world's most popular introduction to great artists and their work.\n\nHe'll be talking to Sue Lawley about his life and work recalling his first impressions of England to which he came from Vienna in 1936, his time translating German propaganda broadcasts for the BBC during the Second World War and explaining why he prefers to help people appreciate art rather than own it himself.\n\n[Taken from the original programme material for this archive edition of Desert Island Discs] \n\nFavourite track: Divertimento For Violin In E Flat by Wolfgang Amadeus Mozart\nBook: Goethe's Poems by Johann Wolfgang Goethe\nLuxury: Bath tub with an endless supply of hot water",
            "length": "37216000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02ppfd7.mp3"
        },
        {
            "title": "Lady Soames",
            "datePublished": "Sun, 22 Mar 1992 11:15:00 +0000",
            "description": "The castaway in Desert Island Discs this week is Lady Soames, historian and only surviving child of Winston Churchill. A distinguished author and now Chairman of the Board of the National Theatre, she'll be talking to Sue Lawley about her extraordinary life - recalling her blissful childhood spent at Chartwell, the family's country home. She'll also be talking about the many state visits she made with her father and her husband - and remembering a conversation she had with General de Gaulle, who gave her lots of good advice on the best places to walk dogs in Paris.\n\n[Taken from the original programme material for this archive edition of Desert Island Discs] \n\nFavourite track: Symphony No 6 In F Major Op 68 Pastoral by Ludwig van Beethoven\nBook: Memories From Beyond The Grave by Chateaubriand\nLuxury: Supply of fine Havana cigars",
            "length": "37680000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02ppfdc.mp3"
        },
        {
            "title": "Sir Isaiah Berlin",
            "datePublished": "Sun, 15 Mar 1992 11:15:00 +0000",
            "description": "The castaway in Desert Island Discs this week is philosopher and historian Sir Isaiah Berlin. Born in Latvia 80 years ago, he was brought to England by his family when he was ten years old and barely able to speak English. He is now internationally regarded as one of the most brilliant scholars of his age.\n\nHe'll be talking to Sue Lawley about his early years in Russia, his commitment to, and respect for, this country, and explaining the philosophical implications of liberalism - his guiding principle for 60 years.\n\n[Taken from the original programme material for this archive edition of Desert Island Discs] \n\nFavourite track: String Quartet in C Sharp Minor Op 131 by Ludwig van Beethoven\nBook: Works, prose and verse by Aleksandr Pushkin\nLuxury: Large armchair stacked with cushions",
            "length": "38592000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02ppfdg.mp3"
        },
        {
            "title": "Jocelyn Stevens",
            "datePublished": "Sun, 08 Mar 1992 11:15:00 +0000",
            "description": "The castaway in Desert Island Discs this week is entrepreneur, newspaperman and public servant Jocelyn Stevens. He'll be talking to Sue Lawley about his love of life - he works in London and spends his weekends in Gstaad - and his impressive career: he revitalised Queen Magazine, launched Radio Caroline, saved the Evening Standard and served as Managing Director of Express Newspapers.\n\n[Taken from the original programme material for this archive edition of Desert Island Discs] \n\nFavourite track: Siegfried Funeral March by Richard Wagner\nBook: Other Men's Flowers by Lord A P Wavell\nLuxury: One mile stretch of the River Test in Hampshire",
            "length": "35088000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02ppfdj.mp3"
        },
        {
            "title": "Dr Steve Jones",
            "datePublished": "Sun, 01 Mar 1992 11:15:00 +0000",
            "description": "The castaway in Desert Island Discs this week is geneticist Dr Steve Jones. Eminent in his field, he's made a lifelong study of the evolution of the snail, the reproduction of the fruit fly and the sex life of the slug. He'll be talking to Sue Lawley about the study of genetics, reflecting on its disreputable past, analysing the problems of genetic engineering and discussing the research that inspired his recent Reith Lectures, particularly the evidence that proves that most of the world has descended from 10 Africans.\n\n[Taken from the original programme material for this archive edition of Desert Island Discs] \n\nFavourite track: The Fossils by Camille Saint-Saëns\nBook: Valley of Bones by Anthony Powell\nLuxury: Stuffed body of the Minister of Education",
            "length": "36752000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02ppfdp.mp3"
        },
        {
            "title": "Elvis Costello",
            "datePublished": "Sun, 23 Feb 1992 11:15:00 +0000",
            "description": "The castaway in Desert Island Discs this week is singer-songwriter Elvis Costello. Widely regarded as one of the best British songwriters of recent years, he comes from a musical family - both his father and grandfather were trumpeters.\n\nHe'll be talking to Sue Lawley about his eclectic taste in music, comparing classical singers to pop stars, and choosing eight records, not for pleasure, but to provide sustenance on his desert island.\n\n[Taken from the original programme material for this archive edition of Desert Island Discs] \n\nFavourite track: Vivace String Quartet in F Major by Ludwig van Beethoven\nBook: Selected Works by James Thurber\nLuxury: Upright piano",
            "length": "35984000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02ppfds.mp3"
        },
        {
            "title": "Sir Roger Bannister",
            "datePublished": "Sun, 16 Feb 1992 11:15:00 +0000",
            "description": "The castaway in Desert Island Discs this week is Sir Roger Bannister, the man who first ran the four-minute mile. Now an eminent neurologist, he is as proud of his research during the last 15 years into the effects of low blood pressure, as he is of his achievements on the athletics field.\n\nMaster of Pembroke College, he's taken up sculling, and with a night school qualification in navigation as well, he'll be telling Sue Lawley how he plans to escape from the desert island.\n\n[Taken from the original programme material for this archive edition of Desert Island Discs] \n\nFavourite track: Violin Concerto in D Major by Ludwig van Beethoven\nBook: Anthology of Russian, American & English Stories\nLuxury: Solar-powered receiver to receive Radio 4",
            "length": "36944000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02ppfdw.mp3"
        },
        {
            "title": "Robbie Coltrane",
            "datePublished": "Sun, 09 Feb 1992 11:15:00 +0000",
            "description": "The castaway in Desert Island Discs this week is actor Robbie Coltrane. He first became noticed in the early 1980s in television programmes such as The Comic Strip, The Young Ones and Saturday Night Live. Since then he's become an international star - one of his most recent films, Nuns on the Run, played successfully on both sides of the Atlantic. He'll be talking to Sue Lawley about, amongst other things, his love of Scotland, his passion for vintage cars and his fear of live performances.\n\n[Taken from the original programme material for this archive edition of Desert Island Discs] \n\nFavourite track: Letter From America by The Proclaimers\nBook: Lady In The Lake by Raymond Chandler\nLuxury: Pencil and paper",
            "length": "35680000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02ppfdz.mp3"
        },
        {
            "title": "J G Ballard",
            "datePublished": "Sun, 02 Feb 1992 11:15:00 +0000",
            "description": "This week's Desert Island Discs castaway is writer JG Ballard. Since the early 1960s, he has been well-known as a science fiction writer. But more recently he has reached an even wider audience with his autobiographical novels Empire of the Sun and The Kindness of Women.\n\nHe'll be talking to Sue Lawley about his extraordinary life - his childhood in Shanghai, his adolescence spent in a Japanese prisoner-of-war camp and how, after the sudden and tragic death of his wife, he raised his three young children alone.\n\n[Taken from the original programme material for this archive edition of Desert Island Discs] \n\nFavourite track: Falling In Love Again by Marlene Dietrich\nBook: Moby Dick by Herman Melville\nLuxury: Unicycle",
            "length": "34384000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02ppff3.mp3"
        },
        {
            "title": "John Major",
            "datePublished": "Sun, 26 Jan 1992 11:15:00 +0000",
            "description": "Few people will be surprised to hear that the castaway in this week's special 50th anniversary edition of Desert Island Discs is the Prime Minister John Major. He'll be talking to Sue Lawley about his very happy childhood years, his more traumatic adolescence and his transformation into the perfect Conservative parliamentary candidate. He'll also be discussing his love of music and books, and revealing the luxury that was a surprise even to Sue Lawley.\n\n[Taken from the original programme material for this archive edition of Desert Island Discs] \n\nFavourite track: O Giusto Cielo (Lucia Di Lammermoor) by Gaetano Donizetti\nBook: The Small House At Allington by Anthony Trollope\nLuxury: Oval cricket ground replica and bowling machine",
            "length": "37264000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02ppff6.mp3"
        },
        {
            "title": "Reverend David Jenkins",
            "datePublished": "Sun, 19 Jan 1992 11:15:00 +0000",
            "description": "The castaway in Desert Island Discs this week is one of Britain's most well-known church leaders, the Right Reverend David Jenkins, the Lord Bishop of Durham. At the age of 60, after a career spent mainly as an academic theologian, he was catapulted into controversy: his views on the virgin birth and the resurrection caused outrage, and his opinions on the divisions between rich and poor infuriated politicians.\n\nHe'll be talking to Sue Lawley about his surprise at the controversies he caused, and the faith which helped him to remain steadfast through the storm.\n\n[Taken from the original programme material for this archive edition of Desert Island Discs] \n\nFavourite track: The Sanctus (Harmoniemesse) by Franz Joseph Haydn\nBook: Complete Sherlock Holmes by Sir Arthur Conan Doyle\nLuxury: Binoculars",
            "length": "36496000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02ppff9.mp3"
        },
        {
            "title": "Steven Berkoff",
            "datePublished": "Sun, 12 Jan 1992 11:15:00 +0000",
            "description": "The castaway in this week's Desert Island Discs is actor, writer and director Steven Berkoff. Irreverent, energetic and compelling, his work has brought him an international reputation and his last West End production, Kvetch, was voted comedy of the year. He'll be talking to Sue Lawley about his love of drama and why it changed his life, his short spell in Hollywood playing archetypal villains and his time spent in Paris studying mime.\n\n[Taken from the original programme material for this archive edition of Desert Island Discs] \n\nFavourite track: Koyaanisqatsi by Philip Glass\nBook: A gardening book\nLuxury: Piano",
            "length": "36288000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02ppfff.mp3"
        },
        {
            "title": "Gorden Kaye",
            "datePublished": "Sun, 22 Dec 1991 11:15:00 +0000",
            "description": "The castaway on Desert Island Discs this week is actor Gorden Kaye. Lovers of British situation comedy knew him a long time ago as a familiar supporting figure in It Ain't Half Hot, Mum and Are You Being Served?, but for most people he has only one part: that of the French cafe owner Rene Artois in 'Allo 'Allo. He'll be talking to Sue Lawley about his childhood years in Yorkshire, his love of comedy and natural talent for it, and the loyalty of his audience through good and bad times.\n\n[Taken from the original programme material for this archive edition of Desert Island Discs] \n\nFavourite track: Hallelujah Chorus by George Frideric Handel\nBook: This Is Your Life by Gorden Kaye\nLuxury: A clock given to him for turning on the Oxford lights",
            "length": "34720000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02ppffj.mp3"
        },
        {
            "title": "Sue Townsend",
            "datePublished": "Sun, 08 Dec 1991 11:15:00 +0000",
            "description": "The castaway on Desert Island Discs this week is writer Sue Townsend. Her most famous creation is Adrian Mole, and, in many respects, his life mirrors her own: like her hero, she comes from a poor but not deprived background and always nursed a secret ambition to be a writer. She'll be talking to Sue Lawley about her life and work and carefully selecting eight records which remind her of some of the most significant events in her life.\n\n[Taken from the original programme material for this archive edition of Desert Island Discs] \n\nFavourite track: Violin Concerto in D by Pyotr Ilyich Tchaikovsky\nBook: Lucky Jim by Kingsley Amis\nLuxury: Swimming pool of champagne",
            "length": "40224000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02ppffr.mp3"
        },
        {
            "title": "Fred Dibnah",
            "datePublished": "Sun, 01 Dec 1991 11:15:00 +0000",
            "description": "The castaway on Desert Island Discs this week is a man who, for the past 26 years, has earned his living by helping to alter the industrial landscape of northern Britain - steeplejack Fred Dibnah. Renowned for his philosophising as much as for his engineering expertise, he'll be talking to Sue Lawley about his life, which has been spent swinging from factory chimneys and wrestling behind the wheels of steam engines.\n\n[Taken from the original programme material for this archive edition of Desert Island Discs] \n\nFavourite track: The Power Of Love by Jennifer Rush\nBook: Bound volumes of the Engineer magazine\nLuxury: Steamroller",
            "length": "35664000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02ppffv.mp3"
        },
        {
            "title": "Dilys Powell",
            "datePublished": "Sun, 24 Nov 1991 11:15:00 +0000",
            "description": "The castaway in Desert Island Discs this week is the film critic Dilys Powell. She began reviewing films for The Sunday Times in 1939, and since then her forthright and pithy comments have served as a natural accompaniment to the pleasures of going to the cinema. Today, at the age of 90, she still reviews three or four films a week and she'll be talking to Sue Lawley about her receipt of what she describes as \"a very liberal education\" from her lifelong devotion to the big screen.\n\n[Taken from the original programme material for this archive edition of Desert Island Discs] \n\nFavourite track: I Remember It Well (from Gigi) by Honore and Grandmama\nBook: Oliver Twist by Charles Dickens\nLuxury: Mouth organ with instructions",
            "length": "40544000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02ppffx.mp3"
        },
        {
            "title": "James Lovelock",
            "datePublished": "Sun, 17 Nov 1991 11:15:00 +0000",
            "description": "The castaway on Desert Island Discs this week is scientist James Lovelock. The son of a South London gasman, he'll be talking to Sue Lawley about his passion for science and recalling some of the experiences he had whilst working on the American space programme, which eventually led him to invent the Gaia Theory - a theory which, amongst other things, argues that the human race is not necessary for the planet's survival.\n\n[Taken from the original programme material for this archive edition of Desert Island Discs] \n\nFavourite track: Et Incarnatus Est by Wolfgang Amadeus Mozart\nBook: The Golden Treasury by Francis Palgrave\nLuxury: Pen and paper",
            "length": "40672000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02ppfg0.mp3"
        },
        {
            "title": "Lord Delfont",
            "datePublished": "Sun, 10 Nov 1991 11:15:00 +0000",
            "description": "The castaway in Desert Island Discs this week is the man who brought the Folies Bergere to Britain and ran the Talk of the Town in its heyday - the theatrical impresario Lord Delfont. He'll be talking to Sue Lawley about his extraordinary life: he was raised in the East End of London, his family having settled there after escaping the pogroms in the Ukraine, and is now, at 82, the president of his own leisure corporation; worth £450 million.\n\n[Taken from the original programme material for this archive edition of Desert Island Discs] \n\nFavourite track: My Heart And I by Carole Lynne\nBook: 1515-1985 British Music Theatre Book\nLuxury: Cigars and matches",
            "length": "34400000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02ppfg2.mp3"
        },
        {
            "title": "E P Thompson",
            "datePublished": "Sun, 03 Nov 1991 11:15:00 +0000",
            "description": "The castaway in this week's Desert Island Discs is the historian EP Thompson. As a lifelong peace campaigner, Edward Thompson enjoys making history as much as writing about it. He'll be talking to Sue Lawley about his disillusionment with the Communist Party, how and why he founded the magazine which has become The New Left Review, and enjoying his carefully-selected eight records.\n\n[Taken from the original programme material for this archive edition of Desert Island Discs] \n\nFavourite track: Carolan's Receipt by Derek Bell\nBook: Songs of Innocence and Experience by William Blake\nLuxury: Typewriter and paper",
            "length": "36336000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02ppfg4.mp3"
        },
        {
            "title": "Alan Alda",
            "datePublished": "Sun, 27 Oct 1991 11:15:00 +0000",
            "description": "The castaway in this week's Desert Island Discs is the American actor Alan Alda. The son of a vaudeville artist, he shot to fame portraying the wise-cracking, womanising Hawkeye in the television series M.A.S.H. He'll be talking to Sue Lawley about the part that transformed his life and his initial reluctance to accept it, his childhood years in the burlesque houses of America, and explaining why, despite being a millionaire, he continues to work.\n\n[Taken from the original programme material for this archive edition of Desert Island Discs] \n\nFavourite track: Weekend In The Country by Stephen Sondheim\nBook: Robinson Crusoe by Daniel Defoe\nLuxury: Italian pasta",
            "length": "35728000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02ppfg7.mp3"
        },
        {
            "title": "Elizabeth Esteve-Coll",
            "datePublished": "Sun, 20 Oct 1991 10:15:00 +0000",
            "description": "The castaway in Desert Island Discs this week is Elizabeth Esteve-Coll, Director of one of Britain's most famous museums, the V & A. She'll be talking to Sue Lawley about her career at the V & A and the controversy she caused within her first year of office. She'll also be recalling how, at 19, she abandoned her university career and married a Spanish sea captain with whom she sailed the world.\n\n[Taken from the original programme material for this archive edition of Desert Island Discs] \n\nFavourite track: Christus Natus Est (Mode I V) by The Choir Of Monks Of Saint Pierre De Solemes\nBook: The Four Quartets by T S Eliot\nLuxury: Expensive perfumed hand cream",
            "length": "36400000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02ppfg9.mp3"
        },
        {
            "title": "John Schlesinger",
            "datePublished": "Sun, 13 Oct 1991 10:15:00 +0000",
            "description": "The castaway on Desert Island Discs this week is the film director John Schlesinger. Like many other British filmmakers, he learnt his craft at the BBC but soon moved on to directing feature films including A Kind of Loving, Far From the Madding Crowd and the Oscar-winning Midnight Cowboy. He'll be talking to Sue Lawley about his long and successful career, the controversy he caused with his films Darling and Sunday Bloody Sunday and choosing eight records to take to his island exile.\n\n[Taken from the original programme material for this archive edition of Desert Island Discs] \n\nFavourite track: Zueignung by Richard Strauss\nBook: Dictonary of English Quotations\nLuxury: Magimix (battery-powered )",
            "length": "35568000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02ppfgf.mp3"
        },
        {
            "title": "Imran Khan",
            "datePublished": "Sun, 06 Oct 1991 10:15:00 +0000",
            "description": "The castaway in Desert Island Discs this week is the Pakistani cricketer Imran Khan. Educated at Oxford and dividing his time between England and Pakistan, his fame extends well beyond the cricket field. He'll be talking to Sue Lawley about his faith - he is a devout Muslim - the constant speculation surrounding his love life and how his mother's death from cancer dramatically changed his life.\n\n[Taken from the original programme material for this archive edition of Desert Island Discs] \n\nFavourite track: Us And Them by Pink Floyd\nBook: Bang-E Dara by Iqbal\nLuxury: Shotgun and clay pigeon trap",
            "length": "33520000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02ppfgh.mp3"
        },
        {
            "title": "David Bailey",
            "datePublished": "Sun, 29 Sep 1991 10:15:00 +0000",
            "description": "The castaway in Desert Island Discs this week is the photographer David Bailey. Born and bred in the East End of London, he took the fashion business by storm in the 1960s - discovering, photographing and often marrying some of the world's most beautiful women. He'll be talking to Sue Lawley about success in the 1960s, the first time he saw Jean Shrimpton and his desire to carry on working, like his hero Picasso, until he's 90.\n\n[Taken from the original programme material for this archive edition of Desert Island Discs] \n\nFavourite track: Dance Of The Earth (Rite Of Spring) by Igor Stravinsky\nBook: Vioces of Silence by Malraux\nLuxury: Nelson's Column",
            "length": "35552000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02ppfgl.mp3"
        },
        {
            "title": "Klaus Tennstedt",
            "datePublished": "Sun, 22 Sep 1991 10:15:00 +0000",
            "description": "The castaway in Desert Island Discs this week is the conductor Klaus Tennstedt. When, at 45, he defected from East Germany, he was virtually unknown in the West. But three years later, after conducting the Boston Symphony Orchestra, he was acclaimed as an international maestro. He'll be talking to Sue Lawley about his impressive musical career, his defection from East Germany and his battle against cancer of the vocal chords.\n\n[Taken from the original programme material for this archive edition of Desert Island Discs] \n\nFavourite track: Symphony No 6 In A Minor Finale by Gustav Mahler\nBook: Dr. Faustus by Thomas Mann\nLuxury: Mountain bike",
            "length": "36272000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02ppfgq.mp3"
        },
        {
            "title": "John Banham",
            "datePublished": "Sun, 15 Sep 1991 10:15:00 +0000",
            "description": "The castaway in Desert Island Discs this week is one of the most important figures in British industry today - the Director-General of the CBI John Banham. He'll be talking to Sue Lawley about his impressive and varied career, his passion for sailing and how he very nearly lost his life during the Fastnet Race of 1979.\n\n[Taken from the original programme material for this archive edition of Desert Island Discs] \n\nFavourite track: Sanctus by Gabriel Fauré\nBook: The collected works by A E Houseman\nLuxury: Cigars and matches",
            "length": "35856000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02ppfgs.mp3"
        },
        {
            "title": "Bernice Rubens",
            "datePublished": "Sun, 08 Sep 1991 10:15:00 +0000",
            "description": "The castaway in Desert Island Discs this week is the writer Bernice Rubens. She'll be talking to Sue Lawley about her childhood with musically-gifted brothers and sister, and how, despite having written 17 novels - one of them won the Booker prize, another was also shortlisted - she still sees herself as merely a successful novelist who failed to become a musician.\n\n[Taken from the original programme material for this archive edition of Desert Island Discs] \n\nFavourite track: String Quintet C Major Second Movement by Franz Schubert\nBook: Poems For Joy & Sermons For Solace by John Donne\nLuxury: Daughter's painting",
            "length": "36144000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02ppfgx.mp3"
        },
        {
            "title": "Maxwell Hutchinson",
            "datePublished": "Sun, 01 Sep 1991 10:15:00 +0000",
            "description": "The castaway in Desert Island Discs this week is the architect Maxwell Hutchinson. Unafraid of controversy, he attacked Prince Charles' criticisms of contemporary architecture - a move which secured him presidency of the Royal Institute of British Architects. He'll be talking to Sue Lawley about his love of tower blocks and requiem masses, of 17th-century cottages and his desire to write a number one hit.\n\n[Taken from the original programme material for this archive edition of Desert Island Discs] \n\nFavourite track: First Symphony In A Flat Minor Slow Movement by Edward Elgar\nBook: The Four Quartets by T S Eliot\nLuxury: Guitar",
            "length": "35920000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02ppfgz.mp3"
        },
        {
            "title": "Alan Bleasdale",
            "datePublished": "Sun, 25 Aug 1991 10:15:00 +0000",
            "description": "The castaway in Desert Island Discs this week is playwright Alan Bleasdale. Often controversial, and always funny, Bleasdale's work focuses on life in Liverpool, a city he loves and whose characters people his most famous plays - Boys from the Blackstuff and GBH. He'll be talking to Sue Lawley about his intense love of family, his work and, as a self-confessed hypochondriac, he will be revealing some of his fears.\n\n[Taken from the original programme material for this archive edition of Desert Island Discs] \n\nFavourite track: Shelter From The Storm by Bob Dylan\nBook: Catch 22 by Joseph Heller\nLuxury: Nail clippers",
            "length": "33456000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02ppfh1.mp3"
        },
        {
            "title": "Lord Shawcross",
            "datePublished": "Sun, 07 Jul 1991 10:15:00 +0000",
            "description": "The castaway in Desert Island Discs this week will be the lawyer and politician Lord Shawcross. As Attorney General in the Labour government of 1945, he was responsible for leading the British prosecution case at the war crimes tribunal in Nuremberg.\n\nHe'll be talking to Sue Lawley about the atmosphere in that courtroom, his reasons for leaving the Labour Party and his unconventional upbringing. Now 89 years old, he'll also be recalling the days when he was known as 'handsome Hartley Shawcross', the best-looking man in public life.\n\n[Taken from the original programme material for this archive edition of Desert Island Discs] \n\nFavourite track: Some Enchanted Evening by Ezio Pinza\nBook: They Way We Live Now by Anthony Trollope\nLuxury: CD player / solar battery-powered radio",
            "length": "40720000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02ppfh6.mp3"
        },
        {
            "title": "Ron Todd",
            "datePublished": "Sun, 30 Jun 1991 10:15:00 +0000",
            "description": "The castaway in Desert Island Discs this week is Ron Todd - leader of Britain's largest trade union, the Transport and General Workers' Union. He'll be talking to Sue Lawley about his childhood as the son of a Walthamstow street-market trader, his rejection of Catholicism and conversion to socialism and about how he feels about the modern Labour Party and the role of trade unions in the 1990s.\n\n[Taken from the original programme material for this archive edition of Desert Island Discs] \n\nFavourite track: Black And White Rag by Emmy Todd\nBook: The collected works by Robert Burns\nLuxury: Piano",
            "length": "39232000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02ppfhb.mp3"
        },
        {
            "title": "John Hegarty",
            "datePublished": "Sun, 23 Jun 1991 10:15:00 +0000",
            "description": "The castaway in Desert Island Discs this week is responsible for many of the images which grace our television screens and billboards. He is advertising man John Hegarty, and he'll be talking to Sue Lawley about some of the slogans and scenarios he has created - from Vorsprung durch Technik to the Levi's advertisement which features the hero removing his trousers in a laundrette.\n\n[Taken from the original programme material for this archive edition of Desert Island Discs] \n\nFavourite track: Stand By Me by John Lennon\nBook: The Crock of Gold by James Stephens\nLuxury: Clarinet",
            "length": "35392000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02ppfhf.mp3"
        },
        {
            "title": "A S Byatt",
            "datePublished": "Sun, 16 Jun 1991 10:15:00 +0000",
            "description": "The castaway in Desert Island Discs this week is the novelist and critic A S Byatt. Winner of the 1990 Booker prize for her novel 'Possession' - the story of a clandestine romance between two Victorian poets - she'll be talking to Sue Lawley about the isolation of her school days as a highly academic child, the release of university life at Cambridge and her subsequent life at the forefront of the British literary world.\n\n[Taken from the original programme material for this archive edition of Desert Island Discs] \n\nFavourite track: Jetzt Fand Ich's by Richard Wagner\nBook: A La Recherche Du Temps Perdu by Marcel Proust\nAlternative to Bible: King James Bible\nLuxury: Large filing cabinet full of A4 paper & pens",
            "length": "37392000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02ppfhm.mp3"
        },
        {
            "title": "Derek Walcott",
            "datePublished": "Sun, 09 Jun 1991 10:15:00 +0000",
            "description": "The castaway in Desert Island Discs this week is poet and playwright Derek Walcott. Recent winner of the WH Smith award, and described by his admirers as one of the greatest contemporary exponents of the English language, he'll be talking to Sue Lawley about his early life in St Lucia - a place he frequently returns to, when not at his post of Professor of Poetry at Boston University.\n\n[Taken from the original programme material for this archive edition of Desert Island Discs] \n\nFavourite track: You Can Call Me Al by Paul Simon\nBook: Ulysses by James Joyce\nLuxury: Carton of cigarettes",
            "length": "31264000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02ppfhr.mp3"
        },
        {
            "title": "Marco Pierre White",
            "datePublished": "Sun, 02 Jun 1991 10:15:00 +0000",
            "description": "The castaway in Desert Island Discs this week has been described as the 'enfant terrible' of the restaurant world. Marco Pierre White opened his first restaurant at the age of 27, where he established a reputation both for extraordinary culinary expertise and for outrageous behaviour.\n\nHe'll be talking to Sue Lawley about the route which took him from the Leeds council estate where he was born nearly 30 years ago, to the moment when he became the youngest chef to be awarded two Michelin stars at his restaurant, Harvey's.\n\n[Taken from the original programme material for this archive edition of Desert Island Discs] \n\nFavourite track: A Good Year For The Roses by Elvis Costello\nBook: Ma Gastronomie by Fernand Point\nLuxury: Picture of his daughter",
            "length": "31200000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02ppfht.mp3"
        },
        {
            "title": "Rt Hon John Smith",
            "datePublished": "Sun, 26 May 1991 10:15:00 +0000",
            "description": "The castaway in Desert Island Discs this week is a politician who is seen in many quarters as the Labour Party's strongest weapon in their battles with the government - John Smith, Shadow Chancellor of the Exchequer. A man of great resilience, he'll be telling Sue Lawley why he still loves politics in spite of the frustration of his years in opposition, his having a heart attack two and a half years ago and having to live for much of the time away from his beloved homeland of Scotland. \n\n[Taken from the original programme material for this archive edition of Desert Island Discs] \n\nFavourite track: The Marriage Of Figaro - Final Aria by Wolfgang Amadeus Mozart\nBook: Anthology of Poems\nLuxury: Case of champagne",
            "length": "34288000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02ppfhz.mp3"
        },
        {
            "title": "John Simpson",
            "datePublished": "Sun, 19 May 1991 10:15:00 +0000",
            "description": "The castaway in Desert Island Discs this week is John Simpson. Recently honoured by the Royal Television Society as Journalist of the Year, he'll be talking about his life covering foreign affairs for the BBC. In that capacity, he has reported on most of the momentous upheavals of the last few years - from Tiananmen Square to the release of Nelson Mandela, from the fall of Ceausescu to the collapse of the Berlin Wall.\n\nMore recently, he was one of the very few journalists to stay on in Baghdad when the Allies began their bombardment of Iraq. He'll be talking to Sue Lawley about his time there, as well as his other - more frightening rather than thrilling - experiences as the BBC's Foreign Affairs Editor.\n\n[Taken from the original programme material for this archive edition of Desert Island Discs] \n\nFavourite track: Il N'y A Plus D'Apres by Juliette Greco\nBook: A title in French by Marcel Proust\nLuxury: Flute",
            "length": "37328000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02ppfj5.mp3"
        },
        {
            "title": "Cecil Lewis",
            "datePublished": "Sun, 12 May 1991 10:15:00 +0000",
            "description": "The castaway in Desert Island Discs this week is an author and adventurer. Now 93 years old, Cecil Lewis will be talking to Sue Lawley about his extraordinary career, embracing his time as a fighter pilot during the First World War, his brush with the Red Baron, and later how he helped Lord Reith set up the BBC, which he then left for Hollywood where he was to win an Oscar for his screenplay of George Bernard Shaw's Pygmalion.\n\n[Taken from the original programme material for this archive edition of Desert Island Discs] \n\nFavourite track: Adagio No 5 by Gustav Mahler\nBook: Sagittarius Surviving by C S Lewis\nLuxury: Fax machine",
            "length": "35744000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02ppfjf.mp3"
        },
        {
            "title": "Dame Shirley Porter",
            "datePublished": "Sun, 28 Apr 1991 10:15:00 +0000",
            "description": "The castaway on Desert Island Discs this week is Dame Shirley Porter, who, as Lady Porter, was the flamboyant leader of the ruling Conservative Group at Westminster City Council - a post she held from 1983 until she stepped down in April 1991. She'll be telling Sue Lawley about what it was that made her go into politics at the age of 40, about her campaign for cleanliness on the streets of the capital and about her plans for the future.\n\n[Taken from the original programme material for this archive edition of Desert Island Discs] \n\nFavourite track: The Ode To Joy (Symphony No 9) by Ludwig van Beethoven\nBook: SAS Survival Manual\nLuxury: Large Swiss Army knife",
            "length": "33872000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02ppfjr.mp3"
        },
        {
            "title": "Dr Jonathan Sacks",
            "datePublished": "Sun, 21 Apr 1991 10:15:00 +0000",
            "description": "Chief Rabbi Elect Dr Jonathan Sacks is the castaway on Desert Island Discs this week. This avowedly 'unconventional' future leader of Britain's Jews was brought up in an Orthodox Jewish household but went to Church of England schools and wanted to be an accountant before deciding that his life's work lay in his faith. Rabbi Sacks reveals how he gained, and many years later lost, his beard as well as what he hopes to achieve in his new role.\n\n[Taken from the original programme material for this archive edition of Desert Island Discs] \n\nFavourite track: Tzomoh Lecho Nafshi by The Lubarvitches Chorus\nBook: The Talmud\nLuxury: Large supply of pencils",
            "length": "36016000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02ppfjw.mp3"
        },
        {
            "title": "Lord King",
            "datePublished": "Sun, 14 Apr 1991 10:15:00 +0000",
            "description": "The castaway in Desert Island Discs this week will be the industrialist Lord King of Wartnaby, Chairman of Babcock International and of British Airways. He recalls for Sue Lawley, among other things, his early beginnings in the engineering industry, an unfortunate incident with a small plane he once owned, and what it was which made him want to take over an ailing airline more than 10 years ago.\n\n[Taken from the original programme material for this archive edition of Desert Island Discs] \n\nFavourite track: Concerto in A Minor by Edvard Grieg\nBook: Brewer's Dictionary of Phrase and Fable\nLuxury: Supply of cigars and matches",
            "length": "35312000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02ppfk3.mp3"
        },
        {
            "title": "Naomi Mitchison",
            "datePublished": "Sun, 07 Apr 1991 10:15:00 +0000",
            "description": "Sue Lawley's castaway is writer Naomi Mitchison.\n\nFavourite track: Kishmull's Galley by Kenneth McKellar and Orchestra\nBook: Book of Modern Poetry\nLuxury: Endless supply of writing materials",
            "length": "34752000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02ppfk8.mp3"
        },
        {
            "title": "Marti Caine",
            "datePublished": "Sun, 24 Mar 1991 11:15:00 +0000",
            "description": "This week's castaway in Desert Island Discs is the entertainer Marti Caine. Although her public life is one as comedienne, television presenter, star of a sit-com series, singer and glamorous pantomime performer, Marti Caine's private life is one that is very different. Her father died when she was seven, she was taken into care before she was 10, her first marriage broke up, and then, about four years ago, she was diagnosed as suffering from cancer of the lymph glands. She talks about the way in which she's coped with all these things and the way her sense of humour helped her through.\n\n[Taken from the original programme material for this archive edition of Desert Island Discs] \n\nFavourite track: Thanksong by Dave Grusin\nBook: A DIY manual\nLuxury: Do-it-yourself solar-powered kit",
            "length": "34160000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02ppfkh.mp3"
        },
        {
            "title": "Sir Trevor Holdsworth",
            "datePublished": "Sun, 17 Mar 1991 11:15:00 +0000",
            "description": "The castaway in Desert Island Discs this week is the industrialist and ex-president of the CBI Sir Trevor Holdsworth. He'll be talking to Sue Lawley about his time at the helm of the giant engineering firm Guest, Keen and Nettleford and his recent involvement with British Satellite Broadcasting - BSB - as well as some of his earlier brushes with history.\n\n[Taken from the original programme material for this archive edition of Desert Island Discs] \n\nFavourite track: Vocalise by Sergei Rachmaninov\nBook: Collected Plays by J B Priestley\nLuxury: Upright piano",
            "length": "34336000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02ppfkn.mp3"
        },
        {
            "title": "Jeffrey Bernard",
            "datePublished": "Sun, 10 Mar 1991 11:15:00 +0000",
            "description": "The castaway in Desert Island Discs this week is the Spectator columnist Jeffrey Bernard. His Low Life column has gained him something of a cult following over the 15 years or so it's been appearing; slightly irregularly. It concentrates on the kind of life in Soho which seems often to revolve solely around drinking, women and gambling - the kind of life Jeffrey Bernard enjoys, by his own admission. And of course, last year Keith Waterhouse turned some of these columns into the highly-successful West End hit Jeffrey Bernard is Unwell - a production starring Peter O'Toole which is about to return to the Shaftesbury Theatre next month.\n\n[Taken from the original programme material for this archive edition of Desert Island Discs] \n\nFavourite track: Introitus Requiem Mass by Wolfgang Amadeus Mozart\nBook: Complete Sherlock Holmes Short Stories by Sir Arthur Conan Doyle\nLuxury: Hgih-powered hunting rifle and ammunition",
            "length": "35136000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02ppfks.mp3"
        },
        {
            "title": "Sir Denis Forman",
            "datePublished": "Sun, 03 Mar 1991 11:15:00 +0000",
            "description": "The castaway in Desert Island Discs this week is the former Chairman of Granada Television Sir Denis Forman. He'll be talking to Sue Lawley about the delights and disasters of a highly eccentric upbringing in Scotland and about his experiences in Italy during the war, where he lost a leg. Also, as the first producer of What the Papers Say, and the originator of the highly popular Jewel in the Crown, he'll be discussing the difficulties of making television programmes which are simultaneously popular and good.\n\n[Taken from the original programme material for this archive edition of Desert Island Discs] \n\nFavourite track: Concerto No 21 in C Major by Wolfgang Amadeus Mozart\nBook: Raj Quartet by Paul Scott\nLuxury: Satellite dish and TV set",
            "length": "36720000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02ppfkx.mp3"
        },
        {
            "title": "Ronald Eyre",
            "datePublished": "Sun, 24 Feb 1991 11:15:00 +0000",
            "description": "The castaway in Desert Island Discs this week is theatre and television director Ronald Eyre. A man of great versatility, he'll be talking to Sue Lawley about his many outstanding operatic and theatrical productions, as well as his school-teaching days, and his childhood in the Yorkshire mining village of Mapplewell. \n\n[Taken from the original programme material for this archive edition of Desert Island Discs] \n\nFavourite track: The Magic Flute - The Trio Soll Ich, Teurer by Wolfgang Amadeus Mozart\nBook: A talking book by Judi Dench\nLuxury: Supply of flower bulbs",
            "length": "35792000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02ppfl2.mp3"
        },
        {
            "title": "Dame Ninette De Valois",
            "datePublished": "Sun, 17 Feb 1991 11:15:00 +0000",
            "description": "The castaway in Desert Island Discs this week is Britain's most distinguished ballet mistress Dame Ninette de Valois. She first appeared on the professional stage more than 75 years ago, and her contribution to the development of ballet in this country has been phenomenal. Now in her nineties, she'll be talking to Sue Lawley about how she became the first director of the Vic Wells Ballet School in 1931 - a school which grew and changed over the years to become the Royal Ballet in 1956.\n\n[Taken from the original programme material for this archive edition of Desert Island Discs] \n\nFavourite track: Nutcracker Suite by Pyotr Ilyich Tchaikovsky\nBook: A collection of poems\nLuxury: An everlasting bottle of sleeping pills",
            "length": "36752000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02ppfl9.mp3"
        },
        {
            "title": "Paddy Ashdown MP",
            "datePublished": "Sun, 10 Feb 1991 11:15:00 +0000",
            "description": "The castaway in Desert Island Discs this week is the leader of the Liberal Democrats Paddy Ashdown. He'll be talking to Sue Lawley about his earliest memories of a childhood in India and a subsequent career which took him through the Royal Marines, into the diplomatic service and finally into the House of Commons just seven and half years ago.\n\n[Taken from the original programme material for this archive edition of Desert Island Discs] \n\nFavourite track: Che Gelida Manina (from La Boheme) by Giacomo Puccini\nBook: The collected works by John Donne\nLuxury: Laptop computer",
            "length": "36688000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02ppflg.mp3"
        },
        {
            "title": "Professor Ralf Dahrendorf",
            "datePublished": "Sun, 03 Feb 1991 11:15:00 +0000",
            "description": "The castaway in Desert Island Discs is a German politician who became an English academic. The Germany of Professor Ralf Dahrendorf's youth was that of the Third Reich but he, like his family, was fiercely opposed to the Nazi regime, and suffered imprisonment for his views. After the war, his career took him from Minister of Foreign Affairs under Willi Brandt, to the European Commission in Brussels, and then to London, where he was Director of the London School of Economics during a particularly turbulent era of its history.\n\nHe'll be talking to Sue Lawley about his academic and political career as well as his formative years in Germany; years which he believes shaped his subsequent stern and much-admired defence of libertarian principles.\n\n[Taken from the original programme material for this archive edition of Desert Island Discs] \n\nFavourite track: Blueberry Hill by Louis Armstrong\nBook: A book of Greek poetry\nLuxury: Dice to test the luck of a ship rescuing him",
            "length": "34992000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02ppfll.mp3"
        },
        {
            "title": "Brian Eno",
            "datePublished": "Sun, 27 Jan 1991 11:15:00 +0000",
            "description": "A variety of labels can be stuck on this week's Desert Island Discs castaway - from rock musician to experimental artist, from visual sculptor to composer and intellectual guru of the rock world. He is Brian Eno, and he started his career by making music playing with tape recorders, then went on to play with bands who rehearsed far more often than they performed, graduating through to the Portsmouth Sinfonia, and ending up with the hugely successful group Roxy Music.\n\nSince his Roxy Music days, he has gone on to musical collaboration with David Bowie and production of the group U2. Brian Eno will be talking to Sue Lawley about his musical and artistic activities in the mainstream, as well as on the fringes of, international cultural life.\n\n[Taken from the original programme material for this archive edition of Desert Island Discs] \n\nFavourite track: Lord Don't Forget About Me by Dorothy Love Coates\nBook: Contingency, Irony & Solidarity by Richard Rorty\nLuxury: Radio telescope",
            "length": "35072000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02ppflq.mp3"
        },
        {
            "title": "Fred Zinnemann",
            "datePublished": "Sun, 20 Jan 1991 11:15:00 +0000",
            "description": "The castaway in Desert Island Discs is a man who has directed some of the most popular and memorable films in the history of cinema - High Noon, From Here to Eternity, Oklahoma! and A Man for All Seasons. He is Fred Zinnemann, and he will be talking to Sue Lawley about his boyhood at the beginning of the century in imperial Vienna, his thwarted ambitions to be a musician, and the years he spent working in Hollywood where he directed, and on several occasions discovered, some of the best-known names in the film world, including Marlon Brando, Montgomery Clift and Frank Sinatra.\n\n[Taken from the original programme material for this archive edition of Desert Island Discs] \n\nFavourite track: Magnificat by Johann Sebastian Bach\nBook: War and Peace by Leo Tolstoy\nLuxury: Very large self renewing bottle of scotch",
            "length": "36912000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02ppflt.mp3"
        },
        {
            "title": "Adelaide Hall",
            "datePublished": "Sun, 13 Jan 1991 11:15:00 +0000",
            "description": "The castaway in Desert Island Discs this week is jazz singer Adelaide Hall. Now in her 80s and still performing, she'll be talking to Sue Lawley about her days at the Cotton Club in New York, the Moulin Rouge in Paris and the secrets of her enduring popularity.\n\n[Taken from the original programme material for this archive edition of Desert Island Discs] \n\nFavourite track: Sophisticated Lady by Duke Ellington\nBook: A book of American history\nLuxury: Box of seeds",
            "length": "32416000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02ppflz.mp3"
        },
        {
            "title": "Lord Goodman",
            "datePublished": "Sun, 06 Jan 1991 11:15:00 +0000",
            "description": "The castaway in Desert Island Discs this week is a man who has, on occasion, been described as the Mr Fixit of British public life. Arnold Goodman started off his professional life as a bright young North London solicitor, and, through a capacity for skilful negotiation and judicious advice, became the confidante of some of the most eminent political figures of post-war Britain. He'll be talking to Sue Lawley about his experience of Prime Ministers and politics, as well as his passion for opera, which, as a director of the Royal Opera House, he has been able to indulge to the full.\n\n[Taken from the original programme material for this archive edition of Desert Island Discs] \n\nFavourite track: O Namenlose Freude by Ludwig van Beethoven\nBook: Who's Who\nLuxury: An enormous box of chocolate ginger",
            "length": "36304000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02ppfm3.mp3"
        }
    ]
}