{
    "artwork": "http://is5.mzstatic.com/image/thumb/Music62/v4/68/5e/37/685e376c-1930-a3f1-5802-df1cf43f5e00/source/100x100bb.jpg",
    "description": "Dharma Ocean presents compelling talks by Reggie Ray, a unique and dynamic teacher in the lineage of Chogyam Trungpa Rinpoche. Reggie has a special gift for applying the ancient wisdom of Tibetan Buddhism to the unique problems, inspirations, and spiritual imperatives of modern people. As spiritual director of the Dharma Ocean Foundation, Reggie mentors a worldwide community of practitioners committed to meditation as a path of discovering wakefulness in everyday life. His teaching is marked by humor, insight, and an absolute trust in the relevance of meditation to all aspects of human experience: our relationships and jobs, our dreams and heartbreaks, our fears and aspirations.To find out more about teachings, retreats, community life, and our extensive selection of audio resources for beginner and advanced meditators please visit www.dharmaocean.org.",
    "feedURL": "http://feeds.feedburner.com/dharmaocean",
    "podcastURL": "http://www.dharmaocean.org",
    "title": "Dharma Ocean",
    "episodes": [
        {
            "title": "Episode 274: For the Welfare of All – Part II",
            "datePublished": "Tue, 12 Nov 2019 23:12:07 +0000",
            "description": "In the second part of this talk on the training of a Bodhisattva, Reggie discusses the last five of the six paramitas: discipline, patience, exertion, meditation, and wisdom. Through examples, he shows how the truth of each paramita is not necessarily what we might think. This talk was given at the 2003 Winter Dathün retreat […]",
            "length": "22825631",
            "sourceUrl": "http://media.blubrry.com/dharma_ocean/s3.amazonaws.com/DOPodcast/Pcast-274-For-the-Welfare-of-All-Part-II.mp3",
            "categories": [
                "Podcast",
                "Uncategorized"
            ]
        },
        {
            "title": "Episode 273: For the Welfare of All – Part I",
            "datePublished": "Tue, 05 Nov 2019 01:56:30 +0000",
            "description": "Today we listen to the first part of a talk Reggie offered at a Bodhisattva Vow ceremony. He says that the arising of tenderness and love in our hearts naturally inspires us to help sentient beings through taking the bodhisattva vow, cultivating bodhicitta, and training in the six paramitas. This talk was given at the […]",
            "length": "31641434",
            "sourceUrl": "http://media.blubrry.com/dharma_ocean/s3.amazonaws.com/DOPodcast/Pcast-273-For-the-Welfare-of-All-Part-I.mp3",
            "categories": [
                "Podcast",
                "Uncategorized"
            ]
        },
        {
            "title": "Episode 272: Clear Circle of Brightness",
            "datePublished": "Mon, 28 Oct 2019 05:28:47 +0000",
            "description": "In this episode, Caroline discusses the somatic unfolding of the awakening heart. She says that the journey involves three concentric circles: an outer circle of enchantment, an inner circle that is like a ring of fire, and a third circle of complete freedom—the clear circle of brightness. This talk was given in 2016 at a […]",
            "length": "19995200",
            "sourceUrl": "http://media.blubrry.com/dharma_ocean/s3.amazonaws.com/DOPodcast/Pcast-272-Clear-Circle-of-Brightness.mp3",
            "categories": [
                "Podcast",
                "Uncategorized"
            ]
        },
        {
            "title": "Episode 271: Loss of Reference Points",
            "datePublished": "Wed, 23 Oct 2019 13:43:53 +0000",
            "description": "In this talk, Reggie speaks to the groundlessness that we experience when situations don’t fit into the known world of ego. In such moments, strong feelings of anxiety, fear, and ambiguity might arise. Instead trying to secure territory, he encourages us to turn toward the feelings and open to the uncertainty.This talk was given in 2006 at […]",
            "length": "43339558",
            "sourceUrl": "http://media.blubrry.com/dharma_ocean/s3.amazonaws.com/DOPodcast/Pcast-271-Loss-of-Reference-Points.mp3",
            "categories": [
                "Podcast",
                "Uncategorized"
            ]
        },
        {
            "title": "Episode 270: Being with the Journey",
            "datePublished": "Mon, 14 Oct 2019 04:18:26 +0000",
            "description": "In this talk, Reggie describes the moment when we check-out during experiences that are painful, unsettling, or disconcerting. He says such moments of intensity offer an opportunity to step through our fear and resistance, open to our feelings, and rest with the sacredness of the situation. This talk was given at the 2011 Winter Dathun […]",
            "length": "28400140",
            "sourceUrl": "http://media.blubrry.com/dharma_ocean/s3.amazonaws.com/DOPodcast/Pcast-270-Being-with-Journey.mp3",
            "categories": [
                "Podcast",
                "Uncategorized"
            ]
        },
        {
            "title": "Episode 269: Practice Dismantles",
            "datePublished": "Sun, 06 Oct 2019 01:51:13 +0000",
            "description": "Here, Reggie points to the process that unfolds on the journey of somatic meditation: personal stories fall apart and we come to trust the intimacy, humor, openness, and love that emerges when our solid sense of self is dismantled. This talk was given in 2009 at the September Meditating with the Body retreat held at […]",
            "length": "31871296",
            "sourceUrl": "http://media.blubrry.com/dharma_ocean/s3.amazonaws.com/DOPodcast/Pcast-269-Practice-Dismantles.mp3",
            "categories": [
                "Podcast",
                "Uncategorized"
            ]
        },
        {
            "title": "Episode 268: Basic Space",
            "datePublished": "Sat, 28 Sep 2019 18:27:23 +0000",
            "description": "In this talk, Caroline discusses the true nature of reality—the Dharmakaya—that we experience when we rest in the space of the lower belly in the practice of yin breathing. She says that this space is open, free, and not constrained by conditioned “parts.” This talk was given at the 2016 The Body Loves retreat held […]",
            "length": "16728825",
            "sourceUrl": "http://media.blubrry.com/dharma_ocean/s3.amazonaws.com/DOPodcast/Pcast-268-Basic-Space.mp3",
            "categories": [
                "Podcast",
                "Uncategorized"
            ]
        },
        {
            "title": "Episode 267: Life Force – Part II",
            "datePublished": "Mon, 23 Sep 2019 07:50:31 +0000",
            "description": "In the second part of this talk, Reggie asks: where does the Life Force come from? He says that the empty nothingness of space gives birth to the primordial isness and rabid passion we feel when we rest with the raw energy that emerges from the emptiness of being. This talk was given at the […]",
            "length": "37576436",
            "sourceUrl": "http://media.blubrry.com/dharma_ocean/s3.amazonaws.com/DOPodcast/Pcast-267-Life-Force-Part-II.mp3",
            "categories": [
                "Podcast",
                "Uncategorized"
            ]
        },
        {
            "title": "Episode 266: Life Force – Part I",
            "datePublished": "Sat, 14 Sep 2019 04:35:48 +0000",
            "description": "Here, Reggie speaks to the utter power of the Life Force that courses through our body as pure unadulterated love. This force, he says, speaks the message of this lineage: to trust our uncompromising, wild, reckless, implacable lust for being alive. This talk was given at the 2009 Winter Dathün retreat held at the Blazing […]",
            "length": "24774345",
            "sourceUrl": "http://media.blubrry.com/dharma_ocean/s3.amazonaws.com/DOPodcast/Pcast-266-Life-Force-Part-I.mp3",
            "categories": [
                "Podcast",
                "Uncategorized"
            ]
        },
        {
            "title": "Episode 265: Journey of Individuation",
            "datePublished": "Fri, 30 Aug 2019 20:55:10 +0000",
            "description": "In today’s episode, Reggie discusses the meditative journey of individuation. He acknowledges societal obstacles, such as institutional bureaucracies, that can undermine inspiration and waylay personal development. True freedom requires taking responsibility for our life and completely trusting the inner voice of our body. This talk was given in 2009 at the September Meditating with the […]",
            "length": "26921599",
            "sourceUrl": "http://media.blubrry.com/dharma_ocean/s3.amazonaws.com/DOPodcast/Pcast-265-Journey-of-Individuation.mp3",
            "categories": [
                "Podcast",
                "Uncategorized"
            ]
        },
        {
            "title": "Episode 264: Loving Presence",
            "datePublished": "Thu, 15 Aug 2019 12:31:13 +0000",
            "description": "In today’s episode, Caroline asks a shrine hall of retreatants: what are we doing here? The answer: letting be. In this process, we discover the felt sense, or non-conceptual awareness of the body, which has distinct qualities: loving presence, attentiveness, attunement, responsiveness, and reliability. This talk was given at the 2014 Winter Dathün retreat held […]",
            "length": "24173205",
            "sourceUrl": "http://media.blubrry.com/dharma_ocean/s3.amazonaws.com/DOPodcast/Pcast-264-Loving-Presence.mp3",
            "categories": [
                "Podcast",
                "Uncategorized"
            ]
        },
        {
            "title": "Episode 263: Sacred Mysteries",
            "datePublished": "Wed, 31 Jul 2019 23:22:14 +0000",
            "description": "In this teaching, Reggie discusses the experience of pain as understood in the Vajrayana tradition of meditation. When we let go of judging and rejecting, moments of pain are experienced as sacred ornaments of tenderness that connect us to Life in all of its depth, power, and beauty. This talk was given at the 2011 […]",
            "length": "27669754",
            "sourceUrl": "http://media.blubrry.com/dharma_ocean/s3.amazonaws.com/DOPodcast/Pcast-263-Sacred-Mysteries.mp3",
            "categories": [
                "Podcast",
                "Uncategorized"
            ]
        },
        {
            "title": "Episode 262: Awakening Heart",
            "datePublished": "Wed, 17 Jul 2019 05:58:52 +0000",
            "description": "In this talk, Caroline teaches on bodhicitta, the wakeful intelligence of the body that is concentrated in the heart. She says that the essence of bodhicitta is space, the manifestation is love, and the activity is connection. This talk was given at the 2016 The Body Loves retreat held at the Blazing Mountain Retreat Center […]",
            "length": "16501939",
            "sourceUrl": "http://media.blubrry.com/dharma_ocean/s3.amazonaws.com/DOPodcast/Pcast-262-Awakening-Heart.mp3",
            "categories": [
                "Podcast",
                "Uncategorized"
            ]
        },
        {
            "title": "Episode 261: Stripped Down to Nothing",
            "datePublished": "Wed, 03 Jul 2019 05:31:31 +0000",
            "description": "Here, Reggie points to the often hidden and unrecognized dimensions in the life journey of the Buddha. He says that Thich Nhat Hahn’s book Old Path White Clouds shows how the Buddha’s renunciation of conventional norms was quite radical and threatening to the cultural establishment of his day. This talk was offered at a Dhyanasangha […]",
            "length": "15272056",
            "sourceUrl": "http://media.blubrry.com/dharma_ocean/s3.amazonaws.com/DOPodcast/Pcast-261-Stripped-Down-to-Nothing.mp3",
            "categories": [
                "Podcast",
                "Uncategorized"
            ]
        },
        {
            "title": "Episode 260: Under the Rose Apple Tree",
            "datePublished": "Sat, 22 Jun 2019 01:16:20 +0000",
            "description": "In today’s episode, we listen to a talk Caroline offered on the experience of the natural state in childhood. She offers a Vajrayana account of the story of the Buddha who, at age 9, recognized rigpa while sitting under a rose apple tree. This talk was given in 2016 at the November Meditating with the […]",
            "length": "24561893",
            "sourceUrl": "http://media.blubrry.com/dharma_ocean/s3.amazonaws.com/DOPodcast/Pcast-260-Under-the-Rose-Apple-Tree.mp3",
            "categories": [
                "Podcast",
                "Uncategorized"
            ]
        },
        {
            "title": "Episode 259: Pain is Not a Problem",
            "datePublished": "Tue, 18 Jun 2019 01:59:46 +0000",
            "description": "Here, Reggie teaches on experiences of pain that we encounter on the path of meditation. He says that people often judge pain as a bad thing, but the foundation of Buddhist practice is the First Noble Truth: the more we try to avoid pain, the more we suffer. This talk was given at the 2002 […]",
            "length": "15478616",
            "sourceUrl": "http://media.blubrry.com/dharma_ocean/s3.amazonaws.com/DOPodcast/Pcast-259-Pain-is-Not-a-Problem.mp3",
            "categories": [
                "Podcast",
                "Uncategorized"
            ]
        },
        {
            "title": "Episode 258: Surrendering Ego – Part II",
            "datePublished": "Sat, 01 Jun 2019 00:05:50 +0000",
            "description": "Going deeper into the theme of refuge, Reggie teaches on the difference between the inner and outer view of taking refuge in the Buddha, Dharma, and Sangha. Inner refuge means that we are committing to our non-existence, the nature of reality, and relationships of integrity. This talk was given at the 2002 Winter Dathün retreat […]",
            "length": "18182467",
            "sourceUrl": "http://media.blubrry.com/dharma_ocean/s3.amazonaws.com/DOPodcast/Pcast-258-Surrendering-Ego-Part-II.mp3",
            "categories": [
                "Podcast",
                "Uncategorized"
            ]
        },
        {
            "title": "Episode 257: Surrendering Ego – Part I",
            "datePublished": "Sun, 19 May 2019 00:45:57 +0000",
            "description": "In this talk on refuge, Reggie discusses the history of refuge in the Buddhist tradition and describes the different styles of “emergency ego” that arise when we find ourselves challenged by reality. He says that surrendering ego is the basis for the practice of refuge. This talk was given at the 2002 Winter Dathün retreat […]",
            "length": "16615746",
            "sourceUrl": "http://media.blubrry.com/dharma_ocean/s3.amazonaws.com/DOPodcast/Pcast-257-Surrendering-Ego-Part-I.mp3",
            "categories": [
                "Podcast",
                "Uncategorized"
            ]
        },
        {
            "title": "Episode 256: Path of Dharma – Part II",
            "datePublished": "Fri, 10 May 2019 23:23:33 +0000",
            "description": "In the second part of this talk on the path of dharma, Reggie discusses the developmental journey that unfolds as we deepen in our meditation practice. When meditation becomes the ground of life, transformation becomes a way of being. This talk was given at the 2004 Winter Dathün retreat held in the Rocky Mountains of […]",
            "length": "20977217",
            "sourceUrl": "http://media.blubrry.com/dharma_ocean/s3.amazonaws.com/DOPodcast/Pcast-256-Path-of-Dharma-Part-II.mp3",
            "categories": [
                "Podcast",
                "Uncategorized"
            ]
        },
        {
            "title": "Episode 255: Path of Dharma – Part I",
            "datePublished": "Sat, 04 May 2019 07:08:43 +0000",
            "description": "In this teaching on the path of Dharma, Reggie encourages us to trust inspiration, stay with discomfort, and leap to the unknown. Each stage of the path—Hinayana, Mahayana, and Vajrayana—involves ever deeper levels of these themes. This talk was given at the 2004 Winter Dathün retreat held in the Rocky Mountains of Colorado.",
            "length": "25629760",
            "sourceUrl": "http://media.blubrry.com/dharma_ocean/s3.amazonaws.com/DOPodcast/Pcast-255-Path-of-Dharma-Part-I.mp3",
            "categories": [
                "Podcast",
                "Uncategorized"
            ]
        },
        {
            "title": "Episode 254: Lineage of Dismantling – Part II",
            "datePublished": "Fri, 26 Apr 2019 21:39:06 +0000",
            "description": "In the second part of this talk on the esoteric tradition of meditation, Reggie suggests that mahamudra practices of direct experience serve as a compelling gate for modern people who long to connect with reality. By dismantling concepts, we meet Life—stripped down, unmediated, free. This talk was given at the 2013 Mahamudra for the Modern […]",
            "length": "19265737",
            "sourceUrl": "http://media.blubrry.com/dharma_ocean/s3.amazonaws.com/DOPodcast/Pcast-254-Lineage-of-Dismantling-Part-II.mp3",
            "categories": [
                "Podcast",
                "Uncategorized"
            ]
        },
        {
            "title": "Episode 253: Lineage of Dismantling – Part I",
            "datePublished": "Fri, 19 Apr 2019 21:30:42 +0000",
            "description": "This talk begins with an account of the ancient forest tradition of meditation that began with the Buddha. Reggie discusses the values represented by these meditators and says that our lineage is in alignment with other sanghas that practice with nakedness and humility. This talk was given at the 2013 Mahamudra for the Modern World […]",
            "length": "13179336",
            "sourceUrl": "http://media.blubrry.com/dharma_ocean/s3.amazonaws.com/DOPodcast/Pcast-253-Lineage-of-Dismantling-Part-I.mp3",
            "categories": [
                "Podcast",
                "Uncategorized"
            ]
        },
        {
            "title": "",
            "datePublished": "Fri, 19 Apr 2019 21:07:30 +0000",
            "description": "This talk begins with an account of the ancient forest tradition of meditation that began with the Buddha. Reggie discusses the values represented by these meditators and says that our lineage is in alignment with other sanghas that practice with nakedness and humility. This talk was given at the 2013 Mahamudra for the Modern World […]",
            "length": "13179336",
            "sourceUrl": "http://media.blubrry.com/dharma_ocean/s3.amazonaws.com/DOPodcast/Pcast-253-Lineage-of-Dismantling-Part-I.mp3",
            "categories": [
                "Podcast",
                "Uncategorized"
            ]
        },
        {
            "title": "Episode 252: The Impediments of Religion – Part II",
            "datePublished": "Thu, 11 Apr 2019 11:00:40 +0000",
            "description": "In the second part of this talk on genuineness in spirituality, Reggie says that relaxation in somatic meditation allows us to see how the forces of oppression, control, and busyness in the world are also within us. When tension in the body dissolves, we discover not only our inherent freedom, but also all the ways […]",
            "length": "18991566",
            "sourceUrl": "http://media.blubrry.com/dharma_ocean/s3.amazonaws.com/DOPodcast/Pcast-252-The-Impediments-of-Religion-Part-II.mp3",
            "categories": [
                "Podcast",
                "Uncategorized"
            ]
        },
        {
            "title": "Episode 251: The Impediments of Religion – Part I",
            "datePublished": "Fri, 05 Apr 2019 21:11:48 +0000",
            "description": "In this talk on our natural spiritual inheritance, Reggie discusses the impediments presented by religious institutionalism, consumerism, and fundamentalism to the unfolding of each unique human life. In the modern world, authenticity is a lonely journey. This talk was given at the April 2006 Meditating with the Body retreat held at the Blazing Mountain Retreat […]",
            "length": "26046413",
            "sourceUrl": "http://media.blubrry.com/dharma_ocean/s3.amazonaws.com/DOPodcast/Pcast-251-The-Impediments-of-Religion-Part-I.mp3",
            "categories": [
                "Podcast",
                "Uncategorized"
            ]
        },
        {
            "title": "Episode 250: The Practicality of Spirituality",
            "datePublished": "Fri, 29 Mar 2019 23:43:14 +0000",
            "description": "In this talk, Reggie says that the tantric path does not separate spiritual practice from the ordinary circumstances of everyday life. Rather, tantric meditation invites us to see the sacredness within the earthiness, messiness, emotions, and chaos of our human incarnation. This talk was given in 2009 at an evening gathering held at the Star […]",
            "length": "24520009",
            "sourceUrl": "http://media.blubrry.com/dharma_ocean/s3.amazonaws.com/DOPodcast/Pcast-250-The-Practicality-of-Spirituality.mp3",
            "categories": [
                "Podcast",
                "Uncategorized"
            ]
        },
        {
            "title": "Episode 249: Genuine Spirituality – Part II",
            "datePublished": "Thu, 21 Mar 2019 01:42:35 +0000",
            "description": "In the second part of this talk on genuine spirituality, Reggie describes the outer, inner, and secret forms of the retreat container. By respecting the forms, practicing silence, and staying present to waves of pain, we come to discover the abundance of our true life. This talk was given at the 2002 Winter Dathün retreat […]",
            "length": "20451911",
            "sourceUrl": "http://media.blubrry.com/dharma_ocean/s3.amazonaws.com/DOPodcast/Pcast-249-Genuine-Spirituality-Part-II.mp3",
            "categories": [
                "Podcast",
                "Uncategorized"
            ]
        },
        {
            "title": "Episode 248: Genuine Spirituality – Part I",
            "datePublished": "Sat, 16 Mar 2019 19:00:00 +0000",
            "description": "Spiritual materialism is the ambitious ego-centered approach of striving for perfection through meditation practice. Here, Reggie speaks to genuine spirituality—the willingness to face our insecurities, depression, anger, darkness, and pride with an open heart. Such an approach, he says, is the way of wholeness. This talk was given at the 2002 Winter Dathün retreat held […]",
            "length": "15914950",
            "sourceUrl": "http://media.blubrry.com/dharma_ocean/s3.amazonaws.com/DOPodcast/Pcast-248-Genuine-Spirituality-Part-I.mp3",
            "categories": [
                "Podcast",
                "Uncategorized"
            ]
        },
        {
            "title": "Episode 247: Meditating with the Elements",
            "datePublished": "Tue, 12 Mar 2019 03:24:29 +0000",
            "description": "Here, Reggie says that when we practice with the elements we discover that their basic nature is space. For instance, by allowing our awareness to completely enter the into the life of fire, we touch the emptiness, openness, and warmth of being. This talk was given at the April 2009 Meditating with the Body retreat […]",
            "length": "22270917",
            "sourceUrl": "http://media.blubrry.com/dharma_ocean/s3.amazonaws.com/DOPodcast/Pcast-247-Meditating-with-the-Elements.mp3",
            "categories": [
                "Podcast",
                "Uncategorized"
            ]
        },
        {
            "title": "Episode 246: Practicing in Cold Places – Part II",
            "datePublished": "Fri, 01 Mar 2019 21:33:05 +0000",
            "description": "In the second part of this talk on the challenges, demands, and grittiness of retreat practice, Reggie says that the way through involves developing trust in our feelings of disruption, uncertainty, anxiety. In the Vajrayana, difficult emotions are a source of inspiration and strength. This talk was given at the 2016 Meditating with the Body […]",
            "length": "16468678",
            "sourceUrl": "http://media.blubrry.com/dharma_ocean/s3.amazonaws.com/DOPodcast/Pcast-246-Practicing-in-Cold-Places-Part-II.mp3",
            "categories": [
                "Podcast",
                "Uncategorized"
            ]
        },
        {
            "title": "Episode 245: Practicing in Cold Places – Part I",
            "datePublished": "Sat, 23 Feb 2019 00:33:23 +0000",
            "description": "After circumstances did not unfold according to plan, a group of devoted practitioners in England erected a tent so that a late autumn retreat could go on. Reggie offers a talk of encouragement, sharing lore about the hardiness of the lineage in times past. This talk was given at the 2016 Meditating with the Body […]",
            "length": "19078341",
            "sourceUrl": "http://media.blubrry.com/dharma_ocean/s3.amazonaws.com/DOPodcast/Pcast-245-Practicing-in-Cold-Places-Part-I.mp3",
            "categories": [
                "Podcast",
                "Uncategorized"
            ]
        },
        {
            "title": "Episode 244: Invoking the Primeval Fire – Part II",
            "datePublished": "Tue, 12 Feb 2019 08:08:58 +0000",
            "description": "You are listening to the Dharma Ocean Podcast. In the second part of this talk on entering into relationship with the energetic aspect of the elements, Reggie says that the journey of becoming who we are is found in surrendering to the primeval birth of the five elements in the empty space of our basic […]",
            "length": "17347707",
            "sourceUrl": "http://media.blubrry.com/dharma_ocean/s3.amazonaws.com/DOPodcast/Pcast-244-Invoking-the-Primeval-Fire-Part-II.mp3",
            "categories": [
                "Podcast",
                "Uncategorized"
            ]
        },
        {
            "title": "Episode 243: Invoking the Primeval Fire – Part I",
            "datePublished": "Tue, 05 Feb 2019 20:08:07 +0000",
            "description": "In this talk, Reggie discusses the burning quality of space that is felt when we open to heightened awareness of emptiness. By offering our agendas, strategies, and concepts to the primordial Fire, Life is liberated to flare forth—utterly wild and free. This talk was given at the 2009 Advanced Meditating with the Body retreat held […]",
            "length": "24262399",
            "sourceUrl": "http://media.blubrry.com/dharma_ocean/s3.amazonaws.com/DOPodcast/Pcast-243-Invoking-the-Primeval-Fire-Part-I.mp3",
            "categories": [
                "Podcast",
                "Uncategorized"
            ]
        },
        {
            "title": "Episode 242: The Edge of Fear",
            "datePublished": "Mon, 28 Jan 2019 18:33:22 +0000",
            "description": "In this talk, Reggie reflects on the fear we experience on the somatic journey of meditation when we lose reference points and enter into the world of the shadowlands, a world that is utterly new and unfamiliar—the realm of our true self. This excerpt is from a talk given in Your Breathing Body Volume I […]",
            "length": "18187443",
            "sourceUrl": "http://media.blubrry.com/dharma_ocean/s3.amazonaws.com/DOPodcast/Pcast-242-The-Edge-of-Fear.mp3",
            "categories": [
                "Podcast",
                "Uncategorized"
            ]
        },
        {
            "title": "Episode 241: The Life of Chögyam Trungpa",
            "datePublished": "Sat, 12 Jan 2019 08:12:04 +0000",
            "description": "Here, Reggie introduces his teacher, Chögyam Trungpa. He offers a short account of Trungpa’s journey from Tibet, to England, and then to North America, and discusses how he transmitted the Vajrayana Buddhist teachings to his Western students. This excerpt is from a talk given in When Lightning Strikes: The Living Teachings of Chogyam Trungpa Rinpoche, […]",
            "length": "23849150",
            "sourceUrl": "http://media.blubrry.com/dharma_ocean/s3.amazonaws.com/DOPodcast/Pcast-241-The-Life-of-Chogyam-Trungpa.mp3",
            "categories": [
                "Podcast",
                "Uncategorized"
            ]
        },
        {
            "title": "Episode 240: Initiation and Growth – Part II",
            "datePublished": "Fri, 21 Dec 2018 22:23:27 +0000",
            "description": "In the second part of this talk on the journey of somatic meditation, Reggie describes the initiatory process we experience when we enter the depths of the body. Initiations, he says, involve a process of dysregulation and entrainment with the awakened state. This talk was given at the November 2016 Meditating with the Body retreat […]",
            "length": "16728260",
            "sourceUrl": "http://media.blubrry.com/dharma_ocean/s3.amazonaws.com/DOPodcast/Pcast-240-Initiation-and-Growth-Part-II.mp3",
            "categories": [
                "Podcast",
                "Uncategorized"
            ]
        },
        {
            "title": "Episode 239: Initiation and Growth – Part I",
            "datePublished": "Fri, 14 Dec 2018 00:46:58 +0000",
            "description": "Reggie opens this Meditating with the Body retreat with a talk on the primordial sacredness of the human person. He says that the esoteric spirituality of the body that we are practicing has endured throughout the ages. No matter the external circumstances, the body is trustworthy. This talk was given at the November 2016 Meditating […]",
            "length": "17087299",
            "sourceUrl": "http://media.blubrry.com/dharma_ocean/s3.amazonaws.com/DOPodcast/Pcast-239-Initiation-and-Growth-Part-I.mp3",
            "categories": [
                "Podcast",
                "Uncategorized"
            ]
        },
        {
            "title": "Episode 238: Way of the Siddhas",
            "datePublished": "Mon, 19 Nov 2018 05:48:26 +0000",
            "description": "Here, Reggie explores the roots of somatic meditation in ancient India. He says that the history of Buddhism was mostly written by monastics and reflects a “renunciation” approach to spirituality. However, there is a more unknown history of practice exemplified by lay practitioners known as “siddhas.” This excerpt is from a talk given in Your […]",
            "length": "19863613",
            "sourceUrl": "http://media.blubrry.com/dharma_ocean/s3.amazonaws.com/DOPodcast/Pcast-238-Way-of-the-Siddhas.mp3",
            "categories": [
                "Podcast",
                "Uncategorized"
            ]
        },
        {
            "title": "Episode 237: Beholding the Beloved – Part II",
            "datePublished": "Fri, 02 Nov 2018 22:08:21 +0000",
            "description": "In the closing talk of their weekend program on the path of consort relationship, Reggie discusses the three vows of the consort relationship, and Caroline offers guidance on how to integrate consort practice into everyday life. This talk was given in 2017 at a weekend program held at Naropa University in Boulder, CO called Awakening […]",
            "length": "18094532",
            "sourceUrl": "http://media.blubrry.com/dharma_ocean/s3.amazonaws.com/DOPodcast/Pcast-237-Beholding-the-Beloved-Part-II.mp3",
            "categories": [
                "Podcast",
                "Uncategorized"
            ]
        },
        {
            "title": "Episode 236: Beholding the Beloved – Part I",
            "datePublished": "Sat, 27 Oct 2018 04:58:27 +0000",
            "description": "Here, we listen to the first part of Reggie and Caroline’s concluding talk from their weekend program on consort relationship. They reflect on lessons learned in their own relationship, sharing insights about staying connected, the importance of daily meditation practice, and receiving the wholeness of the beloved. This talk was given in 2017 at a […]",
            "length": "18137923",
            "sourceUrl": "http://media.blubrry.com/dharma_ocean/s3.amazonaws.com/DOPodcast/Pcast-236-Beholding-the-Beloved-Part-I.mp3",
            "categories": [
                "Podcast",
                "Uncategorized"
            ]
        },
        {
            "title": "Episode 235: The Spiritual Journey of Intimate Relationship",
            "datePublished": "Tue, 16 Oct 2018 23:28:45 +0000",
            "description": "Today, we listen to Reggie’s opening talk from an online course he taught on meditation and the journey of intimate relationship. He says that the tantric consort tradition shows us how to discover ever deeper levels of love and relationality with our partner. This excerpt is from a talk given in The Tantric Consort: Awakening […]",
            "length": "26198099",
            "sourceUrl": "http://media.blubrry.com/dharma_ocean/s3.amazonaws.com/DOPodcast/Pcast-235-The-Spiritual-Journey-of-Intimate-Relationship.mp3",
            "categories": [
                "Podcast",
                "Uncategorized"
            ]
        },
        {
            "title": "Episode 234: Form Holds Freedom – Part II",
            "datePublished": "Fri, 05 Oct 2018 11:00:51 +0000",
            "description": "In the second part of this talk on container principle, Reggie offers pith meditation instruction: let form hold experience. Using the example of ballet dancers doing plies, he says that fidelity to form in meditation practice allows us to discover true freedom. This talk was given in 2016 at the November Meditating with the Body retreat […]",
            "length": "16301633",
            "sourceUrl": "http://media.blubrry.com/dharma_ocean/s3.amazonaws.com/DOPodcast/Pcast-234-Form-Holds-Freedom-Part-II.mp3",
            "categories": [
                "Podcast",
                "Uncategorized"
            ]
        },
        {
            "title": "Episode 233: Form Holds Freedom – Part I",
            "datePublished": "Fri, 28 Sep 2018 22:54:25 +0000",
            "description": "In the first part of this talk on container principle, Reggie says that mindfulness meditation is often used as a technique to try to stabilize the ego by creating a sense of control, perfectionism, and safety. True meditation holds and protects the raw, rugged, messy unfolding of the totality within us. This talk was given […]",
            "length": "13256512",
            "sourceUrl": "http://media.blubrry.com/dharma_ocean/s3.amazonaws.com/DOPodcast/Pcast-233-Form-Holds-Freedom-Part-I.mp3",
            "categories": [
                "Podcast",
                "Uncategorized"
            ]
        },
        {
            "title": "Episode 232: Heart of Awakening – Part II",
            "datePublished": "Fri, 21 Sep 2018 19:08:50 +0000",
            "description": "In the second part of this talk on bodhicitta, Reggie says that after his enlightenment, the Buddha heard the cries of suffering in the world and felt a welling of compassion that compelled him to help free sentient beings from samsara through teaching the dharma. This excerpt is from a talk given in Awakening the […]",
            "length": "16101569",
            "sourceUrl": "http://media.blubrry.com/dharma_ocean/s3.amazonaws.com/DOPodcast/Pcast-232-Heart-of-Awakening-Part-II.mp3",
            "categories": [
                "Podcast",
                "Uncategorized"
            ]
        },
        {
            "title": "Episode 231: Heart of Awakening – Part I",
            "datePublished": "Fri, 14 Sep 2018 19:00:10 +0000",
            "description": "In the first part of this talk on the experience of bodhicitta as related to trauma, Reggie tells the story of how the Buddha’s experience unfolded on the night of his enlightenment, and describes his ultimate realization of Life in its totality. This excerpt is from a talk given in Awakening the Heart: A Somatic […]",
            "length": "17980480",
            "sourceUrl": "http://media.blubrry.com/dharma_ocean/s3.amazonaws.com/DOPodcast/Pcast-231-Heart-of-Awakening-Part-I.mp3",
            "categories": [
                "Podcast",
                "Uncategorized"
            ]
        },
        {
            "title": "Episode 230: A Living Lineage",
            "datePublished": "Tue, 04 Sep 2018 21:42:12 +0000",
            "description": "As a scholar of the history of religions, Reggie has a unique perspective on the way spirituality becomes codified by religious institutions. In this talk, he describes the historical development of orthodox structures in conventional Buddhism and discusses how the tradition is evolving as a living force in the modern world. This talk is excerpted […]",
            "length": "17776949",
            "sourceUrl": "http://media.blubrry.com/dharma_ocean/s3.amazonaws.com/DOPodcast/Pcast-230-A-Living-Lineage.mp3",
            "categories": [
                "Podcast",
                "Uncategorized"
            ]
        },
        {
            "title": "Episode 229: Esoteric Tradition of the Body",
            "datePublished": "Sat, 01 Sep 2018 01:23:52 +0000",
            "description": "Reggie comments on the tradition of Vajrayana meditation that he was trained in by his teacher, Chögyam Trungpa. He says that, even though the teachings of the practicing lineage are widely offered, few people choose to make the full tantric journey. This talk is excerpted from Reggie’s online course, Awakening the Body: The Way of […]",
            "length": "18175555",
            "sourceUrl": "http://media.blubrry.com/dharma_ocean/s3.amazonaws.com/DOPodcast/Pcast-229-Esoteric-Tradition-of-the-Body.mp3",
            "categories": [
                "Podcast",
                "Uncategorized"
            ]
        },
        {
            "title": "Episode 228: Karma and the Body – Part II",
            "datePublished": "Fri, 24 Aug 2018 11:00:22 +0000",
            "description": "In the second part of this talk on karma and the body, Reggie describes how the ego freezes the natural flow of experience in the body through physical tensing. This tension is stored in our cells as condensed karma. This excerpt is taken from Meditating with the Body, a 5-month training program that included two […]",
            "length": "19152833",
            "sourceUrl": "http://media.blubrry.com/dharma_ocean/s3.amazonaws.com/DOPodcast/Pcast-228-Karma-and-the-Body-Part-II.mp3",
            "categories": [
                "Podcast",
                "Uncategorized"
            ]
        },
        {
            "title": "Episode 227: Karma and the Body – Part I",
            "datePublished": "Mon, 20 Aug 2018 11:00:32 +0000",
            "description": "In this talk, Reggie describes how traditional Buddhist teachings on karma relate to the process of liberation that unfolds in somatic meditation. The wisdom of the body, he says, leads us back to the natural state. This excerpt is taken from Meditating with the Body, a 5-month training program that included two residential retreats and […]",
            "length": "15555136",
            "sourceUrl": "http://media.blubrry.com/dharma_ocean/s3.amazonaws.com/DOPodcast/Pcast-227-Karma-and-the-Body-Part-I.mp3",
            "categories": [
                "Podcast",
                "Uncategorized"
            ]
        },
        {
            "title": "Episode 226: Interconnection",
            "datePublished": "Fri, 17 Aug 2018 19:08:05 +0000",
            "description": "In this talk, Reggie reflects on the joyful experience of interconnection we feel when we practice tonglen in an embodied way. In resting with the space of the earth, compassion emerges, and our connection with others becomes apparent. This talk was given at the 2007 Advanced Meditating with the Body retreat held in Crestone, CO.",
            "length": "17587252",
            "sourceUrl": "http://media.blubrry.com/dharma_ocean/s3.amazonaws.com/DOPodcast/Pcast-226-Interconnection.mp3",
            "categories": [
                "Podcast",
                "Uncategorized"
            ]
        }
    ]
}