{
    "artwork": "http://is4.mzstatic.com/image/thumb/Music111/v4/3d/27/4a/3d274a51-00a9-0c7c-0850-4d1084d75641/source/100x100bb.jpg",
    "description": "Dr. Henry Cloud’s Leadership University Podcast is a podcast designed to help you learn how to leverage influence, maximize potential, and enhance opportunities in your personal and professional life. Each episode features a leadership lesson from Dr. Henry Cloud and an interview with top business leaders such as Ken Blanchard, Maria Shriver, Chris McChesney (Franklin Covey), Josh Ellis (SUCCESS Magazine), and many more. Our goal: To help you develop and nurture the qualities you need to become a successful leader at work and at home. For podcast show notes and additional resources to grow your leadership skills, visit www.drcloud.com.",
    "feedURL": "http://feeds.feedburner.com/LeadershipUniversityPodcast",
    "podcastURL": "http://www.drcloud.com",
    "publisher": "Info@DrCloud.com (Dr. Henry Cloud)",
    "title": "Dr. Henry Cloud's Leadership University Podcast",
    "episodes": [
        {
            "title": "Blake Canterbury - Changing The Way People Help Their Community",
            "datePublished": "Mon, 19 Oct 2020 21:08:41 +0000",
            "description": "<p>In this episode hosts LoriAnn Lowery-Biggers and Dr. Henry Cloud welcome Blake Canterbury to The Leader's Panel. Blake is the founder of Purposity, a new app designed to make charity more effective and local. Blake talks to the panel about the troubles he saw with other forms of charity, like crowd-sourcing, where people were getting taken advantage of. Purposity is different. They use schools and social workers to post needs to the app. You can find out more about this amazing app at www.purposity.com</p>",
            "length": "42505302",
            "sourceUrl": "https://traffic.libsyn.com/secure/leadershipuniversity/Blake_Canterbury_02.mp3?dest-id=428086"
        },
        {
            "title": "Harvey Kanter - Being Comfortable Being Uncomfortable",
            "datePublished": "Tue, 14 Jul 2020 09:00:00 +0000",
            "description": "<p>In this episode hosts LoriAnn Lowery-Biggers and Dr. Henry Cloud welcome Harvey Kanter to The Leader's Panel. Harvey is an author, and career business leader. He is currently the CEO of Destination XL, a leading retailer in the big and tall clothing sector, specializing in designer clothes. He's also the author of Choosing To Lead, and shares some of his key insights with us, like the importance of speed when making decisions, and how to get comfortable being in uncomfortable situations. </p>",
            "length": "38819063",
            "sourceUrl": "https://traffic.libsyn.com/secure/leadershipuniversity/Leaders_Panel_-_Harvey_Kanter_-_Final_01.mp3?dest-id=428086"
        },
        {
            "title": "Joel Manby - Work Culture Isn't Words On A Plaque",
            "datePublished": "Tue, 09 Jun 2020 07:00:00 +0000",
            "description": "<p>In this episode hosts LoriAnn Lowery-Biggers and Dr. Henry Cloud welcome Joel Manby to The Leader's Panel. Joel is a graduate of Harvard Business School, the former CEO of Seaworld, and the former president and CEO of Herschend Family Entertainment, the largest family owned theme park company in the US. He's here to talk about his new book <em>Love Works</em>  about bringing something that we rarely consider when we think of our work culture: treating people with love. We hope you enjoy this discussion as much as we did. </p>",
            "length": "37258336",
            "sourceUrl": "https://traffic.libsyn.com/secure/leadershipuniversity/The_Leaders_Panel_-_Joel_Manby.mp3?dest-id=428086"
        },
        {
            "title": "Joel Peterson - Leaders Run Toward The Fire",
            "datePublished": "Tue, 05 May 2020 09:06:15 +0000",
            "description": "<p>In this episode of the Leader's Panel, hosts Dr. Henry Cloud and LoriAnn Lowery-Biggers are joined by Joel Peterson to discuss how leaders work in a crisis, and what real listening is between co-workers, amongst many other topics. Mr. Peterson is the Chairman of JetBlue Airways, the founder of Peterson Partners with over $1 billion under investment, and a professor at Stanford's Graduate School of Business.</p>",
            "length": "31015649",
            "sourceUrl": "https://traffic.libsyn.com/secure/leadershipuniversity/Joel_Peterson_Edit_002_-_Leaders_Panel.mp3?dest-id=428086"
        },
        {
            "title": "Putting Relationships First in Business, Part 2",
            "datePublished": "Fri, 13 Mar 2020 01:19:37 +0000",
            "description": "<p>Part 2 of our conversation with Jack Hollis. </p>",
            "length": "30346023",
            "sourceUrl": "https://traffic.libsyn.com/secure/leadershipuniversity/JACK_HOLLIS_P2.mp3?dest-id=428086"
        },
        {
            "title": "Jack Hollis: Putting Relationships First in Business, Part 1 ",
            "datePublished": "Mon, 09 Dec 2019 17:21:57 +0000",
            "description": "<p class=\"p1\"><span class=\"s1\"><strong>Jack Hollis</strong></span><span class=\"s2\"> is group vice president and general manager of the Toyota Division at Toyota Motor North America, and in this episode of The Leader’s Panel, he tells us about the importance putting relationships first and focusing on the “human” side of business.</span></p>",
            "length": "42072447",
            "sourceUrl": "https://traffic.libsyn.com/secure/leadershipuniversity/Jack_Hollis_Putting_Relationships_First_In_Business_Part_1.mp3?dest-id=428086"
        },
        {
            "title": "Christina Hovestadt: Being a Female Role Model in the NFL  ",
            "datePublished": "Mon, 21 Oct 2019 18:48:20 +0000",
            "description": "<p class=\"p1\">In this episode of The Leader’s Panel, Christina Hovestadt discusses the journey that led her to the NFL and shares with us the principles that allowed her to persevere as a role model within one of the most recognized sports brands in the world.</p>",
            "length": "31605140",
            "sourceUrl": "https://traffic.libsyn.com/secure/leadershipuniversity/Christina_Hovestadt_Being_A_Female_Role_Model_in_the_NFL_.mp3?dest-id=428086"
        },
        {
            "title": "Jia Jiang: Overcoming the Fear of Rejection — S02:EP1",
            "datePublished": "Thu, 12 Sep 2019 18:53:41 +0000",
            "description": "<p class=\"p1\">Jia Jiang joins The Leader’s Panel to talk about his journey to overcome the fear of rejection by intentionally putting himself in situations where “no” would have been the default answer, but to his surprise, the more asks he made, the more likely others said yes.</p>",
            "length": "32574397",
            "sourceUrl": "https://traffic.libsyn.com/secure/leadershipuniversity/Jia_Jiang_Overcoming_Fear_Of_Rejection_S02_EP1.mp3?dest-id=428086"
        },
        {
            "title": "The Leader's Panel – A Season 2 Introduction ",
            "datePublished": "Wed, 27 Feb 2019 22:39:22 +0000",
            "description": "<p>The Leader's Panel host Jennifer Laine explains the inspiration behind a revamped podcast featuring the expertise Dr. Henry Cloud. </p>",
            "length": "2370048",
            "sourceUrl": "https://traffic.libsyn.com/secure/leadershipuniversity/The_Leaders_Panel_Trailer.mp3?dest-id=428086"
        },
        {
            "title": "Emily Esfahani Smith: How to Craft a Life that Matters – S01: EP18",
            "datePublished": "Tue, 22 Aug 2017 12:13:22 +0000",
            "description": "<p>Emily Esfahani Smith talks to us about the difference between finding happiness in your life versus having meaning in your life – where do we get it, why we can’t find it, and what composes the ingredients of meeting.</p>",
            "length": "31402061",
            "sourceUrl": "https://traffic.libsyn.com/secure/leadershipuniversity/Emily_Esfahani_Smith_How_to_Craft_a_Life_that_Matters_LDU_032.mp3?dest-id=428086"
        },
        {
            "title": "Henry Cloud: How We Grow in Our Professional Lives – S01: EP17",
            "datePublished": "Tue, 08 Aug 2017 04:27:42 +0000",
            "description": "<p>Dr. Henry Cloud talks about the ingredients that foster a thriving work environment. First, we have to consider how the brain functions. How does someone receive information when it’s coming from you? It’s not just about setting expectations and giving feedback, expecting to see results, but leaders need to take the time to think about how those expectations are set and how feedback is delivered.</p>",
            "length": "36423875",
            "sourceUrl": "https://traffic.libsyn.com/secure/leadershipuniversity/henry_cloud_how_we_grow_in_our_professional_lives_032_lead_u.mp3?dest-id=428086"
        },
        {
            "title": "Brad Stulberg: The Scientific and Practical Principles for Achieving Peak Performance – S01: EP16",
            "datePublished": "Tue, 25 Jul 2017 14:28:06 +0000",
            "description": "<p>Brad Stulberg expands upon the scientific and practical formulas that achieve peak performance. He tells us that the mastery behind personal and professional gains can be achieved by anyone because it comes down to understanding that the purpose for what anyone does has to be more powerful than themselves.</p>",
            "length": "31090264",
            "sourceUrl": "https://traffic.libsyn.com/secure/leadershipuniversity/brad_stulberg_the_scientific_and_practica_principles_for_achieving_peak_performance_031_lead_u.mp3?dest-id=428086"
        },
        {
            "title": "Jason Fried: How to Promote a Company Culture that Keeps Employees Engaged – S01: EP15",
            "datePublished": "Tue, 11 Jul 2017 08:14:59 +0000",
            "description": "",
            "length": "35998437",
            "sourceUrl": "https://traffic.libsyn.com/secure/leadershipuniversity/Jason_Fried_how_to_promote_a_company_culture_that_keeps_employees_engaged_ldu_030.mp3?dest-id=428086"
        },
        {
            "title": "Frans Johansson: How Intersectional Thinking Harnesses the Collective Power of Creativity – S01: EP14",
            "datePublished": "Thu, 18 May 2017 04:29:40 +0000",
            "description": "<p>Frans Johansson talks to Jennifer and Greg about leveraging the Medici Effect, a place where intersectional ideas come together from diverse industries and cultures to create undiscovered innovations. He emphasizes how these unique ideas come to fruition and tells us how to make these breakthrough discoveries. Dr. Henry Cloud elaborates on how creativity works in the brain and what you can do to uncap it.</p>",
            "length": "190389168",
            "sourceUrl": "https://traffic.libsyn.com/secure/leadershipuniversity/Frans_Johansson_How_Intersectional_Thinking_Harnesses_the_Collective_Power_of_Creativity_024_Lead_U_.mp3?dest-id=428086"
        },
        {
            "title": "Liz Wiseman: How to Lead like a Multiplier in Your Organization – S01: EP13",
            "datePublished": "Tue, 02 May 2017 16:08:13 +0000",
            "description": "<p>How does a leader have a multiplying or diminishing effect on their team? Liz Wiseman talks to Jennifer and Greg about the traits, characteristics and culture it takes for a leader to maximize talents and competencies among their organization in the midst of challenges and obstacles.</p>",
            "length": "87998306",
            "sourceUrl": "https://traffic.libsyn.com/secure/leadershipuniversity/Liz_Wiseman_How_to_Lead_Like_a_Multiplier_in_Your_Organization_023_Lead_U.mp3?dest-id=428086"
        },
        {
            "title": "Dr. Henry Cloud: How Emotional Culture Affects Others and Drives Performance – S01: EP12",
            "datePublished": "Tue, 21 Mar 2017 14:45:54 +0000",
            "description": "<p style= \"line-height: 19.5pt; vertical-align: baseline; margin: 11.25pt 0in 11.25pt 0in;\"> <span style= \"font-size: 13.5pt; font-family: Helvetica; color: #595959;\">It’s important to come to terms with the fact that when we show up to work, we’re still people. If you consider yourself the type who only cares about results, you need to come to terms with the fact that you’re not going to get what you want if you don’t take others’ emotions into consideration.</span></p>",
            "length": "61608758",
            "sourceUrl": "https://traffic.libsyn.com/secure/leadershipuniversity/How_Emotional_Culture_Affects_Others_and_Drives_Performance_LDU_020.mp3?dest-id=428086"
        },
        {
            "title": "Kat Popiel: How to Take Risks When You Don’t Have all the Answers – S01: EP11",
            "datePublished": "Tue, 07 Mar 2017 16:26:12 +0000",
            "description": "<p>Henry, Greg and Jennifer sit down with Kat Popiel to talk about taking risks while being humble enough to admit that you don’t have all the answers, yet having the willingness and energy to try. Kat tells us how to think about new ideas and why it’s ok to be comfortable with failure. </p>",
            "length": "68228699",
            "sourceUrl": "https://traffic.libsyn.com/secure/leadershipuniversity/Kat_Popeil_How_to_Take_Risks_When_You_Dont_Have_All_the_Answers_019_Lead_U.mp3?dest-id=428086"
        },
        {
            "title": "Rorke Denver: What it Takes to Lead Special Forces as a Navy Seal – S01: EP10",
            "datePublished": "Tue, 21 Feb 2017 08:20:12 +0000",
            "description": "<p> </p> <p>Rorke Denver is a Navy Seal who has led special forces all over the world. He’s written about his experiences in two books and has been featured in movies about his life serving our country. Dr. Henry Cloud ties in a lesson from The Power of the Other.</p>",
            "length": "105588246",
            "sourceUrl": "https://traffic.libsyn.com/secure/leadershipuniversity/Rorke_Denver_What_it_Takes_to_Lead_Special_Forces_as_a_Navy_Seal_018_Lead_U.mp3?dest-id=428086"
        },
        {
            "title": "Henry Cloud: Stop Wasting Your Time and Take Back Control – S01: EP09",
            "datePublished": "Tue, 31 Jan 2017 06:37:26 +0000",
            "description": "<p>What takes your attention that really moves the needle, and what is a waste of time? It all boils down to where your energy goes. In this episode, Henry, Jennifer and Greg discuss the way the mind works when it comes to time management, while proving that the concept of multitasking is actually a myth.</p>",
            "length": "55548478",
            "sourceUrl": "https://traffic.libsyn.com/secure/leadershipuniversity/Henry_Cloud_Stop_Wasting_Your_Time_And_Take_Back_Control_016_Lead_U.mp3?dest-id=428086"
        },
        {
            "title": "Jesse Itzler: The Leader’s Attention – When to Say No and Know When to Commit – S01: EP08",
            "datePublished": "Tue, 17 Jan 2017 07:03:26 +0000",
            "description": "<p>Jesse Itzler talks about why he’s never done setting goals and how he only gives time to the opportunities that will further his personal development. Dr. Henry Cloud tells us how a leader functions at their highest capacity when they focus on what will ultimately further their mission.</p>",
            "length": "70239735",
            "sourceUrl": "https://traffic.libsyn.com/secure/leadershipuniversity/Jesse_Itzler_The_Leaders_Attention_When_to_Say_No_and_Know_When_To_Commit_014_Lead_Ul.mp3?dest-id=428086"
        },
        {
            "title": "Patrick Lencioni: Why You’re Never Done Growing as a Leader – S01: EP07",
            "datePublished": "Tue, 10 Jan 2017 05:11:37 +0000",
            "description": "<p>In this episode of the podcast, Dr. Henry Cloud talks to Patrick Lencioni about leaders remaining humble, hungry and self-aware as they strive to be high producers who want to see growth within themselves and among their teams.</p>",
            "length": "54826003",
            "sourceUrl": "https://traffic.libsyn.com/secure/leadershipuniversity/Why_Youre_Never_Done_Growing_as_a_Leader_featuring_Patrick_Lencioni_013_Lead_U.mp3?dest-id=428086"
        },
        {
            "title": "Amy Morin: 13 Things Mentally Strong People Don’t Do and the Secret of Improvement – S01: EP06",
            "datePublished": "Tue, 29 Nov 2016 04:51:02 +0000",
            "description": "<p>Amy Morin goes over the 13 things that mentally strong people don’t do and what inspired her to write an article that helped more than 30 million people. Plus, Dr. Henry Cloud breaks down the secrets behind the sustainability of improvement.</p>",
            "length": "59998504",
            "sourceUrl": "https://traffic.libsyn.com/secure/leadershipuniversity/13_Things_Mentally_Strong_People_Dont_Do_and_the_Secret_of_Improvement_with_Amy_Morin_009__Lead_U_.mp3?dest-id=428086"
        },
        {
            "title": "Liz Wiseman: Maximizing Results from Your Team with  – S01: EP05",
            "datePublished": "Tue, 08 Nov 2016 17:30:33 +0000",
            "description": "<p>Liz Wiseman shares her insight on what leaders need to do to get the desirable results from their teams and organizations. Dr. Henry Cloud elaborates on how we get in the way of the results we want to achieve.</p>",
            "length": "69955663",
            "sourceUrl": "https://traffic.libsyn.com/secure/leadershipuniversity/Getting_Results_From_Your_Team_with_Liz_Wiseman_006_Lead_U.mp3?dest-id=428086"
        },
        {
            "title": "Dr. Henry Cloud: The Wake You Leave Behind – S01: EP04",
            "datePublished": "Tue, 01 Nov 2016 14:10:47 +0000",
            "description": "<p>This week Dr. Henry Cloud talks about the wake of you leave in leadership between results and relationships. Plus, he answers your pressing questions about leadership.</p>",
            "length": "37654009",
            "sourceUrl": "https://traffic.libsyn.com/secure/leadershipuniversity/The_Wake_You_Leave_Behind_with_Dr_Henry_Cloud_005_Lead_U.mp3?dest-id=428086"
        },
        {
            "title": "Chris McChesney: Executing a Plan – S01: EP03",
            "datePublished": "Tue, 18 Oct 2016 04:53:04 +0000",
            "description": "<p>Chris McChesney talks to Jennifer and Chris about the four principles of executing a strategy. Plus, Dr. Henry Cloud tells us about the difference between a vision and a fantasy, and how leaders get results from their teams.</p>",
            "length": "53831934",
            "sourceUrl": "https://traffic.libsyn.com/secure/leadershipuniversity/HCLU_003_Executing__a_Plan_with_Chris_McChesney.mp3?dest-id=428086"
        },
        {
            "title": "SUCCESS Magazine: Vision and Engaging Talent – S01: EP02",
            "datePublished": "Tue, 11 Oct 2016 04:30:52 +0000",
            "description": "<p>In this episode, Jennifer Laine and Chris Mefford talk to Shelby Skrhak and Josh Ellis of Success Magazine. Dr. Henry Cloud weighs in on vision and engaging talent.</p>",
            "length": "67119421",
            "sourceUrl": "https://traffic.libsyn.com/secure/leadershipuniversity/HCLU_002_Vision_and_Engaging_Talent_SUCCESS_Magazine.mp3?dest-id=428086"
        },
        {
            "title": "Dr. Henry Cloud: What Is Leadership? – S01: EP01",
            "datePublished": "Tue, 04 Oct 2016 22:13:27 +0000",
            "description": "<p>Dr. Henry Cloud’s Leadership University is a podcast about leveraging your influence, maximizing your potential, and enhancing your opportunities in your personal and professional life. Our goal: To help you develop and nurture the qualities you need to become a better leader.</p>",
            "length": "49061590",
            "sourceUrl": "https://traffic.libsyn.com/secure/leadershipuniversity/HCLU_001_Henry_Cloud.mp3?dest-id=428086"
        }
    ]
}