{
    "artwork": "http://is4.mzstatic.com/image/thumb/Music71/v4/47/99/40/479940c7-0ad3-a8a3-da2f-8fc58d9ec1d9/source/100x100bb.jpg",
    "description": "The Drone Radio Show is a weekly show about drones and the people who use them for business, fun and research.  Our guests share how they’re using drones to make a positive impact, build a business, lessons they’ve learned and insights that you can use to take YOUR interest in drones to the next level.",
    "feedURL": "http://droneradioshow.libsyn.com/rss",
    "podcastURL": "http://droneradioshow.libsyn.com/podcast",
    "title": "Drone Radio Show",
    "episodes": [
        {
            "title": "Protecting the Sky with A.I. - Timothy Bean, CEO Fortem Technologies, Inc.",
            "datePublished": "Tue, 10 Nov 2020 07:00:00 +0000",
            "description": "<p style=\"text-align: center;\"><strong>Is it possible to stop a rogue drone in its tracks?</strong></p> <p>Timothy Bean is CEO of Fortem Technologies, a world leader in AI-enabled airspace security and safety. Most notably, the company excels in real-time intrusion detection. Through an advanced, end to end system of distributed radar, AI at the Edge, deep sensor integration, and autonomous drone capture, Fortem monitors and defends the world’s venues, infrastructures, cities, and regions. The same system is accelerating the safety of the world’s airspace for urban air mobility.</p> <p>Tim has more than 25 years of global executive experience successfully building businesses and technology startups in Silicon Valley.  He currently oversees the strategy for Fortem Technologies, and handles everything from product creation, through sales, to customer support. Before founding Fortem Technologies in 2016, Tim provided strategic oversight for all programs and services with global reseller partners in Japan and throughout the world.  He has a vast array of knowledge in sales and engineering, with specific expertise in cyber-defense and mission-critical infrastructure applications.</p> <p>In this edition of the Drone Radio Show, Tim talks about Fortem Technologies and its suite of products and services designed to make the skies safer from rogue drones.  He also discusses the current challenges in delivering such services and the outlook for the future.</p>",
            "length": "34459903",
            "sourceUrl": "http://traffic.libsyn.com/droneradioshow/DRS_294_Timothy_Bean_1.mp3?dest-id=276003"
        },
        {
            "title": "17 Ways Drones Are Used In Public Safety: Charles Werner, Drone Responders",
            "datePublished": "Tue, 03 Nov 2020 07:00:00 +0000",
            "description": "<p style=\"text-align: center;\"><strong>How are Drones Used in by Public Safety Organizations.</strong></p> <p>For that question, we turn to Charles Werner, Director of the Drone Responders Public Safety Alliance, a non-profit organization whose mission is to facilitate preparedness, response and resilience using unmanned aircraft systems operated by public safety organizations around the world.  Charles Werner is the retired Charlottesville Virginia fire chief, a 44 year veteran of public safety and a FAA certified Part 107 remote pilot. He organized and is the Chair of the National Council on Public Safety UAS. He also serves on several local, state and national  committees and has authored more than 120 published articles on public safety.  In 2020, the Airborne International Response Team and Drone Responders conducted a survey of public sector organizations on the use of drones in public safety.  That survey identified 17 different missions where drones were used to support public safety.  In this episode of the Drone Radio Show, Charles gives us an update on the Drone Responders and provides some insights into the survey results and the growth of drones in advancing the public safety use of drones.</p>",
            "length": "29048594",
            "sourceUrl": "http://traffic.libsyn.com/droneradioshow/DRS_292_Charles_Werner_2020.mp3?dest-id=276003"
        },
        {
            "title": "From Helicopters To Drones – The Successful Aerial Photography Career: Fiona Lake - Photographer",
            "datePublished": "Tue, 27 Oct 2020 06:00:00 +0000",
            "description": "<p style=\"text-align: center;\"><strong>How does one create a successful long-term career in aerial photography?</strong></p> <p>Fiona Lake is a professional photographer based in tropical North Queensland. Fiona has more than thirty years experience in agricultural photography, and has become Australia's most well-known outback photographer. She specializes in agriculture and the world’s largest cattle stations, and has taken aerial photographs from helicopters since 1988. </p> <p>Her multi-faceted business includes books, exhibitions and farm tours as well as commercial photography. Less than 2% of Australia's fully licensed drone pilots are women, and Fiona is one of them. She runs drone masterclasses across Australia and more recently, in the US. Her Rural Drone Academy covers everything a drone pilot needs to know to fly safely, legally, productively and enjoyably.  In 2018, Chicago-based 'Women and Drones' named her as a 'Woman to Watch in UAS', along with nine other women from seven different countries.   In 2020, she was winner of the International Federation of Agricultural Journalist’s Photography Award.  She has also been recognized by the Queensland Government as a Community Digital Champion and one of the 100 Faces of Small Business</p> <p>In this edition of the Drone Radio Show, Fiona talks about helicopter and drone aerial photography, what to look for in a drone training program, and she offers insights into a variety of aerial photography questions, most importantly, how one can develop a successful, long-term career in photography. </p>",
            "length": "38323510",
            "sourceUrl": "http://traffic.libsyn.com/droneradioshow/DRS_291_Fiona_Lake.mp3?dest-id=276003"
        },
        {
            "title": "Public Attitudes Towards Transport Drones: Robin Kellermann, Sky Limits",
            "datePublished": "Tue, 20 Oct 2020 06:00:00 +0000",
            "description": "<p style=\"text-align: center;\"><strong>Will People Accept Drones to Transport Cargo or Passengers?</strong></p> <p>Robin Kellermann is the coordinator for Sky Limits, a 2-year project, sponsored by the Technical University of Berlin and the Wissenchaft Im Dialog. The project is short for The Sky is the Limits, and considers the opportunities and challenges that come with opening up urban airspaces to cargo and passenger transport by new technologies such as drones.</p> <p>Robin has a PhD and lectures at the Technical University Berlin working in the fields of transport and mobility research with a focus on sociotechnical and cultural historical perspectives. He has a background in cultural studies and historical urban studies. He has collaborated in a series of European and domestic research projects ranging from public acceptance of digital technologies in public transportation to long-term scenario developments for the European transport industries. Sky Limits recently completed survey of German resident’s views on allowing drones to transport packages, cargo and people.  While the survey paints a picture of German attitudes towards drones in the air space, it can provide valuable insights into people’s potential views worldwide.</p> <p>In this edition of the Drone Radio Show, Robin talks about the Sky Limits project, the survey and he provides insights into people’s level of acceptance of drones into the airspace.</p>",
            "length": "31102871",
            "sourceUrl": "http://traffic.libsyn.com/droneradioshow/DRS_290_Robin_Kellermann.mp3?dest-id=276003"
        },
        {
            "title": "Virtual Drone Conferences: Lessons Learned from the Commercial UAV Expo 2020.: Linda McLaughlin, Diversified Communications",
            "datePublished": "Tue, 13 Oct 2020 06:00:00 +0000",
            "description": "<p>Linda McLaughlin is Conference Program Manager at Diversified Communications, an international media company with more than 15 years’ experience in producing world-renowned events for precision measurement professionals.  If you’re in this field, then you have most likely have attended one of their events, including SPAR 3D Conference & Expo, the International Lidar Mapping Forum or the Commercial UAV Expo.</p> <p>In 2020, as a result of the Covid-19 pandemic, Diversified launched a virtual version of its successful Commercial UAV Expo.  In this edition of the Drone Radio Show, Linda provides insights into this year’s event, some of the topics that were covered, and a few lessons learned from the online event.</p> <p> </p>",
            "length": "15436507",
            "sourceUrl": "http://traffic.libsyn.com/droneradioshow/DRS_289_Linda_McLaughlin_.mp3?dest-id=276003"
        },
        {
            "title": "Scaling Autonomous Drone Operations: Richard Parker, CEO Altitude Angel",
            "datePublished": "Tue, 06 Oct 2020 06:00:00 +0000",
            "description": "<p style=\"text-align: center;\"><strong>How far are we from seeing truly autonomous dron operations.</strong></p> <p>If you asked to today’s guest, he might say we’re only months away.  Richard Parker is Founder and Chief Executive Officer of Altitude Angel, the world’s leading UTM and U-Space technology provider, delivering solutions enabling the safe integration of drones into airspace.</p> <p>Altitude Angel’s platform provides data and services to established airspace management organisations as well as drone manufacturers and software developers.  Its solutions are accelerating the realisation of both the social and economic values which drones bring.</p> <p>Richard’s diverse experience across a range of vert icals, coupled with a strong background in software design, technology and cybersecurity ensures Altitude Angel continues to drive innovation in the emerging UTM sector.</p> <p>In 2020, the company was authorized to create the world’s first commercial ‘super-highway’ drone corridor in open and unrestricted airspace. The corridor will support fully automated drone flights beyond visual line-of-sight from any drone company.</p> <p>In this episode of the Drone Radio Show podcast, Richard talks about Altitude Angel, the Arrow Drone Zone, and how it will help to safely scale autonomous drone flights.</p>",
            "length": "31396689",
            "sourceUrl": "http://traffic.libsyn.com/droneradioshow/DRS_288_Richard_Parker.mp3?dest-id=276003"
        },
        {
            "title": "Public Safety Drones, Trends and Mosquitos: Romeo Durscher, DJI",
            "datePublished": "Tue, 29 Sep 2020 06:00:00 +0000",
            "description": "<p style=\"text-align: center;\"><strong>Are you ready for a drone industry update?</strong></p> <p>Romeo Durscher is Director of Public Safety Integration at DJI, the world’s leading maker of civilian drones and aerial imaging technology. Born and raised in Switzerland, Romeo came to DJI after 13 years at NASA’s Solar Dynamics Observatory. As part of his work advising first responders and humanitarian organizations, Romeo has actively participated in drone missions for search and rescue operations, natural disasters, live-fire training exercises. He leads DJI’s partnership with the European Emergency Number Association (EENA), which has developed protocols for public safety officials to integrate drones into their work. Commercial UAV News named Romeo one of the 25 most influential people in the commercial drone industry, as well as one of the top 7 drone visionaries in emergency response & public safety. Romeo has appeared in media forums from ABC’s Good Morning America to Wired magazine.</p> <p>In this episode of the Drone Radio Show, Romeo talks about drones in public safety, current trends in the industry, a DJI product update and how drones helping to combat mosquito borne diseases.</p>",
            "length": "41510047",
            "sourceUrl": "http://traffic.libsyn.com/droneradioshow/DRS_287_Romeo_Durscher.mp3?dest-id=276003"
        },
        {
            "title": "Innovating With Drones to Save Lives: Desiree Matel-Anderson, Chief Wrangler at Field Innovation Team",
            "datePublished": "Tue, 22 Sep 2020 06:00:00 +0000",
            "description": "<p style=\"text-align: center;\"><strong>How can we become better innovators in the drone industry?</strong></p> <p>For that question, we turn to Desiree Matel-Anderson, Chief Wrangler of Field Innovation Team and CEO of the Global Disaster Innovation Group.  Desi is the first and former Chief Innovation Advisor at FEMA and Think Tank Strategic Vision Coordinator. During her tenure at FEMA, she led the first innovation team down to Hurricane Sandy to provide real-time problem solving in disaster response and recovery and ran think tanks nation-wide to cultivate innovation in communities. Her emergency management experience began when she volunteered in Northern Illinois University’s Office of Emergency Planning. She then worked with the Southeast Wisconsin Urban Area Security Initiative, and the City of Milwaukee Homeland Security and Emergency Management Office. In addition to her regional emergency management duties, she worked as an assessor of the Emergency Management Accreditation Program Assessor nation-wide.  She has since worked on numerous emergency management projects with agencies, communities, organizations and companies. </p> <p>In this episode of the Drone Radio show, Desi talks about the Field Innovation Team and Global Disaster Innovation Group, how drones are used to solve challenging problems in real time situations, her new book, called Future Survivor, and how we can become better at creating innovative response to our communities challenges. </p>",
            "length": "35443815",
            "sourceUrl": "http://traffic.libsyn.com/droneradioshow/DRS_286_Desiree_Matel-Anderson.mp3?dest-id=276003"
        },
        {
            "title": "Autonomous Drones In Urban Environments: Ran Krauss, CEO Airobotics",
            "datePublished": "Tue, 15 Sep 2020 06:00:00 +0000",
            "description": "<p style=\"text-align: center;\"><strong>What Role Can Autonomous Drones Play in Major Cities?</strong></p> <p>Ran Krauss is CEO and Co-Founder of Airobotics, a global leader in fully automated industrial drones. The company has developed a pilotless drone solution, the first of its kind in the global market. Its industrial grade platform is available on-site and on-demand, enabling industrial facilities to access premium aerial data in a faster, safer, more efficient way.  In May, the company received the world’s first approval to fly over a major metropolis. The Home Team Science and Technology Agency of Singapore will use Airobotic’s cutting edge drone technology to augment Singapore’s Police Force by providing real-time aerial data delivered by automated drone technology.</p> <p>Ran is a leader and an influencer in the drone industry, working at the intersection of robotics, practical aviation and drone flight. He is the first licensed commercial UAV pilot in Israel, having assisted the Civil Aviation Authority in Israel to establish regulation for commercial UAV operation. Ran previously co-founded two successful drone companies: ParaZero, which builds ballistic parachutes for drones, and Bladeworx, the first company to receive a commercial UAS operator license from the Israeli Civil Aviation Authority.  In this episode of the Drone Radio Show, Ran talks about Airobotics, the opportunity that autonomous drone solutions deliver and the challenges of providing such solutions in urban environments.</p>",
            "length": "26290047",
            "sourceUrl": "http://traffic.libsyn.com/droneradioshow/DRS_285_Ran_Krauss.mp3?dest-id=276003"
        },
        {
            "title": "How The Snot Bot Opened the Door To Democratizing Data in Ocean Research: Dr. Iain Kerr,  CEO Ocean Alliance",
            "datePublished": "Tue, 08 Sep 2020 06:00:00 +0000",
            "description": "<p style=\"text-align: center;\"><strong>Can Drones Democratize Research and Data Collection of our Oceans?</strong></p> <p>Dr. Iain Kerr is CEO of Ocean Alliance, a non-profit organization with a mission to protect whales and their ocean environment through research, scientific collaboration, public education, and the arts.  For almost 40 years, Ocean Alliance has made a positive difference in this world. Their staff works to carry out its mission with scientific integrity to help protect and preserve the marine environment on which the lives of all of us, people as well as whales, are utterly dependent.</p> <p> </p> <p>Iain began his career at Ocean Alliance as a volunteer and has grown with the organization over the last 30 years. He is listed as author on over 35 scientific papers and has ensured that Ocean Alliance messages reach the general public through international television and films. Iain has led international conservation research efforts across the globe. As a result of exposing illegal sea cucumber fishing in the Galapagos, Iain received the SOS Grand Blue award in 1994. He was awarded the Chevron Conservation Award in 2006 and in 2014 the Annenberg Foundation listed Iain as one of 25 visionary leaders.</p> <p>In 2013, Iain recognized that drones could be the future of whale research and conservation. During an attempt to collect samples from a whale, he was sprayed by whale’s blow hole. This chance encounter set him on a quest to develop a way that a drone collect whale samples expended through their blow holes.  This ultimately let to the creation of the Snot Bot and a opened the door to a new type of whale research, one that democratizes data, enabling groups throughout the world to conduct research and collect data on marine mammals that they would not be able to do using expensive research vessels.</p> <p>In this edition of the Drone Radio Show, Iain talks about Ocean Alliance, the evolution of the Snot Bot and how drones can spur more research of our oceans, which ultimately impacts the entire ecosystem of the world.</p>",
            "length": "48740705",
            "sourceUrl": "http://traffic.libsyn.com/droneradioshow/DRS_284_Iain_Kerr.mp3?dest-id=276003"
        },
        {
            "title": "The Logistics of Delivering Medical Supplies Via Drones: Pharns Genece, USOG",
            "datePublished": "Tue, 01 Sep 2020 06:00:00 +0000",
            "description": "<p style=\"text-align: center;\"><strong>What do we need to know to deliver medical supplies via drones?</strong></p> <p>Pharns Genece is CEO and Founder of Unmanned Systems Operation Group, a pioneering logistics solutions company specializing in unmanned systems and secure drone delivery missions.  The company’s autonomous systems are integrated with a next-generation electric delivery truck, which features a control center for an unmanned aerial vehicle operator and an auto-launch and recovery system located on the vehicle’s rooftop.  Pharns is a former US Air Force Medevac with 18 years’ experience as a highly trained flight nurse, certified to administer critical and emergency care for patients during flight rescue operations. </p> <p>Formerly an Audio Engineer and Technical Lead at The Walt Disney Company in Anaheim, CA. Pharns' interest in Unmanned Aerial Vehicles goes back many years.  He has integrated and flown numerous UAV platforms.  He is a graduate of the MiraCosta College UAV/ROV Operators and Technicians program, an FAA Part 107 Remote Pilot, holds an FAA Daylight Waiver for night operations, and is a TOP Certified Pilot and a member of the FAA Safety Team.  Phans has combined his medical and technical skills with a passion for UAVs and founded Unmanned Systems Operations Group. The company recently embarked a pilot project to deliver prescriptions from a pharmacy to customer’s at home.</p> <p>In this episode of the Drone Radio Show, Pharns talks about Unmanned Systems Operation Group, the exciting new drone delivery pilot project and the future of drone delivery.</p>",
            "length": "32002307",
            "sourceUrl": "http://traffic.libsyn.com/droneradioshow/DRS_283_Pharns_Genece.mp3?dest-id=276003"
        },
        {
            "title": "Scaling Up for Unmanned Traffic Management: Amit Ganjoo, Anra Technologies",
            "datePublished": "Tue, 25 Aug 2020 06:00:00 +0000",
            "description": "<p style=\"text-align: center;\"><strong>What’s Involved With Scaling Up Unmanned Traffic Management sSstems?</strong></p> <p>Amit Ganjoo is Founder & CEO of Washington DC based ANRA Technologies, an award winning drone operations and UAS Traffic Management platform.  It’s one thing to develop a UTM system to track a few drones, but it’s a much different challenge when the number of drones climb into the hundreds and even thousands.  Anra’s UTM and Mission Management system is designed to meet this challenge and is used by commercial and government entities for managing commercial drone operations at scale. </p> <p>Amit has over 20 years of aviation, telecom and wireless experience in both the federal and the commercial space. He is an engineer and a licensed pilot pursuing his lifelong passion in aviation by building and flying experimental aircraft.</p> <p>As part of his pursuit to efficiently integrate drones into the airspace, Amit is a board member of the Global UTM Association that supports the accelerated and transparent implementation of globally interoperable UTM systems. He is also a member of FAA’s Drone Advisory Committee working group for UTM.</p> <p>Prior to founding ANRA Technologies, Amit was co-chair for the FCC Technical Advisory Council (TAC) for 5G and IoT, which included ground and airborne autonomous vehicles. He was the Director of Engineering and Principal Architect at Ericsson, providing telecom solutions to commercial customers and the Federal Government, where he was the recipient of the Athena Award.</p> <p>Amit is an adjunct professor at George Mason University School of Engineering and volunteers at a local Maker Space in the D.C. area. He holds a master’s degree in Computer Science and Civil Engineering from Iowa State University and a Bachelor of Engineering from Punjab Engineering College.</p> <p>In this edition of the Drone Radio Show, Amit talks about Anra Technologies’ UTM and Mission Management system, how it can help enterprise companies safely and efficiently scale operations and the future of unmanned traffic management.</p> <p> </p>",
            "length": "23385235",
            "sourceUrl": "http://traffic.libsyn.com/droneradioshow/DRS_282_Amit_Ganjoo.mp3?dest-id=276003"
        },
        {
            "title": "Growing Your Brand In the Drone Industry: Desi Ekstein, On The Go Video",
            "datePublished": "Tue, 18 Aug 2020 06:00:00 +0000",
            "description": "<p style=\"text-align: center;\"><strong>What’s it Take to Grow Your Brand in the Drone Industry?</strong></p> <p>Desi Ekstein is founder of “On The Go Video.biz”, a drone services provider and educator for the UAS industry since 2015. On the To Video provides consulting, training, and safety education services. </p> <p>I interviewed Desi five years ago, when she had just entered the drone industry.  At that time, her passion for drones earned her the nickname, “Drone Diva Desi”.  And over the years, that passion has continued to drive her forward.  Since 2015, her list of accomplishments is impressive. </p> <p>Desi is one of the first women to obtain an FAA Certified 107 Remote Pilot certificate and a member of the FAA Wings program.  She is a graduate of the Gold Seal UAV Ground School, a Lead FAASTeam Representative Drone Pro in San Diego, an AUVSI San Diego Board member, and a AUVSI TOP Level 3 pilot. She is an UAS Operations instructor at TCI MiraCosta College and has a night endorsement. Desi is involved with several STEM and STEAM outreach programs such as, the Elementary Science Institute “Girls Take Flight” program for young women. She is also an advisor to Women and Drones.</p> <p>In this edition of the Drone Radio Show, Desi traces her path from part-time hobbyist to full-time commercial drone operator and educator.  She shares her experiences, provides some advice and lessons learn and shows that anyone with a passion and time, can establish a successful presence in the drone industry.</p>",
            "length": "31215704",
            "sourceUrl": "http://traffic.libsyn.com/droneradioshow/DRS_281_Desi_Eckstein.mp3?dest-id=276003"
        },
        {
            "title": "How a STEAM Education Program Links Youth to Careers in the Drone Industry: Jesse Pacheco, CEO Drone Forward",
            "datePublished": "Tue, 11 Aug 2020 06:00:00 +0000",
            "description": "<p style=\"text-align: center;\"><strong>Can a STEAM based education program empower youth to pursue a fulfilling career path in the UAV industry?</strong></p> <p>Jesse Pacheco is Founder and CEO of Drone Forward, a nonprofit organization with the goal of solidifying the link between education and future jobs in the unmanned systems field. Drone Forward’s mission is to strengthen the contributions of robotics and unmanned vehicle technologies to the US economy. It does this by providing youth in diverse American communities with educational opportunities and experiences that lead to drone related careers of the future.</p> <p>Over the course of his career, Jesse has designed and implemented comprehensive organizational structures to enrich the quality of client services in the companies he worked.</p> <p>His dedication to creating and facilitating community activities for organizations has contributed to significant growth and clientele retention. In 2019, he founded Drone Forward as force to advance STEAM principles through unmanned vehicles.  In this edition of the Drone Radio Show, Jesse talks about Drone Forward, what makes this organization different from other STEAM programs and he shares his excitement in introducing young adults to a variety of rewarding drone careers.</p>",
            "length": "33888975",
            "sourceUrl": "http://traffic.libsyn.com/droneradioshow/DRS_280_Jesse_Pacheco.mp3?dest-id=276003"
        },
        {
            "title": "The Good Drone - How Social Movements Democratize Surveillance, Austin Fitzpatrick, Author",
            "datePublished": "Tue, 04 Aug 2020 06:00:00 +0000",
            "description": "<p style=\"text-align: center;\"><strong>Do drones have a place in supporting social movements?</strong></p> <p>Austin Choi-Fitzpatrick is an author, educator, and speaker. Austin’s work focuses on politics, culture, technology, and social change. He holds concurrent academic appointments at the University of San Diego and University of Nottingham and has been a visiting scholar at Oxford, University of California at San Diego, and Yale.  He is the author of several books and commentaries on social movements.  His recent book, <a title=\"The Good Drone\" href= \"http://www.austinchoifitzpatrick.com\" target=\"_blank\" rel= \"noopener\"><em>The Good Drone: How Social Movements Democratize Surveillance</em></a> shows how small-scale drones, satellites, kites, and balloons are used by social movements for the greater good. </p> <p>Politics and technology have always had a complicated relationship. Social media has upended assumptions about how politicians, voters, and protestors communicate. In this episode of the Drone Radio Show, Austin talks about <a href= \"https://mitpress.mit.edu/books/good-drone\" target=\"_blank\" rel= \"noopener\"><em>The Good Drone</em></a><em>, and</em> demonstrates the importance of technology to politics. But argues we mustn't stop with social media. New technology in the air (drones, for example) changes politics on the ground, and democratizes surveillance along the way. </p>",
            "length": "52765724",
            "sourceUrl": "http://traffic.libsyn.com/droneradioshow/DRS_279_Austin_Choi-Fitzpatrick.mp3?dest-id=276003"
        },
        {
            "title": "Multi-Drones - The New Operational Paradigm: Guy Cherni, Atlas Dynamics",
            "datePublished": "Tue, 28 Jul 2020 06:00:00 +0000",
            "description": "<p style=\"text-align: center;\"><strong>Can Mesh Technology offer a new paradigm for delivering autonomous drone services?</strong></p> <p>Guy Cherni is the Chief Marketing Officer of Atlas Dynamics, an aerospace company providing fully autonomous UAV solutions. With its propriety technology, Atlas Dynamics creates top tier drone based solutions that are accessible and seamless to use, address common problems and simplify everyday tasks. Guy has extensive experience in technology startups, social entrepreneurship, and community development. He holds a Bachelor of Arts degree in Philosophy, Political Science and Economics and a master’s degree in Industrial Design. In this episode of the Drone Radio Show, Guy talks about the company’s fully autonomous drones, mesh technology and how it will change the way drone services are designed and delivered.</p>",
            "length": "33051811",
            "sourceUrl": "http://traffic.libsyn.com/droneradioshow/DRS_278a_AtlasDynamics.mp3?dest-id=276003"
        },
        {
            "title": "Connecting Via The Virtual UAV Expo: Lisa Murray, Lee Corkhill & Danielle Gagne, Diversified Communications",
            "datePublished": "Tue, 21 Jul 2020 06:00:00 +0000",
            "description": "<p style=\"text-align: center;\"><strong>How We Can We Safety Network and Connect When the CorronaVirus has effectively shut down the trade show industry?</strong></p> <p>Lisa Murray is the event director for Diversified Communications, an international media company with more than 13 years’ experience in producing world-renowned events for precision measurement professionals.  If you’re in this field, then you have most likely have attended one of their events, including SPAR 3D Conference & Expo, the International Lidar Mapping Forum or the Commercial UAV Expo.  As many of you know, the CoronaVirus has forced many companies to alter their business operations, especially where gathering of people is the norm. Conferences and expos have been cancelled.  That has been bad news, not only for the trade show and conference industry, but also for businesses that rely on those events to build contacts, learn of new innovations, meet with clients and close sales. </p> <p>In this edition of the Drone Radio Show, Lisa talks about plans by Diversified Communications to hold this year’s Commercial UAV Expo and the UAV Expo Europe online, in a virtual format.  We talk about how the decision to go virtual came about, the challenges of taking a live event into the online realm and what attendees can expect at this year’s shows.  Joining Lisa is Lee Corkhill who heads up marketing for Diversified’s events and Danielle Gagne, and editorial analyst, also from Diversified Communications, who specializes in the UAV technology sector.</p>",
            "length": "29628709",
            "sourceUrl": "http://traffic.libsyn.com/droneradioshow/DRS_277_UAV_Expo_2020.mp3?dest-id=276003"
        },
        {
            "title": "Using Drones To Restore Consumer Confidence: Anthony Molzhan, Project Phoenix",
            "datePublished": "Tue, 14 Jul 2020 06:00:00 +0000",
            "description": "<p style=\"text-align: center;\"><strong>Can Drones Help to Restore Consumer Confidence in this Time Of the Coronavirus?</strong></p> <p>For that question, we head to Fargo, North Dakota and speak with Anthony Molzahn, CEO and co-founder of Project Phoenix. Project Phoenix is software company and developer of AegisFlow, an online marketplace for drone pilots to upload, stream, share and sell photos, videos and 3D modeling content. As the CEO of a software company and operator of a drone services platform, Anthony has a unique view of the drone ecosystem in Fargo. I recently spoke with Anthony about how the coronavirus was affecting that ecosystem. His answers surprised me.  In this edition of the Drone Radio Show, Anthony shares his insights into how drone operators are adapting to business under the coronavirus, how the North Dakota Department of Commerce is encouraging local businesses to deploy measures that will restore consumer confidence and how drone businesses are using the technology to create value, while supporting economic stability.</p> <p> </p>",
            "length": "30806972",
            "sourceUrl": "http://traffic.libsyn.com/droneradioshow/DRS_276_Anthony_Molzhan_2020.mp3?dest-id=276003"
        },
        {
            "title": "Advice From Entrepreneurs on Creating A Successful Drone Enterprise",
            "datePublished": "Tue, 07 Jul 2020 06:00:00 +0000",
            "description": "<p style=\"text-align: center;\"><strong>What do Entrepreneurs in the Drone Industry Need to Know?</strong></p> <p>If you’re a regular listener to the podcast, then you know that oftentimes I ask my guests for their advice on starting and growing a drone based business.   I’ve compiled the audio clips from several of my interviews into single stream of consciousness, where you can benefit from the advice in a single listen. </p> <p>In this episode of the Drone Radio Show, we’ll hear from industry notables like Anthony Molzahn, Brendan Stewart, Lorenz Meier, Robert Dalhstrom, Michael Chasen, Josh Ziering, Alan Beach, Jono Millen and others as they share their advice to starting and building a successful business in the drone industry.</p>",
            "length": "13822361",
            "sourceUrl": "http://traffic.libsyn.com/droneradioshow/DRS_275_Advice_From_Leaders.mp3?dest-id=276003"
        },
        {
            "title": "Hardware Solutions for the UAV Industry - Bob Schmidt, UAV Propulsion Tech",
            "datePublished": "Tue, 30 Jun 2020 06:00:00 +0000",
            "description": "<p style=\"text-align: center;\"><strong>Where do you go when you need hardware solutions for your UAVs?</strong></p> <p>Bob Schmidt is the Founder and President of UAV Propulsion Tech, an unmanned aerial vehicle hardware solution provider of nearly everything having to with UAVs. The company markets global UAV technology to the defense and commercial UAV markets. These include commercial off the shelf (COTs) and custom hardware solutions that are flying on several high-end global UAV platforms.</p> <p>Bob has a Bachelor of Science in Mechanical Engineering (rom Lawrence Technological University, a Master of Science in Administration from Central MI University, and has over 30 years industry experience in automotive propulsion/fuel systems and aerospace UAV hardware solutions. In this edition of the Drone Radio Show, Bob talks about UAV Propulsion Tech, the UAV hardware supply market and he provides his perspective on the growth of the drone industry.</p> <p> </p>",
            "length": "22893715",
            "sourceUrl": "http://traffic.libsyn.com/droneradioshow/DRS_274_Bob_Schmidt.mp3?dest-id=276003"
        },
        {
            "title": "The Last Mile Drone Delivery Challenge - Brendan Stewart and Joe Fuller, Drone Up",
            "datePublished": "Tue, 23 Jun 2020 06:00:00 +0000",
            "description": "<p style=\"text-align: center;\"><strong>Is it possible to deliver packages with drones under current Part 107 rules?</strong></p> <p>Today’s two guests say they already have. Both are from DroneUp, a drone services company that provides end-to-end aerial data solutions by matching a organization’s data collection and delivery needs with the right hardware, software, training, pilots, and program integration requirements. Brendan Stewart is the Training Director responsible for training and program development for enterprise and public safety clients. Joe Fuller is CIO and designs aerial data capture and processing for clients to ensure a return on investment in their drone projects.</p> <p>In early April of this year, the duo led a series of tests to demonstrate package deliveries by drones under Part 107 regulations. Over the span of 3 days, the exercises focused on delivery to residential and commercial areas with the aim of identifying best practices for safe operations. In this edition of the Drone Raido Show, Brendan and Joe talk about Drone Up, the Last Mile Drone Delivery Challenge and the lessons learned from the demonstration project.</p>",
            "length": "40399939",
            "sourceUrl": "http://traffic.libsyn.com/droneradioshow/DRS_DroneUp2020.mp3?dest-id=276003"
        },
        {
            "title": "Getting the Best Data With Drones: Jono Millin, Co-Founder & CCO, DroneDeploy",
            "datePublished": "Tue, 16 Jun 2020 06:00:00 +0000",
            "description": "<p style=\"text-align: center;\"><strong>How do you make drone data actionable?</strong></p> <p>Jono Millin is co-founder and CCO of DroneDeploy, a cloud-based software company that specializes in building solutions for mapping business assets with drones<em>.  </em>DroneDeploy powers tens of thousands of commercial drone operators from 160 countries to make automated, high-resolution 2D maps and 3D models . At Drone Deploly, Jono<em> is</em> responsible for the overall customer experience of the DroneDeploy platform.   He has a Master's degree in Artificial Intelligence from the University of Edinburgh and a Bachelor's degree in Computer Science and Applied Mathematics from Rhodes University.</p> <p>In this episode of the Drone Radio Show Podcast, Jono talks about DroneDeploy, the successful growth of drones in the agricultural sector and he share some insights into how make the conversation around the data to engage customers in decision making.</p> <p> </p>",
            "length": "35299161",
            "sourceUrl": "http://traffic.libsyn.com/droneradioshow/DRS_272_Jono_Millin.mp3?dest-id=276003"
        },
        {
            "title": "The Virtual Drone Racing Boot Camp: Marque Cornblatt, Aerial Sports League",
            "datePublished": "Tue, 09 Jun 2020 06:00:00 +0000",
            "description": "<p style=\"text-align: center;\"><strong>Learn Drone Racing Via The Internet</strong></p> <p>Marque Cornblatt is the Founder and CEO of the Aerial Sports League, a worldwide leader in drone sports, entertainment and media. Since 2015, the Aerial Sports League has has hosted over 1,000,000 spectators at live events, has earned over 8.5 million video views and over 50,000 social media followers.  The League pioneered fun drone education and has taught thousands of new pilots to build & fly drones through events, meetups and STEAM education programs. The Aerial Sports League is also the founder of the <a href=\"http://futuresports.io/\" target=\"_blank\" rel=\"noopener\">Museum of Future Sports</a>, a STEAM education organization focusing on tech enabled sports and equitable tech literacy for all kids. </p> <p>In addition to being the CEO of the Aerial Sports League, Marque has created award-winning art and media for years, earning millions of social media followers and viewers. His kinetic art and short films have been exhibited at the San Francisco Museum of Modern Art, the San Jose Museum of Art & The San Jose Tech Museum and he recently celebrated 25 years as an artist with a major East Coast retrospective. He is often cited as a pioneering researcher in the field of telepresence robotics, and has twice been a TEDx presenter. </p> <p>His latest innovation is a virtual summer drone racing boot camp that can be experienced from the safety of home, hosted, coached and taught by some of the biggest names in professional drone sports.  In this edition of the drone radio show, Marque talks about the Aerial Sports League, the Virtual Drone Racing Boot Camp and the future of drone sports and entertainment.</p>",
            "length": "31635822",
            "sourceUrl": "http://traffic.libsyn.com/droneradioshow/DRS_271_Marque_Cornblatt.mp3?dest-id=276003"
        },
        {
            "title": "Long Distance Drone Delivery - Daniel Buchmueller, Volansi",
            "datePublished": "Tue, 02 Jun 2020 06:00:00 +0000",
            "description": "<p style=\"text-align: center;\"><strong>What’s the market for long-distance drone delivery service?</strong></p> <p>Daniel Buchmueller is CTO of Volansi. Volansi builds and operates long-range, high-payload unmanned aerial systems for various applications, helping their customers save millions of dollars on down-time costs. The company operates two remote piloted drones capable of delivering payloads up to 350 miles.  Before joining Volansi, Daniel was Vice President and Head of Drone Cargo at Airbus, and before that, he was co-founder of Amazon Prime Air. In this edition of the Drone Radio Show, Daniel talks about Volansi’s long-distance drone service, the Voly C-10 and M-20 long-distance delivery drones and how the company successfully found a niche serving clients engaged in operations located in remote areas.</p>",
            "length": "34039460",
            "sourceUrl": "http://traffic.libsyn.com/droneradioshow/DRS_270_Daniel_Buchmueller.mp3?dest-id=276003"
        },
        {
            "title": "Managing Autonomous Enterprise Fleets - Lorenz Meier & Kevin Sartori, Auterion",
            "datePublished": "Tue, 26 May 2020 06:00:00 +0000",
            "description": "<p>Is there a better way for Enterprise Companies to manage large drone fleets?</p> <p>Today’s guests believe there is.  Lorenz Meier and Kevin Sartori are Co-Founders of Auterion, an enterprise drone software platform.  Auterion’s goal is to be the drone software platform of choice for enterprises and drone manufacturers, while accelerating the industry by driving forward open standards to create a common, future-proof roadmap. This gives everyone involved, whether vendors or buyers, confidence that they will achieve a return on their investment, and access to a wide choice of partners and integrations in an open ecosystem.</p> <p>Lorenz Meier, holds a Ph.D. in drone software architecture at the Swiss Federal Institute of Technology in Zurich. In 2008 Lorenz created and released the PX4 autonomous drone autopilot to the open source community. Lorenz is also the creator of Pixhawk, MAVLink and QGroundControl, today’s most commonly used flight control hardware and autopilot software. He has been working in the drone and robotics industry for the past 10 years and in 2017 was nominated MIT 35 Innovators under 35 by MIT Technology Review for the development of PX4.  Lorenz is also a board member and community director at Dronecode, the organization that defines the open source standards in the UAV industry.</p> <p>Kevin Sartori holds a Master in Robotics from ETH Zurich and an MBA from UC Berkeley, Haas School of Business and has been working in the drone industry since 2008 when he was researching optimal control algorithms as part of the early Pixhawk team at ETH Zurich. In 2014, he moved to the San Francisco Bay Area and joined 3D Robotics, first as an Enterprise Product Manager and later as Senior Product Marketing Manager for Site Scan. He helped the company transition from a consumer hardware company to an enterprise Software as a Service company and lead the marketing and channel sales efforts. Today at Auterion, Kevin combines his consulting skills with his knowledge of the drone industry and technology to help drone manufacturers and drone service providers adopt new technologies, change business models, and bring new products to market.</p> <p>In early 2020, Auterion release Sky Node, which when combined with Auterion PX4 enables drone manufacturers to rapidly enter new markets by making their products compatible with an ecosystem of payloads, components, services, and workflow integrations. It short, it gives companies the tools they need to deploy large fleets of drones.</p> <p>In this edition of the Drone Radio Show, Lorenz and Kevin talk about Auterion’s open source platform, Sky Node and its applications and how enterprise companies can better manage a fleet of drones.</p>",
            "length": "36574761",
            "sourceUrl": "http://traffic.libsyn.com/droneradioshow/DRS_269_Auterion.mp3?dest-id=276003"
        },
        {
            "title": "Can Drones Help in the Battle Against Rising Seas? - Dania Montenegro, Flying Labs Panama",
            "datePublished": "Tue, 19 May 2020 06:00:00 +0000",
            "description": "<p style=\"text-align: center;\"><strong>Fighting Sea Level Rise With Drones</strong></p> <p>Dania Montenegro is the Project Coordinator for Flying Labs of Latin America, based in Panama.  The goal of Flying Labs is to accelerate the positive impact of local aid, health, development and environmental solutions locally.  Flying Labs expand local markets by creating new jobs and businesses that offer robotics as a service and support local ecosystems.  There are 24 Flying Labs located in Africa, Asia and Latin America. The Labs are franchised by WeRobotics to enable local changemakers who want to build robotics and AI capacity in their countries.</p> <p>Off the coast of Panama lies a tiny island called Carti Sugdub. This island, home to more than 1,000 people, is threatened by sea level rise and climate change, so much so, that in partnership with the Government of Panama, the entire community is making plans to relocate to forty acres on the mainland.  Flying Labs has been ask to help in the relocation by helping to document and preserve the culture and community design.  Using drones, Flying Labs is creating a digital footprint that will guide redevelopment of the community in it new location. In this episode of the Drone Radio Show, Dania talks about Flying Labs Panama and how drones are helping the residents of Carti Sugdub mitigate the impacts of climate change and sea level rise.  Joining Dania later in the podcast is Joseph Mulihausen, Head of Drone & Data Systems at WeRobotics.</p>",
            "length": "24315632",
            "sourceUrl": "http://traffic.libsyn.com/droneradioshow/DRS_268_Dania_Montenegro.mp3?dest-id=276003"
        },
        {
            "title": "Are BVLOS Waivers Worth The Effort? - Rob Knochenhauer, Green Sight",
            "datePublished": "Tue, 12 May 2020 06:00:00 +0000",
            "description": "<p style=\"text-align: center;\"><strong>One Company's Path To BVLOS</strong></p> <p>Rob Knochenhauer is Head of UAS Regulatory & Operations at Green Sight.  Green Sight provides autonomous aerial data collection hardware and data analysis software tools t o support a wide variety of industries and applications. </p> <p>At Green Sight, Rob leads the development of the UAS operational scheme wherein unmanned aircraft are run at customer locations with a 107 certificated remote pilot on site who maintains visual line of sight with the drone while it flies. While the drone is flying, the operation is overwatched by another 107 certificated Remote Pilot in Green Sight’s Boston office. This is all part of Green Sight’s goal to eventually run unattended drone operations in the future. </p> <p>In this edition of the drone radio show, Rob talks about Green Sight, the BVLOS waiver process and what companies need to know to prepare for fully autonomous operations.</p>",
            "length": "27681875",
            "sourceUrl": "http://traffic.libsyn.com/droneradioshow/DRS_267_Rob_Knockenhauer.mp3?dest-id=276003"
        },
        {
            "title": "Smart Cities and Drones - Eben Frankenberg, CEO Echodyne Corp.",
            "datePublished": "Tue, 05 May 2020 06:00:00 +0000",
            "description": "<p style=\"text-align: center;\"><strong><em>Can a Smart City Make Flying Drones Easier and Safer?</em></strong></p> <p>Eben Frankenberg is CEO and Co-founder of Echodyne Corp. Echodyne is a 5-year old company that makes revolutionary compact radar sensors for a range of applications for commercial, defense, and government customers. Their high-performance radars combine patented technology and powerful, intelligent software to achieve maximum radar performance. Echodyne radars are used the Autonomous Vehicle, Perimeter and Border Security, Security Integrator, Airspace Management, UAS Service Suppliers, and commercial Unmanned Aircraft Systems industries.</p> <p>Eben  has over 20 years of experience starting and growing technology companies.  Prior to founding Echodyne, Eben was an Entrepreneur in Residence at Intellectual Ventures (IV) where he created and incubated new companies including: Echodyne Corp and several other leading startups.  In this edition of the drone radio show, Eben talks about how smart cities data networks could play a role in supporting unmanned air flight operations in urban environments.<br /> <br /></p>",
            "length": "28298365",
            "sourceUrl": "http://traffic.libsyn.com/droneradioshow/DRS_266_Eben_Frankenberg.mp3?dest-id=276003"
        },
        {
            "title": "When it comes to drones, who owns the air space? - Brent Skorup, Mercatus Center",
            "datePublished": "Tue, 28 Apr 2020 06:00:00 +0000",
            "description": "<p style=\"text-align: center;\"><strong>Dealing With State & Local Property Rights</strong></p> <p>Brent Skorup is a Senior Research Fellow at the Mercatus Center at George Mason University.  The Mercatus Center at George Mason University is the world’s premier university source for market-oriented ideas—bridging the gap between academic ideas and real-world problems. The Center advances knowledge about how markets work to improve people’s lives by training graduate students, conducting research, and applying economics to offer solutions to society’s most pressing problems.  In addition to his role as senior research fellow, Brent is also a member of the Texas Department of Transportation’s Connected and Autonomous Vehicle Task Force. He has authored several articles for National Affairs, Reuters, The Wall Street Journal, The New York Times and others. He’s appeared on TV and radio for news outlets like C-SPAN, NPR, CBS News, ABC News and CNBC Asia.  He has recently co-authored an article in GovTech on drones and local and state property rights and he also released an report card on which states are prepared for the drone industry.  In this edition of the Drone Radio Show, Brent talks about these publications, how local and state property rights laws could affect where drones fly and why these units of government should become more involved in the air management discussion to better prepare themselves for the future.</p>",
            "length": "29190274",
            "sourceUrl": "http://traffic.libsyn.com/droneradioshow/DRS_265_Brent__Skorup.mp3?dest-id=276003"
        },
        {
            "title": "Using Augmented Reality To Plan Your Drone Shots - Brian Streem, CEO Vermeer",
            "datePublished": "Tue, 21 Apr 2020 06:00:00 +0000",
            "description": "<p>Brian Streem is CEO and Founder of Vermeer, a technology company that is developing an augmented reality drone solution that enables anyone to easily capture aerial photos, videos and data. Users can design their aerial shots on their smartphones and then send it to a drone to execute autonomously in the real world. Vermeer’s solution is designed for people who want to create high-end drone photos and videos, but don’t own a drone and don’t want to buy one.  In this edition of the Drone Radio Show, Brian talks about Vermeer, its augmented reality drone solution and how people can get the exact video or image they are seeking without ever having to fly a drone.</p>",
            "length": "17410094",
            "sourceUrl": "http://traffic.libsyn.com/droneradioshow/DRS_264_Brian_Streem.mp3?dest-id=276003"
        },
        {
            "title": "The Fullerton Drone Lab and Shark Research - Jay Seidel, Professor and Drone Lab Coordinator",
            "datePublished": "Tue, 14 Apr 2020 06:00:00 +0000",
            "description": "<p style=\"text-align: center;\"><strong>Can a drone help better understand sharks?</strong></p> <p style=\"text-align: left;\">Jay Seidel is a journalism professor and media adviser at Fullerton College. He also oversees the Fullerton College Drone Technology program and is the coordinator of the Fullerton College Drone Lab. The Fullerton Drone Lab teaches students to become better and safer pilots, prepares them for the FAA Part 107 Remote Pilot Certification exam and provides hands on learning opportunities on the use drones in various industries.  In 2019, the Lab partnered with the Shark Lab housed at California State University in Long Beach to capture and provide data by drones on sharks.</p> <p style=\"text-align: left;\">The goal of the Shark Lab’s study to quantify recreational water use along Southern California beaches, advance the knowledge of white shark-human interaction behaviors, and assess the risk associated with marine recreation. Prior to becoming a teacher in 2005, Jay worked for 12 years as a writer and editor for various publications, including the Los Angeles Times and Popular Hot Rodding. He earned his master’s degree in communications from Cal State University, Fullerton.  And he served 11 years in the U.S. Army and California Army National Guard where he worked as an engineer and photojournalist.  In this edition of the Drone Radio Show, Jay talks about the Fullerton College Drone Lab, collaboration with the Shark Lab to help better understand marine habitats.</p>",
            "length": "41932002",
            "sourceUrl": "http://traffic.libsyn.com/droneradioshow/DRS_263_Jay_Seidel.mp3?dest-id=276003"
        },
        {
            "title": "Behind the Scenes of the NYC Drone Film Festival: Randy Scott Slavin, Founder and Director",
            "datePublished": "Tue, 07 Apr 2020 06:00:00 +0000",
            "description": "<p style=\"text-align: center;\"><strong>Have you ever wondered how the New York City Drone Film Festival got started?</strong></p> <p>Well today’s guest gives us the inside scoop.  Randy Scott Slavin is an award-winning director, photographer and aerial cinematographer and is the founder of the<strong> </strong><a href= \"http://nycdronefilmfestival.com/\"><strong>New York City Drone Film Festival</strong></a>.  He is a drone expert who is regularly featured on television and in publications around the world. As a director, he is known for his use of cutting edge camera technology to further the impact of storytelling.</p> <p>Randy first gained attention for racking up <strong>millions of television views and YouTube hits</strong> for brands including <strong>American Express, AT&T, Bank of America, AdWeek, Tribeca Film Festival, Sunoco, Island/Def Jam Records</strong> for which he has received multiple awards.  As a surrealist photographer, his work can regularly be found in the pages of <strong>Time Magazine, Gizmodo, Mashable, The Washington Post, Fast Company Design</strong> and other publications around the world.</p> <p>In 2014 Randy founded the <strong>New York City Drone Film Festival</strong>, the world's first event exclusively dedicated to celebrating the art of drone cinematography. It has experienced rapid growth since its inception, counting companies like <strong>SAMSUNG</strong>, <strong>RED</strong>, <strong>GE, NBC News, Adobe</strong> and <strong>DJI</strong> as headline sponsors.  The NYCDFF includes a dynamic slate of <strong>interactive panels</strong> and a <strong>\"Day of Drones\"</strong> hosted at the <strong>New York City Drone Film Festival</strong> and hosts thousands of attendees over festival weekend and hundreds of millions of media impressions worldwide. In early 2020, the New York City Drone Film Festival was acquired by <a href=\"https://www.airvuz.com/\" target=\"_blank\" rel= \"noopener\">AirVuz.com</a>, the premier website for drone video content.  In this episode of the Drone Radio Show, Randy talks about the evolution of the New York City Drone Film Festival, what makes an award winning drone film and he gives us some insights into the role of drones in film making.</p>",
            "length": "27857402",
            "sourceUrl": "http://traffic.libsyn.com/droneradioshow/DRS_262_Randy_Slavin.mp3?dest-id=276003"
        },
        {
            "title": "Counter Drone Solutions for Civilian and Military Users - Lucas Le Bell, Cerbair",
            "datePublished": "Tue, 31 Mar 2020 06:00:00 +0000",
            "description": "<p style=\"text-align: center;\"><strong>What are some of the advances in Counter Drone Technology?</strong></p> <p>For that question, we head to Paris, France to speak with Lucas Le Bell, CEO and Co-Founder of CerbAir.  Cerbair was created to counter the alarming increase of drone intrusions on critical facilities, as well as the threat they represent. The company offers anti-drone solutions that adapt to the needs of each customer.  Lucas co-founded CerbAir in 2015 with Olivier Le Blainvaux and in five years, the company has grown to provide anti-drone solutions to a large portfolio of customers worldwide. Today, it is recognized as one of the leaders in the emerging counter drone industry.  In this edition of the Drone Radio Show, Lucas talks about Cerbair, the pros and cons of the technologies used to counter drone incursions and the challenges and opportunities in protecting critical infrastructure.</p>",
            "length": "42509801",
            "sourceUrl": "http://traffic.libsyn.com/droneradioshow/DRS_261_Lucas_Le_Bell.mp3?dest-id=276003"
        },
        {
            "title": "The Ultralight That You'll Swear is a Drone - Kevin Rustigi, LIFT Aircraft",
            "datePublished": "Tue, 24 Mar 2020 06:00:00 +0000",
            "description": "<p style=\"text-align: center;\"><strong>Would you like to pilot a personal flying drone?</strong></p> <p>It may not be technically be a drone, but as today’s guest shares, the new HEXA from Lift Aircraft looks and flies a lot like a drone and could usher in a whole new personal flying experience.  Lift Aircraft is a venture of Matt Chasen, founder of uShip, the online shipping marketplace.  Chasen and his company has developed an electric, vertical takeoff and landing aircraft that is so simple to operate that anyone will be able to take it out for a spin and experience an entirely new kind of flying.  In this episode of the Drone Radio Show, Kevin Rustigi, Director of Business Operations at LIFT Aircraft talks about company, its new HEXA ultralight vehicle and plans to offer rides to those looking for unique flying experience.  We also talk about the future of personal flying vehicles.</p>",
            "length": "29599042",
            "sourceUrl": "http://traffic.libsyn.com/droneradioshow/DRS_260_Kevin_Rustagi.mp3?dest-id=276003"
        },
        {
            "title": "How Drones Are Shaking Up Sailboat Races - Dr. Tulinda Larsen, Skylark Drone Research",
            "datePublished": "Tue, 17 Mar 2020 06:00:00 +0000",
            "description": "<p style=\"text-align: center;\"><strong>Can A Drone Help Manage A Sailboat Race?</strong></p> <p>Dr. Tulinda Larsen is CEO and Founder of Skylark Drone Research, a technology company that empowers Fortune 500 companies with drone analytics, service providers with secure execution of flights and manufacturers with regulatory airspace compliance.  Tulinda has spent more than 40 years in commercial aviation. She’s a private pilot, a Certified Part 107 Remote Pilot and an Adjunct Professor in the School of Business at Embry Riddle Aeronautical University.  Tulinda also serves as an Advisor to Women and Drones.</p> <p>Skylark Drone Research works with sailing organizations to develop drone programs designed for use of drones in sailing programs. The company worked with the Annapolis Yacht Club to develop policies and procedures for using drones for sailboat race management, coaching, yacht club events, and other applications. </p> <p>In this edition of the Drone Radio Show, Tulinda talks about how drones are used in sailboat race management and the best practices.  She also shares two new exciting program offerings of Women and Drones, namely a new membership program and job boards for Women and Drone members.</p>",
            "length": "31317276",
            "sourceUrl": "http://traffic.libsyn.com/droneradioshow/DRS_259_Tulinda_Larsen.mp3?dest-id=276003"
        },
        {
            "title": "Pros and Cons of the Remote ID Rule - Lisa Ellman, Commercial Drone Alliance",
            "datePublished": "Tue, 10 Mar 2020 06:00:00 +0000",
            "description": "<p style=\"text-align: center;\"><strong>How does the Commercial Drone Industry view the proposed Remote ID Rule?</strong></p> <p>Lisa Ellman is the Executive Director of the Commercial Drone Alliance, an independent 501c6 non-profit organization led by key members of the commercial drone industry. The Alliance works collectively to merge policy with innovation to create relevant rules for operation. It educates on the economic benefits and humanitarian gains made possible by commercial drones and advocates for their safe and responsible use. It also brings industry and government together to solve some of the challenges facing the industry.  </p> <p>Lisa is widely recognized as one of the “world’s foremost authorities” on drone policy and law. She was featured in Fortune's \"Most Powerful Women\" series for her efforts to develop policy governing drone use in the United States. In addition to her role with the Commercial Drone Alliance, Lisa is also a Partner at Hogan Lovells and Chair of the firm’s global Unmanned Aircraft Systems (UAS) Practice Group, a “one-stop shop” for all legal and policy issues related to commercial drones.</p> <p>In this episode of the Drone Radio Show Podcast, Lisa talks about the Commercial Drone Alliance, its view of the proposed Remote ID rule and other initiatives the Alliance is currently involved to push the industry forward.</p>",
            "length": "27619161",
            "sourceUrl": "http://traffic.libsyn.com/droneradioshow/DRS_258_Lisa_Ellman.mp3?dest-id=276003"
        },
        {
            "title": "What’s NASA Doing to Support the Drone Industry? - Dr. Parimal Kopardekar & Dr. Misty Davies, NASA Ames",
            "datePublished": "Tue, 03 Mar 2020 07:00:00 +0000",
            "description": "<p style=\"text-align: center;\"><strong>An Update From NASA</strong></p> <p>Today, we head to the NASA Ames Research Center in Mountain View, California to speak with Parimal Kopardekar and Misty Davies. The Ames Research Center is one of ten NASA field centers.  Since 1939, Ames has led NASA in conducting world-class research and development in aeronautics, exploration technology and science aligned with the center's core capabilities.  Ames Research Center supports virtually every major NASA mission and initiative through its expertise in aerosciences, air traffic management, advanced computing and IT systems and many other capabilities.  Dr.</p> <p>Dr. Parimal Kopardekar, or PK for short,  serves as the Director of NASA Aeronautics Research Institute.  In that capacity, he is responsible for exploring new trends and needs related to aviation in the areas of autonomy, aeronautics manufacturing, and advanced air mobility. Dr. Misty Davies is Deputy Project Manager for NASA’s System-Wide Safety Project. Her work is focused on predicting the behavior of complex, engineered systems early in design as a way to improve these systems' safety, reliability, performance, and cost.</p> <p>In this edition of the Drone Radio Show, PK and Misty give us an update on the work NASA is doing to support unmanned aerial systems, they talk about the challenges of developing autonomous systems and they provide some insights into NASA’s Grand Challenge for Urban Air Mobility.</p>",
            "length": "27209971",
            "sourceUrl": "http://traffic.libsyn.com/droneradioshow/DRS_257_NASA_2020.mp3?dest-id=276003"
        },
        {
            "title": "What's the Outlook for the Drone Industry (Part Vi) - Michael Blades, Frost & Sullivan",
            "datePublished": "Tue, 25 Feb 2020 07:00:00 +0000",
            "description": "<p style=\"text-align: center;\"><strong>What’s the outlook for the drone industry?</strong></p> <p>That’s the question we explore in my continuing series of interviews  with industry analysts, writers and editors.  In this series, I interview guests with diverse opinions and perspectives on the industry.  They provide a range of insights on some of the industry’s current topics and trends.  By the end of the series, you should have a good sense of where industry is going and how you can position yourself to take advantage.</p> <p>Michael Blades is Vice President for Frost & Sullivan’s Aerospace, Defense, and Security America's Region. Frost & Sullivan is a business consulting firm involved in market research and analysis, growth strategy consulting and corporate training across multiple industries. Michael has been with Frost & Sullivan for over six years as a market analyst and growth consultant and has earned a Masters Degree in Aerospace Operations as well as an MBA. In this episode of the Drone Radio Show, Michael talks about some of the current trends shaping the industry and what to look forward to in 2020.</p>",
            "length": "28149584",
            "sourceUrl": "http://traffic.libsyn.com/droneradioshow/DRS_256_Michael_Blades.mp3?dest-id=276003"
        },
        {
            "title": "Xponential 2020 and More - Brian Wynne, AUVSI",
            "datePublished": "Tue, 18 Feb 2020 07:00:00 +0000",
            "description": "<p style=\"text-align: center;\"><strong>Where can you go to connect with the latest advancements in the drone industry?</strong></p> <p>Brian Wynne is president and CEO of the Association for Unmanned Vehicle Systems International, the world's largest nonprofit organization dedicated to the advancement of unmanned systems and robotics. AUVSI represents more than 7,500 members from more than 60 countries involved in the fields of government, industry and academia. AUVSI members work in the defense, civil and commercial markets. Before joining AUVSI in 2015, Brian served for 10 years as president and CEO of the Electric Drive Transportation Association, the trade association promoting battery, hybrid, plug-in hybrid, and fuel cell electric drive technologies and infrastructure.  Brian is a graduate of the University of Scranton and the School of Advanced International Studies at Johns Hopkins University. He was a Fulbright Scholar at the University of Cologne in Germany. He is also a general aviation pilot with a commercial certificate and has a Remote Pilots License. In this edition of the Drone Radio Show, Brian talks about AUVSI, the upcoming Xponential 2020 and why we should attend and he tells us what to look for 2020 in the drone industry.</p>",
            "length": "24140905",
            "sourceUrl": "http://traffic.libsyn.com/droneradioshow/DRS_255_Brian_Wynne.mp3?dest-id=276003"
        },
        {
            "title": "A Solution for Scaling Enterprise Autonomous Drone Operations - Nitin Gupta, FlytBase, Inc",
            "datePublished": "Tue, 11 Feb 2020 07:00:00 +0000",
            "description": "<p style=\"text-align: center;\"><strong>How Will We Manage Autonomous UAV Fleets?</strong></p> <p>Nitin Gupta is the Founder and CEO of FlytBase, a Silicon Valley startup that offers an enterprise drone automation platform to power large scale deployments of intelligent autonomous UAV fleets. The hardware-agnostic IoT platform features intelligent plugins at the edge, cloud-based real-time fleet management, and APIs for seamless integration with business workflows. FlytBase is working with a large number of enterprise customers spread across US and Europe, helping them deploy fully automated drone applications for public-safety/security, warehouses, and inspections.</p> <p>Nitin has over 15 years of experience in the automation and aerial robotics industry. Before founding FlytBase, he worked with multiple startups and with Samsung electronics. He has extensive background in aerospace control systems, robotics and automation. In this edition of the Drone Radio Show, Nitin talks about FlytBase, the challenges of building a system to manage autonomous fleets and he shares his thoughts on the future of the drone industry.</p>",
            "length": "32967865",
            "sourceUrl": "http://traffic.libsyn.com/droneradioshow/DRS_253a_Nitin_Gupta.mp3?dest-id=276003"
        },
        {
            "title": "Where is The Drone Industry Headed (Part I)V - Lisa Murray, Diversified Communications",
            "datePublished": "Tue, 04 Feb 2020 07:00:00 +0000",
            "description": "<p style=\"text-align: center;\"><strong>The Drone Industry in 2020</strong></p> <p>Lisa Murray is the event director for Diversified Communications, an international media company with more than 15 years’ experience in producing world-renowned events for precision measurement professionals.  If you’re in this field, then you have most likely have attended one of their events, including SPAR 3D Conference & Expo, the International Lidar Mapping Forum, the Commercial UAV Expo or Amsterdam Drone Week. Her experience with Diversified Communications gives her a unique vantage point on commercial drone industry, the companies making a difference and the people creating change.  In this edition of the Drone Radio Show, Lisa talks about the Commercial UAV Expo and Amsterdam Drone Week, the global trends shaping these shows and the issues and opportunities driving the commercial drone sector.</p> <p> </p>",
            "length": "27964631",
            "sourceUrl": "http://traffic.libsyn.com/droneradioshow/DRS_252a_Lisa_Murray.mp3?dest-id=276003"
        },
        {
            "title": "Building A Better Counter UAS RF Detection System - Linda Ziemba, CEO of AeroDefense",
            "datePublished": "Tue, 28 Jan 2020 07:00:00 +0000",
            "description": "<p style=\"text-align: center;\"><strong>Are RF Detection Systems Effective In Stopping Drones?</strong></p> <p>Linda Ziemba is founder and CEO of AeroDefense, a New Jersey-based company that provides a proven drone detection solution for locating a drone and pilot simultaneously. The technology is named AirWarden™, and it uses passive radio frequency detection methods to detect and locate known and unknown drones without demodulating or decoding signals. The Department of Homeland Security recently recognized AirWarden with a Developmental Testing and Evaluation SAFETY Act Designation. The designation provides AirWarden users, who choose to take advantage, full immunity from liability claims alleging technology failure in the event of a terror attack. AirWarden is the first and only drone detection solution to be on the DHS SAFETY Act “approved technologies” list.  AirWarden is currently deployed at MetLife Stadium and correctional facilities in Georgia and Massachusetts.</p> <p> </p> <p>Linda’s experience spans internet security, telecommunications and entrepreneurship, at companies including Websense, Secure Computing, Finjan, AT&T and Lucent Technologies. Prior to founding AeroDefense in 2015, she served as a key executive for LiveLOOK, a collaboration software company. Linda’s leadership across sales, marketing, and general operations resulted in numerous contracts with global financial services, telecommunications and computer firms, and ultimately acquisition by Oracle in 2014.</p> <p>In this edition of the Drone Radio Show, Linda talks about the company's proven AirWarden technology, how AeroDefense pivoted to stay within Federal regulations for Counter UAS and the challenges and opportunities of creating a Counter UAS company.</p>",
            "length": "33107911",
            "sourceUrl": "http://traffic.libsyn.com/droneradioshow/DRS_251a_Linda_Ziemba.mp3?dest-id=276003"
        },
        {
            "title": "Serving Enterprise Drone Operations: Uzayr Siddiqui, CEO Drone Entry",
            "datePublished": "Tue, 21 Jan 2020 07:00:00 +0000",
            "description": "<p style=\"text-align: center;\"><strong>How can enterprise companies better manage their drone operations?</strong><em> </em></p> <p>Uzayr Siddiqui is founder and CEO of Drone Entry. Drone Entry is a ventured backed drone startup, that provides an online platform Software as a tool.  The tool provides enterprise companies with a ERP layer to build workflow compliance management between data processing tools and airspace management systems to effectively scale and manage their operations.  Drone Entry also helps drone pilots build their career, and build their credibility with other stakeholders in the industry.  In this episode of the Drone Radio Show, Uzayr talks about the Drone Entry platform and how the company pivoted from a pilot-centric business to focus on serving the growing enterprise business sector. </p>",
            "length": "26333531",
            "sourceUrl": "http://traffic.libsyn.com/droneradioshow/DRS_250_Uzayr_Siddiqui.mp3?dest-id=276003"
        },
        {
            "title": "Where is The Drone Industry Headed (Part III) - Miriam McNabb, DroneLife",
            "datePublished": "Tue, 14 Jan 2020 07:00:00 +0000",
            "description": "<p style=\"text-align: center;\"><strong>The Drone Industry in 2020</strong></p> <p>Miraim McNabb is Editor In Chief of DroneLife, the online source for the latest drone news, product releases, YouTube videos and legal precedents on the drone industry.  Miriam is a fascinated observer of the drone industry since 2013, when DroneLife launched. She has written and covered thousands of articles on the evolution and growth of the industry.  She is a frequent international speaker at drone industry events and writes for DRONELIFE on current news, financial trends, and FAA regulations. Miriam has a degree from the University of Chicago and over 20 years of experience in high tech sales and marketing for new technologies. In this episode of the Drone Radio Show, Miriam talks about the drone industry in 2019, the outlook for 2020 and she shares her perspective a variety of drone related issues and trends.</p> <p> </p>",
            "length": "34649243",
            "sourceUrl": "http://traffic.libsyn.com/droneradioshow/DRS_249_Miriam_McNabb.mp3?dest-id=276003"
        },
        {
            "title": "Where Is The Drone Industry Headed (Part II) - Christopher Korody, Drone Business Center",
            "datePublished": "Tue, 07 Jan 2020 07:00:00 +0000",
            "description": "<p style=\"text-align: center;\"><strong>What's In The Cards For The Drone Industry in 2020?</strong></p> <p>Christopher Korody is a 45 year marketing veteran with deep experience in the technology, aerospace and automotive sectors. He launched DroneBusiness.center to provide UAS companies with the research, strategy and communication programs necessary to stand out in this fast growing marketplace. Dedicated to ‘connecting the dots,’ he edits an ocassional weekly newsletter, Dronin’ On, which is read by senior managers around the world. His deep knowledge of policy makes Korody a popular choice to participate on industry advisory boards and to moderate industry events. In this episode of the Drone Radio Show, Chris talks about the drone industry in 2019, the outlook for 2020 and he shares his thoughts on a variety of drone related issues that are key to moving it forward. </p>",
            "length": "33726385",
            "sourceUrl": "http://traffic.libsyn.com/droneradioshow/DRS_248_Chris_Korody.mp3?dest-id=276003"
        },
        {
            "title": "Democratizing Artificial Intelligence: Murali Gopalakrishna, NVIDIA",
            "datePublished": "Tue, 31 Dec 2019 07:00:00 +0000",
            "description": "<p style=\"text-align: center;\"><strong>Is it possible for drone users to create their own AI drone application?</strong></p> <p>Today’s guest not only says that it is possible, but with today’s tools, it is surprisingly easy to do so.  Murali Gopalakrishna heads up product management for autonomous machines at NVIDIA. He also leads the business development team that focuses on robots, drones, industrial IoT and enterprise collaboration products. Before joining NVIDIA in 2016, Murali was the global head of platform and technology strategy, leading the CTO’s office at Sony Mobile Communications. He was responsible for products ranging from phones, tablets and wearables to IoT platforms.  In this edition of the Drone Radio Show, Murali talks about Nvidia’s Jetson line of AI products, how artificial intelligence is changing the way drones work and how Nvidia is extending AI tools to more and more developers so they can create new and more exciting applications.</p>",
            "length": "20980615",
            "sourceUrl": "http://traffic.libsyn.com/droneradioshow/DRS_247_Murali_Gopalakrishna.mp3?dest-id=276003"
        },
        {
            "title": "Drone Education in a Song: Victor Villegas, The Drone Singer",
            "datePublished": "Tue, 24 Dec 2019 07:00:00 +0000",
            "description": "<p style=\"text-align: center;\"><strong>What's the Best Way to Learn Something?</strong></p> <p>Some studies say that the best way to learn something is to put it to music or to make it funny. Today’s guest would go one step further and say do both.</p> <p>Victor Villegas is a technologist at heart who enjoys helping people learn how to use technology to improve work and better their lives. He bridges techies and users and has a knack for explaining technology in simple and easy to understand terms. Victor supervises the Oregon State University Extension Computing Technology Unit which provides remote and onsite support to all the Cooperative Extension Offices and Regional Branch Experiment Stations across Oregon.  When not working, Victor is combining his love of drones, education and music to produce song parodies that promote the message of flying safe. He’s the Drone Singer (@DroneSinger). It’s been a while since he’s composed a new drone song, so sit back and enjoy some of his classics, as Victor shares some of his songs and talk about the inspiration and message behind his passion.</p>",
            "length": "23131005",
            "sourceUrl": "http://traffic.libsyn.com/droneradioshow/DRS_246_Victor_Villegas_.mp3?dest-id=276003"
        },
        {
            "title": "A Mapping Software For First Responders: Angad Singh, Pix4D",
            "datePublished": "Tue, 17 Dec 2019 07:00:00 +0000",
            "description": "<p style=\"text-align: center;\"><strong>What would a mapping software designed for first responders look like?</strong></p> <p>For that question, we turn to Angad Singh, a Pix4D Technical Trainer based in Denver, Colorado.  Angad’s interest in UAS based photogrammetry started when he realized he could get incredibly high resolution data which would enable his research to make micro level insights. He has a passion for enabling people to understand the power and limitations of UAS to create great geospatial data. Angad's research background is in Remote Sensing and Precision Agriculture from McGill University in Montreal, Quebec. </p> <p>For much of this year, Angad has been working to get Pix4D React into the hands of first responders. Pix4D React is the fastest 2D mapping software designed for public safety and humanitarian aid professionals.  It is intuitive and simple to use, even for people with little or no drone flight or photogrammetry experience.  In this edition of the Drone Radio Show, Angad talks about Pix4D React and how it can support first responders and aid workers in increasing situational awareness.</p>",
            "length": "22826305",
            "sourceUrl": "http://traffic.libsyn.com/droneradioshow/DRS_245_Angad_Singh.mp3?dest-id=276003"
        },
        {
            "title": "Where Is The Drone Industry Headed? - Patrick Egan, sUAS News",
            "datePublished": "Tue, 10 Dec 2019 07:00:00 +0000",
            "description": "<p style=\"text-align: center;\"><strong>What’s the outlook for the drone industry?</strong></p> <p>That’s the question we explore in a 4-part series of podcasts with industry analysts, writers and editors.  In this series, I interview guests with diverse opinions and perspectives on the industry.  They’ll provide a range of insights on are some of the industry’s current topics and trends.  By the end of the series, you should have a good sense of where industry is going and how you can position yourself to take advantage.</p> <p>In this podcast, we’ll hear from Patrick Egan, editor of the Americas Desk at sUAS News and host and Executive Producer of the sUAS News Podcast Series, Drone TV and the Small Unmanned Systems Business Exposition. Patrick also serves as the Director of Special Programs for the Remote Control Aerial Photography Association. Patrick has spent the last 15 years working as a proponent for the business use of unmanned aircraft systems.</p> <p>If you’ve ever read some of Patrick’s news articles or posts on Twitter, where he goes by The Drone Dealer, you’ll soon find that he some strong opinions.  In this episode of the Drone Radio Show, Patrick talks about the drone industry in 2019, the outlook for 2020 and he shares his thoughts on what’s holding the industry back and what could be done to move it forward.  </p>",
            "length": "46242888",
            "sourceUrl": "http://traffic.libsyn.com/droneradioshow/DRS_244_Patrick_Egan.mp3?dest-id=276003"
        },
        {
            "title": "Drone Powered Solutions - The View from PWC: Adam Wisnieski & Michael Mazur",
            "datePublished": "Tue, 03 Dec 2019 07:00:00 +0000",
            "description": "<p style=\"text-align: center;\"><strong>What is the outlook for drones from Price Waterhouse Coopers?</strong></p> <p>For that question, we head to Warsaw, Poland to speak with Adam Wisniewski and Michael Mazur of the Drone Powered Solutions unit of Price Waterhouse Cooper.  Price Waterhouse Coopers or PwC) is a multinational professional services network with headquarters in London. PwC ranks as the second largest professional services firm in the world<a href= \"https://en.wikipedia.org/wiki/PricewaterhouseCoopers#cite_note-5\" target=\"_blank\" rel=\"noopener\">[5]</a> and is one of the Big Four auditors. It is a network of firms in 158 countries, 721 locations, with 250,930 people.</p> <p>In 2016, Drone Powered Solutions was formed and headquartered in Warsaw, Poland, as the first and globally unique Centre of Excellence powered by PwC. It specializes in commercial and industrial usage of drone technologies and helps clients from various industries maximize the potential offered by drones and geospatial data.  Adam and Michael lead a team that consists of professionals with various background – from management consultants with business experience to engineers, photogrammetry and AI experts. Drone Powered Solutions works with a wide range of international corporations in Europe, US, Canada, Middle East and Asia. </p> <p>In this edition of the Drone Radio Show, Adam and Michael talk about PwC’s Drone Powered Solutions, why Poland was selected as the units headquarters and they share insights into the worldwide commercial drone industry.</p> <p> </p>",
            "length": "35118492",
            "sourceUrl": "http://traffic.libsyn.com/droneradioshow/DRS_243__PriceWaterhouse.mp3?dest-id=276003"
        },
        {
            "title": "Drones in the Classroom - Matthew Johnson, Drone Training Zone & M3  Drone Productions",
            "datePublished": "Tue, 26 Nov 2019 07:00:00 +0000",
            "description": "<p><strong>How can high school in middle school students prepare for a future in the drone industry?</strong></p> <p>Matthew Johnson is CEO of the Drone Training Zone and M3 Drone Productions. Matthew founded M3 Aerial Productions in 2015 as an aerial data and diagnostics company using unmanned aerial vehicles. As the company evolved, Matthew began offering training courses which grew to become a major focus of the company, so much so that he created two separate entities to deliver aerial data and drone pilot training.</p> <p>In addition to being an entrepreneur, Matthew taught high school mathematics in Manitoba for five years. He used drones to instruct students on the principles of trigonometry. Matthew developed a trainee course for teachers to give them an understanding of the business opportunities in the drone industry so they could transfer that knowledge to middle and high school students.</p> <p>n this edition of the drone radio show, Matthew talks about the Drones in the Classroom program and how students can prepare themselves for exciting opportunities in the drone industry.</p>",
            "length": "29155886",
            "sourceUrl": "http://traffic.libsyn.com/droneradioshow/DRS_242_Matthew_Johnson.mp3?dest-id=276003"
        },
        {
            "title": "A DroneResponders Update On The Public Safety Use of Drones: Charles Werner, Director",
            "datePublished": "Tue, 19 Nov 2019 07:00:00 +0000",
            "description": "<p style=\"text-align: center;\"><strong>How are the Drone Responders advancing the public safety use of drones?</strong></p> <p>Charles Werner is Director of the DroneResponders, a non-profit organization whose mission is to facilitate preparedness, response and resilience using unmanned aircraft systems operated by public safety organizations around the world.  Charles Werner is the retired Charlottesville Virginia fire chief, a 44 year veteran of public safety and a FAA certified Part 107 remote pilot. He organized and is the Chair of the National Council on Public Safety UAS. He also serves on several local, state and national  committees and has authored more than 120 published articles on public safety.  In 2018, he was selected as Homeland Security Person of the Year by Homeland Security Today Magazine for his work on public safety UAS.  In this episode of the Drone Radio Show, Charles gives us an update on the Drone Responders and what to look forward to in the months ahead if you’re interested in advancing the public safety use of drones.</p>",
            "length": "24226896",
            "sourceUrl": "http://traffic.libsyn.com/droneradioshow/DRS_241_Drone_Responders.mp3?dest-id=276003"
        },
        {
            "title": "Drones For Social Good In West Africa: Tiamyou Radji, Senegal Flying Labs",
            "datePublished": "Tue, 12 Nov 2019 07:00:00 +0000",
            "description": "<p style=\"text-align: center;\"><strong>Can drones be used for social good?</strong></p> <p>Tiamyou Radji is Director of KRANTH Senegal Flying Labs, a Social Enterprise that develops concepts of collecting, sharing and using drone data to stimulate change.  KRANTH is part of the WeRebotics global network of local knowledge hubs in emerging economies.  The goal of Flying Labs is to localize the safe, responsible and meaningful use of robotics to accelerate social good solutions. Flying labs build local ecosytems and markets, creating new jobs through the use of robotics and associated data products.</p> <p>Tiamiyou has worked and consulted for a variety of social good organizations, including the UN. His experience spans business development, technology resource planning, technology risk management. Feasibility studies and consulting with international donors and agencies. Tiam led and implemented numerous information and communication technology research and projects in Africa, Asia, Europe and the Middle East.  He is a certified professional UAV pilot and has extensive experience in network security and satellite communication.</p> <p>In this edition of the drone radio show, Tiam talks about the use of drones in West Africa to provide social good and create sustainable economic development for communities.</p>",
            "length": "32102913",
            "sourceUrl": "http://traffic.libsyn.com/droneradioshow/DRS_239_Tiamyou_Radji.mp3?dest-id=276003"
        },
        {
            "title": "Is Blockchain the Answer to Securing Drone Data?- Jeff Thompson, Red Cat and Henry Ines, GoChain",
            "datePublished": "Tue, 05 Nov 2019 07:00:00 +0000",
            "description": "<p>Is Blockchain the Answer to Securing Drone Data?</p> <p>Today’s guests believe it is and they are aggressively moving to offer scalable solutions to the drone industry.  My guests today are Jeff Thompson, CEO and founder of Red Cat and Henry Ines, Chief Operating Office at GoChain. </p> <p><strong>Red Cat</strong> is the leading provider of distributed data storage, analytics and services for the growing recreational and commercial drone industry. They’ve created the industry’s first black box flight recorder that pilots, regulators, and insurance companies can rely on for secure flight data.</p> <p><strong>GoChain</strong> is a leading provider of scalable, low-cost blockchain solutions. They have partnered with some of the largest data networks in the world, including AWS, IBM and Microsoft and serve clients ranging from innovative, high impact startupst to Fortune 200 companies.</p> <p>Jeff and Henry have long history of success in their respective fields. Jeff is a serial tech entrepreneur, primarily in the telecom space, where he created and led companies from startup to successfully exits and IPOs. Henry has more than 20 years experience as a Venture Capitalist, global executive, advisor and as an entrepreneur. </p> <p>Recently, Red Cat announced a partnership GoChain to integrate its blockchain black box and distributed storage system onto the GoChain platform, which will enable Red Cat to immediately and easily deliver its technology to customers with speed and scale.</p> <p>In this edition of the Drone Radio Show, Jeff and Henry talk about Red Cat and GoChain, how blockchain technology secures drone data, and how this technology could answer the critical question surrounding privacy and security of drone data.</p>",
            "length": "28764274",
            "sourceUrl": "http://traffic.libsyn.com/droneradioshow/DRS_Red_Cat_GoChain.mp3?dest-id=276003"
        },
        {
            "title": "Better Inventory Management Using Drones: Ian Smith, CEO of Ware",
            "datePublished": "Tue, 29 Oct 2019 06:00:00 +0000",
            "description": "<p style=\"text-align: center;\"><strong>Can A Drone Make Warehouses More Efficient?</strong></p> <p>Ian Smith is CEO and co-founder of Ware, a company that builds software for indoor drones that autonomously scan and track warehouse inventory.  Ian has more than 15 years in the drone industry, having worked at Delair, an industrial-grade, fixed-wine drone manufacturer in France and more recently, DroneDeploy, a leading software company that improves workflows for drone operations. He’s an entrepreneur, a commercial helicopter pilot and host and producer of the successful Commercial Drones FM podcast.  In this edition of the Drone Radio Show, Ian talks about how drones are used to improve inventory management and how warehouse operators can use the technology to become more efficient and competitive.</p>",
            "length": "41746895",
            "sourceUrl": "http://traffic.libsyn.com/droneradioshow/DRS_237_Ian_Smith.mp3?dest-id=276003"
        },
        {
            "title": "Counter Drone Solutions Today - Ken Geyer, Liteye Systems",
            "datePublished": "Tue, 22 Oct 2019 14:38:09 +0000",
            "description": "<p style=\"text-align: center;\"><strong>Can we really stop drones?</strong></p> <p>Ken Geyer is CEO and Co-founder of Liteye Systems, a world leader and technology solutions provider and integrator for the military and commercial markets. After a successful career as a stock broker in the late 80’s, Ken realized his true interest resided in developing new companies. He successfully launched eight companies primarily focused on cutting-edge technologies and bringing useful and effective products to market.</p> <p>For the last 19+ years with Liteye, Ken and his business partner, Chief Technology Officer Tom Scott, built a strong and profitable core business with military and commercial customers. They have strategically aligned with key partners, and they continually bring new and cutting-edge solutions to market. Liteye has over $60 million in Counter Unmanned Defense systems deployed with the US Air Force and US Army in 6 different countries. In this edition of the Drone Radio Show, Ken talks about Liteye Systems, the effectiveness of counter drone solutions and the need to focus attention on the regulatory environment to protect airports and other critical assets. </p>",
            "length": "30063682",
            "sourceUrl": "http://traffic.libsyn.com/droneradioshow/DRS_236_Ken_Geyer.mp3?dest-id=276003"
        },
        {
            "title": "Learning From Independent Drone Operators - Chris The Drone Trainer",
            "datePublished": "Tue, 15 Oct 2019 06:00:00 +0000",
            "description": "<p style=\"text-align: center;\"><strong>What can we learn from independent drone operators?</strong></p> <p>Chris Anderson, also known as The Drone Trainer, is a drone operator, podcaster and educator.  As a drone industry expert who has been flying for 6 years, Chris has a proven wealth of knowledge in deployment, strategy, and drone flight training. He has worked with over 7000 students from around the world, providing instruction in everything from initial drone flight training, to real estate, mapping, modelling, public safety, inspections, construction and more. In this episode of the Drone Radio Show, Chris talks about how started and grew his drone business, how he became The Drone Trainer and he offers insights into the UAV industry from the perspective of the independent drone operator.<br /></p>",
            "length": "33500158",
            "sourceUrl": "http://traffic.libsyn.com/droneradioshow/DRS_The_Drone_Trainer.mp3?dest-id=276003"
        },
        {
            "title": "Drones As First Responders - Fritz Reber, UAS Consultant",
            "datePublished": "Tue, 08 Oct 2019 06:00:00 +0000",
            "description": "<p style=\"text-align: center;\"><strong>Can Drones Play A Role As First Responders?</strong></p> <p>William “Fritz” Reber is a retired Patrol Operations Captain, having served 27 years with the Chula Vista Police Department.  It was there that Fritz conceptualized and implemented the Drone as First Responder Program for Chula Vista. This innovative deployment of drones in investigate calls for police service has proved to be highly effective and offers a model for other police departments looking to improve efficiency, response times and service to their citizens.  Fritz played a key role Chula Vista’s selection as the San Diego IPP Public Safety Concept of Operations. He also co-authored Chula Vista’s recent Beyond Visual Line of Sight safety assessment/waiver. Since retiring from the Chula Vista, he continues to work with the City’s police department as a consultant, assisting with the implementation of the drone as first responder program. In this edition of the Drone Radio Show, Fritz talks about Chula Vista’s Drone as First Responder Program and how its helping to make the safer and more efficient.</p>",
            "length": "34983901",
            "sourceUrl": "http://traffic.libsyn.com/droneradioshow/DRS_234_Fritz_Reber.mp3?dest-id=276003"
        },
        {
            "title": "Key Take Aways from AirWorks 2019 - Adam Lisberg & Brendan Schulman, DJI",
            "datePublished": "Tue, 01 Oct 2019 06:00:00 +0000",
            "description": "<p style=\"text-align: center;\"><strong>What was the news out of DJI’s AirWorks Conference</strong></p> <p>That’s this week’s topic, as I traveled to Los Angeles to attend AirWorks 2019.  This podcast is part of a series on the conference with comments and presentations from key DJI representatives and partners.  You’ll get insights into the state of the drone industry, the current challenges, efforts to promote safety and security, and new product announcements.  In this episode of the Drone Radio Show, you’ll hear from Adam Lisberg, DJI’s Corporate Communications Director and Brendan Schulman, Vice President of Policy and Legal Affairs. </p>",
            "length": "19032146",
            "sourceUrl": "http://traffic.libsyn.com/droneradioshow/DRS_233_AirWorks.mp3?dest-id=276003"
        },
        {
            "title": "A Red Teaming Approach to Counter UAS- Scott Crino, CEO, Red Six Solutions",
            "datePublished": "Tue, 24 Sep 2019 06:00:00 +0000",
            "description": "<p style=\"text-align: center;\"><strong>How can seeing ourselves through the eyes of our adversaries strengthen counter UAS?</strong></p> <p>Scott Crino is CEO of Red Six Solutions. Red Six Solutions is a Red Teaming company that provides their clients with a view of themselves from the perspectives of their adversaries, enemies and competition. Red Six Solutions help clients discover over-the-horizon insights into as yet, unseen threats that can confound strategic decision-making and negatively impact the successful accomplishment of organizational objectives and strategic goals. </p> <p>Scott served 21 years in the U.S. Army as an Aviation and Operations Research/Systems Analysis officer in multiple combat zones holding several command and staff positions. Prior to his Red Six Solutions, Scott served as President of Crino Consulting Group and Managing Director at Teneo Holdings. He has planned and executed dozens of Red Team events for government, commercial and international clients. Scott has BS and MS degrees in industrial engineering from the University of Buffalo and Texas A&M, respectively, and a PhD in systems engineering from the University of Virginia. In this episode of the Drone Radio Show, Scott talks about Red Six Solutions, Red Teaming and gives us insights into the current state of counter drone solutions.</p>",
            "length": "27015927",
            "sourceUrl": "http://traffic.libsyn.com/droneradioshow/DRS_Scott_Crino.mp3?dest-id=276003"
        },
        {
            "title": "What Are The Drone Industry Analysts Missing? - Tom Walker, DroneUp",
            "datePublished": "Tue, 17 Sep 2019 06:00:00 +0000",
            "description": "<p style=\"text-align: center;\"><strong>Where To Make Money Now in the Drone Industry</strong></p> <p>Tom Walker is founder and CEO of DroneUp, the fastest growing drone services provider in the U.S.   DroneUp matches missions with small Unmanned Aerial System (sUAS) pilots. They locate, qualify, and deploy single pilot or multi-pilot crews according to their client’s requirements.  The company is committed to providing a comprehensive network of pilots while maintaining a steadfast commitment to safety and responsible operations.<br /> <br /> Prior to DroneUp, Tom served as president of Web Teks, a leading online and mobile research and strategy development firm. A former military officer, Tom is a recognized pioneer in military and government digital reform, having managed the programming and web systems to support both the U.S. and International Special Forces. In this edition of the Drone Radio Show, Tom talks about DroneUp, the current opportunities to make money in the industry and what the drone industry analysts seem to be missing.</p>",
            "length": "27058557",
            "sourceUrl": "http://traffic.libsyn.com/droneradioshow/DRS_231_Tom_Walker.mp3?dest-id=276003"
        },
        {
            "title": "Creating First Responder Drone Training Programs: Joey Edwards, Argus Rising",
            "datePublished": "Tue, 10 Sep 2019 06:00:00 +0000",
            "description": "<p style=\"text-align: center;\"><strong>What goes into creating a successful first-responder drone training program?</strong></p> <p>Joey Edwards is Vice-President of Operations for Argus Rising. Argus Rising provides First Responder Drone training, designed to equip public safety departments with the flight skills and knowledge needed to use drones in law enforcement and rescue operations.  There are a lot of company’s providing drone training today, and I wanted to find out how do providers create training programs in such competitive market.  In this edition of the Drone Radio Show, Joey talks about Argus Rising, its first responder training and what goes into creating a successful drone training course.</p>",
            "length": "15895707",
            "sourceUrl": "http://traffic.libsyn.com/droneradioshow/DRS_230_Joey_Edwards.mp3?dest-id=276003"
        },
        {
            "title": "How Drones Are Used In Water Rescues: Samuel Proffitt, Paramedic",
            "datePublished": "Tue, 03 Sep 2019 06:00:00 +0000",
            "description": "<p style=\"text-align: center;\"><strong>Ever wonder how drones are used to save people from drowning?</strong></p> <p>Samuel Proffitt is a paramedic,firefighter and lifeguard for the Town of Wrightsville Beach, North Carolina.  Sam has been in public safety since 2000, working for multiple agencies in North Carolina and Virgina. He received his Masters of Studies In Homeland Security from the Pennsylvania State University, Hershey School of Medicine, where he conducted extensive research in emerging technology in public safety and homeland security. He also obtained his MBA from The University of North Carolina at Chapel Hill, Kenan-Flagler Business School.  In this edition of the Drone Radio Show, Sam talks about how drones are used in water rescue situations, their best use and limitations and what organizations should consider when using drones in such situations.</p>",
            "length": "20148860",
            "sourceUrl": "http://traffic.libsyn.com/droneradioshow/DRS_229_Sam_Proffitt.mp3?dest-id=276003"
        },
        {
            "title": "Going To The Pix4D User Conference: Christopher Cressy & Chelsea Cox, Pix4D",
            "datePublished": "Tue, 27 Aug 2019 06:00:00 +0000",
            "description": "<p style=\"text-align: center;\"><strong>Are you interested in learning about 3D mapping and other photogrammetry skills?</strong></p> <p>Christopher Cressy is the Regional Managing Director and Chelsea Cox is Marketing Manager both at Pix4D. Pix4D is the leader in photogrammetry and drone mapping software for professionals. Its software is widely used in the drone industry for a variety of applications.  Earlier this year, the 8-year old company announced its first conference specifically for Pix4D users, to held in Denver on October 3-4.  In this edition of the Drone Radio Show, Chris and Chelsea talk about Pix4D, the user conference and why we should consider attending this event.</p>",
            "length": "19623684",
            "sourceUrl": "http://traffic.libsyn.com/droneradioshow/DRS_228_Pix4D_User_Conference.m4a?dest-id=276003"
        },
        {
            "title": "What Investors Look For In a Drone Based Business: Marco Rubin, CIT",
            "datePublished": "Tue, 20 Aug 2019 06:00:00 +0000",
            "description": "<p style=\"text-align: center;\"><strong>What do investors look for in a drone based business?</strong></p> <p>Marco Rubin is Senior Investment Director at the Center for Innovative Technology in Virginia.  Marco leads seed and early stage investments in the aerospace/UAS, energy, and software sectors for CIT, and serves as a board member and mentor to numerous portfolio companies. During his career, Marco has invested in over 200 early-stage technology companies, held leadership roles with funds recognized by Entrepreneur Magazine’s Annual VC 100 list and has managed various funds in information security technology, software, telecommunications and medical devices. In this episode of the Drone Radio Show, Marco talks about the Center for Innovative Technology and what venture capital funds and investors look for in a drone based business.</p>",
            "length": "36831719",
            "sourceUrl": "http://traffic.libsyn.com/droneradioshow/DRS_226_Rubio_Redux.m4a?dest-id=276003"
        },
        {
            "title": "Value of Relationships To A Drone Business:  Nicole Abbett, Photographer & Droneographer",
            "datePublished": "Tue, 13 Aug 2019 06:00:00 +0000",
            "description": "<p style=\"text-align: center;\"><strong>How important is relationship building in creating a successful drone based business?</strong></p> <p>Nicole Abbett is a Tampa based photographer, videographer, artist and drone operator. She is a graduate of the University of South Florida where she earned a Bachelor of Fine Arts with a concentration in photography. She honed her skills as an artist and photographer before starting her own commercial photography business. A few years ago, Nicole picked up a drone and launched a new career as a droneographer. After getting her Part 107 Certification, she quickly established herself as a leading aerial videographer in the Tampa Bay area, eventually landing high profile jobs and becoming the first woman to fly for the National Hockey League. She credits her success to hard work, refining her skills and nurturing strong relationships that have garnered her high profile jobs, referrals and repeat business.</p> <p>In this episode of the Drone Radio Show, Nicole talks about her path from artist/photographer to droneographer. She talks about how building strong relationships has landed her some great opportunities and what she’s done to build a successful commercial drone based business.</p>",
            "length": "30948140",
            "sourceUrl": "http://traffic.libsyn.com/droneradioshow/DRS_226a_Abbett_Redux.m4a?dest-id=276003"
        },
        {
            "title": "Using AI to Stop Rogue Drones: Sotirious Kaminis, Drone Defense Systems",
            "datePublished": "Tue, 06 Aug 2019 06:00:00 +0000",
            "description": "<p style=\"text-align: center;\"><strong>Is there a way to safely and legally take control of a rogue drone?</strong></p> <p>Sotirios Kaminis is the CEO and founder of Drone Defense Systems, a start up company that provides integrated drone detection and mitigation solutions to a variety of customers. Under a newly inked licensing agreement, the company received exclusive rights to commercialize an innovative counter drone technology developed at Embry-Riddle University. The technology, developed by Embry-Riddle faculty member Dr. Houbing Song, suggests a safe, affordable way to neutralize rogue drones – without having to shoot them down or force them to crash-land – even in civilian settings such as large outdoor entertainment arenas and airports. In this episode of the Drone Radio Show, Sotirios talks about Drone Defense Systems, the “Drone Jacking” technology developed by Dr. Houbing Song and how this technology could make the skies a whole lot safer.</p>",
            "length": "26196034",
            "sourceUrl": "http://traffic.libsyn.com/droneradioshow/DRS_225_Sotirios_Kaminis.m4a?dest-id=276003"
        },
        {
            "title": "Making It Safer To Fly Drones. - Adam Lisberg, DJI",
            "datePublished": "Tue, 30 Jul 2019 06:00:00 +0000",
            "description": "<p style=\"text-align: center;\"><strong>What is DJI Doing to Make It Safer To Fly Drones?</strong></p> <p>For that question, we turn to Adam Lisberg, Corporate Communication Director, North America, for DJI.  DJI is the world’s largest maker of personal and professional drones. Adam came to the drone world following a successful career in newspapers, from covering murders and fires in Chicago and New York to writing a Sunday column in the New York Daily News as the City Hall bureau chief. He was later head spokesman for the MTA, New York’s transit agency, steering its public communications through train derailments, Hurricane Sandy and other crises. Adam now leads DJI’s messaging on critical policy and regulatory issues affecting how drones are used in America. In this episode of the Drone Radio Show, Adam talks about a recent blue ribbon task force report on UAS Mitigation at Airports, the lack of verifiable data on drone incursions and the efforts by DJI to create safer drones and safer skies.</p>",
            "length": "39699384",
            "sourceUrl": "http://traffic.libsyn.com/droneradioshow/DRS_224_Adam_Lisberg.m4a?dest-id=276003"
        },
        {
            "title": "Keeping Drones In The Sky - Andy Osantowske, Robotic Skies",
            "datePublished": "Tue, 23 Jul 2019 06:00:00 +0000",
            "description": "<p style=\"text-align: center;\"><strong>Ever wonder how all of these drones are going to be maintained?</strong></p> <p>Andy Osantowske is Director of Operations for Robotic Skies, the only global network of certified UAS maintenance centers.  Robotic Skies offers comprehensive turnkey field service programs designed to keep UAS flying safely, efficiently and affordably around the world. Founded in 2014, the company has more than 170 certified centers in more than 40 countries, providing maintenance, repair, operations and support services for commercial UAS. In this edition of the Drone Radio Show, Andy talks about company’s UAS maintenance and repair service and how it can help operators save time, money and maintain mission readiness.</p>",
            "length": "27805123",
            "sourceUrl": "http://traffic.libsyn.com/droneradioshow/DRS_223_Andy_Osantowske.m4a?dest-id=276003"
        },
        {
            "title": "Ever Wanted To Fly There?  Now You Can! - Tal Fromchenko, FlyThere",
            "datePublished": "Tue, 16 Jul 2019 06:00:00 +0000",
            "description": "<p style=\"text-align: center;\"><strong>Want to fly a drone in an exotic world location?</strong></p> <p>Tal Fromchenko is Co-founder and CEO of FlyThere, a new start up that lets people remotely fly drones all around the world from their own laptops. It’s an immersive way to experience the world without actually traveling.  Tal has several years in the software industry and with tech start ups. FlyThere is his most recent venture and offers exciting opportunities for people wanting to travel and fly drones.  In this episode of the Drone Radio Show, Tal talks about the origins of the company, how users can easily and safely pilot a drone in far away lands and how real time remote flying could change the we travel.</p>",
            "length": "21904911",
            "sourceUrl": "http://traffic.libsyn.com/droneradioshow/DRS_222_Tal_Fromchenko.m4a?dest-id=276003"
        },
        {
            "title": "The Key To A Reliable UTM System: Avner Turniansky, Vorpal, LTD.",
            "datePublished": "Tue, 09 Jul 2019 06:00:00 +0000",
            "description": "<p style=\"text-align: center;\"><strong>What is the key component of an reliable UTM system?</strong></p> <p>Avner Turniansky is Vice President of Strategy at Vorpal, an Israeli manufacturer of signal analysis products and solutions for drone detection, geolocation, tracking and mitigation. Before joining Vorpal, Avner has, for the last 15 years, carried our various senior management roles with several start up companies.  He is a signal intelligence specialist, having served a lengthy career with Israel’s prestigious Unit 8200 with the rank of Lieutenant Colonel. In this edition of the Drone Radio Show, Avner gives us some insights into Vorpal’s signal technology and how it can detect, track and monitor drone activity with a high degree of precision.</p>",
            "length": "31172941",
            "sourceUrl": "http://traffic.libsyn.com/droneradioshow/DRS_221_Avner_Turniansky.m4a?dest-id=276003"
        },
        {
            "title": "Managing Air Space Security for UAS: Robert Tabbara, 911 Security",
            "datePublished": "Tue, 02 Jul 2019 06:00:00 +0000",
            "description": "<p style=\"text-align: center;\"><strong>How can we manage air space security?</strong></p> <p>Robert Tabbara is President and Founder of 911 Security, a leading UAS security software company that specializes in delivering sUAV Airspace Detection Solutions for a wide array of infrastructure and assets.  Their mission is to protect and secure your airspace against drones that threaten the safety, security and privacy of your facility. In this edition of the Drone Radio Show, Robert talks about 911 Security, it’s drone risk assessment program and offers insights into maintaining airspace security for UAS.</p>",
            "length": "25541166",
            "sourceUrl": "http://traffic.libsyn.com/droneradioshow/DRS_220_Robert_Tabbara.m4a?dest-id=276003"
        },
        {
            "title": "The Genius NY Accelerator For UAS Start Ups: Jon Parry (Genius NY) & Ryan Plekach, (Resilienx)",
            "datePublished": "Tue, 25 Jun 2019 06:00:00 +0000",
            "description": "<p style=\"text-align: center;\"><strong>Can the Genius NY Accelerator Help Launch Your UAS Startup?</strong></p> <p>Jonathan Parry is Director of GENIUS NY at The Tech Garden in downtown Syracuse, NY.  The Tech Garden is home to Upstate New York's most promising technology startups.  Genius NY is an accelerator program focused on unmanned systems. It will award up to $3 million in grand prizes during its 12-month in-residence business competition. The program will focus on early stage technologies in the category of unmanned systems including hardware, software, and analytics. Jon has more than 12 years experience with start-ups and business development in the UAS industry.</p> <p>In this edition of the Drone Radio Show, Jon talks about the Genius NY program and how it’s advancing the creation of innovative UAS companies.  Joining Jon is Ryan Pleskach, Founder and COO of Resilienx one of the companies in the current Genius NY program. Ryan shares what its been like going through the accelerator experience and how it’s helped evolve the company.</p>",
            "length": "38289094",
            "sourceUrl": "http://traffic.libsyn.com/droneradioshow/DRS_219_GeniusNY.m4a?dest-id=276003"
        },
        {
            "title": "The Drone Responders: Charles Werner, Director",
            "datePublished": "Tue, 18 Jun 2019 06:00:00 +0000",
            "description": "<p style=\"text-align: center;\"><strong>Who are the DroneResponders and why should we have an interest?</strong></p> <p>Charles Werner is Director of the DroneResponders, a non-profit organization whose mission is to facilitate preparedness, response and resilience using unmanned aircraft systems operated by public safety organizations around the world.  Charles Werner is the retired Charlottesville Virginia fire chief, a 44 year veteran of public safety and a FAA certified Part 107 remote pilot. He organized and is the Chair of the National Council on Public Safety UAS. He also serves on several local, state and national  committees and has authored more than 120 published articles on public safety.  In 2018, he was selected as Homeland Security Person of the Year by Homeland Security Today Magazine for his work on public safety UAS.  In this edition of the Drone Radio Show, Charles talks benefit of creating a grass roots UAS ecosystem to facilitate learning, knowledge transfer and best practices on the use of UAS in public safety.</p>",
            "length": "22825899",
            "sourceUrl": "http://traffic.libsyn.com/droneradioshow/DRS_218_Charles_Werner.m4a?dest-id=276003"
        },
        {
            "title": "UAS Economic Development In Virginia: Tracy Tynan, Virginia Unmanned Systems Center",
            "datePublished": "Tue, 11 Jun 2019 06:00:00 +0000",
            "description": "<p style=\"text-align: center;\"><strong>What can we learn from efforts to promote UAS Economic Development in Virginia?</strong></p> <p>Tracy Tynan is Director of the Virginia Unmanned Systems Center.  Housed at the Center of Innovative Technology, the Virginia Unmanned Systems Center at CIT serves as a unified voice and central source for information and assistance related to the unmanned systems landscape in Virginia. Tracy has more than 15 years of economic and community development and is responsible for instilling an entrepreneurial culture regarding unmanned systems across the Commonwealth. In this role, her main focus is to increase collaboration and communication among the various entities engaged with unmanned systems with the goal of growing unmanned systems economic activity and benefit in Virginia. In this edition of the Drone Radio Show, Tracy talks about the Virginia Unmanned Systems Center and efforts to promote UAS economic development. Joining Tracy is Marco Rubin, Senior Investor Director at the Center for Innovative Technology.</p>",
            "length": "37416407",
            "sourceUrl": "http://traffic.libsyn.com/droneradioshow/DRS_217_Tracey_Tynan.m4a?dest-id=276003"
        },
        {
            "title": "STEM Education At 75 MPH: Ron Poynter, OnPoynt Drone Solutions",
            "datePublished": "Tue, 04 Jun 2019 06:00:00 +0000",
            "description": "<p style=\"text-align: center;\"><strong>What is the fastest growing High School STEM Education Initiative Today?</strong></p> <p>If you said, Drone Racing Clubs, you’d be spot on.  Just do a web search and you find dozens of articles and videos of high school drone racing clubs springing up all over the country.  Drone racing is a great way to engage students in an exciting new sport, and as they build, code and race drones, they’re learning about physics, electronics, aerodynamics, computer programming and a host of other STEM-related topics.</p> <p>Ron Poynter, President of OnPoynt Drone Solutions, the nation’s leading supplier of Drone Education Kits and training for STEM Education. In this episode of the Drone Radio Show, Ron talks about the rise of high school drone racing clubs, the STEM education value and what the popularity of drone racing clubs mean for the overall drone industry.</p>",
            "length": "19961156",
            "sourceUrl": "http://traffic.libsyn.com/droneradioshow/DRS_216_Ron_Poynter.m4a?dest-id=276003"
        },
        {
            "title": "Drones Designed Specifically For Inside Industrial Inspections: Patrick Thevoz, Flyability",
            "datePublished": "Tue, 28 May 2019 06:00:00 +0000",
            "description": "<p>Can indoor drones provide a high return of investment?</p> <p>Patrick Thevoz is Co-founder and CEO of Flyability, the leading professional indoor drone company aiming to increase efficiency and reduce risks for humans in industrial inspections. Under his tenure, Flyability grew from 2 to over 60 employees and has over 300 customers. Before founding Flyability, Patrick worked as a strategy consultant in the life sciences industries. In this edition of the Drone Radio Show, Patrick talks about Flyability’s indoor industrial inspection drones, what makes them unique compared to outdoor drones and the return on investment that can be realized.</p>",
            "length": "26351231",
            "sourceUrl": "http://traffic.libsyn.com/droneradioshow/DRS_215_Patrick_Thevor.m4a?dest-id=276003"
        },
        {
            "title": "Federal Policy Initiatives and Drones: Shawn Bullard, Duetto Group",
            "datePublished": "Tue, 21 May 2019 06:00:00 +0000",
            "description": "<p style=\"text-align: center;\"><strong>What are Washington insiders saying about drones?</strong></p> <p>For that question, we turn to Shawn Bullard, president of the Duetto Group, a Capitol Hill based government relations firm. Shawn has long career in federal policy.  Prior to leading Duetto Group, Shawn served as vice president of government relations for one of the oldest PR firms in the nation, and as a senior congressional staff member to a long-serving member of the House Armed Services Committee, and Transportation Committee's Merchant Marine and Coast Guard subcommittee. Throughout his professional career he has had the pleasure to collaborate with some of the most recognizable brands in the world. He has served on multiple boards, including the Royal Aeronautical Society, the National Press Club and the Schar School of Policy and Government.</p> <p>In this edition of the Drone Radio Show, Shawn talks about federal UAS policy issues, Air Mobility, the 2019 Drone Focus Conference and he shares with us a new podcast on federal UAV policy that all of us will find value.</p>",
            "length": "21363420",
            "sourceUrl": "http://traffic.libsyn.com/droneradioshow/DRS_214_Shawn_Bullard.m4a?dest-id=276003"
        },
        {
            "title": "How Public Safety Organizations Can Prepare for UAS Threats: Guy Nelson, redUAS",
            "datePublished": "Tue, 14 May 2019 06:00:00 +0000",
            "description": "<p>Guy Nelson, Operations Director for redUAS, a consulting firm that focuses on technology-agnostic solutions and training to mitigate UAS threats. The company is made up of combat-proven drone professionals with real-world counter-UAS experience who can help customers gain a true understanding of the threat.</p> <p>Guy served 11 years as a Marine Corps officer and naval aviator. He deployed in support of Operation Enduring Freedom and Operation Inherent Resolve as a Harrier pilot and strategic planner for air power and counter-UAS operations. He is also co-founder of Attollo, LLC a veteran-owned start up that provides unmanned aircraft and associated technology training and consulting services.   A frequent speaker on counter-UAS, Guy will be on a panel on that topic at this year’s Drone Focus 2019 conference in Fargo, North Dakota on May 29. </p> <p>In this edition of the Drone Radio Show, Guy shares how public safety organizations can identify and reduce risks of UAS threats to their assets and special events. He also gives us a glimpse into his Drone Focus panel presentation.</p>",
            "length": "27000252",
            "sourceUrl": "http://traffic.libsyn.com/droneradioshow/DRS_213_Guy_Nelson.m4a?dest-id=276003"
        },
        {
            "title": "Using Drones to Teach Computer Coding, Michelle Dunphy & Kimberly Gudanis",
            "datePublished": "Tue, 07 May 2019 06:00:00 +0000",
            "description": "<p style=\"text-align: center;\"><strong>What's the next level up for Drones in Stem Education?</strong></p> <p>For that question, we turn to Michelle Dunphy and Kimberly Gudinas from Fitzgerald Elementary School in Prince William County, Virginia.  Kimberly Gudinas is principal at Fitzgerald Elementary and Michelle Dunphy is the school’s Instructional Technology Coach.  Earlier this year, the school launched a STEM program that featured drones. What makes program interesting is that the drones are used to help students learn and master computer coding skills. It’s another step in the school’s strategy to prepare students for a future where programming language is seen as an essential skill.  In this edition of the Drone Radio Show, Michelle and Kim talk about STEM education at Fitzgerald Elementary and how drones are used to teach students computer coding.</p>",
            "length": "27964249",
            "sourceUrl": "http://traffic.libsyn.com/droneradioshow/DRS_212_Dumphy-Gudinas.m4a?dest-id=276003"
        },
        {
            "title": "Rising Trends In the Counter UAS Market - Michael Blades, Frost & Sullivan",
            "datePublished": "Tue, 30 Apr 2019 06:00:00 +0000",
            "description": "<p style=\"text-align: center;\"><strong>How is the Counter UAS market growing?</strong></p> <p>For that question, we turn to Michael Blades, Research Director for Frost & Sullivan’s Aerospace, Defense, and Security business unit. Frost & Sullivan is a business consulting firm involved in market research and analysis, growth strategy consulting and corporate training across multiple industries. Michael has been with Frost & Sullivan for nearly 8 years as a market analyst and growth consultant and has earned a Masters Degree in Aerospace Operations as well as an MBA.  In this episode of the Drone Radio Show, Michael talks about the growth and trends shaping the counter UAS industry today.</p>",
            "length": "26790168",
            "sourceUrl": "http://traffic.libsyn.com/droneradioshow/DRS_211_Michael_Blades.m4a?dest-id=276003"
        },
        {
            "title": "Using Drones To LeapFrog Infrastructure Challenges in Africa, Edward Anderson, World Bank",
            "datePublished": "Tue, 23 Apr 2019 06:00:00 +0000",
            "description": "<p style=\"text-align: center;\"><strong>Can drones fulfill a critical transportation need in isolated areas of Africa?</strong></p> <p>Today’s guest believes they can. Edward Anderson is a Senior Innovation Policy Specialist at the World Bank’s Global ICT unit. Since 2014 he has been based in Dar es Salaam, Tanzania, where he represents the World Bank on Technology and Innovation. As part of this role he leads work supporting the governments’ Open Data Initiative and is responsible for designing government modernization projects in UAV mapping, citizen data, microwork and smart sensors.</p> <p>According to World Bank estimates, Africa needs to spend $38 billion more each year on transport infrastructure, plus a further $37 billion on operations and maintenance to sustain its current levels of development. A significant financing deficit lies between Africa's reality and the mobility that it both needs and aspires to. Only 34% of Africa's population is within 2 kilometres of an all-weather road.</p> <p>To address this critical need, the World Bank is sponsoring the Lake Victoria Challenge (LVC), an ambitious project that aims to explore drones as a new mobility model for the hard-to-reach, rural communities of the Lake Victoria region of Tanzania.</p> <p>In this episode of the Drone Radio show, Edward talks about the Lake Victoria Challenge and what it means to the future of Africa.</p>",
            "length": "37206254",
            "sourceUrl": "http://traffic.libsyn.com/droneradioshow/DRS_210_Edward_Anderson.m4a?dest-id=276003"
        },
        {
            "title": "A Marketplace for Autonomous Drone Services - Derek Waleko, UpSonder",
            "datePublished": "Tue, 16 Apr 2019 06:00:00 +0000",
            "description": "<p style=\"text-align: center;\"><strong>Is there a marketplace for autonomous drone services?</strong></p> <p>Derek Waleko is CEO and co-founder of UpSonder, a drone startup that provides drone services to businesses around the country ranging from local real estate agents to major energy companies. Its vision is to be a one-stop solution for drone services—which Goldman Sachs estimates will be worth $13 billion by 2020. The company went live in March 2017 and has grown into one of the largest drone marketplaces in the country. As a forward looking company, UpSonder is preparing to integrate autonomous flight services to augment its marketplace for human piloted drones.  In this episode of the Drone Radio Show, Derek talks about the growth of Upsonder since its launch, how the company plans to offer autonomous flight services and how we can participate in a uniqued funding opportunity to help raise capital for the release of UpSonder Marketplace 2.0.</p>",
            "length": "22865999",
            "sourceUrl": "http://traffic.libsyn.com/droneradioshow/DRS_209_Derek_Waleko_Marketplace.m4a?dest-id=276003"
        },
        {
            "title": "How to Turn Your Passion for Repairing Drones Into a Business: Rob Schwartz, Thunderdrones",
            "datePublished": "Tue, 09 Apr 2019 06:00:00 +0000",
            "description": "<p style=\"text-align: center;\"><strong>Is it possible to create a successful drone repair business today?</strong></p> <p>For that question, we go to Duluth, Georgia to hear from Rob Schwartz, owner of Thunderdrones a drone repair business. Rob began flying RC airplanes in the early 80’s and expanded into scale RC airplanes, helicopters, cars, trucks and  boats, and in 2016, he added drones. He remains active with RC cars and trucks, but his passion is now drones. So much so, that he started buying, selling and repairing drones. Since 2016, he has repaired more than 3,000 drones and is a frequent contributor and mentor on the Mavic Pilots forum when he helps pilots trouble shoot problems.  Rob flies at least 4 times a week, and also test flies customers aircraft,  He’s also a licensed private pilot with instrument training and complex rating. In this edition of the drone radio show, Rob talks about the common repair issues with DJI drones, provides some tips on how to maximize your enjoyment and how he created a successful drone repair business.</p>",
            "length": "29800673",
            "sourceUrl": "http://traffic.libsyn.com/droneradioshow/DRS_208_Rob_Schwartz.m4a?dest-id=276003"
        },
        {
            "title": "Ten Ways To Become A Better Steward Of The Drone Industry: Ken Christensen, Foresight AI",
            "datePublished": "Tue, 02 Apr 2019 06:00:00 +0000",
            "description": "<p style=\"text-align: center;\"><strong>How can we become a better steward of the drone industry?</strong></p> <p>For that question we turn to Ken Christensen, Co-Founder of Foresight AI as well as Vice-President of Flight Operations. Foresight AI is a Robotic AI company using sUAS to provide accurate HD 3D Point Clouds for autonomous robots. Ken has over 30 years of experience in the aviation field both in the government and private sector. Ken has served in the Air Force, NASA, California Air National Guard and the Department of Homeland Security and has extensive aviation and aerospace experience.  He is a Subject Matter Expert (SME) for UAS Drone Detection/Counter Drone technology, space based solutions and aviation airborne sensor solutions. He served in Air Force Special Operations and Air Combat Command and is a veteran of three wars, completing 117 combat and combat support missions. In addition, he remains an active commercial pilot as well as a commercial sUAS Pilots. In this edition of the Drone Radio Show, Ken talks about how drone operators can be effective stewards and Ambassadors of the Drone industry. He’ll share his 10 ways to become better steward and grow the industry.</p>",
            "length": "24962330",
            "sourceUrl": "http://traffic.libsyn.com/droneradioshow/DRS_207_Ken_Christensen.m4a?dest-id=276003"
        },
        {
            "title": "Lessons From Serving The Military Sector: Luke Layman, CEO Vector Aerial",
            "datePublished": "Tue, 26 Mar 2019 06:00:00 +0000",
            "description": "<p style=\"text-align: center;\"><strong>What can be learned from serving the military UAV sector?</strong></p> <p>For that question we turn to Luke Layman, CEO of Vector Aerial, a leading provider of unmanned aerial systems and services offering custom, innovative and cost-effective solutions. Luke is a former United States Air Force fighter pilot with more than 15 years of aerospace experience in critical leadership, training and high technology roles. He founded Vector Solutions in 2014 and subsequently Vector Aerial to provide premier drone solutions.  He holds several flight certifications, including Airline Transport Pilot, Flight Instructor Instruments and Part 107. Luke is highly regarded as an aviation and defense expert and leads the Vector team in providing creative solutions to complex problem sets. In this episode, Luke talks about Vector Aerial, its work with at the 2019 Super Bowl for CNN and the benefits of serving both the military and commercial UAS markets.</p>",
            "length": "19870395",
            "sourceUrl": "http://traffic.libsyn.com/droneradioshow/DRS_206_Luke_Layman.m4a?dest-id=276003"
        },
        {
            "title": "An Open Source Autonomous Flying System, Nina Rong, GAAS",
            "datePublished": "Tue, 19 Mar 2019 06:00:00 +0000",
            "description": "<p style=\"text-align: center; padding-left: 30px;\"><strong>Can An Open Source Autonomous Flying System Speed Up the Development of Flying Cars?</strong></p> <p>That’s the hope of a group of software engineers in China. Nina Rong is the community manager for the Generalized Autonomous Aviation System, or GAAS for short. GAAS is an open source project and community, dedicated to an autonomous aviation system for drones and flying cars. It offers developers and drone companies a software development platform for autonomous flight, collision avoidance, route planning and more. The ultimate goal of the project is to provide a safe and intelligent autonomous aviation system to expedite the coming of flying cars. In this episode of the Drone Radio Show, Nina talks about the GAAS open source system, how users can access it and its role in promoting the development of flying cars.</p>",
            "length": "22676191",
            "sourceUrl": "http://traffic.libsyn.com/droneradioshow/DRS_204_Nini_Rong.m4a?dest-id=276003"
        },
        {
            "title": "Notes From The Drone Alliance Europe: Christoph Raab, Exe. Director",
            "datePublished": "Tue, 12 Mar 2019 06:00:00 +0000",
            "description": "<p style=\"text-align: center;\"><strong>How is the European Drone Industry evolving?</strong></p> <p>For that question we turn to Christoph Raab, Executive Director of the Drone Alliance Europe.  The Drone Alliance Europe is a coalition of leading technology companies representing the commercial drone industry before European political leaders, regulators, and industry stakeholders, as well as international regulatory and advisory bodies. In addition to his role as Chairman, Christoph also founded the European Security Round Table in 2006. He is a regular speaker and chairman at defense and cyber security conferences. He is also a member of the Advisory Board for the UAVExpo Europe, which will be held in Amsterdam on April 8 – 10.</p> <p>In this edition of the Drone Radio Show, Christoph talks about the Drone Alliance Europe, some of the key issues and opportunities facing the European drone industry and the UAV Expo Europe.  Christoph will also talk about a UAV Expo Europe panel that he will be participating on Smart Cities and Urban Mobility.</p>",
            "length": "24596293",
            "sourceUrl": "http://traffic.libsyn.com/droneradioshow/DRS_203_Christoph_Raab.m4a?dest-id=276003"
        },
        {
            "title": "Finding Your Niche in the Drone Industry: Robert Dahlstrom, CEO Apellix",
            "datePublished": "Tue, 05 Mar 2019 07:00:00 +0000",
            "description": "<p style=\"text-align: center;\"><strong>Are you trying to find your niche in drone industry?</strong></p> <p>Robert Dahlstrom is CEO and founder of Apellix, an aerial robotics company that produces tethered drones that fly in very close proximity to structures, to paint, clean and measure (among other things). The precision controlled drones are able to autonomously complete maintenance and measurement tasks, significantly reducing costs and keeping people out of harm's way. In this edition of the Drone Radio Show, Robert talks about Apellix and its revolutionary drones, how the company found its niche in the industrial sector of the drone industry and he shares some lessons that other entrepreneurs might want to consider as they create a drone based business.</p>",
            "length": "27077112",
            "sourceUrl": "http://traffic.libsyn.com/droneradioshow/DRS_202_Robert_Dahlstrom_Apellix.m4a?dest-id=276003"
        },
        {
            "title": "Getting State of the Are Tactical Drone Training: Ryan English, CEO FLYMOTION",
            "datePublished": "Tue, 26 Feb 2019 07:00:00 +0000",
            "description": "<p style=\"text-align: center;\"><strong>Where can you go to get the state of the art tactical training in the use of drones?</strong></p> <p>If you ask today’s guest, he would point you to the Unmanned Tactical Applications Conference on March 25-28 in Perry, Georgia.  Ryan English is CEO and co-founder of FLYMOTION, an industry leader in providing innovative unmanned system solutions. FLYMOTION works with government and private industry in a variety of areas, but in recent years, the company has emerged as a leader in the Defense, Public Safety and Emergency Response sectors. On March 25-28, Fly Motion will host the first Unmanned Tactical Applications Conference, where public safety officials will gather to engage in a hands on training in the use of drones in tactical situations. In this edition of the Drone Radio Show, Ryan talks about the UTAC Conference and how public safety organizations can benefit from attending.</p> <p> </p>",
            "length": "16205823",
            "sourceUrl": "http://traffic.libsyn.com/droneradioshow/DRS_201_Ryan_English_UTAC.m4a?dest-id=276003"
        },
        {
            "title": "A Better Way To Control Drones: Scott Parazynski, Fluidity Technology",
            "datePublished": "Tue, 19 Feb 2019 07:00:00 +0000",
            "description": "<p style=\"text-align: center;\"><strong>Is there a better way to control a drone</strong></p> <p>Today's guest thinks there is, and he’s here to talk about it. Dr. Scott Parazynski is a highly decorated physician and astronaut recently inducted into the U.S. Astronaut Hall of Fame. Scott has lived and traveled all over the world spending many of his grade school years in places like Senegal, Lebanon, Iran and Greece. A graduate of Stanford University and Medical School, he went on to train at Harvard and in Denver in emergency medicine. In 1992 he was selected to join NASA’s Astronaut Corps and eventually flew 5 space shuttle missions and conducted 7 spacewalks. In October 2007, Scott led the space walking team on STS 120, during which he performed four EVAs. In addition to being a diver and an accomplished mountaineer, Scott is also a commercial instrument multi-engine and seaplane rated pilot. On May 20th, 2009 he became the 1st, and so far only, astronaut to climb to the top of Mount Everest.</p> <p>He is a prolific product developer and serves on the boards of several companies. He recently launched Fluidity Technologies, a technology innovation company focused on redefining movement through 3 dimensional space. Its mission is to simplify and improve motion in an increasingly complex world. In the fall of 2018, Fluidity Technologies launched the FT Aviator, its first single-handed flight control device for drones, designed to dramatically increase the precision of drone flight while tremendously simplifying it. In this edition of the Drone Radio Showm, Scott talks about the fluidity of FT Aviator, the challenges of starting a new drone company and how seeing the world from space and Mt Everest compares with creating a new product</p>",
            "length": "25358026",
            "sourceUrl": "http://traffic.libsyn.com/droneradioshow/DRS_200_Scott_Parenzski.m4a?dest-id=276003"
        },
        {
            "title": "Business Expectations: Doug La Farge, DT Aerial Systems",
            "datePublished": "Tue, 12 Feb 2019 07:00:00 +0000",
            "description": "<p style=\"text-align: center;\"><strong>Is the Drone Industry Meeting Your Expectations?</strong></p> <p>That’s the question that I posed to Doug La Farge, CEO of DT Aerial Systems in Boulder, Colorado.  My interview with Doug is part of a series of interviews with independent drone operators to get their perspective on the rewards and challenges of starting a business today. In this episode of the Drone Radio Show, Doug talks about what’s worked and what hasn’t so far in building his drone based business.</p>",
            "length": "14095750",
            "sourceUrl": "http://traffic.libsyn.com/droneradioshow/DRS_199_Doug_La_Farge.m4a?dest-id=276003"
        },
        {
            "title": "Drone Racing in 2019: Nick Horbaczewski, Drone Racing League",
            "datePublished": "Tue, 05 Feb 2019 07:00:00 +0000",
            "description": "<p style=\"text-align: center;\"><strong>What can we look forward to in Drone Racing in 2019?</strong></p> <p>For that question, we turn to Nicholas Horbaczewski, CEO & Founder of The Drone Racing League, the premier global, professional drone racing circuit for elite pilots. With custom built racing drones traveling more than 90 MPH+, pilots race FPV (First Person View) through the most insane 3D courses ever created outside of a video game. The Drone Racing League is about three year old and when it started, many questioned the long-term viability of drone racing as a legitimate sport. In this edition of the Drone Radio Show, Nick talks about the league’s ascent from fad to a worldwide sport. We also learn about the 2019 Swatch DRL Tryouts to be held in Las Vegas on February 9 and the upcoming AlphaPilot challenge, which aims to accelerate the development and testing of fully autonomous drone technologies.</p>",
            "length": "23649412",
            "sourceUrl": "http://traffic.libsyn.com/droneradioshow/DRS_198_Nick_Horbaczewski.m4a?dest-id=276003"
        },
        {
            "title": "\"The View From a New Drone Service Provider\": Don Casey, Texas Aerial Systems",
            "datePublished": "Tue, 29 Jan 2019 07:00:00 +0000",
            "description": "<p>What can you expect as a new independent drone service provider?</p> <p>For that question, we look to the Dallas/Fort Worth area and to Don Casey, CEO of Texas Aerial Systems. Don has been flying drones for several years, and about six months ago, he launched his drone based business. My interview with Don is part of a series of interviews with independent drone operators to get their perspective on the rewards and challenges of starting a business today. In this episode of the Drone Radio Show, Don talks about the importance of having good mentors, of competing with larger more established drone companies and marketplaces and the challenges and rewards of developing his business.</p>",
            "length": "15473820",
            "sourceUrl": "http://traffic.libsyn.com/droneradioshow/DRS_197_Don_Casey.m4a?dest-id=276003"
        },
        {
            "title": "Are Drones Coming To Your Library? - Ida Joiner, Librarian, Author and Technologist",
            "datePublished": "Tue, 22 Jan 2019 07:00:00 +0000",
            "description": "<p style=\"text-align: center;\"><strong>Are drones coming to your library?</strong></p> <p>To help us answer that question, we turn to Ida Joiner, an author librarian, and doctoral student. Ida currently serves as the Senior Librarian at the Universal Academy school in Irving, Texas. Her first book, “Emerging Library Technologies: It’s Not Just for Geeks” focuses on Artificial Intelligence, Robotics, Drones, Driverless Vehicles and many other innovations. Ida has published several articles on drones and how obtain stakeholder buy-in for implementing technologies. In addition to her writing, Ida is an active member of the American Library Association, the Library & Information Technology Association Division and the International Relations Roundtable. In this edition of the Drone Radio Show, Ida talks about how drones are being integrated into libraries across the nation and the future of drones in the library system.</p>",
            "length": "18657382",
            "sourceUrl": "http://traffic.libsyn.com/droneradioshow/DRS_196_Ida_Joiner.m4a?dest-id=276003"
        },
        {
            "title": "Drone Operators Share Their Story Part 1: Micah Zimmerman, Amdak Productions",
            "datePublished": "Tue, 15 Jan 2019 07:00:00 +0000",
            "description": "<p style=\"text-align: center;\"><strong>Is the drone industry meeting your expectations?</strong></p> <p>The first in a four-part podcast series that explores the question of whether drone operators are meeting their expectations in the drone industry. The results are what we might expect – some are meeting their expectations and some aren’t. But the real value is hearing the challenges and opportunities that each operator is experiencing and how you can learn from their situation. Today’s guest is Micah Zimmerman, Owner of Amdak, a drone services company in Fargo, North Dakato. Micah shares how he’s building his business and overcoming challenges to reach his goals.</p>",
            "length": "16473220",
            "sourceUrl": "http://traffic.libsyn.com/droneradioshow/DRS_195_Micah_Zimmerman.m4a?dest-id=276003"
        },
        {
            "title": "Thermal Imaging and Beyond: Randall Warnas, Flir Systems",
            "datePublished": "Tue, 08 Jan 2019 07:00:00 +0000",
            "description": "<p style=\"text-align: center;\"><strong>How are thermal cameras used in the drone industry?</strong></p> <p>For that question, we turn to Randall Warnas of FLIR Systems. Flir designs, develops, manufactures, markets, and distributes thermal imaging technologies that</p> <p>protect and save lives, promote efficiency and innovate consumer-facing technologies. At Flir, Randall runs the company’s sUAS global business, and has a singularly unique perspective of the drone industry. From pioneering drone retail in 2014, he went on to develop the initial stages and foundation of DJI’s Enterprise business. Now working for FLIR, he has engaged with tens of thousands of end-users in both the consumer and commercial space. In this edition of the Drone Radio Show, Randall introduces us to Flir Systems, their thermal drone technology and discusses some of use cases for thermal imaging.</p>",
            "length": "31506996",
            "sourceUrl": "http://traffic.libsyn.com/droneradioshow/DRS_194_Randall_Warnas.m4a?dest-id=276003"
        },
        {
            "title": "What Investors Look For In a Drone Based Business: Marco Rubin, CIT",
            "datePublished": "Tue, 01 Jan 2019 07:00:00 +0000",
            "description": "<p style=\"text-align: center;\"><strong>What do investors look for in a drone based business?</strong></p> <p>For that question we turn to Marco Rubin, Senior Investment Director at the Center for Innovative Technology in Virginia.  Marco leads seed and early stage investments in the aerospace/UAS, energy, and software sectors for CIT, and serves as a board member and mentor to numerous portfolio companies. During his career, Marco has invested in over 200 early-stage technology companies, held leadership roles with funds recognized by Entrepreneur Magazine’s Annual VC 100 list and has managed various funds in information security technology, software, telecommunications and medical devices. In this episode of the Drone Radio Show, Marco talks about the Center for Innovative Technology and what venture capital funds and investors look for in a drone based business.</p>",
            "length": "37106374",
            "sourceUrl": "http://traffic.libsyn.com/droneradioshow/DRS_193_Marco_Rubin.m4a?dest-id=276003"
        },
        {
            "title": "Drone Industry Year in Review: Various Guests",
            "datePublished": "Tue, 25 Dec 2018 07:00:00 +0000",
            "description": "<p style=\"text-align: center;\"><strong>When we look back at the drone industry in 2018, what will we say?</strong></p> <p>Well actually, to answer that question, all we have to do, is listen back to what my many had to say.  2018 was a year of innovation, progress, change, optimism and challenge – as the industry continued to mature and evolve. In this edition of the Drone Radio Show, I compiled short snippets from nearly 50 of my guests on their thoughts on the drone industry, on creating value and on building a drone based business. So as the year comes to a close, let’s sit back and hear from some of the leaders of drone industry.</p>",
            "length": "26028464",
            "sourceUrl": "http://traffic.libsyn.com/droneradioshow/DRS_192_Year_In_Review.m4a?dest-id=276003"
        },
        {
            "title": "What We Learned About the Drone Industry in 2018: Colin Snow, Skylogic Research, LLC.",
            "datePublished": "Tue, 18 Dec 2018 07:00:00 +0000",
            "description": "<p style=\"text-align: center;\"><strong>What did we learn in 2018 about where the drone industry is headed?</strong></p> <p>For that question, we turn to Colin Snow, CEO and Founder of Skylogic Research, LLC (also known as Drone Analyst®).  Skylogic Research is a research, content and advisory services firm providing research-based insights on commercial drone market segments. Its mission is to help companies make critical investment decisions with confidence. Colin is a 25 year technology industry veteran with a background in market research, enterprise software, electronics, digital imaging, and mobility. His experience includes aerial photography as well as making, programming, and piloting remote control aircraft. He holds an MBA from Florida Atlantic University, is a member of all major UAS industry groups including both AUVSI and AMA, and also holds an FAA Part 107 Remote Pilot certification. In this edition of the Drone Radio Show, Colin talks about the forces that shaped the drone industry in 2018 and what we might expect in 2019.  There’s no better person from which to gain insights into the drone industry than Colin Snow.</p>",
            "length": "30949420",
            "sourceUrl": "http://traffic.libsyn.com/droneradioshow/DRS_191_Colin_Snow_2018.m4a?dest-id=276003"
        }
    ]
}