{
    "artwork": "http://is5.mzstatic.com/image/thumb/Music71/v4/1d/84/b8/1d84b890-7954-7df5-b1ad-de6e103cd85a/source/100x100bb.jpg",
    "description": "EconTalk is an award-winning weekly talk show about economics in daily life. Featured guests include renowned economics professors, Nobel Prize winners, and exciting speakers on all kinds of topical matters related to economic thought.  Topics include health care, business cycles, economic growth, free trade, education, finance, politics, sports, book reviews, parenting, and the curiosities of everyday decision-making. Russ Roberts, of the Library of Economics and Liberty (econlib.org) and George Mason U., draws you in with lively guests and creative repartee.  Look for related readings and the complete archive of previous shows at EconTalk.org, where you can also comment on the podcasts and ask questions.",
    "feedURL": "http://files.libertyfund.org/econtalk/EconTalk2011.xml",
    "podcastURL": "http://www.EconTalk.org",
    "title": "EconTalk Archives, 2011",
    "episodes": [
        {
            "title": "Tabarrok on Innovation",
            "datePublished": "Mon, 26 Dec 2011 06:30:00 EST",
            "description": "Alex Tabarrok of George Mason University talks with EconTalk host Russ Roberts about his new book, Launching the Innovation Renaissance. Tabarrok argues that innovation in the United States is being held back by patent law, the legal system, and immigration policies. He then suggests how these might be improved to create a better climate for innovation that would lead to higher productivity and a higher standard of living.",
            "length": "33063657",
            "sourceUrl": "http://files.libertyfund.org/econtalk/y2011/Tabarrokinnovation.mp3"
        },
        {
            "title": "Klein on Knowledge and Coordination",
            "datePublished": "Mon, 19 Dec 2011 06:30:00 EST",
            "description": "Dan Klein of George Mason University talks with EconTalk host Russ Roberts about the ideas in Klein's new book, Knowledge and Coordination. Klein argues that allegory is a powerful way to think about outcomes of emergent order. He goes deeply into the concept of the invisible hand and creates a novel way to evaluate processes that not under any one's control. Klein then suggests novel ways of evaluating economic outcomes outside of the traditional metrics and techniques. Along the way, Klein emphasizes the role of uncertainty and imperfection in the entrepreneurial process.",
            "length": "31337303",
            "sourceUrl": "http://files.libertyfund.org/econtalk/y2011/Kleinknowledge.mp3"
        },
        {
            "title": "Munger on Profits, Entrepreneurship, and Storytelling",
            "datePublished": "Mon, 12 Dec 2011 06:30:00 EST",
            "description": "Mike Munger of Duke University talks with EconTalk host Russ Roberts about profit. What is profit's role in allocating resources? How should we feel about the people who earn profits or who take them in ways that may not be earned? How easy is it to discover profitable opportunities? Munger examines these questions through a series of stories, real and fictional, to illuminate the sometimes puzzling nature of profit.",
            "length": "30826592",
            "sourceUrl": "http://files.libertyfund.org/econtalk/y2011/Mungerstories.mp3"
        },
        {
            "title": "Cowen on the European Crisis",
            "datePublished": "Mon, 05 Dec 2011 06:30:00 EST",
            "description": "Tyler Cowen of George Mason University talks with EconTalk host Russ Roberts about the European crisis. Cowen argues that Greece is likely to default either in fact or in spirit but that the key question is which nations might follow--whether Italy and Spain can find a road to economic health and honoring past debts. Cowen gives his best guess as to what is likely to happen to the euro and the European Union and the implications for the rest of the world. He explores some less likely scenarios as well. He is pessimistic about Greece and the short-run prospects for preserving the status quo, but he is optimistic in the long-run about the European Union though it may have a different structure down the road.",
            "length": "27926324",
            "sourceUrl": "http://files.libertyfund.org/econtalk/y2011/CowenEurope.mp3"
        },
        {
            "title": "Simon Johnson on the Financial Crisis",
            "datePublished": "Mon, 28 Nov 2011 06:30:00 EST",
            "description": "Simon Johnson of MIT and the author (with James Kwak) of 13 Bankers talks with EconTalk host Russ Roberts about the origins of the financial crisis and how the next one might be prevented. Invoking the work of George Stigler, Johnson argues that the financial sector has captured the regulatory process and the result is that regulation and government intervention have been steered more by the interests of the financial sector than to the benefit of the general public. Johnson argues for capping the size of banks in order to reduce the danger of systemic risk and the too-big-to-fail excuse for bailing out banks. Johnson also discusses the role of the Fed in subsidizing risk-taking and leverage in the financial sector.",
            "length": "31189767",
            "sourceUrl": "http://files.libertyfund.org/econtalk/y2011/Johnsonfinancial.mp3"
        },
        {
            "title": "Taubes on Fat, Sugar and Scientific Discovery",
            "datePublished": "Mon, 21 Nov 2011 06:30:00 EST",
            "description": "Gary Taubes, author of Good Calories, Bad Calories, talks to EconTalk host Russ Roberts about what we know about the relationship between diet and disease. Taubes argues that for decades, doctors, the medical establishment, and government agencies encouraged Americans to reduce fat in their diet and increase carbohydrates in order to reduce heart disease. Taubes argues that the evidence for the connection between fat in the diet and heart disease was weak yet the consensus in favor of low-fat diets remained strong. Casual evidence (such as low heart disease rates among populations with little fat in their diet) ignores the possibilities that other factors such as low sugar consumption may explain the relationship. Underlying the conversation is a theme that causation can be difficult to establish in complex systems such as the human body and the economy.",
            "length": "39800996",
            "sourceUrl": "http://files.libertyfund.org/econtalk/y2011/Taubesfat.mp3"
        },
        {
            "title": "Baumeister on Gender Differences and Culture",
            "datePublished": "Mon, 14 Nov 2011 06:30:00 EST",
            "description": "Roy Baumeister of Florida State University and the author of Is There Anything Good About Men talks with EconTalk host Russ Roberts about the differences between men and women in cultural and economic areas. Baumeister argues that men aren't superior to women nor are women superior to men. Rather there are some things men are better at while women excel at a different set of tasks and that these tradeoffs are a product of evolution and cultural pressure. He argues that evolutionary pressure has created different distributions of talent for men and women in a wide variety of areas. He argues that other differences in outcomes are not due to innate ability differences but rather come from different tastes or preferences.",
            "length": "36833693",
            "sourceUrl": "http://files.libertyfund.org/econtalk/y2011/Baumeistergender.mp3"
        },
        {
            "title": "Kaplan on the Inequality and the Top 1%",
            "datePublished": "Mon, 07 Nov 2011 06:30:00 EST",
            "description": "Steven Kaplan of the University of Chicago talks with EconTalk host Russ Roberts about the richest Americans and income inequality. Drawing on work with Joshua Rauh, Kaplan talks about the composition of the richest 1% and 1/10 of 1%--what proportions come from the financial sector, CEOs from non-financial corporations, athletes, lawyers and so on. Then he discusses how the incomes of these different groups have changed over time. Kaplan argues that these groups have increased their incomes by similar proportions, suggesting that a failure of corporate governance is not the explanation of rising CEO pay. The discussion closes with a discussion of the financial crisis and the compensation in the financial sector.",
            "length": "31859551",
            "sourceUrl": "http://files.libertyfund.org/econtalk/y2011/Kaplaninequality.mp3"
        },
        {
            "title": "Avent on Cities, Urban Regulations, and Growth",
            "datePublished": "Mon, 31 Oct 2011 06:30:00 EST",
            "description": "Ryan Avent of the Economist and author of The Gated City talks with EconTalk host Russ Roberts about The Gated City and how cities have restricted access to land and housing. Avent argues that restricted access has raised housing prices artificially on both the east and west coast of the United States, reducing urban populations and restricting access to labor markets. He argues that this in turn has artificially depressed growth in the United States by keeping workers from their most productive opportunities. The conversation closes with a discussion of possible policy changes that might make cities more accessible to development and growth.",
            "length": "31536900",
            "sourceUrl": "http://files.libertyfund.org/econtalk/y2011/Aventcities.mp3"
        },
        {
            "title": "Ramey on Stimulus and Multipliers",
            "datePublished": "Mon, 24 Oct 2011 06:30:00 EST",
            "description": "Valerie Ramey of the University of California, San Diego talks with EconTalk host Russ Roberts about the effect of government spending on output and employment. Ramey's own work exploits the exogenous nature of wartime spending. She finds a multiplier between .8 and 1.2. (A multiplier of 1 means that GDP goes up by the amount of spending--there is neither stimulus nor crowding out.) She also discusses a survey looking at a wide range of estimates by others and finds that the estimates range from .5 to 2.0. Along the way, she discusses the effects of taxes as well. The conversation concludes with a discussion of the imprecision of multiplier estimates and the contributions of recent Nobel Laureates Thomas Sargent and Christopher Sims.",
            "length": "29992097",
            "sourceUrl": "http://files.libertyfund.org/econtalk/y2011/Rameystimulus.mp3"
        },
        {
            "title": "Wapshott on Keynes and Hayek",
            "datePublished": "Mon, 17 Oct 2011 06:30:00 EST",
            "description": "Nicholas Wapshott, author of Keynes Hayek: The Clash That Defined Modern Economics, talks with EconTalk host Russ Roberts about John Maynard Keynes and Friedrich A. Hayek--their ideas, their disagreements, their friendship and how the two men influenced economists and public policy during their lifetimes and beyond.",
            "length": "33144335",
            "sourceUrl": "http://files.libertyfund.org/econtalk/y2011/WapshottKeynes.mp3"
        },
        {
            "title": "Frank Rose on Storytelling and the Art of Immersion",
            "datePublished": "Mon, 10 Oct 2011 06:30:00 EST",
            "description": "Frank Rose, author of The Art of Immersion and correspondent for Wired Magazine, talks with EconTalk host Russ Roberts about how the web has changed the art of storytelling and the interactions between the web, advertising, games, movies, and television. Rose argues that when a new medium is introduced, whether it is the book, movies, or the web, there is always a period of exploration as to how storytelling, the author, and the audience will interact. While there have always been readers, viewers, and listeners who immerse themselves in good stories, the web allows this immersion to expand dramatically, partly because the audience can share reactions and insights with each other as well as becoming part of the creation of the story in ways that past media have not allowed. Rose chronicles these developments with specific examples and speculates on where storytelling on the web might be headed. The conversation closes with a brief discussion of the passing of Steve Jobs.",
            "length": "30179379",
            "sourceUrl": "http://files.libertyfund.org/econtalk/y2011/Roseimmersion.mp3"
        },
        {
            "title": "Bruce Meyer on the Middle Class, Poverty, and Inequality",
            "datePublished": "Mon, 03 Oct 2011 06:30:00 EST",
            "description": "Bruce Meyer of the University of Chicago talks with EconTalk host Russ Roberts about the middle class, poverty, and inequality. Many economists and pundits argue that the middle class has made little or no economic progress over the last 30 years, that poverty rates are stagnant or rising, and that inequality has increased dramatically. Meyer, drawing on his research over the last ten years, argues that these conclusions are either false or misleading. He argues that standard measures of economic progress and inequality are based on faulty inflation data or a misplaced focus on pre-tax income instead of post-tax income or consumption.",
            "length": "28756029",
            "sourceUrl": "http://files.libertyfund.org/econtalk/y2011/MeyerBinequality.mp3"
        },
        {
            "title": "Rosenberg on the Nature of Economics",
            "datePublished": "Mon, 26 Sep 2011 06:30:00 EST",
            "description": "Alex Rosenberg of Duke University talks with EconTalk host Russ Roberts about the scientific nature of economics. Rosenberg, a philosopher of science talks about whether economics is a science. He surveys the changes in economics over the last 25 years--the rise of experimental economics and behavioral economics--and argues that economics has become more scientific and that economists have become more aware of flaws in economic theory. But he also argues that economics is unable to make precise predictions about the effects of various changes in policy and behavior. The conversation closes with a discussion of the role the philosophy of science can play in the evolution of economics.",
            "length": "27495006",
            "sourceUrl": "http://files.libertyfund.org/econtalk/y2011/Rosenbergnature.mp3"
        },
        {
            "title": "Garett Jones on Stimulus",
            "datePublished": "Mon, 19 Sep 2011 06:30:00 EST",
            "description": "Garett Jones of George Mason University talks with EconTalk host Russ Roberts about the workers who were hired with money from the 2009 American Recovery and Re-investment Act--the stimulus package. Jones (with co-author Daniel Rothschild) recently completed two studies based on surveys and interviews with firms who received stimulus funds and workers who work at those firms. They found that 42% of workers hired had been unemployed. The remainder came from other jobs or from outside the labor force such as retirement or school. Is 42% a big number or a small number? Jones argues it is small and defends his conclusion. The conversation also includes a discussion of the labor market generally and why the stimulus spending may not have been effective.",
            "length": "30010678",
            "sourceUrl": "http://files.libertyfund.org/econtalk/y2011/Jonesstimulus.mp3"
        },
        {
            "title": "Frank on Competition, Government, and Darwin",
            "datePublished": "Mon, 12 Sep 2011 06:30:00 EST",
            "description": "Robert Frank of Cornell University and author of The Darwin Economy talks with EconTalk host Russ Roberts about competition, government and the relevance of Darwin for economics. In a lively and spirited discussion, Frank argues that because people care about their relative standing with their neighbors, standard conclusions about the virtues of competition are misleading. He argues that competition is often wasteful and he suggests directions for tax policy and other forms of government intervention to take these effects into accounts.",
            "length": "30562424",
            "sourceUrl": "http://files.libertyfund.org/econtalk/y2011/Frankgovernment.mp3"
        },
        {
            "title": "Winston on Lawyers",
            "datePublished": "Mon, 05 Sep 2011 06:30:00 EST",
            "description": "Clifford Winston of the Brookings Institution talks with EconTalk host Russ Roberts about the market for lawyers and the role of lawyers in the political process. Drawing on a new co-authored book, First Thing We Do, Let's Deregulate All the Lawyers, Winston argues that restrictions on the supply of lawyers and increases in demand via government regulation artificially boost lawyers' salaries. Deregulation of the supply (by eliminating licensing) would lower price and encourage innovation.",
            "length": "29731260",
            "sourceUrl": "http://files.libertyfund.org/econtalk/y2011/Winstonlawyers.mp3"
        },
        {
            "title": "Hanushek on Teachers",
            "datePublished": "Mon, 29 Aug 2011 06:30:00 EST",
            "description": "Eric Hanushek of Stanford University's Hoover Institution talks with EconTalk host Russ Roberts about the importance of teacher quality in education. Hanushek argues that the standard measures of quality--experience and advanced degrees--are uncorrelated with student performance. But some teachers consistently cover dramatically more material and teach more than others, even within a school. Hanushek presents evidence that the impact of these differences on lifetime earnings for students can be quite large. The conversation closes with a discussion of school finance and the growth of administrators within school systems.",
            "length": "28560123",
            "sourceUrl": "http://files.libertyfund.org/econtalk/y2011/Hanushekteachers.mp3"
        },
        {
            "title": "O'Donohoe on Potato Chips and Salty Snacks",
            "datePublished": "Mon, 22 Aug 2011 06:30:00 EST",
            "description": "Brendan O'Donohoe of Frito-Lay talks with EconTalk host Russ Roberts about how potato chips and other salty snacks get made, distributed, and marketed. The interview follows an hour-long tour of a local supermarket where O'Donohoe showed Roberts some of the ways that chips and snacks get displayed and marketed in a modern supermarket. The conversation is a window into a world that few of us experience or are even aware of--how modern producers and retailers make sure the shelves are stocked and their products get noticed.",
            "length": "43205475",
            "sourceUrl": "http://files.libertyfund.org/econtalk/y2011/ODonohoesnacks.mp3"
        },
        {
            "title": "Brady on the Electorate and the Elections of 2010 and 2012",
            "datePublished": "Mon, 15 Aug 2011 06:30:00 EST",
            "description": "David Brady of Stanford University talks with EconTalk host Russ Roberts about the lessons of the election of 2010 and what we might expect from the elections of 2012. Brady draws on political history as well as survey results from work with colleagues Doug Rivers and Morris Fiorina to speculate about the elections of 2012. Along the way he discusses the power of the independent vote, how ObamaCare affected the election of 2010, and the prospects for the Republican nominee in 2012. Taped a few days before the deal on the debt was reached, Brady gives his thoughts on the politics of the negotiations. The conversation concludes with a discussion of whether Obama will have a primary challenger.",
            "length": "32360304",
            "sourceUrl": "http://files.libertyfund.org/econtalk/y2011/Bradyelections.mp3"
        },
        {
            "title": "Satz on Markets",
            "datePublished": "Mon, 08 Aug 2011 06:30:00 EST",
            "description": "Debra Satz, Professor of Philosophy at Stanford University, talks with EconTalk host Russ Roberts about her book, Why Some Things Should Not Be For Sale: The Moral Limits of the Market. Satz argues that some markets are noxious and should not be allowed to operate freely. Topics discussed include organ sales, price spikes after natural disasters, the economic concept of efficiency and utilitarianism. The conversation includes a discussion of the possible limits of political intervention and whether it would be good to allow voters to sell their votes.",
            "length": "29921426",
            "sourceUrl": "http://files.libertyfund.org/econtalk/y2011/Satzmarkets.mp3"
        },
        {
            "title": "Admati on Financial Regulation",
            "datePublished": "Mon, 01 Aug 2011 06:30:00 EST",
            "description": "Anat Admati of Stanford University talks with EconTalk host Russ Roberts about ways to make the financial system more stable. In particular, Admati explores the implications of higher capital requirements. She argues that current policies subsidize leverage--high levels of debt relative to equity--and that current levels of leverage increase the vulnerability of the system to swings in asset prices. She then gives her response to criticisms of higher equity levels. The conversation concludes with a discussion of the role of academic economists and finance professors as advocates for various policies.",
            "length": "29719582",
            "sourceUrl": "http://files.libertyfund.org/econtalk/y2011/Admatifinancial.mp3"
        },
        {
            "title": "Hennessey on the Debt Ceiling and the Budget Process",
            "datePublished": "Mon, 25 Jul 2011 06:30:00 EST",
            "description": "Keith Hennessey of Stanford University's Hoover Institution talks with EconTalk host Russ Roberts about the debt ceiling and the budget process. Hennessey, who worked for Senate Majority Leader Trent Lott on budget issues in the late 1990s, explains the politics of the debt ceiling and the budget process. Using his past experience as a staffer, Hennessey gives those of us on the outside a window into what is actually going on in the hallways, who has power, and how information flows up and down in the chain of constituents, members, party leaders. The conversation closes with Hennessey's best guess of which outcomes of the current negotiations are most likely and why.",
            "length": "34285621",
            "sourceUrl": "http://files.libertyfund.org/econtalk/y2011/Hennesseydebt.mp3"
        },
        {
            "title": "Taylor on Fiscal and Monetary Policy",
            "datePublished": "Mon, 18 Jul 2011 06:30:00 EST",
            "description": "John Taylor of Stanford University talks with EconTalk host Russ Roberts about the state of the economy and the prospects for recovery. Taylor argues that the design of the fiscal stimulus was ineffective and monetary policy, so-called quantitative easing, has also failed to improve matters. He argues for a return to fiscal, monetary, and regulatory normalcy as the best hope for economic improvement. The conversation concludes with a discussion of the impact of the current crisis on economics education.",
            "length": "28644603",
            "sourceUrl": "http://files.libertyfund.org/econtalk/y2011/Taylorfiscal.mp3"
        },
        {
            "title": "Banerjee on Poverty and Poor Economics",
            "datePublished": "Mon, 11 Jul 2011 06:30:00 EST",
            "description": "Abhijit Banerjee of MIT talks with EconTalk host Russ Roberts about Banerjee's book (co-authored with Esther Duflo), Poor Economics. The conversation begins with how randomized control trials (a particular kind of social experiment) have been used to measure the effectiveness of various types of aid to the poor. Banerjee goes on to discuss hunger, health, and education--the challenges in each area and what we have learned about what works and what does not. The conversation closes with a discussion of the role of the labor market in the private sector.",
            "length": "24106824",
            "sourceUrl": "http://files.libertyfund.org/econtalk/y2011/Banerjeepoverty.mp3"
        },
        {
            "title": "Skeel on Bankruptcy and the Auto Industry Bailout",
            "datePublished": "Mon, 04 Jul 2011 06:30:00 EST",
            "description": "David Skeel of the University of Pennsylvania Law School talks with EconTalk host Russ Roberts about bankruptcy and the government bailout of the auto industry. Skeel argues that the bailout damaged the rule of law by not allowing a bankruptcy procedure to take its course. Skeel speculates on how bankruptcy for GM and Chrysler might have proceeded. He also argues that the costs to the taxpayer of the bailout have been underestimated. The conversation concludes with a general discussion of the effects of bankruptcy.",
            "length": "29325902",
            "sourceUrl": "http://files.libertyfund.org/econtalk/y2011/Skeelbankruptcy.mp3"
        },
        {
            "title": "Otteson on Adam Smith",
            "datePublished": "Mon, 27 Jun 2011 06:30:00 EST",
            "description": "James Otteson of Yeshiva University talks with EconTalk host Russ Roberts about Adam Smith. The conversation begins with a brief sketch of David Hume and his influence on Smith and then turns to the so-called Adam Smith problem--the author of The Wealth of Nations appears to have a different take on human nature than the author of The Theory of Moral Sentiments. Smith worked on both books throughout his life, yet their perspectives seem so different. Otteson argues that the books focus on social behavior and the institutions that sustain that behavior--market transactions in The Wealth of Nations and moral behavior in The Theory of Moral Sentiments. Both books use the idea of emergent order to explain the evolution of both kinds of social behavior and social institutions. The conversation concludes with a discussion of what Smith got right and wrong.",
            "length": "34252540",
            "sourceUrl": "http://files.libertyfund.org/econtalk/y2011/OttesonSmith.mp3"
        },
        {
            "title": "Munger on Exchange, Exploitation and Euvoluntary Transactions",
            "datePublished": "Mon, 20 Jun 2011 06:30:00 EST",
            "description": "Mike Munger of Duke University talks with EconTalk host Russ Roberts about the psychology, sociology, and economics of buying and selling. Why are different transactions that seemingly make both parties better off frowned on and often made illegal? In theory, all voluntary transactions should make both parties better off. But Munger argues that some transactions are more voluntary than others. Munger lists the attributes of a truly voluntary transaction, what he calls a euvoluntary transaction and argues that when transactions are not euvoluntary, they may be outlawed or seen as immoral. Related issues that are discussed include price gouging after a natural disaster, blackmail, sales of human organs, and the employment of low-wage workers.",
            "length": "30173547",
            "sourceUrl": "http://files.libertyfund.org/econtalk/y2011/Mungerexchange.mp3"
        },
        {
            "title": "Buchholz on Competition, Stress, and the Rat Race",
            "datePublished": "Mon, 13 Jun 2011 06:30:00 EST",
            "description": "Todd Buchholz, author of Rush: Why You Need and Love the Rat Race, talks with EconTalk host Russ Roberts about the ideas in the book. Buchholz argues that competition and striving for excellence is part of our evolutionary inheritance. He criticizes attempts to remake human beings into gentle creatures who long to return to an Eden-like serenity. He argues that it is action, creativity, and planning for the future that makes us happy. The discussion includes the implications of our interest in the future for theater and story-telling.",
            "length": "28658839",
            "sourceUrl": "http://files.libertyfund.org/econtalk/y2011/Buchholzcompetition.mp3"
        },
        {
            "title": "Eichengreen on the Dollar and International Finance",
            "datePublished": "Mon, 06 Jun 2011 06:30:00 EST",
            "description": "Barry Eichengreen of University of California, Berkeley and author of Exorbitant Privilege talks with EconTalk host Russ Roberts about the history and importance of the dollar as the dominant international currency. Eichengreen explains the advantages to the United States of the dollar's dominance, the historical circumstances that led to its dominance, and the likelihood that the dollar might be supplanted by a competitor. Along the way they discuss China's currency policy, the state of U.S. monetary policy, the causes of the crisis, the risk of inflation in the United States, and the future of the Federal Reserve.",
            "length": "31395431",
            "sourceUrl": "http://files.libertyfund.org/econtalk/y2011/Eichengreendollar.mp3"
        },
        {
            "title": "Easterly on Benevolent Autocrats and Growth ",
            "datePublished": "Mon, 30 May 2011 06:30:00 EST",
            "description": "William Easterly of New York University talks with EconTalk host Russ Roberts about the oft-heard claim that poor countries led by autocrats grow faster than poor countries that are democratic. Drawing on a recent paper, \"Benevolent Autocrats,\" Easterly argues that while some autocracies do indeed grow very quickly, a much greater number do not. Yet, the idea that the messiness of democracy is inferior to a dictatorship remains seductive. Easterly gives a number of arguments for the perennial appeal of autocracy as a growth strategy. The conversation closes with a discussion of the limitations of our knowledge about growth and where that leaves policymakers.",
            "length": "31429479",
            "sourceUrl": "http://files.libertyfund.org/econtalk/y2011/Easterlybenevolent.mp3"
        },
        {
            "title": "Harford on Adapt and the Virtues of Failure",
            "datePublished": "Mon, 23 May 2011 06:30:00 EST",
            "description": "Tim Harford, author and journalist, talks with EconTalk host Russ Roberts about Adapt, Harford's book on the virtues of failure and the trial and error process. Harford argues that success is more likely when there is experimentation and trial and error followed by adapting, rather than following a top-down, ex ante plan driven by expertise. The conversation looks at the what war can teach us about information, knowledge, and planning, the challenge of admitting mistakes, and the implications of trial and error for our daily lives.",
            "length": "28178174",
            "sourceUrl": "http://files.libertyfund.org/econtalk/y2011/Harfordadapt.mp3"
        },
        {
            "title": "Byers on the Blind Spot, Science, and Uncertainty",
            "datePublished": "Mon, 16 May 2011 06:30:00 EST",
            "description": "William Byers of Canada's Concordia University and author of The Blind Spot talks with EconTalk host Russ Roberts about the nature of knowledge, science and mathematics. Byers argues that there is an inherent uncertainty about science and our knowledge that is frequently ignored. Byers contrasts a science of wonder with a science of certainty. He suggests that our knowledge of the physical world will always be incomplete because of the imperfection of models and human modes of thought relative to the complexity of the physical world. The conversation also looks at the implications of these ideas for teaching science and social science.",
            "length": "33779884",
            "sourceUrl": "http://files.libertyfund.org/econtalk/y2011/Byersblindspot.mp3"
        },
        {
            "title": "Caplan on Parenting",
            "datePublished": "Mon, 09 May 2011 06:30:00 EST",
            "description": "Bryan Caplan of George Mason University and EconLog talks with EconTalk host Russ Roberts about the ideas in Caplan's new book, Selfish Reasons to Have More Kids. Caplan argues that parents spend too much time trying to influence how their kids will turn out as adults. Using research on twins and adopted children, Caplan argues that nature dominates nurture and that parents have little lasting influence on many aspects of their children's lives. He concludes that parents should spend less time and energy trying to influence their children. If parenting takes less time, then have more kids, says Caplan. The conversation concludes with a discussion of whether a larger population is bad for the planet.",
            "length": "32586551",
            "sourceUrl": "http://files.libertyfund.org/econtalk/y2011/Caplanparenting.mp3"
        },
        {
            "title": "Papola on the Keynes Hayek Rap Videos",
            "datePublished": "Mon, 02 May 2011 06:30:00 EST",
            "description": "John Papola of Emergent Order talks with EconTalk host Russ Roberts about their collaboration creating rap videos based on the ideas of John Maynard Keynes and F. A. Hayek. Their first was \"Fear the Boom and Bust\" which was released January 25, 2010. This past week they released \"Fight of the Century.\" The latest video discusses the overarching differences between the philosophies of Keynes and Hayek and their views on whether government spending promotes recovery from an economic downturn and whether it leads to prosperity. In this conversation, Papola and Roberts discuss some of the underlying ideas in the video--whether the military spending of World War II ended the Great Depression, the debate between Malthus and Say and their influence on Keynes and Hayek, and the fundamental differences between Keynes and Hayek in how economic prosperity is created.",
            "length": "38920758",
            "sourceUrl": "http://files.libertyfund.org/econtalk/y2011/Papolarapvideos.mp3"
        },
        {
            "title": "Rubinstein on Game Theory and Behavioral Economics",
            "datePublished": "Mon, 25 Apr 2011 06:30:00 EST",
            "description": "Ariel Rubinstein of Tel Aviv University and New York University talks with EconTalk host Russ Roberts about the state of game theory and behavioral economics, two of the most influential areas of economics in recent years. Drawing on his Afterword for the 60th anniversary edition of Von Neumann and Morgenstern's Theory of Games and Economic Behavior, Rubinstein argues that game theory's successes have been quite limited. Rubinstein, himself a game theorist, argues that game theory is unable to yield testable predictions or solutions to public policy problems. He argues that game theorists have a natural incentive to exaggerate its usefulness. In the area of behavioral economics, Rubinstein argues that the experimental results (which often draw on game theory) are too often done in ways that are not rigorous. The conversation concludes with a plea for honesty about what economics can and cannot do.",
            "length": "29223086",
            "sourceUrl": "http://files.libertyfund.org/econtalk/y2011/Rubinsteingametheory.mp3"
        },
        {
            "title": "Munger on Microfinance, Savings, and Poverty",
            "datePublished": "Mon, 18 Apr 2011 06:30:00 EST",
            "description": "Mike Munger of Duke University talks with EconTalk host Russ Roberts about microfinance. Munger argues that cultural forces make it difficult for some families to save, and the main value of microfinance is to allow a higher level of savings. Families are willing to save via microfinance even though returns can be negative. Munger argues that this counterintuitive result is possible when other means of savings are unavailable. Munger also discusses microfinance that is used for entrepreneurship and the potential role for microfinance in development.",
            "length": "27926822",
            "sourceUrl": "http://files.libertyfund.org/econtalk/y2011/Mungermicrofinance.mp3"
        },
        {
            "title": "Rodrik on Globalization, Development, and Employment",
            "datePublished": "Mon, 11 Apr 2011 06:30:00 EST",
            "description": "Dani Rodrik of Harvard University talks with EconTalk host Russ Roberts about trade, the labor market, and trade policy. Drawing on a recent paper with Margaret McMillan on trade and productivity, Rodrik argues that countries have very differing abilities to respond to increases in productivity that allow production to expand using fewer workers in a particular sector. When workers are displaced by productivity increases, what is their next best alternative? Rodrik discusses how this varies across countries and policies that might improve matters. He argues that poor countries should subsidize new products as a way of overcoming uncertainty and externalities from new ventures.",
            "length": "28826225",
            "sourceUrl": "http://files.libertyfund.org/econtalk/y2011/Rodrikglobalization.mp3"
        },
        {
            "title": "Andresen on BitCoin and Virtual Currency",
            "datePublished": "Mon, 04 Apr 2011 06:30:00 EST",
            "description": "Gavin Andresen, Principal of the BitCoin Virtual Currency Project, talks with EconTalk host Russ Roberts about BitCoin, an innovative attempt to create a decentralized electronic currency. Andresen explains the origins of BitCoin, how new currency gets created, how you can acquire BitCoins and the prospects for BitCoin's future. Can it compete with government-sanctioned money? How can users trust it? What threatens BitCoin and how might it thrive?",
            "length": "27764400",
            "sourceUrl": "http://files.libertyfund.org/econtalk/y2011/Andresenbitcoin.mp3"
        },
        {
            "title": "Vincent Reinhart on Bear Stearns, Lehman Brothers, and the Financial Crisis",
            "datePublished": "Mon, 28 Mar 2011 06:30:00 EST",
            "description": "Vincent Reinhart of the American Enterprise Institute talks with EconTalk host Russ Roberts about the government interventions and non-interventions into financial markets in 2008. Conventional wisdom holds that the failure to intervene in the collapse of Lehman Brothers precipitated the crisis. Reinhart argues that the key event occurred months earlier when the government engineered a shotgun marriage of Bear Stearns to JP Morgan Chase by guaranteeing  billion of Bear's assets and sending a signal to creditors that risky lending might come without a cost. Reinhart argues that there is a wider menu of choices available to policy makers than simply rescue or no rescue, and that it is important to take action before the crisis comes to a head.",
            "length": "33398908",
            "sourceUrl": "http://files.libertyfund.org/econtalk/y2011/ReinhartVbearstearns.mp3"
        },
        {
            "title": "Coyle on the Economics of Enough",
            "datePublished": "Mon, 21 Mar 2011 06:30:00 EST",
            "description": "Diane Coyle, author of The Economics of Enough, talks with EconTalk host Russ Roberts about the future and the ideas in her book. Coyle argues that the financial crisis, the entitlement crisis, and climate change all reflect a failure to deal with the future appropriately. The conversation ranges across a wide range of issues including debt, the financial sector, and the demographic challenges of an aging population that is promised generous retirement and health benefits. Coyle argues for better measurement of the government budget and suggests ways that the political process might be made more effective.",
            "length": "28202630",
            "sourceUrl": "http://files.libertyfund.org/econtalk/y2011/Coyleenough.mp3"
        },
        {
            "title": "Townsend on Development, Poverty, and Financial Institutions",
            "datePublished": "Mon, 14 Mar 2011 06:30:00 EST",
            "description": "Robert Townsend of MIT and the Consortium on Financial Systems and Poverty talks with EconTalk host Russ Roberts about development and the role of financial institutions in growth. Drawing on his research, particularly his surveys of households in Thailand, Townsend argues that both informal networks and arrangements and formal financial institutions play important roles in dealing with risk. Along the way, he discusses the role of microfinance in poor countries and the potential for better financial arrangements to lead to higher growth and the accumulation of wealth.",
            "length": "33592005",
            "sourceUrl": "http://files.libertyfund.org/econtalk/y2011/Townsenddevelopment.mp3"
        },
        {
            "title": "Dyson on Heresy, Climate Change, and Science",
            "datePublished": "Mon, 07 Mar 2011 06:30:00 EST",
            "description": "Freeman Dyson of the Institute for Advanced Study in Princeton talks with EconTalk host Russ Roberts about science, his career, and the future. Dyson argues for the importance of what he calls heresy--challenging the scientific dogmas of the day. Dyson argues that our knowledge of climate science is incomplete and that too many scientists treat it as if it were totally understood. He reflects on his childhood and earlier work, particularly in the area of space travel. And he says that biology is the science today with the most exciting developments.",
            "length": "31717249",
            "sourceUrl": "http://files.libertyfund.org/econtalk/y2011/Dysonclimate.mp3"
        },
        {
            "title": "George Will on America, Politics, and Baseball",
            "datePublished": "Mon, 28 Feb 2011 06:30:00 EST",
            "description": "Author and syndicated columnist George Will talks with EconTalk host Russ Roberts about the state of the country, the nature of politics, and at the end, a little about baseball. The conversation begins with Will discussing his career and how someone with a Ph.D. from Princeton got involved in politics and then writing. Will then discusses the current political environment and how little some things have changed in politics. Other topics include the future of journalism and Will's predictions for how the Chicago Cubs will fare this season (4th place).",
            "length": "29782098",
            "sourceUrl": "http://files.libertyfund.org/econtalk/y2011/Willpolitics.mp3"
        },
        {
            "title": "Acemoglu on Inequality and the Financial Crisis",
            "datePublished": "Mon, 21 Feb 2011 06:30:00 EST",
            "description": "Daron Acemoglu of MIT talks with EconTalk host Russ Roberts about the role income inequality may have played in creating the financial crisis. Raghuram Rajan in his book, Fault Lines, argues that growing income inequality in the last part of the 20th century created a political demand for redistribution and various policy changes. This in turn created the push for higher home ownership rates and led to the distortions of the housing market that in turn led to excessive risk-taking in the financial market. Acemoglu suggests a simpler story where the financial sector through its political influence distorted the rules of the game, benefiting executives in the industry, which in turn led to outsized rewards and ultimate instability in the financial industry. The conversation discusses ways of distinguishing between these two arguments and what might be done to change the incentives of politicians.",
            "length": "30567861",
            "sourceUrl": "http://files.libertyfund.org/econtalk/y2011/Acemogluinequality.mp3"
        },
        {
            "title": "Cowen on the Great Stagnation",
            "datePublished": "Mon, 14 Feb 2011 06:30:00 EST",
            "description": "Tyler Cowen of George Mason University and author of the e-book The Great Stagnation talks with EconTalk host Russ Roberts about the ideas in the book. Cowen argues that in the last four decades, the growth in prosperity for the average family has slowed dramatically in the United States relative to earlier decades and time periods. Cowen argues that this is the result of a natural slowing in innovation and that we expect too much growth relative to what is possible. Cowen expects improvements in the rate of growth in the future when new areas of research yield high returns. The conversation includes a discussion of the implications of Cowen's thesis for politics and public policy.",
            "length": "29077210",
            "sourceUrl": "http://files.libertyfund.org/econtalk/y2011/Cowenstagnation.mp3"
        },
        {
            "title": "Kling on Patterns of Sustainable Specialization and Trade",
            "datePublished": "Mon, 07 Feb 2011 06:30:00 EST",
            "description": "Arnold Kling of EconLog talks with EconTalk host Russ Roberts about a new paradigm for thinking about macroeconomics and the labor market. Kling calls it PSST--patterns of sustainable specialization and trade. Kling rejects the Keynesian approach that emphasizes shortfalls in aggregate demand arguing that the aggregate demand approach masks the underlying complexity of the recalculations that periodically take place in a dynamic economy. Instead, Kling invokes the mutual exploration between entrepreneurs and workers for profitable opportunities that pay well using the workers' skills. This exploration takes time, involves trial and error, and can have false starts because businesses sometimes fail or employees are difficult to find or match with employment opportunities. Kling applies these ideas to the current crisis to explain why labor market recovery is so sluggish and what might policies might improve matters.",
            "length": "33297971",
            "sourceUrl": "http://files.libertyfund.org/econtalk/y2011/Klingpsst.mp3"
        },
        {
            "title": "Deer on Autism, Vaccination, and Scientific Fraud",
            "datePublished": "Mon, 31 Jan 2011 06:30:00 EST",
            "description": "Investigative journalist Brian Deer talks with EconTalk \r\nhost Russ Roberts about Deer's seven years of reporting and legal issues \r\nsurrounding the 1998 article in The Lancet claiming that the MMR vaccine \r\ncauses autism and bowel problems. Deer's dogged pursuit of the truth led \r\nto the discovery that the 1998 article was fraudulent and that the lead \r\nauthor had hidden payments he received from lawyers to finance the \r\noriginal study. In this podcast, Deer describes how he uncovered the \r\ntruth and the legal consequences that followed. The conversation closes \r\nwith a discussion of the elusiveness of truth in science and medicine.",
            "length": "31193964",
            "sourceUrl": "http://files.libertyfund.org/econtalk/y2011/Deerautism.mp3"
        },
        {
            "title": "Boudreaux on Monetary Misunderstandings",
            "datePublished": "Mon, 17 Jan 2011 06:30:00 EST",
            "description": "Don Boudreaux of George Mason University talks with EconTalk host Russ Roberts on some of the common misunderstandings people have about prices, money, inflation and deflation. They discuss what is harmful about inflation and deflation, the importance of expectations and the implications for interest rates and financial institutions.",
            "length": "31103685",
            "sourceUrl": "http://files.libertyfund.org/econtalk/y2011/Boudreauxmisunderstanding.mp3"
        },
        {
            "title": "Fazzari on Stimulus and Keynes",
            "datePublished": "Mon, 24 Jan 2011 06:30:00 EST",
            "description": "Steve Fazzari of Washington University in St. Louis talks with EconTalk host Russ Roberts about the economics of Keynesian stimulus. They discuss the stimulus package passed in February 2009 and whether it improved the economy and created jobs. How should claims about its impact be evaluated? What can we know as economists about causal relationships in a complex world? The conversation includes a discussion of the underlying logic of Keynesian stimulus and the effect of the financial crisis on economic research and teaching.",
            "length": "29159966",
            "sourceUrl": "http://files.libertyfund.org/econtalk/y2011/Fazzaristimulus.mp3"
        },
        {
            "title": "Caldwell on Hayek",
            "datePublished": "Mon, 10 Jan 2011 06:30:00 EST",
            "description": "Bruce Caldwell of Duke University and the General Editor of the Collected Works of F. A. Hayek, talks with EconTalk host Russ Roberts about Hayek, his life, his ideas, his books, and articles. The conversation covers Hayek's intellectual encounters with Keynes, Hayek's role in the socialist calculation debate, Hayek's key ideas, and a discussion of which of Hayek's works are most accessible.",
            "length": "36166425",
            "sourceUrl": "http://files.libertyfund.org/econtalk/y2011/CaldwellHayek.mp3"
        },
        {
            "title": "Hanson on the Technological Singularity",
            "datePublished": "Mon, 03 Jan 2011 06:30:00 EST",
            "description": "Robin Hanson of GMU talks with EconTalk host Russ Roberts about the idea of a technological singularity--a sudden, large increase in the rate of growth due to technological change. Hanson argues that it is plausible that a change in technology could lead to world output doubling every two weeks rather than every 15 years, as it does currently. Hanson suggests a likely route to such a change is to port the human brain into a computer-based emulation. Such a breakthrough in artificial intelligence would lead to an extraordinary increase in productivity creating enormous wealth and radically changing the returns to capital and labor. The conversation looks at the feasibility of the process and the intuition behind the conclusions. Hanson argues for the virtues of such a world.",
            "length": "46558353",
            "sourceUrl": "http://files.libertyfund.org/econtalk/y2011/Hansonsingularity.mp3"
        }
    ]
}