{
    "artwork": "http://is5.mzstatic.com/image/thumb/Music71/v4/df/ae/65/dfae657f-1178-2a0a-0faa-feebda76ffea/source/100x100bb.jpg",
    "description": "Do you feel powerless? Do you struggle with moving forward? Sarah and Sophia can help you reach your highest potential in love, career and all other aspects of your life. They are here to empower you to take control of your life and your heart. They encourage you to lighten your load and they help you envision your future so you can actively participate in co-creating that with the Divine!",
    "feedURL": "http://www.blogtalkradio.com/empowerenlightenenvision/podcast",
    "podcastURL": "http://www.blogtalkradio.com/empowerenlightenenvision",
    "title": "Empower ~ Enlighten ~ Envision",
    "episodes": [
        {
            "title": "Soulmate and Twin Flame Runners - They Can Run but They Can't Hide",
            "datePublished": "Sun, 28 Apr 2019 22:30:00 GMT",
            "description": "Today we are talking about a very common occurrence with soul mates. We get many calls from clients who are distraught because their soulmate is on the run and become a soulmate runner.  This phenomenon happens so often, it has become almost commonplace with soul mates    Even though many soulmates will have to experience this, it is probably one of the hardest challenges soulmates will face. Do you know why soulmates run?   Do twin flames run?   What is the best way to approach this when your soulmate runs from you? What is the best thing to do?   Find out on today's show with Sarah Adelle and Sophia Elise. \r\n\r\n \r\n",
            "length": "28591378",
            "sourceUrl": "https://www.blogtalkradio.com/empowerenlightenenvision/2019/04/28/soulmate-and-twin-flame-runners--they-can-run-but-they-cant-hide.mp3",
            "snNo": "1",
            "epNo": "1",
            "categories": [
                {
                    "_": "Relationships",
                    "$": {
                        "domain": "https://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "Compassion is a Two-Way Street for Soulmates, Twinflames and all Relationships.",
            "datePublished": "Thu, 24 Mar 2016 16:00:00 GMT",
            "description": "Compassion, in soulmate, twinflame or any of our relationships, must be a two way street or our relationships will fail. We must understand the people in our lives may be going through things we don't know about, understand, or what it really feels like to be in their shoes. They are not perfect, and quite frankly, neither are we. We all need to cut one another more slack and stop sweating the small stuff. But there are times when we are compassionate towards the others in our lives that we will wind up taking the hit instead. How can we effectively make sure that we don't overdo our compassion? When do we realize that we have been overly compassionate towards someone who may not be overly deserving of it?\r\n",
            "length": "54938271",
            "sourceUrl": "https://www.blogtalkradio.com/empowerenlightenenvision/2016/03/24/compassion-is-a-two-way-street-for-soulmates-twinflames-and-all-relationships.mp3",
            "categories": [
                {
                    "_": "Relationships",
                    "$": {
                        "domain": "https://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "Dead End Relationships",
            "datePublished": "Mon, 21 Mar 2016 16:00:00 GMT",
            "description": "Can you identify the dead end relationships in your life? Have you reached a dead end in your romantic relationship, although you had hoped it was a fork in the road? Would you rather stab your eyes with icepicks than continue to go to a boring job that has no future growth potential? It is time to get into the driver's seat and figure out what direction you need to take for the next stage of your life. Todaywe will discuss deadend relationships, how to identify them, fix them, or move on down the road.\r\n",
            "length": "54876831",
            "sourceUrl": "https://www.blogtalkradio.com/empowerenlightenenvision/2016/03/21/dead-end-relationships.mp3",
            "categories": [
                {
                    "_": "Relationships",
                    "$": {
                        "domain": "https://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "Is Your Relationship Meant to Be?",
            "datePublished": "Thu, 17 Mar 2016 16:00:00 GMT",
            "description": "Is your relationship meant to be? So many people believe that just because a greater destiny brought the two of you together, that the relationship is meant to be. And while that could possibly be true in some cases, we all have an individual responsibility to ourselves to determine if that relationship really meets our needs, desires and expectations. If you are unfulfilled and unhappy in a relationship, why would you consider staying in it, just because you believe it is meant to be? What it really comes down to is our own choices for ourselves, our relationships and for our lives. Even if a  mystical force brought you together, that same mystical force does not coerce you to staying stuck in something that makes you miserable. In reality, that mystical force expects you be able to see the reality of your situation and take ownership of your life.\r\n",
            "length": "54595545",
            "sourceUrl": "https://www.blogtalkradio.com/empowerenlightenenvision/2016/03/17/is-your-relationship-meant-to-be.mp3",
            "categories": [
                {
                    "_": "Relationships",
                    "$": {
                        "domain": "https://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "Is Controlling Behavior Ruining Your Relationship?",
            "datePublished": "Mon, 14 Mar 2016 16:00:00 GMT",
            "description": "When we feel insecure in our romantic relationship we may become prone to controlling behavior. Controlling behavior, either from you or your partner, will ruin your relationship. . We may be controlling because we fear our romantic partner will abandon us. We may be controlling because this is our nature. We may be controlling because we fear our partner may cheat on us.  Instead of trying to gain control of your partners thoughts, feelings, or behaviors, you need to gain control of your own. During this broadcast we will give examples of controlling behavior in relationships and give you some guidance on how to get control of your own thoughts and behaviors.\r\n",
            "length": "54039241",
            "sourceUrl": "https://www.blogtalkradio.com/empowerenlightenenvision/2016/03/14/is-controlling-behavior-ruining-your-relationship.mp3",
            "categories": [
                {
                    "_": "Relationships",
                    "$": {
                        "domain": "https://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "Soulmate Relationships Were Never Meant to be Easy",
            "datePublished": "Thu, 10 Mar 2016 17:00:00 GMT",
            "description": "You see it everywhere, on television, in the movies, on dating sites, you name it. Find your soulmate! You are incomplete without your soulmate! Everyone wants to find their soulmate so they can then finally be happy, live happily ever after and be in a perfect drama free relationship. Well, here is a news flash for everyone  - Soulmate relationships are often some of the most difficult relationships that we as human souls will encounter in our lives. Who said they would be easy? Why does everyone think they will be? Today we will discuss our thoughts on soulmate relationships, why they are challenging and what you can do to stay sane if you are in one.\r\n",
            "length": "53804766",
            "sourceUrl": "https://www.blogtalkradio.com/empowerenlightenenvision/2016/03/10/soulmate-relationships-were-never-meant-to-be-easy.mp3",
            "categories": [
                {
                    "_": "Relationships",
                    "$": {
                        "domain": "https://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "Relationships: Taking the Good with the Bad",
            "datePublished": "Mon, 07 Mar 2016 17:00:00 GMT",
            "description": "We have all heard it in wedding vows: In sickness and in health, for richer or for poorer, in good times and in bad times....and we make those vows believing that is what love, and a real relationship stands for. But what happens when the going gets really bad for one of you and your partner is unsupportive? How do you prepare yourself to not get blind-sided by someone who can not be counted on to help you through the bad times? The main purpose or point of a relationship is to be with someone who cares about you and shows it!\r\n",
            "length": "54056796",
            "sourceUrl": "https://www.blogtalkradio.com/empowerenlightenenvision/2016/03/07/relationships-taking-the-good-with-the-bad.mp3",
            "categories": [
                {
                    "_": "Relationships",
                    "$": {
                        "domain": "https://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "Relationship Connections and Responsibility",
            "datePublished": "Thu, 03 Mar 2016 17:00:00 GMT",
            "description": "It seems that everyone is talking about connections these days and the connection they feel to their romantic partner. People insist that some of these connections are soulmate or twin flame connections, soul partner connections and spiritual connections that the Universe has put together. Sometimes though the connection is not felt, or honored, by both parties who are in the relationship. What can you do about it?  If a connection is truly divinely inspired, by God or the Universe, wouldn't it make the most sense to leave the unfolding of that relationship to the higher power who got it rolling, instead of trying to fix and control it yourself? What is your responsibility in the framework of this connection to your romantic partner, to yourself and to the Divine?\r\n",
            "length": "54730546",
            "sourceUrl": "https://www.blogtalkradio.com/empowerenlightenenvision/2016/03/03/relationship-connections-and-responsibility.mp3",
            "categories": [
                {
                    "_": "Relationships",
                    "$": {
                        "domain": "https://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "The Power of Giving Up",
            "datePublished": "Mon, 29 Feb 2016 17:00:00 GMT",
            "description": "There are times in our lives when we really must realize that we have no choice but to give up, walk away and move on. This does not imply that we are quitters, and should not have any negative connotation attached to that decision, it simply means that we realize that we are not going with the divine flow of the Universe in what is right for our lives, allowing them to see that we are open to something better coming into our lives. Whether it is a job, career or relationship of any kind, when faced with the truth that it is time to give up, it may feel frustrating, depressing, or perhaps even scary. But in reality, it is very freeing because you are no longer a slave to that failing job, career or relationship and are ready to take on something better, and better for you and your soul. Tonight we will discuss how giving up can be the most empowering thing for you to do.\r\n",
            "length": "53925138",
            "sourceUrl": "https://www.blogtalkradio.com/empowerenlightenenvision/2016/02/29/the-power-of-giving-up.mp3",
            "categories": [
                {
                    "_": "Relationships",
                    "$": {
                        "domain": "https://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "The Dating Game: Why Dating is so Important in Getting to Know Someone",
            "datePublished": "Thu, 25 Feb 2016 17:00:00 GMT",
            "description": "All relationships are different.  They are as unique as the two individuals that define them.  Some couples are married, some have an open relationships, some are simply sexual partners with no strings attached, yet each is considered a relationship. Too many people overuse the term relationship to describe the status between themselves and the person they love even when they are in the very early dating stage of getting to really know someone. The dating phase of a relationship is the most important phase because it is your journey of discovery to allow you to determine if you and your new love interest are compatible and want similar things from life and love. Many times, in an effort to get to the relationship stage, people tend to blow past the dating phase. Today we will explain, in great detail, why this discovery phase of getting to know someone is crucial to your own happiness!\r\n",
            "length": "52387049",
            "sourceUrl": "https://www.blogtalkradio.com/empowerenlightenenvision/2016/02/25/the-dating-game-why-dating-is-so-important-in-getting-to-know-someone.mp3",
            "categories": [
                {
                    "_": "Relationships",
                    "$": {
                        "domain": "https://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "Is Your Relationship Organic or Processed?",
            "datePublished": "Mon, 22 Feb 2016 17:00:00 GMT",
            "description": "There is a huge pull toward organic food these days and away from processed food. Processed food was created to extend the shelf life of certain food items with preservatives and other chemical alterations so they would not expire. We see so many people trying to do the same thing with relationships. Does your relationship have an expiration date or is it so full of overly processed toxins and poisons because you want to hold onto it no matter how miserable you are? Relationships that have the ability to develop naturally and organically stand a much greater chance of success than those that are rushed and forced into some preconceived format of where they are supposed to go. Relationships that are not given the opportunity to develop naturally, usually fail anyway, as expectations of one of the parties in the relationship can never quite be realized. Do you have an organic or processed relationship? \r\n",
            "length": "55542640",
            "sourceUrl": "https://www.blogtalkradio.com/empowerenlightenenvision/2016/02/22/is-your-relationship-organic-or-processed.mp3",
            "categories": [
                {
                    "_": "Relationships",
                    "$": {
                        "domain": "https://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "Should You Be Friends with Your Ex?",
            "datePublished": "Thu, 18 Feb 2016 17:00:00 GMT",
            "description": "In a perfect world when a relationship ends, we would all want it to end amicably. No one wants the drama and fighting that can sometimes occur at the end of a relationship to make it more difficult than it has to be. It is quite possible to end the relationship amicably... but does this mean that you should always end the relationship and remain friends? If both parties are able to do this and not have the friendship interfere with each moving on with their lives that is one thing, but if one holds onto that friendship hoping it will morph into a relationship again, it can be very difficult for them to move on with their life. You may say you are 'still friends' but you actually have to BE friends and each needs to think how this will work within the dynamic of their new life.\r\n",
            "length": "52961742",
            "sourceUrl": "https://www.blogtalkradio.com/empowerenlightenenvision/2016/02/18/should-you-be-friends-with-your-ex.mp3",
            "categories": [
                {
                    "_": "Relationships",
                    "$": {
                        "domain": "https://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "Relationships: Facts and Fiction",
            "datePublished": "Mon, 15 Feb 2016 17:00:00 GMT",
            "description": "When it comes to relationships it can be very difficult to distinguish facts from fiction. When you don't have all the facts, it can be quite easy to weave a significant amount of fiction into our 'story'. Until you know the facts, or at least enough of them, it is essential that you do your best to refrain from jumping to conclusions, assuming, glamorizing or fictionalizing what a great relationship would be, and how great someone would be if you were in a relationship with them. Do you know which parts of your relationship are built on facts versus what may be built on fiction? How can you differentiate facts from fiction?\r\n",
            "length": "52961742",
            "sourceUrl": "https://www.blogtalkradio.com/empowerenlightenenvision/2016/02/15/relationships-facts-and-fiction.mp3",
            "categories": [
                {
                    "_": "Relationships",
                    "$": {
                        "domain": "https://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "Valentine's Day: Isn't Love Complicated Enough?",
            "datePublished": "Sat, 13 Feb 2016 23:00:00 GMT",
            "description": "Valentine’s Day evokes thoughts of chocolate, flowers, romantic cards, and cherubic angels shooting us with arrows. There are special diamonds, jewelry, lingerie and secret indulgences you can buy your Valentine. Much of today's society views Valentine’s Day as an obligation who feel they better recognize their sweetheart with flowers and fluff or endure resentment for the rest of the year. Yes folks, it is Valentines day once again, and in many cases, it won't live up to the hype or the high expectations placed on what is allegedly the most romantic day of the year.\r\n",
            "length": "53004374",
            "sourceUrl": "https://www.blogtalkradio.com/empowerenlightenenvision/2016/02/13/valentines-day-isnt-love-complicated-enough.mp3",
            "categories": [
                {
                    "_": "Relationships",
                    "$": {
                        "domain": "https://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "What Makes Her So Special?",
            "datePublished": "Thu, 12 Nov 2015 18:00:00 GMT",
            "description": "You know who she is. She may be the of many women's existence, the dreaded \"her\". But who is she exactly? Well..You know her, she is the one that is with the guy who would be perfect for YOU, but instead he is in a relationship with HER. When someone else has what you want, it is easy to hate them. When you believe someone is keeping you from getting what you deserve, it is easy to blame them. When someone has something more than you can or could ever get, it is easy to be jealous of them. But what does she really have? On this show we will discuss what is really going on here and put it in a new perspective for you, so you have a better understanding of both HER and HIM.\r\n",
            "length": "53849070",
            "sourceUrl": "https://www.blogtalkradio.com/empowerenlightenenvision/2015/11/12/what-makes-her-so-special.mp3",
            "categories": [
                {
                    "_": "Relationships",
                    "$": {
                        "domain": "https://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "Do Your Negative Thoughts and Emotions Get the Best (and Worst) of You?",
            "datePublished": "Sun, 08 Nov 2015 17:30:00 GMT",
            "description": "You say you want to manifest something into your life BUT do you really? Your emotions, or self doubts, could actually be getting in the way of getting what you want! Where your emotion is, that is where your power is, and if your emotions are all over the place, so will your ability to create what you want. Emotions, thoughts and feelings, have power, and we may be unaware of the power we are giving them or that they have an influence in our choices and outcomes. When this happens, you actually create the opposite of what you want! We need to figure out what these negative thoughts or emotions are and head them off at the pass so we can draw into our lives the things we desire the most.\r\n",
            "length": "55999052",
            "sourceUrl": "https://www.blogtalkradio.com/empowerenlightenenvision/2015/11/08/do-your-negative-thoughts-and-emotions-get-the-best-and-worst-of-you.mp3",
            "categories": [
                {
                    "_": "Relationships",
                    "$": {
                        "domain": "https://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "Are Bad Habits Taking a Toll on Your Relationship?",
            "datePublished": "Thu, 05 Nov 2015 16:00:00 GMT",
            "description": "Probably all of us have picked up a few bad habits during the course of our lives. We may eat the wrong things, drink too much, not exercise enough or do other things that are really not good for our bodies or our spirit. When it comes to our romantic relationships, however, we can also pick up bad habits, that if not corrected can bring about the end of that relationship. To get rid of any bad habit, once and for all, will take a certain amount of willpower and commitment. Have you picked up and bad habits that could be negatively effecting your relationship? Do you have the willpower you will need to stop those bad habits? Do you even know that you have these bad habits that are ruining your relationship? Learn how to identify these relationship bad habits and kick them once and for all!\r\n",
            "length": "53857847",
            "sourceUrl": "https://www.blogtalkradio.com/empowerenlightenenvision/2015/11/05/are-bad-habits-taking-a-toll-on-your-relationship.mp3",
            "categories": [
                {
                    "_": "Relationships",
                    "$": {
                        "domain": "https://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "Soulmates, Twin Flames and Signs from the Universe",
            "datePublished": "Mon, 02 Nov 2015 04:00:00 GMT",
            "description": "The terms soulmates and twin flames are very popular today, when it comes to romantic love, but many people may not fully understand what a soulmate or twin flame relationship actually is!  Soulmate and twin flame relationships can feel very similar, but the Universe does present signs, although some can be subtle, to help you differentiate between a soulmate and twin flame relationship. The Universe will also give us signs, some in the form of red flags, when they want us to see that a certain relationship may not be the best one for us.  But what are you doing with those signs? Do you ignore them, choosing to accept other signs instead, like both your grandmothers having the same birthday?  So what signs from the universe are you receiving? Are you getting sign after sign that your soulmate relationship is not meant to be? Are you getting signs from the universe that it is time to end this relationship and move on? Are you ignoring those signs or are you paying attention to them? Just because you BELIEVE this is a soulmate relationship, does not necessarily mean that it is.\r\n",
            "length": "53857847",
            "sourceUrl": "https://www.blogtalkradio.com/empowerenlightenenvision/2015/11/02/soulmates-twin-flames-and-signs-from-the-universe.mp3",
            "categories": [
                {
                    "_": "Relationships",
                    "$": {
                        "domain": "https://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "Jealousy and How it Affects and Can Ruin Your Relationships",
            "datePublished": "Sat, 26 Sep 2015 18:00:00 GMT",
            "description": "Jealousy occurs when a person feels their relationship, not necessarily romantic, is threatened by someone or something outside of the relationship. Jealousy is an emotion and typically refers to the negative thoughts and feelings of insecurity, fear, and anxiety over the anticipated loss of something but most specifically… a romantic relationship. Jealousy often consists of a combination of emotions such as anger, resentment, and insecurity. Jealousy is a difficult thing for some folks to get a handle on but the consequences of jealousy can often be fatal to a relationship. Do you find your romantic partner getting jealous over the smallest infractions, real or imaginary? Do you stalk your ex online getting jealous of every little thing they post on Facebook, Twitter and Instagram? Tonight we will discuss the darker side of romantic relationships and help you decide what you should do about it.\r\n",
            "length": "52630719",
            "sourceUrl": "https://www.blogtalkradio.com/empowerenlightenenvision/2015/09/26/jealousy-and-how-it-affects-and-can-ruin-your-relationships.mp3",
            "categories": [
                {
                    "_": "Relationships",
                    "$": {
                        "domain": "https://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "Does Your Relationship Pass the Test?",
            "datePublished": "Tue, 15 Sep 2015 22:00:00 GMT",
            "description": "Does your relationship make the grade? Better yet do you pass the tests in how you handle the different dynamics that are thrown at your by being in a relationship? There is a grading system for diamonds, work evaluations, college entrance exams as well as scholastic endeavors in general. There is even a grading system in place for eggs! A grading system allows us to test by some predetermined standard, if something qualifies to 'pass' based on those defined guidelines. But when it comes to our relationships, which are supposed to be some of the most important things in our lives, it seems that any qualifications or guidelines go right out the window! Do you have guidelines set up to see if a relationship can qualify? What guidelines should be in place? Does your relationship pass the test?\r\n",
            "length": "53993684",
            "sourceUrl": "https://www.blogtalkradio.com/empowerenlightenenvision/2015/09/15/does-your-relationship-pass-the-test.mp3",
            "categories": [
                {
                    "_": "Relationships",
                    "$": {
                        "domain": "https://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "Can You Take a Hint?",
            "datePublished": "Mon, 07 Sep 2015 01:30:00 GMT",
            "description": "Hints are subtle. They can help us uncover more details and find answers, but we have to really be able to see them to get them. When it comes to our romantic relationships, dating and love, hints can present themselves in several different ways. These are intended to allow us to see the reality of the situation and provide little glimpses into feelings, intentions and behaviors your romantic partner or person or interest may be trying to hide.  Furthermore, in romantic situations, both parties may be throwing their own hints, and be completely oblivious to the little clues that are being sent in their direction. Hints are like clues to the future, and if we pay more attention to them we can shape the future of our relationships, avoid the wrong relationships, and detour around the potholes in our relationships.\r\n",
            "length": "53672691",
            "sourceUrl": "https://www.blogtalkradio.com/empowerenlightenenvision/2015/09/07/can-you-take-a-hint.mp3",
            "categories": [
                {
                    "_": "Relationships",
                    "$": {
                        "domain": "https://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "Is Your Type the Right Type for You?",
            "datePublished": "Thu, 27 Aug 2015 20:30:00 GMT",
            "description": "At different phases of our lives we have probably been attracted to a specific type of man or woman. Blonde, brunette, blue-eyed, brown-eyed, tall or short.. it seems that most of us may have specific characteristics in another we find attractive and desirable. What about defining the type of person we find desirable based on their personality and character? Maybe we want someone who is loyal, kind, passionate and a lot of fun to be around. If you have always found yourself dating the same type of person, with dark hair and dark eyes for example, but every relationship with your type left you feeling miserable, lonely and betrayed, wouldn't it be time to rethink what your definition of the right type should be? When we focus to closely on a specific type of person to fulfill our romantic lives, we are very often shutting ourselves off to many people who may be a better type for us because they would never betray us. SO tonight we will ask you.. what is the right type for you?\r\n",
            "length": "54113593",
            "sourceUrl": "https://www.blogtalkradio.com/empowerenlightenenvision/2015/08/27/is-your-type-the-right-type-for-you.mp3",
            "categories": [
                {
                    "_": "Relationships",
                    "$": {
                        "domain": "https://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "All Psychic Readings Show with Sarah and Sophia",
            "datePublished": "Tue, 11 Aug 2015 04:30:00 GMT",
            "description": "It's that time again! Last time we did this show we had such a great response from you guys, so once again, we are are taking a break from our regular relationship discussion format and making this show all about YOU and how we can help you. While the majority of our listeners enjoy our relationship topics, a few have told us that they want to hear us do more live readings ... so we have heard you! This show is about YOU. I\r\n\r\nThis show is all about FREE PSYCHIC READINGS, so now is your opportunity to get your questions answered by both of us, at the same time. If you have not been able to speak to us and need clarity on something, give us a call during show time at . Also make use of the Instant feedback option during show time because if we don't answer it on the air, chances are we will answer it on our Facebook Fan page after the show!! \r\n\r\n \r\n",
            "length": "55099559",
            "sourceUrl": "https://www.blogtalkradio.com/empowerenlightenenvision/2015/08/11/all-psychic-readings-show-with-sarah-and-sophia.mp3",
            "categories": [
                {
                    "_": "Relationships",
                    "$": {
                        "domain": "https://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "Passive Aggressive Behavior in Relationships",
            "datePublished": "Fri, 31 Jul 2015 15:30:00 GMT",
            "description": "When it comes to relationships, passive aggressive behavior can take on many forms. Some of these behaviors are very easy to spot while others can be very subtle, going unnoticed for years. Passive aggressive behavior always avoids an honest, direct approach when dealing with your romantic partner, and always deteriorates to acting out, usually in a childish way. You may achieve a temporary result by being passive aggressive but the ultimate result will be either an unhappy relationship or a relationship that ends. Passive aggressive behavior never solves the problems, it only creates more. Are you guilty of being passive aggressive in your relationship? Is your partner exhibiting passive aggressive tendencies? Learn how to identify passive aggressive behavior and what you can do about it with tonight's session of Empower Enlighten Envision your Life!\r\n",
            "length": "52934948",
            "sourceUrl": "https://www.blogtalkradio.com/empowerenlightenenvision/2015/07/31/passive-aggressive-behavior-in-relationships.mp3",
            "categories": [
                {
                    "_": "Relationships",
                    "$": {
                        "domain": "https://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "Getting Closure in Relationships",
            "datePublished": "Mon, 27 Jul 2015 15:30:00 GMT",
            "description": "Closure seems to be as difficult to find in some cases as the holy grail. People seek closure from relationships so they can move on and let go of the past. So many say they need closure from their relationships. But do they really need closure or do they 'need' it as a way to keep obsessing about an ex? Do you really need someone else to give you closure? Why can't you find that closure from within yourself? So, what is it exactly that you need to get closure? Is the path to closure right in front of you yet you are refusing to take the necessary steps to achieve it? If someone has closed the door on your relationship, by ending it or being with someone else, this should be enough closure for you to move on with your life.\r\n\r\n \r\n",
            "length": "53017286",
            "sourceUrl": "https://www.blogtalkradio.com/empowerenlightenenvision/2015/07/27/getting-closure-in-relationships.mp3",
            "categories": [
                {
                    "_": "Relationships",
                    "$": {
                        "domain": "https://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "Love Triangles",
            "datePublished": "Tue, 21 Jul 2015 16:00:00 GMT",
            "description": "Love triangles might be entertaining in soap operas, Lifetime TV movies or romantic comedies, but in real life they suck! Relationships are supposed to involve two people, and when a third person is introduced into that relationship, it will be devastating for one of them while the other two could be totally oblivious to anything except their own fun and games. What is a love triangle? Well it is a relationship made up of three people, there were two people in the relationship and then one of the parties decided to bring in a third member, usually without telling their partner. Love triangles are selfish because two parties are satisfying their own needs without considering the third member. A love triangle never ends with all three people involved having a happy ending. Someone will lose, it always happens that way.\r\n",
            "length": "55053165",
            "sourceUrl": "https://www.blogtalkradio.com/empowerenlightenenvision/2015/07/21/love-triangles.mp3",
            "categories": [
                {
                    "_": "Relationships",
                    "$": {
                        "domain": "https://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "Drama Queens and Drama Kings",
            "datePublished": "Tue, 14 Jul 2015 12:00:00 GMT",
            "description": "Do you have drama in your relationship? Are you a Drama Queen because it is the only way you can get your guy to do what you want? Every says they hate drama, especially when it comes to their relationships. Why then, do many people who are in relationships engage in so much drama, or when it is not there, create it themselves? People bring drama into their relationships to get power and control over their romantic partner. Drama Kings and Drama Queens make the worst romantic partners because you will never be able to please them. They will never be happy. You could give them the world and all you will get is more drama....and bullying. Do you know how to spot a Drama Queen or Drama King? What is the best course of action you should take if you find yourself in a melodramatic relationship?  If you are one of the ones who insists that you don't want drama in your life, or the emotional ups and downs that consistently go with that, why are you still in a relationship with a Drama Queen or Drama King?\r\n",
            "length": "54478889",
            "sourceUrl": "https://www.blogtalkradio.com/empowerenlightenenvision/2015/07/14/drama-queens-and-drama-kings.mp3",
            "categories": [
                {
                    "_": "Relationships",
                    "$": {
                        "domain": "https://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "Appearances Can Be Deceiving",
            "datePublished": "Wed, 08 Jul 2015 19:00:00 GMT",
            "description": "Have you ever noticed that some appearances can be deceiving? We may know someone, work with someone or see someone at the gym who we might think would make a good romantic partner. But would they? You only know them in one context, as a friend, work mate or gym friend and have no idea how they would really perform in a romantic relationship. Before you go off fantasizing about the perfect relationship you could have if you only had your neighbor's husband or  son's baseball coach, you need to really see and understand that you are only seeing one side of that person. You don't know them. You only know them as the guy who brings pizza, cleans the pool or cuts the lawn. Sure your co-worker may have his work like together because he makes more sales than anyone else and is on the fast track for promotion, but what is his marriage like?  You don't really know for sure. You don't really know how any of these people in your life you may project romantic fantasies on really are in a real life relationship. What looks good on the outside, may not be so attractive on the inside, especially when it comes to love. \r\n",
            "length": "57606478",
            "sourceUrl": "https://www.blogtalkradio.com/empowerenlightenenvision/2015/07/08/appearances-can-be-deceiving.mp3",
            "categories": [
                {
                    "_": "Relationships",
                    "$": {
                        "domain": "https://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "Emotional Logic is an Oxymoron",
            "datePublished": "Thu, 02 Jul 2015 22:00:00 GMT",
            "description": "When it comes to love, there are times people throw logic right out the window.  They find ways to justify their relationships with emotional logic. With emotional logic, there really is no logic and all decisions, are emotionally based, making zero sense to the logical mind. By fabricating illogical reasons to stay stuck in unhealthy situations, people are refusing to view their relationships from a realistic place. When you think with your heart and emotions instead of with your brain and your logic, common sense is twisted into excuses you use to justify your bad love and relationship decisions. How do you know if you are using emotional logic to make decisions regarding your relationship? How do you move from a place of thinking with your heart toward logical thinking? Tonight we are talking about emotional logic and why using it just simply DOES NOT MAKE ANY SENSE!\r\n",
            "length": "55137593",
            "sourceUrl": "https://www.blogtalkradio.com/empowerenlightenenvision/2015/07/02/emotional-logic-is-an-oxymoron.mp3",
            "categories": [
                {
                    "_": "Relationships",
                    "$": {
                        "domain": "https://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "The Reality of Creating Change",
            "datePublished": "Wed, 24 Jun 2015 21:00:00 GMT",
            "description": "So many people think about creating change in their lives and their relationships. Unfortunately, many expect these things to change as the result of a miracle. When we want change in our lives, we have a responsibility to ourselves to be instrumental in creating that change. It is part of the reason we are here, to grow and evolve, and to change what we don't want or like in our lives, to make them better... to have the lives we want. We can find excuse after excuse to stay stuck and not create the changes we desire and often need, out of our own fears, insecurity or instability. On the other hand, when we do create change, we can often become impatient, expecting the changes we are making to manifest outwardly in a very short period of time, which is very unrealistic. Tonight we will discuss creating the changes you want in your life, what to expect from those changes and why it can take a while to reflect these changes in our lives. Bottom line is REAL CHANGE takes time... do you have what it takes to change your life for the better?\r\n",
            "length": "54876369",
            "sourceUrl": "https://www.blogtalkradio.com/empowerenlightenenvision/2015/06/24/the-reality-of-creating-change.mp3",
            "categories": [
                {
                    "_": "Relationships",
                    "$": {
                        "domain": "https://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "Instant Relationships",
            "datePublished": "Sun, 21 Jun 2015 14:30:00 GMT",
            "description": "In today's fast-paced, quick-moving world, so many people seem to want everything right away. Instant oatmeal, instant pudding, faster phones, high-speed this and that, and unfortunately, many also believe they can have instant relationships. When you fall into an instant relationship you are not allowing yourself to get to know your romantic partner, nor allowing them to know you. What happened to the days of allowing things to unfold naturally, while you are dating and learning about each other? What happens when you fall into an instant relationship? The majority of instant relationships are doomed to fail. They just do not have the foundation required to build a lasting loving relationship. They are all about the hype and not about the substance, which is what real love requires.\r\n",
            "length": "53719875",
            "sourceUrl": "https://www.blogtalkradio.com/empowerenlightenenvision/2015/06/21/instant-relationships.mp3",
            "categories": [
                {
                    "_": "Relationships",
                    "$": {
                        "domain": "https://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "Are You With Someone Who is Emotionally Unavailable?",
            "datePublished": "Mon, 15 Jun 2015 20:00:00 GMT",
            "description": "At times you may find yourself in a relationship with someone who is just not available, either physically or emotionally. Life is just too short to waste on someone who is unavailable, because these guys and girls, are very difficult to be with. When you are emotionally available to them but they are not with you, the relationship will be very unbalanced, dysfunctional and draining.  This situation happens quite a bit when it comes to matters of the heart, that the one we love is emotionally unavailable but what can be done about it? Sometimes the relationships we want to work out the most, don’t.  Not all emotionally unavailable men will stay that way. Will the one you love ever be emotionally available to you? Is there any way you can help create that change? Loving someone who is emotionally unavailable is very draining because you are doing all the work. They are doing nothing. You are giving and not receiving anything. You can only do that for so long until all your reserves are gone. Sitting back and hoping for change is not going to fix this dysfunctional relationship.\r\n",
            "length": "53464502",
            "sourceUrl": "https://www.blogtalkradio.com/empowerenlightenenvision/2015/06/15/are-with-someone-who-is-emotionally-unavailable.mp3",
            "categories": [
                {
                    "_": "Relationships",
                    "$": {
                        "domain": "https://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "Sometimes Doing NOTHING is the Best Course of Action",
            "datePublished": "Tue, 02 Jun 2015 18:30:00 GMT",
            "description": "When you are stuck in a difficult situation, waiting for something to change, do you often feel the need to do something? Are you action oriented?  A mover and a shaker who just gets things done, and makes things happen? Are there times when you have tried to force something, by taken action, only to see if fall apart? Do you believe that if YOU don't do something, no one ever will? Do you try to create change, even at the risk of creating a negative change to your situation? There are times and occasions where taking action is a good thing, like when you are preparing for a hurricane. Then again, there are actually times when it is best to stand down, be idle, and do nothing. Doing nothing, can be one of the hardest things to do, but very often the only thing to do, especially where life lessons are involved.\r\n",
            "length": "54320901",
            "sourceUrl": "https://www.blogtalkradio.com/empowerenlightenenvision/2015/06/02/sometimes-doing-nothing-is-the-best-course-of-action.mp3",
            "categories": [
                {
                    "_": "Relationships",
                    "$": {
                        "domain": "https://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "Are You in a Toxic Relationship?",
            "datePublished": "Tue, 26 May 2015 22:30:00 GMT",
            "description": "Are you the victim of a toxic relationship? Have you lost the confident, self-assured woman you used to be? Can you barely recognize who you are anymore? Has your joy been replaced by fear, worry and insecurity? If you are in a relationship with a toxic man (or woman) you have probably lost complete control of your life. A toxic relationship is the most difficult of dysfunctional relationships. There is no way to win with a toxic man, no matter how hard you try or how much you love him. It is time to seriously consider a DETOX and get the toxicity out of your life, once and for all.\r\n",
            "length": "54218919",
            "sourceUrl": "https://www.blogtalkradio.com/empowerenlightenenvision/2015/05/26/are-you-in-a-toxic-relationship.mp3",
            "categories": [
                {
                    "_": "Relationships",
                    "$": {
                        "domain": "https://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "Has Your Relationship Made You Disappear?",
            "datePublished": "Thu, 21 May 2015 17:00:00 GMT",
            "description": "Have you ever had a friend who disappeared from your life when she started a new relationship? Have you ever abandoned your family and friends because they disapprove of your romantic partner because they think your relationship is no good for you? Do you put your romantic partners feelings and desires before those of your family or friends who have always been there for you? Do you sacrifice your own desires and needs at the expense of your 'team'? If your family does not think he is the right one for you, perhaps they have experienced changes in your behavior and personality.\r\n",
            "length": "53411840",
            "sourceUrl": "https://www.blogtalkradio.com/empowerenlightenenvision/2015/05/21/has-your-relationship-made-you-disappear.mp3",
            "categories": [
                {
                    "_": "Relationships",
                    "$": {
                        "domain": "https://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "Why Isn't He Afraid He is Going to Lose Me?",
            "datePublished": "Tue, 12 May 2015 18:00:00 GMT",
            "description": "Is your romantic partner pushing the envelope with their bad behavior? Do you wonder why they keep crossing your boundaries? Why aren't they afriad of the consequences? Do you ask yourself (and others) “Why aren't they afraid of losing me?” There are two answers to this question: 1)Because you have taken all that fear away and 2)Because they really don't care if they lose you! Which one is it? Today, you will find out!\r\n",
            "length": "57555905",
            "sourceUrl": "https://www.blogtalkradio.com/empowerenlightenenvision/2015/05/12/why-isnt-he-afraid-he-is-going-to-lose-me.mp3",
            "categories": [
                {
                    "_": "Relationships",
                    "$": {
                        "domain": "https://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "How Mercury Retrograde Affects You and Your Relationships ~ Sarah and Sophia",
            "datePublished": "Mon, 11 May 2015 17:00:00 GMT",
            "description": "Mercury retrograde usually occurs three or four times per year, wreaking havoc upon our personal lives as well as our relationships. Mercury rules communication, travel, the internet and all electronic gadgets. We can expect travel delays, miscommunications, missed communications, computer snafus and crashes, appliances breaking, appointment cancellations and problems with our automobiles. With all the craziness in our communication attempts we usually experience misunderstandings and arguments in our romantic, professional and personal relationships. So how exactly will Mercury effect you? Listen in and find out!\r\n",
            "length": "54878458",
            "sourceUrl": "https://www.blogtalkradio.com/empowerenlightenenvision/2015/05/11/how-mercury-retrograde-affects-you-and-your-relationships-sarah-and-sophia.mp3",
            "categories": [
                {
                    "_": "Relationships",
                    "$": {
                        "domain": "https://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "Because Love is not Complicated Enough: Valentine's Day and it's Expectations",
            "datePublished": "Sun, 10 May 2015 16:00:00 GMT",
            "description": "Valentine’s Day evokes thoughts of chocolate, flowers, romantic cards, and cherubic angels shooting us with arrows. There are special diamonds, jewelry, lingerie and secret indulgences you can buy your Valentine. Much of today's society views Valentine’s Day as an obligation who feel they better recognize their sweetheart with flowers and fluff or endure resentment for the rest of the year. Yes folks, it is Valentines day once again, and in many cases, it won't live up to the hype or the high expectations placed on what is allegedly the most romantic day of the year.\r\n",
            "length": "53004329",
            "sourceUrl": "https://www.blogtalkradio.com/empowerenlightenenvision/2015/05/10/because-love-is-not-complicated-enough-valentines-day-and-its-expectations.mp3",
            "categories": [
                {
                    "_": "Relationships",
                    "$": {
                        "domain": "https://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "Looking for Mr. Right When All You Find is Mr. Wrong ~ Sarah and Sophia",
            "datePublished": "Sat, 09 May 2015 16:00:00 GMT",
            "description": "Many women have searched for Mr. Right, think they have finally found him, only to discover later on that he is Mr. Wrong. They may even try to turn this Mr. Wrong into Mr. Right, erroneously thinking that he will still fulfill their dreams and expectations in their relationship. We really are all smart enough to notice when a Mr. Wrong enters our lives and we should get away from him as fast as we can. But what do we do? Wait it out, hoping he will change into Mr. Right. This weeks show will focus on how to differentiate between Mr. Wrong and Mr. Right and what you can do about it.\r\n",
            "length": "54538240",
            "sourceUrl": "https://www.blogtalkradio.com/empowerenlightenenvision/2015/05/09/looking-for-mr-right-when-all-you-find-is-mr-wrong-sarah-and-sophia.mp3",
            "categories": [
                {
                    "_": "Relationships",
                    "$": {
                        "domain": "https://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "Reading Between the Lines in Relationships with Sarah Adelle and Sophia Elise",
            "datePublished": "Fri, 08 May 2015 22:00:00 GMT",
            "description": "Do you love someone but have no clue how they feel about you? Are you unable to figure out, without that decoder ring, what they are thinking, feeling or wanting from you, because their actions and words are in conflict. Mixed signals and inconsistent behavior may have you so confused at this point, you are not even sure which way is up! Do you try to read between the lines but usually end up on seeing a blur? Well tonight, we are discussing how to read between the lines, when you need to do it, when you don't need to do it and how to do it right.\r\n",
            "length": "54833737",
            "sourceUrl": "https://www.blogtalkradio.com/empowerenlightenenvision/2015/05/08/reading-between-the-lines-in-relationships-with-sarah-adelle-and-sophia-elise.mp3",
            "categories": [
                {
                    "_": "Relationships",
                    "$": {
                        "domain": "https://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "There is No FUN in Dysfunctional Relationships ~ Sarah Adelle and Sophia Elise",
            "datePublished": "Thu, 07 May 2015 17:00:00 GMT",
            "description": "Take a good look at the relationship you are in. Are you being treated unfairly, unkindly or unjustly? Do you fear the relationship is falling apart as the two of you drift further apart? Is there more drama in your relationship than there is on television? Do you find your self-esteem, self-respect and dignity, free-falling off a cliff? Are you frequently tolerating behavior and treatment you swore you never would? Lets face it.. does your relationship suck? Well then you are in a dysfunctional relationship and let's be real here.. there is no FUN in dysfunctional relationships.\r\n",
            "length": "51921815",
            "sourceUrl": "https://www.blogtalkradio.com/empowerenlightenenvision/2015/05/07/there-is-no-fun-in-dysfunctional-relationships-sarah-adelle-and-sophia-elise.mp3",
            "categories": [
                {
                    "_": "Relationships",
                    "$": {
                        "domain": "https://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "50 Ways to Lose Your Lover ~ Are YOU Ruining Your Relationship?",
            "datePublished": "Wed, 06 May 2015 18:00:00 GMT",
            "description": "50 Ways to LOSE Your Lover.. Nope that is not a typo. People can become so focused on what they can do to keep their romantic partner around they unwittingly miss what they are doing to repel them. There are so many ways to turn a guy, or gal, off and make them head for the hills so fast they leave skid marks. Now is your opportunity to learn what they are, so you do not do them, and risk losing your lover...unless you want to, of course. Otherwise known as \"The Silly Girls Way to Get Her Guy to Dump Her\".\r\n",
            "length": "52161724",
            "sourceUrl": "https://www.blogtalkradio.com/empowerenlightenenvision/2015/05/06/50-ways-to-lose-your-lover-are-you-ruining-your-relationship.mp3",
            "categories": [
                {
                    "_": "Relationships",
                    "$": {
                        "domain": "https://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "Actions and Words: Which Speaks Louder with Sarah Adelle and Sophia Elise",
            "datePublished": "Tue, 05 May 2015 23:30:00 GMT",
            "description": "Relationships can be confusing and it is often difficult to tell what your romantic partner thinks and feels concerning your relationship. If their words say one thing but their actions say something completely different, you may feel your are on a roller coaster ride to nowhere. Tonight we will give you your own personal decoder ring to help you figure out if actions speak louder than words or vice versa.\r\n",
            "length": "55122546",
            "sourceUrl": "https://www.blogtalkradio.com/empowerenlightenenvision/2015/05/05/actions-and-words-which-speaks-louder-with-sarah-adelle-and-sophia-elise.mp3",
            "categories": [
                {
                    "_": "Relationships",
                    "$": {
                        "domain": "https://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "Accountability, Responsibility and Free Will: There are No Victims Only Choices",
            "datePublished": "Sun, 03 May 2015 16:00:00 GMT",
            "description": "Taking a detour from our usual relationship topics we are focusing on being accountable and responsible for our lives. Rather than staying stuck as a victim, when we are accountable and responsible, we take ownership of our careers, relationships, and ourselves. Although at times we may feel like pawns in the chess game of life, we all have Free Will to make changes at any time we feel victimized, unhappy or disempowered. Life really does not happen by chance, we must be willing to be accountable and responsible for our own fate.\r\n",
            "length": "54741368",
            "sourceUrl": "https://www.blogtalkradio.com/empowerenlightenenvision/2015/05/03/accountability-responsibility-and-free-will-there-are-no-victims-only-choices.mp3",
            "categories": [
                {
                    "_": "Relationships",
                    "$": {
                        "domain": "https://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "Not ALL Relationships are Meant to Last with Sarah and Sophia",
            "datePublished": "Sat, 02 May 2015 16:00:00 GMT",
            "description": "Relationships come in and out of our lives. It is the natural flow of how relationships work. Sometimes someone is in your life for a lifetime, but very often the one we love is only in our life for a reason or a season... or even just a few weeks. When you are hanging onto the wrong relationship, with the wrong person, to try and make it work, you could be creating a block for the right person to enter your life. Some relationships are meant to work out and last, but others simply are not. How do you know if your relationship is meant to last?\r\n",
            "length": "53014778",
            "sourceUrl": "https://www.blogtalkradio.com/empowerenlightenenvision/2015/05/02/not-all-relationships-are-meant-to-last-with-sarah-and-sophia.mp3",
            "categories": [
                {
                    "_": "Relationships",
                    "$": {
                        "domain": "https://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "Manifesting the Relationship, Job and Life You WANT!",
            "datePublished": "Thu, 30 Apr 2015 21:30:00 GMT",
            "description": "Are you ready to take action to create the job you desire? Do you want a relationship that is loving, supportive and giving? Are you living the life you want? Are you fulfilling your dreams? If you are just trudging through life, reacting to everything that comes your way, how about taking a more proactive approach?  Tonight we will share insight and provide guidance on how to secure the job, relationship or life you have been yearning for. You can live the life you dreamed,  you just have to know how to co-create it with the Universe.\r\n\r\n Sarah and Sophia will support your ability to regain control over the obstacles and people that are getting in the way of your hopes, dreams and desires and empower you to live the life you want to live and deserve. They will bring you out of the darkness and into the light and give clarity to all your questions about career, finances, life path and love.\r\n",
            "length": "51361750",
            "sourceUrl": "https://www.blogtalkradio.com/empowerenlightenenvision/2015/04/30/manifesting-the-relationship-job-and-life-you-want.mp3",
            "categories": [
                {
                    "_": "Relationships",
                    "$": {
                        "domain": "https://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "Defeating Fear, Embracing Love: How To Conquer Fear for Good and Choose Love",
            "datePublished": "Thu, 30 Apr 2015 00:00:00 GMT",
            "description": "Defeating fear can be a major obstacle for many people. They say the only thing to fear is fear itself. But fear is a very real thing in all of our lives. We can fear failure and rejection in our personal and professional relationships. Fear and Love are the only two human emotions that truly exist. If we have fear we can not experience love and when we are love, all fears and negative emotions dissipate. Where to do you fall? Do you live with fearful emotions of anger, depression, insecurity, worthlessness and anxiety? Or are you joyful, peace-filled and happy with your life and living in the space of love?\r\n\r\nDuring our broadcast we will discuss how fear can manifest in your romantic relationships and cause you to behave in ways that could be disastrous to your love life. We will discuss how you can start to get control of your fears and the negative emotions that go with that and replace them with love.\r\n",
            "length": "54116101",
            "sourceUrl": "https://www.blogtalkradio.com/empowerenlightenenvision/2015/04/30/defeating-fear-embracing-love-how-to-conquer-fear-for-good-and-choose-love.mp3",
            "categories": [
                {
                    "_": "Relationships",
                    "$": {
                        "domain": "https://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "Questions About Metaphysics and Spirituality: Sarah Adelle and Sophia Elise",
            "datePublished": "Tue, 28 Apr 2015 19:30:00 GMT",
            "description": "There is no topic for today's episode as we have decided to answer your quesitons about spirituality and metaphysics. At the end of our last episode, we encouraged our listeners to write in there spiritual or metaphsyical questions which we will answer live on the air for you. Spirituality and metaphysics covers a wide variety of topics including spiritual growth, manifestation, soulmates, twinflames, how the Universe works, spirit guides and many other areas. \r\n",
            "length": "57602716",
            "sourceUrl": "https://www.blogtalkradio.com/empowerenlightenenvision/2015/04/28/questions-about-metaphysics-and-spirituality-sarah-adelle-and-sophia-elise.mp3",
            "categories": [
                {
                    "_": "Relationships",
                    "$": {
                        "domain": "https://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "Fantasy VS Reality: Relationship Fantasies Prevent You From Finding REAL Love",
            "datePublished": "Mon, 27 Apr 2015 15:30:00 GMT",
            "description": "Having unrealistic expectations in relationships can prevent you from finding real love. We all listened to tales of Snow White, Sleeping Beauty and Cinderella when we were kids and have held on to the fantasy that \"some day my prince will come\". In the real world, this usually does not happen, and yet, most of us want it. Instead of seeing the reality of the relationship in front of us we can allow our fantasies to distort real love. \r\n",
            "length": "53982772",
            "sourceUrl": "https://www.blogtalkradio.com/empowerenlightenenvision/2015/04/27/fantasy-vs-reality-relationship-fantasies-prevent-you-from-finding-real-love.mp3",
            "categories": [
                {
                    "_": "Relationships",
                    "$": {
                        "domain": "https://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "Patience and Waiting: Don't Do Something You Regret",
            "datePublished": "Fri, 24 Apr 2015 19:00:00 GMT",
            "description": "Patience and waiting are so important to prevent doing something you regret by  being impatient. We have heard it many times over when we do readings with our clients, that it is very difficult to be patient, especially when you are waiting for something you really REALLY want. We agree! However, when you become impatient and feel a need to take action, you can actually push that thing you want so badly further and further away from you!! During our broadcast we will discuss why waiting and patience are so important, especially when it comes to matters of the heart. When we are in an emotional state we are not thinking logically. We want something and we want it NOW!! Remember Veruka Salt from Willy Wonka and how she wanted everything NOW? Well, she went right down the garbage shoot!\r\n",
            "length": "53357505",
            "sourceUrl": "https://www.blogtalkradio.com/empowerenlightenenvision/2015/04/24/patience-and-waiting-dont-do-something-you-regret.mp3",
            "categories": [
                {
                    "_": "Relationships",
                    "$": {
                        "domain": "https://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "Is Your Soulmate at a Stalemate?",
            "datePublished": "Wed, 22 Apr 2015 18:00:00 GMT",
            "description": "At times a soulmate relationship can get stuck, or broken, and you find you are at a stalemate. Soulmate relationships are often challenging ones, and getting unstuck will require some effort and work. Many people believe soulmate relationships will work out based on some kind of divine intervention. This is usually never the case. We will spend about the first 30 minutes discussing this topic as only Sarah and Sophia can do. Sarah and Sophia Elise have been providing guidance to thousands of women (and men) for over two decades. They will help you reach your highest potential in love, career, finances and all other aspects of your life. No SCHTICK, no airy FAIRY TALES, just REAL PSYCHIC READINGS with REALISTIC ADVICE!\r\n",
            "length": "52859297",
            "sourceUrl": "https://www.blogtalkradio.com/empowerenlightenenvision/2015/04/22/is-your-soulmate-at-a-stalemate.mp3",
            "categories": [
                {
                    "_": "Relationships",
                    "$": {
                        "domain": "https://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "Do You Pass the Tests in Your Relationship?  Sarah and Sophia",
            "datePublished": "Thu, 19 Dec 2013 00:00:00 GMT",
            "description": "Does your relationship make the grade? Better yet, do you pass the tests on how you handle the different dynamics in your relationship? There is a grading system for diamonds, work evaluations, college entrance exams as well as scholastic endeavors in general. There is even a grading system in place for eggs! A grading system allows us to test by some predetermined standard, if something qualifies to 'pass' based on those defined guidelines. But when it comes to our relationships, which are supposed to be some of the most important things in our lives, it seems that any qualifications or guidelines go right out the window! Do you have guidelines set up to see if a relationship can qualify? What guidelines should be in place? Does your relationship pass the test?\r\n\r\nDuring this show we will also be doing FREE PSYCHIC READINGS, so now is your opportunity to get your questions answered by both of us, at the same time. If you have not been able to speak to us and need clarity on something, give us a call during show time.\r\n",
            "length": "14241728",
            "sourceUrl": "https://www.blogtalkradio.com/empowerenlightenenvision/2013/12/19/do-you-pass-the-tests-in-your-relationship-sarah-and-sophia.mp3",
            "categories": [
                {
                    "_": "Relationships",
                    "$": {
                        "domain": "https://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "Can You Take a Hint? What They Mean to Your Relationship w/ Sarah and Sophia",
            "datePublished": "Thu, 12 Dec 2013 00:00:00 GMT",
            "description": "Hints are subtle. They can help us uncover more details and find answers, but we have to really be able to see them to get them. When it comes to our romantic relationships, dating and love, hints can present themselves in several different ways. These are intended to allow us to see the reality of the situation and provide little glimpses into feelings, intentions and behaviors your romantic partner or person or interest may be trying to hide.  Furthermore, in romantic situations, both parties may be throwing their own hints, and be completely oblivious to the little clues that are being sent in their direction. Hints are like clues to the future, and if we pay more attention to them we can shape the future of our relationships, avoid the wrong relationships, and detour around the potholes in our relationships.\r\n",
            "length": "14304512",
            "sourceUrl": "https://www.blogtalkradio.com/empowerenlightenenvision/2013/12/12/can-you-take-a-hint-what-they-mean-to-your-relationship-w-sarah-and-sophia.mp3",
            "categories": [
                {
                    "_": "Relationships",
                    "$": {
                        "domain": "https://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "Is Your Type the Right Type for a Relationship?",
            "datePublished": "Thu, 05 Dec 2013 00:00:00 GMT",
            "description": "It seems that everyone is attracted to a certain 'type' of man or woman who they believe meet a certain number of physical or character traits. Also the 'type' we are attracted to may change over time. But when we insist that we must find someone who meets our 'type' criteria are we deliberately sabotaging our relationship possibilities and limiting ourselves from finding real love? \r\n",
            "length": "14218976",
            "sourceUrl": "https://www.blogtalkradio.com/empowerenlightenenvision/2013/12/05/is-your-type-the-right-type-for-a-relationship.mp3",
            "categories": [
                {
                    "_": "Relationships",
                    "$": {
                        "domain": "https://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "Passive Aggressive Behavior in Relationships w/ Sarah and Sophia",
            "datePublished": "Thu, 28 Nov 2013 00:00:00 GMT",
            "description": "When it comes to relationships, passive aggressive behavior can take on many forms. Some of these behaviors are very easy to spot while others can be very subtle, going unnoticed for years. Passive aggressive behavior always avoids an honest, direct approach when dealing with your romantic partner, and always deteriorates to acting out, usually in a childish way. You may achieve a temporary result by being passive aggressive, but the ultimate result will be either an unhappy relationship or a relationship that ends. Passive aggressive behavior never solves the problems, it only creates more. Are you guilty of being passive aggressive in your relationship? Is your partner exhibiting passive aggressive tendencies? Learn how to identify passive aggressive behavior and what you can do about it with tonight's session of Empower Enlighten Envision your Life!\r\n",
            "length": "13752128",
            "sourceUrl": "https://www.blogtalkradio.com/empowerenlightenenvision/2013/11/28/passive-aggressive-behavior-in-relationships-w-sarah-and-sophia.mp3",
            "categories": [
                {
                    "_": "Relationships",
                    "$": {
                        "domain": "https://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "Getting CLOSURE in Relationships with Sarah and Sophia",
            "datePublished": "Thu, 21 Nov 2013 00:00:00 GMT",
            "description": "People seek closure from relationships so they can move on and let go of the past but in some cases getting closure seems to be as difficult to find as the holy grail. So many say they need closure from their relationships. But do they really need closure or do they 'need' it as a way to keep obsessing about an ex? Do you really need someone else to give you closure? Why can't you find that closure from within yourself? If someone has closed the door on your relationship, by ending it or being with someone else, this should be enough closure for you to move on with your life.\r\n",
            "length": "14371040",
            "sourceUrl": "https://www.blogtalkradio.com/empowerenlightenenvision/2013/11/21/getting-closure-in-relationships-with-sarah-and-sophia.mp3",
            "categories": [
                {
                    "_": "Relationships",
                    "$": {
                        "domain": "https://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "Love Triangles and Relationships w/ Sarah and Sophia",
            "datePublished": "Thu, 14 Nov 2013 00:00:00 GMT",
            "description": "Love triangles might be entertaining in soap operas, Lifetime TV movies or romantic comedies, but in real life they suck! Relationships are supposed to involve two people, and when a third person is introduced into that relationship, it will be devastating for one of them while the other two could be totally oblivious to anything except their own fun and games.  A love triangle never ends with all three people involved having a happy ending. Someone will lose, it always happens that way.\r\n  \r\nSponsored by Voice of the Angels.com. New clients click here for a free 3 minute psychic reading at Voice of the Angels.com.\r\n",
            "length": "13062080",
            "sourceUrl": "https://www.blogtalkradio.com/empowerenlightenenvision/2013/11/14/love-triangles-and-relationships-w-sarah-and-sophia.mp3",
            "categories": [
                {
                    "_": "Relationships",
                    "$": {
                        "domain": "https://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "Drama Queens and Kings: Is there Drama in your Relationship?",
            "datePublished": "Thu, 07 Nov 2013 00:00:00 GMT",
            "description": " Everyone says they hate drama in their relationships... but they seem to participate in it no matter what. How can you identify drama queens and kings so you can steer clear of them in your relationships? If you are in a relationship with a drama queen or king what course of action should you take to ensure you can live in the drama free zone? \r\nSponsored by Voice of the Angels.com. New clients click here for a free 3 minute psychic reading at Voice of the Angels.com.\r\n  \r\n",
            "length": "14318048",
            "sourceUrl": "https://www.blogtalkradio.com/empowerenlightenenvision/2013/11/07/drama-queens-and-kings-is-there-drama-in-your-relationship.mp3",
            "categories": [
                {
                    "_": "Relationships",
                    "$": {
                        "domain": "https://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "Appearances Can be Deceiving Especially in Relationships",
            "datePublished": "Wed, 30 Oct 2013 23:00:00 GMT",
            "description": "Have you ever noticed that some appearances can be deceiving? We may know someone, work with someone or see someone at the gym who we might think would make a good romantic partner. But would they? You only know them in one context, as a friend, work mate or gym friend and have no idea how they would really perform in a romantic relationship. Before you go off fantasizing about the perfect relationship you could have if you only had your neighbor's husband or  son's baseball coach, you need to really see and understand that you are only seeing one side of that person. You don't know them. You don't really know how any of these people you project romantic fantasies on really are in a real life relationship. What looks good on the outside, may not be so attractive on the inside, especially when it comes to love. \r\n Sponsored by Voice of the Angels.com. New clients click here for a free 3 minute psychic reading at Voice of the Angels.com.\r\n",
            "length": "13982240",
            "sourceUrl": "https://www.blogtalkradio.com/empowerenlightenenvision/2013/10/30/appearances-can-be-deceiving-especially-in-relationships.mp3",
            "categories": [
                {
                    "_": "Relationships",
                    "$": {
                        "domain": "https://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "Emotional Logic and Relationships with Sarah and Sophia",
            "datePublished": "Wed, 23 Oct 2013 23:00:00 GMT",
            "description": "When it comes to love, there are times when people just allow their logic to go right out the window.  They find ways to justify their relationships with emotional logic. With emotional logic, there really is no logic and all decisions, are emotionally based, and make zero sense to the logical mind. By fabricating illogical reasons to stay stuck in unhealthy situations, people are refusing to view their relationships from a realistic place. When you think with your heart and emotions instead of with your brain and your logic, common sense is twisted into excuses you use to justify your bad love and relationship decisions. How do you know if you are using emotional logic to make decisions regarding your relationship? How do you move from a place of thinking with your heart toward logical thinking? Tonight we are talking about emotional logic and why using it just simply DOES NOT MAKE ANY SENSE!\r\n Sponsored by Voice of the Angels.com. New clients click here for a free 3 minute psychic reading at Voice of the Angels.com.\r\n  \r\n",
            "length": "13600640",
            "sourceUrl": "https://www.blogtalkradio.com/empowerenlightenenvision/2013/10/23/emotional-logic-and-relationships-with-sarah-and-sophia.mp3",
            "categories": [
                {
                    "_": "Relationships",
                    "$": {
                        "domain": "https://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "Creating Change in Your Life: Relationship Advice ",
            "datePublished": "Wed, 16 Oct 2013 23:00:00 GMT",
            "description": "So many people think about creating change in their lives and their relationships to change. Unfortunately, many expect these things to change as the result of a miracle. When we want change in our lives, we have a responsibility to ourselves to be instrumental in creating that change. We can find excuse after excuse to stay stuck and not create the changes we desire and often need, out of our own fears, insecurity or instability. On the other hand, when we do create change, we can often become impatient, expecting the changes to happen overnight. Tonight we will discuss creating the changes you want in your life, what to expect from those changes and why it can take a while to reflect these changes in our lives.  REAL CHANGE takes time... do you have what it takes to change your life for the better?\r\n Sponsored by Voice of the Angels.com. New clients click here for a free 3 minute psychic reading at Voice of the Angels.com.\r\n",
            "length": "14067488",
            "sourceUrl": "https://www.blogtalkradio.com/empowerenlightenenvision/2013/10/16/creating-change-in-your-life-relationship-advice.mp3",
            "categories": [
                {
                    "_": "Relationships",
                    "$": {
                        "domain": "https://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "Are You Too Available Someone Who is Not? Relationships",
            "datePublished": "Wed, 09 Oct 2013 23:00:00 GMT",
            "description": "At times you may find yourself in a relationship with someone who is just not available, either physically or emotionally. Life is just too short to waste on someone who is unavailable, because these guys and girls, are very difficult to be with. When you are emotionally available to them but they are not with you, the relationship will be very unbalanced, dysfunctional and draining.  Will the one you love ever be emotionally available to you? Is there any way you can help create that change?  Sitting back and hoping for change is not going to fix this dysfunctional relationship.\r\nSponsored by Voice of the Angels.com. New clients click here for a free 3 minute psychic reading at Voice of the Angels.com.\r\n",
            "length": "14438945",
            "sourceUrl": "https://www.blogtalkradio.com/empowerenlightenenvision/2013/10/09/are-you-too-available-someone-who-is-not-relationships.mp3",
            "categories": [
                {
                    "_": "Relationships",
                    "$": {
                        "domain": "https://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "Reading Between the Lines - Relationship Advice",
            "datePublished": "Wed, 02 Oct 2013 23:00:00 GMT",
            "description": "Do you love someone but have no clue how they feel about you? Are you unable to figure out, without that decoder ring, what they are thinking, feeling or wanting from you, because their actions and words are in conflict. Mixed signals and inconsistent behavior may have you so confused at this point, you are not even sure which way is up! Do you try to read between the lines but usually end up on seeing a blur? Well tonight, we are discussing how to read between the lines, when you need to do it, when you don't need to do it and how to do it right.\r\n Sponsored by Voice of the Angels.com. New clients click here for a free 3 minute psychic reading at Voice of the Angels.com\r\n",
            "length": "14240415",
            "sourceUrl": "https://www.blogtalkradio.com/empowerenlightenenvision/2013/10/02/reading-between-the-lines--relationship-advice.mp3",
            "categories": [
                {
                    "_": "Relationships",
                    "$": {
                        "domain": "https://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "Has Your Relationship Made You Disappear? Relationships",
            "datePublished": "Wed, 25 Sep 2013 23:00:00 GMT",
            "description": " Have you ever had a friend who disappeared from your life when she started a new relationship? Have you ever abandoned your family and friends because they disapprove of your romantic partner because they think your relationship is no good for you? Do you put your romantic partners feelings and desires before those of your family or friends who have always been there for you? Do you sacrifice your own desires and needs at the expense of your 'team'? If your family does not think he is the right one for you, perhaps they have experienced changes in your behavior and personality.\r\n Sponsored by Voice of the Angels.com. New clients click here for a free 3 minute psychic reading at Voice of the Angels.com.\r\n  \r\n",
            "length": "13772719",
            "sourceUrl": "https://www.blogtalkradio.com/empowerenlightenenvision/2013/09/25/has-your-relationship-made-you-disappear-sarah-and-sophia.mp3",
            "categories": [
                {
                    "_": "Relationships",
                    "$": {
                        "domain": "https://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "Why Isn't He Afraid of Losing Me? Sarah and Sophia",
            "datePublished": "Wed, 18 Sep 2013 23:00:00 GMT",
            "description": "Is your romantic partner pushing the envelope with their bad behavior? Do you wonder why he keeps crossing your boundaries? Why isn't he afraid of the consequences? Do you ask yourself (and others) “Why isn't he afraid of losing me?” There are two answers to this question: 1)Because you have removed all that fear OR 2)Because he really doesn't  care if he loses you! Which one is it? Tonight, you will find out!\r\n  During this show we will also be doing  , so now is your opportunity to get your questions answered by both of us, at the same time. If you have not been able to speak with us and need clarity on something, give us a call during the show!  Call in number: (714) 868-0775\r\n\r\n  Sponsored by Voice of the Angels.com. New clients click here for a free 3 minute psychic reading at Voice of the Angels.com.\r\n\r\n  \r\n",
            "length": "14342606",
            "sourceUrl": "https://www.blogtalkradio.com/empowerenlightenenvision/2013/09/18/why-isnt-he-afraid-of-losing-me-sarah-and-sophia.mp3",
            "categories": [
                {
                    "_": "Relationships",
                    "$": {
                        "domain": "https://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "Toxic Relationships: Empower Enlighten Envision Sarah&Sophia - Aug 07,2013",
            "datePublished": "Wed, 04 Sep 2013 23:00:00 GMT",
            "description": "Are you the victim of a toxic relationship? Have you lost the confident, self-assured woman you used to be? Can you barely recognize who you are anymore? Has your joy been replaced by fear, worry and insecurity? If you are in a relationship with a toxic man (or woman) you have probably lost complete control of your life. A toxic relationship is the most difficult of dysfunctional relationships. There is no way to win with a toxic man, no matter how hard you try or how much you love him. It is time to seriously consider a DETOX and get the toxicity out of your life, once and for all. Sponsored by Voice of the Angels.com. New clients click here for a free 3 minute psychic reading at Voice of the Angels.com.\r\n\r\n\r\n",
            "length": "14382730",
            "sourceUrl": "https://www.blogtalkradio.com/empowerenlightenenvision/2013/09/04/toxic-relationships-empower-enlighten-envision-sarahsophia--aug-072013.mp3",
            "categories": [
                {
                    "_": "Relationships",
                    "$": {
                        "domain": "https://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "Dead End Relationships: Empower Enlighten Envision your Life",
            "datePublished": "Wed, 28 Aug 2013 23:00:00 GMT",
            "description": "Just because you have a relationship doesnt mean it is going to get better, go anywhere, or amount to anything. Many people would rather be in dead end relationships than face loneliness, the fear of being single or the stigma of being alone. Sometimes though, when you are in a dead end relationship, you are more lonely than if you are free and single. Dead end relationships can be a very lonely place to be. How do you know if you are in a dead end relationship? What can you do if you are in a relationship headed nowhere? Sponsored by Voice of the Angels.com. New clients, click here for a free 3 minute psychic reading at Voice of the Angels.com.\r\n\r\n\r\n",
            "length": "14381267",
            "sourceUrl": "https://www.blogtalkradio.com/empowerenlightenenvision/2013/08/28/dead-end-relationships-empower-enlighten-envision-your-life--jun-262013.mp3",
            "categories": [
                {
                    "_": "Relationships",
                    "$": {
                        "domain": "https://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "Mr. Right vs. Mr. Wrong -Empower Enlighten Envision",
            "datePublished": "Wed, 21 Aug 2013 23:00:00 GMT",
            "description": " Many women search for Mr. Right, think they have finally found him, only to discover later on that he is Mr. Wrong. They may even try to turn this Mr. Wrong into Mr. Right, erroneously thinking that he will still fulfill their dreams and expectations in the relationship. We really are all smart enough to notice when a Mr. Wrong enters our lives and we should get away from him as fast as we can. But what do we do? Wait it out, hoping he will change into Mr. Right. This weeks show will focus on how to differentiate between Mr. Wrong and Mr. Right and what you can do about it.\r\n Sponsored by Voice of the Angels.com. New clients click here for a free 3 minute psychic reading at Voice of the Angels.com.\r\n",
            "length": "14402165",
            "sourceUrl": "https://www.blogtalkradio.com/empowerenlightenenvision/2013/08/21/you-cant-find-mr-right-if-youre-with-mr-wrong-sarahsophia.mp3",
            "categories": [
                {
                    "_": "Relationships",
                    "$": {
                        "domain": "https://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "Not All Relationships are Meant to Last - Replay!",
            "datePublished": "Wed, 14 Aug 2013 23:00:00 GMT",
            "description": " So many people enter into relationships wondering if this is the one that will last a lifetime. Of course, some relationships will last. Others will not have the staying power to go long term because some relationships are just not meant to last. Join Sarah and Sophia, on Empower Enlighten Envision, Weds at 7pm EST as they discuss the reasons why some relationships are intended to be short term. With the smooth delivery and upbeat style Sarah and Sophia are able to take some of the most difficult relationship scenarios and discuss them so you can understand them. T\r\n Sponsored by Voice of the Angels.com. New clients, click here for a free 3 minute psychic reading at Voice of the Angels.com.\r\n\r\n\r\n  \r\n",
            "length": "13799259",
            "sourceUrl": "https://www.blogtalkradio.com/empowerenlightenenvision/2013/08/14/not-all-relationships-are-meant-to-last--jun-122013.mp3",
            "categories": [
                {
                    "_": "Relationships",
                    "$": {
                        "domain": "https://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "Toxic Relationships: Empower Enlighten Envision Sarah&Sophia",
            "datePublished": "Wed, 07 Aug 2013 23:00:00 GMT",
            "description": "Are you the victim of a toxic relationship? Have you lost the confident, self-assured woman you used to be? Can you barely recognize who you are anymore? Has your joy been replaced by fear, worry and insecurity? If you are in a relationship with a toxic man (or woman) you have probably lost complete control of your life. A toxic relationship is the most difficult of dysfunctional relationships. There is no way to win with a toxic man, no matter how hard you try or how much you love him. It is time to seriously consider a DETOX and get the toxicity out of your life, once and for all.\r\nSponsored by Voice of the Angels.com. New clients click here for a free 3 minute psychic reading at Voice of the Angels.com.\r\n",
            "length": "14382730",
            "sourceUrl": "https://www.blogtalkradio.com/empowerenlightenenvision/2013/08/07/toxic-relationships-empower-enlighten-envision-sarahsophia.mp3",
            "categories": [
                {
                    "_": "Relationships",
                    "$": {
                        "domain": "https://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "50 Ways to LOSE Your Lover with Sarah and Sophia",
            "datePublished": "Wed, 31 Jul 2013 23:00:00 GMT",
            "description": "50 Ways to LOSE Your Lover.. Nope that is not a typo. People can become so focused on what they can do to keep their romantic partner around they unwittingly miss what they are doing to repel them. There are so many ways to turn a guy, or gal, off and make them head for the hills so fast they leave skid marks. Now is your opportunity to learn what they are, so you do not do them, and risk losing your lover…unless you want to, of course. Otherwise known as “The Silly Girls Way to Get Her Guy to Dump Her”.\r\n Sponsored by Voice of the Angels.com. New clients click here for a free 3 minute psychic reading at Voice of the Angels.com.\r\n",
            "length": "13729042",
            "sourceUrl": "https://www.blogtalkradio.com/empowerenlightenenvision/2013/07/31/50-ways-to-lose-your-lover-with-sarah-and-sophia.mp3",
            "categories": [
                {
                    "_": "Relationships",
                    "$": {
                        "domain": "https://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "Dysfunctional Relationships are NOT Fun! Sarah and Sophia",
            "datePublished": "Wed, 24 Jul 2013 23:00:00 GMT",
            "description": " Take a good look at the relationship you are in. Are you being treated unfairly, unkindly or unjustly? Do you fear the relationship is falling apart as the two of you drift further apart? Is there more drama in your relationship than there is on television? Do you find your self-esteem, self-respect and dignity, free-falling off a cliff? Are you frequently tolerating behavior and treatment you swore you never would? Lets face it.. does your relationship suck? Well then you are in a dysfunctional relationship and let’s be real here.. there is no FUN in dysfunctional relationships.\r\n During this show we will also be doing  FREE PSYCHIC READINGS, so now is your opportunity to get your questions answered by both of us, at the same time. \r\n Sponsored by Voice of the Angels.com. New clients click here for a free 3 minute psychic reading at Voice of the Angels.com.\r\n",
            "length": "14426616",
            "sourceUrl": "https://www.blogtalkradio.com/empowerenlightenenvision/2013/07/24/dysfunctional-relationships-are-not-fun-sarah-and-sophia.mp3",
            "categories": [
                {
                    "_": "Relationships",
                    "$": {
                        "domain": "https://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "Relationships: Do Actions Speak Louder than Words?",
            "datePublished": "Wed, 17 Jul 2013 23:00:00 GMT",
            "description": "Relationships can be confusing and it is often difficult to tell what the one your romantic partner thinks and feels concerning your relationship… especially if their words are saying one thing but their actions say another. Tonight we will give you your own personal decoder ring to help you figure out if actions speak louder than words or vice versa.\r\n During this show we will also be doing  FREE PSYCHIC MINI READINGS so now is your opportunity to have a quesitons answered by both of us, at the same time. Please limit to one question though as we try to reach as many people as possible.  CALL IN NUMBER 714-868-0775\r\n Sponsored by Voice of the Angels.com. New clients click here for a free 3 minute psychic reading at Voice of the Angels.com.\r\n",
            "length": "14446678",
            "sourceUrl": "https://www.blogtalkradio.com/empowerenlightenenvision/2013/07/17/do-actions-really-speak-louder-than-words-sarah-and-sophia.mp3",
            "categories": [
                {
                    "_": "Relationships",
                    "$": {
                        "domain": "https://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "Proper Manifesting: Empower Enlighten Envision Sarah~Sophia",
            "datePublished": "Wed, 10 Jul 2013 23:00:00 GMT",
            "description": "Are you ready to take action to create the job you desire? Do you want a relationship that is loving, supportive and giving? Are you living the life you want? Are you fulfilling your dreams? If you're just trudging through life, reacting to everything that comes your way, how about taking a more proactive approach?  Tonight we share insight & provide guidance on how to secure the job, relationship or life you have been yearning for. You can live the life you dreamed,  you just have to know how to co-create it with the Universe.Also call us now for FREE PSYCHIC READINGS!   714-868-0775\r\nSponsored by Voice of the Angels.Click here for free 3 min. psychic reading. .\r\n",
            "length": "14425571",
            "sourceUrl": "https://www.blogtalkradio.com/empowerenlightenenvision/2013/07/10/proper-manifesting-empower-enlighten-envision-sarahsophia.mp3",
            "categories": [
                {
                    "_": "Relationships",
                    "$": {
                        "domain": "https://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "Accountability, Responsibility and Free Will: Sarah & Sophia",
            "datePublished": "Wed, 03 Jul 2013 23:00:00 GMT",
            "description": "We have a duty to ourselves to be accountable and responsible for our lives. Rather than staying stuck as a victim, when we are accountable and responsible we take ownership of our careers, relationships, and ourselves. Although at times we may feel like pawns in the chess game of life, we all have Free Will to make changes at any time we feel victimized, unhappy or disempowered. Life really does not happen by chance, we must be willing to be accountable and responsible for our own fate.   We will be taking callers at 714-868-0775. If you are not able to listen live to our show and still would like an opportunity to have your questions answered, email us at sarahandsophia@hotmail.com\r\nSponsored by VoiceoftheAngels.com. New clients click here for a free 3 minute psychic reading at Voice of the Angels.com\r\n  \r\n",
            "length": "14057767",
            "sourceUrl": "https://www.blogtalkradio.com/empowerenlightenenvision/2013/07/03/accountability-responsibility-and-free-will-sarah-sophia.mp3",
            "categories": [
                {
                    "_": "Relationships",
                    "$": {
                        "domain": "https://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "Dead End Relationships: Empower Enlighten Envision your Life",
            "datePublished": "Wed, 26 Jun 2013 23:00:00 GMT",
            "description": "Just because you have a relationship doesn't mean it is going to get better, go anywhere, or amount to anything. Many people would rather be in dead end relationships than face loneliness, the fear of being single or the stigma of being alone. Sometimes though, when you are in a dead end relationship, you are more lonely than if you are free and single. Dead end relationships can be a very lonely place to be. How do you know if you are in a dead end relationship? What can you do if you are in a relationship headed nowhere?\r\n Sponsored by Voice of the Angels.com. New clients, click here for a free 3 minute psychic reading at Voice of the Angels.com.\r\n",
            "length": "14381267",
            "sourceUrl": "https://www.blogtalkradio.com/empowerenlightenenvision/2013/06/26/dead-end-relationships-empower-enlighten-envision-your-life.mp3",
            "categories": [
                {
                    "_": "Relationships",
                    "$": {
                        "domain": "https://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "Mercury Retro and Relationships: Empower Enlighten Envision",
            "datePublished": "Wed, 19 Jun 2013 23:00:00 GMT",
            "description": "Mercury Retrograde can wreak havoc on relationships. Its that time again.. YES...another Mercury Retrograde is well on its way and this Weds at 7pm EST Sarah Adelle and Sophia Elise are discussing how Mercury Retrogrades can affect your relationships and your lives. Do you know how to successfully navigate through a Mercury retrograde without things around you falling apart? How does it affect your relationships and what can be done to save them during a retrograde Mercury? ",
            "length": "14171243",
            "sourceUrl": "https://www.blogtalkradio.com/empowerenlightenenvision/2013/06/19/empower-enlighten-envision-your-life.mp3",
            "categories": [
                {
                    "_": "Relationships",
                    "$": {
                        "domain": "https://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "Not All Relationships are Meant to Last",
            "datePublished": "Wed, 12 Jun 2013 23:00:00 GMT",
            "description": " So many people enter into relationships wondering if this is the one that will last a lifetime. Of course, some relationships will last. Others will not have the staying power to go long term because some relationships are just not meant to last. Join Sarah and Sophia, on Empower Enlighten Envision, Weds at 7pm EST as they discuss the reasons why some relationships are intended to be short term. With the smooth delivery and upbeat style Sarah and Sophia are able to take some of the most difficult relationship scenarios and discuss them so you can understand them. They will be taking callers for free readings at the very end of the show! \r\n Sponsored by Voice of the Angels.com. New clients, click here for a free 3 minute psychic reading at Voice of the Angels.com.\r\n",
            "length": "13799259",
            "sourceUrl": "https://www.blogtalkradio.com/empowerenlightenenvision/2013/06/12/not-all-relationships-are-meant-to-last.mp3",
            "categories": [
                {
                    "_": "Relationships",
                    "$": {
                        "domain": "https://www.blogtalkradio.com/"
                    }
                }
            ]
        }
    ]
}