{
    "artwork": "http://is5.mzstatic.com/image/thumb/Music/v4/d7/1e/68/d71e68ec-935d-7aac-21f5-4f687140c4f9/source/100x100bb.jpg",
    "description": "Escape from Cubicle Nation Podcast provides advice, support and encouragement to help corporate prisoners break out and start their own business.",
    "feedURL": "http://feeds.feedburner.com/EscapeFromCubicleNationPodcast",
    "podcastURL": "http://www.escapefromcubiclenation.com",
    "publisher": "pcs@ganas.com (Pamela Slim)",
    "title": "Escape from Cubicle Nation Podcast",
    "episodes": [
        {
            "title": "Tips for easing the overwhelm of tax season",
            "datePublished": "Fri, 19 Feb 2016 20:24:52 +0000",
            "description": "<p>Every entrepreneur knows the hustle of getting tax information together to prepare for end of year tax returns.</p>\n<p>While in the middle of gathering documentation and receipts each year, you often mutter \"next year this will all be automated!\" Yet taking the time and figuring out the process to do so can seem overwhelming.</p>\n<p>In this 30 minute interview, Pamela Slim talks with Micky Deming from Kahuna Accounting about the ways that entrepreneurs can get over the hurdle of disorganized bookkeeping so that they can focus on growing their business. </p>\n<p><strong>We discuss:</strong><br /><br /></p>\n<p>-Why you don't need to wallow in shame or guilt if your bookkeeping is disorganized</p>\n<p>-The key things you need to prepare for a stress-free tax season</p>\n<p>-The power of cloud-based bookkeeping</p>\n<p>-What organized financials can help you do in growing your business</p>\n<p> </p>\n<p>To find out more about Micky and Kahuna Accounting, go here:<br /><a href=\"http://kahunaaccounting.com/community/\">http://kahunaaccounting.com/community/</a></p>",
            "length": "14451118",
            "sourceUrl": "https://traffic.libsyn.com/secure/escapefromcubiclenation/Micky_Deming_on_2016-02-05_at_12.06.mp3?dest-id=46993"
        },
        {
            "title": "Get Big Things Done with Erica Dhawan",
            "datePublished": "Wed, 25 Feb 2015 16:20:10 +0000",
            "description": "<p>I have long been a fan of Malcolm Gladwell's book Tipping Point, in particular, the \"Connectors, Mavens and Salesmen\" chapter where he talks about different personality types that impact social change.</p>\n<p>So imagine my delight when I met Erica Dhawan the author of <a href=\"http://www.amazon.com/gp/product/1137279788/ref=as_li_tl?ie=UTF8&camp=1789&creative=9325&creativeASIN=1137279788&linkCode=as2&tag=ganasconsulti-20&linkId=WI7OXDOVZ65TZQIK\">Get Big Things Done: The Power of Connectional Intelligence</a>, with co-author Saj-nicole A. Joni.</p>\n<p>They have spent years delving into research about what they term \"connectional intelligence\" -- arguably the most important skill currency of the 21st century.</p>\n<p>In this conversation, Erica and I discuss:</p>\n<ul>\n<li>3 types of connectors -- Thinkers, Enablers and Connection Executors</li>\n<li>How people are using connectional intelligence to solve complex problems and start movements</li>\n<li>How organizations can develop connectional intelligence</li>\n</ul>\n<p> Exerpts from our conversation:</p>\n<p>\"A lot has changed since Gladwell his book came out in 2006. When he framed that term (connector), he framed that there were three personality traits: Connector, Maven and Salesman that play a central role in the creation of social epidemics. From my research, to be successful, to get noticed, to start a movement, we ALL are entering the category of Connector. The question is not if we are connectors, but which type of connectors are we?\"</p>\n<p>You can connect with Erica Dhawan here: <a href=\"http://ericadhawan.com\">http://ericadhawan.com</a> or Twitter <a href=\"http://twitter.com/EDhawan\">@EDhawan</a></p>\n<p>Buy the book on Amazon: <a href=\"http://www.amazon.com/gp/product/1137279788/ref=as_li_tl?ie=UTF8&camp=1789&creative=9325&creativeASIN=1137279788&linkCode=as2&tag=ganasconsulti-20&linkId=WI7OXDOVZ65TZQIK\">Get Big Things Done</a></p>\n<p> </p>",
            "length": "11610585",
            "sourceUrl": "https://traffic.libsyn.com/secure/escapefromcubiclenation/Pam__Erica_-take_2.mp3?dest-id=46993"
        },
        {
            "title": "Playing Big with Tara Mohr",
            "datePublished": "Sat, 18 Oct 2014 00:11:33 +0000",
            "description": "<p><span style=\"font-size: 12pt;\">Whenever we set out to make things better in our lives -- improve our career, grow our business, get in shape, make a bigger impact in the world -- fear and doubt creep in.</span></p>\n<p><span style=\"font-size: 12pt;\">In her work coaching women and in her own personal life, Tara Mohr saw a pattern emerge, a problem she describes as women \"playing small.\" Women are sitting on their big ideas rather than sharing them, holding back their most provocative questions instead of asking them. They are having a collective hallucination that they aren't \"ready\" for that bigger role or next step. </span></p>\n<p><span style=\"font-size: 12pt;\">She made it the focus of her work to help women start playing bigger -- pursuing their dreams for their lives and careers, and sharing their voices more boldly.</span></p>\n<p><span style=\"font-size: medium;\">Join me and Tara in this conversation where we explore these themes, and discuss ways to help women (and men) overcome barriers to playing bigger in the world.</span></p>\n<p> </p>\n<p> </p>",
            "length": "16482325",
            "sourceUrl": "https://traffic.libsyn.com/secure/escapefromcubiclenation/Tara_Mohr_Playing_Big_clean.mp3?dest-id=46993"
        },
        {
            "title": "How to think like a marketer and sell like a superstar -- with John Jantsch",
            "datePublished": "Tue, 27 May 2014 22:52:23 +0000",
            "description": "<p>When I first started writing about small business marketing many years ago, one of the first people I heard about was John Jantsch of Duct Tape Marketing. John had a great reputation, a solid business and a well-respected and highly trafficked blog.</p>\n<p>I referred many clients to his first book, Duct Tape Marketing. Then to his second, The Referral Engine, and his third, The Commitment Engine.</p>\n<p>Through the years, we became good friends, and he has been a very trusted and valued mentor in my own business.</p>\n<p>I was thrilled that he wrote a new book, this time about selling, called Duct Tape Selling. I could not think of a more perfect person to talk about the new world of marketing and selling than John.</p>\n<p>In this 27 minute conversation, we talk about:<br /><br /></p>\n<ul>\n<li>The recent dramatic change in sales and marketing</li>\n<li>How to use well-tested inbound marketing techniques to drive and close sales</li>\n<li>The different skill set required for marketers to sell, and salespeople to market</li>\n</ul>\n<p>Check out John's new book, Duct Tape Selling here. It is a powerful resource for entrepreneurs, marketing and sales professionals: <a href=\"http://amzn.to/1ipwavs\">http://amzn.to/1ipwavs</a></p>",
            "length": "33222062",
            "sourceUrl": "https://traffic.libsyn.com/secure/escapefromcubiclenation/John_Jantsch_on_2014-03-25_at_13.37.mp3?dest-id=46993"
        },
        {
            "title": "Scaling Up Excellence",
            "datePublished": "Fri, 28 Feb 2014 23:58:27 +0000",
            "description": "<p>Many entrepreneurs dream of starting a business in their garage, scaling it, then selling it to Google for a billion dollars. </p>\n<p>Such things rarely happen.<br /><br />But scaling happens every day, in our career, our business or our workplace. We are constantly trying to improve ourselves, share our ideas, and put in systems and infrastructure that will grow our organizations without destroying that which made them great.</p>\n<p>Stanford professors Robert Sutton and Huggy Rao describe in their exceptionally well-researched and readable new book, <a href=\"http://www.amazon.com/Scaling-up-Excellence-Robert-Sutton-ebook/dp/B00EGMQIDG/ref=sr_1_1?ie=UTF8&qid=1393636441&sr=8-1&keywords=scaling+up+excellence\">Scaling Up Excellence: Getting to More Without Settling for Less</a> that knowing how to scale is a critical skill for the 21st century workplace.</p>\n<p>And they have 7 years worth of research, analysis and case studies, consolidated into this great book.</p>\n<p>In my lively conversation with Bob Sutton, we discuss:</p>\n<ul>\n<li>Scaling excellence in your own career</li>\n<li>Scaling up competence as startups get past bootstrapping</li>\n<li>Looking for hot causes and cool solutions</li>\n<li>Why big teams suck</li>\n<li>Scaling excellence in large companies: Why change should happen in pockets of excellence, not be spread like peanut butter across an organization<br /><br /></li>\n</ul>\n<p>Bob has been my \"adopted professor\" and High Council of Jedi Knight member for the last 8 years. I respect his work so much, and hope you enjoy the conversation as much as I did! <br /><br />Read more about the book and order it here: <a href=\"http://scalingupexcellence.com/\">http://scalingupexcellence</a><br />Give Bob a shout out on Twitter <a href=\"http://www.twitter.com/work_matters\">@work_matters</a></p>",
            "length": "6261052",
            "sourceUrl": "https://traffic.libsyn.com/secure/escapefromcubiclenation/BobSuttonScaleExcellence_1.mp3?dest-id=46993"
        },
        {
            "title": "Meaning at work, teens and the power of the underdog - Interview with author Josh Shipp",
            "datePublished": "Thu, 05 Dec 2013 19:15:24 +0000",
            "description": "<p>I have always been a huge fan of underdogs. <br /><br />Josh Shipp started his life without a safety net. Abandoned at birth by his mother, he spent most of his youth bouncing between foster homes, growing increasingly disillusioned and angry.</p>\n<p>He finally landed in a home with a family who gave him the kind of support and encouragment he needed.</p>\n<p>He then built an amazing speaking business, reaching more than 2 million teens with live presentations.</p>\n<p>He created a television show called <a href=\"http://halogentv.com/shows/jumpshipp/\">Jump Shipp</a> where he pairs a person with a big dream with a mentor and a challenge to make it happen.</p>\n<p>His latest book is called <a href=\"http://www.amazon.com/gp/product/0312646739/ref=as_li_qf_sp_asin_tl?ie=UTF8&camp=1789&creative=9325&creativeASIN=0312646739&linkCode=as2&tag=ganasconsulti-20%22%3EJump%20Ship:%20Ditch%20Your%20Dead-End%20Job%20and%20Turn%20Your%20Passion%20into%20a%20Profession\">Jump Ship: Ditch Your Dead-End Job and Turn Your Passion into a Profession</a>.</p>\n<p>In this episode, Josh and I discuss:</p>\n<ul>\n<li>His own journey, and how he turned a bleak childhood into a life of service and inspiration</li>\n<li>Strategies for finding more meaning in your life and business</li>\n<li>How to integrate all of your \"ingredients\" in your work - skills, strengths and scars</li>\n</ul>\n<p>I was so inspired to talk to this young man who has done more with his short life than most people twice his age.</p>\n<p></p>",
            "length": "16256440",
            "sourceUrl": "https://traffic.libsyn.com/secure/escapefromcubiclenation/Josh_Shipp.mp3?dest-id=46993"
        },
        {
            "title": "Must-Read Book of 2013: Adversaries into Allies by Bob Burg",
            "datePublished": "Thu, 07 Nov 2013 17:08:00 +0000",
            "description": "<p>When you think about it, navigating your life is a series of negotiations.</p>\n<p>In the course of a day, you may try to influence:</p>\n<ul>\n<li>Your new puppy to use the restroom outside</li>\n<li>Your customer to buy your product</li>\n<li>Your kid to brush his teeth</li>\n<li>Your neighbor to vote for your candidate</li>\n<li>Your boss to support your project</li>\n</ul>\n<p>How can you undertake these challenges with integrity, not force, and make all involved (especially the new puppy) feel like they got a win too?</p>\n<p>Bob Burg, the successful author of such classic books at The Go-Givers and Endless Referrals, tackles this challenge in his latest, and he argues most important book to date,  <a href=\"http://www.amazon.com/Adversaries-into-Allies-Manipulation-Coercion/dp/1591846366\">Adversaries into Allies: Win People Over Without Manipulation or Coercion</a>.</p>\n<p>In the book, Bob lays out a way to approach negotiations and differences in business, and life, in a way that is mutually supportive and respectful.</p>\n<p>In this conversation, Bob and I talk about how our national political discourse (and resulting actions) might look radically different if we took the time to focus on the motivation behind our beliefs, rather than name-calling.</p>\n<p>We also talk about how to set personal boundaries without being rude, and handle negotiations in a win-win manner.</p>\n<p>Bob says this is his most important book to date, and I agree. I hope that millions of people buy and read the book, resulting in a kinder, more effective and productive society.</p>",
            "length": "31312507",
            "sourceUrl": "https://traffic.libsyn.com/secure/escapefromcubiclenation/Bob_Burg_on_2013-10-30_at_10.04.mp3?dest-id=46993"
        },
        {
            "title": "Live your life so that you DIE EMPTY: Interview with Todd Henry",
            "datePublished": "Mon, 16 Sep 2013 00:22:00 +0000",
            "description": "<p>There are some people I meet who I instantly feel not just a connection with, but true kinship. Todd Henry is one of these people.</p>\n<p>I first met him when he interviewed me about my book <em>Escape from Cubicle Nation</em> on his wildly popular podcast, <em>Accidental Creative</em>. I was intrigued by his work with creatives, where he acts, in his words, as an \"arms dealer for the creative revolution.\" His ideas have inspired people from graphic artists to Hip Hop stars (LL Cool J is a fan).</p>\n<p>But I really got to know him when we were both writing our new books for the same publisher (Portfolio) with the same editor (Emily Angell). Our late-night email chats were both inspiring and extremely effective for working through creative blocks.</p>\n<p>After being close with Todd in the creative process, I was so excited to read his brand new book <strong>Die Empty</strong>. It got me tremendously fired up.</p>\n<p>In this interview, Todd gives extremely clear, passionate, concrete advice on not only how to get your creative work out into the world, but why it is your obligation to do so. I was shaking my fist in the air during the interview. I hope you enjoy the conversation as much as I did.</p>\n<p><strong>To get the new book:</strong></p>\n<div>Check out Todd and his brand new book <em><strong>Die Empty</strong></em> at <a href=\"http://dieempty.com/\">http://dieempty.com/</a></div>\n<div></div>\n<div>If you purchase the book  <strong><em>by September 25 (be sure to fill out the pre-order form on the site)</em></strong>, you get some wonderful pre-order gifts including:</div>\n<div>\n<div><b><br />Access to the Die Empty Book Club</b></div>\n<div>Here's how it works: You ask me questions via e-mail or voicemail, and I respond to them via a weekly 30-60 minute podcast available only to the first-readers. This podcast will be much longer than our typical podcasts, and will add extra perspective to Die Empty. It's going to be a lot of fun!</div>\n<div></div>\n<div></div>\n<div><b>The Official Die Empty Workbook</b></div>\n<div>A downloadable PDF workbook to help you think through and apply the principles in Die Empty to your own life and work. The workbook also contains exclusive extra content and external sources to help you dive deeper into each principle.</div>\n<div></div>\n<div></div>\n<div><b>Downloadable PIP Worksheet</b></div>\n<div>A PDF of our very popular Personal Idea Pad tool to help you generate brilliant ideas for your work.</div>\n<div></div>\n<div></div>\n<div><b>The 147 Episode Secret Accidental Creative Podcast Stash!</b></div>\n<div>It's a series of 147 podcasts we released only to our AC Engage community, but that were never publicly available. You will have immediate access to over 12 hours of exclusive coaching to help you be prolific, brilliant, and healthy.</div>\n</div>",
            "length": "16755901",
            "sourceUrl": "https://traffic.libsyn.com/secure/escapefromcubiclenation/Todd_Henry_Podcast.mp3?dest-id=46993"
        },
        {
            "title": "Promote Yourself: The New Rules for Career Success with Dan Schawbel",
            "datePublished": "Fri, 06 Sep 2013 00:14:35 +0000",
            "description": "<p>Many years ago, when I was in the early years of blogging at Escape from Cubicle Nation, I heard about a young man named <a href=\"http://danschawbel.com/promote-yourself/\">Dan Schawbel</a> who was writing like crazy about personal branding and millenials in the workplace. His name and face were everywhere, as he wrote for his own blog, as well as grew an impressive byline in places like Fortune, Time and Fast Company.</p>\n<p>Dan's first book, Me 2.0, became an international bestseller, and has been translated in 13 languages.</p>\n<p>And yet, surprisingly as we discuss in this podcast interview, he had to work really hard to find the right publisher for his brand new book, <a href=\"http://danschawbel.com/promote-yourself/\">Promote Yourself</a>.</p>\n<p>Listen in to our conversation, where we discuss:</p>\n<ul>\n<li>How the world of work has changed, and what you need to do to make sure you have sustained career and business success</li>\n<li>The necessary hustle required to make things happen in a crowded online world</li>\n<li>Expectations from millenials in the workplace, and how we can all learn to get along (Dan and I have healthy disagreement on a few items here, but that is what makes a good discussion, right?)</li>\n</ul>\n<p>Promote Yourself: The New Rules for Career Success is fresh off the press this week, and not surprisingly with Dan behind the launch, has generated lots of buzz in the business press.</p>\n<p>Pick up your copy here: <a href=\"http://www.amazon.com/Promote-Yourself-Rules-Career-Success/dp/1250044553\">http://www.amazon.com/Promote-Yourself-Rules-Career-Success/dp/1250044553</a></p>",
            "length": "34647825",
            "sourceUrl": "https://traffic.libsyn.com/secure/escapefromcubiclenation/Dan_Schawbel_on_2013-08-14_at_14.02.mp3?dest-id=46993"
        },
        {
            "title": "Turn your questions into instant answers: Interview with Dan Martell ",
            "datePublished": "Thu, 06 Jun 2013 17:18:00 +0000",
            "description": "<p>Imagine that you are driving down the road and you get a call from your office that a VC is interested in talking to you about investing in your business, but the only time they have to meet with you is tomorrow at noon. You have never put together a pitch before, and feel slightly panicked. But then you open an app, say \"How to make a VC pitch\" and immediately get 5 names of experienced VCs. You scan the list, see that one of them is Mark Cuban, and say \"call Mark\" and in 2 minutes you have him on the phone, coaching you through tomorrow's presentation (of course you scanned the list when you were pulled into a parking lot, because of course you would not text and drive). When you hang up, you would automatically be billed for 15 minutes of Mark Cuban's time.</p>\n<p>This scenario is not far from the reality at <a href=\"http://www.clarity.fm\">Clarity.fm</a>, Dan Martell's current company which connects entrepreneurs with questions with experts who have answers. He has the small goal of reaching one billion people with his platform in ten years (!).</p>\n<p>In this interview, we talk about:<br /><br /></p>\n<ul>\n<li>Dan's personal journey to entrepreneurial life, which included drug addiction and jail time</li>\n<li>How he took this tough experience and made it a driving force in his vision for positive change</li>\n<li>His early startup history, including early failures</li>\n<li>The business model and vision for Clarity.fm and how it may change the way we learn</li>\n<li>How Dan survived my \"I have never met a Canadian I didn't like\" challenge by the end of the interview (I like him a lot)</li>\n</ul>\n<p>Find Dan at <a href=\"http://www.danmartell.com/\">http://www.danmartell.com/</a> on Twitter <a href=\"http://www.twitter.com/danmartell\">@danmartell</a> and his company <a href=\"https://clarity.fm/home\">https://clarity.fm/home</a></p>",
            "length": "31873098",
            "sourceUrl": "https://traffic.libsyn.com/secure/escapefromcubiclenation/Dan_Martell_on_2013-06-04_at_10.04.mp3?dest-id=46993"
        },
        {
            "title": "Why Managing Sucks and How to Fix It - Interview with Jody Thompson",
            "datePublished": "Wed, 20 Feb 2013 16:53:19 +0000",
            "description": "<p>In 2010, Cali Ressler and Jody Thompson released their first book <em>Why Work Sucks and How to Fix It</em>, based on their experience leading a \"Results Only Work Environment\" (ROWE) while they were at Best Buy.</p>\n<p>In a results-only workplace, employees can do whatever they want whenever they want, as long as the work gets done. No more pointless meetings, racing to get in at 9:00, or begging for permission to watch your kid play soccer. You make the decisions about what you do and where you do it.</p>\n<p>It sounds great, doesn't it? But if you are a manager, how do you make sure that work is actually getting done?</p>\n<p>In their second book, <em>Why Managing Sucks and How to Fix it</em>, Cali and Jody tell many stories from companies who have instituted ROWE environments. They provide guidance to managers who are ready to embrace the workplace of the future.</p>\n<p>In this 30-minute interview, Pam and Jody discuss the book, and the revolutionary movement to give employees control of their lives back, while creating a productive and dynamic work culture.</p>",
            "length": "7296284",
            "sourceUrl": "https://traffic.libsyn.com/secure/escapefromcubiclenation/podcastJodyThompson.mp3?dest-id=46993"
        },
        {
            "title": "Scale your business by avoiding the entrepreneur's trap: Interview with Tina Forsyth",
            "datePublished": "Tue, 04 Dec 2012 16:46:00 +0000",
            "description": "<p>Starting a business can be a huge challenge, with a million things to learn, and the uncertainty of landing your first customers.</p>\n<p>Once you pass that gauntlet and develop a thriving business, another snag appears -- lack of focus, overwhelm and even burnout from trying to do everything yourself.</p>\n<p>In this interview, longtime business system expert Tina Forsyth explains what you need to put in place to ensure that you are able to scale and grow your business without losing your mind. We discuss:</p>\n<ul>\n<li>How to create your \"yes\" list</li>\n<li>The THRIVE hiring system, to ensure you get the right people in the right jobs</li>\n<li>Key systems every business needs in order to scale effectively</li>\n</ul>\n<p>Learn more in her new book, The Entrepreneur Trap: <a href=\"http://www.entrepreneurstrap.com/\">http://www.etbook.com</a></p>",
            "length": "6051106",
            "sourceUrl": "https://traffic.libsyn.com/secure/escapefromcubiclenation/TinaForsyth.mp3?dest-id=46993"
        },
        {
            "title": "Why we misjudge introverts and what we can do about it",
            "datePublished": "Wed, 27 Jun 2012 19:08:26 +0000",
            "description": "<p>Popular American business culture says that the more someone \"participates\" by talking aloud during a meeting or networking event, the more \"active,\" \"friendly\" and \"supportive\" they are.</p>\n<p>This (erroneous) definition ignores the fact that many quiet, introverted people are also \"active,\" \"friendly\" and \"supportive,\" just in a different way.</p>\n<p>In this interview with Barbara Saunders, a \"formerly shy introvert,\" we discuss:</p>\n<ol>\n<li>What is the correct definition of an introvert?</li>\n<li>What are common misconceptions people make about introverts and why?</li>\n<li>How can you tell if you or someone you love is an introvert?</li>\n<li>How can we design our training, meetings and events to be introvert-friendly, and maximize their contribution in a way that respects their style</li>\n</ol>\n<p>Find Barbara at http://www.barbararuthsaunders.com or on Twitter @bsaunders</p>\n<p>Some books we discussed on the call:</p>\n<p><strong>Gifts Differing</strong> by Isabel Briggs Meyers <a href=\"http://www.amazon.com/Gifts-Differing-Understanding-Personality-Type/dp/089106074X\">http://www.amazon.com/Gifts-Differing-Understanding-Personality-Type/dp/089106074X</a></p>\n<p><strong>Party of One: The Loners' Manifesto</strong> by Anneli Rufus <a href=\"http://www.amazon.com/Party-One-The-Loners-Manifesto/dp/1569245134\">http://www.amazon.com/Party-One-The-Loners-Manifesto/dp/1569245134</a></p>\n<p><strong>Quiet: The Power of Introverts in a World That Can't Stop Talking</strong> by Susan Cain <a href=\"http://www.amazon.com/Quiet-Power-Introverts-World-Talking/dp/0307352145\">http://www.amazon.com/Quiet-Power-Introverts-World-Talking/dp/0307352145</a></p>\n<p><strong>Susan Cain's TED Talk</strong>: <a href=\"http://www.youtube.com/watch?v=c0KYU2j0TM4\">http://www.youtube.com/watch?v=c0KYU2j0TM4</a></p>\n<p>http://www.amazon.com/Gifts-Differing-Understanding-Personality-Type/dp/089106074X</p>",
            "length": "18087101",
            "sourceUrl": "https://traffic.libsyn.com/secure/escapefromcubiclenation/BarbaraSaunders.mp3?dest-id=46993"
        },
        {
            "title": "A dirty little marketing secret no one is telling you",
            "datePublished": "Thu, 07 Jun 2012 20:28:49 +0000",
            "description": "<p>A lot of entrepreneurs get all twisted up about branding. Either they think it is some huge, expensive thing that is only for large companies, or they get obsessed with nailing a complete brand strategy before taking the first tiny step in building a business.</p>\n<p>Neither extreme is true.</p>\n<p>In this podcast conversation with brand expert Liz Dennery-Sanders, we discuss what branding is and isn't, what is critical to know about branding at any stage of business, and how you must pay attention to every part of how you do business if you want your marketing efforts to be effective.</p>\n<p>To illustrate what we talked about in the interview, Liz shares this post:</p>\n<h2>The dirty little marketing secret no one is telling you</h2>\n<p><em>By Liz Dennery Sanders</em></p>\n<p>Why is it that some entrepreneurs have clients lining up outside their door and a waiting list a mile long, while others are struggling to pay the rent?</p>\n<p>Why is it that most entrepreneurs are busy, busy, busy with their marketing tasks, but only a handful are truly effective?</p>\n<p><strong>There’s a dirty little secret in the marketing world that no one’s telling you.</strong></p>\n<p>Until now.</p>\n<p>Think about it. You’ve put up a website, jumped on every social media platform that’s come along, signed up for all the “important” conferences and even invested in a cool new logo and business cards.</p>\n<p>But your phone is gathering dust and other than a gazillion unwanted solicitations, your inbox has seen better days. You’ve been doing everything you think you’re “supposed” to be doing to market your business, but you’re still not attracting your ideal clients.</p>\n<p>Well, here’s the Truth with a capital T:</p>\n<p><strong>If you don’t have a strong brand, your marketing will never work.</strong></p>\n<p>In order for a marketing strategy to be successful, you’ve got to have a solid brand foundation.</p>\n<p>This means:</p>\n<ul>\n<li>You are clear about who you are, what you offer and why you do it</li>\n<li>You intimately understand your target market and position yourself as the solution to their problems</li>\n<li>You know your superpowers and you use them daily</li>\n<li>You communicate your value with ease</li>\n<li>You lead with your heart and your passion, which enables others to make an emotional connection with you</li>\n</ul>\n<p>In other words, we need to see and FEEL your awesome in order to connect with you in a meaningful way.</p>\n<p>Let me tell you about my client, Margaret.</p>\n<p>A self-proclaimed business coach, Margaret came to me because she was unclear as to why she wasn’t attracting clients, even though she was “doing everything right” from a marketing stand point.</p>\n<p>To her, doing everything right meant putting up a website, getting on every social media platform possible, attending networking events and conferences and working 60+ hours a week.</p>\n<p>Watching her made me dizzy.</p>\n<p>Margaret was making the mistake that so many women entrepreneurs are making today: she put the marketing cart before the brand horse.</p>\n<p>When we drilled down to WHY Margaret became a business coach in the first place, I found out that, because of her own experiences, she has very strong desire to help other women become successful, especially women over 40 who are either just starting a business or are completely reinventing themselves.</p>\n<p>Margaret struggled with a slew of nasty bosses in her 20’s and 30’s, went back to school to get her coaching certification in her early 40’s, and now at 46, has claimed her independence and wants to help others do the same.</p>\n<p>Bingo.</p>\n<p>When I shared with Margaret that this was one of the keys to becoming more successful – positioning herself to work with a specific group of people – she was initially fearful and concerned.</p>\n<p>“But I don’t want to exclude anyone from working with me,” she said, “I’m afraid I won’t have enough clients.”</p>\n<p>My response: “Well, how’s that working for you so far?”</p>\n<p>Margaret thought that by being available to anyone and everyone, she would certainly attract more clients. Instead, it was actually repelling them.</p>\n<p>A confused mind never buys. On the other hand, a crystal clear, passionate message, directed at the right people, makes an emotional connection that leads to a relationship. And a relationship is the first step toward building brand evangelists.</p>\n<p>When someone would ask Margaret what she did for a living, she used to say something like, “I’m a Business Coach,” or “I help entrepreneurs thrive in their business.” Her website and marketing materials had more of the same: Non-committal and often confusing content that was trying to be all things to all people. Not exactly a client magnet.</p>\n<p>Now Margaret’s response is something like this: I help women over 40 either start a business or completely reinvent themselves – sometime it’s both! As a Business Coach, Entrepreneurial Evangelist and someone who has gained my own independence from the corporate world, I will help you find the passion AND the profit in your business and help you grow.</p>\n<p>The next time you find yourself whiplashed by the latest and greatest bright, shiny marketing tools, <em>first</em> make sure you are clear about your brand and confident about the value you provide. This is a necessary step to make sure your marketing will be effective.</p>\n<p>---</p>\n<p><strong>Liz Dennery Sanders</strong> is a brand and creative strategist, personal development coach and the founder of SheBrand.com, a global online business dedicated to helping women entrepreneurs build their confidence, their brands and their bank accounts. Previously, Liz garnered millions of dollars in press value for brands such as <em>Escada, Hale Bob, Anastasia, Blue Cult</em> and <em>Elyse Walker</em>, and connected them directly with A-list celebrities such as <em>Angelina Jolie, Halle Berry, Sharon Stone</em>, <em>Kelly Rutherford, Gwyneth Paltrow, Jennifer Garner, Cindy Crawford</em> and <em>Marcia Cross</em>. A member of the <em>Vogue 100,</em> a hand-selected group of 100 influential decision makers and opinion leaders across the country, Liz is known for her distinctive taste in style, design and culture.</p>\n<p>Liz is offering a brand new class to help you unlock your brand superpowers. It starts <strong>Monday, June 18</strong> - Details here: <a href=\"http://theawesomebrand.com/\">http://theawesomebrand.com/</a></p>",
            "length": "4288938",
            "sourceUrl": "https://traffic.libsyn.com/secure/escapefromcubiclenation/Branding_Podcast_Liz_Dennery_Sanders.mp3?dest-id=46993"
        },
        {
            "title": "Grow your business through referrals: Expert interview with Bob Burg",
            "datePublished": "Mon, 21 May 2012 22:13:00 +0000",
            "description": "<p>This is the week of talent show finals: <em>Dancing With the Stars</em> contestants will be smiling and swirling on stage tonight, and <em>American Idol</em> contestants will sing their hearts out tomorrow for a chance at the grand prize.</p>\n<p>If there were a reality show for  <em>Nicest Person on the Internet</em>, Bob Burg would be in the finals, graciously Tweeting and writing  his way into the hearts of millions.</p>\n<p>Professional speaker and author of bestselling books <em>Referral Engine</em>, <em>The Go-Giver</em>, <em>Go-Givers Sell More</em> and his newest book, <em>It's Not About You</em>, Bob has built his career around teaching people that the very best way to be an effective and successful businessperson is to constantly and consistently focus on adding value to peoples' lives.</p>\n<p>To say his perspective is a breath of fresh air is an understatement!</p>\n<p>In this 50 minute interview, Bob and I discuss what are the underpinnings of a successful referral business, as well as specific strategies for attracting clients.</p>\n<p>You can find Bob and all his books at <a href=\"http://www.burg.com/\">http://www.burg.com/</a></p>",
            "length": "9932641",
            "sourceUrl": "https://traffic.libsyn.com/secure/escapefromcubiclenation/BobBurgEndlessReferrals.mp3?dest-id=46993"
        },
        {
            "title": "Small Town Rules for Business That Will Help All of Us",
            "datePublished": "Thu, 26 Apr 2012 17:32:07 +0000",
            "description": "<p>Becky McCray and Barry Moltz have just released their new book <a href=\"http://www.amazon.com/Small-Town-Rules-Businesses-Connected/dp/0789749203/ref=sr_1_1?ie=UTF8&qid=1335460709&sr=8-1\">Small Town Rules: How Big Brands and Small Businesses Can Prosper in a Connected Economy</a>. It is a fascinating resource with genuinely new insights for everyone in business.</p>\n<p>In my 20-minute interview with Becky McCray, we discuss:</p>\n<ul>\n<li>Common misconceptions people have about small, local businesses</li>\n<li>What large corporations can learn about branding from small business</li>\n<li>The formula for instant social media success :) (I am only sort of kidding - the way that Becky explained it made so much sense!)</li>\n</ul>\n<p>I am extremely passionate about this topic, and will engage more of my own local business community in the coming year to learn how to make my own business more effective and more enduring. When we connect all size businesses, we ALL win.</p>\n<p>You can find the book at all fine retailers, and at <a href=\"http://smalltownrules.com/\">http://www.smalltownrules.com</a></p>\n<p>Becky is <a href=\"https://twitter.com/#!/beckymccray\">@beckymccray</a> on Twitter and is at <a href=\"http://www.beckymccray.com/\">http://www.beckymccray.com</a></p>\n<p>Barry is <a href=\"https://twitter.com/#!/barrymoltz\">@barrymoltz</a> on Twitter and is at <a href=\"http://barrymoltz.com/\">http://barrymoltz.com</a></p>",
            "length": "5027501",
            "sourceUrl": "https://traffic.libsyn.com/secure/escapefromcubiclenation/smalltownrules.mp3?dest-id=46993"
        },
        {
            "title": "Taking People With You: Interview with Yum Brands CEO David Novak",
            "datePublished": "Thu, 09 Feb 2012 17:31:22 +0000",
            "description": "<p>In a departure from my normal entrepreneur interviews, in this podcast, I talk with Yum Brands CEO David Novak who talks about how to create a great culture for your startup. Although he is the head of a huge corporation, he talks about core building blocks that apply to any stage of business.</p>\n<p>His book <em><a href=\"http://www.amazon.com/Taking-People-You-Things-Happen/dp/1591844541/ref=sr_1_1?ie=UTF8&qid=1328808026&sr=8-1\">Taking People With You: The Only Way to Make Big Things Happen</a> </em> breaks down the critical things you need to keep in mind to build a great business culture with happy employees, customers and shareholders. In our interview we discuss:</p>\n<ul>\n<li>How to choose the right people to grow your business</li>\n<li>How to develop and communicate a healthy work environment</li>\n<li>How to maintain a strong culture as you grow your business</li>\n</ul>\n<p>In perhaps my favorite part of the interview, I asked David what he thinks about corporate employees (even in his own organization) who are doing a side hustle in addition to their day job. His answer may surprise you.</p>\n<p>All proceeds from David's book are going to the World Food Program to help in the fight against hunger.</p>\n<p></p>\n<p></p>",
            "length": "3871893",
            "sourceUrl": "https://traffic.libsyn.com/secure/escapefromcubiclenation/DavidNovak.mp3?dest-id=46993"
        },
        {
            "title": "Tracking your right life - Interview with Bestselling Author Martha Beck",
            "datePublished": "Mon, 06 Feb 2012 19:54:00 +0000",
            "description": "<p>Those of you who have been following my work for awhile know that I have been heavily influenced by my coach mentor Dr. Martha Beck. Her book Finding Your Own North Star changed the course of my life when I read it nearly a decade ago, and eventually led to my Escape from Cubicle Nation work.</p>\n<p>Martha is a Harvard-trained sociologist and bestselling author. She is Oprah's life coach in residence, and writes a monthly column for O Magazine.</p>\n<p>In this interview, I talk with Martha about her brand new book <a href=\"http://www.amazon.com/Finding-Your-Way-Wild-World/dp/1451624484\">Finding Your Way in a Wild New World</a>. Building on the research she started at Harvard many years ago, she explains how an encounter with an angry rhinoceros in Africa triggered an entirely new direction in her life, and led to this book. Rather than <em>thinking</em> your way to your right work, why not track your right life? We discuss:</p>\n<ul>\n<li>How to find a path in life that will make you happy</li>\n<li>Why the most \"fancy\" (wealthy, successful) people in the world are often unhappy</li>\n<li>What elders from around the world agree on about creating happiness and magic in your life</li>\n</ul>\n<p>Find Martha at <a href=\"http://www.marthabeck.com\">http://www.marthabeck.com</a></p>",
            "length": "5858139",
            "sourceUrl": "https://traffic.libsyn.com/secure/escapefromcubiclenation/MarthaBeckPodcast020312.mp3?dest-id=46993"
        },
        {
            "title": "Want a career in public speaking? Listen to this interview with Nick Morgan",
            "datePublished": "Fri, 26 Aug 2011 22:59:00 +0000",
            "description": "<p>Who has not fantasized about being a professional public speaker? Can you imagine how great it would be to fly to exotic locations and get paid large sums of money for a one-hour motivational talk?</p>\n<p>Before you quit your day job, Nick Morgan, Harvard-trained communication expert, founder of Public Words and author of <em>Trust Me</em> and <em>Give Your Speech Change the World</em> has some hard-won advice on both creating quality speeches and making it in the hyper-competitive world of professional speaking.</p>\n<p>In this conversation, we discuss:</p>\n<ul>\n<li>The two conversations you have to manage in every presentation</li>\n<li>The real source of natural and powerful body language (otherwise known as \"no, you don't have to flail your arms on cue.\")</li>\n<li>The inside scoop on what it takes to succeed as a public speaker. Easy money in exotic locations is unfortunately not part of the reality. :)</li>\n</ul>\n<p>Find Nick at <a href=\"http://www.publicwords.com\">http://www.publicwords.com</a> or <a href=\"http://www.twitter.com/DrNickMorgan\">http://www.twitter.com/DrNickMorgan</a></p>",
            "length": "35709097",
            "sourceUrl": "https://traffic.libsyn.com/secure/escapefromcubiclenation/NickMorganPresentations.mp3?dest-id=46993"
        },
        {
            "title": "Productive Tips for The Accidental Creative",
            "datePublished": "Fri, 08 Jul 2011 23:28:01 +0000",
            "description": "<p>I had the great pleasure of interviewing Todd Henry, author of the new book <a _mce_href=\"http://www.amazon.com/gp/product/1591844010?ie=UTF8&tag=ganasconsulti-20&linkCode=xm2&camp=1789&creativeASIN=1591844010\" href=\"http://www.amazon.com/gp/product/1591844010?ie=UTF8&tag=ganasconsulti-20&linkCode=xm2&camp=1789&creativeASIN=1591844010\"><em>The Accidental Creative: How to be Brilliant at a Moment's Notice. </em></a></p>\n<p>After years of putting together teams of highly creative people, Todd learned that there were some secrets and patterns that helped them be happy, healthy and productive. He formed a consultancy to help organizations be more effective and started <a _mce_href=\"http://www.accidentalcreative.com/podcasts\" href=\"http://www.accidentalcreative.com/podcasts\">The Accidental Creative Podcast</a> in 2006 which quickly shot to the top of the business category.</p>\n<p>He synthesizes lessons from this intensive work in his book which combines special insight into the creative mind, as well as specific tips for harnessing creative energy.</p>\n<p>As someone who creates for a living, knowing how to structure my life for maximum output and flow is a hugely attractive.</p>\n<p>You can find <em>The Accidental Creative: How to be Brilliant at a Moment's Notice</em> <a _mce_href=\"http://www.amazon.com/gp/product/1591844010?ie=UTF8&tag=ganasconsulti-20&linkCode=xm2&camp=1789&creativeASIN=1591844010\" href=\"http://www.amazon.com/gp/product/1591844010?ie=UTF8&tag=ganasconsulti-20&linkCode=xm2&camp=1789&creativeASIN=1591844010\">here</a>, and more about it <a _mce_href=\"http://www.accidentalcreative.com/book\" href=\"http://www.accidentalcreative.com/book\">here</a>. Connect with Todd on Twitter <a _mce_href=\"http://www.twitter.com/toddhenry\" href=\"http://www.twitter.com/toddhenry\">@toddhenry</a></p>\n<p>---</p>\n<p><em>Book links in this post are affiliate links. Thankfully, I don't live <a _mce_href=\"http://thenextweb.com/industry/2011/06/30/amazon-associates-program-terminated-in-california-immediately/\" href=\"http://thenextweb.com/industry/2011/06/30/amazon-associates-program-terminated-in-california-immediately/\">in California</a> anymore. :)</em></p>",
            "length": "40511791",
            "sourceUrl": "https://traffic.libsyn.com/secure/escapefromcubiclenation/Todd_Henry_on_2011-07-01_at_10.38.mp3?dest-id=46993"
        },
        {
            "title": "Anything You Want - Interview with CD Baby Founder Derek Sivers",
            "datePublished": "Wed, 29 Jun 2011 20:37:36 +0000",
            "description": "<p>Before I interviewed CD Baby founder Derek Sivers, I asked my Twitter followers \"What questions do you have for <a href=\"http://www.twitter.com/sivers\">@sivers</a>?\"</p>\n<p>Someone asked \"How extensive was his business plan?\"</p>\n<p>When I asked him that question, he started laughing, because the founding of what would become a multi-million dollar powerhouse in the world of music distribution involved no planning at all.</p>\n<p>In fact, as a professional musician Derek only started the company so he could sell his own CDs.</p>\n<p>The lessons he learned from \"anti-planning\" and growing a business that eventually sold for $22 million dollars are summed up in a wonderful new book from The Domino Project called <em>Anything You Want.</em></p>\n<p>I loved Derek's fierce focus on freedom and happiness, two values that resonate with deeply my own business journey.</p>\n<p>Enjoy our 30-minute conversation, and pick up Derek's brand new book <em>Anything You Want</em> (which comes with 200 of his favorite songs) on Amazon <a href=\"http://www.amazon.com/gp/product/1936719118?ie=UTF8&tag=ganasconsulti-20&linkCode=xm2&camp=1789&creativeASIN=1936719118\">here</a>. (my affiliate link)</p>\n<p>Find out more about Derek at <a href=\"http://sivers.org/\">http://sivers.org</a></p>",
            "length": "35127956",
            "sourceUrl": "https://traffic.libsyn.com/secure/escapefromcubiclenation/Derek_Sivers_on_2011-06-27_at_16.06.mp3?dest-id=46993"
        },
        {
            "title": "In search of business model excellence: Interview with Alexander Osterwalder",
            "datePublished": "Tue, 17 May 2011 18:59:00 +0000",
            "description": "<p>Two years ago, when I was on my book tour, I had the great fortune of speaking at a management conference in Estonia. There were a number of other speakers there from Europe, including <a href=\"http://lundxy.com/\">Morten Lund</a> and <a href=\"http://alexosterwalder.com/\">Alexander Osterwalder</a>.</p>\n<p>Alex's presentation was about business models, and I was immediately drawn in by the clear and simple way he explained them. He was a fantastic speaker, and I was very intrigued by his book, <a href=\"http://amzn.to/mHnqNG\">Business Model Generation</a>.</p>\n<p>We rode together in the car from the conference site back to Tallinn, and he told me the story of how he had created this book with the help of over 450 co-authors including business model designers, academics and enthusiastic students of business. They chose to self-publish, and took the risk of creating a very visually rich design, not the norm for most business books.</p>\n<p>Fast forward to 2011, and I was sitting at a table in the blogger's lounge at <a href=\"http://www.sxsw.com\">South by Southwest</a>, preparing for a panel about blogs to books. One of the people on my panel was from Wiley, and he talked about a great success they had recently with a book that had originally been self-published. \"It has sold over 100,000 copies already,\" he said. \"It is called <em>Business Model Generation</em>.\"  I just about fell off my chair when I heard that, since I never would have imagined the world would be so small. I was thrilled for Alex's success.</p>\n<p>I recently spoke with Alex while he was at the Miami airport, fresh from a 3-day consulting gig in Medellin, Colombia. He is very busy working with companies to implement the ideas in the book, as well as spearhead a larger mission to demystify business model planning, and make it accessible to the masse so we can create true innovation.</p>\n<p>One of these ways is a very cool<a href=\"http://www.businessmodelgeneration.com/\"> iPad app</a> which lets you quickly sketch out and prototype different business models, just as if you were writing on the back of a napkin. I think it will be the hit of every entrepreneur conference!</p>\n<p>I hope you enjoy our conversation, and begin some serious experimentation with business models.</p>\n<p>Find Alex on Twitter <a href=\"http://www.twitter.com/business_design\">@Business_Design</a> .</p>\n<p></p>\n<p>To</p>",
            "length": "39605879",
            "sourceUrl": "https://traffic.libsyn.com/secure/escapefromcubiclenation/Alexander_Osterwalder_on_2011-05-06_at_11.18_002.mp3?dest-id=46993"
        },
        {
            "title": "Is your company built to sell?",
            "datePublished": "Wed, 27 Apr 2011 05:30:00 +0000",
            "description": "<p>I have been in business for myself for sixteen years.</p>\n<p>I can't count the number of fun projects, amazing clients and life-changing opportunities this path has provided for me.</p>\n<p>But it wasn't until yesterday, when I was reading John Warrillow's <em>Built to Sell</em>, that I got the profound feeling that I was a total beginner in the world of preparing businesses for sale. I had never really asked myself the question \"Do I want to stay in this business for the long term, or sell it and move on to something totally different?\"</p>\n<p>If I were to try to sell it today, I learned from the book, there would not be much tangible value in my business. It is much too dependent on me personally. </p>\n<p>John Warrillow has started and sold four companies, and now lives a semi-retired life in France with his wife and kids, writing books, drinking wine and writing columns for Inc. Magazine. Yes, it is fair if you are all jealous of him. But he really knows what he is talking about when it comes to preparing businesses to sell.</p>\n<p>If you are hot to buy the book, John has a special promotion until April 30 -- buy one copy, send in the receipt and you will get $65 worth of goodies, including a one year subscription to Inc. Magazine, a BuyBizSell valuation report (where you can get a clear picture of the market value of your own business), as well as access to a 2-hour group conference call with John. He wil also donate $25 to Kiva.org in your name. He is really a fantastic resource - I encourage you to jump before the end of the week! See promotion details <a href=\"http://www.builttosell.com/gift.html\">here</a>.</p>\n<p>Buy Built to Sell at any fine retailer, including <a href=\"http://www.amazon.com/gp/product/1591843979?ie=UTF8&tag=ganasconsulti-20&linkCode=xm2&camp=1789&creativeASIN=1591843979\">Amazon</a> (my affiliate link).</p>\n<p>Enjoy the conversation!</p>\n<p></p>\n<p></p>\n<p>IIf</p>",
            "length": "35498374",
            "sourceUrl": "https://traffic.libsyn.com/secure/escapefromcubiclenation/John_Warrillow_on_2011-04-26_at_09.08.mp3?dest-id=46993"
        },
        {
            "title": "How to push past creative blocks so you can Do the Work - Interview with Steven Pressfield",
            "datePublished": "Wed, 20 Apr 2011 00:13:00 +0000",
            "description": "<p>Few people know the subtle horrors of creative blocks like professional writers. Steven Pressfield is a master at naming, and slaying, the beast called Resistance. The author of many bestselling novels like <em>The Legend of Bagger Vance</em> and <em>Gates of Fire </em>as well as the masterpiece <em>The War of Art</em>, Steven's new book <em>Do the Work </em>breaks down in detail how to get past creative blocks and get great work done.</p>\n<p>Enjoy our 30 minute interview! I was totally inspired after the conversation, and got tons of work done.</p>\n<p>Find Do the Work exclusively on Amazon <a href=\"http://www.amazon.com/Do-the-Work-ebook/dp/B004PGO25O/ref=sr_1_1?ie=UTF8&qid=1303144681&sr=8-1\">here</a>. It is a great book, which should be kept right on top of your desk for quick reference.</p>",
            "length": "29992251",
            "sourceUrl": "https://traffic.libsyn.com/secure/escapefromcubiclenation/stevenpressfield.mp3?dest-id=46993"
        },
        {
            "title": "The Art of Enchantment - Interview with Guy Kawasaki",
            "datePublished": "Tue, 08 Mar 2011 17:34:43 +0000",
            "description": "<p>Those of you who have read my blog for a long time or have heard me  speak know that I often reference a key moment in Escape from Cubicle  Nation's history, when one incoming link from venture capitalist and  blogger Guy Kawasaki turned my tiny audience into a massive wave of new  subscribers.</p>\n<p>It certainly was a moment of enchantment for me, as I watched the power of connecting with a ripe market of my ideal clients.</p>\n<p>Today, Guy's brand new book, <em>Enchantment</em>, hits the stores.</p>\n<p>It is based on his decades-long experience as a venture capitalist,  and deep understanding of business evangelism and customer  relationships.</p>\n<p>A couple of weeks ago, I talked with Guy about the key concepts and  stories in the book. In this 30-minute interview, we talk about both the  light and dark side of enchantment. When someone is skilled in the art  of customer seduction, you can fall prey to unscrupulous tactics. We  also talked about how being enchanting does not mean that everyone will  like you. To the contrary, when you take a strong stand on doing  something a particular way, you will polarize your market.</p>\n<p>Great conversation aside, the most enchanting part of the interview for  me was hearing Guy describe the scene in front of him as he was trying  to talk with me. Two of his kids decided to come in his office and bring  the dog. Having experienced the same scene numerous times myself, his  humor and ease with parenting made me appreciate him as a father.</p>\n<p>I really, really enjoyed the book, and think you will too. Although you  can glean the highlights from the infographic below, it is worth reading  in depth. Whether you sell shoes or high-end software services,  learning how to create deep, real connections with your market is the  skill that will set you apart in the  21st century.</p>\n<p>Buy the book <a href=\"http://www.amazon.com/Enchantment-Changing-Hearts-Minds-Actions/dp/1591843790/ref=sr_1_1?ie=UTF8&qid=1299605397&sr=8-1\">here</a>.</p>\n<p> </p>",
            "length": "7244197",
            "sourceUrl": "https://traffic.libsyn.com/secure/escapefromcubiclenation/guykawasakienchantment.mp3?dest-id=46993"
        },
        {
            "title": "Did you ever just want to walk away?",
            "datePublished": "Tue, 22 Feb 2011 17:53:00 +0000",
            "description": "<p>\"Didn't you ever want to get up from your desk one day and just walk  away, not to go get a latte, but I mean walk away and not come back?\"</p>\n<p>So asks Margaret Roach in her powerful book trailer, and powerful new book, <a href=\"http://www.amazon.com/Shall-Have-Some-Peace-There/dp/0446556092/ref=sr_1_1?ie=UTF8&qid=1298396585&sr=8-1\"><em>And I Shall Have Some Peace There: Trading the Fast Lane for My Own Dirt Road</em></a>.</p>\n<p>Margaret left her mega-powerful job as editorial director of Martha Stewart Living Omnimedia, and had been a <em>New York Times</em> editor.</p>\n<p>She set out on a long journey to get to know herself -- in her farmhouse in rural New York.</p>\n<p>Her book trailer tells the story better than I ever could with words. (YouTube link <a href=\"http://www.youtube.com/watch?v=X4ngtPOz9DY&feature=player_profilepage\">here</a>)  \n<object style=\"height: 390px; width: 640px;\" classid=\"clsid:d27cdb6e-ae6d-11cf-96b8-444553540000\" width=\"100\" height=\"100\" codebase=\"http://download.macromedia.com/pub/shockwave/cabs/flash/swflash.cab#version=6,0,40,0\">\n<param name=\"allowFullScreen\" value=\"true\" />\n<param name=\"allowScriptAccess\" value=\"always\" />\n<param name=\"src\" value=\"http://www.youtube.com/v/X4ngtPOz9DY?version=3\" />\n<param name=\"allowfullscreen\" value=\"true\" /><embed style=\"height: 390px; width: 640px;\" type=\"application/x-shockwave-flash\" width=\"100\" height=\"100\" src=\"http://www.youtube.com/v/X4ngtPOz9DY?version=3\" allowscriptaccess=\"always\" allowfullscreen=\"true\"></embed>\n</object>\n</p>\n<p>Margaret's purpose in writing the book was to tell her own story, but to also encourage others to stop and make time for things they love.</p>\n<p>\"Just remember, we are finite creatures,\" she says.</p>\n<p>If you never make time for things you love, time may run out. </p>\n<p>Her book is out this week, and is a delightful read.  Buy it <a href=\"http://www.amazon.com/gp/product/0446556092?ie=UTF8&tag=awatoga-20&linkCode=as2&camp=1789&creative=9325&creativeASIN=0446556092\">here</a></p>\n<p>.</p>",
            "length": "9003700",
            "sourceUrl": "https://traffic.libsyn.com/secure/escapefromcubiclenation/margaretroach.mp3?dest-id=46993"
        },
        {
            "title": "From lawyer to baker: Lessons on passion, listening and cake with Warren Brown",
            "datePublished": "Wed, 02 Feb 2011 17:58:00 +0000",
            "description": "<p>If you had been a fellow passenger on the Green Line train in Washington DC, looking at handsome young lawyer Warren Brown staring out the window, you may have thought he was composing his next great novel, or thinking about scaling Mt. Everest. Instead, he was formulating a new recipe for chocolate cake:<br /><br />\"Dry chocolate cake is a no-no not to be tolerated. So I  thought of coming at it from a unconventional angle. I decided to not  use butter and boiled water in the batter, but use cream instead to  deliver hydration and fat to the cake simultaneously. I scribbled the  hypothesis on a notepad, raced off the train, mixed and panned the  batter within twenty minutes, and use the same recipe to this day. It’s  the New German Chocolate cake, where cream and cocoa combine to make a  dense chocolaty cake that is paired with a coconut & vanilla infused  buttercream.\"</p>\n<p>Warren's cake dreams turned into a baking \"side hustle,\" which occupied all of his precious time outside of his busy law career. He slowly built his baking business to the point where he was able to quit his day job and open a bakery, <a href=\"http://www.cakelove.com\">Cake Love</a>, in Washington D.C. Fast forward nine years and Cake Love has seven locations, and Warren has written two books, <a href=\"http://www.abramsbooks.com/Books/CakeLove-9781584796626.html\">Cake Love: How to bake cakes from scratch</a>, and <a href=\"http://www.abramsbooks.com/Books/United_Cakes_of_America-9781584798392.html\">United Cakes of America</a>, with a third in the works.</p>\n<p>Listen in on our 40-minute podcast where Warren discusses the hard work required to turn a passion into a business, and a start-up into a solid brand, and why entrepreneurs have to be a bit crazy if they want to succeed.</p>\n<p>You can see more of Warren in action in the short ad that my friend Erik Proulx (of <a href=\"http://buyaframe.lemonadedetroit.com/\">Lemonade</a> fame) recently did for Dell Computer: (YouTube link here: <a href=\"http://www.youtube.com/watch?v=LPN2br5YY4g\">http://www.youtube.com/watch?v=LPN2br5YY4g</a>)</p>\n<p> </p>\n<p><iframe src=\"http://www.youtube.com/embed/LPN2br5YY4g\" width=\"640\" height=\"390\"></iframe></p>",
            "length": "9014358",
            "sourceUrl": "https://traffic.libsyn.com/secure/escapefromcubiclenation/cakelove.mp3?dest-id=46993"
        },
        {
            "title": "Behind the scenes with a successful app developer: Patrick Thompson",
            "datePublished": "Wed, 26 Jan 2011 16:53:22 +0000",
            "description": "<p>I had the good fortune to meet Patrick Thompson at my Portland Escape from Cubicle Nation workshop in 2009. At the time, he had left his corporate job as a software development manager and was working on a speed-reading app called <a href=\"http://www.quickreader.net/\">QuickReader</a>.</p>\n<p>Patrick said that at 46 years old, he realized that it was the right time to try and see if he could replace his corporate income with his own business developing mobile device applications.</p>\n<p>Fast forward 18 months and he has leveraged the code from the original application to create a string of new products, including <a href=\"http://www.megareader.net/\">MegaReader</a>, which has had lots of press coverage, and great sales.</p>\n<p>In this interview, Patrick talks about how he built his software app business from idea to fully thriving endeavor.</p>\n<p>Find Patrick on Twitter <a href=\"http://www.twitter.com/pthompson\">@pthompson</a>.</p>",
            "length": "6128350",
            "sourceUrl": "https://traffic.libsyn.com/secure/escapefromcubiclenation/patrickthompson.mp3?dest-id=46993"
        },
        {
            "title": "Do you make these data security mistakes?",
            "datePublished": "Tue, 28 Dec 2010 00:42:31 +0000",
            "description": "<p><a href=\"http://www.escapefromcubiclenation.com/http://www.escapefromcubiclenation.com/wp-content/uploads//2010/12/2010-10-25_15.39.02.png\"><img class=\"alignnone size-full wp-image-3726\" title=\"2010-10-25_15.39.02\" src=\"http://www.escapefromcubiclenation.com/http://www.escapefromcubiclenation.com/wp-content/uploads//2010/12/2010-10-25_15.39.02.png\" alt=\"\" width=\"373\" height=\"244\" /></a> <em></em></p>\n<p><em>Note the rather uncharacteristic post title from my recent blog hack.  The humor of the particular spam title and my post image was not lost on me.</em><strong><em> </em></strong> Call me the poster child for the need for a structured, secure data security plan:</p>\n<ul>\n<li><strong>In 2008, the <a href=\"http://www.escapefromcubiclenation.com/2008/04/23/the-biggest-loser-pams-community-service-announcement/\">hard drive on my brand new iMac failed</a></strong> four months after purchase and I almost lost all my data (I was in the middle of working on my book).</li>\n<li><strong>Earlier this year, my web host had a series of technical glitches </strong>and I lost all my sites for almost a week. It wasn't until it happened that I realized the backup widgets I thought were installed were not. Only by the grace of a dedicated team (<a href=\"http://www.twitter.com/naominiles\">@naominiles</a> , <a href=\"http://www.twitter.com/matthewrayscott\">@matthewrayscott</a> <a href=\"http://www.twitter.com/va4hire\">@va4hire</a> <a href=\"http://www.twitter.com/pmurrah\">@pmurrah</a> and Scott Rivers) did I get all the data back (it takes a village to restore your online business).</li>\n<li><strong>In November, my web host was hit by a hacker</strong>, and my blog was infiltrated by viagra spam. The quick acting of <a href=\"http://www.twitter.com/timgrahl\">@timgrahl</a> and <a href=\"http://www.twitter.com/williejackson\">@williejackson</a> scrubbed my site of unscrupulous code, but not before suffering embarrassment.</li>\n</ul>\n<p>These experiences have made me an advocate for \"scaring straight\" new entrepreneurs about the need for data security protection.</p>\n<p><a href=\"http://www.escapefromcubiclenation.com/http://www.escapefromcubiclenation.com/wp-content/uploads//2010/12/williewide1.jpg\"><img class=\"alignnone size-medium wp-image-3740\" title=\"williewide\" src=\"http://www.escapefromcubiclenation.com/http://www.escapefromcubiclenation.com/wp-content/uploads//2010/12/williewide1-300x225.jpg\" alt=\"\" width=\"300\" height=\"225\" /></a> <em></em></p>\n<p><em>Willie Jackson, Photo by <a href=\"http://robertbromfield.com/\">Robert Bromfield</a></em></p>\n<p>I had the good fortune to interview freelance technology consultant <a href=\"http://williejackson.com\">Willie Jackson</a> on this topic today, and invite you to listen to our 25-minute podcast about data security.  Willie is a former technology consultant for Accenture, and one of the six \"accomplices\" recently chosen by Seth Godin to work on <a href=\"http://sethgodin.typepad.com/seths_blog/2010/12/the-domino-project.html\">The Domino Project</a>. Willie was also featured in my <a href=\"http://www.escapefromcubiclenation.com/2010/09/23/the-side-hustle-and-flow-interview-series-willie-jackson/\">side hustle and flow series</a> earlier this year.  <strong>Common data security mistakes discussed in the podcast:</strong></p>\n<ol>\n<li>Not having a backup service for your website/blog</li>\n<li>Thinking that FTP backup of Wordpress saves all your content (hint: it does not)</li>\n<li>Creating weak passwords</li>\n<li>Securing only your business data and forgetting priceless personal data like family photos</li>\n<li>Shopping for web hosts purely on price, not thinking about security and support</li>\n</ol>\n<p><strong>Services discusses on the podcast:</strong> <a href=\"http://wordpress.org/extend/plugins/wp-dbmanager/\"></a></p>\n<p><a href=\"http://wordpress.org/extend/plugins/wp-dbmanager/\">WP-db Manager</a></p>\n<p><a href=\"http://wordpress.org/extend/plugins/wp-db-backup/\">WP-db Backup</a></p>\n<p><a href=\"http://www.webdesigncompany.net/automatic-wordpress-backup/\">Automatic Wordpress Backup</a> <a href=\"http://free.avg.com/us-en/homepage\"></a></p>\n<p><a href=\"http://free.avg.com/us-en/homepage\">AVG Free</a> (for Windows)  <a href=\"http://www.backupify.com/\"></a></p>\n<p><a href=\"http://www.backupify.com/\">Backupify</a> <a href=\"http://vaultpress.com/\">Vault Press</a> (extra special support, but requires \"golden ticket\" invitation. I am pretty sure the service is run by Willie Wonka)  <strong></strong></p>\n<p><strong>Web Host</strong> <a href=\"http://page.ly/\">Page.ly</a></p>\n<p>If you are too overwhelmed to get backups set up yourself, holler at Willie:  <a href=\"http://www.williejackson.com\"></a></p>\n<p><a href=\"http://www.williejackson.com\">@williejackson</a> willie (at) williejackson (dot) com  <strong></strong></p>\n<p><strong>May your backups be secure and all your data bright and clean in 2011!</strong></p>",
            "length": "6135560",
            "sourceUrl": "https://traffic.libsyn.com/secure/escapefromcubiclenation/databackup.mp3?dest-id=46993"
        },
        {
            "title": "Never Get a Real Job: Interview with Scott Gerber",
            "datePublished": "Wed, 08 Dec 2010 18:28:20 +0000",
            "description": "<p><a href=\"http://www.twitter.com/askgerber\">Scott Gerber</a>, twenty-six year old columnist for <em>Entrepreneur</em> and author of the new book <a href=\"http://www.amazon.com/Never-Get-Real-Job-Business/dp/0470643862/ref=sr_1_1?ie=UTF8&qid=1291831930&sr=8-1\"><em>Never Get a Real Job: How to dump your boss, build a business and not go broke</em></a>, does not mince his words.</p>\n<p>He believes that many of the entrepreneur evangelists out there are selling snake oil when they encourage people to \"do what you love and let the business model follow.\"</p>\n<p>In our 30-minute conversation, we talk (and sometimes agree to disagree) about what every young person needs to be considering in the new world of work.</p>\n<p>Scott is passionate for no-frills, practical nuts-and-bolts businesses which help young entrepreneurs develop the skills, experience and finances to take charge of their career. He does not think that corporate life is a viable alternative for many of our 20-somethings fresh out of college with bulging student loan debt and a poor chance of landing a job that will utilize their true talents.</p>\n<p>I really enjoy his enthusiasm and conviction, and support his premise that Generation Y will be the driver of the entrepreneurial economy.</p>\n<p>I will arm wrestle him about the importance of passion, but that is what makes for a healthy web of opinions. :)</p>\n<p>I have always been an advocate of having young mentors, and Scott is too. He formed the <em>Young Mentor Council</em>, comprised of 80 successful, and young, entrepreneurs. They share advice through a large number of media channels including Entrepreneur.com and the Wall Street Journal.  Find out about the council at Scott's website <a href=\"http://www.nevergetarealjob.com/council/\">here</a>.</p>\n<p>We need to have more straight talk about the reality of today's world of work, and I am very glad Scott is leading the charge for amplifying the voice of the next generation.</p>\n<p>Bring it on!</p>\n<p> </p>",
            "length": "7486822",
            "sourceUrl": "https://traffic.libsyn.com/secure/escapefromcubiclenation/scottgerber.mp3?dest-id=46993"
        },
        {
            "title": "Black Faces in White Places: Interview with author, entrepreneur and Apprentice winner Randal Pinkett",
            "datePublished": "Tue, 16 Nov 2010 18:52:00 +0000",
            "description": "<p> </p>\n<p>In his newest book <a href=\"http://www.amazon.com/Black-Faces-White-Places-Game-Changing/dp/0814416802\">Black Faces in White Places: 10 Game-Changing Strategies to Achieve Success and Find Greatness</a>, (co-authored with long-time business partner Jeffrey Robinson) author <a href=\"http://www.randalpinkett.com\">Randal Pinkett</a> discusses some unique challenges and opportunities facing African-American professionals who operate in environments where they are clearly the minority.</p>\n<p>Randal was the winner of Season 4 of <em>The Apprentice</em>, and faced what he called a classic \"black faces in white places\" moment when he was the first winner of color, and the only one (before or since) asked to share his title with the runner up, an Anglo woman who had fared much worse in all of the competitions.</p>\n<p>In this interview, Randal talks about that moment, and what prepared him to confidently look Mr. Trump in the eye and refuse to give up a place he had rightfully earned.  The book lays out a strong, positive, practical path to success and satisfaction for African Americans. It is also applicable to anyone who has felt like an outsider in a dominant culture.</p>\n<p>Randal has used his own sense of identity, purpose and passion to obtain five degrees, start five successful businesses, write three books and mentor countless youth and young adults.</p>\n<p>Find out more about Randal, Jeffrey and the people interviewed in the book at <a href=\"http://redefinethegame.com/\">www.redefinethegame.com</a></p>\n<p>I hope you enjoy the 30 minute conversation as much as I did!</p>",
            "length": "34984356",
            "sourceUrl": "https://traffic.libsyn.com/secure/escapefromcubiclenation/Randal.mp3?dest-id=46993"
        },
        {
            "title": "How to start a business without destroying your relationship",
            "datePublished": "Fri, 12 Feb 2010 22:19:00 +0000",
            "description": "<p>One of the unspoken stressors for new entrepreneurs is convincing a partner or spouse that starting a business is a smart idea.</p>\n<p>The rigors of start-up life require a whole new set of communication skills to ensure that you keep your relationship strong while you build your business.</p>\n<p>In this 30 minute interview, relationship expert and coach <a href=\"http://www.relationalcoaching.com/about_lisamerlobooth.html\">Lisa Merlo-Booth</a> gives very specific suggestions for:</p>\n<ul>\n<li>Breaking the news to your spouse that you want to start a business</li>\n<li>Talking about money and cash flow so financial concerns don't stress your relationship</li>\n<li>Creating \"what if\" contracts with each other to prevent stressful conversations</li>\n<li>How to talk to a spouse who is unsupportive of your business idea</li>\n<li>How men and women can break unhelpful gender-based patterns of communication </li>\n<li>How to set firm boundaries around work hours so you are present for your family</li>\n</ul>\n<p>You can find Lisa at <a href=\"http://www.relationalcoaching.com/index.html\">RelationalCoaching.com</a>.</p>\n<p>The blog post I referenced in the conversation is <a href=\"http://www.angelicaperez.com/2010/02/08/is-your-time-on-the-internet-affecting-your-parenting/\">Is Your Time on the Computer Impacting Your Children? Powerful Ways to Find Out and What To Do</a></p>\n<p>Happy Valentine's Day!</p>\n<p> </p>\n<p> </p>",
            "length": "7532693",
            "sourceUrl": "https://traffic.libsyn.com/secure/escapefromcubiclenation/GoodBizGoodRelationship.mp3?dest-id=46993"
        },
        {
            "title": "The Price is Right Interview Series: Sherri Garrity",
            "datePublished": "Sun, 06 Dec 2009 03:32:00 +0000",
            "description": "<p>To round out the pricing series, I talked to my fellow business coach Sherry Garrity from <a href=\"http://www.corporatefugitive.com/site\" mce_href=\"http://www.corporatefugitive.com/site\">Corporate Fugitive</a> who illuminates some of the specific pricing challenges faced by corporate employees transitioning to entrepreneurship.</p>\n<p>The three main challenges she talks about in our interview are:</p>\n\n<ul><li>Under-<i>dreaming</i>: thinking too small about the vision of what your business could be, and simply trying to match your salary as an employee</li><li>Under-<i>pricing</i>: not valuing all your experience, and using ineffective measures like billing by the hour</li><li>Under-<i>billing</i>: underestimating all the time and effort it\ntakes to effectively deliver your products or services, or not charging\nthe client for all the work you are doing</li></ul>\n\n<p>You can find Sherri at <a href=\"http://www.corporatefugitive.com/site\" mce_href=\"http://www.corporatefugitive.com/site\">CorporateFugitive.com</a><br/></p>\n<p>---</p>\n<p>I\nhope you have enjoyed this series!  I have never done anything like\nthis on my blog before (long-time readers are probably shocked to get\nsix new posts in one week since I have been slacking on my writing\nlately!). If you enjoyed it and want to see more intensive discussions\non particular topics, please let me know what you want to learn about.</p>\n<p>Thanks for following along, and thanks to all my wonderful guest experts (links go to their interview in this series):</p>\n<a href=\"http://www.escapefromcubiclenation.com/2009/11/30/the-price-is-right-interview-series-john-jantsch/\" mce_href=\"http://www.escapefromcubiclenation.com/2009/11/30/the-price-is-right-interview-series-john-jantsch/\">John Jantsch from Duct Tape Marketing</a><br/>\n<a href=\"http://www.escapefromcubiclenation.com/2009/12/01/the-price-is-right-interview-series-mark-silver/\" mce_href=\"http://www.escapefromcubiclenation.com/2009/12/01/the-price-is-right-interview-series-mark-silver/\">Mark Silver from Heart of Business</a><br/>\n<a href=\"http://www.escapefromcubiclenation.com/2009/12/02/the-price-is-right-interview-series-ramit-sethi/\" mce_href=\"http://www.escapefromcubiclenation.com/2009/12/02/the-price-is-right-interview-series-ramit-sethi/\">Ramit Sethi from I Will Teach You to Be Rich</a><br/>\n<a href=\"http://www.escapefromcubiclenation.com/2009/12/03/the-price-is-right-interview-series-andrea-j-lee/\" mce_href=\"http://www.escapefromcubiclenation.com/2009/12/03/the-price-is-right-interview-series-andrea-j-lee/\">Andrea J. Lee from Thought Partners International LLC</a><br/>\n<a href=\"http://www.escapefromcubiclenation.com/2009/12/04/the-price-is-right-interview-series-alexis-neely/\" mce_href=\"http://www.escapefromcubiclenation.com/2009/12/04/the-price-is-right-interview-series-alexis-neely/\">Alexis Neely from Family Wealth Institute</a>",
            "length": "31686658",
            "sourceUrl": "https://traffic.libsyn.com/secure/escapefromcubiclenation/EscapePricing_SherriGarrity_09.mp3?dest-id=46993"
        },
        {
            "title": "The Price is Right Interview Series: Alexis Neely",
            "datePublished": "Fri, 04 Dec 2009 22:52:00 +0000",
            "description": "\"There are a lot of business owners out there who are giving their stuff away for free because they don't know enough about pricing. That was my story,\" says <a href=\"http://\">Alexis Martin Neely</a>, our next guest in The Price is Right Interview Series.<br/><br/>Alexis is a lawyer and founder of two million dollar businesses.  She is also the author of <a href=\"http://www.wearcleanunderwearbook.com/\">Wear Clean Underwear: A fast, fun, friendly and essential guide to legal planning for busy parents</a>.<br/><br/>After quitting her job as an employee in a prestigious law firm to set out on her own, Alexis learned the hard way how not to run her solo practice. From these good lessons, she developed a very effective way to price and structure services, which parlayed into a whole new business line teaching and coaching lawyers.  Her current business, <a href=\"http://www.familywealthmatters.com/\">Family Wealth Institute</a> serves both lawyers and small business owners.<br/><br/>In this interview, Alexis walks through some specific pricing structures for independent service professionals, as well as discusses her passionate views on charging what you are worth.<br/><br/>You can find Alexis at <a href=\"http://\">www.alexisneely.com</a>.<br/>",
            "length": "29877312",
            "sourceUrl": "https://traffic.libsyn.com/secure/escapefromcubiclenation/EscapePricing_AlexisNeely_09.mp3?dest-id=46993"
        },
        {
            "title": "The Price is Right Interview Series: Andrea J. Lee",
            "datePublished": "Thu, 03 Dec 2009 21:20:00 +0000",
            "description": "Andrea J. Lee, CEO of <a href=\"http://www.mythoughtpartners.com\">Thought Partners International LLC</a> has been a huge influence on my approach to business since I read her book <a href=\"http://www.multiplestreamsofcoachingincome.com\">Multiple Streams of Coaching Income</a> in 2006. <br/><br/>She is one of those rare individuals who combine clear business intelligence with wit and humor. Her coaching is said to be a combination of tenderness and bite. I could not agree more.<br/><br/>In this edition of the pricing series, Andrea will talk about Guerrilla Pricing Tactics including:<br/><br/><ol><li>The concept of free, which she terms a \"pink spoon marketing.\" This is creating a business on the concept of generosity (much like you get with free tastes of ice cream from pink spoons at the ice cream shop).</li><li>What too much free looks like in business, which can involve going to long at free and getting kickback when you start to charge for services.</li><li>What too little free looks like in business, i.e. too little blog content and a quick sale of products.<br/></li><li>What is a product funnel and how do you use it to design your product offerings? The pros and cons of starting at the top or the bottom of the funnel.</li><li>The why and how of market comparison in pricing. <br/></li><li>What are your values and brand in business and how does that impact the price points you choose?</li></ol>\n I hope you enjoy the conversation!<br/><br/>And if you get inspired to learn a lot more from Andrea, check out the live event she is hosting in Vancouver, Canada in March, 2010 called <a href=\"http://www.wealthythoughtleader.com\">The Wealthy Thought Leader</a>. (I will be there, and would love to see you!)<br type=\"_moz\"/>",
            "length": "41767833",
            "sourceUrl": "https://traffic.libsyn.com/secure/escapefromcubiclenation/EscapePricing_AndreaJLee.mp3?dest-id=46993"
        },
        {
            "title": "The Price is Right Interview Series: Mark Silver",
            "datePublished": "Tue, 01 Dec 2009 23:51:00 +0000",
            "description": "<p>So much of what you learn about pricing focuses on the external market.</p>\n\n<p>But in the daily practice of being an entrepreneur, much of the confusion and angst about pricing comes from an inner feeling.</p>\n\n<p>Mark Silver, co-founder of <a mce_href=\"http://www.heartofbusiness.com\" href=\"http://www.heartofbusiness.com/\">Heart of Business</a>, has a very unique perspective on the <i>inner game of pricing</i>\nwhich is specifically tied to the spiritual side of business. In\naddition to being a long-time business coach, he is also a Sufi teacher\nand healer.</p>\n\n<p>Listen to our 40 minute conversation here.</p>\n\n<p>Mark covers a very interesting exercise which he terms \"resonant\npricing.\" My good buddy Havi Brooks wrote a wonderful post about this\nexercise where she gives a specific example of how she applied it to a\nparticular program she was launching with Naomi Dunford from <a mce_href=\"http://www.ittybiz.com\" href=\"http://www.ittybiz.com/\">Ittybiz</a>. <a mce_href=\"http://www.fluentself.com/blog/biggification/the-art-and-science-of-pricing/\" href=\"http://www.fluentself.com/blog/biggification/the-art-and-science-of-pricing/\">Read her example here</a>.</p>\n\n\n<p>Even if you pride yourself on having an extremely well-formed\nleft-brain muscle, I invite you experiment with some of Mark's\nwonderful teaching.</p>\n\n<p>Mark explains resonant pricing in a detailed post called <a mce_href=\"http://www.heartofbusiness.com/the-wackiness-of-resonant-pricing/\" href=\"http://www.heartofbusiness.com/the-wackiness-of-resonant-pricing/\">The Wackiness of Resonant Pricing</a> which includes a PDF with instructions. I used in on a group coaching call for <a mce_href=\"http://www.kickassmentoring.com\" href=\"http://www.kickassmentoring.com/\">KickAss Mentoring</a> the other night and we got a lot out the exercise.</p>\n\n<p>Find Mark at <a mce_href=\"http://www.heartofbusiness.com\" href=\"http://www.heartofbusiness.com/\">HeartofBusiness.com</a>.</p>\n\n<p>---</p>\n\n<p>Up tomorrow for the pricing series: <a mce_href=\"http://www.iwillteachyoutoberich.com/about/about-ramit/\" href=\"http://www.iwillteachyoutoberich.com/about/about-ramit/\">Ramit Sethi</a> from <a mce_href=\"http://www.iwillteachyoutoberich.com\" href=\"http://www.iwillteachyoutoberich.com/\">I Will Teach You to be Rich</a> who will share all kinds of juicy lessons for moving from totally free blog content to well-priced products and services.</p>",
            "length": "38215180",
            "sourceUrl": "https://traffic.libsyn.com/secure/escapefromcubiclenation/EscapePricing_MarkSilver.mp3?dest-id=46993"
        },
        {
            "title": "The Price is Right Interview Series: John Jantsch",
            "datePublished": "Mon, 30 Nov 2009 21:03:00 +0000",
            "description": "<p>I am thrilled to kick off a week-long series about pricing in small business with an interview with <a href=\"http://www.ducttapemarketing.com/john-jantsch.htm\" mce_href=\"http://www.ducttapemarketing.com/john-jantsch.htm\">John Jantsch</a> of <a href=\"http://www.ducttapemarketing.com/\" mce_href=\"http://www.ducttapemarketing.com\">Duct Tape Marketing</a>.  John is a well-known authority on small business marketing who has a very popular blog and speaking platform.</p>\n\n<p>Despite his solid business background and decades of experience, the\nthing I like best about John is that he absolutely walks his talk. He\nis extremely grounded, kind and generous with his knowledge.</p>\n\n<p>Listen to the 30-minute interview <b>here</b>.</p>\n\n<p>Some of my favorite parts of the conversation:</p>\n\n<ul><li>\"Price is a terrible place to compete. There will always be someone willing to go out of business faster than you.\"</li><li>There can be a backlash if you price your services too low, because\nyour customers might think there is something wrong with you if you\ncharge below the market, or that you cannot deliver the value promised\nin your offer.</li><li>\"If people keep saying 'gosh, you are too expensive!' all that\nmeans is that you are not doing a good enough job educating them on why\nyou are different.\"</li><li>Measure the results of your efforts by following up with your\nclients to see what value you produced by working with them. This can\ngive you fantastic data, case studies, testimonials and a strong\nfoundation for referrals.</li></ul>\n\n<p>You can find John at <a mce_href=\"http://www.ducttapemarketing.com/blog/2009/03/12/5-ways-to-amp-up-the-personal-in-your-brand/\" href=\"http://www.ducttapemarketing.com/blog/2009/03/12/5-ways-to-amp-up-the-personal-in-your-brand/\">www.ducttapemarketing.com</a>.  Also, check out his new course on Social Media Marketing at <a mce_href=\"http://www.ducttapeu.com\" href=\"http://www.ducttapeu.com/\">www.ducttapeu.com</a><br mce_bogus=\"1\"/></p>\n\n<p>---</p>\n\n<p>Tomorrow's guest expert on pricing will be <a mce_href=\"http://www.heartofbusiness.com/about/\" href=\"http://www.heartofbusiness.com/about/\">Mark Silver</a> from <a mce_href=\"http://www.heartofbusiness.com\" href=\"http://www.heartofbusiness.com/\">Heart of Business</a>.</p>",
            "length": "29137106",
            "sourceUrl": "https://traffic.libsyn.com/secure/escapefromcubiclenation/EscapePricing_JohnJantsch.mp3?dest-id=46993"
        },
        {
            "title": "Smash your goals with a mastermind group",
            "datePublished": "Tue, 22 Sep 2009 00:38:00 +0000",
            "description": "<p>The biggest obstacle to business success is not lack of a great idea, but poor execution.</p>\n\n<p>New entrepreneurs, lacking expertise or perspective, often struggle alone with starting or growing their business.</p>\n\n<p>It doesn't have to be this way!</p>\n\n<p>In my latest podcast (listen here), seasoned business coach and long-time small business expert <a mce_href=\"http://www.passionforbusiness.com/about-karyn.htm\" href=\"http://www.passionforbusiness.com/about-karyn.htm\">Karyn Greenstreet</a> describes the power of <span mce_style=\"font-weight: bold;\" style=\"font-weight: bold;\">mastermind groups</span>, which are small groups of 6-8 people with similar values and interests who help each other set and achieve really big goals.</p>\n\n<p>Karyn attributes much of her current business success to her\nmastermind group, which she has been meeting with for 90 minutes each\nmonth for the past eight years.</p>\n\n<p>In this 30-minute interview, Karyn explains:</p>\n\n<ol><li>What a mastermind group is, and isn't</li><li>Why they are critically important for entrepreneurs</li><li>Who to select for your own group</li><li>How to get a group started</li><li>Where to go for more information</li></ol>\n\n<p>She has a free e-book which you can download at her site specializing in mastermind groups, <a mce_href=\"http://www.thesuccessalliance.com/\" href=\"http://www.thesuccessalliance.com/\">www.thesuccessalliance.com</a><br mce_bogus=\"1\"/></p>\n\n<p>Her advice is to learn about mastermind by starting your own. I plan to do so myself to get 2010 to a great start!</p>\nP.S.\nI gush about Karyn quite a bit in this interview, and that is because\nA) I have been getting solid, practical free content from her for years\nand B) many of my clients and blog readers tell me how great she is. <b>Marketing lesson</b>: <i>When you share great information freely and serve your clients well, business and partnerships come to you.</i>",
            "length": "7135109",
            "sourceUrl": "https://traffic.libsyn.com/secure/escapefromcubiclenation/greenstreet_mastermind.mp3?dest-id=46993"
        },
        {
            "title": "Web Startup Success Guide: Great advice from Bob Walsh",
            "datePublished": "Tue, 11 Aug 2009 00:18:00 +0000",
            "description": "While there are many core business practices shared among any type of startup, web-based companies have a unique set of opportunities and challenges.<br/><br/>Perhaps no one has studied these unique challenges more than Bob Walsh, author of 5 books, the most recent being <a href=\"http://www.amazon.com/gp/product/1430219858?ie=UTF8&tag=ganasconsulti-20&linkCode=xm2&camp=1789&creativeASIN=1430219858\">The Web Startup Success Guide</a>.<br/><br/>Bob has learned his field from the inside-out, creating and marketing his own \"Micro ISV,\" (Micro Independent Software Vendor) business for many years, and advising many others on theirs in his consulting service <a href=\"http://www.47hats.com\">47hats.com</a>.  He is also one of the moderators of the popular <a href=\"http://discuss.joelonsoftware.com/?biz\">Business of Software forum</a> on the Joel on Software blog.<br/><br/>In this interview, I talk with Bob about:<br/><ol><li>Some of the unique challenges faced by web-based entrepreneurs</li><li>Tools and approaches to making the start-up process easier</li><li>Recommendations for those worried about colleagues stealing their great idea if they share it</li><li>How to define the right problem to solve with your product so people are compelled to buy it</li><li>How to use social media to connect with your community and promote your product</li><li>Which tools you can use to get things done in your business<br type=\"_moz\"/></li></ol>",
            "length": "37358364",
            "sourceUrl": "https://traffic.libsyn.com/secure/escapefromcubiclenation/BobWalsh.mp3?dest-id=46993"
        },
        {
            "title": "Great advice for aspiring authors: Interview with 100 Business Books of All Time author Todd Sattersten",
            "datePublished": "Fri, 22 May 2009 21:11:00 +0000",
            "description": "My love of books goes back to when I was about three years old.<br/><br/>As soon as I could form the sentence \"I want to go to the library,\" my Mom or Dad would take me every week to get a new stack of books.  I remember the smell as I entered the San Anselmo library and strolled through the aisles.  My senses tingled as I saw new stories, and I would have to negotiate with my Mom and Dad about how many I could carry home in a given week.<br/><br/>This love stayed with me my entire life.  Picture books turned into <a href=\"http://www.harpercollins.com/books/9780397317127/Mrs_PiggleWiggle/index.aspx\">Miss Piggle-Wiggle</a>, then the <a href=\"http://en.wikipedia.org/wiki/The_Chronicles_of_Narnia\">Chronicles of Narnia</a>, then books about world mythology, then school books, then a phase of intellectual books to convince myself that I was smart like <a href=\"http://www.amazon.com/Archaeology-Knowledge-Discourse-Language/dp/0394711068/ref=sr_1_1?ie=UTF8&s=books&qid=1243029786&sr=8-1\">The Archeology of Knowledge</a> by Michel Foucault.<br/><br/>About fifteen years ago, I fell in love with business books and have never looked back.  I never tire of reading new ideas and insights for how to start and run a business.<br/><br/>But the volume is overwhelming.<br/><br/>Todd Sattersten, President of <a href=\"http://www.800ceoread.com\">800CEORead</a>, co-authored a book with Jack Covert called <a href=\"http://100bestbiz.com/\">The 100 Best Business Books of All Time</a>.<br/><br/>I jumped on the chance to talk with him about the book, since I was really fascinated to understand the process by which they selected the very best business books.<br/><br/>As an author, I was excited to learn the criteria they developed to select one hundred books from the hundreds of thousands in the business category. The criteria were:<br/><ol><li><span style=\"font-weight: bold;\">Accessibility</span>: Is the book understandable, easy to read, engaging?</li><li><span style=\"font-weight: bold;\">Applicability</span>: Does it apply to today's business environment?</li><li><span style=\"font-weight: bold;\">Quality of Idea</span>: Would we do this in our own business?<br type=\"_moz\"/></li></ol>\n\n\nFavorite quotes from the podcast:<br/><br/><div style=\"margin-left: 40px;\">\"I am amazed at how often authors overestimate their ability to be writers.\"<br/><br/></div><div style=\"margin-left: 40px;\">\"The best books offer a promise to readers: This is what you are going to get out of the book.\"<br/><br/></div>Listen and learn! <br/><br/>And buy the book <a href=\"http://100bestbiz.com/\">here</a>.  This one's a keeper!<br type=\"_moz\"/>",
            "length": "26793609",
            "sourceUrl": "https://traffic.libsyn.com/secure/escapefromcubiclenation/100Best_2.mp3?dest-id=46993"
        },
        {
            "title": "The link between leaving your small cube and thinking big",
            "datePublished": "Fri, 08 May 2009 22:43:00 +0000",
            "description": "I think it was fate that Michael Port released his new book <a href=\"http://www.thinkbigrevolution.com/\">The Think Big Manifesto</a> within a few days of the release of mine.<br/><br/>Becoming comfortable with thinking big and gathering the courage to leave a \"safe\" life in a cube behind walk hand in hand.<br/><br/>So I interviewed Michael about his book in this 20-minute conversation, where we talk about:<br/><ol><li>Why you need to unhook from the \"gurus\"<br type=\"_moz\"/></li><li>How your kids can push you to do your best work</li><li>Why it is important to think big about what you do and how you operate in the world</li><li>The benefits of collaboration vs. competition<br type=\"_moz\"/></li><li>Our shared passion for martial arts, and the connection with thinking big<br type=\"_moz\"/></li></ol>",
            "length": "5507576",
            "sourceUrl": "https://traffic.libsyn.com/secure/escapefromcubiclenation/thinkbig.mp3?dest-id=46993"
        },
        {
            "title": "Learn how to build your personal brand ",
            "datePublished": "Tue, 07 Apr 2009 19:20:00 +0000",
            "description": "I will never forget reading Tom Peter's article <a href=\"http://www.fastcompany.com/magazine/10/brandyou.html\">The Brand Called You</a> in Fast Company Magazine in August 1997.  Growth in Silicon Valley was sizzling hot, and the fresh perspective on personal marketing was totally new and exciting.<br/><br/>25-year old Dan Schwabel felt the same thing when he read the article, although it was many years later, when he stumbled upon it on the internet.  According to Dan, it summed up what he had been doing in his own education and career since Junior High.  So he made the decision to become the personal branding expert for the new generation.<br/><br/>Today, Dan releases his first book on the topic, called <a href=\"http://www.amazon.com/gp/product/1427798206?ie=UTF8&tag=ganasconsulti-20&linkCode=xm2&camp=1789&creativeASIN=1427798206\">Me 2.0:  Build a Powerful Brand to Achieve Career Success.</a><br/><br/>I interviewed him in a 23-minute podcast where we discuss:<br/><ol><li>How to build your own personal brand</li><li>Can you still build a strong personal brand if you are no longer a young whipper-snapper?</li><li>How to maintain focus on brand building in a busy life<br/></li><li>How to start small and grow your visibility in national and global markets</li></ol>\n\nWe can all learn from Dan's focus, drive and determination.  He is, like my other young mentors <a href=\"http://www.iwillteachyoutoberich.com\">Ramit Sethi</a>, <a href=\"http://www.bencasnocha.com\">Ben Casnocha</a> and <a href=\"http://www.clicktoclients.com\">Shama Hyder</a>, showing that experience is not the only thing that builds a great brand.<br/><br/>Enjoy the interview and <a href=\"http://www.amazon.com/gp/product/1427798206?ie=UTF8&tag=ganasconsulti-20&linkCode=xm2&camp=1789&creativeASIN=1427798206\">grab the book</a>!  <br type=\"_moz\"/>",
            "length": "21072584",
            "sourceUrl": "https://traffic.libsyn.com/secure/escapefromcubiclenation/Dan_Schawbel_on_2009-04-05_at_16.04.mp3?dest-id=46993"
        },
        {
            "title": "How to become a masterful presenter with Nick Morgan, author of Trust Me",
            "datePublished": "Fri, 20 Feb 2009 05:25:00 +0000",
            "description": "I spent many years speaking to groups across the country, and even teaching presentation skills to hundreds of salespeople and engineers.<br/><br/>It was always fascinating to me since it combined so many favorite subjects:  motivation, communication, fear, physical movement, design and creativity.<br/><br/>In today's conversation with Nick Morgan, I took my learning to a whole new level.  His new book, <span style=\"font-style: italic;\">Trust Me:  Four Steps to Authenticity and Charisma </span>integrates a lot of new research about the brain to help speakers become truly masterful.  We talk about:<br/><ol><li>Why you do need to practice to appear spontaneous</li><li>How your brain drives your body language which can make you lose credibility (or gain it) before you even open your mouth<br type=\"_moz\"/></li><li>The specific steps to build great trust and credibility with your audience</li><li>Why the \"Tell em what you are going to tell em, tell em, tell em what you told em\" presentation structure that has been the standard for years is totally wrong.  (I gulped a bit on that one, since I used to teach this)</li><li>How to structure the content of your presentation for maximum impact</li><li>Where to start if you are considering professional speaking as part of your business model or marketing strategy<br type=\"_moz\"/></li></ol>",
            "length": "12565235",
            "sourceUrl": "https://traffic.libsyn.com/secure/escapefromcubiclenation/presentationmastery.mp3?dest-id=46993"
        },
        {
            "title": "Ready to freelance?  Learn from Michelle Goodman of \"My So-Called Freelance Life.\"",
            "datePublished": "Fri, 16 Jan 2009 00:35:00 +0000",
            "description": "Just about an hour ago, <a href=\"http://offers.business.com/content/whatworks\">Daniel Kehrer</a> asked me (on Twitter of course!):  Are you finding lots more folks going freelance because of the economy? \n\n<p>\n\n</p>\n\n\n<p><a href=\"http://www.escapefromcubiclenation.com/.shared/image.html?/photos/uncategorized/2009/01/15/20090115_1725.png\" onclick=\"return false;window.open(this.href, '_blank', 'width=703,height=321,scrollbars=no,resizable=no,toolbar=no,directories=no,location=no,menubar=no,status=no,left=0,top=0'); return false\"><img width=\"300\" height=\"136\" border=\"0\" alt=\"20090115_1725\" title=\"20090115_1725\" src=\"http://www.escapefromcubiclenation.com/get_a_life_blog/images/2009/01/15/20090115_1725.png\"/></a>\n</p>\n\n\n<p>Glad you asked Daniel!</p>\n\n\n<p>In today's podcast, I talk with <a href=\"http://www.anti9to5guide.com/\">Michelle Goodman</a>, author of the new book <a href=\"http://www.amazon.com/gp/product/1580052592?ie=UTF8&tag=ganasconsulti-20&linkCode=xm2&camp=1789&creativeASIN=1580052592\">My So-Called Freelance Life</a>. \nIt is chock-full of information for people who are considering\nfreelancing on the side, or as a full-time pursuit.  <br/></p>\n\n\n<p>Michelle and I talk about all kinds of nuts and bolts questions about freelancing including:</p>\n\n\n<ul><li>How in the world do you get your first client when you work full-time in a \"real\" job?</li><li>Should you ever work for free to get started?</li><li>How to you contract for work appropriately to avoid scope creep?</li><li>Should you bother to list your services on the \"bidding\" sites like <a href=\"http://www.elance.com/\">Elance </a>or <a href=\"http://www.guru.com/\">Guru</a>?</li><li>When can \"competitors\" be a great source of referrals for your business?</li></ul>\n\n\n<p>I think one of the best ways to test the waters of entrepreneurship,\neven if you are not ready to leave your job for a few years, is to do a\nfreelance project.  Enjoy the conversation, and the book!</p>",
            "length": "10376905",
            "sourceUrl": "https://traffic.libsyn.com/secure/escapefromcubiclenation/freelancelife.mp3?dest-id=46993"
        },
        {
            "title": "Great way to start your year:  Set up a personal board of directors",
            "datePublished": "Fri, 02 Jan 2009 18:44:00 +0000",
            "description": "I may have set a new record for the shortest time from concept to production for a podcast:  20 minutes ago, I shared on Twitter that my best friend, Desiree Adaway, set up a personal board of directors last year and just sent me her annual report.<br/><br/>Desiree is the Senior Director of Volunteer Mobilization for Habitat for Humanity, and felt the need to get expert advice and insight from people she trusted and admired.<br/><br/>Many people were interested in hearing her story, so I called her up and recorded a podcast on the spot.  I hope you enjoy our conversation in which we cover:<br/><ol><li>What is a personal board of directors <br/></li><li>How to choose good members</li><li>How to make sure the relationship is mutually beneficial</li><li>How to get the most out of the mentoring relationship</li></ol>\n\nDesiree and I learned of the concept from Jim Collins in Good to Great.  Here are a few articles which expand on the topic:<br/><br/>BusinessWeek:  <a href=\"http://www.businessweek.com/magazine/content/08_34/b4097032721156.htm?chan=magazine+channel_special+report\">Good to Great Expectations</a><br/>In Jim's own words from the Fast Company Design Conference in Phoenix, 2000:  <a href=\"http://www.jimcollins.com/audio/hedgehogA3a.mp3\">Why have a personal board of directors?</a><br type=\"_moz\"/>",
            "length": "4056631",
            "sourceUrl": "https://traffic.libsyn.com/secure/escapefromcubiclenation/personalboard.mp3?dest-id=46993"
        },
        {
            "title": "Bounce from failure",
            "datePublished": "Mon, 24 Nov 2008 22:29:00 +0000",
            "description": "<p>Who doesn't love the film <i>Rocky</i> or hearing about how J.K.\nRowling lived near destitute while her Harry Potter manuscript got\nrejected by scores of publishers right before hitting it richer than\nthe Queen of England?</p>\n\n\n<p>A lot of our view of failure in popular American culture is romanticized.  The fact is, while you are failing, it feels really <i>awful</i>\nand does not become the enlightened lesson that you share until you\nhave ten years perspective between you and the excruciating experience.</p>\n\n\n<p>Author and speaker Barry Moltz addresses this topic in his most recent book called <a href=\"http://www.amazon.com/Bounce-Failure-Resiliency-Confidence-Achieve/dp/0470224088/ref=sr_1_2?ie=UTF8&s=books&qid=1227566078&sr=1-2\"><i>Bounce:  Failure, Resiliency, and Confidence to Achieve Your Next Great Success</i></a>.</p>\n\n\n<p>He shares a lot of great insight into things like:</p>\n\n\n<ul><li>How to view failure not as a deep lesson from above, but as an integral part of starting a business</li><li>How to not stay stuck in emotional wallowing right after blowing it big</li><li>How to make sure you are connected with <i>why</i> you are trying new things that sometimes lead to failure</li><li>How to bounce quickly from failures so that you maintain a positive forward momentum and are able to accomplish your goals</li></ul>\n\n\n<p>In the podcast, I referenced the tremendous new e-book by my friend Jonathan Fields called <a href=\"http://www.careerrenegade.com/manifesto/\">The Firefly Manifesto.</a> \nThis gives some great insight and tools for those folks who may have\njust been laid off, or who are working in unstable industries (which\nwould be just about everyone these days!).</p>",
            "length": "7624330",
            "sourceUrl": "https://traffic.libsyn.com/secure/escapefromcubiclenation/bounce.mp3?dest-id=46993"
        },
        {
            "title": "No excuse anymore to forgo a business plan",
            "datePublished": "Wed, 27 Aug 2008 18:56:00 +0000",
            "description": "<p>My original and only business plan for my company was <a href=\"http://www.escapefromcubiclenation.com/get_a_life_blog/2006/06/writing_a_dr_se.html\">based on a Dr. Suess book</a>.  I wish I were kidding.</p>\n\n\n<p>Owning up to my liberal arts major and rebellious roots, I didn't\nthink I needed a \"real\" plan.  And, for the most part, I did fine for a\ndecade, securing lots of clients and making a good living.</p>\n\n\n<p>But honestly, I think that I was just not thinking about business\nplanning the right way.  I imagined reams of paper, onerous\nspreadsheets and carefully crafted mission statements.  Yuck.</p>\n\n\n<p>Now, <a href=\"http://timberry.com/\">Tim Berry</a>, founder of <a href=\"http://www.paloaltosoftware.com/\">Palo Alto Software</a> and prolific blogger about <a href=\"http://upandrunning.entrepreneur.com/\">all things startup</a>, has come out with a new book called the <a href=\"http://www.amazon.com/gp/product/1599181908/103-1591546-4834254?ie=UTF8&tag=ganasconsulti-20&linkCode=xm2&camp=1789&creativeASIN=1599181908\">Plan as You Go Business Plan</a>. \nEven though his company makes business planning software, Tim felt a\nbit frustrated by the perceived hurdle new entrepreneurs attributed to\nbusiness plans.  When I asked him why most people didn't write them, he\nsaid:</p>\n<blockquote><p>\"What people normally give me, Pam, is “Yes,\nI’m going to tomorrow,” or “next month,” or “six months from now.”  And\nthen there’s the variant on that: “Yes, I really agree it’s stupid that\nwe don’t have a plan in this business and so-and-so has been promising\nto write it for years.”  So they the pass the buck.  It’s funny because\nthe drag, what we’re fighting is they have in their mind this huge\nmarathon-like PhD thesis-like thing. I don’t blame them sometimes for\nthinking, “No, I’m too busy.  I don’t have time for that. I’ve got to\nrun my business.”  </p>\n</blockquote><p>Instead of this perspective,\nTim encourages you to think of business planning as a fun and critical\npart of your entrepreneurial journey.  He says:</p>\n<blockquote><p>“Planning\nisn’t about writing some ponderous homework assignment or dull business\nmemo; it’s about envisioning the business that you want to create.  It\nshould be fascinating to you.  What do people want, how are you going\nto get it to them, how are you different and what do you do better than\nanyone else?”</p>\n</blockquote>I interviewed Tim on this topic for my\nbook, but he was generous enough to let me share the conversation as a\npodcast.  It is about 37 minutes long.<br/><br/>I truly am motivated to finally create a plan after twelve years in business.  I hope you are too!<br/>",
            "length": "35872101",
            "sourceUrl": "https://traffic.libsyn.com/secure/escapefromcubiclenation/timberry.mp3?dest-id=46993"
        },
        {
            "title": "Blog basics for beginners with Nathan Bowers Part 2",
            "datePublished": "Tue, 05 Aug 2008 20:24:00 +0000",
            "description": "<span style=\"font-weight: bold;\">Find Part 1 of this interview</span> <a href=\"http://escapefromcubiclenation.libsyn.com/index.php?post_id=365840\">here</a>.<br/><br/>I get a lot of questions about blogging from people who are considering\nstarting a business and are new to the social media world.  <br/><br/>So does my friend <a href=\"http://www.nathanbowers.com/\">Nathan Bowers</a>, who is a web developer by trade, and also an artist/musician and all-around renaissance guy.  <br/><br/>Nathan\nand I connected on Twitter recently and started a whole series of\noffline conversations which resulted in this 2-part podcast interview. \nWe wanted to reduce anxiety for new bloggers, and also draw the\nconnection between the importance of good technology crossed with good\ncontent.  As we both noted, there are plenty of popular blogs with\ncrappy designs, mine included.<br/><br/><span style=\"font-weight: bold;\">Part 2 of this interview covers</span>:<br/><ol><li>Search Engine Optimization (SEO)</li><li>Creating compelling content</li></ol>\n\n<span style=\"font-weight: bold;\">Interview notes:</span><br/><br/><a href=\"http://wordpress.org/extend/plugins/all-in-one-seo-pack/\">Wordpress All-in-one SEO plugin</a><br/><a href=\"http://c2.com/cgi/wiki/wiki?ArtAndFear\">Art and Fear Anecdote</a> from the book <a href=\"http://www.kk.org/cooltools/archives/000216.php\">Art and Fear</a><br/>",
            "length": "29176718",
            "sourceUrl": "https://traffic.libsyn.com/secure/escapefromcubiclenation/BlogbasicsPart2.mp3?dest-id=46993"
        },
        {
            "title": "Blog basics for beginners with Nathan Bowers Part 1",
            "datePublished": "Tue, 05 Aug 2008 19:57:00 +0000",
            "description": "I get a lot of questions about blogging from people who are considering starting a business and are new to the social media world.  <br/><br/>So does my friend <a href=\"http://www.nathanbowers.com\">Nathan Bowers</a>, who is a web developer by trade, and also an artist/musician and all-around renaissance guy.  <br/><br/>Nathan and I connected on Twitter recently and started a whole series of offline conversations which resulted in this 2-part podcast interview.  We wanted to reduce anxiety for new bloggers, and also draw the connection between the importance of good technology crossed with good content.  As we both noted, there are plenty of popular blogs with crappy designs, mine included.<br/><br/><span style=\"font-weight: bold;\">Part 1 of this interview covers</span>:<br/><ol><li>Defining a goal for your blog</li><li>Securing an effective domain name</li><li>Choosing a blogging platform</li><li>Choosing a blog host</li><li>Measuring the success of your blog</li><li>Design basics</li></ol>\n\n<span style=\"font-weight: bold;\">Interview notes:</span><br/><br/><a href=\"http://sethgodin.typepad.com/seths_blog/2005/10/the_new_rules_o.html\">Seth Godin's advice on naming</a><br/><a href=\"http://www.neutronllc.com/ideas/brand_names_that_zag\">Neutron LLC naming case studies</a><br/><br/>As a side note, Nathan walks his talk and recently redesigned Fred Wilson's popular blog <a href=\"http://www.avc.com/a_vc/2008/08/the-new-avc-sam.html\">avc.com</a>.  He made the connection with Fred by commenting on his blog frequently, and suggesting improvements.  Fred was so intrigued that he hired Nathan, proof that valuable business connections come from social networking done with integrity.<br type=\"_moz\"/>",
            "length": "29503257",
            "sourceUrl": "https://traffic.libsyn.com/secure/escapefromcubiclenation/BlogbasicsPart1.mp3?dest-id=46993"
        },
        {
            "title": "You can do good and do well:  Lessons from \"The Go-Giver\"",
            "datePublished": "Wed, 02 Jul 2008 18:05:00 +0000",
            "description": "I have a pile of books to read and review next to my bathtub.  <a href=\"http://www.thegogiver.com\">The Go-Giver:  A little story about a powerful business idea</a> sat there for awhile, until I finally picked it up the other evening and started reading it.  I was drawn in by the simple story, and got more and more encouraged by the premise as the pages went on.<br/><br/>A review of the book by Science of Mind sets it up well:<br/><br/><div style=\"margin-left: 40px;\">\"For anyone that has ever believed that attaining success requires a greedy, self-centered approach, The Go-Giver:  A Little Story About a Powerful Business Idea, could be just what the metaphysical doctor ordered.  The beautiful message contained inside this book can help us develop a more pragmatic, big-hearted and ultimately successful approach -- both to business and to life.\"<br/></div><br/>In my interview with the co-author, Bob Burg, we discuss five key principles covered in the book:<br/><ol><li><span style=\"font-weight: bold;\">The Law of Value</span><br/>Your true worth is determined by how much more you give in value than you take in payment<br/></li><li><span style=\"font-weight: bold;\">The Law of Compensation</span><br/>Your income is determined by how many people you serve and how well you serve them<br/></li><li><span style=\"font-weight: bold;\">The Law of Influence</span><br/>Your influence is determined by how abundantly you place other people's interests first<br/></li><li><span style=\"font-weight: bold;\">The Law of Authenticity</span><br/>The most valuable gift you have to offer is yourself<br/></li><li><span style=\"font-weight: bold;\">The Law of Receptivity</span><br/>The key to effective giving is to stay open to receiving<br/></li></ol>\nThe book is a nice, easy summer read with a great message.  You may intuitively know these things, but the real question is <span style=\"font-style: italic;\">are you doing them</span>?<br/><br/>Enjoy the conversation.<br type=\"_moz\"/>",
            "length": "9748817",
            "sourceUrl": "https://traffic.libsyn.com/secure/escapefromcubiclenation/thegogiver.mp3?dest-id=46993"
        },
        {
            "title": "Are you selling your entrepreneurial soul if you get a day job?",
            "datePublished": "Thu, 29 May 2008 22:12:00 +0000",
            "description": "I was really excited to do this interview with Andy Wibbels of <a href=\"http://\">www.andywibbels.com</a> after I heard that he took a \"day job\" as Marketing Manager at Six Apart.<br/><br/>I have known Andy for a long time and have always admired his candor, sass and brand, as well as his business sense.  Since he has done almost everything right to create an effective business, like:<br/><ol><li>Create a successful blog</li><li>Define and own a particular niche</li><li>Develop a huge mailing list of devoted followers</li><li>Team up with great partners like Darren Rowse and Michael Port</li><li>Write a successful book (Blogwild)</li><li>Get mainstream press like the Wall St. Journal and USA Today</li></ol>\nI wondered what would make him decide to become an employee.<br/><br/>I think his answers will interest you, if not challenge some of your long-held beliefs about entrepreneurship.<br/><br/>My conclusion at the end of the conversation is that there is no work configuration that is inherently evil.  It is all about what you are looking for, what is important to you, what you are willing to trade off, and how likely you are to be successful on the \"outside.\"<br/><br/>As for me, I think I am, as Jim Collins once said about entrepreneurs, \"constitutionally unemployable,\" but that doesn't mean I don't respect someone's decision to take a day job.<br/><br/>What do you think?<br/><br type=\"_moz\"/>",
            "length": "8715622",
            "sourceUrl": "https://traffic.libsyn.com/secure/escapefromcubiclenation/areyousellingyoursoul.mp3?dest-id=46993"
        },
        {
            "title": "How to develop an entrepreneurial mindset",
            "datePublished": "Mon, 05 May 2008 18:41:00 +0000",
            "description": "For this week's podcast, I had the pleasure of interviewing <a href=\"http://www.garyschoeniger.com/\">Gary Schoeniger</a>, founder of the <a href=\"http://www.elientrepreneur.com/\">Entrepreneurial Learning Initiative</a>.  \n\n<p>Gary has a really interesting story -- from dead broke desperate handyman to successful entrepreneur.</p>\n\n\n<p>Over the last 15 years, he has interviewed hundreds of successful\nentrepreneurs to discover which skills are critical for starting and\nrunning a business.  Many are not what you think.<br/>\n</p>\n\n\n\n\n<p>My favorite advice from the interview: <b> </b></p>\n<blockquote><p><b>\"Find a problem.  Figure out how to solve the problem.  Find more people with the same problem and you have a business.\"</b></p>\n</blockquote><p>I\nlike that Gary's views make me think.  I have been in \"do what you love\n(and work and work and work and work) and the money will follow\" mode\nfor so long that the \"problem/solution\" model was very intriguing.</p>",
            "length": "9939929",
            "sourceUrl": "https://traffic.libsyn.com/secure/escapefromcubiclenation/a1e86dfd-f73d-46ec-8331-5fc86318018a.mp3?dest-id=46993"
        },
        {
            "title": "Is it possible to have a cool job?",
            "datePublished": "Mon, 14 Apr 2008 19:19:00 +0000",
            "description": "My friend Alexandra Levit just wrote a book called \"<a href=\"http://www.amazon.com/Howd-You-Score-That-Jobs/dp/0345496299/ref=pd_bbs_sr_1?ie=UTF8&s=books&qid=1208200529&sr=8-1\">How'd You Score That Gig? A Guide to the Coolest Jobs- and How to Get Them</a>.\" \n Her book bubbled up from lots of conversations with friends at social\ngatherings where inevitably one person would describe a cool job that\nno one had heard of.<br/> \n\n<p>Despite what you may think of my opinion based on my blog's name,\nthere are certainly times and places for a \"job,\" rather than striking\nout on your own.  If you have to be your own venture capitalist for awhile, you might as well do it in an interesting profession!  The more time that goes on, the more I see that\nfeelings of liberation erupt from your own positive thoughts and beliefs, no matter\nyour work configuration.</p>\n\n\n<p>I interviewed Alexandra for my podcast where we discussed not just\nthe contents of her new book, but also what it is like to be a\nsuccessful self-employed writer.  She gives some tips for choosing book\ntopics that are not just interesting to write, but that may pique the\ninterest of publishers.</p>",
            "length": "8048977",
            "sourceUrl": "https://traffic.libsyn.com/secure/escapefromcubiclenation/23b6c9c3-a1e5-c567-7e6c-720cba8c3690.mp3?dest-id=46993"
        },
        {
            "title": "Realistic expectations for making money in your startup business",
            "datePublished": "Tue, 11 Mar 2008 04:33:00 +0000",
            "description": "Sometimes I feel a bit schizophrenic, on one hand encouraging people to not stress so much about leaving their corporate job to start a business, and on the other hand feeling extremely uncomfortable about all the \"start a business in 30 days in your bathrobe\" nonsense that permeates the internet.<br/><br/>Sparked by a blog post my good friend and fellow entrepreneur coach Philippa Kennealy wrote called <a href=\"http://www.entrepreneurialmd.com/index/2008/2/12/can-you-maintain-your-income-as-an-entrepreneurial-physician.html\">Can you maintain your income as an entrepreneurial physician?</a> , I invited Philippa as a guest for this week's podcast on<span style=\"font-weight: bold;\"> realistic expectations for making money in your startup business.</span><br/><br/>Like anything in life, you will have people at every end of the spectrum, some who get lucky making tons on money in their first year, and others who take a decade to make serious cash.<br/><br/>In this 38-minute interview, I talk to Philippa about:<br/><ol><li>Her own experience building both a coaching <span style=\"font-style: italic;\">practice</span> and a coaching <span style=\"font-style: italic;\">business</span> (there is a difference, which she explains!)</li><li>What she learned by launching <a href=\"http://www.entrepreneurialmd.com\">The Entrepreneurial MD</a>, a coaching business focused on helping physicians learn business skills, enhance their medical practices and start new businesses</li><li>They key questions to ask before launching a business</li><li>Realistic timeframes for getting your income flowing after launching your business<br type=\"_moz\"/></li></ol>\nOur advice may seem a bit conservative to some of you who have big plans to make a huge sum of money your first year in business.  My response is threefold:<br/><ol><li><span style=\"font-weight: bold;\">If you can make a  huge sum of money your first year in business, do it</span>.  Don't let us or anyone else stop you.</li><li><span style=\"font-weight: bold;\">Faster is not always better</span>.  There are really great things that result from taking the time to plan and launch a business.  For people that have a lower tolerance for risk (financial and otherwise), slow and steady growth, sometimes on the side of a gig as an employee, can be a lot less scary and more rewarding than an all-or-nothing sprint for the finish line.  You learn a lot by doing and testing a lot of things.<br/></li><li><span style=\"font-weight: bold;\">If you think it is easy to make huge piles of money, you may want to test your assumptions</span>.  Real world testing is the best ... launch a small product, do a consulting gig or two, try to get some new clients on the side of your day job.  I hope I am wrong and response #1 applies to you.  But I would rather you temper your optimism with realism than fall on your face and lose more than you need to.<br type=\"_moz\"/></li></ol>\nI am curious what you think of the conversation.  Please tell me at the blog!  <a href=\"http://\">www.escapefromcubiclenation.com</a> <br type=\"_moz\"/>",
            "length": "9264925",
            "sourceUrl": "https://traffic.libsyn.com/secure/escapefromcubiclenation/Realisticmoney.mp3?dest-id=46993"
        },
        {
            "title": "5 reasons why entrepreneurship is the best personal development on the planet",
            "datePublished": "Tue, 26 Feb 2008 17:46:00 +0000",
            "description": "If you want to grow as a human being, you could climb really tall mountains.  Or run marathons.  Or study the great written works.  Or study yoga in an ashram.<br/><br/>Or ... you could put your entire livelihood at risk and become an entrepreneur.<br/><br/>I don't think running a business is for everyone.  But I do think that it is the best way on the planet to learn about yourself.<br/><br/>In this episode, I list 5 reasons why I feel so strongly about this.<br/><br/>Listen in to see if you agree or disagree, then share your opinion with me at the blog!  <a href=\"http://\">www.escapefromcubiclenation.com</a><br/><br/>",
            "length": "8773298",
            "sourceUrl": "https://traffic.libsyn.com/secure/escapefromcubiclenation/growthbiz_02_26_08.mp3?dest-id=46993"
        },
        {
            "title": "Embrace synchronicity in your business and enjoy the results",
            "datePublished": "Mon, 20 Aug 2007 20:30:00 +0000",
            "description": "You may notice that the closer you get to your right life and business, the more frequently coincidence, synchronicity and serendipity occur.  Once thought the purvey of mystics and dreamers, more and more business people are embracing insight and intuition as a critical business skill.\n\nIn this episode, I share: <br/><ol><li>My own frequent experiences with synchronicity <br/></li><li>Some \"rational\" reasons why it may occur <br/></li><li>Resounding encouragement to stop being so stuffy and embrace the benevolent forces of the universe on your way to creating a great business. <br/></li></ol>\n\nDon't worry - you won't have to buy a Grateful Dead album in order to enjoy the concepts, just have a listen and tell me what you think at the blog:  <a href=\"http://\">www.escapefromcubiclenation.com</a>.\n\n<br/><br/>Technical note:\n\nThis is the first podcast I am recording with my new iMac, and I saved the audio file in a different format than usual.  Let me know if you have problems listening by leaving a comment here, and I will make sure to address it.  Thanks!",
            "length": "3668554",
            "sourceUrl": "https://traffic.libsyn.com/secure/escapefromcubiclenation/synchronicity2.mp3?dest-id=46993"
        },
        {
            "title": "What to do when you hit the \"starting a business is too hard\" wall",
            "datePublished": "Tue, 17 Jul 2007 19:43:00 +0000",
            "description": "Even the most optimistic and motivated aspiring entrepreneur will reach a point where frustration or anxiety grinds progress to a halt.  This is otherwise known as \"hitting the wall.\"<br/><br/>It can happen when doing things you hate such as:<br/><ol><li>Making sales and marketing calls</li><li>Trying to crank out a first draft of a book or product</li><li>Filling out government or legal forms</li><li>Creating a business plan<br type=\"_moz\"/></li></ol>\nWhat can you do to not let frustration derail your dreams?  My five recommendations include:<br/><ol><li>Scream, whine, wail, swear and complain</li><li>Step away</li><li>Find a source of immediate beauty or calm</li><li>Reconnect with the reason behind your entrepreneurial endeavor</li><li>Make a very clear and specific goal to complete one task</li></ol>\nLet me know your ways of dealing with \"The Wall\" at <a href=\"http://www.escapefromcubiclenation.com\">www.escapefromcubiclenation.com</a> <br type=\"_moz\"/><br/>",
            "length": "7467394",
            "sourceUrl": "https://traffic.libsyn.com/secure/escapefromcubiclenation/hittingthewall.mp3?dest-id=46993"
        },
        {
            "title": "How do you know when it is safe to call yourself an expert?",
            "datePublished": "Tue, 03 Jul 2007 17:29:00 +0000",
            "description": "It is often tricky to know when it is safe to call yourself an expert in your field.  If you have done any research in marketing and PR, you know the benefits of an \"expert\" designation:  free press and the trust and credibility of potential customers, leading to more sales.<br/><br/>But it can feel a bit presumptuous to call yourself an expert, right?<br/><br/>This episode provides questions you can ask yourself to test your expertise, which go beyond the traditional formula of <span style=\"font-weight: bold;\">years of experience + number of academic degrees + number of books written = level of expertise</span>.<br/><br/>Please share your thoughts about when it is safe to call yourself an expert on the blog at <a href=\"http://www.escapefromcubiclenation.com\">www.escapefromcubiclenation.com</a>.<br/>",
            "length": "4886100",
            "sourceUrl": "https://traffic.libsyn.com/secure/escapefromcubiclenation/whenareyouexpert.mp3?dest-id=46993"
        },
        {
            "title": "Soul-wrenching insight on creative blocks from The War of Art",
            "datePublished": "Mon, 18 Jun 2007 23:42:00 +0000",
            "description": "I was stunned and awed this weekend when I read a great book on creative blocks called <a href=\"http://www.amazon.com/War-Art-Through-Creative-Battles/dp/0446691437/ref=pd_bbs_sr_1/105-8483806-5900432?ie=UTF8&s=books&qid=1182210869&sr=8-1\">The War of Art</a> by Steven Pressfield.  Best known as a novelist of books such as The Legend of Bagger Vance, Gates of Fire, Tides of War, and The Last of the Amazons, Pressfield writes a short but exquisite analysis of the source, purpose and solution to creative blocks.  It was published in 2002, but is a timeless classic for anyone who feels blocked from starting anything.<br/><br/>I chose a few key concepts to explore, including:<br/><ol><li>What is resistance?</li><li>What is its aim?</li><li>What is a quick way to overcome it?</li></ol>\nI share some juicy passages from the book, which REALLY got me fired up to stop procrasinating and get moving on long-stalled creative projects.  Here is a little taste:<br/><br/><div style=\"margin-left: 40px;\">\"Resistance will tell you anything to keep you from doing your work.  It will perjure, fabricate, falsify; seduce, bully, cajole.  Resistance is protean.  It will assume any form, if that's what it takes to deceive you.  It will reason with you like a lawyer or jam a nine-millimeter in your face like a stickup man.  Resistance has no conscience.  It will pledge anything to get a deal, then double-cross you as soon as your back is turned.  If you take Resistance at its word, you deserve everything you get.  Resistance is always lying, and always full of shit.\"<br/></div><br/>I am very curious what your experience has been with creative blocks, and what you have done to move past them.  Please share at the blog! <a href=\"http://\">www.escapefromcubiclenation.com</a><br/><br/>P.S.  Yes, you heard a little bit of 2-year old screaming in the back of this episode ... I didn't have the time to re-do or edit the recording, so forgive my imperfection as a sign of DO-ING to slay the dragon.  :)<br type=\"_moz\"/>",
            "length": "7329915",
            "sourceUrl": "https://traffic.libsyn.com/secure/escapefromcubiclenation/warofart.mp3?dest-id=46993"
        },
        {
            "title": "Striking a balance between being rich and being famous",
            "datePublished": "Tue, 05 Jun 2007 04:58:00 +0000",
            "description": "People are drawn to entrepreneurship for a variety of reasons including work/life flexibility, the opportunity to contribute something meaningful to the world, the chance to make a lot of money or the platform to get known as an expert in your field.<br/><br/>Regardless of your intentions, chances are you want to make money at what you do, and use the benefits of press and publicity to market your efforts.  In my shorthand, I call this getting rich and famous, even if in your humble definition this means being able to pay your light bill on time and getting a one-line mention in your local paper.<br/><br/>Many first-time entrepreneurs struggle to balance the effort it takes to get rich with the effort it takes to get famous.  So in this podcast, I share 5 tips including:<br/><ol><li style=\"font-weight: bold;\">Spend time defining your niche<br/> <span style=\"font-style: italic; font-weight: normal;\">So that you know exactly who you are trying to target, and which problems they have.</span><br/></li><li><span style=\"font-weight: bold;\">Create a product road map</span> <br/><span style=\"font-style: italic;\">So that you define what you are going to develop in what order and focus your efforts.</span></li><li><span style=\"font-weight: bold;\">Create the infrastructure to support your product from first contact to product delivery and follow up<br/></span><span style=\"font-style: italic;\">So you don't alienate your hard-won customers with crappy service.<br/></span></li><li><span style=\"font-weight: bold;\">Tie your fame-garnering efforts to your niche<br/></span><span style=\"font-style: italic;\">So that you don't become known as the boring, generic person who knows a little about a lot of stuff.</span></li><li><span style=\"font-weight: bold;\">Always direct people to your product page<br/></span><span style=\"font-style: italic;\">So that you leverage media exposure to make sales AND get famous.</span></li></ol>\n\nPlease share your getting rich and famous stories at the blog -- <a href=\"http://www.escapefromcubiclenation.com\">www.escapefromcubiclenation.com</a>.<span style=\"font-style: italic;\"><br/></span>",
            "length": "7591109",
            "sourceUrl": "https://traffic.libsyn.com/secure/escapefromcubiclenation/richandfamous.mp3?dest-id=46993"
        },
        {
            "title": "How to go from vague idea to concrete business concept",
            "datePublished": "Tue, 22 May 2007 00:01:00 +0000",
            "description": "A blog reader recently wrote an email and shared his frustration at being stuck in a corporate job and hating it, but not knowing how to begin a new business in a new field.<br/><br/>To answer this question, I outlined a number of steps you can take to go from vague and fuzzy idea to concrete business concept, highlighted here:<br/><ol><li><span style=\"font-weight: bold;\">Step 1:</span>  <span style=\"font-weight: bold;\">Wrap your arms around the field</span>. Learn as much as you can about all the ways this field is expressed in business, so that you know which area to focus on.</li><li><span style=\"font-weight: bold;\">Step 2:</span>  <span style=\"font-weight: bold;\">Choose a small \"neighborhood\" to explore</span>.  Once you see all the different possibilities in the field, choose a particular area of interest.<br/></li><li><span style=\"font-weight: bold;\">Step 3: </span> <span style=\"font-weight: bold;\">Identify the hotshots that are doing the work successfull</span>y.  These should be people who not only have technical expertise that you admire, but also complimentary values and thriving businesses.</li><li><span style=\"font-weight: bold;\">Step 4:</span>  <span style=\"font-weight: bold;\">Carve a niche</span>.  Choose a particular area to work in that represents your best work, and a particular group of people to work with that would energize and engage you (and would pay you -- we are talking about a viable business!)<br/></li><li><span style=\"font-weight: bold;\">Step 5:  Shake a tree</span>.  Get moving with a marketing plan, selling services and meeting with potential customers.</li></ol>\nIf you break things into steps and deal with one at a time, the prospect of entering a new field won't be so overwhelming.<br/><br/>Please share your thoughts on this topic, and what has worked, or not worked, in your own businesses at <a href=\"http://www.escapefromcubiclenation.com\">www.escapefromcubiclenation.com</a>. <br type=\"_moz\"/>",
            "length": "6164627",
            "sourceUrl": "https://traffic.libsyn.com/secure/escapefromcubiclenation/vaguetoconcrete.mp3?dest-id=46993"
        },
        {
            "title": "Use classes and workshops to get stuff done",
            "datePublished": "Mon, 07 May 2007 22:03:00 +0000",
            "description": "<p>Most small business owners have big plans to develop new services, re-invigorate marketing efforts or enhance online offerings.  But if you are working alone, sometimes the tasks seem overwhelming.</p>\n<p>Participating in a group class or workshop can be a great way to:</p>\n<ol><li>Develop a supportive network of peers that can provide insight, encouragement and motivation for your project</li><li>Get expert advice from your instructor which can ensure you don't make costly misakes and do things right the first time</li><li>Build in some accountability to get things done, since you have specific assignments and deadlines</li></ol>\n<p>Personally, I am hopeless without a deadline, so the final point is of particular importance.</p>\n<p>Some resources mentioned in the podcast:</p>\n<ol><li>Google your topic of interest, + teleclass or workshop</li><li>Coachville's <a href=\"http://www.teleclass.com\">www.teleclass.com</a></li><li>Classes at <a href=\"http://www.passionforbusiness.com\">www.passionforbusiness.com</a></li></ol>\n<p>If you want to share your own experiences as a participant or know of good classes or directories of classes for small business owners, let me know at <a href=\"http://www.escapefromcubiclenation.com\">www.escapefromcubiclenation.com</a>.</p>\n<p> </p>",
            "length": "3612572",
            "sourceUrl": "https://traffic.libsyn.com/secure/escapefromcubiclenation/teleclasses.mp3?dest-id=46993"
        },
        {
            "title": "Controversy is good:  go ahead, disagree with me!",
            "datePublished": "Tue, 24 Apr 2007 04:36:00 +0000",
            "description": "If you were raised in a conflict-averse household like I was, you may find that your early training seeps into your business and you are afraid to upset anyone with a controversial product or service.<br/><br/>Big mistake!<br/><br/>The most successful (and interesting!) businesses take a stand and create something different, unique and meaningful for their target market.  You should be no different.  In this 6-minute episode, I outline why I think it is so important to take a stand and do the following things when designing your business:<br/><ol><li>Create from the heart and soul</li><li>Speak clearly and speak the truth</li><li>Know your niche</li><li>Embrace your detractors</li><li>Don't backpeddle</li></ol>\nShare your thoughts, or passionate counter-arguments, at the blog - <a href=\"http://www.escapefromcubiclenation.com\">www.escapefromcubiclenation.com</a>.<br/><br/><br type=\"_moz\"/>",
            "length": "5919265",
            "sourceUrl": "https://traffic.libsyn.com/secure/escapefromcubiclenation/controversy.mp3?dest-id=46993"
        },
        {
            "title": "Cash flow is king",
            "datePublished": "Mon, 19 Mar 2007 22:49:00 +0000",
            "description": "<p>For all of you who have just made your first sale, congratulations!  You should jump up and down and dance a jig at your accomplishment.</p>\n<p>Very soon, however, you will discover that a closed sale does not equal money in your bank account.  Based on personal experience and that which I have learned from smart friends, I share some guidelines for making sure that you plan and contract for a stable cash flow in your new business.  They include things like:</p>\n<ol><li>Carefully study your client's financial terms, conditions and processes </li><li>Plan contracts carefully, with payment milestones clearly identified and contingency plans developed if the scope changes</li><li>Treat your accounts payable contact with ultimate deference and respect, lest you reap the wrath of an accountant scorned </li></ol>\n<p>Please share your horror stories, best practices and tips at the blog:  <a href=\"http://www.escapefromcubiclenation.com\">www.escapefromcubiclenation.com</a></p>",
            "length": "6928203",
            "sourceUrl": "https://traffic.libsyn.com/secure/escapefromcubiclenation/cashisking.mp3?dest-id=46993"
        },
        {
            "title": "Networking tip:  Use the phone!",
            "datePublished": "Mon, 05 Mar 2007 21:58:00 +0000",
            "description": "<p>We all get comfortable using email to introduce ourselves to people we find compelling or share common business interests with.  It is a quick and painless way to connect with people all over the world.</p>\n<p>But with the influx of email in everyone's inbox these days, as an alternative, why don't you try picking up the phone?</p>\n<p>In this episode, I cover some tips for phone networking so that you:</p>\n<ol><li>Know how to professionally and quickly get to the point of the call</li><li>Respect the other person's time</li><li>Make sure it is a mutually beneficial conversation</li></ol>\n<p>Share your thoughts about this at the blog:  <a href=\"http://www.escapefromcubiclenation.com\">www.escapefromcubiclenation.com</a></p>",
            "length": "4128717",
            "sourceUrl": "https://traffic.libsyn.com/secure/escapefromcubiclenation/networkingbyphone.mp3?dest-id=46993"
        },
        {
            "title": "Cut through work paralysis by replacing \"perfect\" with \"good enough\"",
            "datePublished": "Wed, 21 Feb 2007 21:44:00 +0000",
            "description": "If you are anything like me, you sweat the details of your business, wanting to make sure that everything is flawless and of the highest standards.  The problem is, in a rapidly moving world and life, it is impossible to be perfect at everything you do.  In fact, you will most likely stress yourself out and get little done if your standards are so high that you get paralyzed.<br/><br/>In this episode, I invite you to redefine your relationship with perfectionism and invite \"good enough\" as a new standard for releasing work and getting things done.  In order to do this, you will have to:<br/><br/><ol><li>Define different standards for your work<br/></li><li>Prioritize your tasks</li><li>Make tough choices</li></ol>\nBy doing so, you will not only get more done, you will have more fun doing it.  And learn more!<br/><br/>If you have struggled with perfectionism and have some insights, please share them at the blog at <a href=\"http://www.escapefromcubiclenation.com\">www.escapefromcubiclenation.com</a><br/><br type=\"_moz\"/><br/>",
            "length": "6319678",
            "sourceUrl": "https://traffic.libsyn.com/secure/escapefromcubiclenation/Replace_perfect_with_good_enough.mp3?dest-id=46993"
        },
        {
            "title": "Small business marketing advice from expert John Jantsch",
            "datePublished": "Mon, 12 Feb 2007 18:23:00 +0000",
            "description": "Intrigued by questions from many of my blog readers about small business marketing, I thought I would get answers from John Jantsch, one of the most well-respected small business marketing experts in the world.<br/><br/>Do any of these questions ring true for you?<br/><ol><li>If I have never marketed myself before, where do I begin?</li><li>What are the pieces of a total marketing system?</li><li>Why is it so important to define a specific target audience or niche for my services?  Won't this narrow my opportunities?</li><li>What if I loathe marketing?</li><li>Should I launch my brand name if I am not 100% sure I love it?</li><li>Should I start a blog or podcast to market my new business?</li></ol>\nJohn answers these questions and more, as well as some more specific ones like ideas for independent software developers who want to market their products, or how to promote a book.<br/><br/>Please share your thoughts on your interview here or at the blog!  <a href=\"http://www.escapefromcubiclenation.com\">www.escapefromcubiclenation.com</a> <br/><br/>John's website:  <a href=\"http://www.ducttapemarketing.com\">www.ducttapemarketing.com</a><br/>John's blog:  <a href=\"http://\">www.ducttapemarketing.com/weblog.php</a><br/><br type=\"_moz\"/>",
            "length": "8078106",
            "sourceUrl": "https://traffic.libsyn.com/secure/escapefromcubiclenation/johnjantsch.mp3?dest-id=46993"
        },
        {
            "title": "Take the brute force out of your fears by dissecting them",
            "datePublished": "Mon, 29 Jan 2007 21:01:00 +0000",
            "description": "All aspiring entrepreneurs have fears about starting a business.  Such as:<br/><ol><li>No one will ever buy my product or service</li><li>I do not have enough experience to start a business</li><li>All my competitors have superior products (besides which, they are smarter and/or better looking)</li></ol>\nSome people stay paralyzed and never move forward, while others find ways to overcome their fears and experience success.<br/><br/>In this episode, I walk you through a specific exercise that you can use to diagnose and alleviate your fears.  <br/><br/>You may want to listen to it when you are sitting at a desk where you can scribble notes, or in front of your computer where you can create a simple table.<br/><br/>Enjoy and let me know your own results by dropping me a line at <a href=\"http://\">pcs@ganas.com</a> or leaving a comment on the blog at <a href=\"http://www.escapefromcubiclenation.com\">www.escapefromcubiclenation.com</a> <br/>",
            "length": "1606427",
            "sourceUrl": "https://traffic.libsyn.com/secure/escapefromcubiclenation/Take_the_brute_force_out_of_your_fears.mp3?dest-id=46993"
        },
        {
            "title": "Interview with Martha Beck:  Your left toe holds the clue to your right life",
            "datePublished": "Mon, 15 Jan 2007 14:23:00 +0000",
            "description": "<p>Departing from the regular, brief bursts of information in this podcast, this interview is a 40 minute conversation with Martha Beck, author of the New York Times bestselling book <strong>Finding Your Own North Star:  Claiming the Life You Were Meant to Live</strong> and monthly columnist for Oprah's <strong>O Magazine</strong>.</p>\n<p>Martha provides lively and insighful information about how to figure out the work you are meant to do, a critical step in deciding which business to start as a new entrepreneur.  Her approach may surprise you, and I guarantee it will make you think.</p>\n<p>If you have comments or observations about this podcast, please leave them at the blog, <a href=\"http://www.escapefromcubiclenation.com\">www.escapefromcubiclenation.com</a>.  Or send me an email at <a href=\"mailto:pcs@ganas.com\">pcs@ganas.com</a>.</p>\n<p>You can find Martha at <a href=\"http://www.marthabeck.com\">www.marthabeck.com</a>.</p>\n<p>From this point forward, I will be publishing longer interviews like this one once a month.  I welcome your feedback about this format change.</p>",
            "length": "10563106",
            "sourceUrl": "https://traffic.libsyn.com/secure/escapefromcubiclenation/Interview_with_Martha_Beck.mp3?dest-id=46993"
        },
        {
            "title": "Stop playing small",
            "datePublished": "Mon, 01 Jan 2007 11:00:00 +0000",
            "description": "It is easy to get in the habit of being the \"person behind the curtain,\" creating fame and glory for charismatic clients, executives and spouses.  But when we choose to play small, we limit our lives to \"next best\" and miss the opportunity for great contribution to the world and personal joy and satisfaction.<br/><br/>In this episode, I share some of my own experiences with playing small and the tremendous surge of energy and abundance I experienced when I decided to play bigger.<br/><br/>Why not decide to play big this year?<br/>",
            "length": "4763176",
            "sourceUrl": "https://traffic.libsyn.com/secure/escapefromcubiclenation/Escape_Podcast_-_Stop_playing_small.mp3?dest-id=46993"
        },
        {
            "title": "When is your brand \"good enough\" to start marketing?",
            "datePublished": "Mon, 18 Dec 2006 21:53:00 +0000",
            "description": "If you are just starting to market your business, you might feel a little exasperated when trying to choose a perfect brand name.  It may feel like until you do this, you can't move forward with any marketing plans and you feel stuck and frustrated.<br/><br/>In this episode, I cover:<br/><ol><li>What a good branding process should look like</li><li>Which marketing activities you can undertake before your brand is fully baked</li><li>Which marketing activities you should hold off on until you are 80% or more satisfied with your brand</li></ol>\nI also mention a few resources:<br/><br/>My second podcast <a href=\"http://escapefromcubiclenation.libsyn.com/index.php?post_id=133070\">First plan your life, then plan your business</a><br/>Great brand naming resource:  <a href=\"http://www.namedevelopment.com/\">namedevelopment.com</a><br/>Example of a great brand:  <a href=\"http://www.legalsanity.com\">Legal Sanity</a><br/>Guy Kawasaki's book <a href=\"http://www.amazon.com/Art-Start-Time-Tested-Battle-Hardened-Starting/dp/1591840562/sr=8-1/qid=1166479447/ref=pd_bbs_sr_1/102-4066425-1378567?ie=UTF8&s=books\">Art of the Start</a><br/>Marketing/branding resources for coaches:<br/>Andrea Lee's book <a href=\"http://www.multiplestreamsofcoachingincome.com/\">Multiple Streams of Coaching Income</a><br/>Suzanne Falter-Barns' site <a href=\"http://www.getknownnow.com\">getknownnow.com</a><br/><br/>Please let me know what you think about this topic on the blog!  <a href=\"http://www.escapefromcubiclenation.com\">escapefromcubiclenation.com</a><br/>(I know at least a few of you will really disagree with my approach - let's hash it out!)<br type=\"_moz\"/><br/><br/>",
            "length": "7194905",
            "sourceUrl": "https://traffic.libsyn.com/secure/escapefromcubiclenation/Escape_Podcast_-_When_is_your_brand_good_enough.mp3?dest-id=46993"
        },
        {
            "title": "Proud member of the Island of Misfit Toys",
            "datePublished": "Mon, 04 Dec 2006 10:00:00 +0000",
            "description": "Do you often feel like the oddball in your family, your job or your profession?<br/><br/>Drawing on inspiration from the \"Island of the Misfit Toys\" from the 1964 classic movie Rudolph the Rednosed Reindeer, I outline ways to:<br/><ol><li>Celebrate your unique quirks, differences and personal history</li><li>Tie them in with needs in your market</li><li>Be proud of the misfit you are and reflect it in an authentic and kickass brand!</li></ol>\n\nFor those that are fans of the movie, I found a really fun link with some of the back story of the characters and how it was made:  <a href=\"http://www.tvparty.com/xmasrudolph.html\">Rudolf:  Behind the Scenes</a><br/><br type=\"_moz\"/>",
            "length": "7107122",
            "sourceUrl": "https://traffic.libsyn.com/secure/escapefromcubiclenation/Escape_Podcast_-_Proud_member_of_the_Island_of_Misfit_Toys.mp3?dest-id=46993"
        },
        {
            "title": "The customer likeability factor",
            "datePublished": "Mon, 20 Nov 2006 18:19:00 +0000",
            "description": "Knowing what business to start is a huge question for many aspiring entrepreneurs.  Aside from examining your own passions and interests, you can gain great insight into this question by thinking about your ideal customer in the following dimensions:<br/><br/><ol><li>Who would I <span style=\"font-style: italic;\">genuinely lik</span>e to work with?  What characteristics do they share?</li><li>What impact would my product or service have on their life?  How does it feel to know I am having a positive impact?<br/></li><li>How would I feel talking about my business with these customers?  <br/></li></ol>\n\n\nSee how the \"customer likeability factor\" impacts your decisions about what business to start.  Please share your thoughts on the blog!  <a href=\"http://\">www.escapefromcubiclenation.com</a><br type=\"_moz\"/>",
            "length": "5346265",
            "sourceUrl": "https://traffic.libsyn.com/secure/escapefromcubiclenation/Escape_Podcast_-_The_customer_likeability_factor.mp3?dest-id=46993"
        },
        {
            "title": "The curse of competence",
            "datePublished": "Mon, 06 Nov 2006 20:41:00 +0000",
            "description": "<p>Do you do something very well, get recognition and rewards for it but feel very burned out and dead when you practice it?  You may suffer the curse of competence, a deadly trap for aspiring entrepreneurs.  </p>\n<p>This episode discusses how to avoid starting a business based on a skill or ability you are burned out on.  It can seem the easy path to money, but often leads to real frustration and apathy.</p>\n<p>Some strategies discussed:</p>\n<ol><li>Disconnect the ability from the job description</li><li>Create a personal development plan to give yourself time to learn new skills</li><li>Consider a mix of \"curse of competence\" and new skills to kick-start your business</li></ol>\n<p>I'd love to hear your comments on the blog - <a href=\"http://www.escapefromcubiclenation.com/\">www.escapefromcubiclenation.com</a></p>\n<p> </p>\n<p> </p>",
            "length": "4039284",
            "sourceUrl": "https://traffic.libsyn.com/secure/escapefromcubiclenation/curseofcompetence.mp3?dest-id=46993"
        },
        {
            "title": "Beat negative self-talk when starting a business",
            "datePublished": "Mon, 23 Oct 2006 20:56:00 +0000",
            "description": "<p>Two of the most critical elements of becoming a successful entrepreneur are developing a positive mental attitude and defeating negative self-talk.  This is important to not only produce great business results, but also to enjoy the day-to-day process of building your business.</p>\n<p>In this episode, I discuss two elements of a postive mental attitude:</p>\n<ol><li>Distinguishing between your \"essential\" self and your \"social\" self to ensure you are doing work you are meant to do</li><li>Using a simple 4-question process called \"The Work\" to overcome negative self-talk</li></ol>\n<p>Sources I refer to are Martha Beck's book <a href=\"http://www.amazon.com/Finding-Your-Own-North-Star/dp/0812932188/sr=8-1/qid=1161639743/ref=pd_bbs_sr_1/002-3407614-7736848?ie=UTF8\">Finding Your Own North Star:  claiming the life you were meant to live</a> and Byron Katie's <a href=\"http://www.amazon.com/Loving-What-Questions-Change-Life/dp/1400045371/sr=1-1/qid=1161639827/ref=sr_1_1/002-3407614-7736848?ie=UTF8&s=books\">Loving What Is:  Four questions that can change your life</a> </p>\n<p>Leave comments at <a href=\"http://www.escapefromcubiclenation.com/\">www.escapefromcubiclenation.com</a></p>",
            "length": "8652746",
            "sourceUrl": "https://traffic.libsyn.com/secure/escapefromcubiclenation/Escape_podcast_-_Beat_negative_self-talk.mp3?dest-id=46993"
        },
        {
            "title": "Reduce your marketing dread",
            "datePublished": "Mon, 09 Oct 2006 10:00:00 +0000",
            "description": "<p>In this episode, I cover three things that help new entrepreneurs overcome their dread of all things marketing:</p>\n<ol><li>Readjusting your marketing mindset</li><li>Clearly defining a niche</li><li>Selecting and creating a marketing plan</li></ol>\n<p>I reference two helpful marketing experts:</p>\n<p>Robert Middleton from <a href=\"http://www.actionplan.com\">www.actionplan.com</a> and </p>\n<p>John Jansch from <a href=\"http://www.ducttapemarketing.com\">www.ducttapemarketing.com</a> </p>",
            "length": "6564602",
            "sourceUrl": "https://traffic.libsyn.com/secure/escapefromcubiclenation/Escape_Podcast_-_Reduce_marketing_dread.mp3?dest-id=46993"
        },
        {
            "title": "How do I choose which business to start?",
            "datePublished": "Mon, 25 Sep 2006 19:46:00 +0000",
            "description": "<p>Many people have questions about which business to start.  But most approach the task from the wrong angle, believing that if they just think about it enough that the answer will magically appear.</p>\n<p>In this episode, Pam covers:</p>\n<ol><li>A myth about the process of deciding which business to start</li><li>Insight into why it is such a difficult quest for veteran corporate employees </li><li>A (fun) homework assignment to get some insight into the best business idea for you </li></ol>",
            "length": "6244883",
            "sourceUrl": "https://traffic.libsyn.com/secure/escapefromcubiclenation/Escape_Podcast_-_What_kind_of_business_should_you_start.mp3?dest-id=46993"
        },
        {
            "title": "Escape Podcast - Plan your life then your business",
            "datePublished": "Mon, 11 Sep 2006 18:53:00 +0000",
            "description": "<p>This episode covers the importance of thinking about the kind of life that would make you happy, healthy, stable and fulfilled <em>before </em>you run down the road of creating a business plan.  I include an easy-to-complete exercise with just enough \"woo woo\" to make you relax in your cube.</p>\n<p><u></u></p>",
            "length": "1047715",
            "sourceUrl": "https://traffic.libsyn.com/secure/escapefromcubiclenation/Escape_Podcast_-_Plan_your_life_then_your_business.mp3?dest-id=46993"
        },
        {
            "title": "Escape Podcast - First episode",
            "datePublished": "Mon, 28 Aug 2006 18:45:00 +0000",
            "description": "<p>This episode introduces the purpose and intent of the Escape from Cubicle Nation Podcast.  It will build on content I write on my blog <a href=\"http://www.escapefromcubiclenation.com/\">www.escapefromcubiclenation.com</a> as well as include interviews with interesting, informative, passionate and creative people who know more than a thing or two about entrepreneurship.</p>\n<p><u></u></p>",
            "length": "1835370",
            "sourceUrl": "https://traffic.libsyn.com/secure/escapefromcubiclenation/Escape_Podcast_-_First_episode.mp3?dest-id=46993"
        }
    ]
}