{
    "artwork": "http://is2.mzstatic.com/image/thumb/Music117/v4/d1/6a/8e/d16a8ed8-9423-3565-e063-b64a4c4211fd/source/100x100bb.jpg",
    "description": "Hosted by Dr. Jennifer Caudle, Everyday Family Medicine brings you the most practical and relevant updates for clinicians on the front lines of health care. With insightful topics spanning age, health, and lifestyle spectra, Everyday Family Medicine is the go-to resource for enhancing your everyday practice.    ",
    "feedURL": "https://reachmd.com/rss/itunes/308/?nocache",
    "podcastURL": "http://reachmd.com/programs/everyday-family-medicine/",
    "title": "Everyday Family Medicine",
    "episodes": [
        {
            "title": "Vaccinations: How Can HCPs Respond to Patients Choosing Not to Get Them?\n",
            "datePublished": "Wed, 03 Jul 2019 00:00:00 -0400",
            "description": "\n\nGuest: Jennifer Caudle, DO <br>\n\n\n  <p>It’s an unfortunate reality that an increasing number of patients are refusing to get vaccinated—regardless of whether that’s the recommendation for themselves or their children. But luckily, there are ways you can talk to your patients about this, as Dr. Jennifer Caudle explains.</p>",
            "length": "900702",
            "sourceUrl": "http://reachmd.com/programs/primary-care-today/vaccinations-how-can-hcps-respond-to-patients-choosing-not-to-get-them/10840/podcast/20034.mp3?partner=itunes"
        },
        {
            "title": "Heat Exhaustion vs. Heatstroke: How to Tell the Difference\n",
            "datePublished": "Wed, 03 Jul 2019 00:00:00 -0400",
            "description": "\n\nHost: Jennifer Caudle, DO <br>\n\n\n  <p>It can be easy to think of heat exhaustion and heatstroke as the same condition, but there’s a key difference between the two that we need to help our patients understand, especially during the warm summer months.</p>",
            "length": "900702",
            "sourceUrl": "http://reachmd.com/programs/everyday-family-medicine/heat-exhaustion-vs-heatstroke-how-to-tell-the-difference/10841/podcast/20026.mp3?partner=itunes"
        },
        {
            "title": "Is Primary Care Taking Full Advantage of Physical Therapy?\n",
            "datePublished": "Fri, 07 Jun 2019 00:00:00 -0400",
            "description": "\n\nHost: Jennifer Caudle, DO <br>\n\nGuest: Catherine Apicella, MPT, PYT-C, PRPC <br>\n\n\n  <p>With less and less primary care physicians partnering with physical therapists, it’s time we ask: are we doing ourselves—and our patients—a disservice by <em>not</em> taking advantage of this option? To find out, Dr. Jennifer Caudle sits down with physical therapist Catherine Apicella to discuss the often-overlooked benefits of physical therapy and how primary care physicians and physical therapists can work together to benefit their patients.</p>",
            "length": "7500539",
            "sourceUrl": "http://reachmd.com/programs/everyday-family-medicine/is-primary-care-taking-full-advantage-of-physical-therapy/10786/podcast/19944.mp3?partner=itunes"
        },
        {
            "title": "How Pelvic Floor Physical Therapy Can Help MS Patients\n",
            "datePublished": "Tue, 12 Mar 2019 00:00:00 -0400",
            "description": "\n\nHost: Jennifer Caudle, DO <br>\n\nGuest: Catherine Apicella, MPT, PYT-C, PRPC <br>\n\nGuest: Crystal Gouldey <br>\n\n\n  <p>Frustrating multiple sclerosis (MS) symptoms like urinary frequency and incontinence can be detrimental to a patient’s quality of life, but there are resources available to help. To explore the benefits of pelvic floor physical therapy for MS, Dr. Jennifer Caudle sits down with two special guests: physical therapist Catherine Apicella from CORE 3 Physical Therapy and her patient—and ReachMD’s very own employee—Crystal Gouldey. </p>",
            "length": "7800686",
            "sourceUrl": "http://reachmd.com/programs/everyday-family-medicine/how-pelvic-floor-physical-therapy-can-help-ms-patients/10702/podcast/19662.mp3?partner=itunes"
        },
        {
            "title": "An Advanced Uterine Fibroid Treatment Option for Your Patients\n",
            "datePublished": "Fri, 25 Jan 2019 00:00:00 -0500",
            "description": "\n\nHost: Jennifer Caudle, DO <br>\n\nGuest: John C. Lipman, MD, FSIR <br>\n\n\n  <p>Every 10 minutes, 12 hysterectomies are performed. But Dr. John Lipman, an interventional radiologist from the Atlanta Fibroid Center, believes fibroid treatment can be done with a minimally invasive approach. While speaking with Dr. Jennifer Caudle, not only does he explain his mission to restore his patients’ confidence and femininity, but also his passion for educating those with uterine fibroids.</p>",
            "length": "8100571",
            "sourceUrl": "http://reachmd.com/programs/everyday-family-medicine/an-advanced-uterine-fibroid-treatment-option-for-your-patients/10629/podcast/19539.mp3?partner=itunes"
        },
        {
            "title": "Suicide Awareness: CDC Vital Signs\n",
            "datePublished": "Wed, 19 Sep 2018 00:00:00 -0400",
            "description": "\n\nHost: Jennifer Caudle, DO <br>\n\n\n  <p>Tune in as Dr. Jennifer Caudle provides an update on suicide rates in the United States.</p>",
            "length": "901225",
            "sourceUrl": "http://reachmd.com/programs/everyday-family-medicine/suicide-awareness-cdc-vital-signs/10358/podcast/18852.mp3?partner=itunes"
        },
        {
            "title": "Raising Mental Health Awareness\n",
            "datePublished": "Wed, 12 Sep 2018 00:00:00 -0400",
            "description": "\n\nHost: Jennifer Caudle, DO <br>\n\n\n  <p>Mental health affects so much of a patient's wellbeing, but unfortunately, the importance of mental health is often overlooked. Dr. Jennifer Caudle joins us to review a deeper dive on mental health statistics. </p>",
            "length": "904620",
            "sourceUrl": "http://reachmd.com/programs/everyday-family-medicine/raising-mental-health-awareness/10354/podcast/18829.mp3?partner=itunes"
        },
        {
            "title": "The Importance of Immunizations\n",
            "datePublished": "Wed, 12 Sep 2018 00:00:00 -0400",
            "description": "\n\nHost: Jennifer Caudle, DO <br>\n\n\n  <p>August is National Immunization Awareness Month sponsored by the National Public Health Information Coalition. Dr. Jennifer Caudle discusses the important role immunizations play in healthcare.</p>",
            "length": "902792",
            "sourceUrl": "http://reachmd.com/programs/everyday-family-medicine/the-importance-of-immunizations/10355/podcast/18800.mp3?partner=itunes"
        },
        {
            "title": "How Does Plaque Psoriasis Affect Patients?\n",
            "datePublished": "Mon, 20 Aug 2018 00:00:00 -0400",
            "description": "\n\nHost: Jennifer Caudle, DO <br>\n\n\n  <p>For the two percent of Americans diagnosed with psoriasis, proper <em>and</em> individualized treatment is essential in improving a patient’s quality of life, as Dr. Jennifer Caudle explains.</p>",
            "length": "904359",
            "sourceUrl": "http://reachmd.com/programs/everyday-family-medicine/how-does-psoriasis-affect-patients/10356/podcast/18761.mp3?partner=itunes"
        },
        {
            "title": "Raising Awareness of Sickle Cell Disease\n",
            "datePublished": "Mon, 20 Aug 2018 00:00:00 -0400",
            "description": "\n\nHost: Jennifer Caudle, DO <br>\n\n\n  <p>The month of September is dedicated to raising awareness of sickle cell disease, which affects approximately 70,000 to 100,000 Americans each year. Here to tell us more about this prevalent condition and the various resources available is Dr. Jennifer Caudle.</p>",
            "length": "902531",
            "sourceUrl": "http://reachmd.com/programs/everyday-family-medicine/raising-awareness-of-sickle-cell-disease/10357/podcast/18759.mp3?partner=itunes"
        },
        {
            "title": "Impacts of Prolonged Screen Time on Children's Health\n",
            "datePublished": "Thu, 07 Jun 2018 00:00:00 -0400",
            "description": "\n\nHost: Jennifer Caudle, DO <br>\n\nGuest: Sarah E. Domoff, PhD <br>\n\n\n  <p>To address the growing issue of prolonged screen time and media use among children, Dr. Jennifer Caudle speaks with Dr. Sarah Domoff, Director of the Family Health Lab at Central Michigan University, about the tools available to help physicians identify and curb screen addiction.</p>",
            "length": "9000751",
            "sourceUrl": "http://reachmd.com/programs/everyday-family-medicine/impacts-of-prolonged-screen-time-on-childrens-health/10166/podcast/18436.mp3?partner=itunes"
        },
        {
            "title": "Ocular Manifestations of Rheumatological Conditions\n",
            "datePublished": "Thu, 24 May 2018 00:00:00 -0400",
            "description": "\n\nHost: Jennifer Caudle, DO <br>\n\nGuest: Anne Negrin, MD <br>\n\n\n  <p>Since eye issues are becoming increasingly common in patients with rheumatological conditions, it’s now more vital than ever that physicians are aware of their common symptoms. Joining Dr. Jennifer Caudle is Dr. Anne Negrin, an ophthalmologist in New York, to break down these symptoms and to focus on rheumatological concerns that ophthalmologists see in practice. </p>",
            "length": "9003625",
            "sourceUrl": "http://reachmd.com/programs/everyday-family-medicine/ocular-manifestations-of-rheumatological-conditions/10162/podcast/18389.mp3?partner=itunes"
        },
        {
            "title": "Lupus Management Considerations for African American Patients\n",
            "datePublished": "Tue, 08 May 2018 00:00:00 -0400",
            "description": "\n\nHost: Jennifer Caudle, DO <br>\n\nGuest: Ashira Blazer, MD <br>\n\n\n  <p><span class=\"mceitemhiddenspellword\"><span>Did you know that African Americans are three times as likely to be diagnosed with lupus than other demographic groups? To make matters worse, being diagnosed with lupus doubles their risk of kidney disease, stroke, and heart attacks.</span></span></p> <p><span class=\"mceitemhiddenspellword\"><span>To address this growing health threat among African Americans, Dr. Jennifer Caudle is joined by </span></span><span class=\"mceitemhidden\"><span>Dr. </span><span class=\"mceitemhiddenspellword\"><span>Ashira</span></span></span><span class=\"mceitemhidden\"><span> Blazer, Instructor in the Department of Medicine and </span><span class=\"mceitemhiddenspellword\"><span>Rheumatologist</span></span></span><span class=\"mceitemhidden\"><span> at </span><span class=\"mceitemhiddenspellword\"><span>NYU</span></span></span><span class=\"mceitemhidden\"><span> </span><span class=\"mceitemhiddenspellword\"><span>Langone</span></span></span><span class=\"mceitemhidden\"><span> Health, to discuss diagnosis, comorbidities, and various treatment options for your lupus patients.</span></span></p> <p>Correction Note: Dr. Blazer has updated that in the U.S., variation homozygosity for APOL1 is present in 13% of the African American population.</p>",
            "length": "7200653",
            "sourceUrl": "http://reachmd.com/programs/everyday-family-medicine/lupus-management-considerations-for-african-american-patients/10132/podcast/18310.mp3?partner=itunes"
        },
        {
            "title": "Addressing the Challenges of Influenza Vaccination on US College Campuses\n",
            "datePublished": "Fri, 09 Feb 2018 00:00:00 -0500",
            "description": "\n\nHost: Jennifer Caudle, DO <br>\n\nGuest: Lisa Ipp, MD <br>\n\n\n  <p>Although most college students in the U.S. believe it is important to get an annual influenza vaccine, less than half say they typically get vaccinated, according to results from a new National Foundation for Infectious Diseases (NFID) survey. Motivating college students to get their annual flu vaccinations remains a public health challenge that many health care officials have struggled to overcome.</p> <p>Host Dr. Jennifer Caudle chats with Dr. Lisa Ipp about the results and takeaways from this survey and what methods and strategies would be the most effective in encouraging more students to get vaccinated.</p> <p>Dr. Ipp is a Associate Professor of Clinical Pediatrics at Weill Cornell Medicine and Associate Director of Adolescent Medicine at New York-Presbyterian Komansky Children’s Hospital. She also serves as a board member for the National Foundation for Infectious Diseases (NFID)</p>",
            "length": "7501322",
            "sourceUrl": "http://reachmd.com/programs/everyday-family-medicine/addressing-the-challenges-of-influenza-vaccination-on-us-college-campuses/10005/podcast/18005.mp3?partner=itunes"
        },
        {
            "title": "The Identity Crisis for Healthcare Brands\n",
            "datePublished": "Wed, 05 Jul 2017 00:00:00 -0400",
            "description": "\n\nHost: Jennifer Caudle, DO <br>\n\nGuest: Vince Parry <br>\n\n\n  <p>In today’s digital world, the way that people interact with health care is very different than in the past. Guest Vince Parry, President and Chief Branding Officer at Parry Branding Group, says there are fundamental problems in the way healthcare companies and their advertising agencies currently market health and wellness brands across digital media. Host Dr. Jennifer Caudle will lead a discussion of the current brand “identity crisis” and how healthcare brands can better capitalize on the current digital landscape to improve outcomes. </p>",
            "length": "12602776",
            "sourceUrl": "http://reachmd.com/programs/everyday-family-medicine/identity-crisis-healthcare-brands/9604/podcast/17163.mp3?partner=itunes"
        },
        {
            "title": "The Benefits of In-Home Palliative Care\n",
            "datePublished": "Thu, 08 Jun 2017 00:00:00 -0400",
            "description": "\n\nHost: Jennifer Caudle, DO <br>\n\nGuest: Evan Rubin, DO <br>\n\n\n  <p>Palliative care patients who received in-home, interdisciplinary care could be less likely to need emergency room visits or get admitted to the hospital than those receiving more standard home care. On today’s program, host Dr. Jennifer Caudle will be joined by Dr. Evan Rubin, an internal medicine doctor with Visiting Physician Services, to focus on this unique model for palliative care, how it can improve the quality of life for patients, and its cost reductions on the healthcare system. </p>",
            "length": "7802253",
            "sourceUrl": "http://reachmd.com/programs/everyday-family-medicine/benefits-of-in-home-palliative-care/9581/podcast/17136.mp3?partner=itunes"
        },
        {
            "title": "Spatulas over Scalpels: Teaching Medical Students the Language of Food\n",
            "datePublished": "Sat, 08 Apr 2017 00:00:00 -0400",
            "description": "\n\nHost: Jennifer Caudle, DO <br>\n\nGuest: Leah Sarris, RD, LDN <br>\n\n\n  <p>It's important for physicians to know how to talk to their patients about healthy eating habits and smart dietary choices, which can be a difficult conversation to have. Tulane Medical School is trying to overcome this obstacle by teaching their medical students how to cook, hoping that it translates into better communication with patients in the future.</p> <p>Host Dr. Jennifer Caudle explores this innovative program with Chef Leah Sarris, a registered dietitian and Director of Operations and Executive Chef at the Goldring Center for Culinary Medicine at Tulane University School of Medicine. They talk about ways in which teaching culinary medicine to medical students is leading to healthy eating habits and improved outcomes for the larger community.</p> <p class=\"MsoNormal\"> </p>",
            "length": "8402286",
            "sourceUrl": "http://reachmd.com/programs/everyday-family-medicine/spatulas-over-scalpels-teaching-medical-students-language-food/9503/podcast/16971.mp3?partner=itunes"
        },
        {
            "title": "De-Stress for Success: 10 Tips to Conquer Stress\n",
            "datePublished": "Mon, 03 Apr 2017 00:00:00 -0400",
            "description": "\n\nHost: Jennifer Caudle, DO <br>\n\n\n  <p>Women today often feel fed up, overwhelmed, overworked and completely stressed out. What can physicians do to help patients manage this stress?</p> <p>Host Dr. Jennifer Caudle chats with Dr. Tiffany Lowe-Payne, a family physician, Founder &amp; CEO of the Institute of Transformational Health and Wellness Inc, and author of the book,<em> A Woman’s Guide To De-Stress For Success: 10 Tips to Conquer Stress and Live at Your Best.</em></p> <p>They talk about how busy women can find balance and transform their lives from the inside out.</p>",
            "length": "11402710",
            "sourceUrl": "http://reachmd.com/programs/everyday-family-medicine/destress-success-10-tips-conquer-stress/9453/podcast/16964.mp3?partner=itunes"
        },
        {
            "title": "End-of-Life Care: A Physician's Guide to Helping Families\n",
            "datePublished": "Fri, 24 Mar 2017 00:00:00 -0400",
            "description": "\n\nHost: Jennifer Caudle, DO <br>\n\n\n  <p>The burden of deciding end-of-life care often falls on family and friends when patients are no longer able to make decisions regarding their own care. What do physicians need to know when guiding families through these tough situations?</p> <p>Host Dr. Jennifer Caudle is joined by Dr. Marianne Holler, Medical Director of Hospice and Palliative Programs for the VNA Health Group of New Jersey. They talk about what physicians can do to aid families when faced with end-of-life decisions.</p> <p class=\"MsoNormal\"> </p> <p class=\"MsoNormal\"> </p>",
            "length": "10500702",
            "sourceUrl": "http://reachmd.com/programs/everyday-family-medicine/end-of-life-care-physicians-guide-to-helping-families/8571/podcast/16931.mp3?partner=itunes"
        },
        {
            "title": "The Doctor Is In [Another Career]: Nonclinical Jobs and How to Find Them\n",
            "datePublished": "Fri, 10 Mar 2017 00:00:00 -0500",
            "description": "\n\nHost: Jennifer Caudle, DO <br>\n\nGuest: Heidi Moawad, MD <br>\n\n\n  <p>A physician’s career has more flexibility than ever to extend beyond patient care. Health care providers can also use their medical backgrounds to pursue jobs in healthcare management, public policy, education, research and other career paths not directly related to clinical practice. But how do doctors find these nonclinical opportunities?</p> <p>Joining Dr. Jennifer Caudle is Dr. Heidi Moawad, a neurologist and adjunct professor at John Carroll University in Cleveland, Ohio. Dr. Moawad is creator of the website, nonclinicaldoctors.com, and author of the book,<em> Careers Beyond Clinical Medicine</em>. They talk about the many nonclinical jobs available to doctors and how to find them.</p>",
            "length": "7500539",
            "sourceUrl": "http://reachmd.com/programs/everyday-family-medicine/doctor-is-in-another-career-nonclinical-jobs-and-how-find-them/8633/podcast/16907.mp3?partner=itunes"
        },
        {
            "title": "Sleep Apnea in Children: Identification and Treatment Pathways\n",
            "datePublished": "Sat, 04 Feb 2017 00:00:00 -0500",
            "description": "\n\nHost: Jennifer Caudle, DO <br>\n\n\n  <p class=\"MsoNormal\">Sleep apnea in children can lead to many behavioral, school and social problems. Recent research has even suggested that children who snore loudly were found to be twice as likely to have learning problems as children who don’t snore. What can be done to minimize sleep apnea in children?</p> <p> </p> <p class=\"MsoNormal\">On this episode of Everyday Family Medicine, Dr. Jennifer Caudle speaks with Dr. Diana Batoon, dentist and founder of Bonita Dental in Scottsdale, Arizona. Dr. Batoon has devoted much of her dental practice and public education efforts around identifying and treating sleep apnea in children.</p>",
            "length": "3002514",
            "sourceUrl": "http://reachmd.com/programs/everyday-family-medicine/sleep-apnea-children-identification-treatment-pathways/8548/podcast/16773.mp3?partner=itunes"
        },
        {
            "title": "Treating Women With Fibroids: Medical, Surgical, and Psychological Priorities\n",
            "datePublished": "Mon, 10 Oct 2016 00:00:00 -0400",
            "description": "\n\nHost: Jennifer Caudle, DO <br>\n\n\n  <p>Joining Dr. Jennifer Caudle to share insights about fibroid treatment updates and counseling methods is Dr. Jessica Shepherd, Assistant Professor of OB/GYN and Director of Minimally Invasive Gynecology at the University of Illinois in Chicago. Dr. Shepherd is the founder of HerViewpoint.com, <span>an online forum for women designed to discuss all those women's health topics that are difficult to raise in doctors' offices.</span></p>",
            "length": "8700604",
            "sourceUrl": "http://reachmd.com/programs/everyday-family-medicine/treating-women-with-fibroids-medical-surgical-psychological-priorities/8285/podcast/16372.mp3?partner=itunes"
        },
        {
            "title": "11 Essential Foods for Infants and Children: Guidelines to Healthy Eating \n",
            "datePublished": "Mon, 12 Sep 2016 00:00:00 -0400",
            "description": "\n\nHost: Jennifer Caudle, DO <br>\n\n\n  <p>Parents today are bombarded with confusing and sometimes harmful information in regard to which foods are best to give their kids. Nutritional guidelines are constantly changing and parents don’t know who to trust for medically sound and proven advice that works.</p> <p>Host Dr. Jennifer Caudle sits down with Dr. Tanya Altmann, pediatrician, founder of Calabasas Pediatrics, and author of the book, <em>What to Feed Your Baby: A Pediatrician’s Guide to the 11 Essential Foods to Guarantee Veggie-Loving, No Fuss, Healthy Eating Kids.</em> The two talk about the importance of introducing children to healthy eating habits from an early age to ensure a good eating adult lifestyle.</p>",
            "length": "9900669",
            "sourceUrl": "http://reachmd.com/programs/everyday-family-medicine/11-essential-foods-for-children-guidelines-healthy-eating/8259/podcast/16195.mp3?partner=itunes"
        },
        {
            "title": "Zika Virus Update: The Family Doc's Guide to Recognition and Treatment\n",
            "datePublished": "Tue, 30 Aug 2016 00:00:00 -0400",
            "description": "\n\nHost: Jennifer Caudle, DO <br>\n\n\n  <p>News about the Zika virus have dominated health headlines, but understandings about the full range of viral transmission routes, symptomatology, complications, and rising endemic zones remain unclear for many clinicians.</p> <p>Joining Dr. Jennifer Caudle for updates in recognitions and treatment for Zika virus infection is Dr. Kecia Gaither, practicing OB/GYN and m<span>aternal fetal medicine specialist, </span>and perinatal consultant at St. Lukes Hospital in Kansas City, Missouri. <span>Most recently, Dr. Gaither served as Director of Perinatal Outreach at Montefiore Medical Center and Albert Einstein College of Medicine. Prior to this post, she served as the Vice Chairman and Director of Maternal Fetal Medicine in the Department of Obstetrics &amp; Gynecology at Brookdale University Hospital and Medical Center. Dr. Gaither earned her MPH in health policy and management at Columbia University.</span></p>",
            "length": "7800686",
            "sourceUrl": "http://reachmd.com/programs/everyday-family-medicine/zika-virus-update-the-family-docs-guide-recognition-treatment/8284/podcast/16169.mp3?partner=itunes"
        },
        {
            "title": "Delivering Safer Pain Management Options in an Era of Opioid Abuse\n",
            "datePublished": "Mon, 15 Aug 2016 00:00:00 -0400",
            "description": "\n\nHost: Jennifer Caudle, DO <br>\n\n\n  <p>Addictions to opioids have soared since the 1990's. It's now estimated that as many as 36 million people worldwide abuse opiods. The medical community not only assumes the heavy responsibility of confronting this epidemic in clinical practice, but also shoulders a significant amount of blame from the general public for overprescribing opioid medications. Where should clinicians on the front lines of care start to address both the clinical priorities and the encumbent social responsibilities of opioid abuse?</p> <p>Dr. Anita Gupta, Associate Professor and Vice Chair of the Division of Pain Medicine in the Department of Anesthesiology at Drexel University School of Medicine, joins Dr. Jennifer Caudle to discuss the call to action for safer pain management in this era of prescription drug abuse.</p>",
            "length": "9000490",
            "sourceUrl": "http://reachmd.com/programs/everyday-family-medicine/delivering-safer-pain-management-options-in-era-opioid-abuse/8258/podcast/16108.mp3?partner=itunes"
        },
        {
            "title": "The Rise of Mood Tracking: How Big Data Can Transform Psychiatry\n",
            "datePublished": "Mon, 08 Aug 2016 00:00:00 -0400",
            "description": "\n\nHost: Jennifer Caudle, DO <br>\n\n\n  <p>Mood tracking, a novel integration of technology with psychiatric care to track mental status changes over time, has the potential to fundamentally change how clinicians treat behavioral health disorders. Will smartphone apps become the vehicle for this technology to the wider masses?</p> <p>Dr. Adam Kaplin, Principle Psychiatric Consultant to the Johns Hopkins Multiple Sclerosis and Transverse Myelitis Centers of Excellence, is the founder and inventor of Mood 24/7, a mobile app that allows people to record their mood daily and share this data with their health care providers to provide better accuracy in reporting mood symptoms. He joins Dr. Jennifer Caudle to discuss the emergence of mood tracking portals such as Mood 24/7 and the ways they can transform mental health care.</p>",
            "length": "8702433",
            "sourceUrl": "http://reachmd.com/programs/everyday-family-medicine/the-rise-of-mood-tracking-how-big-data-can-transform-psychiatry/8205/podcast/16038.mp3?partner=itunes"
        },
        {
            "title": "How Information Technology Will Revolutionize Mental Health Care\n",
            "datePublished": "Mon, 01 Aug 2016 00:00:00 -0400",
            "description": "\n\nHost: Matt Birnholz, MD <br>\n\n\n  <p>Psychiatry gets a bad rep for being one of the more \"technophobic\" fields in clinical medicine. This negative association stems in part to the difficulty in tracking changes in mood, cognition, and certain behaviors over time. But there is a growing contingency of psychiatric clinicians who are bringing technology into this specialty to help propel standards in mental health care.</p> <p>Dr. Adam Kaplin, Assistant Professor of Psychiatry at Johns Hopkins School of Medicine and Principle Psyciatric Consultant to the Johns Hopkins Multiple Sclerosis and Transverse Myelitis Centers of Excellence, joins Dr. Jennifer Caudle to discuss ways in which technological innovations can enhance psychiatric care and decrease stigma surrounding mental illness.</p>",
            "length": "5704620",
            "sourceUrl": "http://reachmd.com/programs/everyday-family-medicine/how-information-technology-will-revolutionize-mental-health-care/8204/podcast/16040.mp3?partner=itunes"
        },
        {
            "title": "Adventures of a Female Medical Detective: Dr. Mary Guinan's Pursuit of Smallpox and AIDS\n",
            "datePublished": "Mon, 25 Jul 2016 00:00:00 -0400",
            "description": "\n\nHost: Jennifer Caudle, DO <br>\n\n\n  <p>Dr. Mary Guinan was one of the first scientists to conduct an initial investigation into the emerging HIV/AIDS epidemic for the Center for Disease Control and Prevention. Additionally, she was one of the first female physicians to work on smallpox eradication and has been a leading researcher and educator on sexually transmitted diseases.</p> <p>Dr. Mary Guinan is the founding dean of the School of Community Health Sciences at the University of Nevada, Las Vegas, and is now a professor emerita.</p> <p>She joins Dr. Jennifer Caudle to discuss her book, <em>Adventures of a Female Medical Detective</em> which explores Dr. Guinan's life in medicine, including her many experiences with emerging disease outbreaks and the efforts to control them. She provides a unique female perspective from a time when very few women worked in the field. </p>",
            "length": "10801613",
            "sourceUrl": "http://reachmd.com/programs/everyday-family-medicine/adventures-female-medical-detective-dr-mary-guinans-pursuit-smallpox-aids/8206/podcast/15971.mp3?partner=itunes"
        },
        {
            "title": "A Practice Unplugged: How a Physician Cares for the Amish in Lancaster County\n",
            "datePublished": "Mon, 18 Jul 2016 00:00:00 -0400",
            "description": "\n\nHost: Jennifer Caudle, DO <br>\n\n\n  <p>The Amish population are less likely to undergo annual checkups or engage in preventative care and typically prefer natural methods over institutional medicine. This creates unique challenges for the physicians who care for them.</p> <p>Dr. Jennifer Caudle talks with Dr. Candice Boyer, owner and medical director of Lancaster County Osteopathic Integrative Health, about her collective experiences caring for Amish patients. </p>",
            "length": "9902207",
            "sourceUrl": "http://reachmd.com/programs/everyday-family-medicine/a-practice-unplugged-how-physician-cares-for-amish-lancaster-county/8199/podcast/15954.mp3?partner=itunes"
        },
        {
            "title": "Pectus Excavatum: Research Advances Guiding Surgical Innovations\n",
            "datePublished": "Tue, 21 Jun 2016 00:00:00 -0400",
            "description": "\n\nHost: Jennifer Caudle, DO <br>\n\n\n  <p>Pectus excavatum is an uncommon condition, but a highly impactful one for those who are born with it. What do physicians need to know about pectus excavatum when encountering it in practice, and what new advances in treatment are on the horizon?</p> <p>Host Dr. Jennifer Caudle sits down with Dr. Dawn Jaroszewski, a cardiovascular surgeon at the Mayo Clinic, to talk about research updates and treatment options for patients with pectus excavatum.</p>",
            "length": "10502792",
            "sourceUrl": "http://reachmd.com/programs/everyday-family-medicine/pectus-excavatum-research-advances-guiding-surgical-innovations/8180/podcast/15868.mp3?partner=itunes"
        },
        {
            "title": "Breast Cancer's Reality Check: Separating Facts from Fiction for Patients\n",
            "datePublished": "Mon, 06 Jun 2016 00:00:00 -0400",
            "description": "\n\nHost: Jennifer Caudle, DO <br>\n\n\n  <p>There are many widely circulated myths regarding breast cancer, such as:</p> <ul> <li>Beliefs that this disease affects women only.</li> <li>Fears that mammograms can cause cancers to spread.</li> <li>Assumptions that most patients with breast cancer have family histories positive for this disease. </li> </ul> <p>Host Jennifer Caudle talks with guest Dr. Monique Gary, a fellowship-trained breast surgical oncologist at Grand View Health in Sellersville, Pennsylvania. Together, they dispel myths about breast cancer and talk about what patients can expect during a surgical oncologist appointment.</p>",
            "length": "6004245",
            "sourceUrl": "http://reachmd.com/programs/everyday-family-medicine/breast-cancers-reality-check-separating-facts-from-fiction-patients/7986/podcast/15777.mp3?partner=itunes"
        },
        {
            "title": "Breast Basics 101: What Every Woman Should Know About Breast Cancer Risk, Screening, & Detection\n",
            "datePublished": "Mon, 11 Apr 2016 00:00:00 -0400",
            "description": "\n\nHost: Jennifer Caudle, DO <br>\n\n\n  <p>Joining Dr. Jennifer Caudle to discuss top tips in breast cancer risk, screening, and detection is Dr. Monique Gary, breast surgical oncologist at Grand View Health in Sellersville, PA. <span>Dr. Gary earned her medical degree from Philadelphia College of Osteopathic Medicine. She completed her internship and residency at University of Massachusetts Hospital and went on to complete her fellowship at Georgetown University Hospital.</span></p>",
            "length": "7803559",
            "sourceUrl": "http://reachmd.com/programs/everyday-family-medicine/breast-basics-101-what-every-woman-should-know-break-cancer-risk-screening-detection/7985/podcast/15562.mp3?partner=itunes"
        },
        {
            "title": "Osteopathic Manipulative Treatment (OMT): From Historical Foundations to Emerging Applications\n",
            "datePublished": "Mon, 14 Mar 2016 00:00:00 -0400",
            "description": "\n\nHost: Jennifer Caudle, DO <br>\n\n\n  <p>On this episode of Everyday Medicine, host Dr. Jennifer Caudle welcomes Dr. Danielle Cooley to discuss the many facets of Osteopathic Manipulative Treatment (OMT), and the identification and treatment of somatic dysfunction. Dr. Danielle Cooley is Associate Professor at Rowan SOM in the Osteopathic Manipulative Medicine/Neuro-musculoskeletal Institute and Medical Director of the Family Medicine office in Mt. Laurel, NJ.</p>",
            "length": "10200816",
            "sourceUrl": "http://reachmd.com/programs/everyday-family-medicine/osteopathic-manipulative-treatment-historical-foundations-emerging-applications/7973/podcast/14550.mp3?partner=itunes"
        },
        {
            "title": "Overcoming the Odds: A Physician's Journey from the Streets of Louisiana to the War on Terrorism in Iraq\n",
            "datePublished": "Mon, 22 Feb 2016 00:00:00 -0500",
            "description": "\n\nHost: Jennifer Caudle, DO <br>\n\n\n  <p>On this episode of Everyday Family Medicine, host Dr. Jennifer Caudle welcomes Dr. Antonio J. Webb to discuss his book, <em>Overcoming the Odds: From the War on the Streets of Louisiana to the War on Terrorism in Iraq</em>. Dr. Webb is an orthopedic surgeon in residency at the University of Texas Health Science Center in San Antonio, Texas. He is also a motivational speaker and mentors underprivileged middle and high school students interested in medical careers.</p>",
            "length": "9000751",
            "sourceUrl": "http://reachmd.com/programs/everyday-family-medicine/overcoming-odds-physicians-journey-streets-louisiana-war-terrorism-iraq/7923/podcast/3058.mp3?partner=itunes"
        },
        {
            "title": "When it's Time to Call the Dermatologist: Hot Topics in Skin Care\n",
            "datePublished": "Mon, 15 Feb 2016 00:00:00 -0500",
            "description": "\n\nHost: Jennifer Caudle, DO <br>\n\n\n  <p>When do you refer to dermatologists? And what are some of the common &amp; uncommon dermatologic conditions that PCPs should refer to dermatologists? Host Dr. Jennifer Caudle welcomes Dr. Jeanine B. Downie to discuss some of the \"hot topics\" in dermatology and best practices in developing a good relationship between the primary care clinician and the dermatologist. Dr. Downie, director of Image Dermatology in New Jersey, is a fellow of the American Academy of Dermatology.</p> <p> </p> <p> </p>",
            "length": "11110400",
            "sourceUrl": "http://reachmd.com/programs/everyday-family-medicine/time-call-dermatologist-hot-topics-skin-care/7922/podcast/708.mp3?partner=itunes"
        },
        {
            "title": "Health Benefits of Correcting Poor Posture in an Increasingly Sedentary World\n",
            "datePublished": "Mon, 08 Feb 2016 00:00:00 -0500",
            "description": "\n\nHost: Jennifer Caudle, DO <br>\n\n\n  <p>Why is it important to understand what our body looks like when we are completing tasks, otherwise known as the study of ergonomics? How do we best counsel our patients, as well as clinicians, to notice changes in posture when sedentary? And how can achieve the more optimal \"neutral posture\" even when inactive? In this episode, host Dr. Jennifer Caudle welcomes Dr. Rubina Tahir, chiropractor, author, and host of <em>The Rx</em> on My New Philly. Dr. Tahir will discuss the importance of posture given the challenges of technology and other factors driving sedentary lifestyles.</p>",
            "length": "8101355",
            "sourceUrl": "http://reachmd.com/programs/everyday-family-medicine/health-benefits-correcting-poor-posture-increasingly-sedentary-world/7903/podcast/2866.mp3?partner=itunes"
        },
        {
            "title": "Toward Better Care for Veterans: Expert Observations from a Physician Who Served\n",
            "datePublished": "Mon, 01 Feb 2016 00:00:00 -0500",
            "description": "\n\nHost: Jennifer Caudle, DO <br>\n\n\n  <p>Dr. Jennifer Caudle welcomes Dr./Col. William Bograkos, Clinical Professor of Military Science, Family Medicine, and Emergency Medicine at the University Of New England College Of Osteopathic Medicine. Dr. Bograkos is also Assistant Professor in Military &amp; Emergency Medicine at the Uniformed Services University of the Health Sciences, Bethesda, MD, and currently serves as President-Elect for the American Osteopathic Academy of Addiction Medicine. He discusses the importance of having active conversations with patients who are veterans, with special emphasis on their unique physical and mental health needs. He then talks about efforts to support <em>Joining Forces</em>, <span>a nationwide initiative helping service members, veterans, and their families receive wellness, education, and employment opportunities.</span></p>",
            "length": "13800751",
            "sourceUrl": "http://reachmd.com/programs/everyday-family-medicine/toward-better-care-veterans-expert-observations-from-physician-who-served/7891/podcast/4674.mp3?partner=itunes"
        },
        {
            "title": "Providing Nonjudgmental Care for LGBT Populations: How to Recognize Unconscious Bias\n",
            "datePublished": "Mon, 11 Jan 2016 00:00:00 -0500",
            "description": "\n\nHost: Jennifer Caudle, DO <br>\n\n\n  <p>LGBT populations are at increased risk for specific health issues across the age spectrum, from depression, suicidality and eating disorders in childhood to substance abuse, sexually transmitted infections, and domestic violence issues in adulthood. Yet within the clinical arena, unconscious biases by healthcare providers can make patients uncertain or afraid to contribute sensitive information disclosing their sexual orientation, leading to missed guidance and care opportunities for higher risk problems. In this episode of Everyday Family Medicine, Dr. Jennifer Caudle welcomes Dr. Joshua Coren from Rowan University School of Osteopathic Medicine to discuss what has become known as the <em>Unconscious Bias</em>. </p> <p>This program was recorded on site at the American Osteopathic Association's annual medical education conference, OMED2015 in Orlando, FL.</p> <div id=\"stcpDiv\" style=\"position: absolute; top: -1999px; left: -1988px;\">This program was recorded on site at the American Osteopathic Association's annual medical education conference, OMED2015 in Orlando, FL, - See more at: https://reachmd.com/programs/everyday-family-medicine/cracking-down-opioid-abuse-pros-cons-stricter-state-legislations/7810/#sthash.zqxDtwGc.dpuf</div>",
            "length": "8400718",
            "sourceUrl": "http://reachmd.com/programs/everyday-family-medicine/providing-nonjudgmental-care-lgbt-populations-how-recognize-unconscious-bias/7812/podcast/239.mp3?partner=itunes"
        },
        {
            "title": "Delaying or Deferring the Onset of Alzheimer’s Disease: Can a New Blood Test Help? \n",
            "datePublished": "Mon, 28 Dec 2015 00:00:00 -0500",
            "description": "\n\nHost: Jennifer Caudle, DO <br>\n\n\n  <p>Host Jennifer Caudle, DO welcomes Robert Nagele, PhD, a Rowan University researcher and Professor at the Rowan University School of Osteopathic Medicine. Dr. Nagele and his team are closing in on a new blood test to detect Alzheimer’s, Parkinson’s, MS, cancers and other diseases by searching for the autoantibodies created by the disease processes. The test has initially shown to be remarkably accurate in research trials with a capability to accurately assess the stage of disease. More important, it appears to detect pre-clinical disease, giving physicians an opportunity to intervene with lifestyle changes that delay or defer the onset of symptoms.</p> <p>This program was recorded live at the American Osteopathic Association's annual medical education conference, OMED2015 in Orlando, FL,</p>",
            "length": "10201339",
            "sourceUrl": "http://reachmd.com/programs/everyday-family-medicine/delaying-deferring-onset-alzheimers-disease-can-new-blood-test-help/7835/podcast/1814.mp3?partner=itunes"
        },
        {
            "title": "Cracking Down on Opioid Abuse: The Pros and Cons of Stricter State Legislations\n",
            "datePublished": "Mon, 21 Dec 2015 00:00:00 -0500",
            "description": "\n\nHost: Jennifer Caudle, DO <br>\n\n\n  <p>States are cracking down on physicians and pharmacies in an attempt to curb a nationwide epidemic of opioid abuse. While some measures are improving the situation in hard-hit areas such as Florida, opponents say that the new laws are also keeping needed medications out of the hands of patients. How are states responding to this dual-issue, and do the ends of diminishing drug overdoses justify the means of restricting drug access to those who need them?</p> <p>Host Jennifer Caudle, DO welcomes guests Nick Schilligo and Mark Bailey, DO, PhD to Everyday Family Medicine to discuss the pros and cons of updated opioid prescription regulations nationwide. Mr. Schilligo is Associate Vice President of State Government Affairs for the American Osteopathic Association, while Dr. Mark Bailey is Professor of Neurology and Pain Medicine specialist at the University of Alabama in Birmingham. This program was recorded on site at the American Osteopathic Association's annual medical education conference, OMED2015 in Orlando, FL,</p>",
            "length": "10201078",
            "sourceUrl": "http://reachmd.com/programs/everyday-family-medicine/cracking-down-opioid-abuse-pros-cons-stricter-state-legislations/7810/podcast/3608.mp3?partner=itunes"
        },
        {
            "title": "Diabetes Research Suggests Better Long Term Outcomes with Early Insulin\n",
            "datePublished": "Mon, 30 Nov 2015 00:00:00 -0500",
            "description": "\n\nHost: Jennifer Caudle, DO <br>\n\n\n  <p>Host Jennifer Caudel, DO welcomes Jay Shubrook, DO, Director of Clinical Research and Diabetes Services at Touro University-California College of Osteopathic Medicine. Recorded on site at the American Osteopathic Association's annual medical education conference, Dr. Shubrook discusses a pilot study in which newly diagnosed type 2 diabetes patients were treated with early insulin rather than lifestyle changes and oral therapies alone. The results suggested not only good safety profiles, but also better long-term outcomes for patients.</p>",
            "length": "7800947",
            "sourceUrl": "http://reachmd.com/programs/everyday-family-medicine/diabetes-research-suggests-better-long-term-outcomes-with-early-insulin/7754/podcast/2969.mp3?partner=itunes"
        },
        {
            "title": "Caring for Dancers: The Nuances of Performing Arts Medicine\n",
            "datePublished": "Mon, 23 Nov 2015 00:00:00 -0500",
            "description": "\n\nHost: Jennifer Caudle, DO <br>\n\n\n  <p>Dr. Jennifer Caudle welcomes Dr. Rebecca Fishman, Director of Medical Education at Mercy Medical Center, New York, NY. Dr. Fishman was a professional dancer before becoming a DO and has a number of dance professionals in her family. Dr. Fishman joins Dr. Caudle on site at the American Osteopathic Association's annual medical education conference, OMED2015. Dr. Fishman is focused on OMT for dancers and equates professionals to elite athletes because of the amount of training and physical demands placed on their bodies. This segment is intended to introduce the niche specialty of performing arts medicine and include the social/emotional tolls that dance can have on its performers.</p>",
            "length": "12601992",
            "sourceUrl": "http://reachmd.com/programs/everyday-family-medicine/caring-for-dancers-the-nuances-of-performing-arts-medicine/7748/podcast/3887.mp3?partner=itunes"
        },
        {
            "title": "Finding Meaning in a Flawed Meaningful Use Program: Pathways Toward Physician Compliance \n",
            "datePublished": "Mon, 16 Nov 2015 00:00:00 -0500",
            "description": "\n\nHost: Jennifer Caudle, DO <br>\n\n\n  <p>The Meaningful Use program from the Centers for Medicare &amp; Medicaid Services (CMS) was designed to help make electronic health records fully functional, enabling better coordination of care for physicians and more transparency of information for patients. However, the rollout of this program proved to be far rockier than anticipated, as errors and communication gaps from EHR systems led to practice penalties despite heavy investments and best intentions toward compliance. What will the future hold for this dysfunctional program on a national scale, and how can clinicians find success in their respective practices amidst these challenges? </p> <p>Joining host Jennifer Caudle, DO at the American Osteopathic Association's annual medical education conference, OMED2015 in Orlando, FL to discuss strategies for better EHR integration is Laura Wooster, Vice President of Public Policy for the AOA. </p>",
            "length": "6001110",
            "sourceUrl": "http://reachmd.com/programs/everyday-family-medicine/finding-meaning-flawed-meaningful-use-program-pathways-toward-physician-compliance/7740/podcast/6581.mp3?partner=itunes"
        },
        {
            "title": "Keeping a Clinical Eye on Sickle Cell Retinopathy\n",
            "datePublished": "Mon, 19 Oct 2015 00:00:00 -0400",
            "description": "\n\nHost: Jennifer Caudle, DO <br>\n\n\n  <p>Dr. Jennifer Caudle welcomes Dr. Patrick Spencer, Chairman of the Department of Ophthalmology at Grandview Medical Center in Dayton, Ohio. Their discussion centers on primary care manifestations of sickle cell retinopathy, from early to late-stage presentations and the gold standard treatment approaches along this disease course.</p>",
            "length": "7200914",
            "sourceUrl": "http://reachmd.com/programs/everyday-family-medicine/keeping-clinical-eye-sickle-cell-retinopathy/7703/podcast/6962.mp3?partner=itunes"
        },
        {
            "title": "Reproductive Impacts of Bariatric Surgery for Obese Women\n",
            "datePublished": "Mon, 28 Sep 2015 00:00:00 -0400",
            "description": "\n\nHost: Jennifer Caudle, DO <br>\n\nGuest: Renée Simone Yolanda Allen, MD, MHSc., FACOG <br>\n\n\n  <p>In the past 20 years, rates of bariatric surgery have risen more than 800%. Of the number of bariatric procedures performed every year, women of reproductive age account for the vast majority of patients. What are the obstetric and gynecological effects of these various surgical procedures on female patients, and how can potential complications be prevented? Host Dr. Jennifer Caudle welcomes Dr. Renee S. Allen, Board certified OB/GYN and hospitalist, Fellow of ACOG, and Masters of Health Sciences from Atlanta, Georgia, to discuss OB/GYN counseling strategies for women who have undergone or intend to undergo bariatric surgery. </p>",
            "length": "12600686",
            "sourceUrl": "http://reachmd.com/programs/everyday-family-medicine/reproductive-impacts-bariatric-surgery-obese-women/7660/podcast/6330.mp3?partner=itunes"
        },
        {
            "title": "The OB/GYN Hospitalist Model: Creating a \"Safety Net\" in Women's Health Care Delivery\n",
            "datePublished": "Mon, 21 Sep 2015 00:00:00 -0400",
            "description": "\n\nHost: Jennifer Caudle, DO <br>\n\nGuest: Renée Simone Yolanda Allen, MD, MHSc., FACOG <br>\n\n\n  <p>Host Dr. Jennifer Caudle welcomes Dr. Renee S. Allen, Board certified OB/GYN and hospitalist, Fellow of ACOG, and Masters of Health Sciences from Atlanta, Georgia. Dr. Allen shares her expertise as an OB/GYN hospitalist, the growing support from ACOG in this new arena, and the goals of an emerging subspecialty.</p>",
            "length": "9900669",
            "sourceUrl": "http://reachmd.com/programs/everyday-family-medicine/the-obgyn-hospitalist-model-creating-safety-net-womens-health-care-delivery/7645/podcast/8275.mp3?partner=itunes"
        },
        {
            "title": "Reprogramming the Digestive System: Where Traditional and Integrative Therapies Merge\n",
            "datePublished": "Mon, 14 Sep 2015 00:00:00 -0400",
            "description": "\n\nHost: Jennifer Caudle, DO <br>\n\nGuest: Tasneem &quot;Taz&quot; Bhatia, MD <br>\n\n\n  <p>Dr. Jennifer Caudle welcomes Dr. Taz Bhatia, associate professor in Integrative Medicine at Emory University School of Medicine and and Founder and Medical Director of the <span id=\"u533-11\">Atlanta Center for Holistic and Integrative Medicine</span>. Dr. Bhatia is author of <em>The 21-Day Belly Fix: The Doctor-Designed Diet Plan for A Clean Gut and a Slimmer Waist. </em>She describes her personal journey toward dual-expertise in allopathic and integrative medicine, and the research foundations behind her popular book.</p>",
            "length": "11700767",
            "sourceUrl": "http://reachmd.com/programs/everyday-family-medicine/reprogramming-the-digestive-system-where-traditional-and-integrative-therapies-merge/7631/podcast/6069.mp3?partner=itunes"
        },
        {
            "title": "How Do You Approach Obesity During an Office Visit?\n",
            "datePublished": "Mon, 18 May 2015 00:00:00 -0400",
            "description": "\n\nHost: Jennifer Caudle, DO <br>\n\n\n  <p>Approaching the topic of body weight with patients is a sensitive issue. It can be challenging for providers to discuss health issues related to excess weight while also remaining sensitive to terminology and language that may offend patients. Host Dr. Jennifer Caudle welcomes Dr. Adarsh Gupta to provide insight on how to approach obesity during an office visit. Dr. Gupta is the Director of the Center for Medical Weight Loss &amp; Metabolic Control, and Associate Professor of Family Medicine at Rowan School of Medicine. </p>",
            "length": "10200816",
            "sourceUrl": "http://reachmd.com/programs/everyday-family-medicine/how-do-you-approach-obesity-during-office-visit/7432/podcast/8880.mp3?partner=itunes"
        },
        {
            "title": "Screening and Diagnosing Lung Disease in the Primary Care Office\n",
            "datePublished": "Mon, 11 May 2015 00:00:00 -0400",
            "description": "\n\nHost: Jennifer Caudle, DO <br>\n\n\n  <p>Lung cancer is the leading cause of cancer death and the second most common cancer among both men and women in the United States. But how can clinicians increase awareness and screening for this disease within their practices? Dr. Jennifer Caudle welcomes Dr. Nina Maouelainin, Director of Interventional Pulmonology at The Lung Center of Grand View Health in Sellersville, PA, to discuss the facts about lung cancer, screening approaches, and her personal journey in increasing awareness among primary care providers.</p>",
            "length": "9000751",
            "sourceUrl": "http://reachmd.com/programs/everyday-family-medicine/screening-and-diagnosing-lung-disease-primary-care-office/7437/podcast/6986.mp3?partner=itunes"
        },
        {
            "title": "Succeeding as a Physician-Entrepreneur: The Mobile Medical Practice of Dr. Tracei Ball\n",
            "datePublished": "Mon, 27 Apr 2015 00:00:00 -0400",
            "description": "\n\nHost: Jennifer Caudle, DO <br>\n\n\n  <p>Practicing medicine has many rewards, but it also carries its fare share of challenges. Physicians face many of the same obstacles as other entrepreneurs and business owners looking to find innovative ways to market themselves and, most importantly in the medical arena, service their patients. Joining Dr. Jennifer Caudle to discuss the practice and business model for one such physician entrepreneur is Dr. Tracei Ball, founder of OnCall Mobile Medical and Wellness, which provides house calls in the metropolitan area of Charlotte, North Carolina.</p>",
            "length": "9603918",
            "sourceUrl": "http://reachmd.com/programs/everyday-family-medicine/mobile-practice-dr-tracei-ball/7436/podcast/13367.mp3?partner=itunes"
        }
    ]
}