{
    "artwork": "http://is5.mzstatic.com/image/thumb/Music62/v4/69/32/61/69326139-6efd-cf14-0700-be1eb65e6802/source/100x100bb.jpg",
    "description": "The tentacles of the law are many and they reach into the lives of ordinary people, sometimes when least expected.  When that happens, it can cause alarm and anxiety.  So much is at stake when you are involved in a legal proceeding and the costs of an error can be serious.  So the aim of this podcast is to take the mystery out of the law for the ordinary person.  We aim to give it context and to make it comprehensible.",
    "feedURL": "http://monahanfirm.com/feed/podcast/",
    "podcastURL": "http://monahanfirm.com",
    "title": "Everyday Law",
    "episodes": [
        {
            "title": "On Probate",
            "datePublished": "Sat, 02 May 2020 19:35:30 +0000",
            "description": "In this episode, we tackle probate in all its mystery.",
            "length": "36450644",
            "sourceUrl": "https://media.blubrry.com/everyday_law/www.monahanfirm.com/everyday-law/EDL-2020-05-02-Probate.m4a",
            "epNo": "100",
            "categories": [
                "Everyday Law"
            ]
        },
        {
            "title": "Jennifer Banek – Coroner Candidate",
            "datePublished": "Sat, 28 Mar 2020 01:52:13 +0000",
            "description": "Join us as we return to podcasting with special guest, Coroner Candidate Jennifer Banek.",
            "length": "12875720",
            "sourceUrl": "http://media.blubrry.com/everyday_law/www.monahanfirm.com/everyday-law/EDL_099_20200327_Banek.m4a",
            "epNo": "99",
            "categories": [
                "Everyday Law"
            ]
        },
        {
            "title": "Lake County Recorder Mary Ellen Vanderventer | Ep 96",
            "datePublished": "Sat, 20 Oct 2018 12:26:09 +0000",
            "description": "Join Mary Ellen Vanderventer and her Chief Deputy, Cynthia Pruim-Haran, as we discuss with her what the Lake County Recorder’s Office does and how it helps the Lake County Community! In the Lake County Recorder’s Office, there are over 7 million documents — mostly relating to real property, like homes, or buildings, or land. The […]",
            "length": "63432392",
            "sourceUrl": "https://media.blubrry.com/everyday_law/robertamonahan.wpengine.com/everyday-law/EDL-096-20181020-Vanderventer.mp3",
            "categories": [
                "Everyday Law",
                "Podcasts"
            ]
        },
        {
            "title": "Estate Planning with Julie Kolodziej | Ep 95",
            "datePublished": "Fri, 12 Oct 2018 13:06:46 +0000",
            "description": "Click the arrow above to play the podcast! What can you expect when you see a lawyer to draft your will? How much do you need to prepare? What documents do you need to bring? Join us as we discuss estate planning with Attorney Julie Kolodziej, of The Matlin Law Group, in Northbrook, who has […]",
            "length": "64221269",
            "sourceUrl": "https://media.blubrry.com/everyday_law/robertamonahan.wpengine.com/everyday-law/EDL-095-20181013-Kolodziej.mp3",
            "categories": [
                "Everyday Law",
                "Podcasts"
            ]
        },
        {
            "title": "Is Love Stronger Than Justice? | Ep 94",
            "datePublished": "Sat, 08 Sep 2018 00:36:17 +0000",
            "description": "Can forgiveness be stronger than justice — especially in the legal system? My client Cathy Harvey proved it can be so. Watch her interview about her path to forgiving the driver that killed her daughter.",
            "length": "695616514",
            "sourceUrl": "https://media.blubrry.com/everyday_law/robertamonahan.wpengine.com/everyday-law/EDL-094-20180908-Harvey.mp4",
            "categories": [
                "Everyday Law",
                "Podcasts"
            ]
        },
        {
            "title": "Judge Christy Bishop and the Lake County Mock Trial Tournament | Ep 93 | (Video)",
            "datePublished": "Fri, 24 Aug 2018 23:45:50 +0000",
            "description": "Click above to watch the video! Join Everyday Law as we interview Judge Christy Bishop about the yearly Lake County Mock Trial Tournament. Robert Monahan, Esq. is a lawyer in Gurnee, IL with his own practice in personal injury. He has a radio show on Thursday nights at 7 pm, called “Everyday Law,” on WRLR […]",
            "length": "1183459983",
            "sourceUrl": "https://media.blubrry.com/everyday_law/robertamonahan.wpengine.com/everyday-law/EDL-093-20180824-Bishop.mp4",
            "categories": [
                "Everyday Law",
                "Everyday Law TV",
                "Podcasts"
            ]
        },
        {
            "title": "Lake County Treasurer David Stolman | Ep 92",
            "datePublished": "Fri, 17 Aug 2018 15:15:52 +0000",
            "description": "Join Everyday Law and Lake County Treasurer David Stolman, as we discuss what the Treasurer’s Office is, what it does for Lake County, and what challenges it has faced over the last few years — especially with regard to the changes in the tax code regarding the property tax deduction! Robert Monahan, Esq. is a […]",
            "length": "62175864",
            "sourceUrl": "https://media.blubrry.com/everyday_law/robertamonahan.wpengine.com/everyday-law/EDL-092-20180817-Stolman.mp3",
            "categories": [
                "Everyday Law",
                "Podcasts"
            ]
        },
        {
            "title": "Are We in a Constitutional Crisis? | Ep 91",
            "datePublished": "Fri, 20 Jul 2018 12:09:47 +0000",
            "description": "Click the arrow above to play podcast. While our leadership garners all of the headlines, could the problems of the country really result from The US Constitution? Has The Constitution stopped working? Join Attorney Matt Stanton and I as we discuss how the Constitution developed, fortifying the weaknesses of the prior Articles of Confederation; and […]",
            "length": "52206352",
            "sourceUrl": "https://media.blubrry.com/everyday_law/robertamonahan.wpengine.com/everyday-law/EDL-091-20180720-Stanton.mp3",
            "categories": [
                "Everyday Law",
                "Podcasts"
            ]
        },
        {
            "title": "Accident Reconstruction with Sgt. Andrew Thomas | Ep 90",
            "datePublished": "Fri, 30 Mar 2018 22:36:42 +0000",
            "description": "Join Everyday Law as we discuss accident reconstruction with Sgt. Andrew Thomas of the McHenry County Sheriff’s Office. Sergeant Andrew Thomas works for the McHenry County Sheriff’s Office. He also does accident investigation and reconstruction through his own company, Collision Analytics, LLC, (collisionanalyticsllc.com), for accidents outside McHenry County. In addition to his job for McHenry […]",
            "length": "68925635",
            "sourceUrl": "https://media.blubrry.com/everyday_law/robertamonahan.wpengine.com/everyday-law/EDL-090-20180330-Thomas.mp3",
            "categories": [
                "Everyday Law",
                "Podcasts"
            ]
        },
        {
            "title": "Bur-Men Law Group – Criminal Defense – Divorce – Civil Rights | Ep 88",
            "datePublished": "Fri, 16 Mar 2018 18:29:06 +0000",
            "description": "Click the arrow above to play the podcast. Join Everyday Law as we speak to LaTonya Burton and Renea Amen of Bur-Men Law Group. Together, they handle criminal defense, divorce and civil rights cases.",
            "length": "64333454",
            "sourceUrl": "https://media.blubrry.com/everyday_law/robertamonahan.wpengine.com/everyday-law/EDL-088-20180316-Burmen.mp3",
            "categories": [
                "Everyday Law",
                "Podcasts"
            ]
        },
        {
            "title": "Car Accidents | Ep 87",
            "datePublished": "Fri, 09 Mar 2018 01:46:56 +0000",
            "description": "Click the arrow above to play the podcast! Join us as we hop into the way back machine for a revisit of our first episode ever of Everyday Law — on car accidents!",
            "length": "48081383",
            "sourceUrl": "https://media.blubrry.com/everyday_law/robertamonahan.wpengine.com/everyday-law/EDL-087-20180308-Car-Accidents.mp3"
        },
        {
            "title": "The Tax Cuts and Jobs Act of 2017 with Jack Mardoian | Ep 86",
            "datePublished": "Fri, 02 Mar 2018 12:23:50 +0000",
            "description": "Click the arrow above to play the podcast! Jack Mardoian is a Lake County tax and estate attorney, who joined us on Everyday Law to break down The Tax Cuts and Jobs Act of 2017. The Tax Cuts and Jobs Act of 2017 The Tax Cuts and Jobs Act of 2017 was passed to fulfill […]",
            "length": "67008435",
            "sourceUrl": "https://media.blubrry.com/everyday_law/robertamonahan.wpengine.com/everyday-law/EDL-086-20180302-Mardoian.mp3"
        },
        {
            "title": "What Happens To You If You Die Without A Will? | Ep 85",
            "datePublished": "Fri, 23 Feb 2018 21:33:00 +0000",
            "description": "Click the arrow above to play the podcast. What happens to your property if you die without a will? If you don’t have a will, the government has a will for you. What happens to your property is determined by your state’s laws of “intestacy.” In our case, let’s talk about Illinois, where the rules […]",
            "length": "3460075",
            "sourceUrl": "https://media.blubrry.com/everyday_law/robertamonahan.wpengine.com/everyday-law/EDL-085-20180223-Intestacy.mp3"
        },
        {
            "title": "Criminal Defense Work with Kevin Malia and Eric Rinehart | Ep 84",
            "datePublished": "Fri, 16 Feb 2018 04:15:06 +0000",
            "description": "Click the arrow above to listen to the podcast! Join Everyday Law as we discuss criminal defense work with Kevin Malia and Eric Rinehart of Malia and Rinehart. We cover some fascinating questions, like how to justify defending a client who may be guilty; the challenges facing a criminal defense attorney; the imperfections of the […]",
            "length": "72289514",
            "sourceUrl": "https://media.blubrry.com/everyday_law/robertamonahan.wpengine.com/everyday-law/EDL-084-20180215-MaliaAndRinehart.mp3"
        },
        {
            "title": "Sharanya Guruajan on Bankruptcy | Ep 83 (Video)",
            "datePublished": "Wed, 31 Jan 2018 19:00:16 +0000",
            "description": "Click the arrow above to play the video. It was a pleasure to have my good friend, Attorney Sharanya Guruajan, of SGLaw, on Everyday Law to talk about bankruptcy practice. Attorney Gururajan and I met shortly after I began my own practice in 2009, but Attorney Guruajan had gained her expertise in bankruptcy law after […]",
            "length": "1375509745",
            "sourceUrl": "https://media.blubrry.com/everyday_law/robertamonahan.wpengine.com/everyday-law/EDL-083-20180131-Sharanya.mp4"
        },
        {
            "title": "A Safe Place with Pat Davenport | Ep 82",
            "datePublished": "Sun, 21 Jan 2018 19:39:03 +0000",
            "description": "Press “Play” Arrow for Podcast Join Everyday Law as we discuss A Safe Place with Executive Director, Pat Davenport. As you may know, A Safe Place provides emergency shelter and transitional housing to survivors of domestic violence, but this episode will surprise you with the scope of all of the other initiatives that the organization […]",
            "length": "45210553",
            "sourceUrl": "https://media.blubrry.com/everyday_law/robertamonahan.wpengine.com/everyday-law/EDL-082-20180121-SafePlace.mp3"
        },
        {
            "title": "Social Security Disability Claims with Attorney Perry Smith | Ep 81",
            "datePublished": "Sun, 07 Jan 2018 13:59:35 +0000",
            "description": "Click the “pointer” above to play the podcast episode. There is more to Social Security claims than you might think. Join Everyday Law and special guest, Attorney Perry Smith, of Waukegan’s Wysocki & Smith, as we talk about who can receive Social Security disability, and how to go about getting benefits. Attorney Perry Smith can […]",
            "length": "78601109",
            "sourceUrl": "https://media.blubrry.com/everyday_law/robertamonahan.wpengine.com/everyday-law/EDL-081-20180107-PerrySmith.mp3"
        },
        {
            "title": "Banker Michael Barbini on Your Credit Score | Ep 79",
            "datePublished": "Fri, 22 Dec 2017 13:14:36 +0000",
            "description": "Michael Barbini is a banker with Libertyville Bank & Trust (member FDIC and equal housing lender), a Wintrust Community Bank (tel. 847-247-4038 and mbarbini@libertyvillebank.com). He has been in banking for 17 years, starting as a teller when he was in college. Currently, he is a Vice-President of business banking. Barbini is involved in a great […]",
            "length": "75473224",
            "sourceUrl": "https://media.blubrry.com/everyday_law/robertamonahan.wpengine.com/everyday-law/EDL-079-20171222-Barbini.m4a"
        },
        {
            "title": "Attorney Matt Stanton on Lake County Democrats | Ep 78",
            "datePublished": "Fri, 08 Dec 2017 11:33:33 +0000",
            "description": "Join Everyday Law with our special guest, Matt Stanton, as we discuss his unusual backstory, as well as the national and local Democratic party. Gurnee resident Matt Stanton has an unusual background for an attorney. He comes from a working-class background and is the first of his family to pursue education beyond high school. Stanton […]",
            "length": "67288462",
            "sourceUrl": "https://media.blubrry.com/everyday_law/robertamonahan.wpengine.com/everyday-law/EDL-078-20171208-Matt-Stanton.mp3"
        },
        {
            "title": "Back to School with Special Education Lawyer Neal Takiff | Ep 76",
            "datePublished": "Sat, 16 Sep 2017 00:58:59 +0000",
            "description": "Join Everyday Law, as we go “back to school” with special education lawyer, Neal Takiff, discussing items like IEPs, and many tips for parents of children with special needs. Robert Monahan, Esq. is a lawyer in Gurnee, IL with his own practice in personal injury. He has a radio show on Thursday nights at 7 […]",
            "length": "68463508",
            "sourceUrl": "https://media.blubrry.com/everyday_law/robertamonahan.wpengine.com/everyday-law/EDL-076-20170915-Takiff.mp3"
        },
        {
            "title": "The Center on Wrongful Convictions | Ep 75",
            "datePublished": "Fri, 08 Sep 2017 19:08:43 +0000",
            "description": "Join Everyday Law and Judy Royal of the Center on Wrongful Convictions, as we discuss with exonerees, Juan Rivera and Kristine Bunch, their journey from imprisonment to release, and how they are now starting a foundation for exonerees to help them back on their feet: “Just Is 4 Just Us.” The CWC (Center on Wrongful […]",
            "length": "40286145",
            "sourceUrl": "https://media.blubrry.com/everyday_law/robertamonahan.wpengine.com/everyday-law/EDL-075-20170908-CWC.mp3"
        },
        {
            "title": "The Advocacy of the Zacharias Center | Ep 072",
            "datePublished": "Fri, 18 Aug 2017 10:58:04 +0000",
            "description": "Join Everyday Law as we discuss the advocacy of the Zacharias Center with Public Health Advocate, Mallory Tucker. Mallory Tucker is a public health advocate with the Zacharias Center of Gurnee which provides free counselling and advocacy services for survivors of sexual assault and abuse, as well as prevention education. The Center also has a […]",
            "length": "46962997",
            "sourceUrl": "https://media.blubrry.com/everyday_law/robertamonahan.wpengine.com/everyday-law/EDL-072-20170818-ZCenter.mp3"
        },
        {
            "title": "Jodi Luka – Jury Coordinator | Ep 71",
            "datePublished": "Wed, 09 Aug 2017 02:22:26 +0000",
            "description": "Join Everyday Law and our guest, Jodi Luka, the Lake County Jury Coordinator, as we discuss her work in organizing the logistics and humanizing the jury process, taking the jury from hoping to evade service at all costs to at 98% satisfaction rate with the experience. Jodi Luka is the Jury Coordinator of the Lake […]",
            "length": "76397203",
            "sourceUrl": "https://media.blubrry.com/everyday_law/robertamonahan.wpengine.com/everyday-law/EDL-071-20170808-Luka.mp3"
        },
        {
            "title": "Clerk of the Court Erin Cartwright-Weinstein | Ep 69",
            "datePublished": "Sat, 08 Jul 2017 01:45:57 +0000",
            "description": "Join Everyday Law as we discuss the various functions of the Lake County Circuit Clerk (the clerk of the court system), with Court Clerk Erin Cartwright-Weinstein. We also cover three important initiatives of her office — including an expungement workshop, an amnesty initiative and anti-bullying week. Robert Monahan, Esq. is a lawyer in Gurnee, IL […]",
            "length": "66078122",
            "sourceUrl": "https://media.blubrry.com/everyday_law/robertamonahan.wpengine.com/everyday-law/EDL-069-20170707-CourtClerk.mp3"
        },
        {
            "title": "The Arbitration Court with Delta Hawkins | Ep 067",
            "datePublished": "Fri, 09 Jun 2017 20:32:16 +0000",
            "description": "Join us as we discuss the Arbitration Division Court with Administrator Delta Hawkins!   Robert Monahan, Esq. is a lawyer in Gurnee, IL with his own practice in personal injury. He has a radio show on Thursday nights at 7 pm, called “Everyday Law,” on WRLR 98.3 FM, where he tries to demystify the law […]",
            "length": "36005721",
            "sourceUrl": "https://media.blubrry.com/everyday_law/robertamonahan.wpengine.com/everyday-law/EDL-067-20170609-Arbitration.mp3"
        },
        {
            "title": "Judge Ted Potkonjak | Ep 066",
            "datePublished": "Fri, 26 May 2017 17:19:02 +0000",
            "description": "Join Everyday Law and our special guest, Judge Ted Potkonjak, as we discuss his career, his time on the bench, and how he currently handles small claims cases!   Robert Monahan, Esq. is a lawyer in Gurnee, IL with his own practice in personal injury. He has a radio show on Thursday nights at 7 […]",
            "length": "38146090",
            "sourceUrl": "https://media.blubrry.com/everyday_law/robertamonahan.wpengine.com/everyday-law/EDL-066-20170526-Potkonjak.mp3"
        },
        {
            "title": "LCBA President Don Morrison | Ep 064",
            "datePublished": "Fri, 12 May 2017 15:32:40 +0000",
            "description": "Join us as we discuss how the Lake County Bar President, Don Morrison, learned the craft of personal injury work; how he has prosecuted some great cases; defended high profile criminal cases — including Mrs. Gliniewicz — and, as president of the bar association, helped spear-head the creation of a headquarters.   Robert Monahan, Esq. […]",
            "length": "37236402",
            "sourceUrl": "https://media.blubrry.com/everyday_law/robertamonahan.wpengine.com/everyday-law/EDL-064-20170512-Morrison.mp3"
        },
        {
            "title": "Small Claims Do-It-Yourself | Ep 063",
            "datePublished": "Sat, 06 May 2017 10:58:52 +0000",
            "description": "Join me as I walk a family friend through the small claims process, after she had been in a minor car accident. This podcast is the audio of a TV episode, which is available on the “Everyday Law TV” YouTube channel. https://www.youtube.com/channel/UCGES5mOlkJvbS37ARxmPYVw?spfreload=5   Robert Monahan, Esq. is a lawyer in Gurnee, IL with his own […]",
            "length": "31413967",
            "sourceUrl": "https://media.blubrry.com/everyday_law/robertamonahan.wpengine.com/everyday-law/EDL-063-20170506-Kasia.mp3"
        },
        {
            "title": "Lake County Veterans and Family Services Foundation | Ep 062",
            "datePublished": "Fri, 28 Apr 2017 15:45:49 +0000",
            "description": "Join Everyday Law and President/Founder Lt. Paul Baffico of the Lake County Veterans and Family Services Foundation, as we discuss veterans advocacy — how Lt. Baffico’s foundation helps Lake County vets, as well as his own history as a Vietnam combat veteran, and his re-entry into civilian life after coming home.   Robert Monahan, Esq. […]",
            "length": "39786789",
            "sourceUrl": "https://media.blubrry.com/everyday_law/robertamonahan.wpengine.com/everyday-law/EDL-062-20170428-Baffico.mp3"
        },
        {
            "title": "Spotlight on Family Law Attorneys Mary Clark and Val Steiner | EDL # 061",
            "datePublished": "Fri, 14 Apr 2017 02:40:29 +0000",
            "description": "Join Everyday Law as we discuss a variety of issues with family law attorneys, Mary Clark and Val Steiner, of Clark and Steiner — including how they began their law practice together, why it is impossible to separate the emotional components from the legal issues in family law, and what has changed for women in the […]",
            "length": "39394325",
            "sourceUrl": "https://media.blubrry.com/everyday_law/robertamonahan.wpengine.com/everyday-law/EDL-061-20170413-women.mp3"
        },
        {
            "title": "Act Only with Legal Authority – Wills, Trusts and Powers of Attorney | Everyday Law Ep 60",
            "datePublished": "Fri, 07 Apr 2017 16:32:27 +0000",
            "description": "Join Everyday Law and Estate Planning Attorney — Ben Neiburger, JD, CPA — as we discuss the keys to any estate plan and why you should always act only with legal authority! Our guest today is my friend, Ben Neiburger. Attorney Neiburger is an elder law and probate attorney. He can be reached through his […]",
            "length": "22470740",
            "sourceUrl": "https://media.blubrry.com/everyday_law/robertamonahan.wpengine.com/everyday-law/EDL-060-20170407-authority.mp3"
        },
        {
            "title": "EDL 059 – Senior Issues, Etc. w Vita Verden and Gloria Shapiro",
            "datePublished": "Fri, 31 Mar 2017 15:47:42 +0000",
            "description": "Join Everyday Law as we play “turnabout”! In January, Senior Issues, Etc. had us on their show — so we are having them on ours. Listen in as we discuss how Senior Issues, Etc. got started 17 years ago and how Vita Verden and Gloria Shapiro and their crew keep it going! Robert Monahan, Esq. […]",
            "length": "36469656",
            "sourceUrl": "https://media.blubrry.com/everyday_law/robertamonahan.wpengine.com/everyday-law/EDL-059-20170331-Senior.mp3"
        },
        {
            "title": "EDL 058 – Identity Theft w ASA Scott Turk",
            "datePublished": "Fri, 17 Mar 2017 15:29:56 +0000",
            "description": "Join us at Everyday Law as we discuss Identity Theft with Assistant States Attorney Scott Turk! How can you prevent it? What should you do if it happens to you? Tune in to learn more about this fascinating (and scary!) topic.   Robert Monahan, Esq. is a lawyer in Gurnee, IL with his own practice […]",
            "length": "37539213",
            "sourceUrl": "https://media.blubrry.com/everyday_law/robertamonahan.wpengine.com/everyday-law/EDL-058-20170317-Turk.mp3"
        },
        {
            "title": "EDL 057 – Basic Wills and Trusts with Jeff O’Kelley",
            "datePublished": "Fri, 10 Mar 2017 22:49:32 +0000",
            "description": "Join Everyday Law and Jeff O’Kelley of Lesser Lutrey Pasquesi and Howe, as we discuss the basic elements of wills and trusts!   Robert Monahan, Esq. is a lawyer in Gurnee, IL with his own practice in personal injury. He has a radio show on Thursday nights at 7 pm, called “Everyday Law,” on WRLR […]",
            "length": "38466769",
            "sourceUrl": "https://media.blubrry.com/everyday_law/robertamonahan.wpengine.com/everyday-law/EDL-057-20170305-Basic-Wills.mp3"
        },
        {
            "title": "EDL 056 – Mike Cavanaugh and Jeff Nutschnig on Traffic, DUIs and Expungements",
            "datePublished": "Sat, 04 Mar 2017 18:08:41 +0000",
            "description": "Gurnee attorneys, Jeff Nutschnig and Mike Cavanaugh, specialize in handling traffic, DUI and expungement cases. Their office is located at 4017 Old Grand Avenue in Gurnee. They can be reached by telephone at (847)263-8820 and through their website, www.mcavanaughlaw.com.   Robert Monahan, Esq. is a lawyer in Gurnee, IL with his own practice in personal […]",
            "length": "37663974",
            "sourceUrl": "https://media.blubrry.com/everyday_law/robertamonahan.wpengine.com/everyday-law/EDL-056-20170304-NCTraffic.mp3"
        },
        {
            "title": "EDL 055 – Michael Peck of the Veterans Assistance Commission",
            "datePublished": "Mon, 27 Feb 2017 20:32:50 +0000",
            "description": "Join us as we interview Michael Peck, the Superintendent of the Veterans Assistance Commission of Lake County — a group that advocates for veterans.   Robert Monahan, Esq. is a lawyer in Gurnee, IL with his own practice in personal injury. He has a radio show on Thursday nights at 7 pm, called “Everyday Law,” […]",
            "length": "20313130",
            "sourceUrl": "https://media.blubrry.com/everyday_law/robertamonahan.wpengine.com/everyday-law/EDL-055-20170227-Peck.mp3"
        },
        {
            "title": "EDL – 054 – Mike Brennan – The Virtual Attorney",
            "datePublished": "Sun, 19 Feb 2017 13:15:30 +0000",
            "description": "Join me and Mike Brennan — Lake County’s Virtual Attorney — as we discuss his practice, and how he uses technology to work in three states, all from a home office! Robert Monahan, Esq. is a lawyer in Gurnee, IL with his own practice in personal injury. He has a radio show on Thursday nights […]",
            "length": "29051089",
            "sourceUrl": "https://media.blubrry.com/everyday_law/robertamonahan.wpengine.com/everyday-law/EDL-054-20170219-Brennan.mp3"
        },
        {
            "title": "EDL 053 – Round Lake Beach Mayor Richard Hill",
            "datePublished": "Fri, 03 Feb 2017 09:47:13 +0000",
            "description": "Join us as we discuss Round Lake Beach Mayor Richard Hill’s political history, his daily work with his Board of Trustees and his Fireside Chats!   Robert Monahan, Esq. is a lawyer in Gurnee, IL with his own practice in personal injury. He has a radio show on Thursday nights at 7 pm, called “Everyday […]",
            "length": "49315147",
            "sourceUrl": "https://media.blubrry.com/everyday_law/robertamonahan.wpengine.com/everyday-law/EDL-052-20170203-Hill.mp3"
        },
        {
            "title": "EDL 052 Amy Strege and Evictions",
            "datePublished": "Fri, 20 Jan 2017 12:43:55 +0000",
            "description": "Join Everyday Law and our guest, Attorney Amy Strege of Finn & Finn, as we discuss evictions and landlord/tenant law!   Robert Monahan, Esq. is a lawyer in Gurnee, IL with his own practice in personal injury. He has a radio show on Thursday nights at 7 pm, called “Everyday Law,” on WRLR 98.3 FM, […]",
            "length": "49315153",
            "sourceUrl": "https://media.blubrry.com/everyday_law/robertamonahan.wpengine.com/everyday-law/EDL-052-20170120-evictions.mp3"
        },
        {
            "title": "EDL 051 – Bring a Small Claim without a Lawyer",
            "datePublished": "Sat, 14 Jan 2017 17:07:00 +0000",
            "description": "In this edition of our “Sunday Law Series,” a partnership between WRLR 98.3 FM and the Round Lake Area Public Library District, we discuss how to bring a small claim without a lawyer! If you have suffered an injustice but the monetary value is not high enough to hire a lawyer to handle the claim, […]",
            "length": "49172648",
            "sourceUrl": "https://media.blubrry.com/everyday_law/robertamonahan.wpengine.com/everyday-law/EDL-051-20170114-small-claims.mp3"
        },
        {
            "title": "EDL 050 – Joseph Fusz and The Jefferson Inn",
            "datePublished": "Sat, 07 Jan 2017 13:59:55 +0000",
            "description": "Joseph Fusz is a Lake County attorney with a wide breadth of experience in civil and criminal law. Though he has worked in many different counties in Illinois, he has always maintained his ties to the Lake County legal community. Currently he is in private practice in Lake County and is very involved in the […]",
            "length": "32829440",
            "sourceUrl": "https://media.blubrry.com/everyday_law/robertamonahan.wpengine.com/everyday-law/EDL-050-20170107-fusz.mp3"
        },
        {
            "title": "EDL 49 – Mortgage Lending with Waterstone Mortgages",
            "datePublished": "Tue, 03 Jan 2017 12:39:33 +0000",
            "description": "Explore the mortgage lending process with Bryan Schmidt and Wes Dumalski of Waterstone Mortgage. Obtaining a mortgage to purchase a home is more than just running some numbers through a computer program. Schmidt and Dumalski discuss the difference between prequalification and preapproval at the beginning of the home buying experience to the final steps of […]",
            "length": "45011429",
            "sourceUrl": "https://media.blubrry.com/everyday_law/robertamonahan.wpengine.com/everyday-law/EDL-049-20170103-mortgage.mp3"
        },
        {
            "title": "EDL 48 – Elder Law w Ben Neiburger",
            "datePublished": "Fri, 18 Nov 2016 18:24:22 +0000",
            "description": "Join me and expert elder law attorney, Ben Neiburger, JD, CPA, as we discuss his book, “Brighter Skies“, which deals with elder law basics — including how to manage caretaker stress during the sickness of a loved one, helping them with their money, and putting together the team to help manage end-of-life issues!   Robert […]",
            "length": "20437891",
            "sourceUrl": "https://media.blubrry.com/everyday_law/robertamonahan.wpengine.com/everyday-law/EDL-048-20161118-elder.mp3"
        },
        {
            "title": "EDL 47 – Injured on the Job? Should You Sue Your Boss?",
            "datePublished": "Sat, 12 Nov 2016 00:20:08 +0000",
            "description": "Join me and Workers Compensation Attorney Brian Laughlin, as we discuss work injuries, and what you should do about them: Should you hire a lawyer? What are your rights? Will your boss fire you if you bring a claim? Listen in to find out more!   Robert Monahan, Esq. is a lawyer in Gurnee, IL […]",
            "length": "38698423",
            "sourceUrl": "https://media.blubrry.com/everyday_law/robertamonahan.wpengine.com/everyday-law/EDL-047-20161111-workers-comp.mp3"
        },
        {
            "title": "EDL 46 – Fighting Injustice in Small Claims Court",
            "datePublished": "Fri, 04 Nov 2016 17:55:14 +0000",
            "description": "So many people are victimized in little ways — a friend won’t repay a loan; a repairman leaves a hole in your drywall; you can’t get a refund for shoddy merchandise that you paid good money for, etc. When you can’t find a lawyer to help, because there is not enough money involved, you can […]",
            "length": "10463333",
            "sourceUrl": "https://media.blubrry.com/everyday_law/robertamonahan.wpengine.com/everyday-law/EDL-046-20161104-small-claims.mp3"
        },
        {
            "title": "Ep 43 – County Board Member Sandy Hart (reprise)",
            "datePublished": "Fri, 07 Oct 2016 22:32:12 +0000",
            "description": "Join us as we reprise an earlier episode with Lake County Board Member Sandra Hart! Robert Monahan, Esq. is a lawyer in Gurnee, IL with his own practice in personal injury. He has a radio show on Thursday nights at 7 pm, called “Everyday Law,” on WRLR 98.3 FM, where he tries to demystify the […]",
            "length": "34670030",
            "sourceUrl": "https://media.blubrry.com/everyday_law/robertamonahan.wpengine.com/everyday-law/EDL_004_20150716.mp3"
        },
        {
            "title": "Ep 42: Matt Stanton – Dem. Candidate for States Attorney",
            "datePublished": "Fri, 30 Sep 2016 22:15:24 +0000",
            "description": "Matt Stanton is the Democratic candidate for the Lake County States Attorney. Stanton has a family and criminal law practice and also teaches at Chicago-Kent College of Law. He is critical of the current administration of the Lake County States Attorney’s office and has a positive platform for change if he is elected.   Robert […]",
            "length": "52453634",
            "sourceUrl": "https://media.blubrry.com/everyday_law/robertamonahan.wpengine.com/everyday-law/EDL-042-20160930-stanton.mp3"
        },
        {
            "title": "Episode 41: Child Support",
            "datePublished": "Fri, 16 Sep 2016 19:32:10 +0000",
            "description": "Join me and Assistant States Attorney Jen Steffen as we discuss how the State of Illinois can help you get child support! It is a free service, where the custodial parent can use the state government to compel the other parent to pay! There is a free program to assist custodial parents with obtaining, enforcing […]",
            "length": "38698423",
            "sourceUrl": "https://media.blubrry.com/everyday_law/robertamonahan.wpengine.com/everyday-law/EDL-041-20160916-child-support.mp3"
        },
        {
            "title": "Episode 40: Justice Larry Inglis (ret.)",
            "datePublished": "Fri, 02 Sep 2016 19:37:55 +0000",
            "description": "Please join us as we have a special guest on Everyday Law — Justice Larry Inglis — who began his law practice in 1960 and has practiced longer than I have been alive. We begin by discussing the background and career of Justice Inglis, from his time in private practice to his career on the […]",
            "length": "59123461",
            "sourceUrl": "https://media.blubrry.com/everyday_law/robertamonahan.wpengine.com/everyday-law/EDL-040-20160902-Inglis.mp3"
        },
        {
            "title": "Episode 39: Domestic Violence Felony Prosecution with Mary Kay Foy",
            "datePublished": "Fri, 05 Aug 2016 09:51:31 +0000",
            "description": "Join me and the President of the Association of Women Attorneys of Lake County, Assistant State’s Attorney Mary Kay Foy, as we discuss the prosecution of domestic violence felonies. Attorney Foy explains the psychology behind battered-spouse syndrome, answers questions, like “Why will the state prosecute if the victim wants to drop the charges?” and delves […]",
            "length": "35488496",
            "sourceUrl": "https://media.blubrry.com/everyday_law/robertamonahan.wpengine.com/everyday-law/EDL-039-20160805-DV.mp3"
        },
        {
            "title": "Episode 38: School Discipline in Illinois with Neal Takiff",
            "datePublished": "Sat, 30 Jul 2016 02:18:28 +0000",
            "description": "Tune in to Everyday Law as Neal Takiff, of Whitted Takiff and Hansen, discusses new legislation in Illinois, directed at school discipline, and intended to balance out racial inequities in school law issues — including zero tolerance policies, suspension and expulsion standards and practices, and much more!  ",
            "length": "22559765",
            "sourceUrl": "https://media.blubrry.com/everyday_law/robertamonahan.wpengine.com/everyday-law/EDL-038-20160729-School-Discipline.mp3"
        },
        {
            "title": "Episode 37: Sex Crimes",
            "datePublished": "Fri, 22 Jul 2016 10:54:57 +0000",
            "description": "Join me and Fred Day — the Chief of the Sex Crimes Division of the Lake County States Attorneys Office — as we discuss sex crimes: what makes these cases special, why a separate division was created for them, evidence issues, and common scenarios. Click the “READ MORE” button below for the full show notes. […]",
            "length": "47365359",
            "sourceUrl": "https://media.blubrry.com/everyday_law/robertamonahan.wpengine.com/everyday-law/EDL-037-20160722-sex-crimes.mp3"
        },
        {
            "title": "Episode 36: Government Transparency Initiative with Board Member Sandra Hart",
            "datePublished": "Fri, 15 Jul 2016 18:44:42 +0000",
            "description": "See your Lake County government like never before! The Lake County Board has a budget of $500 million per year, and now, for the first time, their finance and budget meetings will be video-recorded for TV and internet. Join us as Everyday Law discusses this new Government Transparency Initiative with Lake County Board Member Sandra […]",
            "length": "28937973",
            "sourceUrl": "https://media.blubrry.com/everyday_law/robertamonahan.wpengine.com/everyday-law/EDL-036-20160715-Transparency.mp3"
        },
        {
            "title": "Episode 35: Family Law with Mike Strauss and Craig Mandell",
            "datePublished": "Tue, 12 Jul 2016 03:08:41 +0000",
            "description": "Join us at Everyday Law as we talk Family Law — from the set up of the divorce to its conclusion — including the psychology and the strategy behind the break-up of a marriage. Learn from two expert family law attorneys, Michael Strauss and Craig Mandell about how clients come to the decision to split […]",
            "length": "50099648",
            "sourceUrl": "https://media.blubrry.com/everyday_law/robertamonahan.wpengine.com/everyday-law/EDL-035-20160707-Family.mp3"
        },
        {
            "title": "Episode 34: Wills and Trusts (reprise)",
            "datePublished": "Sat, 18 Jun 2016 23:18:51 +0000",
            "description": "Death and taxes! You can’t avoid them! Tune in as I discuss wills and trusts with Jeff O’Kelley of Lesser Lutrey Pasquesi and Howe! Robert Monahan, Esq. is a lawyer in Gurnee, IL with his own practice in personal injury. He has a radio show on Thursday nights at 7 pm, called “Everyday Law,” on […]",
            "length": "17883118",
            "sourceUrl": "https://media.blubrry.com/everyday_law/robertamonahan.wpengine.com/everyday-law/EDL_004_20150702.mp3"
        },
        {
            "title": "Episode 33: Judge Fred Foreman",
            "datePublished": "Sat, 11 Jun 2016 20:21:31 +0000",
            "description": "Join me and Judge Fred Foreman — Mr. Lake County — as we discuss topics as various as Nat King Cole, Donald Trump, Mentoring and Leadership. We also cover past and recent politics and Judge Foreman’s illustrious career, which included terms as the Lake County State’s Attorney, the US Attorney for the N.D.Ill, and the […]",
            "length": "50813112",
            "sourceUrl": "https://media.blubrry.com/everyday_law/robertamonahan.wpengine.com/everyday-law/EDL-033-20160611-Foreman.mp3"
        },
        {
            "title": "Episode 31: Personal Injury and Med Mal",
            "datePublished": "Fri, 29 Apr 2016 20:44:23 +0000",
            "description": "Join me and Jacqui Melius of Dudley & Lake as we discuss personal  injury work — including motor vehicle accidents, medical malpractice and nursing home negligence. Together, we address the common questions that people have when involved in these kinds of claims and attempt to demystify them for you and your family!  ",
            "length": "54260874",
            "sourceUrl": "https://media.blubrry.com/everyday_law/robertamonahan.wpengine.com/everyday-law/EDL-031-20160429-PI.mp3"
        },
        {
            "title": "Episode 30: Traffic and DUIs with Julio Argueta",
            "datePublished": "Sat, 02 Apr 2016 01:38:10 +0000",
            "description": "In this episode, Attorney Julio Argueta joined me to discuss traffic and DUI offenses. We discussed how Attorney Argueta decided to become a lawyer, how he developed a show of his own that broadcasts from Waukegan, as well as the substantive issues regarding traffic, DUI offenses and Secretary of State issues.  ",
            "length": "55711173",
            "sourceUrl": "https://media.blubrry.com/everyday_law/robertamonahan.wpengine.com/everyday-law/EDL-030-20160401-DUI.mp3"
        },
        {
            "title": "Episode 29: Lawyer as Artist (Preview)",
            "datePublished": "Fri, 11 Mar 2016 22:52:21 +0000",
            "description": "Is practicing law an art? Is it a craft? How much self-expression do you really want your lawyer to put into his or her work? Join us at Everyday Law as we preview these questions about art and creativity in the law of real estate, family law and trial work. Is Real Estate Law Creative? […]",
            "length": "14861944",
            "sourceUrl": "https://media.blubrry.com/everyday_law/robertamonahan.wpengine.com/everyday-law/EDL-029-20160311-Artist.mp3"
        },
        {
            "title": "Episode 28: Judge John Phillips (ret.) and Specialty Courts",
            "datePublished": "Sat, 05 Mar 2016 22:03:40 +0000",
            "description": "Join me and Judge John Phillips (ret.) as Everyday Law delves into Lake County’s specialty courts — including drug court, mental health court and veterans court — which help offenders rehabilitate, rather that just lock ’em up and throw away the key!  ",
            "length": "24587027",
            "sourceUrl": "https://media.blubrry.com/everyday_law/robertamonahan.wpengine.com/everyday-law/EDL-028-20150304-specialty-courts.mp3"
        },
        {
            "title": "Episode 26: An “Overdue Chat” with the Law Librarian",
            "datePublished": "Sat, 20 Feb 2016 15:22:52 +0000",
            "description": "Join me and Joanne Vandestreek — the law librarian of the William D. Block Memorial Law Library — as we discuss how the law library is not for lawyers only, but for any citizen who needs legal help. Ms. Vandestreek walks us through the print and on-line resources available, and we discuss the Center for […]",
            "length": "53071758",
            "sourceUrl": "https://media.blubrry.com/everyday_law/robertamonahan.wpengine.com/everyday-law/EDL-026-20160220-Overdue-Chat.mp3"
        },
        {
            "title": "Episode 25: How Your Attorney Values Your Injury in $$$",
            "datePublished": "Fri, 12 Feb 2016 16:36:03 +0000",
            "description": "On today’s podcast of “Everyday Law,” we discuss how to measure the value of your injury in $$$. We discuss the three legal factors — the medical bills, the lost income, and the pain and suffering — as well as the emotional factor of the injustice by the defendant. In other words, how badly did […]",
            "length": "11176388",
            "sourceUrl": "https://media.blubrry.com/everyday_law/robertamonahan.wpengine.com/everyday-law/EDL-025-20160212-injury-value.mp3"
        },
        {
            "title": "Episode 24: Mediation with Judge Terry Brady",
            "datePublished": "Fri, 05 Feb 2016 23:23:43 +0000",
            "description": "Mediation offers a way to resolve legal claims that is faster and less expensive than courtroom litigation. Judge Terry Brady, a retired Lake County judge, has been practicing mediation for the past 10 years. His 27 years on the bench have equipped him with a wealth of experience that allows him to bring people together […]",
            "length": "34692000",
            "sourceUrl": "https://media.blubrry.com/everyday_law/robertamonahan.wpengine.com/everyday-law/EDL-024-20160205-Mediation.mp3"
        },
        {
            "title": "Episode 23: Anatomy of a Trial",
            "datePublished": "Fri, 29 Jan 2016 22:45:15 +0000",
            "description": "In this episode, join me as we discuss the four main parts of a trial — the opening statement, the direct examination, the cross examination and the closing argument. We also delve behind the scenes a little, to discuss the evidence rules that govern what happens at trial!  ",
            "length": "40731519",
            "sourceUrl": "https://media.blubrry.com/everyday_law/robertamonahan.wpengine.com/everyday-law/EDL-023-20160129-trial.mp3"
        },
        {
            "title": "Episode 21: Helping Those In Need – Prairie State Legal Services",
            "datePublished": "Fri, 18 Dec 2015 16:09:16 +0000",
            "description": "If you can’t put food on the table, or a roof over the heads of your children, the last thing you think you can afford is a lawyer — no matter how desperately you may need one. That’s where Prairie State Legal Services comes in. Sam DiGrino, the managing attorney of Prairie State Legal Services […]",
            "length": "55140663",
            "sourceUrl": "https://media.blubrry.com/everyday_law/robertamonahan.wpengine.com/everyday-law/EDL-021-20151218-Prairie.mp3"
        },
        {
            "title": "Episode 20: Cybercrime and Protecting Your Family Online",
            "datePublished": "Fri, 04 Dec 2015 17:00:22 +0000",
            "description": "Though technology has changed our lives in countless positive ways, there is also a dark side to technology. Mary Stanton, Chief of the cybercrime and white collar crime unit of the Lake County State’s Attorney’s Office, has seen the explosive growth of crime associated with the internet.  ",
            "length": "41392065",
            "sourceUrl": "https://media.blubrry.com/everyday_law/robertamonahan.wpengine.com/everyday-law/EDL-019-20151204-Cyber-Crime.mp3"
        },
        {
            "title": "Episode 19: Health Insurance and Car Accidents",
            "datePublished": "Thu, 26 Nov 2015 00:12:13 +0000",
            "description": "The Accident Victim and the Un-Cashable $50,000 Check After I had opened the doors of my law practice, one of my first clients came to see me, just a little too late. Her problem was this. She had settled her accident case on her own, without consulting me, or any other attorney. She hadn’t done that badly […]",
            "length": "7110486",
            "sourceUrl": "https://media.blubrry.com/everyday_law/robertamonahan.wpengine.com/everyday-law/EDL-019-20151125-health-continued.mp3"
        },
        {
            "title": "Episode 18: Caring for Your Elderly Parents – Powers of Attorney and Guardianships",
            "datePublished": "Fri, 20 Nov 2015 16:03:49 +0000",
            "description": "What does a Power of Attorney or Guardianship Have to do with Caring for My Elderly Parents? Caring for your elderly parents can be hard; but it can be even harder without a good plan. Part of any plan for helping your aging parents includes a having an experienced lawyer draft a power of attorney, […]",
            "length": "41551935",
            "sourceUrl": "https://media.blubrry.com/everyday_law/robertamonahan.wpengine.com/everyday-law/EDL-018-20151120-poas.mp3"
        },
        {
            "title": "Episode 17: Who Pays Your Bills in an Accident?",
            "datePublished": "Wed, 11 Nov 2015 00:39:00 +0000",
            "description": "Who pays your medical bills after an accident — your health insurance, or the car insurance of the guy who hit you? Click to listen to the “Accidents and Health Insurance” podcast!  ",
            "length": "13054696",
            "sourceUrl": "https://media.blubrry.com/everyday_law/robertamonahan.wpengine.com/everyday-law/EDL-017-20151110-Health-Insurance.mp3"
        },
        {
            "title": "Episode 16: Basic Criminal Law",
            "datePublished": "Fri, 06 Nov 2015 04:07:02 +0000",
            "description": "If you or a family member ever get caught in the criminal justice system, it can be extraordinarily stressful — to say the least! This episode of Everyday Law focuses on criminal defense, by walking a drug felony through the procedural steps of a criminal case : from the investigation, to the arrest, to the […]",
            "length": "55045361",
            "sourceUrl": "https://media.blubrry.com/everyday_law/robertamonahan.wpengine.com/everyday-law/EDL-016-20151105-criminal.mp3"
        },
        {
            "title": "Episode 15: Auto Accident Insurance Basics",
            "datePublished": "Fri, 30 Oct 2015 01:52:35 +0000",
            "description": "How can you protect yourself and your family if you are involved in an auto accident? The best protection is to buy good auto insurance. However, most people do not know what is included in their auto insurance policy or how it protects them in the case of an accident. Everyday Law explores the menu […]",
            "length": "18357333",
            "sourceUrl": "https://media.blubrry.com/everyday_law/robertamonahan.wpengine.com/everyday-law/EDL-015-20151029-Auto-Accident-Insurance.mp3"
        },
        {
            "title": "Episode 14: Judge Mitchell Hoffman on Foreclosure Court",
            "datePublished": "Sun, 25 Oct 2015 00:20:09 +0000",
            "description": "Judge Mitchell Hoffman is a Lake County Circuit Judge, presently serving in the Chancery Court. One of the areas of law that he deals with in Chancery Court is mortgage foreclosures, which has been a matter of concern since the Great Recession. As the mortgage foreclosure crisis grew, it became apparent that additional resources would […]",
            "length": "59396741",
            "sourceUrl": "https://media.blubrry.com/everyday_law/robertamonahan.wpengine.com/everyday-law/EDL-014-20151024-Hoffman.mp3"
        },
        {
            "title": "Episode 13: Buying or Selling Your Home",
            "datePublished": "Sat, 10 Oct 2015 23:56:40 +0000",
            "description": "Judy Maldonado is an expert real estate lawyer in Gurnee, Illinois and discussed the many pitfalls that can occur in the process of buying or selling a home. Click here to listen to the entire podcast of Buying or Selling Your Home!  ",
            "length": "53691771",
            "sourceUrl": "https://media.blubrry.com/everyday_law/robertamonahan.wpengine.com/everyday-law/EDL-013-20151010-Buying-Home.mp3"
        },
        {
            "title": "Episode 12: Home Repairs Gone Awry",
            "datePublished": "Fri, 25 Sep 2015 02:54:11 +0000",
            "description": "How can homeowners protect themselves from unscrupulous home repair/remodeling contractors? Expert litigator Mark Van Donselaar outlines what homeowners can do before, during and after a home repair or remodeling to ensure that they are protected against home repairs gone awry. Van Donselaar has handled many home repair cases as an attorney with the Grayslake firm […]",
            "length": "51813462",
            "sourceUrl": "https://media.blubrry.com/everyday_law/robertamonahan.wpengine.com/everyday-law/EDL-012-20150924-Home-Repair.mp3"
        },
        {
            "title": "Episode 11: Rear-End Accidents",
            "datePublished": "Wed, 23 Sep 2015 02:43:16 +0000",
            "description": "In our podcast, Maria and I discussed rear-end accidents, using Maria’s recent accident as our point of departure. While fault is generally clear in these cases, due to the failure to follow the “assured clear distance ahead rule,” the defense generally attempts to show that the injured party is not that badly injured, and that […]",
            "length": "18358755",
            "sourceUrl": "https://media.blubrry.com/everyday_law/robertamonahan.wpengine.com/everyday-law/EDL-011-20150922-Rear-Enders.mp3"
        },
        {
            "title": "Episode 10: Everyday Law Goes Into Bankruptcy",
            "datePublished": "Fri, 11 Sep 2015 02:59:39 +0000",
            "description": "Click here for Bankruptcy Podcast! Sharanya Gururajan has practiced in the area of bankruptcy for 10 years and is an attorney with Ralph, Schwab & Schiever, Chartered ( www.rss-chtd.com). Her interest in this area of the law started with a summer job as a law student with a bankruptcy firm. She loves her work in […]",
            "length": "52265276",
            "sourceUrl": "https://media.blubrry.com/everyday_law/robertamonahan.wpengine.com/everyday-law/EDL-010-20150910-Bankruptcy.mp3"
        },
        {
            "title": "Episode 9: Everyday Law Talks Slip and Falls",
            "datePublished": "Wed, 02 Sep 2015 00:51:10 +0000",
            "description": "In this episode, Everyday Law talks slip and fall accidents, including why these cases are challenging for injured victims, the “Goldilocks defense,” the “notice defense,” and natural versus unnatural accumulations of snow and ice, and how homeowners can take steps to protect themselves from claims.   [pdf-embedder url=”https://robertamonahan.wpengine.com/wp-content/uploads/2016/07/EDL-Slips.pdf” download=”on” title=”Everyday Law Episode 09 – Slip […]",
            "length": "17716770",
            "sourceUrl": "https://media.blubrry.com/everyday_law/robertamonahan.wpengine.com/everyday-law/EDL-009-20150901-slips.mp3"
        },
        {
            "title": "Episode 8: Everyday Law Goes Back to School with Neal Takiff",
            "datePublished": "Fri, 28 Aug 2015 21:28:55 +0000",
            "description": "Click here for Back to School/Education Law Podcast! Neal Takiff and his firm, Whitted Takiff & Hansen, specialize in education or school law. His firm is perhaps the only law firm in Illinois that represents both sides of school law, representing both parents and school districts (though not in the same case). Takiff’s position is […]",
            "length": "52883438",
            "sourceUrl": "https://media.blubrry.com/everyday_law/robertamonahan.wpengine.com/everyday-law/EDL_008_20150828_takiff.mp3"
        },
        {
            "title": "Wills and Trusts",
            "datePublished": "Fri, 03 Jul 2015 03:34:07 +0000",
            "description": "Everyday Law is so grateful to Jeff O’Kelley of Lesser Lutrey McGlynn and Howe for joining us to discuss Wills, Trusts and Estates. Our lively conversation ranged from the dangers of dying without a will and the estate plan that Illinois may have in store for you to the basics of trusts.",
            "length": "17883118",
            "sourceUrl": "https://media.blubrry.com/everyday_law/robertamonahan.wpengine.com/everyday-law/EDL_004_20150702.mp3"
        }
    ]
}