{
    "artwork": "http://is2.mzstatic.com/image/thumb/Music62/v4/37/56/01/37560108-3244-5b5e-c820-4dee709cca5f/source/100x100bb.jpg",
    "description": "The Michigan Department of Corrections - Field Operations Administration (MDOC FOA) Field Days features interviews with parole and probation agents from around the state. Hosts Noah Nagy and Greg Straub offer witty banter and fun to their listeners.",
    "feedURL": "http://feeds.soundcloud.com/users/soundcloud:users:178503826/sounds.rss",
    "podcastURL": "http://soundcloud.com/field-days",
    "title": "Field Days",
    "episodes": [
        {
            "title": "Celebrating Veterans Day with MVAA Director Adams",
            "datePublished": "Tue, 10 Nov 2020 16:39:21 +0000",
            "description": "On the latest episode of Field Days, we're celebrating Veterans Day with Michigan Veterans Affairs Agency (MVAA) Director Zaneta Adams! Director Adams was medically discharged with honor after serving eight years with the U.S. Army, National Guard and Reserve, and now leads the MVAA in their mission to provide support, care, advocacy and service to veterans and their families. Director Adams joins Chris Gautz and Greg Straub to talk about the MDOC's status as a Silver Veteran Friendly Employer, and what we can all do to help support veterans and active duty service members.\nTo learn more about Director Adams and the MVAA, visit: https://www.michiganveterans.com/",
            "length": "19004603",
            "sourceUrl": "http://feeds.soundcloud.com/stream/926239003-field-days-mvaa-director-adams.mp3"
        },
        {
            "title": "The Dangers of K2 and other Synthetic Cannabinoids",
            "datePublished": "Tue, 27 Oct 2020 14:01:23 +0000",
            "description": "On the latest episode of Field Days, the Michigan Department of Correction's Chief Medical Officer, and Friend of the Pod, Dr. Carmen McIntyre Leon discusses the dangers of synthetic cannabinoids. Synthetic cannabinoids, including brand name versions like K2 and Spice, are a group of man-made chemicals often misleadingly called synthetic marijuana. Dr. McIntyre Leon shares the danger and unpredictiability of K2, how MDOC staff are working to keep it out of prisons, and what behavior and symptoms both field and prison staff should look for if they suspect K2 use by offenders.",
            "length": "23537788",
            "sourceUrl": "http://feeds.soundcloud.com/stream/918360352-field-days-the-dangers-of-k2.mp3"
        },
        {
            "title": "Discussion With Director Washington",
            "datePublished": "Thu, 15 Oct 2020 12:31:57 +0000",
            "description": "After a seven month hiatus, the Field Days podcast returns from a new, virtual studio. Director Heidi Washington joins Chris Gautz and Greg Straub for a discussion on COVID-19, the hard work and incredible dedication MDOC staff have shown throughout the pandemic, and what staff can expect going forward in a year that was nothing less than unexpected.",
            "length": "29548459",
            "sourceUrl": "http://feeds.soundcloud.com/stream/910634107-field-days-discussion-with-director-washington.mp3"
        },
        {
            "title": "Calvin Prison Initiative",
            "datePublished": "Tue, 10 Mar 2020 15:36:02 +0000",
            "description": "On the latest episode of Field Days, Chris and Greg sit down with Calvin University Professor Dr. Todd Cioffi. Dr. Cioffi is the Director for the Calvin Prison Initiative, a unique program that provides a liberal arts education to prisoners at Richard A. Handlon Correctional Facility. Each year, 20 students from prisons around Michigan are selected and enrolled in the five year program. This spring, for the first time, prisoners will be graduating from Calvin University with a Bachelor's Degree in Faith and Community Leadership. Learn more at: https://calvin.edu/prison-initiative/",
            "length": "27274761",
            "sourceUrl": "http://feeds.soundcloud.com/stream/773748745-field-days-calvin-prison-initiative.mp3"
        },
        {
            "title": "Employee Appreciation Banquet 2020",
            "datePublished": "Tue, 03 Mar 2020 14:30:20 +0000",
            "description": "On the latest episode of Field Days, Chris and Greg have the pleasure of announcing the Master of Ceremonies for the 2020 MDOC Employee Appreciation Banquet, Crissa Blankenburg! Crissa is the acting manager for the Office of Community Corrections, a previous Professional Excellence Award winner, and a dedicated MDOC and State of Michigan employee.",
            "length": "12766144",
            "sourceUrl": "http://feeds.soundcloud.com/stream/769544731-field-days-employee-appreciation-banquet-2020.mp3"
        },
        {
            "title": "Opioid Use Disorder Awareness Week",
            "datePublished": "Tue, 25 Feb 2020 15:10:08 +0000",
            "description": "Governor Whitmer proclaimed February 24 - 29, 2020 Opioid Use Disorder Awareness Week in Michigan. Opioid use disorder is a chronic health condition that affects tens of thousands in Michigan, many of whom are housed in our prisons or on parole or probation. MDOC Chief Medical Officer Dr. Carmen McIntyre Leon sat down with Chris and Greg to talk about the science behind substance abuse, the department's Medication-Assisted Treatment program, and why changing the way we think about addiction is key to solving the nation's opioid crisis.\nAlso in this episode: \nAddiction Neuroscience 101:  https://www.youtube.com/watch?v=bwZcPwlRRcc\nMarquette Branch Prison History: https://soundcloud.com/field-days/marquette-branch-prison-history",
            "length": "26092354",
            "sourceUrl": "http://feeds.soundcloud.com/stream/766006057-field-days-opioid-use-disorder-awareness-week.mp3"
        },
        {
            "title": "Gender Responsive Programs and Services",
            "datePublished": "Tue, 18 Feb 2020 20:09:30 +0000",
            "description": "On the latest episode of Field Days, Deputy Warden Karri Osterhout joins Chris and Greg to discuss gender responsive programming and services at Women's Huron Valley Correctional Facility.\nIn 2018, the MDOC launched a Gender Informed Practice Assessment at Women’s Huron Valley Correctional Facility and put it's focus on the unique needs of female offenders. That work led to the creation of the WHV Strategic Plan. The plan is designed to make sure the facility offers programs and care that is gender responsive, trauma-informed and evidence-based. Review the WHV Strategic Plan at: https://www.michigan.gov/documents/corrections/WHV_Strategic_Plan_2019_2022_665149_7.pdf",
            "length": "19356106",
            "sourceUrl": "http://feeds.soundcloud.com/stream/762829807-field-days-gender-responsive.mp3"
        },
        {
            "title": "Trauma Informed Training",
            "datePublished": "Tue, 11 Feb 2020 21:30:33 +0000",
            "description": "Trauma is a costly public health problem occurring as a result of violence, abuse, and other emotionally harmful experiences. The Michigan Department of Corrections realizes the impact of trauma on both staff and offenders and is taking steps to become a trauma-informed department. On the latest episode of Field Days, Chris and Greg sit down with OPT Psychologist Adriane Foster, one of three employees leading the department's training on trauma and ACEs: Adverse Childhood Experiences.\nLearn more about the Michigan ACE Initiative at https://www.miace.org/",
            "length": "17896593",
            "sourceUrl": "http://feeds.soundcloud.com/stream/759000277-field-days-trauma-informed-training.mp3"
        },
        {
            "title": "Absconder Recovery Unit",
            "datePublished": "Wed, 05 Feb 2020 14:59:44 +0000",
            "description": "On the latest episode of Field Days, Chris and Greg are joined by Friend of the Pod and Field Days fan favorite, Lieutenant Charles Levens. This past weekend was a busy one for the Lieutenant's Absconder Recovery Unit. ARU was hard at work searching for MDOC prisoner Talleon Stephon Brazil, who was improperly released following a court appearance in Ohio. Mr. Brazil is now back in custody and \"L.T.\" is back on Field Days to share how they tracked him down.\n\nMDOC Strategic Plan 2019 Progress Report: https://www.michigan.gov/documents/corrections/STRATEGIC_PLAN_Progress_report_2019_FINAL_680120_7.pdf",
            "length": "24934608",
            "sourceUrl": "http://feeds.soundcloud.com/stream/755476696-field-days-absconder-recover-unit.mp3"
        },
        {
            "title": "MDOC COMS Project: 2020 update",
            "datePublished": "Tue, 28 Jan 2020 17:07:54 +0000",
            "description": "On the latest episode of Field Days, Greg and Holly sit down with Jeff Anderson, administrator with the Office of Research and Planning, for an update on the Corrections Offender Management System (COMS) roll out. Tune in to find out what's in store for COMS and MDOC staff in 2020!",
            "length": "23708315",
            "sourceUrl": "http://feeds.soundcloud.com/stream/750609820-field-days-2020-coms-update.mp3"
        },
        {
            "title": "Special Olympics Michigan",
            "datePublished": "Tue, 21 Jan 2020 15:16:26 +0000",
            "description": "On the latest episode of Field Days, Chris and Greg sit down with Andrea Rachko with Special Olympics Michigan and Macomb Correctional Law Enforcement Torch Run volunteers Robert Leduc, Frank Sgambati, and Karen Solgot. Listen now for details on upcoming fundraising events and volunteer opportunities, including polar plunges throughout the state, and how staff and their families can join in and make a difference in the life of some amazing Michigan athletes.\n\nField Days Extra: Listen back to when Deputy Director Rus Marlan took the plunge! https://soundcloud.com/field-days/field-days-podcast-deputy-director-marlan-takes-the-plunge",
            "length": "24166399",
            "sourceUrl": "http://feeds.soundcloud.com/stream/747073963-field-days-special-olympics-michigan.mp3"
        },
        {
            "title": "Strategic Plan Progress Report",
            "datePublished": "Tue, 14 Jan 2020 14:35:24 +0000",
            "description": "On the latest episode of Field Days, Chris Gautz and Greg Straub give listeners a sneak peek at the upcoming Strategic Plan Progress Report, discuss the statistics behind the steady and safe decline of Michigan's prison population, and give a shout out to retiring Assistant Deputy Director Lloyd Rapelje.\nView the MDOC Strategic Plan: https://www.michigan.gov/documents/corrections/Corrections_Strategic_Plan_2014-18_456710_7.pdf\n\nPrevious episodes with Dr. Brian Lovins:\nhttps://soundcloud.com/field-days/referees-vs-coaches\nhttps://soundcloud.com/field-days/brian-lovins-podcast",
            "length": "27453230",
            "sourceUrl": "http://feeds.soundcloud.com/stream/742995490-field-days-strategic-plan-progress-report-1.mp3"
        },
        {
            "title": "A Look Ahead for 2020",
            "datePublished": "Tue, 07 Jan 2020 15:53:33 +0000",
            "description": "On the latest episode of Field Days, Chris Gautz and Greg Straub look at what's ahead for the Michigan Department of Corrections in 2020.\n\nMichigan’s prison population continued its steady and safe decline in 2019. Data-driven policies, evidence-based research and the department's Offender Success model all led to the reduction, which brought the state prison population down to a number not seen since the mid-1990s.\n\n2019 was a fantastic year for the Department of Corrections. We're excited to share just a peek of what 2020 will bring!",
            "length": "22782954",
            "sourceUrl": "http://feeds.soundcloud.com/stream/739710595-field-days-a-look-ahead-for-2020.mp3"
        },
        {
            "title": "2019 Year In Review",
            "datePublished": "Tue, 31 Dec 2019 14:15:38 +0000",
            "description": "Join Chris Gautz and Greg Straub for the last Field Days episode of 2019. It was a year of big changes, exciting events, and continued commitment to employee wellness and offender success. \nA huge thank you and Happy New Year to our 2019 listeners and guests! \n\nMiss Michigan USA Photo Credit: Edwin Shaw Photography",
            "length": "33702555",
            "sourceUrl": "http://feeds.soundcloud.com/stream/736021429-field-days-2019-year-in-review.mp3"
        },
        {
            "title": "Holiday Wellness: Appreciation and Acceptance",
            "datePublished": "Tue, 24 Dec 2019 16:00:03 +0000",
            "description": "The third and final episode of our holiday wellness series is all about appreciation and acceptance. Wellness Unit manager Lynn Gorski and chaplain coordinator Lloyd Scharer return to Field Days to discuss the art of appreciation and, as the new year quickly approaches, how to look back on your 2019 goals and achievements with acceptance and a positive perspective.\n\nThe MDOC Wellness Unit page: https://www.michigan.gov/corrections/0,4551,7-119-96900---,00.html\n\nPlease know that you are not alone. Help does exist and is available to you at any time. You can also call the Suicide Prevention Lifeline at 800-273-8255 or Safe Call Now at 206-459-3020.",
            "length": "23590033",
            "sourceUrl": "http://feeds.soundcloud.com/stream/731079430-field-days-holiday-wellness-appreciation-and-acceptance.mp3"
        },
        {
            "title": "Holiday Wellness: Family, Friends, and Faith",
            "datePublished": "Tue, 17 Dec 2019 13:32:38 +0000",
            "description": "The Field Days Holiday Wellness podcast series continues with a look at the many different ways family, friends, and faith can impact our lives this time of year. On today's episode, Chris and Greg are joined by wellness coordinator Sandi Powell and chaplain coordinator Lloyd Scharer who offer listeners insights on helpful ways to support yourself, your family, and your co-workers during the busy holiday season.\n\nThe MDOC Wellness page: https://www.michigan.gov/corrections/0,4551,7-119-96900---,00.html",
            "length": "23114813",
            "sourceUrl": "http://feeds.soundcloud.com/stream/728866822-field-days-holiday-wellness-episode2.mp3"
        },
        {
            "title": "Holiday Stress And Wellness",
            "datePublished": "Tue, 10 Dec 2019 14:57:14 +0000",
            "description": "This week, to help celebrate the season, Field Days is kicking off the podcast series Presents, Presence, and Patience during the Holidays - Strategies for Managing Wellness & Self-Care.\n\nOn today's episode, Chris and Greg sit down with Wellness Unit manager Lynn Gorski and wellness coordinator Lennie Alcorn for an update on the roll-out of the Wellness Unit and to discuss healthy ways of coping with the stress that even the happiest of holiday seasons can bring.",
            "length": "19790784",
            "sourceUrl": "http://feeds.soundcloud.com/stream/725381125-field-days-holiday-stress-and-wellness.mp3"
        },
        {
            "title": "Medication Assisted Treatment Program",
            "datePublished": "Tue, 03 Dec 2019 16:29:08 +0000",
            "description": "In mid-November, Governor Gretchen Whitmer and members of the Michigan Opioids Task Force announced Michigan's strategy to combat the opioid crisis. More than 20 percent of incarcerated individuals in Michigan have been identified as having an opioid-use disorder and studies show that those released from incarceration are at a higher risk of overdose and death from opioids when they return home.\nOn this episode of Field Days, Bureau of Health Care Services acting administrator Marti Kay Sherry and Substance Abuse Services manager Beth Boyd share details on the department's Medication-Assisted Treatment Program and how it supports offender recovery, reduces overdose and death, and reduces recidivism.",
            "length": "23363917",
            "sourceUrl": "http://feeds.soundcloud.com/stream/722179648-field-days-medication-assisted-treatment-program.mp3"
        },
        {
            "title": "MDOC COMS Project: Health Care",
            "datePublished": "Tue, 26 Nov 2019 15:05:15 +0000",
            "description": "The latest episode of Field Days is the 4th installment in a series tracking the roll out of the new Corrections Offender Management System (COMS). Chris and Greg sit down with Acting Health Care Administrator Marti Kay Sherry and Health Informatics Manager Liz Solomon to discuss the COMS Health Care module and the benefits it will bring to managing prisoner health care needs in Michigan.",
            "length": "18718719",
            "sourceUrl": "http://feeds.soundcloud.com/stream/718412035-field-days-coms-health-care-podcast.mp3"
        },
        {
            "title": "Educational Programming at Thumb Correctional",
            "datePublished": "Tue, 19 Nov 2019 13:47:51 +0000",
            "description": "On the latest episode of Field Days, Chris and Greg head back to school to learn about the education program at Thumb Correctional and how it's preparing prisoners for success. School principal Jim Gornick and teacher Debbie Laidler share the details of their unique approach to education in prison and how it benefits staff and students alike.\n\nMichigan Radio's Stateside program recently spent a day behind the gates with prisoners and staff at Lakeland Correctional. Learn more about their experience with Life on the Inside:  https://lakeland.michiganradio.org/",
            "length": "23638098",
            "sourceUrl": "http://feeds.soundcloud.com/stream/715361266-field-days-educational-programming-at-thumb-correctional.mp3"
        },
        {
            "title": "Blue Star Service Dogs",
            "datePublished": "Tue, 12 Nov 2019 18:49:52 +0000",
            "description": "On the latest episode of Field Days, we celebrate Veterans Day with an episode about Blue Star Service Dogs and their training program at Thumb Correctional. Blue Star rescues shelter dogs, trains them through their prison programs, and pairs them with veterans with post traumatic stress disorder or traumatic brain injury. Listen now to find out how prisoners and staff alike are helping to serve veterans with invisible wounds.\nFor more on Blue Star Service Dogs visit:https://www.bluestarservicedogs.org/\nMeet Alan and Boss: https://www.macombdaily.com/lifestyles/service-circuit-veteran-partnered-with-service-dog-thanks-to-blue/article_a182f16a-98e2-11e9-a33d-0fdb5564ce2a.html",
            "length": "15720279",
            "sourceUrl": "http://feeds.soundcloud.com/stream/709360762-field-days-blue-star-service-dogs.mp3"
        },
        {
            "title": "Lt. Governor Gilchrist",
            "datePublished": "Tue, 05 Nov 2019 19:31:40 +0000",
            "description": "Late last week, Field Days hosts Chris Gautz and Greg Straub had the honor of sitting down with Michigan Lt. Governor Garlin Gilchrist. The Lt. Governor shared details on his work to reform Michigan's criminal justice system, his thoughts on the MDOC Vocational Village programs, and how much he appreciates the hard work and dedication of all state employees. Listen now!",
            "length": "23239783",
            "sourceUrl": "http://feeds.soundcloud.com/stream/708352708-field-days-lt-governor-gilchrist.mp3"
        },
        {
            "title": "MDOC COMS Project: Change Network",
            "datePublished": "Tue, 29 Oct 2019 14:04:29 +0000",
            "description": "On the latest episode of Field Days, Chris and Greg speak with Warden Noah Nagy and Gregg Bourdo, Project Manager for the Organizational Change Management team on the COMS project. Noah and Gregg share an update on the ongoing COMS roll out and details on the COMS Change Network, an established group of MDOC staff tasked with helping get the entire department ready for COMS.",
            "length": "24791248",
            "sourceUrl": "http://feeds.soundcloud.com/stream/701741413-field-days-coms-change-network.mp3"
        },
        {
            "title": "Miss Michigan USA",
            "datePublished": "Tue, 22 Oct 2019 13:49:45 +0000",
            "description": "On the latest episode of Field Days, MDOC Probation Agent and recently crowned Miss Michigan USA, Chanel Johnson chats with Chris and Greg about her pageant win and her plans for the upcoming Miss USA competition in 2020. Make sure to stay tuned after the interview for a shout out to Chanel from a very special guest. Listen now!\n\nPhoto Credit: Chanel Johnson via Twitter @MissMIUSA",
            "length": "21893954",
            "sourceUrl": "http://feeds.soundcloud.com/stream/699542341-field-days-miss-michigan-usa.mp3"
        },
        {
            "title": "Prison Puppies with Leader Dogs for the Blind",
            "datePublished": "Tue, 15 Oct 2019 15:46:27 +0000",
            "description": "On the latest episode of Field Days, Greg is celebrating World Sight Day with producer Joelle Craddy and some very special guests. Melissa Spooner is the coordinator of Prison Puppies, a training initiative of Leader Dogs for the Blind that pairs prisoners with puppies for twelve months of intensive training toward the pup's future career as a leader dog. Prison Puppies is currently operating in ten prisons throughout Michigan and Dianna LaFraugh, an MDOC Reentry Coordinator, serves as the Corrections Liaison. Golden retriever Gordon Ramsey joins the group as the Leader Dogs for the Blind ambassador.",
            "length": "22543045",
            "sourceUrl": "http://feeds.soundcloud.com/stream/695702716-field-days-leader-dogs-for-the-blind-and-prison-puppies.mp3"
        },
        {
            "title": "Green Valley Farmers Market At Women's Huron Valley",
            "datePublished": "Tue, 08 Oct 2019 18:35:56 +0000",
            "description": "On the latest episode of Field Days, Chris is joined by producer Joelle Craddy for a tour of the Women's Huron Valley Horticulture Program and the Green Valley Farmers Market. The first of its kind in Michigan, Green Valley is a farmers market held behind the prison gate, with produce grown and sold by prisoners and purchased by MDOC employees. Michigan Attorney General Dana Nessel even had the chance to stop by recently! Listen now to find out how the first year went for this unique and innovative program.\n\nCheck out our Flickr Album of photos from the Valley Farms Market at: https://www.flickr.com/photos/142788094@N03/albums/72157711251165946",
            "length": "18348407",
            "sourceUrl": "http://feeds.soundcloud.com/stream/692870878-field-days-whv-farmers-market.mp3"
        },
        {
            "title": "International Podcast Day",
            "datePublished": "Tue, 01 Oct 2019 16:51:07 +0000",
            "description": "On the latest episode of Field Days, Chris and Greg celebrate #InternationalPodcastDay with a return to one of our most popular episodes - the unveiling of the MDOC's new Strategic Plan with Director Heidi Washington. Listen now!",
            "length": "18370977",
            "sourceUrl": "http://feeds.soundcloud.com/stream/689552773-field-days-international-podcast-day.mp3"
        },
        {
            "title": "CFA Administrative Assistants Conference Podcast",
            "datePublished": "Tue, 24 Sep 2019 15:08:54 +0000",
            "description": "On the latest episode of Field Days, Chris and Greg once again hand the mics over to a few of their hardworking MDOC co-workers. This time around it's some of the amazing CFA administrative assistants we have working at facilities throughout Michigan. Chris had a chance to catch up with them at the recent CFA Administrative Assistants Conference in Mount Pleasant. Listen now!\n\nMusic from filmmusic.io\n\"Wholesome\" by Kevin MacLeod (incompetech.com)\nLicense: CC BY (creativecommons.org/licenses/by/4.0/)",
            "length": "19917426",
            "sourceUrl": "http://feeds.soundcloud.com/stream/686093095-field-days-cfa-aa-conference-podcast.mp3"
        },
        {
            "title": "COMS Food Service",
            "datePublished": "Tue, 17 Sep 2019 15:00:16 +0000",
            "description": "On the latest episode of Field Days, Chris and Greg share the mics with Kevin Weissenborn and Greg Torrey for a COMS update all about MDOC Food Service.",
            "length": "20645510",
            "sourceUrl": "http://feeds.soundcloud.com/stream/682208324-field-days-coms-food-service.mp3"
        },
        {
            "title": "Field Days Podcast - Week In Review 9/10/19",
            "datePublished": "Tue, 10 Sep 2019 19:47:14 +0000",
            "description": "Tune in to this week's abbreviated episode of the Field Days Podcast where hosts Chris and Greg share all the events happening this week - from Thursday's MSP Pistol Shoot to Saturday's ChadTough5k.",
            "length": "10792959",
            "sourceUrl": "http://feeds.soundcloud.com/stream/679237920-field-days-field-days-podcast-week-in-review-91019.mp3"
        },
        {
            "title": "Planning Michigan's First Green Prison",
            "datePublished": "Wed, 04 Sep 2019 15:26:35 +0000",
            "description": "Communications Representative Holly Kramer and Physical Plant Administrator Ed Vallad join Chris for an episode of Field Days all about planning Michigan's first green prison. Ed shares details on the future solar array at St. Louis Correctional, what cost and energy saving measures are currently underway across the MDOC, and a few of the other projects on his greening wish list. Along the way you'll hear from special guests, with surprise shout outs you don't want to miss. Wondering where Greg was this week? Have a listen!",
            "length": "20859923",
            "sourceUrl": "http://feeds.soundcloud.com/stream/675915542-field-days-green-prison-podcast.mp3"
        },
        {
            "title": "Michigan Supreme Court Chief Justice McCormack",
            "datePublished": "Tue, 27 Aug 2019 16:36:10 +0000",
            "description": "On the latest episode of Field Days, Chris and Greg sit down for a chat with Bridget Mary McCormack, Chief Justice of the Michigan Supreme Court.\nField Days was honored to meet with Chief Justice McCormack in her chambers at the Michigan Hall of Justice to discuss the Criminal Justice Commission, her plans to sit in on circuit and district court cases and so much more. Tune in now to hear Chief Justice McCormack's plan to head to prison in September for the ChadTough5k.",
            "length": "20029439",
            "sourceUrl": "http://feeds.soundcloud.com/stream/671737493-field-days-chief-justice-mccormack-podcast.mp3"
        },
        {
            "title": "West Michigan CLEAR Podcast",
            "datePublished": "Tue, 20 Aug 2019 12:35:40 +0000",
            "description": "On the latest episode of Field Days, Chris and Greg sit down with Community Coordinator Angie Sprank and Grand Rapids Police Officer Dan Myers to discuss CLEAR - Coalition, Leadership, Education, Advice, Rehabilitation. Formed a decade ago, the CLEAR West Michigan group exists to provide guidance and mentoring to returning citizens, while forging a positive relationship with law enforcement. And it's not alone; several CLEAR groups, including a West Michigan group specifically for women returning to the community, have followed. Listen now!\n\nCalling all MDOC employees and retirees! Learn more about the upcoming Employee Recreation Day in the U.P. with a previous episode of Field Days: https://soundcloud.com/field-days/up-engagement-event-day\n\nA CLEAR way forward - MDOC Medium Blog: https://medium.com/@MichiganDOC/a-clear-way-forward-c418f6c7a453",
            "length": "21941184",
            "sourceUrl": "http://feeds.soundcloud.com/stream/668162750-field-days-west-michigan-clear-podcast.mp3"
        },
        {
            "title": "Dr. Brian Lovins Podcast",
            "datePublished": "Tue, 13 Aug 2019 13:34:19 +0000",
            "description": "On the latest episode of Field Days, Chris and Greg welcome back Friend of the Pod Dr. Brian Lovins. A Principal for Justice System Partners, Dr. Lovins is the Co-Editor for the American Probation and Parole Association's (APPA) Perspectives Journal, the former Assistant Director of Harrison County Community Supervision and Corrections Department and the President Elect for APPA.",
            "length": "25339192",
            "sourceUrl": "http://feeds.soundcloud.com/stream/664843367-field-days-brian-lovins-podcast.mp3"
        },
        {
            "title": "Oakland County Job Fair",
            "datePublished": "Tue, 06 Aug 2019 16:38:21 +0000",
            "description": "On the latest episode of Field Days, Chris and Greg hit the road to record on location at the Oakland County Job Fair. Hear from field staff who organized the job fair, and from an employer and recruiter who are both ready to give returning citizens a second chance.",
            "length": "22629145",
            "sourceUrl": "http://feeds.soundcloud.com/stream/661986212-field-days-oakland-county-job-fair.mp3"
        },
        {
            "title": "Pretrial, Probation and Parole Supervision Week",
            "datePublished": "Tue, 30 Jul 2019 17:52:31 +0000",
            "description": "On the latest episode of Field Days, Chris and Greg hand the mics over to some very special guests as we celebrate Pretrial, Probation and Parole Supervision week. We sat down with agents from across the state to find out about the work they do, their career paths to the MDOC and why they enjoy working in corrections. Listen now!\n\nMusic from https://filmmusic.io\n\"Wholesome\" by Kevin MacLeod (https://incompetech.com)\nLicense: CC BY (http://creativecommons.org/licenses/by/4.0/)",
            "length": "29010963",
            "sourceUrl": "http://feeds.soundcloud.com/stream/658628084-field-days-pretrial-probation-and-parole-supervision-week.mp3"
        },
        {
            "title": "Offender Success in Michigan's Upper Peninsula",
            "datePublished": "Tue, 23 Jul 2019 13:00:52 +0000",
            "description": "On the latest episode of Field Days, Chris and Greg kick off Pretrial, Probation, and Parole Supervision Week with a call across the Mighty Mac to discuss some fantastic offender success stats with FOA Supervisor Kevin Ayotte and Community Coordinator Jason Sides.\n\nThe Mining Journal article: https://www.miningjournal.net/news/front-page-news/2019/05/offender-success-program-focus-of-recent-forum/",
            "length": "19489853",
            "sourceUrl": "http://feeds.soundcloud.com/stream/655223159-field-days-offender-success-in-michigans-upper-peninsula.mp3"
        },
        {
            "title": "Corrections Offender Management System Project",
            "datePublished": "Tue, 16 Jul 2019 15:40:57 +0000",
            "description": "On the latest episode of Field Days, Chris and Greg sit down with Jeff Anderson, administrator with the Office of Research and Planning, who is currently overseeing the development and roll-out of the department's new, purpose-built corrections software; Corrections Offender Management System (COMS). Jeff shares the current status of the roll-out, the many benefits of a system explicitly designed for corrections, and what staff can expect moving forward.",
            "length": "25310353",
            "sourceUrl": "http://feeds.soundcloud.com/stream/651987209-field-days-comsproject.mp3"
        },
        {
            "title": "Tree Trim Program Launch at Parnall Correctional",
            "datePublished": "Wed, 10 Jul 2019 15:17:29 +0000",
            "description": "On July 9th, 2019, the MDOC launched an exciting new partnership with DTE Energy and IBEW Local 17 at Parnall Correctional; a Line Clearance and Tree Trim program. Speakers at the press event included Governor Gretchen Whitmer, who made her first trip inside a Michigan prison to congratulate staff and participants on this fantastic addition to Michigan's groundbreaking Vocational Village. Listen to the launch press conference in its entirety with the latest episode of Field Days!",
            "length": "28141608",
            "sourceUrl": "http://feeds.soundcloud.com/stream/649128653-field-days-dte-tree-trim-program-launch-at-parnall-correctional.mp3"
        },
        {
            "title": "Office Recruit Training and Family Orientation",
            "datePublished": "Tue, 02 Jul 2019 18:34:29 +0000",
            "description": "On the latest episode of Field Days, Chris and Greg are joined by Chris Schweikert with the MDOC New Employee Training Section. Chris discusses a relatively new part of Officer Recruit Training; Family Orientation. Learn what Chris, his training team, and the department are doing to ensure families have the information they need to support their recruit during training and throughout their future career.\n\nApplications being accepted at: https://agency.governmentjobs.com/examinations/default.cfm?action=viewJob&jobID=890661",
            "length": "19604792",
            "sourceUrl": "http://feeds.soundcloud.com/stream/645273135-field-days-office-recruit-training-and-family-orientation.mp3"
        },
        {
            "title": "Family Reunification Podcast",
            "datePublished": "Tue, 25 Jun 2019 17:24:14 +0000",
            "description": "On the latest episode of Field Days, you'll hear about a special event at the Capitol honoring parents who were reunited with their children after they made positive changes in their lives. Two of those parents were probationers in the Swift and Sure Sanctions Program.\n\nClinton County Agent Monica Bailey, Gratiot County Agent Heidi McMurphy and Swift and Sure Program Coordinator Samantha Rice share details on the day and what it meant to those involved.",
            "length": "21700857",
            "sourceUrl": "http://feeds.soundcloud.com/stream/641935200-field-days-family-reunification-podcast.mp3"
        },
        {
            "title": "MDOC Wellness Program Manager Lynn Gorski",
            "datePublished": "Tue, 18 Jun 2019 16:11:56 +0000",
            "description": "On the latest episode of Field Days, Chris and Greg are joined by Lynn Gorski, manager of the recently announced MDOC Wellness Program. Already hard at work, and still in the early stages of building her team, Gorski shares her passion for working with law enforcement professionals and her vision of what the program will offer employees, retirees and families.",
            "length": "6718274",
            "sourceUrl": "http://feeds.soundcloud.com/stream/638576142-field-days-mdoc-wellness-program-manager-lynn-gorski.mp3"
        },
        {
            "title": "MDOC Shooting Team",
            "datePublished": "Tue, 11 Jun 2019 18:45:14 +0000",
            "description": "On the latest episode of Field Days, Chris and Greg sit down with Erin DeLoof and Michael Brown of the MDOC Shooting Team, a non-profit organization that gives all MDOC employees a chance to hone their shooting skills while also joining their co-workers in competition, fun and camaraderie.",
            "length": "24620720",
            "sourceUrl": "http://feeds.soundcloud.com/stream/635170203-field-days-mdoc-shooting-team.mp3"
        },
        {
            "title": "Director's Award Winner Jennifer Metro",
            "datePublished": "Tue, 04 Jun 2019 14:27:38 +0000",
            "description": "On the latest episode of Field Days, Chris and Greg have the chance to talk with the 2019 Director's Award Winner, Jennifer Metro. Metro, a prison counselor at Kinross Correctional, shares how honored she was to be nominated for a Professional Excellence Award and what a surprise it was to take home two awards the night of the Employee Appreciation Banquet. Make sure to stay tuned after the interview for some special guests!",
            "length": "27416867",
            "sourceUrl": "http://feeds.soundcloud.com/stream/631483587-field-days-directors-award-winner-jennifer-metro.mp3"
        },
        {
            "title": "Up Engagement Event Day",
            "datePublished": "Wed, 29 May 2019 12:39:14 +0000",
            "description": "Tune in to this week's episode to hear more about the Sept. 27 Employee Engagement Day in Brimley. Kinross Correctional Facility Corrections Program Coordinator Merle Vollick shares details, including some activities you can expect to see at the inaugural UP event.\nYou'll also hear about a NEW Scavenger Hunt at Employee Rec Day on June 7. Listen closely for clues from Muskegon Correctional Facility Corrections Program Coordinator Hillary Follick that will be sure to give you an edge over the competition.",
            "length": "17789177",
            "sourceUrl": "http://feeds.soundcloud.com/stream/628073646-field-days-up-engagement-event-day.mp3"
        },
        {
            "title": "FOA Assistant Deputy Director Warren Wilson",
            "datePublished": "Tue, 21 May 2019 13:22:33 +0000",
            "description": "On the latest episode of Field Days, Chris and Greg sit down with new Assistant Deputy Director Warren Wilson. ADD Wilson shares his immediate and future goals for the Office of Parole Probation Services, as well as the unique way Deputy Director Marlan offered him his new role.",
            "length": "18499708",
            "sourceUrl": "http://feeds.soundcloud.com/stream/623609502-field-days-add-warren-wilson.mp3"
        },
        {
            "title": "2019 Candice Dunn Agent Of The Year Jason Maue",
            "datePublished": "Tue, 14 May 2019 19:13:51 +0000",
            "description": "On the latest episode of Field Days, Chris and Greg sit down with the Michigan Department of Corrections 2019 Candice Dunn Agent of the Year, Jason Maue. Maue discusses his work supervising specialized caseloads, learning and coaching Motivational Interviewing and his moving speech at the recent Employee Appreciation Banquet.",
            "length": "35004498",
            "sourceUrl": "http://feeds.soundcloud.com/stream/620623290-field-days-2019-candice-dunn-agent-of-the-year-jason-maue.mp3"
        },
        {
            "title": "2019 Employee Recreation Day Podcast",
            "datePublished": "Tue, 07 May 2019 18:18:03 +0000",
            "description": "On the latest episode of Field Days, Greg and Chris travel to Royal Scot in Lansing to meet with two members of the 2019 EPIC Employee Engagement Committee, Jeramie Mangus and Ragina Cannon. Jeramie and Ragina share all the details of the upcoming Employee Recreation Day and the team's plans for events throughout the year.",
            "length": "18503052",
            "sourceUrl": "http://feeds.soundcloud.com/stream/617110017-field-days-2019-employee-recreation-day-podcast.mp3"
        },
        {
            "title": "2019 Corrections Officer Of The Year Podcast",
            "datePublished": "Tue, 30 Apr 2019 20:19:09 +0000",
            "description": "On the latest episode of Field Days, Chris and Greg are joined by the 2019 Corrections Officer of the Year, Stephen Cooklin, who discusses his love of his job, his family, and the work he does for his local community. Stay tuned after the interview to hear more about Stephen from his supervisor; friend of the pod, Charles Levens.",
            "length": "25263959",
            "sourceUrl": "http://feeds.soundcloud.com/stream/613797459-field-days-2019-corrections-officer-of-the-year-podcast.mp3"
        },
        {
            "title": "Shakespeare In Prison Podcast",
            "datePublished": "Tue, 23 Apr 2019 17:41:36 +0000",
            "description": "In the latest episode of Field Days, Chris and Greg are joined by Shakespeare in Prison founder Frannie Shepherd-Bates. Just in time for the Bard's birthday, Shepherd-Bates shares insights and outcomes of the program's history and its lasting influence on prisoners given the chance to rehearse, produce and perform some of Shakespeare's greatest works.",
            "length": "26262046",
            "sourceUrl": "http://feeds.soundcloud.com/stream/610312836-field-days-shakespeare-in-prison-podcast.mp3"
        },
        {
            "title": "Field Days Earth Day Podcast",
            "datePublished": "Tue, 16 Apr 2019 14:50:32 +0000",
            "description": "Chris and Greg celebrate Earth Day 2019 with a green edition of the Field Days Podcast! Guests Trever LeBarre and Corey Steinman are part of the MDOC EPIC Recycling Committee; their goal is to continue and improve on current MDOC policies and practices to help lessen the department's environmental impact.",
            "length": "23956165",
            "sourceUrl": "http://feeds.soundcloud.com/stream/606860403-field-days-field-days-earth-day-podcast.mp3"
        },
        {
            "title": "Pell Grant Podcast",
            "datePublished": "Tue, 09 Apr 2019 14:00:12 +0000",
            "description": "Assistant Education Manager Tony Costello joins Greg and Chris to discuss Pell Grants and the educational opportunities they provide for prisoners.",
            "length": "19368227",
            "sourceUrl": "http://feeds.soundcloud.com/stream/602996562-field-days-pell-grant-podcast.mp3"
        },
        {
            "title": "Wayne County Job Fair",
            "datePublished": "Tue, 02 Apr 2019 13:03:16 +0000",
            "description": "Just in time for Second Chance Month, the latest episode of Field Days was recorded on site at the Wayne County Job Fair, a hiring event dedicated to placing returning citizens in careers. Listen as MDOC staff who organized the event, as well as vendors eager to hire returning citizens, discuss the fair's fantastic turn out, future events, and their commitment to offender success.",
            "length": "18455404",
            "sourceUrl": "http://feeds.soundcloud.com/stream/599773350-field-days-wayne-county-job-fair.mp3"
        },
        {
            "title": "Celebrate Women's History Month With Retired Warden Pamela Withrow",
            "datePublished": "Tue, 26 Mar 2019 14:05:31 +0000",
            "description": "Greg and Chris celebrate Women's History Month with Michigan's first female warden of a male prison, Pamela Withrow. Listen as now retired Warden Withrow shares how she began her career in corrections, tales of her time with the MDOC, and valuable insight on the evolution of offender success.",
            "length": "28113187",
            "sourceUrl": "http://feeds.soundcloud.com/stream/596089950-field-days-final-pam-withrow-podcast.mp3"
        },
        {
            "title": "Legislative Liaison Kyle Kaminski discusses the 2020 Budget",
            "datePublished": "Tue, 19 Mar 2019 19:35:11 +0000",
            "description": "Legislative Liaison Kyle Kaminski joins Greg and Chris to discuss the 2020 budget. Listen as he provides valuable insight into the current budget proposal, the approval process, and next steps.",
            "length": "21238594",
            "sourceUrl": "http://feeds.soundcloud.com/stream/592636752-field-days-legislative-liaison-kyle-kaminski-discusses-the-2020-budget.mp3"
        },
        {
            "title": "Kellie Fittonneville discusses her passion for her new role as a field agent",
            "datePublished": "Tue, 12 Mar 2019 19:04:25 +0000",
            "description": "Kellie Fittonneville recently became a field agent for the MDOC. Listen as she provides valuable insight on what it takes to be a field agent and offers advice for those looking to take on the role.",
            "length": "17172688",
            "sourceUrl": "http://feeds.soundcloud.com/stream/589043001-field-days-kellie-fittonneville-discusses-her-passion-for-her-new-role-as-a-field-agent.mp3"
        },
        {
            "title": "Field Days Podcast -Executive Director at the Ministry of Justice in England and Wales visits MDOC",
            "datePublished": "Tue, 05 Mar 2019 20:18:26 +0000",
            "description": "Adrian Scott, executive director of electronic monitoring at the Ministry of Justice in England and Wales, visits the MDOC Electronic Monitoring Center in Lansing.\nIn this week's episode, you'll learn about his visit to the MDOC, what he learned and what ideas he plans to take back with him to implement in  England.",
            "length": "14075610",
            "sourceUrl": "http://feeds.soundcloud.com/stream/585462441-field-days-field-days-podcast-executive-director-at-the-ministry-of-justice-in-england-and-wales-visits-mdoc.mp3"
        },
        {
            "title": "Wayne County Job Fair Preview",
            "datePublished": "Tue, 26 Feb 2019 14:10:10 +0000",
            "description": "In this week's episode you'll learn about the Wayne County Job Fair, a job fair dedicated to placing returning citizens in careers. Listen to how the job fair is developed and how it has grown over the years.",
            "length": "14480612",
            "sourceUrl": "http://feeds.soundcloud.com/stream/581637033-field-days-wayne-county-job-fair-preview.mp3"
        },
        {
            "title": "Field Days Podcast - Your 2019 Employee Appreciation Awards Banquet MC is...",
            "datePublished": "Tue, 19 Feb 2019 14:54:10 +0000",
            "description": "Each year the Employee Appreciation Awards Banquet celebrates and honors hardworking MDOC staff from across the state and from every administration.\n\nThis year, Macomb County Probation Supervisor Deena Grammatico will serve as its MC and she's excited to have the opportunity to recognize her outstanding colleagues in the department. \n\nTune in to this week's episode to hear more about the banquet, its newest MC, and a recap of Gov. Gretchen Whitmer's  first State of the State address.",
            "length": "14773602",
            "sourceUrl": "http://feeds.soundcloud.com/stream/577900839-field-days-field-days-podcast-your-2019-employee-appreciation-awards-banquet-mc-is.mp3"
        },
        {
            "title": "Field Days Podcast - Agent Deb Young rides for a cure",
            "datePublished": "Tue, 12 Feb 2019 15:53:49 +0000",
            "description": "Macomb County Probation Agent Deb Young knows firsthand the toll multiple sclerosis can take on those diagnosed with the disease.\nShe watched her mother battle the illness and vowed to fight for a cure. \nToday she belongs to a cycling team that raises thousands of dollars to support MS research.\nIn this week's episode you'll hear more from Agent Young on how she paired a passion for cycling with her mission to end MS, and how you can get involved too.",
            "length": "18133158",
            "sourceUrl": "http://feeds.soundcloud.com/stream/574220424-field-days-field-days-podcast-agent-deb-young-rides-for-a-cure.mp3"
        },
        {
            "title": "Field Days Podcast - Michigan State Industries",
            "datePublished": "Tue, 05 Feb 2019 17:44:33 +0000",
            "description": "What do road signs, license plates, officer uniforms, and high-quality engraved products have in common?\nThey are all made by Michigan State Industries.\nMSI is a division within the MDOC that provides prisoners with an opportunity to learn valuable work skills, while producing goods used by governments and nonprofits.\nIn this week's episode, you'll learn more about MSI, its products and operations and how it has helped put prisoners on a path to success.",
            "length": "26425468",
            "sourceUrl": "http://feeds.soundcloud.com/stream/570627774-field-days-field-days-podcast-michigan-state-industries.mp3"
        },
        {
            "title": "Field Days Podcast - Officer Recruitment",
            "datePublished": "Tue, 29 Jan 2019 19:08:01 +0000",
            "description": "The Michigan Department of Corrections is looking to hire 700 new corrections officers and staff at Carson City Correctional Facility are stepping up to help.\nIn this week's episode you'll hear from Warden Randee Rewerts and Carson City employees about how they are working to promote careers in corrections and draw new officers to their facility, and to the department.",
            "length": "27932629",
            "sourceUrl": "http://feeds.soundcloud.com/stream/566731995-field-days-field-days-podcast-officer-recruitment.mp3"
        },
        {
            "title": "Field Days Podcast - Gov. Gretchen Whitmer",
            "datePublished": "Tue, 22 Jan 2019 18:06:00 +0000",
            "description": "Gov. Gretchen Whitmer has not wasted any time in getting to know, and thank, state employees for their hard work.\nShe recently visited Michigan Department of Corrections staff  and was impressed by all the amazing work happening across the department.\nTune in to this week's episode  to hear more from Gov. Whitmer about her visit with MDOC employees, what impressed her most, and her vision for corrections moving forward.",
            "length": "11325021",
            "sourceUrl": "http://feeds.soundcloud.com/stream/563009748-field-days-field-days-podcast-gov-gretchen-whitmer.mp3"
        },
        {
            "title": "Field Days Podcast - MDOC's New Strategic Plan",
            "datePublished": "Wed, 16 Jan 2019 19:55:34 +0000",
            "description": "We've come a long way thanks to the hard work of staff across the department and there are so many great things ahead for the MDOC.\n\nTune in to this week's episode to hear Director Heidi Washington share some highlights of the department's newest strategic plan, which will be released soon!",
            "length": "17398803",
            "sourceUrl": "http://feeds.soundcloud.com/stream/560047272-field-days-field-days-podcast-mdocs-new-strategic-plan.mp3"
        },
        {
            "title": "Field Days Podcast - A look ahead at 2019",
            "datePublished": "Tue, 01 Jan 2019 13:30:17 +0000",
            "description": "2018 was an amazing year for the Michigan Department of Corrections and there's so much more in store for 2019.\n\nTune in to the very first episode of the year to hear more about some of the new programs, initiatives and efforts that will shape 2019 for the MDOC.\n\nA big shout out and thanks to all our amazing staff who are working hard and keeping us safe as we kick off the New Year. You are incredible!",
            "length": "17372890",
            "sourceUrl": "http://feeds.soundcloud.com/stream/552636996-field-days-a-look-ahead-at-2019.mp3"
        },
        {
            "title": "Field Days Podcast - 2018 Year in Review",
            "datePublished": "Fri, 21 Dec 2018 18:03:03 +0000",
            "description": "It's been an eventful year for the Michigan Department of Corrections.\nTune in to the final episode of the year to hear a recap of all the department accomplished in 2018.\nA BIG thanks to all our Field Days Podcast listeners for a great season!",
            "length": "30487195",
            "sourceUrl": "http://feeds.soundcloud.com/stream/548331057-field-days-2018-year-in-review.mp3"
        },
        {
            "title": "Field Days Podcast - Going for Olympic Gold",
            "datePublished": "Tue, 18 Dec 2018 16:21:50 +0000",
            "description": "Zoe Glass is a student assistant with the Parole Board and has her sights set on a spot on the 2020 U.S. Olympic Boxing team. What started out as a class for self-defense turned into competitively boxing for eight years and dreams of the Olympics. \n\nListen to the episode of Field Days to learn more about Zoe's journey to Tokyo for the 2020 Summer Olympics.",
            "length": "16103548",
            "sourceUrl": "http://feeds.soundcloud.com/stream/546830088-field-days-going-for-olympic-gold.mp3"
        },
        {
            "title": "Field Days Podcast - Perspectives of a young officer",
            "datePublished": "Tue, 11 Dec 2018 20:26:50 +0000",
            "description": "Corrections Officer Sarah Morgan graduated in May from the Paul Klee Academy class and now works at the Central Michigan Correctional Facility, alongside who she proclaims are amazing staff. \n\nAt 19-years old, CO Morgan was one of the youngest recruits in her class and notes that she is humbled by the experiences she has had thus far. In addition to graduating at the top of her class, she was selected by her peers to speak at the graduation.",
            "length": "24535457",
            "sourceUrl": "http://feeds.soundcloud.com/stream/543569712-field-days-field-days-podcast-perspectives-of-a-young-officer.mp3"
        },
        {
            "title": "Field Days Podcast - Transition with Dignity",
            "datePublished": "Tue, 04 Dec 2018 20:31:49 +0000",
            "description": "Adrian Dirschell, chaplain at Charles E. Egeler Reception and\nGuidance Center and Duane Waters Health Center in Jackson noticed a need to improve the end of life care for prisoners. He along with the support of Warden Jeremy Bush and then warden, Director Washington, have established a hospice program focused on providing humanized care to terminally-ill prisoners. \n\nIn this episode you'll learn more about the department's hospice program and why it is important to change perspectives of those moving to the transition phase of life. \n\nRead the Corrections Connection article about the program, https://www.michigan.gov/documents/corrections/CC_FebruaryNewsletter2018_615529_7.pdf",
            "length": "31020929",
            "sourceUrl": "http://feeds.soundcloud.com/stream/539822748-field-days-transition-with-dignity.mp3"
        },
        {
            "title": "Field Days Podcast - Referees vs. Coaches",
            "datePublished": "Tue, 27 Nov 2018 21:40:06 +0000",
            "description": "Dr. Brian Lovins, is an assistant director for the Harris County Community Supervision and Corrections Department in Texas. The Harris County CSCD supervises roughly 50,000 individuals throughout the year making it the third largest probation department in the United States. \n\nDr. Lovins talks about the future of community corrections and furthers the conversation on the role of parole and probation agents play in offender success. He encourages agents to supervise as coaches and not referees and urges the corrections system to move towards a winning model.",
            "length": "27825631",
            "sourceUrl": "http://feeds.soundcloud.com/stream/536424867-field-days-referees-vs-coaches.mp3"
        },
        {
            "title": "Field Days Podcast - 2018 Veterans Appreciation",
            "datePublished": "Tue, 20 Nov 2018 17:43:58 +0000",
            "description": "Darrick Alvarez, the department's veterans liaison, talks about our veterans support, recruitment and inclusion initiatives.\n\nHe gives a special shout-out to Michigan Veterans Affairs Agency, thanking them for their helpful resources!\n\nWe have nearly 2,000 veterans working in the department, 13 who are currently deployed. We've stepped up our recognition of our veterans and we truly thank them for their service during Veterans Appreciation week. \n\nListen to all our episodes\nSoundCloud: bit.ly/fielddayspodcast\niTunes: bit.ly/FieldDaysiTunes",
            "length": "24878601",
            "sourceUrl": "http://feeds.soundcloud.com/stream/532969920-field-days-2018-veterans-appreciation.mp3"
        },
        {
            "title": "Field Days Podcast - Annual Leave Scheduling",
            "datePublished": "Tue, 13 Nov 2018 21:06:16 +0000",
            "description": "Recently, a Director's Office Memorandum (DOM) was sent to all staff stating, as of January 1, 2019, collective bargaining agreements will no longer contain Annual Leave scheduling provisions. The department has since developed a process for scheduling Annual Leave consistent with the new Civil Service Rules and Regulations.\n\nJared Warner, labor relations manager, and Jonathan Patterson, human resources director, discuss how DOM 2018-27 Annual Leave Scheduling impacts leave scheduling.",
            "length": "12768234",
            "sourceUrl": "http://feeds.soundcloud.com/stream/529449189-field-days-annual-leave-scheduling.mp3"
        },
        {
            "title": "Field Days Podcast - Election Day Special",
            "datePublished": "Tue, 06 Nov 2018 15:15:33 +0000",
            "description": "We have several staff that wear many hats at work, but also in their communities. For a few their public servitude continues beyond their job at the department and extends to holding public office. In this special edition of  Field Days Podcast, you'll hear two interviews from department employees  Steve Gawron (Muskegon) and Scott Wittbrodt (Essexville), who are also mayors of there hometowns. Talk about doing double duty! \n\nChris and Greg also give a few shout outs to other staff that hold public office. \n\nLet your voice be heard. Vote!",
            "length": "20997014",
            "sourceUrl": "http://feeds.soundcloud.com/stream/525656355-field-days-election-day-special.mp3"
        },
        {
            "title": "Field Days Podcast - Pumpkin Palooza",
            "datePublished": "Tue, 30 Oct 2018 21:14:46 +0000",
            "description": "Happy Pumpkoween! \n\nCorrectional facilities across the department have been growing pumpkins, small to nearly 800-pounders for decades -- either for fundraisers or community donations.\n\nThis week on Field Days, Warden Cathy Bauman and Patti Hubble, acting RUM at Alger Correctional Facility, talk about their painted pumpkin fundraiser for the U.P. Honor Flight. \n\nCheck out those pumpkins here: https://www.flickr.com/photos/142788094@N03/sets/72157701808674164/with/44363024864/\n\nAlso, Tim Buis, a CPC at Gus Harrison Correctional Facility shares a few insider secrets to growing giant pumpkins.",
            "length": "22357471",
            "sourceUrl": "http://feeds.soundcloud.com/stream/522340425-field-days-pumpkin-palooza.mp3"
        },
        {
            "title": "Field Days Podcast - Lt. Governor Calley calls attention to opioid addiction",
            "datePublished": "Tue, 23 Oct 2018 12:00:13 +0000",
            "description": "There were 1,941 opioid-related overdose deaths last year in Michigan, that's why Lt. Governor Brian Calley has chosen to speak out about the opioid crisis. \n\nThe Lt. Governor is focused on prevention and finding solutions to the opioid epidemic. \"There are a lot of different reasons why people become addicted. You don't know another persons story, and it doesn't really matter.\" Lt. Gov. Calley wants Michigan to focus less on the stigma of addiction and more on providing treatment. \n\nHear more about what the state of Michigan is doing to end addiction in this episode of Field Days Podcast.\n\nOctober 21-27, 2018, has been declared by Gov. Rick Snyder as Opioid Addiction Awareness Week in Michigan to highlight some the state's initiatives and resources.  \n\nJoin the conversation on social media using the following hashtags - #MiOpioidsAwareness and #EndAddiction\n\nAlso, visit the new opioid awareness website for additional information and resources, Michigan.gov/opioid",
            "length": "22778774",
            "sourceUrl": "http://feeds.soundcloud.com/stream/518434107-field-days-opioids-awareness-with-lt-governor.mp3"
        },
        {
            "title": "Field Days Podcast - Five years of success",
            "datePublished": "Tue, 16 Oct 2018 20:46:25 +0000",
            "description": "In this episode, Director Washington touts the department's tremendous success over the last five years, recounting our accomplishments that are clearly laid out in the first-ever strategic plan progress report. \n\nCopies of the report were sent to all department worksites and can be found on the website here, bit.ly/MDOC-2018-strat-plan-report\n\nAlso, an interview with a passionate woman driven to establish trauma-informed practices in state corrections operations. Toneir (Neen) Cain, is a former offender who had more than her fair share of trauma. Unfortunately, her past lead her to 83 arrests and 66 prison convictions, but she was able to turn her life around. Now, she travels the country to educate others about the importance of trauma-informed care.\n\nTonier will be hosting the third Annual National Healing Neen Trauma Informed Care Conference, in Detroit, October 19-21, 2018. Five MDOC staff with be speaking at the conference, including Director Washington. More information can be found here, https://www.neencares.org/new-events/2018/10/19/third-annual-neen-cares-conference",
            "length": "34363349",
            "sourceUrl": "http://feeds.soundcloud.com/stream/515323890-field-days-strategic-plan-progress-report.mp3"
        },
        {
            "title": "Field Days Podcast - Motivational Interviewing",
            "datePublished": "Tue, 09 Oct 2018 20:05:46 +0000",
            "description": "Motivational Interviewing is a method of communication that helps people move beyond resistance to achieve long-term behavior change.\n\nTeresa Chandler, a training specialist, talks about how establishing Motivational Interviewing skills can lead to positive relationships and reduced stress at work, and even at home.\n\nThere isn't a typical day for Governor Snyder's communications staff, says former press secretary, Anna Heaton. \n\nIn her final days, Anna shares stories of what it was like to work for the Governor.",
            "length": "27860740",
            "sourceUrl": "http://feeds.soundcloud.com/stream/511949460-field-days-motivational-interviewing.mp3"
        },
        {
            "title": "Field Days Podcast - Farewell to ADD Denise Allsberry",
            "datePublished": "Tue, 02 Oct 2018 19:22:42 +0000",
            "description": "Denise Allsberry, assistant deputy director for the Office of Parole and Probation Services, who started her career with the department as a corrections officer in 1977 is retiring after over 41 years of service.   \n\nIn her final days, she shares one last piece of advice and tells a few stories about her time with the department. \n\nDenise's dedication has no doubt positively affected many offenders and staff. She will be missed.",
            "length": "19830490",
            "sourceUrl": "http://feeds.soundcloud.com/stream/508552779-field-days-farewell-to-add-denise-allsberry.mp3"
        },
        {
            "title": "Field Days Podcast - Reliving the glory days",
            "datePublished": "Tue, 25 Sep 2018 20:53:47 +0000",
            "description": "Aside from enjoying pumpkin pie and then washing it all down with some apple cider our host's favorite Fall activity is squabbling over college football. Chris and Greg get to relive some of the glory days of college sports with Shane Jackson, warden at Earnest C. Brooks Correctional Facility and Darrel Stinson, corrections program coordinator at the Special Alternative Incarceration \n\nBoth Shane and Darrel played college football in the early 90s for division I football teams, Shane at Eastern Michigan University and Darrel at Central Michigan University. In this episode, they get a chance to reminisce as CMU gears up for the big game against MSU this weekend, Go Green!\n\nMike Brown, assistant deputy warden at Kinross Correctional Facility and president of the MDOC Shooting Team organization and Eugene Sebaly, corrections officer at Marquette Branch Prison talk about MDOC's success at the 81st Annual Michigan Police Pistol Match.\n\nSheila Hamilton, prison counselor at Women's Huron Valley Correctional Facility, recently gains fame after being selected to sing in a gospel choir that performed at Aretha Franklin's Funeral.",
            "length": "24186043",
            "sourceUrl": "http://feeds.soundcloud.com/stream/505146192-field-days-field-days-podcast-reliving-the-glory-days.mp3"
        },
        {
            "title": "Field Days Podcast - Ojibway closure update",
            "datePublished": "Tue, 18 Sep 2018 20:53:55 +0000",
            "description": "Human Resources Director Jonathan Patterson provides an update on the bumping and layoff process for MDOC staff affected by the Ojibway Correctional Facility Closure.\n\t\nAlso in this podcast, a brief memorial to remember Macomb County probation supervisor Larry McDonald, who unexpectedly passed away. Larry spoke on the podcast after he won Metro Territory Supervisor of the Year in 2017.",
            "length": "13381380",
            "sourceUrl": "http://feeds.soundcloud.com/stream/501804930-field-days-field-days-podcast-ojibway-closure-update.mp3"
        },
        {
            "title": "Field Days Podcast - Take the survey!",
            "datePublished": "Wed, 12 Sep 2018 03:24:31 +0000",
            "description": "EPIC Employee Engagement team members, Lisa Marquette and Brittany Wahr talk about the importance of taking the 2018 Employee Engagement survey.",
            "length": "21413719",
            "sourceUrl": "http://feeds.soundcloud.com/stream/498710238-field-days-take-the-survey.mp3"
        },
        {
            "title": "Field Days Podcast - Week in Review 9/4/18",
            "datePublished": "Tue, 04 Sep 2018 17:27:18 +0000",
            "description": "Tune in to this week's abbreviated episode of Field Days Podcast where hosts, Chris and Greg review topics from FOIA to football.\n\nParole and probation agent Marty Jankowsky from Midland County, and prison counselor Hamilton from Women's Huron Valley Correctional Facility receive shout outs!",
            "length": "11855411",
            "sourceUrl": "http://feeds.soundcloud.com/stream/495153357-field-days-week-in-review-9418.mp3"
        },
        {
            "title": "Field Days Podcast - One Day with God Camp",
            "datePublished": "Tue, 28 Aug 2018 16:56:20 +0000",
            "description": "The One Day With God camp, run by Forgiven Ministry, Inc., aims to provide prisoners with an opportunity to parent from behind bars. \n\nThe camp Is a two-day program, which allows these moms and dads to enjoy a full day of special and meaningful moments with their children.\n\nScottie Barnes, who founded Forgiven Ministry with her husband Jack, shares her stories about the children she hopes will not fall into the cycle of criminality their parents did.",
            "length": "25727476",
            "sourceUrl": "http://feeds.soundcloud.com/stream/491881788-field-days-one-day-with-god-camp.mp3"
        },
        {
            "title": "Field Days Podcast - Dog Programs",
            "datePublished": "Tue, 21 Aug 2018 20:51:02 +0000",
            "description": "The joy a dog brings to a correctional facility is not lost on the prisoners that train them in the 29 dog programs from various agencies or shelters, that operate in 21 correctional facilities across the state. \nDogs trained and rehabilitated in these programs go on to become emotional support companions, therapy dogs, service dogs, and in some cases a well-behaved family pet.\nIn a new episode of Field Days Podcast, Chris and Greg interview two MDOC staff who help facilitate the oldest and the youngest dog programs in the state. They both speak to the positive change they see at the facility, and in the prisoners themselves.\nAmy Houtz, an ARUS at Lakeland Correctional Facility, which is home to the longest running dog training program, The Greyhound Inmate Experience and Devyn Rodgers, a prison counselor at Gus Harrison Correctional Facility, which now operates two dog programs are today’s podcast guests.",
            "length": "22989008",
            "sourceUrl": "http://feeds.soundcloud.com/stream/488748348-field-days-dog-programs.mp3"
        },
        {
            "title": "Special Edition: Ojibway Correctional Facility closure",
            "datePublished": "Tue, 14 Aug 2018 16:50:56 +0000",
            "description": "Realizing this is a challenging time for staff, department spokesman Chris Gautz provides an overview of what to expect for MDOC staff affected by the Ojibway Correctional Facility closure. \n\nHe will share insight as to why OCF was chosen for closure and stresses that the department is working diligently to provide opportunities to fill vacant positions.\n\nYou can read more about the facility closure here: bit.ly/Ojibway-Closure",
            "length": "6800612",
            "sourceUrl": "http://feeds.soundcloud.com/stream/485490438-field-days-special-edition-ojibway-correctional-facility-closure.mp3"
        },
        {
            "title": "Field Days Podcast - PA Corrections Sec. John Wetzel (part 2)",
            "datePublished": "Tue, 07 Aug 2018 20:01:34 +0000",
            "description": "Field Days Podcast - PA Corrections Sec. John Wetzel (part 2) by Field Days",
            "length": "24068596",
            "sourceUrl": "http://feeds.soundcloud.com/stream/482456934-field-days-padoc-wetzel-2.mp3"
        },
        {
            "title": "Field Days Podcast - PA Corrections Sec. John Wetzel",
            "datePublished": "Tue, 31 Jul 2018 20:35:27 +0000",
            "description": "Field Days Podcast - PA Corrections Sec. John Wetzel by Field Days",
            "length": "25918901",
            "sourceUrl": "http://feeds.soundcloud.com/stream/479365764-field-days-pa-corrections-sec-john-wetzel.mp3"
        },
        {
            "title": "Field Days Podcast - Corrections Officer trainer soon to retire",
            "datePublished": "Tue, 24 Jul 2018 21:03:13 +0000",
            "description": "In this episode of Field Days podcast, Chris and Greg interview Lynn Sullivan, a long time employee of the department and a current trainer at the Women's Huron Valley Correctional Facility officer recruit academies. Lynn just wrapped up facilitating training for her second to last academy class leading up to her retirement from the department this coming November. In her interview, she talks about her passion for influencing the next generation of MDOC employees.",
            "length": "24883199",
            "sourceUrl": "http://feeds.soundcloud.com/stream/476221680-field-days-lynn-sullivan-whv.mp3"
        },
        {
            "title": "Field Days Podcast - APPA Visits MDOC",
            "datePublished": "Tue, 17 Jul 2018 20:00:54 +0000",
            "description": "In this episode of the Field Days podcast, the team is joined by a special guest to help celebrate Pretrial, Probation, and Parole Supervision Week, or PPPS Week. Veronica Cunningham (pictured: far right), Executive Director of the American Parole and Probation Association (APPA), joins Chris and Greg to discuss what great work the probation and parole agents of the MDOC do on a daily basis to achieve offender success. \n\nVisit APPA-net.org to learn more about the association.",
            "length": "7776547",
            "sourceUrl": "http://feeds.soundcloud.com/stream/473027136-field-days-appa-visits-mdoc.mp3"
        },
        {
            "title": "Field Days Podcast - 100th!",
            "datePublished": "Tue, 10 Jul 2018 14:00:04 +0000",
            "description": "Field Days Podcast - 100th! by Field Days",
            "length": "46197027",
            "sourceUrl": "http://feeds.soundcloud.com/stream/469389315-field-days-100th.mp3"
        },
        {
            "title": "Field Days Podcast - 2018 Polar Plunge Rerun",
            "datePublished": "Tue, 03 Jul 2018 19:31:39 +0000",
            "description": "Field Days Podcast - 2018 Polar Plunge Rerun by Field Days",
            "length": "18491349",
            "sourceUrl": "http://feeds.soundcloud.com/stream/466878114-field-days-2018-polar-plunge-rerun.mp3"
        },
        {
            "title": "Field Days Podcast - Employee Wellness and PTSD Awareness",
            "datePublished": "Tue, 26 Jun 2018 20:51:35 +0000",
            "description": "This week on the Field Days podcast, hear from special guests Joanne Bridgford, Bill Henderson, Patti Yerke, and Christine Gehring. All are members of the wellness team and are spreading awareness for PTSD, since June is PTSD Awareness month. Also, the wellness team is planning to train and assist MDOC employees with PTSD help, suicide prevention, and decreasing stress.",
            "length": "30223045",
            "sourceUrl": "http://feeds.soundcloud.com/stream/463857681-field-days-field-days-podcast-employee-wellness-and-ptsd-awareness.mp3"
        },
        {
            "title": "Field Days Podcast - 2018 Employee Rec Day",
            "datePublished": "Tue, 19 Jun 2018 16:57:42 +0000",
            "description": "Field Days Podcast - 2018 Employee Rec Day by Field Days",
            "length": "23299969",
            "sourceUrl": "http://feeds.soundcloud.com/stream/460493451-field-days-field-days-podcast-2018-employee-rec-day.mp3"
        },
        {
            "title": "Field Days Podcast - 2018 Corrections Officer of the Year",
            "datePublished": "Wed, 13 Jun 2018 17:50:57 +0000",
            "description": "On this week’s edition of Field Days, we hear from Elwanda Ray, the department's 2018 Corrections Officer of the Year. \n\nOfficer Ray shares her passion for her job and discusses her work with youthful offenders at Thumb Correctional Facility.\n\nOfficer Ray has served with the MDOC for 17 years and is known for her compassion and professionalism.",
            "length": "20564844",
            "sourceUrl": "http://feeds.soundcloud.com/stream/457884480-field-days-2018-corrections-officer-of-the-year.mp3"
        },
        {
            "title": "Field Days Podcast - Last week today on Field Days Podcast",
            "datePublished": "Tue, 05 Jun 2018 20:57:50 +0000",
            "description": "On this week’s edition of Field Days, hear more about the recently announced prison closure and get a  recap of the Mackinac Conference from last week. Also, a special shout out to MDOC Director Heidi Washington from the Governor, Rick Snyder! All this and more on this week’s edition of our Field Days podcast!",
            "length": "15612028",
            "sourceUrl": "http://feeds.soundcloud.com/stream/454289010-field-days-last-week-today-on-field-days-podcast.mp3"
        },
        {
            "title": "Field Days Podcast - 2018 Memorial Day Tribute",
            "datePublished": "Tue, 29 May 2018 20:30:53 +0000",
            "description": "Memorial Day offers a time for reflection and an opportunity to honor those who have served and sacrificed to protect our country. \n\nIn this special edition podcast, we pay tribute to the friends and family of our staff that have bravely served. \n\nWe honor, remember and appreciate their sacrifice.",
            "length": "9857984",
            "sourceUrl": "http://feeds.soundcloud.com/stream/450904959-field-days-2018-memorial-day-tribute.mp3"
        },
        {
            "title": "2018 Director's Award Winner",
            "datePublished": "Tue, 15 May 2018 20:01:58 +0000",
            "description": "Matthew Clausen started his career as a corrections officer at Ojibway Correctional Facility and loved the work. Now as an Institutional Training Officer at Ojibway Correctional Facility was named the winner of the Michigan Department of Corrections Director’s Award for his involvement in developing improved training for corrections staff statewide. \n\nStill, in shock from receiving the department's highest honor, Matt attributes his success to great leadership and colleagues.",
            "length": "20941843",
            "sourceUrl": "http://feeds.soundcloud.com/stream/444521364-field-days-2018-directors-award-winner.mp3"
        },
        {
            "title": "Field Days Podcast - 2018 Candice Dunn Parole/Probation Agent of the Year",
            "datePublished": "Tue, 08 May 2018 20:45:46 +0000",
            "description": "Agent Toni Narvais-Cooklin was named the 2018 Candice Dunn Agent of the Year for her desire to go above and beyond to help offenders achieve success in the communities where they live. Toni has 18 years with the department and currently works at the Tuscola County Parole and Probation Office. \n\nIn this episode, Toni articulates the importance of continuing to instill hope in the offenders she works with.",
            "length": "23011577",
            "sourceUrl": "http://feeds.soundcloud.com/stream/441294618-field-days-2018-candice-dunn-paroleprobation-agent-of-the-year.mp3"
        },
        {
            "title": "Field Days Podcast - Westside Residential Alternative to Prison (WRAP)",
            "datePublished": "Tue, 01 May 2018 18:18:20 +0000",
            "description": "The department's newest WRAP program gives West Michigan judges an additional option during sentencing to lead offenders to a better path that doesn’t include prison time. All counties west of U.S. 127 and in the Upper Peninsula are able to participate. The program targets high-risk probation violators and offers cognitive behavioral therapy and vocational training. \n\nEaton County Undersheriff Jeffrey Cook and Eaton County Agent Clint Auer talk about why the program is important for correcting offenders.",
            "length": "29094973",
            "sourceUrl": "http://feeds.soundcloud.com/stream/437909862-field-days-field-days-podcast-westside-residential-alternative-to-prison-wrap.mp3"
        },
        {
            "title": "Field Days Podcast - A Swift and Sure mini-series (part 2)",
            "datePublished": "Tue, 24 Apr 2018 20:37:43 +0000",
            "description": "The Swift and Sure Sanctions Probation Program (SSSPP) in Clinton/Gratiot County is a program that targets high risk felony probationers and is aimed at returning them to a productive lifestyle. SSSPP strives to reduce the number of probation violations by providing certain and consistent rules and sanctions for the probationer that are administered immediately within 72 hours of detainment. \n\nIn part two, of the Swift and Sure mini-series program coordinator Samantha Rice, 29th Circuit Court Judge Michelle Rick and probation agent Heidi McMurphy share the success of the Swift and Sure Sanctions Program.",
            "length": "44141922",
            "sourceUrl": "http://feeds.soundcloud.com/stream/434625834-field-days-field-days-podcast-a-swift-and-sure-mini-series-part-2.mp3"
        },
        {
            "title": "Field Days Podcast - State Court Administrative Office (SCAO): Swift and Sure program (part 1)",
            "datePublished": "Tue, 17 Apr 2018 20:07:28 +0000",
            "description": "Thomas Myers, a management analyst for the problem-solving courts team, explains what the Swift and Sure court program is in its simplest definition — felony probation.  \nIn part one, of the Swift and Sure mini-series Thomas provides an overview of the State Court Administrative Office involvement in the program. \nStay tuned for next week's episode with Clinton County to learn more about the Swift and Sure court program.  \nSCAO is the administrative agency of the Michigan Supreme Court. The Supreme Court has administrative oversight of Michigan's courts and exercises that oversight through the SCAO.",
            "length": "25744194",
            "sourceUrl": "http://feeds.soundcloud.com/stream/431169390-field-days-field-days-podcast-state-court-administrative-office-scao-swift-and-sure-program-part-1.mp3"
        },
        {
            "title": "Field Days Podcast - Parole Supervisor makes basketball history",
            "datePublished": "Tue, 03 Apr 2018 19:15:55 +0000",
            "description": "Off the court, Delonda Little works as a parole supervisor at the Lawton Parole Office, and on the court as a history-making basketball official\n\nMost recently, Delonda made history on March 17, as one of 12 all-female referees for the Girls Basketball State Finals held at Calvin College – a first in Michigan High School Athletic Association history. Delonda shares her experience being a role model for student-athletes.",
            "length": "21921540",
            "sourceUrl": "http://feeds.soundcloud.com/stream/424306044-field-days-delonda-final-show.mp3"
        },
        {
            "title": "Field Days Podcast - Thinking for a Change",
            "datePublished": "Tue, 20 Mar 2018 20:58:41 +0000",
            "description": "Corrections Officer Jernerro Horton has a passion for being a positive role model in offenders lives. He's been able to exercise that passion by volunteering as a Thinking for a Change (T4C) facilitator at Thumb Correctional Facility. T4C is a cognitive-based program that aims to equip offenders with the proper tools to be successful out in their communities upon release. \n\nOfficer Horton expresses his gratitude for the opportunities he has to help make his community safe through the department's offender success model.\n\nAlso, in this episode Absconder Recovery Unit Lt. Levens sends in a shout out to thank ARU investigator Chad Johnson and Electronic Monitoring Center supervisor Diane Caswell for the teamwork to arrest a sex offender that absconded from parole.",
            "length": "24909530",
            "sourceUrl": "http://feeds.soundcloud.com/stream/416722698-field-days-field-days-podcast-thinking-for-a-change.mp3"
        },
        {
            "title": "Field Days Podcast - Sunshine Week",
            "datePublished": "Tue, 13 Mar 2018 19:05:42 +0000",
            "description": "Annually, the nation celebrates Sunshine Week, which is a celebration of access to public records and information. When the Freedom of Information Act (FOIA) passed it provided a simpler way to access public information and provides an opportunity for open government. \n\nAndy Phelps, policy and FOIA manager, educates listeners on how the MDOC complies with transparency and the work involved in fulfilling a FOIA request.",
            "length": "18855391",
            "sourceUrl": "http://feeds.soundcloud.com/stream/413172834-field-days-field-days-podcast-sunshine-week.mp3"
        },
        {
            "title": "Field Days Podcast - Special Alternative Incarceration (SAI) celebrates 30 years",
            "datePublished": "Tue, 06 Mar 2018 20:47:15 +0000",
            "description": "Special Alternative Incarceration turns 30 this year—to help us celebrate Supervisor Keith Hickmon, Captain Dann Walling, Corporal Kirk Downs, and Community Program Coordinator Darrel Stinson join the podcast to talk about the history and the facilities unique structure built for offender success. \n\nAlso, in this podcast, Probation Sentencing Specialist Kathy Arnold gives a HUGE shout out to a few counties that did an exceptional job in reducing the prison commitment rates for straddle cell offenders.",
            "length": "36633285",
            "sourceUrl": "http://feeds.soundcloud.com/stream/409679859-field-days-sai-celebrates-30-years.mp3"
        },
        {
            "title": "Field Days Podcast - Wayne State University partnership",
            "datePublished": "Tue, 27 Feb 2018 22:19:19 +0000",
            "description": "Wayne State University has partnered with the Michigan Department of Corrections to oversee the health care for inmates in the state’s prisons.\n\nThe agreement gives the state access to WSU’s network of medical experts, and cutting-edge technology backed by leading academic health care experts. Douglas Skrzyniarz from WSU and MDOC health care administrator, Lia Guilick talk about the partnership and future benefits for the department. \n\nAlso, in this podcast, Amanda Elliot sends in a shout out for WHV Deputy Warden Karri Osterhout.",
            "length": "30258990",
            "sourceUrl": "http://feeds.soundcloud.com/stream/406187100-field-days-field-days-podcast-wayne-state-university-partnership.mp3"
        },
        {
            "title": "Field Days Podcast - Snowshoeing with Sasquatch",
            "datePublished": "Tue, 20 Feb 2018 20:57:30 +0000",
            "description": "The February 24 fundraiser event “Snowshoeing with Sasquatch” will be celebrating five years. This FREE Baraga County event will be accepting food donations that are later donated to the local St. Vincent De Paul.  \n\nParticipants get to hike the beautiful trails, enjoy a bonfire and snack on delicious refreshments donated by local businesses. Joe Bouchard, a librarian at Baraga Correctional Facility and founder of the event, shares all the once in a lifetime unique details about Snowshoeing with Sasquatch. \n\nAlso, in this podcast, Deputy Warden Terry Tellez sends in a shout out for Detroit Reentry Center department analyst Abraham Peraza.",
            "length": "20552306",
            "sourceUrl": "http://feeds.soundcloud.com/stream/402656076-field-days-snowshoeing-with-sasquatch.mp3"
        },
        {
            "title": "Field Days Podcast - Deputy Director Marlan takes the plunge",
            "datePublished": "Tue, 13 Feb 2018 18:53:20 +0000",
            "description": "\"Refreshing,\" was one of many words used by Deputy Director Marlan to describe his experience, jumping into a lake on a below freezing day. Dressed in a homemade knitted outfit, Deputy Director Marlan along with other team members at Kent County Parole and Probation Office, participated in the Turk Lake Polar Plunge over the weekend (Feb. 10)which raises funds for the Special Olympics.\n\nKent County Parole and Probation for many years has been a fundraising leader state-wide. So far the team has raised over $18,000 for the cause and still counting.",
            "length": "21201396",
            "sourceUrl": "http://feeds.soundcloud.com/stream/399071169-field-days-field-days-podcast-deputy-director-marlan-takes-the-plunge.mp3"
        },
        {
            "title": "Field Days Podcast - West Shoreline Closure Update",
            "datePublished": "Tue, 06 Feb 2018 19:20:51 +0000",
            "description": "Realizing this is a challenging time for staff, Human Resources Director Jonathan Patterson provides an overview of what to expect for MDOC staff affected by the West Shoreline Correctional Facility Closure. \n\nHe will share an update on the process and stresses the importance of remaining patient while details are finalized. \n\nYou can read more about the facility closure here bit.ly/West-Shoreline-Closure",
            "length": "29395904",
            "sourceUrl": "http://feeds.soundcloud.com/stream/395456136-field-days-west-shoreline-closure-update.mp3"
        },
        {
            "title": "Field Days Podcast - Michigan State of the State mention",
            "datePublished": "Wed, 31 Jan 2018 19:37:00 +0000",
            "description": "Field Days Podcast - Michigan State of the State mention by Field Days",
            "length": "15819336",
            "sourceUrl": "http://feeds.soundcloud.com/stream/392532966-field-days-michigan-state-of-the-state-mention.mp3"
        },
        {
            "title": "Field Days Podcast - Lennie Alcorn",
            "datePublished": "Tue, 23 Jan 2018 20:53:15 +0000",
            "description": "Lennie Alcorn, a Monroe County parole agent, wins 2018 Liberator Award for her efforts to end human trafficking.",
            "length": "31196054",
            "sourceUrl": "http://feeds.soundcloud.com/stream/388078955-field-days-lennie-alcorn.mp3"
        },
        {
            "title": "Honor Guard 30",
            "datePublished": "Tue, 16 Jan 2018 20:14:46 +0000",
            "description": "John Cordell, commander of the MDOC Honor Guard, expresses the hard work and discipline it takes to be one of the dedicated Honor Guard members. 30 years after their creation, they provide a positive representation of the department at numerous ceremonies and events, nation-wide.  \n\nYou can read more about the MDOC Honor Guard on the department's blog, here: bit.ly/HonorGuard30",
            "length": "20613328",
            "sourceUrl": "http://feeds.soundcloud.com/stream/384586508-field-days-honor-guard-30.mp3"
        },
        {
            "title": "Field Days Podcast - 2017 Legislation recap",
            "datePublished": "Tue, 09 Jan 2018 19:17:42 +0000",
            "description": "Several proposed pieces of legislation were passed in 2017 that will have some impact on the department, including the hiring of felons bill. Kyle Kaminski, reentry administrator and acting legislative liaison, reviews those bills and explains the changes they will have on our operations.",
            "length": "18059179",
            "sourceUrl": "http://feeds.soundcloud.com/stream/381153449-field-days-field-days-podcast-2017-legislation-recap.mp3"
        },
        {
            "title": "Field Days Podcast - 2017 MDOC Year in Review",
            "datePublished": "Tue, 02 Jan 2018 19:53:30 +0000",
            "description": "Happy New Year! \n\n2018 is here and for many, it is a time to start fresh and refocus for the days, weeks and months ahead. Before the Field Days Podcast team can move forward with their resolutions, Chris and Greg sit down and hash out the big events, milestones, and accomplishments, as well as recognize staff we lost too soon during 2017.",
            "length": "31122075",
            "sourceUrl": "http://feeds.soundcloud.com/stream/377860388-field-days-2017-mdoc-year-in-review.mp3"
        },
        {
            "title": "Field Days Podcast - 2017 Wrap-up",
            "datePublished": "Tue, 26 Dec 2017 21:02:38 +0000",
            "description": "We're back! Yes, for the final episode of the year and we want to thank all our Field Days Podcast for a great 2017 season. \n\nThe podcast produced 52 episodes with 75 guests, was listened to over 40,000 times and received two awards. Chris, Greg, and Camara have plenty planned for 2018, but until catch this episode highlighting some of their favorite episodes and favorite guests.",
            "length": "24474434",
            "sourceUrl": "http://feeds.soundcloud.com/stream/374692460-field-days-2017-wrap-up.mp3"
        },
        {
            "title": "Field Days Podcast - Wrestler Santa",
            "datePublished": "Tue, 19 Dec 2017 18:48:31 +0000",
            "description": "A 21-year employee of the department, Phil Monahan spends his days as a quartermaster at Parnall Correctional Facility and his free time performing as a professional wrestler and spreads joy during the holiday season as Santa. He has a passion for giving back to the community and uses his wrestling career to advocate against bullying in schools and fundraise for those in need.",
            "length": "25671888",
            "sourceUrl": "http://feeds.soundcloud.com/stream/371767244-field-days-wrestler-santa.mp3"
        },
        {
            "title": "Field Days Podcast - Officer Fineis",
            "datePublished": "Tue, 12 Dec 2017 21:12:34 +0000",
            "description": "Field Days Podcast - Officer Fineis by Field Days",
            "length": "18859153",
            "sourceUrl": "http://feeds.soundcloud.com/stream/368649131-field-days-officer-fineis.mp3"
        },
        {
            "title": "Field Days Podcast - MCO, Move Forward Campaign",
            "datePublished": "Tue, 05 Dec 2017 17:25:15 +0000",
            "description": "Michigan Corrections Organization (MCO) is leading the charge in elevating the corrections profession by way of the Move Forward Campaign, which aims to promote the values and standards that set corrections and forensic officers apart in the criminal justice system in Michigan.  \n\nAndy Potter, Vice President/Chief of Staff and Jeremy Tripp, Director of Government and Political Affairs share the initiatives MCO has taken to reform negative perceptions of corrections professionals.",
            "length": "30446653",
            "sourceUrl": "http://feeds.soundcloud.com/stream/365373536-field-days-mco-move-forward-campaign.mp3"
        },
        {
            "title": "Field Days Podcast - COMPAS and evidence-based sentencing",
            "datePublished": "Tue, 28 Nov 2017 20:58:47 +0000",
            "description": "Mike Keck and Lara Neuman are both experts on the COMPAS program, which acts as an additional tool for probation agents to offer recommendations based on individual's needs to the court for sentencing.\n\nKeck, COMPAS program manager, and Neuman who helped start the pilot program out of Kalamazoo County where she is a supervisor, talk about the important role COMPAS has on evidence-based sentencing.\n\nVan Buren County Judge Kathleen Brickley also advocates for the use of COMPAS at the pre-sentence investigation and shares a story about its success.",
            "length": "40560848",
            "sourceUrl": "http://feeds.soundcloud.com/stream/362186195-field-days-compas-at-psi.mp3"
        },
        {
            "title": "Ear Hustle co-host shares tales of success -Field Days Podcast",
            "datePublished": "Tue, 21 Nov 2017 19:23:18 +0000",
            "description": "Ear Hustle — a slang term for eavesdropping, is a podcast collaboration between Earlonne Woods and Antwan Williams, prisoners at San Quentin State Prison in California, and Nigel Poor, a Bay Area artist who volunteers at the prison.\nProduced inside the prison's media lab, Ear Hustle tells stories about life inside prison walls. The podcast reached number one on the iTunes podcast charts, shortly after its March 2017 release.\nNigel Poor co-host, co-creator, and co-producer shares stories of Ear Hustle's success during this Field Days interview.",
            "length": "33270803",
            "sourceUrl": "http://feeds.soundcloud.com/stream/359035742-field-days-ear-hustle-co-host-shares-tales-of-success.mp3"
        },
        {
            "title": "Competitive Shooting Team - Special Edition",
            "datePublished": "Fri, 17 Nov 2017 16:13:58 +0000",
            "description": "Three sponsored department competitive shooting teams took second place overall, during the 80th Michigan State Police Pistol Match — a first in department history. Deanne \"Dee\" Bodnar, a sergeant at Women’s Huron Valley Correctional Facility and podcast guest, won the High Corrections Individual title. The September 14 competition was held in Jackson where Bodnar and over 30 MDOC shooters went up against 150 competitors. \n\nEPIC Competitive Shooting Team lead, Assistant Deputy Director Robert Napel, and Dee talk about the competition and the plans to drum up support from staff.",
            "length": "32948139",
            "sourceUrl": "http://feeds.soundcloud.com/stream/357154460-field-days-competitive-shooting-team.mp3"
        },
        {
            "title": "Field Days Podcast - MDOC Veterans",
            "datePublished": "Mon, 06 Nov 2017 22:10:32 +0000",
            "description": "\"It's a very small percentage of people who take on a lot for the country.\" Almost 2,000 of that small percentage - of Americans who are or have been active in the military, work for the department. During the inaugural \"Veterans Appreciation Week,\" we honor all our veterans and military service members.  \n\nOur guests in this episode are veterans Todd Butler, policy and FOIA manager,  Wendy Hart, an analyst in the PREA section, and Michael Farmer, administrative manager in the training division.",
            "length": "19884825",
            "sourceUrl": "http://feeds.soundcloud.com/stream/352100807-field-days-mdoc-veterans.mp3"
        },
        {
            "title": "Field Days Podcast - Veterans Appreciation",
            "datePublished": "Tue, 31 Oct 2017 18:13:33 +0000",
            "description": "With approximately 2,000 military service members and veterans working for the Michigan Department of Corrections, we are honored to recognize those who have served and continue to serve to defend our freedoms. \n\nWe thank the MDOC Operational Excellence Military Team for their work to establish the first department-wide \"Veterans Appreciation Week,\" beginning Monday, November 6 through Friday, November 10. Every MDOC worksite will be participating in activities honoring the department's military employees throughout the week. \n\nOur guests in this episode are team members Jeanette (Jay) Cox, newly promoted to departmental technician for the CFA Deputy Director's Office and Warden Tom Winn from Saginaw Correctional Facility.",
            "length": "29226630",
            "sourceUrl": "http://feeds.soundcloud.com/stream/349482161-field-days-veterans-appreciation-2017.mp3"
        },
        {
            "title": "Field Days Podcast - Kevin Kempf and John Baldwin",
            "datePublished": "Tue, 24 Oct 2017 20:03:25 +0000",
            "description": "There's no shortage of great leadership in the corrections industry and as a Field Days Podcast listener you'll hear from two in this new episode. Kevin Kempf, executive director of the Association of State Correctional Administrators and former guest on the podcast sings praises about MDOC staff and shares his appreciation for their hard work to champion offender success. Kempf talks about what’s next in terms of moving the needle in elevating the corrections profession.\n\nJohn Baldwin, director of the Illinois Department of Corrections provides us insight into what his state and staff are uniquely doing on the reentry side of corrections in order to achieve and maintain a 25% reduction in prison population. \n\nDirector Washington also shares a few remarks on employee engagement and future goals.",
            "length": "31335234",
            "sourceUrl": "http://feeds.soundcloud.com/stream/348414967-field-days-kevin-kempf-and-john-baldwin.mp3"
        },
        {
            "title": "Field Days Podcast - Governor Rick Snyder",
            "datePublished": "Tue, 17 Oct 2017 13:39:28 +0000",
            "description": "Governor Rick Snyder made his way to the second Vocational Village at Parnall Correctional Facility for a hands-on experience. Fortunately, for the Field Days podcast crew, he had a few minutes to share his thoughts on the program and where he sees the program going. Without hesitation Snyder thanks the Director and all corrections staff for the around the clock work they do to keep Michigan residents safe. \n\nAlso, in this episode Director Washington steps in as a co-host.",
            "length": "8286457",
            "sourceUrl": "http://feeds.soundcloud.com/stream/347247312-field-days-governor-snyder.mp3"
        },
        {
            "title": "Special Edition - Former MDOC Directors",
            "datePublished": "Wed, 11 Oct 2017 20:36:29 +0000",
            "description": "At the Association of State Correctional Administrators Midwest Directors Conference Director Washington sits alongside two past directors of the department as Field Days Podcast guests. Ken McGinnis director from 1991 to 1999 and Pat Caruso, who was the first female director in MDOC history from 2003 to 2010 recall their biggest accomplishments and struggles as director.",
            "length": "30426591",
            "sourceUrl": "http://feeds.soundcloud.com/stream/346456284-field-days-special-edition.mp3"
        },
        {
            "title": "Field Days Podcast - Week in Review 9/26/17",
            "datePublished": "Tue, 26 Sep 2017 17:42:51 +0000",
            "description": "This week on Field Days Podcast, Chris and Greg discuss a variety of fun topics and give an update on what's been going on in the department the past couple of weeks.",
            "length": "17988962",
            "sourceUrl": "http://feeds.soundcloud.com/stream/344137822-field-days-week-in-review-92617.mp3"
        },
        {
            "title": "Field Days Podcast - Roger French is coach of the year",
            "datePublished": "Tue, 19 Sep 2017 19:16:33 +0000",
            "description": "Roger French, a Prison Counselor at the Newberry Correctional Facility, has talents that extend beyond prison walls and have gained statewide recognition. \n\nHe was recently selected by the Basketball Coaches Association of Michigan as a Girls' State Coach of the Year and was also named Coach of the Year for his region. \n\nIn this episode, Greg and Chris talk to French about how his coaching helped bring the Engadine Eagles basketball team to the MHSAA Tournament.",
            "length": "16665285",
            "sourceUrl": "http://feeds.soundcloud.com/stream/343115302-field-days-roger-french.mp3"
        },
        {
            "title": "Field Days Podcast - SECC charitable giving",
            "datePublished": "Tue, 12 Sep 2017 16:53:20 +0000",
            "description": "The State Employees Charitable Campaign begins Sept. 18 and provides an opportunity for staff to give back to their communities by contributing to any of the more than 1,000 charities supported by the annual fundraiser.\n\nLast year Michigan Department of Corrections employees raised $97,872 through payroll deduction donations alone. \n\nTune in to hear from Heather Travis, Program Director of the State Employees Charitable Campaign, on how your donated dollars help local organizations provide services to those in need. Visit www.misecc.org for more information about the campaign.",
            "length": "23911026",
            "sourceUrl": "http://feeds.soundcloud.com/stream/342051555-field-days-secc-charitable-giving.mp3"
        },
        {
            "title": "Field Days Podcast - Carey Guides Pilot",
            "datePublished": "Tue, 05 Sep 2017 06:40:05 +0000",
            "description": "The role of a Field Agent and the interactions our agents have with the offenders they supervise is critical to public safety and reducing the overall risk of the offender. Evidence-Based Practices indicate it is imperative for field staff to address an offender’s criminogenic. \nThe Department has chosen to pilot Carey Guides with 100 field agents including our guest, Angel Lucas, a probation agent in Bay County, in order to provide an additional resource to agents. The guides are designed to be used in three ways; stand-alone intervention, as a reinforcement of another program intervention and ad-hoc intervention.",
            "length": "31570128",
            "sourceUrl": "http://feeds.soundcloud.com/stream/340967242-field-days-field-days-podcast-carey-guides-pilot.mp3"
        },
        {
            "title": "Field Days Podcast - Parnall Vocational  Village",
            "datePublished": "Tue, 29 Aug 2017 16:34:42 +0000",
            "description": "The Vocational Village at Parnall Correctional Facility will host its' first open house tomorrow where several employers will have the opportunity to see firsthand the skilled trades programs offered to prisoners. Warden Melinda Braman talks about some the similarities and differences between this Vocational Village and the operations at Richard A. Handlon Correctional Facility. She also shares some key insights to her success and leadership style as a warden.",
            "length": "24252916",
            "sourceUrl": "http://feeds.soundcloud.com/stream/340011089-field-days-parnall-vocational-village.mp3"
        },
        {
            "title": "Field Days Podcast - Week in Review 8/22/17",
            "datePublished": "Tue, 22 Aug 2017 15:56:06 +0000",
            "description": "This week on Field Days Podcast, Chris and Greg discuss a variety of hot-button topics and give an update on what's been going on in the department the past couple of weeks.",
            "length": "29686386",
            "sourceUrl": "http://feeds.soundcloud.com/stream/338993233-field-days-week-in-review-8-22-17.mp3"
        },
        {
            "title": "Field Days Podcast - Marquette Branch Prison History",
            "datePublished": "Tue, 15 Aug 2017 14:08:41 +0000",
            "description": "In the room where it happened, Warden Robert Napel recounts three of four staff deaths that occurred at Marquette Branch Prison. Warden T.B. Catlin, Deputy Warden Fred Menhennett, and Corrections Officer Earl DeMarse were all killed while on duty, in what was formerly the theater at the prison. Dr. A. W. Hornbogen also lost his life during a failed escape attempt at the facility.\n\nMarquette Branch Prison, which opened in 1889, has a rich history in this Field Days Podcast you'll learn about both the good and bad, but also what the future holds.",
            "length": "16446692",
            "sourceUrl": "http://feeds.soundcloud.com/stream/337974985-field-days-marquette-branch-prison-history.mp3"
        },
        {
            "title": "Field Days Podcast - Project SIGMA",
            "datePublished": "Tue, 08 Aug 2017 19:23:41 +0000",
            "description": "Project SIGMA(Statewide Integrated Governmental Management Applications)will change some day to day processes for most MDOC staff this week's guests, Tori Ellison and Shannon Pike from accounting go over when SIGMA rolls out and who it affects.",
            "length": "21083950",
            "sourceUrl": "http://feeds.soundcloud.com/stream/337032590-field-days-project-sigma.mp3"
        },
        {
            "title": "Field Days Podcast - 2017 Employee Rec Day Wrap Up",
            "datePublished": "Tue, 01 Aug 2017 16:15:08 +0000",
            "description": "Tune into this episode about all the fun had by employees that attended the Employee Recreation Day!",
            "length": "22550568",
            "sourceUrl": "http://feeds.soundcloud.com/stream/335809795-field-days-2017-employee-rec-day-wrap-up.mp3"
        },
        {
            "title": "Field Days Podcast - Baraga Correctional Facility 25th Anniversary",
            "datePublished": "Mon, 31 Jul 2017 12:13:05 +0000",
            "description": "Field Days Podcast travels to Baraga Correctional Facility for an interview with Representative Scott Dianda and Joe Bouchard a librarian at the facility to talk about the 25th anniversary since the facility opened.",
            "length": "21458859",
            "sourceUrl": "http://feeds.soundcloud.com/stream/335628515-field-days-baraga-correctional-facility-25th-anniversary.mp3"
        },
        {
            "title": "Field Days Podcast - PPPS Week 2017",
            "datePublished": "Tue, 18 Jul 2017 20:20:37 +0000",
            "description": "During Pretrial, Probation, and Parole Supervision Week (July 16-22) we especially thank and celebrate the important work done by our parole and probation agents to keep Michigan communities safe. Parole and probation agents make real differences in people’s lives and they deserve our gratitude! This year, the theme is “Clients, Employees, and Communities – Power through Partnerships”. #PPPSWeek\n\nIn addition to the interview with region managers Don Nolan and Janella Robinson, Deputy Director Russ Marlan shares his appreciation for the contribution FOA staff make to establish offender success. You'll also hear what PPPS Week means to these FOA staff: Alexis Thomas, Alicia Jackson, Annegret Remmert, Rebekah Bemister, Russ Ryynanen, Shaton Tucker, Ryan Chism, Tamra Flowers, Thomas Jardin, and Tiara Warren.",
            "length": "32125177",
            "sourceUrl": "http://feeds.soundcloud.com/stream/333768627-field-days-field-days-podcast-ppps-week-2017.mp3"
        },
        {
            "title": "Field Days Podcast - Collaborative Case Management",
            "datePublished": "Tue, 11 Jul 2017 20:29:38 +0000",
            "description": "Teresa Chandler, the Collaborative Case Management training specialist, discusses CCM and how the principles apply to everyday life. By using motivational interviewing, stage-matched change strategies, and basic listening skills, staff can more effectively communicate with offenders thereby increasing their intrinsic desire to be successful. Her passion is evident and puts in action one of her favorite quotes, \"A person who feels valued will always do more than expected.\"",
            "length": "41038575",
            "sourceUrl": "http://feeds.soundcloud.com/stream/332762436-field-days-collaborative-case-management.mp3"
        },
        {
            "title": "Field Days Podcast - Saginaw Corr. Veteran's Unit",
            "datePublished": "Mon, 03 Jul 2017 21:08:53 +0000",
            "description": "Happy 4th of July! Did you know that the Saginaw Correctional Facility was a dedicated housing unit for prisoners who are also veterans? Find out all about in this Field Days Podcast with guest Warden Thomas Winn, who is also a veteran. We want to wish all our staff and especially the veterans a Happy Independence Day!",
            "length": "25676485",
            "sourceUrl": "http://feeds.soundcloud.com/stream/331411388-field-days-field-days-podcast-saginaw-corr-veterans-unit.mp3"
        },
        {
            "title": "Special Edition - Employee Recreation Day 2017",
            "datePublished": "Mon, 03 Jul 2017 16:06:15 +0000",
            "description": "It's not too late to register for the 2017 Employee Rec Day! Director Washington talks about the activities she plans to participate in on July 14 and hopes to see you there.",
            "length": "8416861",
            "sourceUrl": "http://feeds.soundcloud.com/stream/331368975-field-days-special-edition-employee-recreation-day-2017.mp3"
        },
        {
            "title": "Field Days Podcast - 50th Episode",
            "datePublished": "Tue, 27 Jun 2017 12:22:11 +0000",
            "description": "Recap the last 50 episodes with Chris, Greg and Noah!",
            "length": "17486993",
            "sourceUrl": "http://feeds.soundcloud.com/stream/330340179-field-days-field-days-podcast-50th-episode.mp3"
        },
        {
            "title": "Field Days Podcast - 2017 Corrections Officer of the Year Cary Johnson",
            "datePublished": "Tue, 20 Jun 2017 16:08:54 +0000",
            "description": "Cary Johnson, a corrections officer at G. Robert Cotton Correctional Facility in Jackson was named the 2017 Corrections Officer of the Year for her integrity and dedication to public safety. She is passionate about many issues that corrections officers face on a daily basis including PTSD and wants to help guide the next generation of officers.",
            "length": "35462163",
            "sourceUrl": "http://feeds.soundcloud.com/stream/329008319-field-days-field-days-podcast-2017-corrections-officer-of-the-year-cary-johnson.mp3"
        },
        {
            "title": "Field Days Podcast - 2017 Director's Award James Fults",
            "datePublished": "Tue, 13 Jun 2017 16:51:45 +0000",
            "description": "James Fults, who was named the 2017 Director's Award winner for his tireless efforts to promote the Vocational Village in the business community and help connect paroling prisoners to jobs, reflects on what the award means to him. He shares his best stories of offender success in this Field Days Podcast episode.",
            "length": "28723408",
            "sourceUrl": "http://feeds.soundcloud.com/stream/327884114-field-days-2017-dir-award-james-fults.mp3"
        },
        {
            "title": "Field Days Podcast - Mackinac Policy Conference",
            "datePublished": "Tue, 06 Jun 2017 17:27:50 +0000",
            "description": "Director Heidi Washington attended the Mackinac Policy Conference, focused on one of the conference's pillars - increasing economic opportunity. By having conversations with business leaders about the department's Vocational Village, Director Washington is hopeful returning citizens will be provided opportunities where they can have successful lives outside prison walls. She stresses that providing valuable job training which helps prisoners secure careers reduces the risk of re-offense.",
            "length": "10431842",
            "sourceUrl": "http://feeds.soundcloud.com/stream/326687951-field-days-mackinac-policy-conference.mp3"
        },
        {
            "title": "Field Days Podcast - WRAP Program (replay)",
            "datePublished": "Tue, 30 May 2017 18:12:31 +0000",
            "description": "The program has shown early success, but it is in jeopardy due to budget cuts proposed by the state Senate.  The MDOC requested funding to expand WRAP to the west side of the state and build on the positive results seen in southeast Michigan, but it was not supported in the Senate’s budget proposal. \n\nThis episode provides a current update on the WRAP program at Detroit Reentry Center and reiterates the positive role this program plays in offender success.",
            "length": "26299662",
            "sourceUrl": "http://feeds.soundcloud.com/stream/325226184-field-days-wrap-program-replay.mp3"
        },
        {
            "title": "Special Edition - Candice Dunn",
            "datePublished": "Wed, 24 May 2017 12:52:01 +0000",
            "description": "In this special edition podcast, we pay tribute to Candice Dunn, the 2017 Probation/Parole Agent of the Year, who was tragically killed in a car accident on May 9. You will hear her acceptance speech from the night she received her award and a shared memory from Judge Phyllis McMillen. \n\nPatti Yerke, a program manager from the Employee Services Program talks about how to cope with grief and the resources available to staff that may need additional help handling instances of traumatic loss.",
            "length": "28284132",
            "sourceUrl": "http://feeds.soundcloud.com/stream/324258165-field-days-special-edition-candice-dunn.mp3"
        },
        {
            "title": "Field Days Podcast - 2017 FOA Supervisor Conference (LIVE)",
            "datePublished": "Tue, 16 May 2017 21:03:09 +0000",
            "description": "In the first ever live episode of Field Days you'll hear from the Field Operations Administration (FOA) Outstate and Metro Supervisors of the Year and the Lifetime Achievement Award recipients at the 2017 FOA Supervisors Conference. \n\nYour hosts Chris and Greg with returning host Noah put Tammy Pettit, Larry MacDonald and Laraine VanLopik in the hot seat to uncover their secrets to being a successful supervisor. \n\nNext week a special edition podcast will pay tribute to Candice Dunn, the 2017 Probation/Parole Agent of the Year, who was tragically killed in a car accident on May 9. A tribute, which includes her acceptance speech from the awards ceremony can be watched here: bit.ly/CandiceDunnTribute",
            "length": "12554657",
            "sourceUrl": "http://feeds.soundcloud.com/stream/322952670-field-days-2017-foa-supervisor-conference-live.mp3"
        },
        {
            "title": "Field Days Podcast - Children's Trust Fund",
            "datePublished": "Tue, 09 May 2017 19:26:43 +0000",
            "description": "In 2003, the Michigan Department of Corrections began what would become a long and fulfilling relationship with the Children's Trust Fund by donating items to its first auction to help support the organization's mission.\n\nThis week you'll hear Mike Foley and Tricia Headley, of the Children's Trust Fund, talk about the history of the auction, the department's involvement in it, and some of the impressive items donated by the department.",
            "length": "33559613",
            "sourceUrl": "http://feeds.soundcloud.com/stream/321788421-field-days-childrens-trust-fund.mp3"
        },
        {
            "title": "Field Days Podcast - Trading Places",
            "datePublished": "Tue, 02 May 2017 17:13:22 +0000",
            "description": "This week Chris and Greg talk about a new program that helps provide paroling prisoners with an additional avenue to access jobs. The Trading Places program helps prisoners in building trades earn credit hours towards their Journeyman's Card for the time spent in the classroom while honing their skills. You'll also hear what Director Heidi Washington and other Trading Place partners had to say to prisoners about the program.",
            "length": "20655123",
            "sourceUrl": "http://feeds.soundcloud.com/stream/320525225-field-days-trading-places.mp3"
        },
        {
            "title": "Field Days Podcast - Administrative Professionals Day",
            "datePublished": "Tue, 25 Apr 2017 17:19:27 +0000",
            "description": "65 years ago, a week-long celebration and specific day were organized to show appreciation for administrative professionals who typically go unthanked in their jobs. Administrative professionals Clara Reid, Miffer Griffin and Kent Williams talk about what the job means to them. Field Days hosts Chris and Greg help sing their praises in this new episode.",
            "length": "21463457",
            "sourceUrl": "http://feeds.soundcloud.com/stream/319431005-field-days-field-days-podcast-administration-professionals-day.mp3"
        },
        {
            "title": "Field Days Podcast - Employee Rec Day",
            "datePublished": "Tue, 18 Apr 2017 20:53:51 +0000",
            "description": "Field Days Podcast - Employee Rec Day by Field Days",
            "length": "24436400",
            "sourceUrl": "http://feeds.soundcloud.com/stream/318344572-field-days-field-days-podcast-employee-rec-day.mp3"
        },
        {
            "title": "Field Days Podcast - Lt. Levens (people's choice)",
            "datePublished": "Tue, 11 Apr 2017 18:29:42 +0000",
            "description": "Listen to the replay of Field Days Podcast most popular episode with Lt. Charles Levens from the Absconder Recovery Unit.",
            "length": "20591594",
            "sourceUrl": "http://feeds.soundcloud.com/stream/317225883-field-days-field-days-podcast-lt-levens-peoples-choice.mp3"
        },
        {
            "title": "Field Days Podcast - New Agent Oath Ceremony",
            "datePublished": "Tue, 04 Apr 2017 18:54:41 +0000",
            "description": "Matthew Alman was one of 13 agents that took their oath and received an official welcome to their new roles as parole and probation agents to the department by Deputy Director Russ Marlan and his executive staff. In this episode of Field Days, Matt talks about why he decided to become a parole agent and you'll hear some of the deputy director's remarks.",
            "length": "14369435",
            "sourceUrl": "http://feeds.soundcloud.com/stream/316100824-field-days-field-days-podcast-new-agent-oath-ceremony.mp3"
        },
        {
            "title": "Field Days Podcast - Michigan State Industries Optical Lab",
            "datePublished": "Tue, 28 Mar 2017 17:57:49 +0000",
            "description": "Matt Yeager and Jerry Johnston, are both Optical Trades Instructor at the Gus Harrison Correctional Facility and teach offenders in the trade the ins and outs of the optical industry. Some qualifying offenders even have the opportunity to receive the nationally recognized ABO certification. The optical lab also gives back to less fortunate communities through a program at Ferris State University.",
            "length": "35315042",
            "sourceUrl": "http://feeds.soundcloud.com/stream/314910161-field-days-field-days-podcast-michigan-state-industries-optical-lab.mp3"
        },
        {
            "title": "Field Days Podcast - Pete Martel",
            "datePublished": "Tue, 21 Mar 2017 16:25:52 +0000",
            "description": "Pete Martel, a mitigation specialist at the State Appellate Defender's Office and former 14-year inmate talks about how having family support and attending community college set him on a path to becoming a lawyer.",
            "length": "27774222",
            "sourceUrl": "http://feeds.soundcloud.com/stream/313620693-field-days-pete-martel.mp3"
        },
        {
            "title": "Field Days Podcast - Rob Engel",
            "datePublished": "Tue, 14 Mar 2017 20:33:02 +0000",
            "description": "Rob Engel, a former offender who battled drug addiction is now a Outreach Specialist at the Lansing Financial Empowerment Center. Rob helps parolees and probationers reduce their debts and improve their financial health. He shares his success with our Field Days host in this week's episode.",
            "length": "39632142",
            "sourceUrl": "http://feeds.soundcloud.com/stream/312410653-field-days-field-days-podcast-rob-engel.mp3"
        },
        {
            "title": "Field Days Podcast - Vivitrol Pilot Program",
            "datePublished": "Tue, 07 Mar 2017 18:48:57 +0000",
            "description": "The Vivitrol Pilot Program is the first step to broadening medication-assisted treatment for alcohol and opioid substance abusers. Vivitrol is an injection that is administered to offenders on a voluntary basis to block the feelings of getting drunk or high. Noah returns as co-host with Chris to interview Sherri Sankey, the health unit manager and Keith Jones, a mental health social worker from the Detroit Reentry Center. Julia Hitchingham, the substance abuse services manager also provides an overview of why the department is utilizing Vivitrol.",
            "length": "22464887",
            "sourceUrl": "http://feeds.soundcloud.com/stream/311212763-field-days-vivitrol-pilot-program.mp3"
        },
        {
            "title": "Field Days Podcast - Truck Driving Program",
            "datePublished": "Tue, 28 Feb 2017 17:26:49 +0000",
            "description": "Ryan Powell and Angie Sprank from the reentry join Chris and Greg to talk about the truck driving training program for offenders looking to start a rewarding career after prison. You can also read more about the truck driving program in the Corrections Connection: http://www.michigan.gov/documents/corrections/CC_FebruaryNewsletter2017_552842_7.pdf",
            "length": "20220864",
            "sourceUrl": "http://feeds.soundcloud.com/stream/309988900-field-days-field-days-podcast-truck-driving-program.mp3"
        },
        {
            "title": "Field Days Podcast - WRAP Program",
            "datePublished": "Mon, 20 Feb 2017 22:05:00 +0000",
            "description": "Returning co-host Noah Nagy joins Chris Gautz this week to talk about the Wayne County Residential Alternative to Prison (WRAP) program at Detroit Reentry Center with agent Verlynda Winston. She provides an overview of the intensive second chance program that provides G.E.D. classes and skilled trade opportunites for probation violators.",
            "length": "23052955",
            "sourceUrl": "http://feeds.soundcloud.com/stream/308728525-field-days-field-days-podcast-wrap-program.mp3"
        },
        {
            "title": "Field Days Podcast - MDOC Budget Update",
            "datePublished": "Tue, 14 Feb 2017 18:12:20 +0000",
            "description": "Happy Valentine's Day, listeners! Field Days, talks to Kyle Kaminski, the department's legislative liaison about the current budget proposal. He provides an overview of the budget process and what's included in the budget for the upcoming fiscal year.",
            "length": "26229445",
            "sourceUrl": "http://feeds.soundcloud.com/stream/307727473-field-days-field-days-podcast-mdoc-budget-update.mp3"
        },
        {
            "title": "Field Days Podcast - Lieutenant Charles Levens",
            "datePublished": "Tue, 07 Feb 2017 17:51:04 +0000",
            "description": "In this episode of Field Days, Lieutenant Levens from the Absconder Recovery Unit (ARU), talks to Greg and Chris about the hardships, the successes and what it takes to be a member of the ARU team.",
            "length": "27349158",
            "sourceUrl": "http://feeds.soundcloud.com/stream/306572574-field-days-field-days-podcast-lieutenant-charles-levens.mp3"
        },
        {
            "title": "SPECIAL EDITION Field Days Podcast - Director Washington",
            "datePublished": "Thu, 02 Feb 2017 17:54:48 +0000",
            "description": "The first ever special edition podcast features an interview with Director Washington and her thoughts on why staff should take the Employee Engagement Survey. In this episode, you'll hear about the innovative ways the department has improved since the last survey in 2015.",
            "length": "12375352",
            "sourceUrl": "http://feeds.soundcloud.com/stream/305783342-field-days-special-edition-field-days-podcast-director-washington.mp3"
        },
        {
            "title": "Field Days Podcast - Employee Survey",
            "datePublished": "Tue, 31 Jan 2017 21:00:30 +0000",
            "description": "In the latest episode of Field Days, Greg Straub and Chris Gautz chat with Kathy Kieffer from the EPIC section and Lieutenant Matt Mates from Parnall Correctional Facility to talk about the upcoming Employee Engagement Survey. You can expect to get answers from some of the most frequently asked questions about the survey in this episode. The survey will kick-off on February 6 and end February 28. The department's participation goal is 75 percent.",
            "length": "22662163",
            "sourceUrl": "http://feeds.soundcloud.com/stream/305312970-field-days-edit-ee-survey-staff.mp3"
        },
        {
            "title": "Field Days Podcast - Linsey LaMontagne Community Corrections",
            "datePublished": "Tue, 24 Jan 2017 12:59:27 +0000",
            "description": "Linsey LaMontagne is the manager for the Office of Community Corrections and she talks about how the office utilizes programming to aid in offender success.",
            "length": "17104978",
            "sourceUrl": "http://feeds.soundcloud.com/stream/304272678-field-days-field-days-podcast-linsey-lamontcommunity-corrections.mp3"
        },
        {
            "title": "Field Days Podcast - Kathy Arnold",
            "datePublished": "Tue, 17 Jan 2017 18:26:45 +0000",
            "description": "In the latest episode of Field Days, Greg Straub and Chris Gautz chat with Kathy Arnold, probation sentencing specialist, to talk about the Probation Sentencing Specialist Pilot. You'll learn in greater detail the reason for the pilot and the results that have been reached in the months since the pilot began.",
            "length": "22160194",
            "sourceUrl": "http://feeds.soundcloud.com/stream/303174444-field-days-field-days-podcast-kathy-arnold.mp3"
        },
        {
            "title": "Field Days Podcast - Deputy Director Marlan and McKee",
            "datePublished": "Tue, 10 Jan 2017 20:43:59 +0000",
            "description": "Greg and Chris sit down with Deputy Directors Russ Marlan and Ken McKee to talk about their future plans for the year and what their administrations accomplished in 2016.",
            "length": "47176723",
            "sourceUrl": "http://feeds.soundcloud.com/stream/301921027-field-days-field-days-podcast-deputy-director-marlan-and-mckee.mp3"
        },
        {
            "title": "Field Days Podcast - 2016 Year In Review",
            "datePublished": "Tue, 27 Dec 2016 16:46:57 +0000",
            "description": "In the latest episode of Field Days, Greg Straub and Chris Gautz recount the many positive changes that took place this year. Greg talks about changes made in the Field Operations Administration and Chris shares positive news coverage the MDOC received this year.",
            "length": "11258147",
            "sourceUrl": "http://feeds.soundcloud.com/stream/299786364-field-days-field-days-podcast-2016-year-in-review.mp3"
        },
        {
            "title": "Field Days Podcast - Monica Drake",
            "datePublished": "Tue, 20 Dec 2016 14:03:51 +0000",
            "description": "In this new episode of Field Days, Greg Straub and Chris Gautz chat with Monica Drake, a communications representative for the Office of Performance and Transformation, to talk about the employee engagement survey taking place in February. You’ll learn all about the anonymity of the survey and changes that were made as a result of the last survey.",
            "length": "12609827",
            "sourceUrl": "http://feeds.soundcloud.com/stream/298806523-field-days-field-days-podcast-monica-drake.mp3"
        },
        {
            "title": "Field Days Podcast - Chef Jimmy Hill",
            "datePublished": "Tue, 13 Dec 2016 12:44:05 +0000",
            "description": "In the latest episode of Field Days, Greg Straub and Chris Gautz chat with Chef Jimmy Hill, the Lakeland Correctional Facility Food Tech instructor who talks about how he's used his culinary skills to train prisoners so they may receive jobs once released. Learn more about the program and Chef Hill in this story from Hour Detroit Magazine: http://www.hourdetroit.com/Hour-Detroit/December-2016/Raw-Talent/",
            "length": "25702817",
            "sourceUrl": "http://feeds.soundcloud.com/stream/297700988-field-days-field-days-podcast-chef-jimmy-hill.mp3"
        },
        {
            "title": "Field Days Podcast - Vocational Village",
            "datePublished": "Tue, 06 Dec 2016 15:24:16 +0000",
            "description": "In the latest episode of Field Days, Greg Straub and Chris Gautz chat with DeWayne Burton, warden of the Richard A. Handlon Correctional Facility to talk about the Vocational Village. You’ll learn all about this innovative program that is the first-of-its-kind in the country and all the work the staff does there to find jobs for the prisoners upon parole.",
            "length": "27630026",
            "sourceUrl": "http://feeds.soundcloud.com/stream/296513649-field-days-field-days-podcast-vocational-village.mp3"
        },
        {
            "title": "Field Days Podcast - Harvest Gathering",
            "datePublished": "Tue, 29 Nov 2016 19:59:32 +0000",
            "description": "Greg and Chris chat with Andie Saunto, an executive secretary for the training division, about the results of the Harvest Gathering fundraiser campaign. There's also a special shout out to our Absconder Recovery Unit for their domestic violence prevention efforts last month.",
            "length": "11862098",
            "sourceUrl": "http://feeds.soundcloud.com/stream/295357015-field-days-field-days-podcast-harvest-gathering.mp3"
        },
        {
            "title": "Field Days Podcast- Former Idaho DOC Director Kevin Kempf",
            "datePublished": "Mon, 21 Nov 2016 20:14:22 +0000",
            "description": "Greg and Chris sit down this week with the Former Idaho Dept. of Corrections Director, Kevin Kempf. In this light and fun interview, Chris and Greg talk about Director Kempf’s use of social media in a very creative and transparent way. Kevin talks about how he is changing the culture of corrections in Idaho and the importance of getting out of the office to talk with staff and promote the great work they do on a daily basis.",
            "length": "32760057",
            "sourceUrl": "http://feeds.soundcloud.com/stream/294119579-field-days-field-days-podcast-idaho-doc-director-kevin-kempf.mp3"
        },
        {
            "title": "Field Days Podcast - Lame Duck session",
            "datePublished": "Tue, 15 Nov 2016 17:23:21 +0000",
            "description": "Greg and Chris sit down with the department's legislative liaison, Kyle Kaminski to discuss the upcoming lame duck session and what legislation will be proposed that affects corrections.",
            "length": "23679476",
            "sourceUrl": "http://feeds.soundcloud.com/stream/293165752-field-days-lame-duck-session.mp3"
        },
        {
            "title": "Field Days Podcast - Election Day",
            "datePublished": "Mon, 07 Nov 2016 22:04:41 +0000",
            "description": "In this short episode of  Field Days, Greg and Chris talk about the recent results of the parole eligibility consideration process audit and fine dining in prison. Field Days' host also want you to remember to get out and make your vote count!",
            "length": "8922591",
            "sourceUrl": "http://feeds.soundcloud.com/stream/291979214-field-days-field-days-podcast-election-day.mp3"
        },
        {
            "title": "Field Days Podcast - Director Heidi Washington (part 2 of 2)",
            "datePublished": "Tue, 01 Nov 2016 16:50:10 +0000",
            "description": "In part two of the one-year anniversary episode of Field Days, Chris Gautz (department spokesman) and Greg kick off the new weekly series of department-wide podcasts with Director Washington. The Director talks about the budget, department achievements and where she plans to lead next.",
            "length": "21318007",
            "sourceUrl": "http://feeds.soundcloud.com/stream/290984131-field-days-field-days-podcast-director-heidi-washington-part-2-of-2.mp3"
        },
        {
            "title": "Field Days Podcast - Director Washington (part 1 of 2)",
            "datePublished": "Tue, 18 Oct 2016 12:26:07 +0000",
            "description": "It's Field Days one-year anniversary and it get's better! Noah and Greg interview the head of the Michigan Department of Corrections, Director Heidi Washington. She talks about leadership, social media, photo ops and more. Listen through the end for a special announcement.",
            "length": "28088110",
            "sourceUrl": "http://feeds.soundcloud.com/stream/288810891-field-days-field-days-podcast-director-washington.mp3"
        },
        {
            "title": "Field Days Podcast- Dr. David Chinsky (part 2 of 2)",
            "datePublished": "Fri, 09 Sep 2016 15:25:07 +0000",
            "description": "In part 2 of the leadership series with Dr. David Chinsky you'll learn about the generational differences in the workforce today and how to change your leadership style to communicate effectively. ",
            "length": "24207616",
            "sourceUrl": "http://feeds.soundcloud.com/stream/282126088-field-days-field-days-dr-david-chinsky-part-2.mp3"
        },
        {
            "title": "Field Days - Dr. David Chinsky (part 1 of 2)",
            "datePublished": "Wed, 24 Aug 2016 15:53:30 +0000",
            "description": "Founder and CEO of The Institue for Leadership Fitness, Dr. David Chinsky discusses servant leadership and employee engagement. ",
            "length": "42796060",
            "sourceUrl": "http://feeds.soundcloud.com/stream/279695992-field-days-field-days-dr-david-chinsky-part-1-of-2.mp3"
        },
        {
            "title": "Field Days Podcast - Tim Selgo",
            "datePublished": "Thu, 28 Jul 2016 16:01:58 +0000",
            "description": "Greg and Noah are back on-air with the first guest, Tim Selgo former athletic director of Grand Valley State University, of their series focused on leadership. Learn more on what it takes to be a great leader within the department.",
            "length": "31586428",
            "sourceUrl": "http://feeds.soundcloud.com/stream/275779223-field-days-field-days-podcast-tim-selgo.mp3"
        },
        {
            "title": "Field Days Podcast - Employee Banquet Recap",
            "datePublished": "Tue, 17 May 2016 19:15:33 +0000",
            "description": "Noah and Greg recap the employee appreciation banquet and interview two special winners from the Field Operations Administration (FOA) staff. ",
            "length": "24756139",
            "sourceUrl": "http://feeds.soundcloud.com/stream/264603053-field-days-field-days-podcast-employee-banquet-recap.mp3"
        },
        {
            "title": "Heroin Series - Christin Lett and Megan Phillips (part 4)",
            "datePublished": "Tue, 03 May 2016 20:58:03 +0000",
            "description": "Greg and Noah interview guests for the Heroin Series: Becoming Champions for Change series from Community Programs, Inc. (CPI).",
            "length": "28577122",
            "sourceUrl": "http://feeds.soundcloud.com/stream/262352429-field-days-heroin-series-christin-lett-and-megan-phillips.mp3"
        },
        {
            "title": "Heroin Series - Prosecutor Bill Nichols (part 3)",
            "datePublished": "Tue, 01 Mar 2016 16:01:02 +0000",
            "description": "Prosecutor Bill Nichols from Monroe County Michigan joins Noah Greg on the third part of the \"Heroin Series: Becoming Champions for Change.\" ",
            "length": "24241213",
            "sourceUrl": "http://feeds.soundcloud.com/stream/249667478-field-days-heroin-series-prosecutor-bill-nichols-part-3.mp3"
        },
        {
            "title": "Heroin Series - Judge Susan Beebe (part 2)",
            "datePublished": "Tue, 16 Feb 2016 11:01:47 +0000",
            "description": "In part two of the \"Becoming Champions for Change\" heroin series of Field Days, you'll hear from 4th circuit court Judge Susan Beebe and she shares her experience with helping to treat heroin addicts.",
            "length": "24142993",
            "sourceUrl": "http://feeds.soundcloud.com/stream/247319754-field-days-heroin-series-judge-susan-beebe.mp3"
        },
        {
            "title": "Heroin Series - Chief Deputy Elmer Hitt and Lt. Christopher Simpson (part 1)",
            "datePublished": "Tue, 02 Feb 2016 02:25:33 +0000",
            "description": "Heroin is a drug that negatively effects millions across the nation and Michigan is no different. In the first part of a five part series Greg and Noah interview law enforcement from the Jackson City Police Department to talk about what we as a team can do to combat the drug and crime problem caused by heroin addiction. ",
            "length": "25590386",
            "sourceUrl": "http://feeds.soundcloud.com/stream/244994939-field-days-heroin-series-part-1.mp3"
        },
        {
            "title": "Field Days Podcast - Deena Grammatico and Lori Leduc",
            "datePublished": "Thu, 14 Jan 2016 18:54:53 +0000",
            "description": "Greg and Noah head to Macomb County to interview FOA Probation Supervisors, Deena Grammatico (Robarge) and Lori Leduc. On this episode of Field Days you'll enjoy an array of topics ranging from selfies to team building.\n\nMusic courtesy of bensound.com\n",
            "length": "20779257",
            "sourceUrl": "http://feeds.soundcloud.com/stream/241961903-field-days-field-days-podcast-deena-gramatico-and-lori-leduc.mp3"
        },
        {
            "title": "Field Days Podcast - Jerome Warfield",
            "datePublished": "Tue, 22 Dec 2015 13:27:52 +0000",
            "description": "Interview with Parole Board member Jerome Warfield and he talks about his work with the board and with the Brightmoor community in Detroit. ",
            "length": "26993474",
            "sourceUrl": "http://feeds.soundcloud.com/stream/238656658-field-days-field-days-podcast-jarome-warfield.mp3"
        },
        {
            "title": "Field Days Podcast - Vonnie Hiller and Lara Neuman",
            "datePublished": "Tue, 08 Dec 2015 18:41:04 +0000",
            "description": "Vonnie and Lara are agents in Kalamazoo that are a part of the pilot team for COMPAS, which acts as an additional tool for probation agents to offer recommendations to the court on a parolable offender.",
            "length": "22613262",
            "sourceUrl": "http://feeds.soundcloud.com/stream/236662336-field-days-vonnie-hiller-and-lara-neuman.mp3"
        },
        {
            "title": "Thanksgiving Field Days: Royce McKinney and Kaunda Gray",
            "datePublished": "Tue, 24 Nov 2015 14:27:09 +0000",
            "description": "Greg and Noah interview former Buffalo Bills NFL player and now a parole and probation supervisor, Royce McKinney and Kaunda Gray a parole and probation program manager. The four of them discuss community work, Wayne county parole and probation programs and more. ",
            "length": "18490095",
            "sourceUrl": "http://feeds.soundcloud.com/stream/234500423-field-days-thanksgiving-field-days.mp3"
        },
        {
            "title": "Field Days Podcast - Aaron Dungy and Lisa Hendricks",
            "datePublished": "Tue, 10 Nov 2015 20:08:13 +0000",
            "description": "Your hosts Noah and Greg interview two parole agents from the Jackson county Parole office that talk about work life balance, specialty courts and Special Olympics. ",
            "length": "19794963",
            "sourceUrl": "http://feeds.soundcloud.com/stream/232478881-field-days-field-days-podcast-aaron-dungy-and-lisa-hendricks.mp3"
        },
        {
            "title": "Field Days Podcast - Erin DeLoof",
            "datePublished": "Wed, 14 Oct 2015 00:54:33 +0000",
            "description": "Field Days Podcast - Erin DeLoof by Field Days",
            "length": "12905324",
            "sourceUrl": "http://feeds.soundcloud.com/stream/228295919-field-days-field-days-podcast-1.mp3"
        }
    ]
}