{
    "artwork": "http://is2.mzstatic.com/image/thumb/Music2/v4/7c/3e/41/7c3e41ac-acbc-090d-1eeb-9eca018b5da9/source/100x100bb.jpg",
    "description": "Flying Podcast is aimed at aviators in the UK.\n\nOn this podcast we'll be chatting to flyers of all kinds. \n\nHopefully we'll be out there talking to anyone that has an interest in flying whether it be fixed wing, rotary, balloon, glider... anything.\nSpeaking to people that fly just for fun or to professionals that can maybe guide you and me through the maze of flight training.\nSo, if all goes to plan, we can maybe be entertained and learn something along the way.",
    "feedURL": "http://flyingpodcast.jellycast.com/podcast/feed/2",
    "podcastURL": "http://www.flyingpodcast.co.uk",
    "publisher": "flyingpodcast",
    "title": "Flying Podcast",
    "episodes": [
        {
            "title": "Episode 69 - Jon Hilton to Canada and Back in a Microlight",
            "datePublished": "Thu, 21 Nov 2013 17:51:46 +0000",
            "description": "As part of the build up to doing a round the world flight Jon Hilton told me that he wanted to fly his CT microlight to Canada and back.\r\nJon set off in May of 2013 and went from the UK to the Faroes, Iceland, Greenland and on to Canada before turning around and doing the same thing in reverse. His entry in the log book in the tower stood out alongside the usual 'Sleaps, Caernarfons and Welshpools'. I'm sure the book has rarely seen an entry such as, 'Canada, via Wick'!",
            "length": "23414313",
            "sourceUrl": "https://flyingpodcast.jellycast.com/files/audio/Episode69.mp3"
        },
        {
            "title": "Episode 68 - Cary Robins - Weight and Balance Calculations",
            "datePublished": "Mon, 21 Oct 2013 16:28:35 +0000",
            "description": "Cary Robins is the owner of American Aeronautics and his company markets weight and balance calculators. I wanted to find out why weight and balance is so important, about his company's products and about his flying career too. \r\n",
            "length": "13620277",
            "sourceUrl": "https://flyingpodcast.jellycast.com/files/audio/Episode68.mp3"
        },
        {
            "title": "Episode 67 - London to Sydney The Slow Way",
            "datePublished": "Tue, 24 Sep 2013 14:17:49 +0000",
            "description": "A flight from London to Sydney, Australia in a PA28 by Andy Hardy and Sam Kidd. We discuss the planning that the guys have had to do prior to this epic flight adventure.",
            "length": "11062263",
            "sourceUrl": "https://flyingpodcast.jellycast.com/files/audio/Episode67.mp3"
        },
        {
            "title": "Episode 66 - LAA Rally 2013",
            "datePublished": "Wed, 04 Sep 2013 13:19:07 +0000",
            "description": "A trip to the Light Aircraft Association Rally to see what's new on the GA scene here in the UK.\r\nI talk to various aircraft manufacturers and importers including Grass Strip Aviation, Red-Air, Sprite Aviation, Dragon Aviation, The Light Aircraft Company and Swift Aviation.",
            "length": "9803890",
            "sourceUrl": "https://flyingpodcast.jellycast.com/files/audio/Episode66.mp3"
        },
        {
            "title": "Episode 65 - Fly2Pole update",
            "datePublished": "Tue, 06 Aug 2013 16:30:20 +0000",
            "description": "An update on the Flying for Freedom project. As you'll remember from episode 63 the Fly2Pole expedition is endeavouring to get several disabled military personnel to the South Pole in microlight aircraft. So, when the Flying for Freedom team held a sponsor's open day a few weeks ago I popped down to Kemble for a bit of a catch-up.",
            "length": "8227565",
            "sourceUrl": "https://flyingpodcast.jellycast.com/files/audio/Episode65.mp3"
        },
        {
            "title": "Episode 64 - Popham Microlight Trade Fair 2013",
            "datePublished": "Tue, 14 May 2013 13:19:45 +0000",
            "description": "A chat with many of the exhibitors at Popham. We talk to everyone from the SSDR manufacturers to the importers of some of the hottest hot-ships in the world of microlighting.",
            "length": "23175456",
            "sourceUrl": "https://flyingpodcast.jellycast.com/files/audio/Episode64.mp3"
        },
        {
            "title": "Episode 63 - John Laity - British Antarctic Microlight Expedition",
            "datePublished": "Sun, 17 Feb 2013 13:11:17 +0000",
            "description": "At the Flying Show last year I met a chap called John Laity on the P&M Aviation stand. \r\nJohn is one of the founders of Flying for Freedom which aims to train injured ex-servicemen to fly microlights as part of their rehabilitation into civilian life. \r\nIn addition, Flying for Freedom are launching an expedition to the south pole where they'll be trying to get a team to fly flexwing microlights to the pole and back. \r\nI caught up with John via Skype recently, just after his return from the press launch at the Tower of London.",
            "length": "11219519",
            "sourceUrl": "https://flyingpodcast.jellycast.com/files/audio/Episode63.mp3"
        },
        {
            "title": "Episode 62 - Martin Jones - de Havilland DH88 Comet Racer",
            "datePublished": "Fri, 01 Feb 2013 15:29:35 +0000",
            "description": "For today's episode I travelled down to Derby Aero Club to meet Martin Jones. Martin is the owner of the airfield and is also proprietor of Airspeed Aviation. My reason for the visit though was to have a chat to Martin about the restoration project that he's undertaking. His labour of love is a 1934 de Havilland Comet DH88 - G-ACSP - a so called Comet Racer. The aircraft was originally built by de Havilland for the England to Australia, 'MacRobertson' Air Race.\r\n",
            "length": "8434343",
            "sourceUrl": "https://flyingpodcast.jellycast.com/files/audio/Episode62.mp3"
        },
        {
            "title": "Episode 61 - David Bremner - British Microlight Aircraft Assoc.",
            "datePublished": "Tue, 15 Jan 2013 11:44:04 +0000",
            "description": "An interview with BMAA Chairman, David Bremner. David explains what the organisation does and how it works to promote and regulate microlighting in the UK.",
            "length": "8594213",
            "sourceUrl": "https://flyingpodcast.jellycast.com/files/audio/Episode61.mp3"
        },
        {
            "title": "Episode 60 - The Flying Show 2012",
            "datePublished": "Mon, 10 Dec 2012 13:42:13 +0000",
            "description": "A visit to The Flying Show at the NEC with interviews with Breezer UK, The Light Aircraft Company, Dave Sykes, GASCo and lastly, The Airspace and Safety Initiative.",
            "length": "10662903",
            "sourceUrl": "https://flyingpodcast.jellycast.com/files/audio/Episode60.mp3"
        },
        {
            "title": "Episode 59 - Andrew Lysser - Cumbria Gyroplanes",
            "datePublished": "Fri, 02 Nov 2012 08:55:37 +0000",
            "description": "Today we're up in the English Lake District talking gyrocopters with Andrew Lysser of Cumbria Gyroplanes. It's been a while since we discussed the world of gyrocopters so I took this opportunity to get an update from Andrew.\r\n",
            "length": "6870447",
            "sourceUrl": "https://flyingpodcast.jellycast.com/files/audio/Episode59.mp3"
        },
        {
            "title": "Episode 58 - Jon Hilton ",
            "datePublished": "Tue, 04 Sep 2012 12:47:11 +0000",
            "description": "Jon Hilton is an adventurous pilot, currently flying a CTSW out of Barton Airport, Manchester. Having read a couple of Jon’s reports in the BMAA’s monthly magazine he sounded like a prime candidate to appear on the Podcast. \r\nHe started out completing his PPL in the USA, in his early twenties, and went on to get his night, multi and IMC ratings. After taking a break from flying Jon came back to aviation but this time chose to fly microlights, buying a CTSW a couple of years ago.",
            "length": "13195717",
            "sourceUrl": "https://flyingpodcast.jellycast.com/files/audio/Episode58.mp3"
        },
        {
            "title": "Episode 57 - Chris Walsh - ATCO at Manchester International Airport",
            "datePublished": "Thu, 21 Jun 2012 10:20:19 +0000",
            "description": "We're talking to Chris Walsh today, ATCO at Manchester International Airport. We had lots of questions for Chris, sent in by podcast listeners. So if you'd like to know about what it's like to be an air traffic controller, how to become one, how they cope with the A380 and what their attitude is towards us GA pilots, then have a listen.",
            "length": "13894569",
            "sourceUrl": "https://flyingpodcast.jellycast.com/files/audio/Episode57.mp3"
        },
        {
            "title": "Episode 56 - AeroExpo 2012",
            "datePublished": "Sat, 02 Jun 2012 11:12:38 +0000",
            "description": "For today's episode of Flying Podcast I went down to AeroExpo at Sywell Aerodrome in Northamptonshire. I had a wander round to see which exhibitors had something interesting on offer and got chatting to a fair few of them. I went down on the Friday and although there were a fair few people in attendance most exhibitors had plenty of time to spend with anyone with an interest in their products. \r\nI have interviews recorded with: Conair Sports, Cosmik Aviation, Czech Air Sports, Sky Demon, Tecnam UK, Jasta Binks Aviation and Beaver UK.",
            "length": "8743762",
            "sourceUrl": "https://flyingpodcast.jellycast.com/files/audio/Episode56.mp3"
        },
        {
            "title": "Episode 55 - Owen Zupp - Flying a Jabiru Around Australia",
            "datePublished": "Thu, 17 May 2012 16:54:50 +0000",
            "description": "On today's Flying Podcast we've got a pilot from 'down under'. That's Owen Zupp. \r\nA couple of years ago, Owen flew a single engine light aircraft around Australia. I remember hearing about Owen's exploits on the great Australian aviation podcast Plane Crazy Down Under so when Owen contacted me offering to come on to the podcast I jumped at the opportunity.",
            "length": "7611358",
            "sourceUrl": "https://flyingpodcast.jellycast.com/files/audio/Episode55.mp3"
        },
        {
            "title": "Episode 54 - Andre Tempest - Victor XL231",
            "datePublished": "Tue, 01 May 2012 10:08:33 +0000",
            "description": "A few years back, when the RAF was disposing of its fleet of Victors, Andre Tempest put in a sealed bid and found himself the owner of a full sized V-bomber, designed to deliver the UK's nuclear deterrent to somewhere in the Soviet Union. \r\nI was interested in hearing why anybody would want to own their own Victor so, on a brilliantly sunny, spring day, I went to visit Andre and 'Lusty Lindy', as the aircraft is known, at Elvington, near York.\r\n",
            "length": "5989147",
            "sourceUrl": "https://flyingpodcast.jellycast.com/files/audio/Episode54.mp3"
        },
        {
            "title": "Episode 53 - Brian Hope - Light Aircraft Association",
            "datePublished": "Tue, 17 Apr 2012 15:13:05 +0000",
            "description": "To get a broader appreciation of what the Light Aircraft Association does I was pointed in the direction of Brian Hope, editor of the LAA's magazine 'Light Aviation'. We discuss everything about the LAA from its history, through the development of aeroplane kits right up to the forthcoming LAA rally at Sywell.",
            "length": "9531745",
            "sourceUrl": "https://flyingpodcast.jellycast.com/files/audio/Episode53.mp3"
        },
        {
            "title": "Episode 52 - Goodyear Blimp Chief Pilot - Mark Finney",
            "datePublished": "Fri, 30 Mar 2012 12:10:47 +0000",
            "description": "I'm joined by Mark Finney on the podcast. Mark is the Chief Pilot for the Goodyear Blimp, 'Spirit of Safety' here in the UK. ",
            "length": "5444336",
            "sourceUrl": "https://flyingpodcast.jellycast.com/files/audio/Episode52.mp3"
        },
        {
            "title": "Episode 51 - Andy Draper - Light Aircraft Association",
            "datePublished": "Wed, 21 Mar 2012 11:48:47 +0000",
            "description": "Today I’m off down to Turweston Aerodrome to meet Andy Draper of the Light Aircraft Association. Andy is the design engineer with the LAA and having joined from kitplane company, Europa, he now looks after the modification work for LAA aircraft but also oversees the ongoing airworthiness of all the approved types.\r\nI was interested in finding out what the process was for building your own aircraft so who better to ask than Andy.\r\nIf you recognize Andy’s photo on the web site that’s because he was involved in the TV show ‘A Plane Is Born’ some years ago, helping Mark Evans build his Europa kit plane. \r\n",
            "length": "7737409",
            "sourceUrl": "https://flyingpodcast.jellycast.com/files/audio/Episode51.mp3"
        },
        {
            "title": "Episode 50 - Duncan Armstrong - Our flying experiences",
            "datePublished": "Thu, 09 Feb 2012 09:49:05 +0000",
            "description": "A chat with Duncan Armstrong, fellow aviator from Barton Aerodrome. We always enjoy chatting about our learning experiences so I thought it would make an interesting podcast discussing what we learned during our flight training and in the years afterwards. We talk about what we found difficult, what made us worry, things that amused us and even things that scared us.",
            "length": "10732892",
            "sourceUrl": "https://flyingpodcast.jellycast.com/files/audio/Episode50.mp3"
        },
        {
            "title": "Episode 49 - Alex Turnbull - Wakatipu Aero Club",
            "datePublished": "Tue, 06 Dec 2011 17:45:15 +0000",
            "description": "I was contacted by some folks from Wakatipu Aero Club, down there in New Zealand, saying that they’d like to appear on the Podcast. One of their instructors is a chap called Alex Turnbull. He is originally from Morpeth in the North East of the UK and has travelled all the way to the other side of the world to pursue his dream of flying GA in a really interesting and challenging environment.",
            "length": "9492485",
            "sourceUrl": "https://flyingpodcast.jellycast.com/files/audio/Episode49.mp3"
        },
        {
            "title": "Episode 48 - Mark Knowles - FISO at Barton Airport",
            "datePublished": "Wed, 02 Nov 2011 11:55:23 +0000",
            "description": "Today I’m visiting my old stomping ground of Barton Aerodrome to talk to one of the guys in the control tower. The chap that’s featuring on the podcast is Mark Knowles and if you've ever landed or taken off from Barton chances are you will have spoken to Mark at some point.\r\nMark is a Flight Information Service Officer at the airport and I was interested to hear what the role of a FISO was in particular at a busy licensed aerodrome like Barton.",
            "length": "5635672",
            "sourceUrl": "https://flyingpodcast.jellycast.com/files/audio/Episode48.mp3"
        },
        {
            "title": "Episode 47 - Typhoon Display Team - Part 2",
            "datePublished": "Mon, 10 Oct 2011 09:39:51 +0000",
            "description": "A Typhoon pilot and engineer give me a close up description of the aircraft. Flying Officer Gregor Ogston was kind enough to spend half an hour or so, explaining what all of the knobs, buttons and dials do inside the cockpit. Gregor also explains what the ejection sequence is, which is fascinating to listen to. Following the look inside the aircraft Liam Whelan, the display engineer manager, and Gregor took me round the outside of the aircraft. ",
            "length": "13517260",
            "sourceUrl": "https://flyingpodcast.jellycast.com/files/audio/Episode47.mp3"
        },
        {
            "title": "Episode 46 - Scott Beaver - Flying Around the World",
            "datePublished": "Mon, 03 Oct 2011 17:55:49 +0000",
            "description": "An interview with Scott Beaver who plans to fly around the world. We talk about his flying experiences to date and what's involved in planning for his global adventure.",
            "length": "12672574",
            "sourceUrl": "https://flyingpodcast.jellycast.com/files/audio/Episode46.mp3"
        },
        {
            "title": "Episode 45 - Battle of Britain Memorial Flight - Part 2",
            "datePublished": "Tue, 09 Aug 2011 18:39:25 +0000",
            "description": "As promised, here’s the interview with Syd Marshall. Syd is a volunteer guide at the Battle of Britain memorial Flight museum, and what a great interview it turned out to be. I wasn’t expecting to meet a WW2 Lancaster crew member so it was not only a pleasant surprise, for me, but Syd had some great stories to tell about his time as a flight engineer on Lancaster bombers.",
            "length": "8972176",
            "sourceUrl": "https://flyingpodcast.jellycast.com/files/audio/Episode45.mp3"
        },
        {
            "title": "Episode 44 - Typhoon Display Team - Part 1",
            "datePublished": "Sat, 16 Jul 2011 10:11:08 +0000",
            "description": "At the invitation of RAF Coningsby, today I’m visiting the Typhoon Display Team to find out what it’s like to fly the Typhoon and to get a taste of what it takes to put together the superb Typhoon display.\r\nThe 2 members of the team that I’m talking to are: Flying Officer Gregor Ogston who is the display team manager and Sergeant Liam Whelan the Typhoon display engineer manager.",
            "length": "7378529",
            "sourceUrl": "https://flyingpodcast.jellycast.com/files/audio/Episode44.mp3"
        },
        {
            "title": "Episode 43 - Battle of Britain Memorial Flight - Part 1",
            "datePublished": "Mon, 04 Jul 2011 17:24:15 +0000",
            "description": "An interview with several of the staff at the Battle of Britain Memorial Flight based at RAF Coningsby. I spoke with Yvonne Masters, the PR Officer and a couple of the engineers lucky enough to work on the Spitfires, Hurricanes, Lancaster, Dakota and Chipmunks.",
            "length": "9616215",
            "sourceUrl": "https://flyingpodcast.jellycast.com/files/audio/Episode43.mp3"
        },
        {
            "title": "Episode 42 - Lincolnshire Aviation Heritage Centre",
            "datePublished": "Fri, 20 May 2011 14:55:35 +0000",
            "description": "Continuing with the Lincolnshire theme, today I'm at Lincolnshire Aviation Heritage Centre. The centre is home to several WWII aircraft, most notably a Lancaster bomber and a Dakota; both of which are available for taxi rides. I started my podcast interview with Andrew Panton who runs the museum and concluded with a chat with Paddy Green, owner of the resident Dakota.",
            "length": "8501653",
            "sourceUrl": "https://flyingpodcast.jellycast.com/files/audio/Episode42.mp3"
        },
        {
            "title": "Episode 41 - Malcolm Howland - Thruster Air Services and Fly365 ",
            "datePublished": "Fri, 13 May 2011 13:00:46 +0000",
            "description": "An interview with Malcolm Howland who runs Fly365 Flying School and also works for Thruster Microlights, both based at Wickenby Airfield in Lincolnshire. We talk about the history of the Thruster from its early days in Australia right up to the present day with manufacturing of new aircraft on the airfield. Malcolm also tells me about his flying career and what brought him to be a flying instructor and what part he has played in the Thruster story.",
            "length": "8919679",
            "sourceUrl": "https://flyingpodcast.jellycast.com/files/audio/Episode41.mp3"
        },
        {
            "title": "Episode 40 - Brian Cattle, from PPL to FI via CPL",
            "datePublished": "Tue, 05 Apr 2011 09:07:54 +0000",
            "description": "Today I'm visiting Sherburn Airfield in Yorkshire to meet a fellow pilot, Brian Cattle. Brian is a very keen aviator and has been flying privately for quite a few years now. Dedicated and passionate flyers are always welcome on the podcast so I'm glad to say Brian's agreed to come on the podcast to share the experiences of his flight training from PPL to CPL and on to Flying Instructor.",
            "length": "7971848",
            "sourceUrl": "https://flyingpodcast.jellycast.com/files/audio/Episode40.mp3"
        },
        {
            "title": "Episode 39 - North West Air Ambulance Service",
            "datePublished": "Sun, 03 Apr 2011 15:48:51 +0000",
            "description": "An interview with Captain Marc Rowley, a pilot with the North West Air Ambulance service. \r\nMarc tells me about how the charity air ambulance works and what it's like to fly helicopters for such an important emergency service.",
            "length": "4065219",
            "sourceUrl": "https://flyingpodcast.jellycast.com/files/audio/Episode%2039.mp3"
        },
        {
            "title": "Episode 38 - Sky Demon Flight Planning Software and GPS",
            "datePublished": "Thu, 10 Feb 2011 10:45:22 +0000",
            "description": "A chat with Rob Hart from Sky Demon. Sky Demon started out by developing VFR flight planning software and have since brought out their own aviation GPS unit.\r\nThe flight planning software first caught my eye due to the quality of their charts which, I'm told, are built using adaptive vectors. That means that the detail on the map is always extremely clear no matter what level of zoom you are using.\r\nThe main driver behind the product's development is to present all relevant data to the pilot in as clear a way as possible and this they have accomplished well. Even NOTAM and weather briefing information is presented both in text form and graphically on the charts in a simple straightforward fashion.\r\n",
            "length": "6067374",
            "sourceUrl": "https://flyingpodcast.jellycast.com/files/audio/Episode38.mp3"
        },
        {
            "title": "Episode 37 - Aware Aviation Airspace Warning GPS",
            "datePublished": "Tue, 01 Feb 2011 14:37:53 +0000",
            "description": "An interview with William Moore of Airbox Aerospace. William describes his Aware and Aware Plus GPS units. The Aware GPS device was developed in association with NATS to help reduce the number of controlled airspace infringements in the UK.",
            "length": "5802539",
            "sourceUrl": "https://flyingpodcast.jellycast.com/files/audio/Episode37.mp3"
        },
        {
            "title": "Episode 36 - Sky Watch Civil Air Patrol",
            "datePublished": "Fri, 07 Jan 2011 09:49:46 +0000",
            "description": "An interview with Tony Cowan MBE, Chairman of Sky Watch Civil Air Patrol. Sky Watch is an all volunteer charity consisting of pilots, observers and groundcrew. They work alongside the country's police and search and rescue organisations acting as aerial observers in emergency situations.",
            "length": "8057908",
            "sourceUrl": "https://flyingpodcast.jellycast.com/files/audio/Episode36.mp3"
        },
        {
            "title": "Episode 35 - Flight Training in the USA - Angel City Flyers",
            "datePublished": "Tue, 14 Dec 2010 09:41:13 +0000",
            "description": "By way of a follow up to episode 33 I'm interviewing another UK pilot that chose to go the USA to do his flight training.\r\nThis episode features Oli Cooper who chose a flight training school at Long Beach Airport and that's Angel City Flyers. Oli tells us about his experiences of fininshing off his PPL training in the US and how going for an FAA license affected his flying back in the UK.\r\n\r\n",
            "length": "9858851",
            "sourceUrl": "https://flyingpodcast.jellycast.com/files/audio/Episode35.mp3"
        },
        {
            "title": "Episode 34 - Air Atlantique's Classic Flight",
            "datePublished": "Thu, 02 Dec 2010 16:05:12 +0000",
            "description": "This episode of Flying Podcast features Steve Bridgewater, Commercial Director at Air Atlantique’s Classic Flight. Classic Flight do a superb job of keeping some classic old British Aircraft in airworthy condition. They have recently opened ‘Airbase’ at Coventry Airport. Airbase is not a museum in the conventional sense but more a working hangar that allows visitors to go and have a look around. \r\nIn addition they also offer pleasure flights in several of their aircraft. \r\n",
            "length": "6328857",
            "sourceUrl": "https://flyingpodcast.jellycast.com/files/audio/Episode34.mp3"
        },
        {
            "title": "Episode 33 - Flight Training in the USA - UK Flight Training",
            "datePublished": "Tue, 23 Nov 2010 09:08:30 +0000",
            "description": "Episode 33 of Flying Podcast features a fellow Barton flyer called Dave Crozier who trained in the US some time back. My first question for Dave was ‘what was your experience of flight training in the USA?’ His response was that he'd been struggling to get his PPL completed over here in the UK. The weather in England was conspiring to prevent him getting his flying licence so he decided to go over to the US to complete his training.\r\nAfter a great deal of research, Dave chose UK Flight Training of Long Beach in California. He chose California due to the predicted better weather and with 360 flying days a year who could argue.\r\n",
            "length": "7535910",
            "sourceUrl": "https://flyingpodcast.jellycast.com/files/audio/Episode33.mp3"
        },
        {
            "title": "Episode 32 - Peter Davies, a Career in Aviation",
            "datePublished": "Thu, 11 Nov 2010 10:37:53 +0000",
            "description": "Episode 32 of Flying Podcast sees me back up to York to interview Peter Davies. Peter is an instructor on gyrocopters for the Gyrocopter Experience. He currently runs their Preston franchise. Quite by chance, when I was reading about gyrocopters I came across Peter’s name and I was fascinated to read about his experiences in the world of aviation. His flying pedigree goes way back to the early days of hang gliding and microlighting here in the UK and so I thought he’d make a good candidate to appear on the podcast. ",
            "length": "7180045",
            "sourceUrl": "https://flyingpodcast.jellycast.com/files/audio/Episode32.mp3"
        },
        {
            "title": "Episode 31 - Becoming a Flying Instructor with Martin Hatton",
            "datePublished": "Fri, 15 Oct 2010 08:31:28 +0000",
            "description": "I was interested to find out what it takes to become a flying instructor and what is involved in getting a flying instructor rating. For episode 31 of Flying Podcast I’m talking Martin Hatton. Martin spends much of his time training flying instructors for Ravenair, based at Liverpool Airport and City Airport, Manchester. ",
            "length": "5753841",
            "sourceUrl": "https://flyingpodcast.jellycast.com/files/audio/Episode31.mp3"
        },
        {
            "title": "Episode 30 - Craig Richardson - Choosing Providers for ATPL Theory and Flight Training",
            "datePublished": "Mon, 06 Sep 2010 16:58:16 +0000",
            "description": "Craig is at the point in his flying career where he’s about to launch into training for the ATPL and he’s trying to decide where to do his ATPL groundschool studies and the CPL/IR flight training. He thought that the decision making process that he’s going through would make for an interesting podcast.",
            "length": "6683053",
            "sourceUrl": "https://flyingpodcast.jellycast.com/files/audio/Episode30.mp3"
        },
        {
            "title": "Episode 29 - Flt Lt Stu Walker - DHFS Part 3",
            "datePublished": "Mon, 23 Aug 2010 16:29:24 +0000",
            "description": "In this the third and final part of the DHFS podcasts I’m interviewing Flight Lieutenant Stu Walker. Stu invited me down to RAF Shawbury, arranged my visit and the interviews with the various personnel on the base. \r\nStu’s story is quite an interesting one and so I thought it would make a good stand-alone podcast in its own right. In this interview Stu tells me how he wanted to join the RAF from an early age. \r\nInitially his aim was to become a front-line fighter pilot but you can hear how his military career progressed through flight training, flying Nimrods, doing a masters degree is Aero Systems, working in the Flight Information Publications department and then on to flying helicopters. \r\n",
            "length": "8021845",
            "sourceUrl": "https://flyingpodcast.jellycast.com/files/audio/Episode29.mp3"
        },
        {
            "title": "Episode 28 - Thomas Cook Airlines Chief Pilot - Paul Hutchings",
            "datePublished": "Thu, 05 Aug 2010 18:30:02 +0000",
            "description": "Today I’m talking to Paul Hutchings, Chief Pilot for Thomas Cook Airlines.\r\nI’ve had a lot of questions from listeners about becoming a commercial pilot so who better to talk to than the chief pilot of one of the country’s largest charter airline fleets.\r\nI was interested to hear what qualities they look for in potential new recruits and I was particularly interested in their Cadet Training Scheme for ab-initio pilots. ",
            "length": "7927231",
            "sourceUrl": "https://flyingpodcast.jellycast.com/files/audio/Episode28.mp3"
        },
        {
            "title": "Episode 27 - Defence Helicopter Flying School - RAF Shawbury - Part 2",
            "datePublished": "Tue, 20 Jul 2010 17:40:47 +0000",
            "description": "In the second part of the DHFS podcasts I interview Squadron Leader Jason Bowes and Master Aircrew Graeme Longmuir. They’re both from 60 Squadron, responsible for training pilots and crewmen on multi engine helicopters at RAF Shawbury. I also talk to a couple of RAF students; Flight Lieutenants Keith Lam and Becky Corrigan and also to Corporal Neil Moncur, head of Flight Planning and lastly to Paul Gresty of the Met Office.",
            "length": "12343514",
            "sourceUrl": "https://flyingpodcast.jellycast.com/files/audio/Episode27.mp3"
        },
        {
            "title": "Episode 26 - Defence Helicopter Flying School - RAF Shawbury - Part 1",
            "datePublished": "Thu, 15 Jul 2010 09:53:42 +0000",
            "description": "The Defence Helicopter Flying School is where military helicopter pilots and crewmen for all of the UK's armed forces are trained. In this the first of 3 episodes on the Defence Helicopter Flying School I'm talking to the Commandant, Group Captain Jock Brown, who gives me an overview of the unit which is based at RAF Shawbury. Also in this episode I interview the squadron leaders of the 2 squadrons that teach single engine helicopter flying, both basic and advanced, here at the DHFS.",
            "length": "13830532",
            "sourceUrl": "https://flyingpodcast.jellycast.com/files/audio/Episode26.mp3"
        },
        {
            "title": "Episode 25 - Gliding at London Gliding Club with Adrian Hobbs",
            "datePublished": "Thu, 10 Jun 2010 18:39:32 +0000",
            "description": "Today I’m visiting London Gliding Club near Dunstable talking to Adrian Hobbs, a Basic Instructor at LGC all about gliding.\r\nIn this episode Adrian tells us pretty much everything we might need to know about learning to fly a glider. He explains how London Gliding Club operates and what you can expect when you come to LGC to fly a glider, either on a trial flight or a longer gliding course.",
            "length": "13732825",
            "sourceUrl": "https://flyingpodcast.jellycast.com/files/audio/Episode25.mp3"
        },
        {
            "title": "Episode 24 - Ted Moore from European Balloons",
            "datePublished": "Tue, 25 May 2010 14:32:19 +0000",
            "description": "In this episode of Flying Podcast, I'm talking with Ted Moore of European Balloons. European Balloons operate commercial hot-air balloon flights in the Home Counties from their base in Great Missenden. The purpose of this interview was to find out more about hot-air ballooning. How do you get into it? What qualifications do you need? What sorts of balloons are there? How do you learn to fly a hot air balloon? Etc etc. ",
            "length": "8743476",
            "sourceUrl": "https://flyingpodcast.jellycast.com/files/audio/Episode24.mp3"
        },
        {
            "title": "Episode 23 - Claire Hatton, Commercial and Instrument Rating Instructor with Ravenair",
            "datePublished": "Fri, 02 Apr 2010 14:53:28 +0000",
            "description": "Today I’m talking to Claire Hatton. Claire is a Commercial and Instrument Rating Instructor with Ravenair, based mainly at Liverpool, John Lennon Airport.\r\nWay back in episode 3 we discussed flight training for the PPL so I thought it probably a good idea to find out a little more about what’s involved in more advanced ratings and licenses such as the IMC, Multi engine, IR and CPL.\r\nSo if you have any interest in improving your flying or want to get into commercial aviation, have a listen to what Claire has to say.\r\n",
            "length": "10092382",
            "sourceUrl": "https://flyingpodcast.jellycast.com/files/audio/Episode23.mp3"
        },
        {
            "title": "Episode 22 - Arthur Williams flies with the BDFA",
            "datePublished": "Mon, 15 Mar 2010 18:11:24 +0000",
            "description": "Following on from my chat with Mike Miller-Smith of the BDFA, today I’m talking to one of the pilots that has trained with them.\r\nArthur Williams broke his back in a car accident in 2007 leaving him paralised from the waist down. At the time he was serving with the Royal Marines and as you could imagine, he lead a very active life.\r\nHe left the army in 2009 and decided that disability wouldn’t stop him becoming a pilot and, with the aid of the British Disabled Flying Association, that’s just what he’s been able to do. Following his trial flight he went solo after only 9 hours and since then he’s gone on to gain his National Private Pilot’s Licence.\r\n",
            "length": "4821870",
            "sourceUrl": "https://flyingpodcast.jellycast.com/files/audio/Episode22.mp3"
        },
        {
            "title": "Episode 21 - Museum Of Science & Industry - Avro Collection",
            "datePublished": "Mon, 01 Mar 2010 13:28:29 +0000",
            "description": "In episode 21 of Flying Podcast today, I’m talking to Nick Forder, Transport Curator at Manchester’s Museum of Science and Industry.\r\nNick has a superb insight into the history of AVRO aviation and how that was inextricably linked with the history of aviation in the Manchester area.\r\nThe interview with Nick takes place in the Air & Space Hall, hence the sound of happy children in the background. As we wandered around the collection Nick describes the AVRO aeroplanes and the part they played in powered flight over the last century.\r\nAfter speaking to Nick I talk to Peter Teagle, volunteer at the museum and ex Assistant Chief Designer at Avro in Woodford about the replica Type F Avro aircraft being built by him and his team.\r\n",
            "length": "16099682",
            "sourceUrl": "https://flyingpodcast.jellycast.com/files/audio/Episode21.mp3"
        },
        {
            "title": "Episode 20 - The British Disabled Flying Association",
            "datePublished": "Wed, 24 Feb 2010 11:54:13 +0000",
            "description": "Today I’m talking to Mike Miller-Smith from the British Disabled Flying Association.\r\nThe BDFA is a registered charity which provides 'experience of a lifetime' trial flying lessons for as many terminally ill & disabled people as possible every year. They also offer subsidised flying days for other disability charities and at cost instruction & qualification flight training to BDFA members.\r\n",
            "length": "6481242",
            "sourceUrl": "https://flyingpodcast.jellycast.com/files/audio/Episode20.mp3"
        },
        {
            "title": "Episode 19 - Flying Hang Gliders and Paragliders",
            "datePublished": "Wed, 16 Dec 2009 11:13:40 +0000",
            "description": "In this episode of Flying Podcast I talk to Judith Mole and Geoff Minshull who fly hang gliders and paragliders for pleasure.\r\nIn this podcast they tell us about why they have chosen to fly these particular sorts of aircraft and what is involved in learning to fly. We also discuss the equipment required and where to fly from. \r\n\r\nJudith and Geoff have been flying hang gliders and paragliders for some years now. They were attracted by the sense of freedom to be had flying flying long distances without any form of power. They mainly fly from the Long Mynd during the British summer but spend their winters over in Spain where they can continue to fly when the weather over in the UK prevents many forms of flying.\r\n",
            "length": "9627216",
            "sourceUrl": "https://flyingpodcast.jellycast.com/files/audio/Episode19.mp3"
        },
        {
            "title": "Episode 18 - Ian Donnan, Aviation Medical Examiner",
            "datePublished": "Tue, 10 Nov 2009 18:52:20 +0000",
            "description": "An interview with my aviation medical examiner, Dr. Ian Donnan.\r\nFollowing on from my own class 2 medical I asked Ian to give me a run through of what takes place during an aviation medical, what you need to bring along to the examination, what the doctor looks for, the frequencies of examination and the differences between a class 2 and a class 1 medical.",
            "length": "6899478",
            "sourceUrl": "https://flyingpodcast.jellycast.com/files/audio/18%20Episode18.mp3"
        },
        {
            "title": "Episode 17 - Gary Cooper of Helicopters Northwest on Helicopter Training",
            "datePublished": "Wed, 28 Oct 2009 14:11:49 +0000",
            "description": "Gary Cooper of Helicopters Northwest explains about helicopter training giving a brief outline of the syllabus, post PPL(H) training options and the sort of problems you can encounter whilst learning to fly. ",
            "length": "6192745",
            "sourceUrl": "https://flyingpodcast.jellycast.com/files/audio/Episode17.mp3"
        },
        {
            "title": "Episode 16 - Paul Lomatschinsky Flies a DA42 Across The Atlantic",
            "datePublished": "Sat, 17 Oct 2009 09:08:12 +0000",
            "description": "Paul Lomatschinsky takes part in a comemorative flight across the Atlantic in a Diamond DA42 Twin Star. The flight, which took place in Feb 2009, was to comemorate the 90th anniversary of Alcock and Brown's first non-stop flight from Newfoundland to Ireland in 1919.",
            "length": "12660116",
            "sourceUrl": "https://flyingpodcast.jellycast.com/files/audio/Episode%2016.mp3"
        },
        {
            "title": "Episode 15 - Charter Airline Captain Guy Cowper",
            "datePublished": "Fri, 15 May 2009 14:22:45 +0000",
            "description": "An interview with Guy Cowper a captain with the UK's largest charter airline. We hear how he got into flying commercially, what a typical flying day involves, what it's like to work for a major airline and hear a couple of funny stories too.",
            "length": "9077342",
            "sourceUrl": "https://flyingpodcast.jellycast.com/files/audio/Episode15.mp3"
        },
        {
            "title": "Episode 14 - Helicopters with Joel Tobias",
            "datePublished": "Fri, 01 May 2009 16:06:19 +0000",
            "description": "I spent a few hours with Joel Tobias, owner of a Bell 206 BIII Jet Ranger. In this podcast interview he gives us some background to his flying career, his aircraft and how he uses it for business and pleasure. ",
            "length": "4792750",
            "sourceUrl": "https://flyingpodcast.jellycast.com/files/audio/Episode14.mp3"
        },
        {
            "title": "Episode 13 - The Gyrocopter Experience with Phil Harwood",
            "datePublished": "Mon, 27 Apr 2009 16:12:24 +0000",
            "description": "Ever wondered about gyrocopters? Well wonder no more. Phil Harwood of gyrocopterexperience.com gives us some background information about gyrocopters, their safety, how to get into flying gyrocopters and what's involved in getting a licence. ",
            "length": "4885934",
            "sourceUrl": "https://flyingpodcast.jellycast.com/files/audio/Episode13.mp3"
        },
        {
            "title": "Episode 12 - Diamond Executive Aviation",
            "datePublished": "Mon, 20 Apr 2009 16:56:15 +0000",
            "description": "An interview with Peter Bondar who, together with his colleagues, has launched a new air taxi service called Diamond Executive Aviation. Using Diamond DA42 Twin Star aircraft they hope to offer a cost effective and efficient air taxi service from your local airfield.",
            "length": "4989700",
            "sourceUrl": "https://flyingpodcast.jellycast.com/files/audio/Episode12.mp3"
        },
        {
            "title": "Flying Podcast Episode 1",
            "datePublished": "Fri, 15 Feb 2008 13:39:36 +0000",
            "description": "Introduction\r\n\r\n",
            "length": "522534",
            "sourceUrl": "https://flyingpodcast.jellycast.com/files/audio/Flying%20Podcast%20Episode1.mp3"
        },
        {
            "title": "Episode 2 - A Flight to Israel",
            "datePublished": "Fri, 15 Feb 2008 14:56:16 +0000",
            "description": "Dr David Cohen flew a diesel powered PA-28 to Israel from the UK. In an interview with David he recounts some of his experiences on the journey to and from Israel.\r\nAn interesting insight into some of the possible problems that can be encountered on a long flight plus some amusing anecdotes thrown in.\r\n\r\n\r\n",
            "length": "7071435",
            "sourceUrl": "https://flyingpodcast.jellycast.com/files/audio/Episode%202%20-%20A%20Flight%20to%20Israel.mp3"
        },
        {
            "title": "Episode 3 - Learning to fly",
            "datePublished": "Mon, 20 Oct 2008 17:29:34 +0000",
            "description": "Advice on learning to fly from Robert Knight.\r\nThis interview covers such areas as how to find a flying school, which school to pick, the sort of airfield, type of license available and much more. Bob is a flying instructor, CAA examiner and university lecturer in aviation.\r\n\r\n<a href=\"http://www.btpodshow.com/\"> BTPodShow </a> {BTPodShow-ec182a1a2e7c1920e424ceca458d5c9f} \r\n\r\n",
            "length": "5704025",
            "sourceUrl": "https://flyingpodcast.jellycast.com/files/audio/Episode%203%20-%20Learning%20to%20fly.mp3"
        },
        {
            "title": "Episode 4 - Microlight flying with Mainair Flying School",
            "datePublished": "Mon, 20 Oct 2008 17:29:58 +0000",
            "description": "An interview with Chris and Marcus of Mainair Flying School. We'll be discovering the world of microlights and finding out just how far they've come in the last few years. I was certainly quite surprised at just how high-tech this new breed of light aircraft have become. Microlighting should be a definite contender if you are thinking of learning to fly or are looking for something to put the fun back into your aviation career.\r\n\r\n<a href=\"http://www.btpodshow.com/\"> BTPodShow </a> {BTPodShow-ec182a1a2e7c1920e424ceca458d5c9f} \r\n",
            "length": "6743556",
            "sourceUrl": "https://flyingpodcast.jellycast.com/files/audio/Episode4.mp3"
        },
        {
            "title": "Episode 5 - A visit to Yorkshire Air Museum, Elvington",
            "datePublished": "Mon, 20 Oct 2008 17:30:18 +0000",
            "description": "An interview with Ian Reed, Director of Yorkshire Air Museum at Elvington Airfield. Ian tells us about what the museum has to offer including information about the airfield's history, museum exhibits and the aircraft on display.\r\n\r\n<a href=\"http://www.btpodshow.com/\"> BTPodShow </a> {BTPodShow-ec182a1a2e7c1920e424ceca458d5c9f} \r\n",
            "length": "8224723",
            "sourceUrl": "https://flyingpodcast.jellycast.com/files/audio/Episode5.mp3"
        },
        {
            "title": "Episode 6 - Aerial photographer",
            "datePublished": "Wed, 10 Dec 2008 11:14:10 +0000",
            "description": "In today's episode we talk to John Seville. John has had an interesting aviation career including air taxi pilot, aerial photography and even 'Eye in the Sky' for Piccadilly Radio in Manchester.\r\n                                                             \r\n\r\n<a href=\"http://www.btpodshow.com/\"> BTPodShow </a> {BTPodShow-ec182a1a2e7c1920e424ceca458d5c9f} \r\n\r\n<a href=\"http://www.podcastalley.com/\">My Podcast Alley feed!</a> {pca-9016b12b4c5d744a9e4b2b4a2317e6db}\r\n\r\n",
            "length": "7715929",
            "sourceUrl": "https://flyingpodcast.jellycast.com/files/audio/Episode6.mp3"
        },
        {
            "title": "Episode 7 - Barton Visitor Centre",
            "datePublished": "Mon, 20 Oct 2008 17:30:58 +0000",
            "description": "I'm talking to Dr Eric Isaac, curator of Barton Visitor Centre, a museum on the airfield at Barton Aerodrome, now known as City Airport, Manchester. We also discuss the history of Barton & Lancs Aero Club and Eric also gives us an insight into his qualifying cross-country flight where he stays into controlled airspace.\r\n\r\n<a href=\"http://www.btpodshow.com/\"> BTPodShow </a> {BTPodShow-ec182a1a2e7c1920e424ceca458d5c9f} \r\n",
            "length": "6910813",
            "sourceUrl": "https://flyingpodcast.jellycast.com/files/audio/Episode7.mp3"
        },
        {
            "title": "Episode 8 - Sheila Dyson",
            "datePublished": "Mon, 01 Dec 2008 21:00:49 +0000",
            "description": "Sheila Dyson flies her Cessna 182 to Sydney, Australia from Netherthorpe near Sheffield. An aviation trip of a lifetime and a real adventure. A truly great accomplishment by any standards. Listen as Sheila shares her experiences of the trip to Oz.",
            "length": "14071369",
            "sourceUrl": "https://flyingpodcast.jellycast.com/files/audio/Episode8.mp3"
        },
        {
            "title": "Episode 9 - SPLASH Exhibition",
            "datePublished": "Thu, 04 Dec 2008 17:56:48 +0000",
            "description": "A visit to the annual SPLASH Exhibition at Birmingham's NEC.\r\nI spoke to several of the exhibitors including Clive Coote from Yuneec who are developing an all electric aircraft, Mike Barnard from the LAA and Dave Unwin, Editor of Today's Pilot Magazine. I was interested to learn about any new developments in light aviation, both from a technical point of view and legal.",
            "length": "6720597",
            "sourceUrl": "https://flyingpodcast.jellycast.com/files/audio/Episode9.mp3"
        },
        {
            "title": "Episode 10 - Wanafly Aviation, France",
            "datePublished": "Fri, 12 Dec 2008 17:50:56 +0000",
            "description": "Wanafly Aviation are Dave and Amanda Lord. They operate a microlight flying school in France. Today we chat about their background in aviation and how they came to set up their school in France.",
            "length": "4357432",
            "sourceUrl": "https://flyingpodcast.jellycast.com/files/audio/Episode10.mp3"
        },
        {
            "title": "Episode 11 - Greater Manchester Police, Air Support Unit",
            "datePublished": "Tue, 07 Apr 2009 18:55:04 +0000",
            "description": "A chat with Sgt. Mick Dunn from Greater Manchester Police's Air Support Unit.\r\nThe Air Support Unit operates the Police helicopter from City Airport, Manchester.\r\nThe interview covers such areas as the aircraft used, the technologies they carry onboard, their operational usage and the career path towards getting into the pilot's or the air observer's seat.",
            "length": "7175494",
            "sourceUrl": "https://flyingpodcast.jellycast.com/files/audio/Episode11%20-%20Greater%20Manchester%20Police.mp3"
        }
    ]
}