{
    "artwork": "http://is2.mzstatic.com/image/thumb/Music117/v4/4c/79/c9/4c79c94a-4636-e97f-460d-06970fe11fb5/source/100x100bb.jpg",
    "description": "Rachel Brathen is an international yoga teacher and speaker, bestselling author and serial entrepreneur who inspires millions every day. Known as Yoga Girl, Rachel has sparked a movement through deciding to share every corner of her heart's journey, the moments of beauty and of pain, and always of unyielding trust in life. She saw a photo-sharing platform as the perfect way to share her message: coupling photos of her contagious smile and free-spirited yoga practice with everything from a daily gratitude list to a raw story of heartbreak. Rachel’s bold, heart-centered voice made public has grown a global audience of millions all yearning to step into their own heart’s calling. Now – Rachel is offering an even more intimate look into her life and the inspiring journey she is here to share with you. Weekly episodes of storytelling and talks from Rachel (sometimes alongside special guests!) will dive into topics such as love, trust, finding balance, overcoming adversity and of course, yoga and well-being. The light you are seeking is within your own heart. Join Rachel as she helps you uncover it, from her heart to yours.",
    "feedURL": "http://feeds.feedburner.com/yoga-girl",
    "podcastURL": "https://art19.com/shows/yoga-girl",
    "title": "From The Heart: Conversations with Yoga Girl",
    "episodes": [
        {
            "title": "Couples Therapy with Dennis Schoneveld",
            "datePublished": "Fri, 06 Nov 2020 08:01:00 -0000",
            "description": "Couples who do therapy together, stay together! What do Rachel and Dennis do to deepen their relationship? How does Dennis feel about the practice of sharing? Why does Ironman make Dennis emotional? All of these questions and more answered in this week’s episode of the Yoga Girl Podcast as Rachel is again joined by our favorite guest, her husband Dennis.\r\nRachel and Dennis are in the midst of a 9-week couple’s course and Dennis is currently in the US, so they share everything from intimate communication (and how Rachel and Dennis do it differently), supporting each other’s self-care practices, why communication and intimacy is the most important thing, parenting, traveling to an Ironman in Florida during the election and a pandemic, and more! \r\nRachel and Dennis’ self-care practices differ immensely, but it’s all coming full circle in this episode as Rachel actually gets Dennis to open up about his feelings and doing the inner work. It’s through open communication that they recognize the need for their own individual self-care practices that will bring them closer as a couple. But ultimately, how does Dennis feel about it? Tune in to find out!\r\nLearn more about your ad choices. Visit podcastchoices.com/adchoices",
            "length": "0",
            "sourceUrl": "https://traffic.megaphone.fm/DGT1606934812.mp3"
        },
        {
            "title": "Check In (Don’t Check Out)",
            "datePublished": "Fri, 30 Oct 2020 07:01:00 -0000",
            "description": "How are you doing? It’s a question we get asked all the time, but when was the last time you answered that question from a place of raw, honest truth? Let’s check in. In this moment, how are you doing – REALLY? Instead of answering on autopilot, drop deeply into your body. Close your eyes. Place to hands to your heart. Breathe deeply. Feel. What is it like for me to be here, as I am, in this moment?\r\nChecking in - becoming fully present in your own body - is a practice that will completely transform your life. Our days are a roller coaster of ups and downs, thoughts, experiences, and triggers that impact both our state of mind and our emotional heart. If we don’t recognize a trigger when it comes our way, we will not understand why we feel the way we do, and we usually end up turning to coping mechanisms without knowing what lead us there in the first place. This is why we must consistently and dedicatedly check in with ourselves - not just once a day on the yoga mat, but as often as we can.\r\nIn today’s episode, Rachel shares the important practice of checking in (and exactly how to do it), over and over again. This is the practice of coming home to your heart, taking deep breaths, and listening to what is really there. Over time you will gain the ability to make sense of your feelings, understand your reactions, and feel at home in your body. This practice also allows you to notice where and how you tend to numb and check out (without judging yourself!) so that with time, you can choose differently.\r\nTune in as Rachel shares her own personal triggers, the causes and reactions behind them, and the impact this simple practice has had on her life. By creating the space to check in, you can begin to live a more conscious, present life, and figuring out what you really need becomes a little easier every time. Tune in to come back home to you.\r\nLearn more about your ad choices. Visit podcastchoices.com/adchoices",
            "length": "0",
            "sourceUrl": "https://traffic.megaphone.fm/DGT3633237877.mp3"
        },
        {
            "title": "The Yoga Episode: Answering All Your Yoga Questions!",
            "datePublished": "Fri, 23 Oct 2020 07:01:00 -0000",
            "description": "Welcome to the much-anticipated YOGA episode of the Yoga Girl Podcast! Tune in today as Rachel takes questions from the Yoga Girl Community about the practice of yoga, how to start your practice, finding a teacher that resonates, honoring the roots of yoga, common misalignments and more!\r\nWherever you are at with your practice, if you’ve never stepped onto a yoga mat or if you are an advanced practitioner, this heartfelt episode from Rachel is a step-by-step guide not only into the practice of yoga, but what it means personally for you as well.\r\nHint – it’s not really about the asana, it’s adapting the practice to fit your needs while simultaneously creating a routine that works for you.\r\nThe Yoga Girl community wrote in some amazing questions for Rachel, and these are some of the golden truths that we need to hear right now. Yoga is so sacred and personal, and this episode will guide you through the ways to choose a practice, teacher, habit, lifestyle and resonance that works for you. Life is cyclical, and we all go through ups and downs - it’s the same with our practices! But if we keep our hearts aligned with the true roots of yoga, then we are able to make a shift in our internal lives and open to the abundance of the true roots of the practice. Tune in to continue on the journey.\r\nLearn more about your ad choices. Visit podcastchoices.com/adchoices",
            "length": "0",
            "sourceUrl": "https://traffic.megaphone.fm/DGT6112228641.mp3?updated=1603425371"
        },
        {
            "title": "The Yoga Girl Morning Ritual (Step by Step!)",
            "datePublished": "Fri, 16 Oct 2020 07:01:00 -0000",
            "description": "The best way to have a great day is to start your day off GREAT! On this week’s episode, Rachel shares her sacred morning routine in 10 steps, why you absolutely should cultivate a morning ritual and how carving out time for self-care first thing in the AM can (and will!) profoundly change your life.\r\nWhat’s the first thing you do when you wake up? Many of us reach for our phones or hit the snooze button. A great day begins from the inside out, so before you dive headfirst into what the day has in store for you make sure you are feeling grounded and ready! The Yoga Girl Morning Routine is designed to bring body, mind and heart into alignment. With a dedicated space to feel, move, dance and breathe every single morning you set yourself up for success, no matter what the rest of the day brings.\r\nEven if rising at 5am isn’t possible for you, there are definitely small (and big!) changes you can implement that will turn your world around. This episode will inspire you to create change around how you wake up, guide you through the 10 steps to have an epic morning, and inspire you to implement changes that create long-lasting growth. Tune in to create your own epic morning routine! \r\nRachel’s 10 steps are as follows:\r\n1. RISE!\r\n2. READY\r\n3. MOVE\r\n4. DANCE\r\n5. FEEL\r\n6. PRACTICE\r\n7. SIT\r\n8. WRITE\r\n9. READ\r\n10. PREPARE\r\nLearn more about your ad choices. Visit podcastchoices.com/adchoices",
            "length": "0",
            "sourceUrl": "https://traffic.megaphone.fm/DGT1540108030.mp3"
        },
        {
            "title": "5 Simple Steps to Process Your Emotions",
            "datePublished": "Fri, 09 Oct 2020 07:01:00 -0000",
            "description": "Today’s episode has the power to propel your healing process to an entirely new level as Rachel shares five simple – yet radical – steps to alchemize and process your emotions. \r\nThe first years that we spend on this earth are crucial when it comes to our development and the ways that we relate to the world around us. Were your feelings validated as a child? For many of us growing up, we were shamed or punished for being angry, sad, frustrated, or any feelings that as a society we have labelled to be “bad”. As we grew up, we may have internalized that shame, which leads us to avoid our feelings, to deny our lived experiences, and ultimately, to think there is something wrong with us.\r\nBut now the ball is in your court… And you have the chance to heal! The next time you find yourself feeling anxious, depressed, stressed, sad, angry, or frustrated, sit with the five steps Rachel shares in this episode (Pause, Notice, Name, Track and Validate!). Over time, you may realize that your old wounds don’t trigger you anymore, your harmful patterns show up less, your mind has more space, you are less reactive, and more steady. The practice really isn’t about avoiding what is hard, but to learn how to honor what is real and true in every moment. One thing we know for sure is that we could all use a little more peace in our lives. Tune in to feel - and heal.\r\nLearn more about your ad choices. Visit podcastchoices.com/adchoices",
            "length": "0",
            "sourceUrl": "https://traffic.megaphone.fm/DGT8791370294.mp3"
        },
        {
            "title": "What If You Are Feeling Lost For a Reason? ",
            "datePublished": "Fri, 02 Oct 2020 07:01:00 -0000",
            "description": "Are you wondering what exactly you are here to do and what the actual F is going on in the world? Congratulations! You are not alone; we are in this together. We are ALL feeling lost and wondering the same things as the global pandemic plays on.\r\nWhat we can do is anchor into our day to day rituals and practices that make us feel good. Instead of overthinking the past or feeling anxious about the unknown future, we can spend our energy and our time doing something that makes us feel really GOOD, like an absolute 10 out of 10. \r\nIn this week’s episode, Rachel expresses the importance of anchoring into day to day rituals, relationships, people, places, and experiences that charge you up, and make you feel really good. By identifying behaviors in your day to day life that you would like to let go of and taking steps to implement habits that will fill your soul, you are taking your power back, and creating 10/10 experiences for yourself every single day. \r\nThis episode will inspire you to sit with the light of the Aries full moon to use the illuminating intuition and courage to get really clear on where you spend your energy, what changes you can make to improve your daily habits, and what you can release from your life. In order to make space for the things you DO want in your life, where can you let something fall away that doesn’t contribute to your highest potential?\r\nLearn more about your ad choices. Visit podcastchoices.com/adchoices",
            "length": "0",
            "sourceUrl": "https://traffic.megaphone.fm/DGT2156062133.mp3"
        },
        {
            "title": "You Deserve To FEEL GOOD! How To Step Out of A Negative Cycle",
            "datePublished": "Fri, 25 Sep 2020 07:01:00 -0000",
            "description": "Have you been having a hard time implementing day to day habits that lead to you feeling really good, throughout the day and throughout your being? We are all struggling somewhere, and there are little changes in our self-care we can make that can help to get us out of a rut and into a more centered, clear, connected place. \r\nOn this week’s episode, Rachel shares the 3 changes she has made in her life that finally got her out of a rut and back into a lightness of being. As good as it feels to sit on the couch, eat homemade baked goods and watch Top Chef, it feels a lot better to watch the sunrise at 5 am, and start the day from the inside out. \r\nStarting the day by exploring your inner world and cutting out that which does not serve you can do wonders for your wellbeing. This episode will inspire you to really give yourself time to be alone, to meditate on what it is that you can bring into balance into your life, to get outside into nature, and to make the commitment to implement small daily changes in order to feel good deep inside of your soul. \r\nLearn more about your ad choices. Visit podcastchoices.com/adchoices",
            "length": "0",
            "sourceUrl": "https://traffic.megaphone.fm/DGT2123022671.mp3"
        },
        {
            "title": "God Circled This Spot on a Map For You",
            "datePublished": "Fri, 18 Sep 2020 07:01:00 -0000",
            "description": "Are we all going to be ok? This is one of the most heartfelt questions that Rachel answers on this week’s episode. It has been a while since she sat down to take questions from our listeners – and ultimately, we are all wondering about the same things.\r\nAs we navigate this new world, we are not feeling grounded, centered, safe or secure. We are swinging from high to low, trying to find some type of normalcy and balance during a global pandemic – and we are starting to develop a new reality of actually not being ok. But, Rachel shares inspiring advice that gives us all a reason to move forward.\r\nTune in as Rachel opens up about the deeper questions of finding peace during global panic, how to take care of yourself as an empath, accepting our pain, and also things like her LEAST favorite yoga pose, how day to day life is going in Aruba, if her family will leave the country, and how Lea Luna desperately wants a sibling.\r\nThis episode will remind you to honor yourself first, to care for yourself first, to lean into and own uncomfortable feelings, and to contemplate what it is that you need to be doing on a daily basis in order to take care of YOU.\r\nLearn more about your ad choices. Visit podcastchoices.com/adchoices",
            "length": "0",
            "sourceUrl": "https://traffic.megaphone.fm/DGT4784525484.mp3"
        },
        {
            "title": "Hurt People Hurt People - Love Them Anyway",
            "datePublished": "Fri, 11 Sep 2020 07:01:00 -0000",
            "description": "Tune in to this episode and take a deep exhale as Rachel begins with a grounding meditation before diving into the topic of today: our relationships. Connecting with others lies at the root of this human experience. Our relationships with our loved ones can lift us up and carry us through incredibly difficult times. But, what can relationships with those who challenge us teach us?\r\n2020 is bringing out the worst in a lot of people. Staying steady throughout everything that continues to come our way this year isn't easy! Challenging relationships often bring out a darker side to us. They can add to that inner critical voice that we already have inside, which can be exhausting and depleting – but it also offers us some incredible insight. If your inner critic did not get loud at times, how else would you learn to change that narrative to something more positive? If you were never challenged, how would you find your own boundaries and limits? Those who are the most challenging to us are often those suffering the most – and if you did not learn that key life lesson, how could you practice empathy, compassion, and cut others some slack?\r\nTune in to find the answers to these difficult questions and learn once more the overall lesson: if you do what you need to take care of yourself, chances are you will be in a place to help someone else as well. By taking care of ourselves first, by practicing self-care, by quieting our inner critic, we heal… and spread that healing wherever we go.\r\nLearn more about your ad choices. Visit podcastchoices.com/adchoices",
            "length": "0",
            "sourceUrl": "https://traffic.megaphone.fm/DGT3268668146.mp3"
        },
        {
            "title": "Jay Shetty on How To Find Your Life Purpose (really!)",
            "datePublished": "Fri, 04 Sep 2020 07:01:00 -0000",
            "description": "Are you struggling with finding your purpose in life, staying positive, or looking for changes to make in order to improve your spiritual health? You are not alone!\r\nThis week Rachel is joined by former monk, meditation teacher, motivational speaker and author Jay Shetty. Jay offers valuable spiritual insight into the mindset of a monk, how to infuse your life with purpose, passion, compassion, and service, as well as how to set boundaries and discover triggers (before you become triggered)! \r\nIt's the simple things that end up transforming our lives - the question is how we are able to apply them in our day to day. Jay shares actionable things you can do in your day to cultivate balance, feel good in your body and align yourself with your purpose. Tune in to learn why creating sacred spaces in your house and returning to your self care practices at the same time every day is the most important thing when it comes to wellbeing, and get a step-by-step approach to finding your life’s purpose!\r\nThis week’s podcast will help you cultivate your curiosity in order to find your purpose, make small changes and set boundaries in your life in order to have a more healthy, positive, conscious human experience. Tune in to learn how to think like a monk!\r\nLearn more about your ad choices. Visit podcastchoices.com/adchoices",
            "length": "0",
            "sourceUrl": "https://traffic.megaphone.fm/DGT3245079130.mp3"
        },
        {
            "title": "How To Make It Through 2020",
            "datePublished": "Fri, 28 Aug 2020 07:01:00 -0000",
            "description": "Today’s episode begins with a heart-centred meditation on acknowledging the feelings you are experiencing in this moment. Human beings are complex emotional creatures with the ability to feel many things at once, but sometimes it is hard to distinguish between them all - unless we really sit with our emotions and bring them to surface.\r\nThis meditation is much needed by Rachel as she dives into today’s topic while doing her best to speak from the heart after feeling like she’s lost her voice. In today’s episode she goes into depth around how to figure out where you are meant to be in life, practicing self-care through the most challenging times, making sure we don’t jump to gratitude too quickly and diving deep into the struggles that are playing a role in your life.\r\nWe all have our struggles that we are facing, especially this year as many of use are losing our connection with others and replacing it with fear. Through all the difficulties, it can be hard to find the silver lining - but maybe it is not meant to be found yet.\r\nThis episode will help you discover what is moving through you (and what is really beneath the surface!), find perspective, acceptance and purpose with where you are right now on your journey, and face your challenges by learning from them. Maybe you won’t be met with a silver lining or ray of gratitude just yet, but you can take care of yourself until you reach the other side. Tune in to lean into trust and accept that healing is complex, messy and confusing - but it still offers many insights.\r\nLearn more about your ad choices. Visit podcastchoices.com/adchoices",
            "length": "0",
            "sourceUrl": "https://traffic.megaphone.fm/DGT8305600223.mp3"
        },
        {
            "title": "Cancel Culture and the Seven Stages of Grief",
            "datePublished": "Fri, 21 Aug 2020 07:01:00 -0000",
            "description": "Rachel’s life has been turned upside down lately in a way she cannot fully describe. In today’s episode, she recounts the story that unfolded in the past week after she was ‘cancelled’ online. Although she feels as if she is going through a process of mourning, she is having difficulty pinpointing exactly what it is she is mourning, and the purpose behind it. \r\nHer family is safe. The Yoga Girl community is strong and connected. Island Yoga is still thriving. So, what exactly is she mourning? A sense of safety? A sense of community? A sense of belonging and feeling at home? This type of mourning is visceral and hard on the nervous system. But as with all hard things, the only way out is through.\r\nAnswers may reveal themselves in time, but today all we can do is be kind, find healing, and do more things to connect to peace every moment of our day. Tune in for a heartfelt, raw, honest account of social media gone wrong and the effects it can have.\r\nLearn more about your ad choices. Visit podcastchoices.com/adchoices",
            "length": "0",
            "sourceUrl": "https://traffic.megaphone.fm/DGT1544083647.mp3"
        },
        {
            "title": "Cancel Yoga Girl ",
            "datePublished": "Fri, 14 Aug 2020 07:01:00 -0000",
            "description": "Following the recent Aruban backlash from a social media post of Rachel’s, Rachel and Dennis are facing a situation they have never experienced before: feeling unwelcome and unsafe in their own home. In today’s episode, Dennis interviews Rachel to discuss the entire series of events that have unfolded.\r\nAfter living in Aruba for 10 years, having residency, being married to an Aruban, promoting the island endlessly and working hard to raise money and awareness for the abuse of women, children and animals on the island, Rachel is shocked and saddened by the situation they are currently facing. Cancel culture is real and exists for a reason. It is important to call out individuals so they can learn and do better. But does a poorly timed, out of context opinion warrant harassment, abuse and death threats? \r\nThis episode is a chance for Rachel and Dennis to explain where Rachel’s story post was coming from, offer sincere apologies to anyone negatively affected, and to also share the darker side of cancel culture and social media. Tune in for a genuine and heartfelt episode on the entire story behind the attempt to cancel Yoga Girl.\r\nLearn more about your ad choices. Visit podcastchoices.com/adchoices",
            "length": "0",
            "sourceUrl": "https://traffic.megaphone.fm/DGT1585497149.mp3"
        },
        {
            "title": "The New Normal: Love (and Masks?) In A Time of Corona with Dennis Schoneveld",
            "datePublished": "Fri, 07 Aug 2020 07:01:00 -0000",
            "description": "Are you feeling like you are perpetually living in a state of not knowing? You are not alone! As the world struggles through this pandemic, nothing is certain, and no one really has any answers. The best we can do is take good care of ourselves, hold each other up, and listen to Rachel and Dennis try to work through it on the Yoga Girl podcast. \r\nThis week’s episode features Rachel’s husband, the man that holds her up, Yoga Girl’s very own producer, tech guy, camera man, the hilarious, distinguished gentleman behind the magic, Dennis Schoneveld!  \r\nAs Aruba faces a new coronavirus outbreak after opening its borders to the US, Rachel and Dennis contemplate - is this the new normal? Are we all getting used to not knowing what will happen? Are we getting comfortable living in this new normal of not knowing if businesses will be allowed to operate, if schools will open, if daycares and restaurants are safe? Are we supposed to wear masks every day? How long will this last? The new normal is unknown, and everything can change so quickly.\r\nNow, Dennis and Rachel contemplate another lockdown, how they made it through the first one, what will happen in the future, parenting, their businesses and more, all through the lens of the new “normal” and the unknown. \r\nThis episode would not be complete without answering some of your questions from IG! Will they have another kid, how did they made it through quarantine, will they run off to Costa Rica and create a surfing commune, will it get better or worse in the future? Tune in to find out!\r\nLearn more about your ad choices. Visit podcastchoices.com/adchoices",
            "length": "0",
            "sourceUrl": "https://traffic.megaphone.fm/DGT2587737890.mp3?updated=1596742156"
        },
        {
            "title": "Diversifying The Wellness Industry with Nicole Cardoza",
            "datePublished": "Fri, 31 Jul 2020 07:01:00 -0000",
            "description": "As students and teachers we have a responsibility to look at who is missing in our yoga classes, healing circles and retreats. Healing tools should be available to all! Making a change begins with recognizing just how far we are from equity and diversity in the wellness industry - and taking active steps toward change, every day.\r\nThis week Rachel is joined by the fantastically fierce Nicole Cardoza (@nicoleacardoza on Instagram). Nicole is a yoga teacher, wellness expert, entrepreneur, investor and more! As a strong voice in the anti-racism movement, Nicole is the visionary behind Yoga Foster and Reclamation Ventures, two organizations that are bridging the gap in the wellness industry and making tools for healing accessible to all. \r\nThis episode will guide you on how to diversify your yoga practice, support marginalized voices within the wellness field, and change the face of the wellness industry. Now is a time to shine a light on the spaces we turn toward for healing – and who is missing from them. \r\nLearn more about your ad choices. Visit podcastchoices.com/adchoices",
            "length": "0",
            "sourceUrl": "https://traffic.megaphone.fm/DGT5535846527.mp3"
        },
        {
            "title": "Wherever You Go, There You Are",
            "datePublished": "Fri, 24 Jul 2020 07:01:00 -0000",
            "description": "Life is full of so much doing. We move quickly through our day, from working to planning to organizing to… more doing. Even as this year forced us all to slow down, we didn’t stop ‘doing’. We cooked, baked, organized our homes, or started new projects. But have you ever stopped ‘doing’ for a moment to ask yourself why? What is the real motive behind your inability to be really, truly still?\r\nIn this episode, Rachel shares the traumas in her life that led her to move through life at a pace so fast, her body is having trouble keeping up. In a society that rewards us for success and accomplishments, the concept of slowing down might trigger anxiety, discomfort, or even physical illness! Although Rachel used to pride herself on her ability to do everything and do it well, there is one question she cannot answer – and then what?\r\nAt the end of the day, at the end of our lives – what is all this doing for if we are not present in it? If we rush through life, we miss the most important moments. What if we could operate and create from a place where we are totally accepted, loved, and appreciated for just being? This episode will remind you that you do not have to achieve anything in ordered to be accepted and loved. You are good enough the way you are.\r\nLearn more about your ad choices. Visit podcastchoices.com/adchoices",
            "length": "0",
            "sourceUrl": "https://traffic.megaphone.fm/DGT6434947871.mp3"
        },
        {
            "title": "Were You Born This Way, Or Did You Learn It?",
            "datePublished": "Fri, 17 Jul 2020 07:01:00 -0000",
            "description": "We spend so much time in our armor, protecting ourselves with layers and layers of conditioning. If we do not have our needs met as children, if we are not seen, heard, appreciated or loved, we subconsciously begin to develop a resilience, an armor of protection. We seek to have our needs met elsewhere and develop coping mechanisms to be healed later in life.\r\nIn this episode, Rachel reflects on the internal work she is doing, how it is affecting her, her daughter, her husband, and giving her new perspective and presence. Doing this work is not easy. It gets messy, uncomfortable things come up, relationships can be affected, and unfortunately there is not one linear line to healing. \r\nBut we owe it to ourselves, future generations, our children, our communities, to become aware of our traumas, to begin the journey of peeling back the layers and getting really present with our core wounds.\r\nThis episode will remind you that it is ok to prioritize self-care, to nurture and care for yourself when you are on the sensitive path of healing, and that it’s better to peel back the layers in order to move through the world with vulnerability and truth.  \r\nLearn more about your ad choices. Visit podcastchoices.com/adchoices",
            "length": "0",
            "sourceUrl": "https://traffic.megaphone.fm/DGT2939421506.mp3"
        },
        {
            "title": "Healing Hurts - How To Take Your Spiritual Practice To The Next Level",
            "datePublished": "Fri, 10 Jul 2020 07:01:00 -0000",
            "description": "After everything that has occurred in 2020, there is no going back to the way things were. We have to do better and be better to ourselves. The only way through is to listen to our inner truth and show up for ourselves in a radical way. The world has intensified, so make sure your healing practices align along with it! Perhaps the old, comfortable practices you’ve had before no longer serve your deep longing for peace. How do you know when it’s time to take our practice to the next level? How can we put healing into action? \r\nIn this week’s episode, Rachel shares her disciplined practice of dynamic meditation, and all the factors that led up to this new daily practice. In the midst of it now, Rachel is uncovering hidden trauma, emotions, fears – and a deep internal knowing of her own truth within. Now is the time to listen to it.\r\nWe can’t yoga our way through all of our traumas and insecurities. Sometimes it takes a radical practice to move through everything stored in our nervous system. As a collective we are going through a radical shift, and we are beginning to heal. This episode will open your eyes and hearts to the opportunity we have for change. We have the chance to create a new world where we come back home to ourselves, listen to our deepest truths and embody our inner knowing.\r\nLearn more about your ad choices. Visit podcastchoices.com/adchoices",
            "length": "0",
            "sourceUrl": "https://traffic.megaphone.fm/DGT5731933166.mp3"
        },
        {
            "title": "Radical Honesty with Jessamyn Stanley",
            "datePublished": "Fri, 03 Jul 2020 07:01:00 -0000",
            "description": "This is a time in history when we finally acknowledge the problems we have as a society. For as long as we live, we will remember 2020 as a year of huge change. But - is it enough? There are no quick fixes for issues that have been hundreds of years in the making. There is a beautiful collective healing that is beginning right now, but ultimately, it all comes from within each of us. We cannot be whole as a society if even one of us is not. How does the healing the world is in need of relate with the healing you are longing for within yourself? \r\nThis week, Rachel is joined on the show by yoga teacher, writer, and body positivity activist Jessamyn Stanley to answer these deep questions. Jessamyn is never anything but her true self, which is obvious as she opens up about her journey of self-acceptance, self-care as her most important practice, cannabis, polyamory and more. This episode will remind you of own your truth and the importance of taking care of yourself first. It all starts with being radically honest with yourself.\r\n\r\nLearn more about your ad choices. Visit podcastchoices.com/adchoices",
            "length": "0",
            "sourceUrl": "https://traffic.megaphone.fm/DGT1648979403.mp3"
        },
        {
            "title": "Diversifying the Wellness Industry and Using Joy as an Act of Resistance with Latham Thomas ",
            "datePublished": "Fri, 26 Jun 2020 07:01:00 -0000",
            "description": "The past few months have given us a glimpse of what the world has the potential to be – a world where we work and commute less, where we have more time in our day to take care of ourselves, and most importantly: where justice is for all. In a world that rewards you for putting work and the idea of success above all else, the pursuit of joy and the practice of self-care is a radical tool of resistance and liberation. \r\nThese are the words from this week’s very special guest, Latham Thomas (follow @glowmaven and @mamaglow on Instagram!). Latham is a maternal wellness maven, best-selling author of “Own Your Glow”, Birth Doula, and proud mama who is transforming the world of birth and motherhood. Along with supporting women in optimal wellness and spiritual growth, she also finds time to advocate for birth equity and to bridge policy gaps in maternal health. \r\nThis episode will provide an eye-opening look into the wellness field (where so much change needs to happen!), show you how racism weaponizes tools of consciousness, and give you steps you can take within your own community to look for joy while dismantling the systemic issues that keep others from finding theirs.\r\nLearn more about your ad choices. Visit podcastchoices.com/adchoices",
            "length": "0",
            "sourceUrl": "https://traffic.megaphone.fm/DGT5232271660.mp3"
        },
        {
            "title": "We are Part of the Problem (And How to be Part of the Solution)",
            "datePublished": "Fri, 19 Jun 2020 07:01:00 -0000",
            "description": "How many times have you thought that racism was perpetrated by a select group of ‘bad’ people, that you were completely separate from it, or even that racism didn’t exist at all? The truth is, as white people we have inherent biases and prejudices within us and whether we like it or not, we benefit from that privilege every day. Once our eyes are open to our privilege and to the injustice that comes along with it, we can begin to make real change - but along the way, we are going to make mistakes.\r\nJoin Rachel in this week’s episode of the Yoga Girl Podcast where she humbly shares mistakes she has made as a western, Swedish, white yoga influencer, what she has learned from those mistakes, how the process opened her eyes to the global system of racism and how she is doing the work on a daily basis in order to listen, share resources, and use her platform to amplify BIPOC.\r\nThis episode will remind you to create daily habits that help you to understand the far-reaching effects of systemic racism, listen, share resources, make mistakes, but keep the flame of change burning. Keep listening, re-learning and integrating your education on anti-racism in your day to day life. No problem can ever be solved by sweeping it under the rug.\r\nLearn more about your ad choices. Visit podcastchoices.com/adchoices",
            "length": "0",
            "sourceUrl": "https://traffic.megaphone.fm/DGT3722299054.mp3"
        },
        {
            "title": "How Do You Feel When Everything is Still?",
            "datePublished": "Fri, 12 Jun 2020 07:01:00 -0000",
            "description": "With the current climate of the world, many of us may be noticing little things that we have never realized before. Little things that are actually big things, from the voices we elevate in the media to the color of bandaids. In this episode, Rachel starts by touching on the Black Lives Matter movement from the place of a learner, an observer, and a listener - as all white people should be doing right now. We have a responsibly to do daily reality checks with ourselves to uncover our hidden biases and prejudices. Eventually, our thoughts and actions will align.\r\nBut how can we make a difference in the world while we are moving through our own trauma? As is true with individual trauma, whatever wounds we have inside of us will keep coming to the surface until they are healed. The same can be said with the suffering of the Black community - humanity is uncovering a deep wound right now that’s been kept in the shadows far too long. We need to shed light on this constantly until a great shift and unlearning takes place. Our own traumas can be used to fuel our fire and spark us into action. Ultimately, the majority of the change will happen inside of us. \r\nTune in to acknowledge the pain in the world, and to use your own pain to peel away the layers, dive deep into your healing, and become who you are at your core. To heal the world, you have to start with yourself.\r\n\r\nResources\r\nInstagram Accounts to Follow:\r\nLayla F. Saad @laylafsaad\r\nRachel Cargle @rachel.cargle\r\nJessica Wilson @jessicawilson.msrd\r\nLatasha Morrison @latashamorrison\r\nMunroe Bergdorf @munroebergdorf\r\nAustin Channing Brown @austinchanning\r\nEricka Hart @ihartericka\r\nIbram X Kendi @ibramxk\r\n\r\nBooks:\r\nI’m Still Here by Austin Channing Brown\r\nSo You Want to Talk About Race by Ijeoma Oluo\r\nWhite Rage by Carol Anderson\r\nRaising White Kids by Jennifer Harvey\r\nBetween the World and Me by Ta-Nehisi Coates\r\nLearn more about your ad choices. Visit podcastchoices.com/adchoices",
            "length": "0",
            "sourceUrl": "https://traffic.megaphone.fm/DGT1868620034.mp3"
        },
        {
            "title": "Black Lives Matter",
            "datePublished": "Fri, 05 Jun 2020 07:01:00 -0000",
            "description": "Today’s episode features three guest hosts, Dianne Bondy, Maite Onochie, and Rocky Heron, all guides on the yogagirl.com platform and voices from the Black community. Coming from different global perspectives, they share their views on how they see the world right now - and how the world has seen them. Offering up their deep wisdom on everything from white supremacy, complacency and allyship, this episode will help you question your own attachments to race, and align your inner values with your outwardly behavior. \r\nDianne is a Canadian yoga teacher who focuses on inclusivity, diversity and accessibility on and off the mat. She is the author of the book, ‘Yoga for Everyone’ and offers online courses and workshops at diannebondyyoga.com. She also has two sons, and shares on this show her fears for them, the pushback she receives when she affirms that her life matters - that Black lives matter - and how we can all show up, as spiritual guides and as good human beings.\r\nMaite was born in Nigeria, grew up in Spain, and is now living in Costa Rica. She has a background in social anthropology and a specialization in international development which led her to work for different organizations around the world, including the United Nations. She is now about to birth her first daughter, and shares in this show the world she envisions her daughter growing up in - a world where she can be her authentic self, feel safe in her own skin, and see no limitations to her dreams. Maite speaks on growing up in a predominantly white society where she was left not feeling represented, beautiful or enough. To continue the conversation with Maite and learn about her current work as a yoga teacher and doula, follow her on Instagram at @maite_yoga.\r\nRocky Heron is a musician and yoga teacher. He grew up in California with his mother, and shares his unique view of being a person of color raised in a white culture and how that forged his identity and allowed him to see multiple perspectives. With a passion to always continue learning, Rocky expresses the need for Americans to educate themselves on the history of their country, and demand more from leadership. You can find Rocky on Instagram at @rockyheron.\r\nTune in to listen from the heart to voices that need to be heard, now, and always.\r\nLearn more about your ad choices. Visit podcastchoices.com/adchoices",
            "length": "0",
            "sourceUrl": "https://traffic.megaphone.fm/DGT1127079684.mp3"
        },
        {
            "title": "What Helps You Remember that Your Body is Sacred?",
            "datePublished": "Fri, 29 May 2020 07:01:00 -0000",
            "description": "In this episode, Rachel finds herself in a place of shame after realizing she has gained weight during quarantine. But here’s the thing - she felt no shame at all, in fact she felt great in her body, until she stepped on a scale. What was it inside of her that caused that shift? \r\n\r\nThis pandemic has brought with it a lot of change, and many of us are seeing changes in our physical bodies. The minute we feel shame, we have a tendency to try changing ourselves. But no matter how we try to change, whether it is through hardcore dieting or through yoga and green juice, it will all be rooted from the same place - a place where it is not okay for us to gain weight or be anything other than what society expects of us. We can also approach “changing ourselves” in a completely different way. Maybe it is not our bodies that need to change, but our mindsets instead, and the years of conditioning that society has fed us. Instead of dieting, or judging, or feeling shame - come back to that practice that reminds you that your body is sacred. Do things that serve you. Keep growing. Society has told women to shrink themselves for too long.\r\n\r\nThis episode will remind you of the tremendous gift your body is and the wisdom it contains. Your body is divine, your body is sacred, and your body is an asset to your enlightenment - not a hindrance. Tune in to shed the layers and come back to a deep rooted self-love that has been inside you all along.\r\nLearn more about your ad choices. Visit podcastchoices.com/adchoices",
            "length": "0",
            "sourceUrl": "https://traffic.megaphone.fm/DGT9925181022.mp3"
        },
        {
            "title": "You Have The Power To Change Your Life (and here is how to begin!)",
            "datePublished": "Fri, 22 May 2020 07:01:00 -0000",
            "description": "In this episode, Rachel reflects on the patterns and relationships that haven’t been serving her throughout her life. There is one common thread between them all: she played a role in the decision making. The pace of her life, the people she invited into it, and the work she focused on was ultimately decided by her. What if this is true for all of us? Are we are all actively playing a part in the things that don’t serve us in life? \r\nAs society slowly starts moving again, there is a lot for us to make sense of – but ultimately, we are in control. The truth is, we don’t have to continue being the same person we were pre-corona virus. We have the chance to implement changes around infrastructure, relationships, self-care, and mental health, and we can water the areas of our lives that we want to nourish and grow. \r\nWhat changes do you want to make to align with everything that you truly desire? Have you noticed anything come up that is keeping you separated from your heart’s purpose? Are there areas of your life that you feel you are neglecting, or not having the hard conversation, or looking the other way? This episode will remind you that if you want a different kind of life, now is the time. If you want to make a difference, start with caring for yourself, setting clear intentions and goals, and aligning with your deepest desires. You may notice that once you come into alignment, everything around you begins to flourish, too.\r\nLearn more about your ad choices. Visit podcastchoices.com/adchoices",
            "length": "0",
            "sourceUrl": "https://traffic.megaphone.fm/DGT5821416774.mp3"
        },
        {
            "title": "Setting Boundaries and Showing Up for Yourself",
            "datePublished": "Fri, 15 May 2020 07:01:00 -0000",
            "description": "How often has your intuition warned you that the exchange (physical or energetic!) between you and another individual was unfair, unbalanced or absolutely exhausting? More importantly, how often have you ignored your intuition to benefit that other individual’s needs before your own? In today’s episode, Rachel discusses the importance of setting and keeping boundaries for the sake of your own mental health.\r\nIt can be so hard to set boundaries and stick to them. As women and mothers especially, we are taught that we are here to serve. But setting boundaries is a radical form of self-care – and when you are at your best self, everyone around you benefits, too. Doing what you need to do to take care of yourself and show up for yourself is a way to heal both yourself and co-dependent relationships.\r\nThis week’s episode will help you take a deeper look into areas of your life that may need some firmly set boundaries and show you exactly how to set them. Tune in to learn one ultimate truth of life: you don’t owe anyone anything that drains you. The world can only benefit from you choosing yourself, each and every day.\r\nLearn more about your ad choices. Visit podcastchoices.com/adchoices",
            "length": "0",
            "sourceUrl": "https://traffic.megaphone.fm/DGT5514065748.mp3"
        },
        {
            "title": "A Garden as a Metaphor for Love, Loss and Life",
            "datePublished": "Fri, 08 May 2020 07:01:00 -0000",
            "description": "We are all subjected to one ultimate truth of life: nothing is permanent. Plants, people, jobs, relationships, and homes – everything that surrounds us is fragile and fleeting. In this week’s episode, Rachel has been watching her garden be assaulted by lizards, dogs, white flies, mildew and a multitude of other challenges, and she is suddenly hit with the realization that her garden represents a metaphor for all of life.\r\nWe may not have control over the eventual outcomes, but we do have a choice when we are faced with obstacles or opportunities. We can choose to show up and nourish the plants regardless of the hardships, or we can give up and miss out on the joyful process of the journey.\r\nThis episode will remind you that the magic of being is found in the journey itself, not in the final destination. We cannot let the fear of pain, grief, or loss hold us back from doing what we love. After all, it’s the fragility of life that makes it so valuable. All we can do is immerse ourselves in as much life as we can while we are here.\r\nLearn more about your ad choices. Visit podcastchoices.com/adchoices",
            "length": "0",
            "sourceUrl": "https://traffic.megaphone.fm/DGT2168811601.mp3"
        },
        {
            "title": "A Coming Back to Earth: How to Live a Life that Sustains You",
            "datePublished": "Fri, 01 May 2020 07:01:00 -0000",
            "description": "We are on the cusp of a major life transition. We can choose to stray away from ourselves, or we can make decisions that put us in alignment with our soul’s true calling. But how can we know what that calling is?\r\nIn today’s episode, Rachel reflects on the times in her life when she felt actual peace and genuine happiness. She realizes that all of those times have a common thread - they were the times she was able to slow down and come back, again and again, to yoga, to baking, to gardening, to the things that brought her into the present moment. As we have been socially isolating for the past few weeks, many of us have been able to return to the things we enjoy most, and it is sparking a world-wide epiphany. What was keeping us from doing what we enjoy in the first place? Was it a drive for success? For wealth? For social standing? Were we trying to ease the feeling of not being safe in our own skin?\r\nWhatever is holding you back from the life you are destined to live, now is the time to release it. Tune into today’s episode to make your peace of mind a priority, to put the ‘being’ back into the ‘doing’, and to connect with your intuition before you act. Maybe the true adventure is presence - and maybe the answers to our questions will come if we are quiet enough to listen for them. \r\nLearn more about your ad choices. Visit podcastchoices.com/adchoices",
            "length": "0",
            "sourceUrl": "https://traffic.megaphone.fm/DGT5677358102.mp3"
        },
        {
            "title": "The Spiritual Path is the Human Path: Messy, Real and Raw",
            "datePublished": "Fri, 24 Apr 2020 07:01:00 -0000",
            "description": "Being human is messy! We are intricate, deeply emotional beings with the ability to feel so many things - and so many conflicting things - at the same time. We swing on a pendulum between productivity and numbing ourselves, between giving too much and shutting people out, between our ego and our soul taking control in the driver’s seat. But - it is all okay. This is exactly what doing the work looks like!\r\nIn today’s episode, Rachel reflects on this period of isolation, the ups and downs she’s faced, and all the emotions that have come and gone. All of it has led her to one realization: we have been given an incredible opportunity to change our lives. We now have the space and time to check in with ourselves more than we ever have before. We are at a precipice on our path to healing and our journey to enlightenment - we just have to anchor into faith and take the leap.\r\nToday’s deeply spiritual episode shines light on exactly what it means to be human - messy, real, and raw. The path to healing, to evolving, and to enlightenment is not linear or easy, but it is the human path. Tune in to understand, embrace and accept your own triggers and patterns of behavior and come back again and again to those tools and resources that can help you make it through. It all comes together in this beautiful journey that is only your own. If you can anchor into the faith of that notion, you can begin.\r\nLearn more about your ad choices. Visit podcastchoices.com/adchoices",
            "length": "0",
            "sourceUrl": "https://traffic.megaphone.fm/DGT2046722349.mp3"
        },
        {
            "title": "Begin Your Path to Self-Healing Today with Dr. Nicole LePera",
            "datePublished": "Fri, 17 Apr 2020 07:01:00 -0000",
            "description": "Are you struggling with feelings of anxiety or is your nervous system exhausted from being stuck in fight or flight? In this time of quarantine, we may have found ourselves with the opportunity to explore our inner landscape and do some deep self-healing work, and that is exactly what this week’s episode is about!\r\nThis week’s show is a perceptive and resourceful conversation between Rachel and holistic psychologist Dr. Nicole LePera, founder of the self-healing, inspirational Instagram account @the.holistic.psychologist.  \r\nTogether, they unpack trauma and talk about how to identify it, how to manage the effects of traumatic events and how trauma can be more than big traumatic experiences. They also talk about our three core needs, how we embody pain and how it plays out in our daily routines, relationship patterns, decision making and generational behavior. \r\nWhile psychology focuses mostly on treating the mind, holistic psychology focuses on our being as a whole and balancing the body in order to treat the mind. There are so many elements to trauma and self-healing, and this week’s episode will help you to recognize your triggers, notice behavioral patterns, and create conscious daily lifestyle choices in order to generate self-healing. \r\nLearn more about your ad choices. Visit podcastchoices.com/adchoices",
            "length": "0",
            "sourceUrl": "https://traffic.megaphone.fm/DGT1377195970.mp3?updated=1587140966"
        },
        {
            "title": "Isolation as a Spiritual Bootcamp",
            "datePublished": "Fri, 10 Apr 2020 07:01:00 -0000",
            "description": "How are you doing in quarantine? Have you asked yourself that question lately, and then allowed yourself to sit with the answer? Are you having a hard time being present with your surroundings? \r\nIn this week’s episode, Rachel unpacks the collective quarantine experience of slowing down, removing distractions and doing our inner work. While being faced with that regardless of the social isolation, there is a voice inside her head that still wants to get up and go, do, create, work, bake, keep it moving, Rachel has big realizations about her childhood wounds and how they relate to her fears around this pandemic. What if for each of us, this could be an opportunity to look within? To step onto the path of healing, without anything distracting us? \r\nThis is not a time to to be productive or dive deeper into work but a time to rest, to reset, to sit and become aware of the slowing down and the opportunity return to what’s truly important.\r\nThe goal is to enjoy the simple art of being. To be able to recognize our triggers, discomfort, fear, anger, sadness, and to breathe through them. To lean in to the unknown and trust. To look up to the sky and have faith in the divine timing of our path. To know that the earth is healing, and that there will be a rebirth after this loss.\r\nThis episode will remind you that it's ok to let yourself feel, to breathe, to trust, and to look forward to whats on the other side of where we are now. A new world where we value human connection over the dollar, where we are growing our own foods, and taking the time to sit and do the inner work to heal.\r\nLearn more about your ad choices. Visit podcastchoices.com/adchoices",
            "length": "0",
            "sourceUrl": "https://traffic.megaphone.fm/DGT3672305363.mp3"
        },
        {
            "title": "How To (Not) Kill Your Spouse During Quarantine - Our 10-Year Anniversary Episode!",
            "datePublished": "Fri, 03 Apr 2020 07:01:00 -0000",
            "description": "This week’s episode is a special one as Rachel has on the ultimate guest, her hilarious and down to earth husband, Dennis Schoneveld! Rachel and Dennis are recording from Aruba on their 10th wedding anniversary as they have found themselves at home, like the rest of us. \r\nTune in as they discuss everything a husband and wife would discuss during this time of isolation, from how they reacted to Luna getting tested for the virus to Dennis’ opinion on the amount of rice they currently have in the cupboard. Ultimately, as they work to protect their team and business during this challenging time, Rachel and Dennis share how to be of service to those in need.\r\nOf course, it wouldn’t be a Rachel and Dennis episode if they didn’t address your Instagram questions. Find out if they will have another baby, if they use any form of THC to calm down, and if Dennis thinks of himself as ‘clingy’. Tune in for a family quarantine episode not to be missed - funny, heartfelt, honest, and real.\r\nLearn more about your ad choices. Visit podcastchoices.com/adchoices",
            "length": "0",
            "sourceUrl": "https://traffic.megaphone.fm/DGT2602564049.mp3"
        },
        {
            "title": "A Social Isolation Survival Guide",
            "datePublished": "Fri, 27 Mar 2020 07:01:00 -0000",
            "description": "Tune in today as Rachel shares more than ten of her best tips to bring normalcy to your day, to move stagnant energy, and to clear your mind of repetitive thoughts so you can get through this period of isolation feeling whole. From doing yoga to making your bed, these small, day-to-day practices can keep you healthy and grounded in a time filled with so much uncertainty and loss of structure.\r\nThe key to getting through this time is found in accepting the dualities of life; work and rest, moderation and excess, and reality and divine intervention. On one hand, Rachel expresses the need to acknowledge what is happening, honor the human suffering taking place, and not bypass the emotions that rise within us - only then can we be of service to the world. On the other hand, we need to pray, lean into trust, and put our faith in that intuitive power within us all that guides us on our path (as Rachel sees for herself through her garden, solar panels, online platform and even her burnout!).\r\nOn days where you feel fragile and vulnerable, this podcast will remind you that together we are strong. You are not alone. We are all walking this journey together, and we can get through it together by taking good care of ourselves.\r\nLearn more about your ad choices. Visit podcastchoices.com/adchoices",
            "length": "0",
            "sourceUrl": "https://traffic.megaphone.fm/DGT9069743982.mp3"
        },
        {
            "title": "Testing for COVID-19, Working Through Fear and Making Sense of a Global Pandemic",
            "datePublished": "Fri, 20 Mar 2020 07:01:00 -0000",
            "description": "As coronavirus has the entire world in its grip, this global energy of fear has left many of us in a place of uncertainty. Will there be a resource shortage? Why isn’t everyone self-isolating? And what if the most unlikely happens, as it seems to be happening every day? In times of such uncertainty, many of us are feeling emotions we have never felt before – and many past traumas may find themselves resurfacing.\r\nIn this week’s episode, Rachel shares the series of events that brought the small island of Aruba, and her own family, from indifference about the coronavirus to complete pandemonium. Living on a desert island that has three grocery stores dependent on imports, and one hospital with four ventilators, Rachel found herself spiraling into familiar feelings of lack, grasping for control and fearing the unknown. It all cumulated into one of the hardest days of Rachel’s life – when her daughter experienced her first trauma after being called to be tested for the virus by the Aruban government.\r\nAs this virus creates harder days for us all, and especially the most vulnerable, we have to do what we can to find a balance between indifference and pandemonium, between severity and humanity, and between holding on and letting go. The answer can be found in creating community wherever we can, in feeling our feelings and holding space for others to feel theirs, and in rooting ourselves in knowing that some days may be harder than others – but we can take it one day at a time.\r\nLearn more about your ad choices. Visit podcastchoices.com/adchoices",
            "length": "0",
            "sourceUrl": "https://traffic.megaphone.fm/DGT5951925276.mp3"
        },
        {
            "title": "GaryVee Shares the Secret to Success + Why Happiness is Part of Your ROI! ",
            "datePublished": "Fri, 13 Mar 2020 07:01:00 -0000",
            "description": "Are you looking to grow your business - or are you struggling to start one? Having a hard time balancing work and family life? Trying to use social media to grow your business but wondering how to stay authentic in the process? Then this podcast is for you! \r\nIn this week’s episode, Rachel is joined by the king of entrepreneurship, Gary Vaynerchuk. Gary shares his knowledge on how he stays so extremely positive by tapping into the macro perspective of health and well-being, and not getting stuck in those micro negative moments. \r\nAs an entrepreneur, Gary has built the foundations for many successful businesses, and breaks down the pros and cons of social media, the importance of staying authentic, and doing the micro work for the greater good of the macro goals. With 900+ employees and a resume that’s miles long, Gary shares his most valuable advice for creating abundance and sustainable growth.\r\nThis podcast will teach you how to be strategic and innovative so that your business can compete with the best of the best. Tune in for a look into the GaryVee business and lifestyle model!\r\nLearn more about your ad choices. Visit podcastchoices.com/adchoices",
            "length": "0",
            "sourceUrl": "https://traffic.megaphone.fm/DGT6875797365.mp3"
        },
        {
            "title": "Healing Childhood Wounds Through Parenthood",
            "datePublished": "Fri, 06 Mar 2020 08:01:00 -0000",
            "description": "How can you know yourself deeply if you’ve never touched the depths of your anger or reached the height of your joy? We have to feel our emotions to process them in a healthy way – and our ability to do that is often impacted by how our parents led us through sensitive moments as children. But what if our parents left us with empty spaces in our hearts? A beautiful opportunity for healing presents itself when we cross the threshold into parenthood. What if by parenting our children, we can parent ourselves?\r\nIn today’s episode, Rachel is home after a trip to Costa Rica and trying to get her daughter back on her normal schedule. The result is an epic tantrum that lasts hours and emotionally drains Rachel and her husband. When it is all over, Rachel is left staring at the wall and wondering what it all means. Why do toddlers have meltdowns? Is there a purpose to it all? How can we be there for our children in the most challenging moments?\r\nIf you’re a parent, then you know there is no easy way out when your child is having a major emotional tantrum. All you can do is love them, be there for them, and put your patience to the test. As you do that – you may just find you are holding your own inner child as well. By supporting them you are giving yourself the support you didn’t get when you were growing up. Loving them means you are healing old wounds and filling empty spaces in your own heart.\r\nTune in to today’s episode to find healing in the hard moments and safety in your own unconditional love.\r\nLearn more about your ad choices. Visit podcastchoices.com/adchoices",
            "length": "0",
            "sourceUrl": "https://traffic.megaphone.fm/DGT7855318858.mp3"
        },
        {
            "title": "What Life Lesson Are You Learning Right Now?",
            "datePublished": "Fri, 28 Feb 2020 08:01:00 -0000",
            "description": "In this moment - right here, right now - you are on the cusp of a major epiphany. The struggles you are moving through today are teaching you something hugely important, the way every lesson hides a blessing. What if you could get so present with your inner world that you could find nuggets of gold in every challenge you come across, no matter how mundane? What if the path to freedom isn’t found in some holy place far away, but available to us through the vulnerability of being human?\r\nIn this week’s episode, Rachel contemplates boundaries, parenthood and the challenge of having a toddler go from total peace to total chaos, as well as the idea of “spirituality” and how to use day-to-day challenges to evolve and grow.\r\nIt is the most painful lessons that lead us to our big life purposes. Maybe the way to spirituality is not through bypassing our humanity – it’s through connecting with it on every level. \r\nLearn more about your ad choices. Visit podcastchoices.com/adchoices",
            "length": "0",
            "sourceUrl": "https://traffic.megaphone.fm/DGT2487690578.mp3"
        },
        {
            "title": "Marie Forleo on How To Overcome Whatever Life Throws Your Way",
            "datePublished": "Fri, 21 Feb 2020 08:01:00 -0000",
            "description": "Are you struggling to find your purpose, looking to find genuine ways to be of service, or trying to figure out how to cultivate a fulfilling life that celebrates all of your passions? This week’s podcast guest can help you with all of the above! New York Times bestselling author and multi-passionate entrepreneur Marie Forleo joins Rachel this week to discuss why everything is “figureoutable”. Marie shares how to apply your gifts to the world and the tools you have to figure out all of life’s challenges. When you look at life with a positive mindset, everything is possible! This podcast will remind you that you don’t have to listen to anyone but your own inner voice. You can define your own version of success as long as you follow what lights you up and allow your passions to evolve and change - while figuring everything out along the way. \r\nLearn more about your ad choices. Visit podcastchoices.com/adchoices",
            "length": "0",
            "sourceUrl": "https://traffic.megaphone.fm/DGT6729752963.mp3"
        },
        {
            "title": "Healing Tools For Free, For Everyone, Forever - Yoga Girl x 29k",
            "datePublished": "Fri, 14 Feb 2020 08:01:00 -0000",
            "description": "Up until now, having the tools to heal past pain has been something afforded only by a privileged few. What if there was a way to make tools for personal development and healing accessible to everyone? In this episode, Rachel is joined by her dear friend, 29k co-founder and expert on happiness research, Erik Fernholm. Together with the 29k team, they have created an app that offers the tools and processes of therapy, for free! \r\nMost of us need some form of support to cope with our human experience. 29k is an app that you download that offers you tools, connections and exercises scientifically proven to help you heal – all you need is access to the internet and a smartphone.\r\n29k’s goal is to change 5 million people’s lives in 5 years. Right now, we are living in a system that is built on sorrow and pain, however the birthplace of a sustainable future starts with our mental health. Once we heal the parts of ourselves that are broken, we become better neighbors, friends, parents, humans.\r\nThis episode will help you to understand the background behind 29k and how it works, as well as why this is so incredibly important for the future of humanity. If you heal your pain it impacts the rest of your life, creating a ripple effect that will be the birth of a more sustainable future. When we heal, the world heals too. Find 29k on the App Store, or click this link: https://go.onelink.me/fTCm/yogagirl.\r\nLearn more about your ad choices. Visit podcastchoices.com/adchoices",
            "length": "0",
            "sourceUrl": "https://traffic.megaphone.fm/DGT8939744231.mp3"
        },
        {
            "title": "To Heal, We Have to Feel",
            "datePublished": "Fri, 07 Feb 2020 08:01:00 -0000",
            "description": "What if we grew up with the tools we need to be able to feel the full spectrum of emotion? What if we were taught how to check in with ourselves and process the heavy parts of life?\r\nIn this episode, Rachel opens up about the existential life crisis she is having - on purpose! It involves the act of tuning in and becoming really present with your emotions so you can recognize what you are feeling, when you feel it, and why you feel it. The only other option is to lock things deep within ourselves, which usually leads to far worse outcomes.\r\nThe practice of checking in with yourself is so valuable and it’s something you should do everyday, too! Rather than suppressing heavy emotions, can you begin to become present with your emotions, shine light on your feelings, and give yourself space to feel? Can you take a moment, step back, recognize the trigger and sit with it? That is how feelings get processed - and that is how we move on.\r\nThis episode will remind you that you deserve to live in the full spectrum of feeling absolutely everything. If we shut down one piece of our hearts, we shut out the ability to open up to the magic of the universe. It is our responsibility as humans to feel, and to heal. Tune in to give yourself space to feel your feelings and process them so they can be let go. Only then will you be able to open your heart fully.\r\nLearn more about your ad choices. Visit podcastchoices.com/adchoices",
            "length": "0",
            "sourceUrl": "https://traffic.megaphone.fm/DGT7548844765.mp3?updated=1581655478"
        },
        {
            "title": "Netflix, Chocolate Cake and The Cycle of Shame",
            "datePublished": "Fri, 31 Jan 2020 08:01:00 -0000",
            "description": "Are you exhausted from battling your inner critic all day? Are you struggling with limiting beliefs leading to a cycle of numbing behaviors? In this episode Rachel shares about the struggle with her own inner critic, the behaviors she has been using to cope, and how she is learning to find peace in slowing down.\r\nWe all cope with some type of self-medication. Who doesn’t want to sit on the couch, drink wine, eat cake and watch Netflix after a long exhausting day? Most of us are guilty of trading yoga for an evening on the couch in our yoga pants or choosing a tub of Ben & Jerry’s over that kale salad. It’s not so much about what you do, but why you do it! Ice cream, wine and chocolate cake are wonderful things to enjoy, but when we use food and alcohol as a way to numb ourselves chances are we need some help to come back to ourselves. Consciously moving from a place of numbing your feelings to feeling your feelings and prioritizing the practices that help you care for yourself are critical keys to feeling good in our day-to-day. \r\nThis podcast will remind you to listen to your inner best friend, find compassion for yourself along the way, feel your feelings, talk it out, go to therapy, give yourself a break, journal, and use all the healing tools you need to consciously quiet that inner critic. \r\nLearn more about your ad choices. Visit podcastchoices.com/adchoices",
            "length": "0",
            "sourceUrl": "https://traffic.megaphone.fm/DGT6582491117.mp3"
        },
        {
            "title": "Seek Discomfort - A Story About Privilege and The True Meaning of Freedom",
            "datePublished": "Fri, 24 Jan 2020 08:01:00 -0000",
            "description": "We are one people. We all have the same beating heart inside our chests. We are all born with the same longing to be loved and free. However, our freedom only extends as far as our privilege, and some of us are born with more privilege than others. In this episode, Rachel shares the story of how she found herself faced with the challenge of having her US ESTA visa revoked and the eye opening process that followed. She is no longer free to travel to a country she pays taxes in, has multiple businesses in, and has visited countless times before.\r\nAs Rachel travels to the nearest US embassy to apply for a new visa, she is faced with a stifling situation. She watches applicant after applicant be denied entry to the US; family members who have not seen their children in years, only to be sent home heartbroken.\r\nThe whole situation is emotionally draining and exasperating, yet Rachel leans into the discomfort and brings light to what unites us. So much more connects us than could ever separate us - and the world is made up of much more than border lines. This episode will remind you that with privilege comes the responsibility to help other people. After all, we often don’t even notice our own privilege until it is taken away. You can help by donating to https://togetherrising.org/, an organization helping families separated at the US border, created by Glennon Doyle.\r\nLearn more about your ad choices. Visit podcastchoices.com/adchoices",
            "length": "0",
            "sourceUrl": "https://traffic.megaphone.fm/DGT7081882131.mp3"
        },
        {
            "title": "How To Stick To Healthy Habits and De-Clutter Your Life with Gretchen Rubin",
            "datePublished": "Fri, 17 Jan 2020 08:01:00 -0000",
            "description": "Are you struggling to cultivate the habits that you intended to create in the New Year, or do you find it hard to create and stick to healthy habits in general? Maybe you just haven’t found the method that works specifically for you! On this week’s podcast, Rachel is joined by happiness and habit expert and best-selling author, Gretchen Rubin. \r\nTogether, they break down the types of habits you can form to help you to reach your own happiness goals. How can you create inner order for outer calm and find balance with your family, partners, loved ones? The key is to figure out your nature, then frame and cultivate healthy habits that work for you. They also dive into the refreshing topic of decluttering and creating order in your life. What is the secret behind organizing and cleaning out your home? And how can we stop accumulating things we don’t need for good? \r\n This episode will help you frame your life in a way that sets you up for success. Learn how to discern what your true nature is, cultivate and commit to healthy habits, follow through with commitments, de-clutter your home, and accept what you can’t change. There is a big truth waiting to be found!\r\nLearn more about your ad choices. Visit podcastchoices.com/adchoices",
            "length": "0",
            "sourceUrl": "https://traffic.megaphone.fm/DGT5953710400.mp3"
        },
        {
            "title": "How To Manifest from a Place of Ease",
            "datePublished": "Fri, 10 Jan 2020 08:01:00 -0000",
            "description": "As we move deeper into the new decade, we have a chance to shift our lives and choose goals to work toward. This year, can you break down your intentions so that you have the ability to live a simpler life while manifesting your dreams? Can you give yourself the option to live a more intimate life and take time to be present with your loved ones and community?\r\nBeing busy doesn’t equal being accomplished. In this week’s episode, Rachel talks about the benefits of giving yourself space to choose the projects you want to work on, rather than loading up your to-do list with endless tasks. Once the pressure is off, you can manifest from a place of ease.\r\nThis week’s episode will remind you that it’s ok not to finish everything on your list! It’s much more important to prioritize what’s actually important and to cultivate habits in your daily life that lead to happiness. Maybe the trick is to work smarter, not harder. Tune in to figure it out.\r\nLearn more about your ad choices. Visit podcastchoices.com/adchoices",
            "length": "0",
            "sourceUrl": "https://traffic.megaphone.fm/DGT7205976687.mp3?updated=1578608473"
        },
        {
            "title": "You Are More Than What Happened To You - Identifying and Healing Trauma with Shubhaa Kassima Fisher",
            "datePublished": "Fri, 03 Jan 2020 08:01:00 -0000",
            "description": "So many of us are struggling to heal from traumatic events that took place in our past. If you have suffered through loss, separation, disease, abandonment, abuse, neglect... You are not alone. \r\nTrauma is not identified by what happened to us, but by our ability to respond. We often minimize trauma by saying “it could have been worse”, but when something comes our way and it’s too fast, too much, and too soon it can leave us in shock and suffering for years to come. \r\nIn this episode, Rachel is joined by trauma therapist, psychologist and Path of Love leader Shubhaa Kassima Fisher. Together they identify and unpack trauma, dive into how to begin the road to healing, and answer many questions around the topic of trauma and overcoming adversity. \r\nLife is full of ups and downs, valleys and peaks, highs and lows. Those lower vibrational emotions, such as anger, frustration, and loneliness can get trapped in our hearts. The process of healing will only begin once we acknowledge them, and once those feelings are validated and metabolized. If you’re reading this, you have probably already felt the desire to heal! \r\nThere is no better time than now. This episode will help you to acknowledge your own trauma and shine the light on a path forward to help bring you closer to healing. Shubhaa also shares a profound example of the power of healing trauma in her own post-partum recovery story. Tune in to begin the journey! \r\nFor more information on Shubhaa, please visit www.talibshubhaa.com. To sign up for Path of Love, please go to this affiliate link: https://pathretreats.com/forms/en/application/ and use code YOGAGIRL (for every person signed up, we get a kickback to use toward scholarships for people who cannot afford to go).\r\nLearn more about your ad choices. Visit podcastchoices.com/adchoices",
            "length": "0",
            "sourceUrl": "https://traffic.megaphone.fm/DGT9890780411.mp3"
        },
        {
            "title": "Intention Setting Ceremony - Goodbye 2019, Hello 2020!",
            "datePublished": "Fri, 27 Dec 2019 08:01:00 -0000",
            "description": "Do you struggle with setting clear goals for the coming year? In the last episode of 2019, Rachel shares a powerful practice designed to get you super clear, focused and centered around what you need to release from 2019 so you can call in your hearts true longing in 2020. \r\nYou will need a quiet space, a journal, a pen, and anything else that will support you in this sacred practice. Rachel will guide you through a series of exercises designed to get clarity in all areas in your life from 2019 by using helpful questions as writing prompts to feel into your heart space. \r\nThen you will clearly define your intentions for 2020. What do you want to manifest? What are you looking to create? This is a potent practice that will support you in defining the lessons and blessings of 2019 so you can manifest an absolutely amazing 2020! \r\nLearn more about your ad choices. Visit podcastchoices.com/adchoices",
            "length": "0",
            "sourceUrl": "https://traffic.megaphone.fm/DGT3182092913.mp3"
        },
        {
            "title": "From Triggers to Trust - Christmas is a Time to Heal",
            "datePublished": "Fri, 20 Dec 2019 08:01:00 -0000",
            "description": "Are you struggling with feeling like you constantly have to do more, perform better, work harder, parent perfectly, care for yourself, cultivate your relationships and maintain your career? In this episode, Rachel talks about mom guilt, burn out, the inner critic, and the art of slowing down and cutting yourself some slack!\r\nWe all have an inner critic - that loud voice in the back of our heads that tells us we sent good enough. Regardless of our parents best attempts at providing us with a perfect childhood, we all have wounds that create an inner critical voice that haunts us in adulthood.\r\nGetting to the root of the inner critic is the work we are all here to do, and as the holidays is often a time spent around family, now is a good time to look within. Finding that childhood wound and becoming aware of our patterns and triggers is the solution to quieting all that inner judgment - and ridding ourselves of self hate. This episode will remind you that there is no way to get everything perfect, it’s ok to let your kid eat mac and cheese once in a while, and that we can consciously choose how to react to what comes our way. Christmas is a perfect time to start! The work is in how we choose to respond by holding space for ourselves, choosing love over fear, and letting go of the limiting beliefs that stand in our way.\r\nLearn more about your ad choices. Visit podcastchoices.com/adchoices",
            "length": "0",
            "sourceUrl": "https://traffic.megaphone.fm/DGT1065977599.mp3"
        },
        {
            "title": "Calling in Authentic, Genuine Relationships (with yourself and others!)",
            "datePublished": "Fri, 13 Dec 2019 08:01:00 -0000",
            "description": "As the year comes to a close and we reflect on the events of the past year, did you surround yourself with authentic people that really lift you up? Did you do the things that make you feel the most alive?\r\n\r\nIn this episode, Rachel reflects on the past year, everything she has learned, and what the year 2020 will bring. She explores what it feels like not to be in charge of everything, and the value of surrounding yourself with authentic, genuine relationships. \r\n\r\nThe truth is, in a big spiritual sense, we are not in charge. We can control the day to day tasks, but the universe is reflecting back the energy we put out. We are only in charge of our own energy, and the energy we put out into the universe. \r\n\r\nThis episode will remind you that its ok not to be in charge, to ask for the frequencies you want to bring into your life, and to surround yourself with genuine, heartfelt relationships. \r\nLearn more about your ad choices. Visit podcastchoices.com/adchoices",
            "length": "0",
            "sourceUrl": "https://traffic.megaphone.fm/DGT6214041267.mp3"
        },
        {
            "title": "Get Ready For 2020 with Astrologer Debra Silverman​! ",
            "datePublished": "Fri, 06 Dec 2019 08:01:00 -0000",
            "description": "On today’s episode, Rachel is once again joined by expert astrologer Debra Silverman! If you are interested in astrology but overwhelmed by the amount of information out there, this episode is for you. Join Rachel and Debra as they answer all of your questions about astrology and how to apply it as a practice to improve your life.\r\nHow can we get to know ourselves and our personality traits better? Astrology will help you to understand yourself, your friends, your family and your partner. Learning about your astrological configuration gives you a permission slip to be EXACTLY who you are, the way you were born. Astrology helps you to define yourself, your purpose in life, and gives you a map (your natal chart) on how to navigate life!\r\nDebra helps us to understand the meaning of the elements in astrology, sun, moon, and rising signs, and then leaves us with an astrological forecast for each sign for the year 2020. A cosmic episode not to be missed!\r\nLearn more about your ad choices. Visit podcastchoices.com/adchoices",
            "length": "0",
            "sourceUrl": "https://traffic.megaphone.fm/DGT2435001846.mp3"
        },
        {
            "title": "#MeToo, Yoga and Protecting Your Energetic Space ",
            "datePublished": "Fri, 29 Nov 2019 08:01:00 -0000",
            "description": "In this episode, Rachel is in Tulum on vacation with her family and trying to slow down. After receiving some interesting news and getting kicked off a magazine cover shoot after speaking up on the topic of #MeToo in the yoga world, Rachel does what she usually does: she speaks out for justice and stands with those who have been subjected to trauma.\r\nThis is Rachel’s mission in life, to use her platform and voice to spark real change in the world. Actually, this is all of our missions! We can all be of service in different ways in the world.\r\nHowever, being of service takes energy, and Rachel shares a story of a defining moment in her life when she realized it was all too much. This episode can show you that to do good in the world, you have to make sure you are not spreading yourself so thin that you have no energy left for your own heart. Sometimes the universe is hitting us on the head with a big sign, and it’s important that we listen to it. Only by filling your own cup first will you be able to bring your best self to the world, and that is exactly what is needed.\r\nLearn more about your ad choices. Visit podcastchoices.com/adchoices",
            "length": "0",
            "sourceUrl": "https://traffic.megaphone.fm/DGT8695720442.mp3"
        },
        {
            "title": "How To Go From Hurting To Healing",
            "datePublished": "Fri, 22 Nov 2019 08:01:00 -0000",
            "description": "Are you feeling hurt? Betrayed? Upset by the actions of someone close to you (or a perfect stranger)? Wondering how to get to the root of your emotional triggers? In this episode, Rachel talks about unpacking emotional wounds through the use of observing, recognition, holding space, therapy, and putting the pieces of the wounded puzzle back together again. \r\n\r\nDon’t get lost in obsessing over other people’s actions. You can’t control what other people do - you can only control how you react what comes your way. Every time you feel hurt is an opportunity to move closer to healing.\r\n\r\nTaking the time to hold space for your emotions, to express yourself openly, to observe and recognize your triggers can fully change your life. These wounds actually create our realities and are the source of the stories we tell ourselves. This episode will help you get past hurt, stop wasting energy on people who are stealing your energy and help you open up to feeling more compassion for yourself and the healing work you are doing. \r\nLearn more about your ad choices. Visit podcastchoices.com/adchoices",
            "length": "0",
            "sourceUrl": "https://traffic.megaphone.fm/DGT9085298381.mp3?updated=1574437554"
        },
        {
            "title": "Stop Minimizing Your Pain!",
            "datePublished": "Fri, 15 Nov 2019 08:01:00 -0000",
            "description": "Are you carrying around pain, exhaustion, or moving through life from a wounded place? Soldiering on without giving yourself permission to feel? In this episode, Rachel speaks about how minimizing our pain actually creates more of it, and how holding space to feel and heal wounds (large and small!) actually can expand your capacity for compassion and service. \r\n\r\nWe are taught at a very young age to minimize our feelings, to act like everything is ok, and to hide from our pain. This episode will help you to reprogram your mind and heart to actually feel your pain, get to the root of your internal wounds, and give yourself permission to process negative emotions. Until we heal the wounds inside of us, the universe will keep creating similar situations until we consciously choose to change old patterns. \r\n\r\nPain can be transmuted into lightness of being. When you heal your wounds, you free up emotional space in the heart for compassion and the ability to heal others. This episode will remind you its ok to feel, help you to become more compassionate, and be of service to those who genuinely need it!\r\nLearn more about your ad choices. Visit podcastchoices.com/adchoices",
            "length": "0",
            "sourceUrl": "https://traffic.megaphone.fm/DGT6636468565.mp3"
        },
        {
            "title": "Conscious Entrepreneurship - The Art of Doing Business With a Heart",
            "datePublished": "Fri, 08 Nov 2019 08:01:00 -0000",
            "description": "How do you find a balance between remaining authentic while manifesting abundance? Are you struggling to grow your business, or putting a lot of energy into something but not receiving the energetic return? \r\n\r\nIn this week’s episode Rachel reflects on the art of doing business from the heart, why you should be paid fairly for your efforts (including in the yoga industry!), and the energetic exchange of time, effort, and money. Having just released her own line of jewelry, Rachel shares her own early insecurities around money and how she found the confidence to trust her own intuition and move forward in her career.\r\n\r\nYour vision, offerings, services, and businesses take inspiration, time, money and effort to create. Aiming to have an abundant life is not a shameful thing. Don’t let the fear of other people’s reactions hold you back! This episode will remind you that it’s ok to make money, to want abundance, to create something from the heart and put it out into the world of business and commerce.\r\nLearn more about your ad choices. Visit podcastchoices.com/adchoices",
            "length": "0",
            "sourceUrl": "https://traffic.megaphone.fm/DGT3018592981.mp3"
        },
        {
            "title": "Turn Failure and Shame Into Success and Worthiness",
            "datePublished": "Fri, 01 Nov 2019 07:01:00 -0000",
            "description": "What is your relationship with failure? How can we use our failures as spiritual lessons? And what are the limiting beliefs you live by that are actually holding you back? \r\nThroughout her life Rachel has believed that she has to succeed at everything she does - even to the point of exhaustion. In this episode she reflects on the concepts of failure, limiting beliefs, and how to let go of control.\r\nDoing the inner work around our relationship with failure and shame can help us become aware of the patters in our life that are holding us back, and with that awareness, we can change. For Rachel, this means reflecting on what it feels like to loosen her grip of being in control and what a relief it is! The mind can relax and life can be a little messy. We are all humans with successes, failures, struggles, losses and gains.\r\nWhat matters the most isn’t what you do or what you accomplish but who you are. You don’t need to do anything to be worthy of love! This episode will remind you to release limiting beliefs and settle into the knowing that it’s ok to be human. You don’t have to prove your worth. You are already enough.\r\nLearn more about your ad choices. Visit podcastchoices.com/adchoices",
            "length": "0",
            "sourceUrl": "https://traffic.megaphone.fm/DGT4757858289.mp3"
        },
        {
            "title": "Generational Trauma: Heal Now What You Couldn’t Heal Then",
            "datePublished": "Fri, 25 Oct 2019 07:01:00 -0000",
            "description": "In this week’s episode Rachel candidly unpacks some of her generational trauma and how it has influenced her life through her work ethic and motherhood. By becoming a mother, she is given the gift of watching her generational story unfold in the way that she cares for herself and her family. Through therapy and a lot of personal development work, she is recognizing the need to heal her childhood wounds - and that the time to begin is now. We always makes sure our children are so loved, cared for, protected, nourished and well rested. Everything we are providing for our kids, we must also provide for ourselves!\r\nTune in for an episode that will remind you to care for yourself the way you care for your family, take your rest seriously, prioritize your time, and find balance between work and play. Trust that you can heal your own generational traumas by digging in, unpacking, and doing the work in order to grow. \r\nLearn more about your ad choices. Visit podcastchoices.com/adchoices",
            "length": "0",
            "sourceUrl": "https://traffic.megaphone.fm/DGT3395075368.mp3?updated=1571960584"
        },
        {
            "title": "Battling Burnout - Hard Lessons and Big Blessings",
            "datePublished": "Fri, 18 Oct 2019 07:01:00 -0000",
            "description": "This episode finds Rachel sharing something that is really hard for her to say: lately, she hasn’t been feeling well mentally. As someone who provides healing to others in her courses and retreats, and as someone with an incredibly blessed life and so many exciting events surrounding her; the hardest part about the anxiety Rachel has felt has been having no clear reason as to why this is happening. Sometimes we are drowning in a feeling of failure and unworthiness for no reason, and this is ultimately what brought Rachel to her first therapy session.\r\nThe path toward healing can be a dark one, especially when you cannot see the insight, lesson or epiphany that is waiting for you at the end. Tune in for an episode that will reinforce the importance of asking for help when you need it and allowing yourself to feel what you feel. It is possible to live an incredibly blessed life and still not feel like yourself sometimes, and that’s okay.\r\nLearn more about your ad choices. Visit podcastchoices.com/adchoices",
            "length": "0",
            "sourceUrl": "https://traffic.megaphone.fm/DGT1450986028.mp3?updated=1571383600"
        },
        {
            "title": "Give Yourself Permission to Feel! Live from NYC",
            "datePublished": "Fri, 11 Oct 2019 07:01:00 -0000",
            "description": "This week’s podcast is a special Live show recorded in NYC! This podcast begins with a hilarious open from Dennis, and is filled with courageous, heart centered sharing and stories from both Rachel and audience members.\r\nRachel reflects on what it means to consciously feel our feelings and how to consciously navigate your emotions, every day. It’s so important to give yourself permission to be the way you are! Learn how to lean into uncomfortable feelings, and process and do the work around your wounds and triggers. If you keep doing the work, you will gather enough healing moments where you can appreciate your feelings, and truly begin to work through the lessons they are teaching you.\r\nGrab a pen and your journal as Rachel guides the audience through stream-of-consciousness journaling and a heart opening sharing exercise. The audience has a chance to share with Rachel, and this episode is filled with beautiful, heartfelt stories while Rachel holds space for all to breathe, heal, feel, release and grow.\r\nLearn more about your ad choices. Visit podcastchoices.com/adchoices",
            "length": "0",
            "sourceUrl": "https://traffic.megaphone.fm/DGT3609328414.mp3"
        },
        {
            "title": "Self-Promotion as a Spiritual Practice",
            "datePublished": "Fri, 04 Oct 2019 07:01:00 -0000",
            "description": "In this week’s episode, Rachel reflects on consciously having to make the effort to slow down during challenging weeks before diving into the delicate subject of self-promotion. It’s hard. Super hard. It takes courage to get out there and promote your work, while staying authentic to your truth, heart and passion. After some negative comments on the promotion of her book, Rachel reflects on how to stay authentic, what might be triggering this reaction to her work, and the act of self-promotion from a heartfelt space. Promoting yourself is taking the work you created and putting it out into the world, opening yourself up for judgement, criticism, negative comments, and people possibly not liking your work. It takes a strong sense of self-worth to be able to have the confidence to promote yourself! It becomes a spiritual practice. Looking within and determining whether you are promoting for validation or promoting from a heartfelt place is a good place to start. This is where the work comes in! Is what you are promoting is authentic, are you proud of what you do, does it come from a heartfelt space, does your work offer something to the world? This episode will help you to gain more confidence in your work, navigate self-promotion, and tune into the art of promoting what resonates from the heart.\r\nLearn more about your ad choices. Visit podcastchoices.com/adchoices",
            "length": "0",
            "sourceUrl": "https://traffic.megaphone.fm/DGT3397299751.mp3"
        },
        {
            "title": "What Matters Is Who You Are, Not What You Do",
            "datePublished": "Fri, 27 Sep 2019 07:01:00 -0000",
            "description": "In this episode, Rachel reflects on the process of becoming an author, the importance of making the New York Times bestselling list, and the healing properties of creation. When Rachel published her first book, Yoga Girl, she made the New York Times bestselling list and for the first time understood the importance of it in the world of books. This time around, Rachel has been waiting all week for the list to come out. Will her agent call her with good news? What if she doesn’t make the list? How will she manage her expectations and disappointment if she doesn’t? She realizes that regardless of the list, she has created a beautiful book, and through this journey of telling her story, she was able to heal. Her worth is not determined by doing, but by being. By looking within and sharing a story that she hopes will help other people moving through similar things, she realizes that creation comes from simply BEING in that state of flow, tuned into the heart.  If Rachel has touched one single person, or just brightened one person’s day with this book, that is all that matters! This episode will remind you that your worth is not determined by doing but that your worth resides in the quality of your being. You don’t have to accomplish anything to be worthy of love. You are already so absolutely lovable - just the way you are.\r\nLearn more about your ad choices. Visit podcastchoices.com/adchoices",
            "length": "0",
            "sourceUrl": "https://traffic.megaphone.fm/DGT4591141272.mp3"
        },
        {
            "title": "A Meditation For Self Acceptance",
            "datePublished": "Fri, 20 Sep 2019 07:01:00 -0000",
            "description": "In this episode, Rachel leads you through a guided meditation focusing on the breath. For this episode, find a quiet place to sit where you can close your eyes and bring your awareness inward. This practice will help you use your breath to create space in the body, let go of anything not serving you and release tension. Use this guided meditation to help you focus the mind, breathe into the present moment, and let go.\r\nWe have the ability to set a positive cycle in motion! The mind is very powerful, and by taking the time to drop into stillness, we can change the cycle of the thought process from negative to positive. Allow yourself to invite a sense of ease through the breath, a sense of grounding, and open up to a creative flow. Invite the things that you want and need into your life. This episode will help you ease into a sense of self-acceptance and leave you with a feeling of deep peace. \r\nLearn more about your ad choices. Visit podcastchoices.com/adchoices",
            "length": "0",
            "sourceUrl": "https://traffic.megaphone.fm/DGT3171778177.mp3?updated=1568934676"
        },
        {
            "title": "Help Heal The World (and your heart!)",
            "datePublished": "Fri, 13 Sep 2019 07:01:00 -0000",
            "description": "In this episode, Rachel reflects on her present emotional state and the powerful tool of service. As humans, we can quickly become self-centered and only concern ourselves with our immediate problems. As Rachel begins to unpack her emotional state, she takes a closer look into herself and starts to do the internal work. She begins to focus on the aspects of her life that bring her peace: service.\r\nThe launch of Yoga Girl Foundation is the number one project in her life that brings her peace. After two little boys who lived 15 minutes from her home in Aruba died from abuse, Rachel’s eyes opened to the massive abuse problem worldwide. She created the Yoga Girl Foundation, an organization dedicated to helping abused women and children.\r\nYoga Girl Foundation’s first project is to build a Family Justice Center in Aruba. The goal of this center is to catch the victims of abuse and to ensure that they are safe, loved and free from harm. Yoga Girl Foundation’s focus is to make sure the proper protocol is in place, the victims are well cared for, well documented, well managed, and all of the entities are connected within the system.\r\nBeing of service is one of the most important offerings you can make to the world. If you would like to learn more about the Yoga Girl Foundation, please visit www.yogagirlfoundation.com. You can donate directly to the foundation, help spread the word on social media and to your friends and family. This episode will remind you to turn to service in any way possible, and do what you can for the sake of this world! \r\nLearn more about your ad choices. Visit podcastchoices.com/adchoices",
            "length": "0",
            "sourceUrl": "https://traffic.megaphone.fm/DGT1958487756.mp3"
        },
        {
            "title": "Listen To Your Inner Voice (Not To Assholes)",
            "datePublished": "Fri, 06 Sep 2019 07:01:00 -0000",
            "description": "In this episode, Rachel reflects on the pressures of society and how it affects us creatively. We are all born with a unique gift; a way to be purposeful in life that no one else could ever mimic or duplicate. But how we create and how we find that purpose can get distorted by society and outside influence. Instagram, social media, photo filters and all of society telling us we have to look perfect, be perfect, act perfect makes it so hard to listen to our inner voice and for us to feel good enough the way we already are.\r\nIf we fall into the rabbit hole of social media, comparing ourselves to others, and concerning ourselves with what others think, how will we ever be able to tune into the heart and create the life we were meant to have? \r\nRachel reminds us to tune into the heart, listen to our inner voice, and find ways to get into the creative zone. The universe aligns exactly as it was meant to when we are working from the heart and creating with passion, unattached to the outcome or to what other people think; creating for the love of creation! \r\nThis episode will remind you to be authentic, create from the heart, listen to your inner voice and anchor into this most important truth: there is not a single thing about you that you need to change. You’re a badass! Don’t ever forget it.\r\nLearn more about your ad choices. Visit podcastchoices.com/adchoices",
            "length": "0",
            "sourceUrl": "https://traffic.megaphone.fm/DGT2306303191.mp3"
        },
        {
            "title": "Turn Self-Pity Into Self-Appreciation ",
            "datePublished": "Fri, 30 Aug 2019 07:00:00 -0000",
            "description": "In this episode, Rachel gets personal about her struggle to pull herself out of a dark, fearful place. After staying up all night worrying about Lea Luna, she begins to spiral into a self-pity party, only to be pulled from her funk by a touching message from one of her followers. She begins to process her fear, realizing that she has not taken the time to emotionally work through the release of the book, and that with the book release, her deepest traumas will be shared with the world. But, thanks to the message she received at the exact moment she needed it, she receives the perspective needed to turn the day around, beginning to process her emotions around the book release and upcoming tour. Rachel starts to focus on the positive effects of the book; keeping the memory of her best friend alive, offering her story in hopes that it will help others cope with trauma, and the healing element of connecting with community through her book tour. This episode will remind you to consciously choose to change the negative feedback loop in your mind, give yourself time to process your emotions, become grateful for all of the opportunities in your life, and help you to envision meeting and exceeding your goals.\r\nLearn more about your ad choices. Visit podcastchoices.com/adchoices",
            "length": "0",
            "sourceUrl": "https://traffic.megaphone.fm/DGT6123707794.mp3?updated=1567139265"
        },
        {
            "title": "How To Win At Marriage with Dennis Schoneveld ",
            "datePublished": "Fri, 23 Aug 2019 07:01:00 -0000",
            "description": "In this episode, Rachel is joined once again by her amazing, slightly awkward, sarcastic and hilarious husband, Dennis Schoneveld! Getting hyped for Rachel’s upcoming US Book Tour (Find all details at www.toloveandletgo.com!), the two discuss travel (and who is the worst one to travel with; the kid or the dog?), the key to a successful marriage, where they see themselves in five years and what their thoughts are about baby #2. With everything they have going on, the two still find time for lots of laughter. Tune in to see just how they make it work - we promise you’ll be belly laughing the entire time.\r\nLearn more about your ad choices. Visit podcastchoices.com/adchoices",
            "length": "0",
            "sourceUrl": "https://traffic.megaphone.fm/DGT4964172891.mp3"
        },
        {
            "title": "Where Your Attention Goes, Energy Flows",
            "datePublished": "Fri, 16 Aug 2019 07:01:00 -0000",
            "description": "In this episode, Rachel has so many dreams on the brink of coming true. Her new book is being released, she is going on tour, the podcast is growing and taking a new spin… But how do dreams become manifested?\r\nSharing one of her own stories (one that’s weird, wild and involves Ringo’s balls and something called Sugarlumps), Rachel shares just how to turn ideas into reality, even the seemingly unachievable ones. The first steps are always to release the fear of failure, focus on what you can gain, and just do the first actionable thing! Tune in for an episode that will inspire you to just go for it.\r\nLearn more about your ad choices. Visit podcastchoices.com/adchoices",
            "length": "0",
            "sourceUrl": "https://traffic.megaphone.fm/DGT9758976676.mp3"
        },
        {
            "title": "Learn How Set Boundaries - It Will Change Your Life",
            "datePublished": "Fri, 09 Aug 2019 07:01:00 -0000",
            "description": "In this episode, Rachel dives into the important topic of setting boundaries for your time and energy. Whether it’s friendships that don’t align anymore or work engagements that are asking too much, it is ultimately our responsibility to tell the world exactly what we can offer… and when we need to take some space. When you know what those boundaries are, stick to them! The moment you break your own boundary is the moment you tell the world there is no line that can’t be crossed. But when we set clear guidelines, we allow others to learn their own self-reliance, and we usually receive nothing but compassion in return. Life is short! Cherish your precious time and energy. Tune in for an episode that will help you align your values, speak your truth and put your foot down.\r\nLearn more about your ad choices. Visit podcastchoices.com/adchoices",
            "length": "0",
            "sourceUrl": "https://traffic.megaphone.fm/DGT7509498618.mp3"
        },
        {
            "title": "Your Healing Journey Starts NOW",
            "datePublished": "Fri, 02 Aug 2019 07:01:00 -0000",
            "description": "In this episode, Rachel contemplates the body and the role it plays in healing along with the patterns, behaviors, and the stories we tell ourselves. So many of us are in a constant state of stress or fight or flight, especially if we have experienced trauma in our lives. The regular activation of our sympathetic nervous system becomes engrained in us. We feel unsafe and the body holds onto it! \r\nHow can we train our bodies to process what happened and get back to that place of safety? Ultimately, there is no one who can do the work except for you. You can find people to help or give you tools, but we have to take charge. Recognizing that power can be the difference between staying stuck and finding freedom. Tune in for an episode that will help you recognize your own path towards healing.\r\nLearn more about your ad choices. Visit podcastchoices.com/adchoices",
            "length": "0",
            "sourceUrl": "https://traffic.megaphone.fm/DGT2790200967.mp3"
        },
        {
            "title": "How to Practice Self Reflection (It Will Change Your Life!)",
            "datePublished": "Fri, 26 Jul 2019 07:01:00 -0000",
            "description": "In this episode, Rachel is reflecting on the true meaning of self-care: self reflection. Remaining conscious and present with how we feel, what triggers us and how we relate to others is the most important key to living a balanced life. Continuing to self reflect and do the inner work isn’t easy! It requires us to check in with our heart, to stay vulnerable, and to look at ourselves with truthful eyes every day.\r\nHave you ever taken a break from work and felt so low the entire time that you couldn’t even enjoy it? When was the last time you looked at yourself and took care of your own needs? It is our responsibility during those times to do actual self-care; to unpack what isn’t true, to release what doesn’t serve us, to stop telling ourselves old stories, to have the difficult conversations, to let our walls down. To figure out where to go from here. That is what it means to be truly present. That is how you can change your life.\r\nRachel dives deep into this conversation this week, giving examples from her own life and conversations with her husband that showed her that there is purpose in everything. Tune in for an episode that will remind you that the moments where you fall apart are the ones that lead you where you need to go, all in divine timing.\r\nLearn more about your ad choices. Visit podcastchoices.com/adchoices",
            "length": "0",
            "sourceUrl": "https://traffic.megaphone.fm/DGT3162339190.mp3"
        },
        {
            "title": "How to Balance Struggle and Ease",
            "datePublished": "Fri, 19 Jul 2019 07:01:00 -0000",
            "description": "In this episode, Rachel is immersed in her yoga teacher training and is speaking to us from a place of absolute tiredness. Reflecting on her ability to keep going no matter what (really), she ponders something so many of us struggle with: finding the balance between working hard and taking time to rest. Throughout our lives, we fall on different sides of the spectrum between not trying at all and trying too hard. But when we aren’t trying at all - is it due to a fear of failure or are we bravely letting ourselves take some well-deserved space? When we are working non-stop, are we moving toward a place of burning out? How can we find the balance between working, building, manifesting and slowing down, finding peace and keeping our sanity? What if we could find a place of flow and ease in our lives and be able to catch ourselves before we lose it? Ultimately, the universe gives us little clues along the way that hold the secret to a really great life. Tune in for an episode that will help you connect the dots.\r\nLearn more about your ad choices. Visit podcastchoices.com/adchoices",
            "length": "0",
            "sourceUrl": "https://traffic.megaphone.fm/DGT5770211812.mp3"
        },
        {
            "title": "What If Fear Is A Doorway To Healing?",
            "datePublished": "Fri, 12 Jul 2019 07:01:00 -0000",
            "description": "In this episode, Rachel is lucky she can speak after going in for emergency dental surgery! Gaining wisdom after losing a wisdom tooth, Rachel shares on her fears of the dentist, the difficult dental experience she had in the past and how she had built this up to be a really big, gut-wrenching thing when in reality... It was no big deal at all. Sometimes we tell ourselves stories that define our lives; that we will never be able to pull something off, that we are too scared, that certain things are not for us - and these stories often have more power than the reality we are actually in. What’s a story you are telling yourself that isn’t actually true?\r\nTune in for an episode on being uncomfortable and looking your fears straight in the eye. Sometimes facing them can be the biggest moment of healing.\r\nLearn more about your ad choices. Visit podcastchoices.com/adchoices",
            "length": "0",
            "sourceUrl": "https://traffic.megaphone.fm/DGT8045843113.mp3"
        },
        {
            "title": "Anxiety as a Spiritual Practice",
            "datePublished": "Fri, 05 Jul 2019 07:01:00 -0000",
            "description": "In this episode, Rachel is in a pivotal moment of her life. She has been receiving signs from the universe - signs that she is in for BIG CHANGE, both personally and professionally. Change is often not comfortable, but we have to recognize what doesn’t serve us and let it go. \r\nHow do you escape feeling your emotions? Is it through food and alcohol, or do you have other ways of avoiding discomfort? Every time you try to escape your feelings, they go somewhere inside you and eventually they have to be released. But the universe always gives us what we need at the moment we need it, and in the amount we need. So today, feel your feelings - no matter what they are. This episode will show you how.\r\nLearn more about your ad choices. Visit podcastchoices.com/adchoices",
            "length": "0",
            "sourceUrl": "https://traffic.megaphone.fm/DGT3558123307.mp3"
        },
        {
            "title": "Turn Resentment into Compassion",
            "datePublished": "Fri, 28 Jun 2019 07:01:00 -0000",
            "description": "In this episode, Rachel gets personal about an experience in her life that recently caused her to harbor a lot of resentment. When our needs have not been met, or we have been wronged, we are often quick to judge and jump to conclusions. But often times, we don’t know the full story! Putting ourselves in another person’s shoes is difficult, but practicing this is crucial - because the truth can surprise you.\r\nTune in to an episode on expectations, character flaws and how to embrace compassion and understanding, especially when something doesn’t go as planned.\r\nLearn more about your ad choices. Visit podcastchoices.com/adchoices",
            "length": "0",
            "sourceUrl": "https://traffic.megaphone.fm/DGT9081638479.mp3"
        },
        {
            "title": "Be Yourself, The World Depends On It with LP",
            "datePublished": "Fri, 21 Jun 2019 07:00:00 -0000",
            "description": "In this episode Rachel is joined by esteemed singer songwriter LP (you for sure know her platinum single Lost on You!). In between tours, LP is home in LA and takes the time to talk with Rachel about life, love and perseverance. To LP, having tools to calm ourselves so we can take all the curveballs of life is the key to being balanced (and calming ourselves is not the same as laziness, as we often think!). She shares insight from her yoga practice and the process of writing music that’s brought her through everything from break-ups, being dropped from record labels, and eventually turning her dreams into reality.\r\nLife is a long and winding road full of ups and downs. The important part is to show up for yourself as you are throughout the entire journey. Tune in to an episode that will encourage you to listen to your inner voice and honor who you are at your core.\r\nLearn more about your ad choices. Visit podcastchoices.com/adchoices",
            "length": "0",
            "sourceUrl": "https://traffic.megaphone.fm/DGT1142738831.mp3"
        },
        {
            "title": "Be Kind To Yourself",
            "datePublished": "Fri, 14 Jun 2019 07:00:00 -0000",
            "description": "In this episode, Rachel is going through a week of feeling unmotivated and uninspired. We all go through challenging times… while sitting with your struggles can be helpful for learning and evolving, we need know the difference between what is truth and what is our inner critical voice demanding too much of us. The most important thing to do during these harder moments is to pull yourself into the present moment to recognize what you actually need. If a night on the couch eating chocolate cake is what you need - do it! If it’s a run - move your body! If its time spent with loved ones - ask for it! It can be exhausting listening to that inner critical voice all the time telling us to be better and work harder. So, cut yourself some slack, ask for help and allow yourself to receive, and know you are not alone. Tune into an episode that will inspire you to do just that.\r\nLearn more about your ad choices. Visit podcastchoices.com/adchoices",
            "length": "0",
            "sourceUrl": "https://traffic.megaphone.fm/DGT9898631405.mp3"
        },
        {
            "title": "On Being Human with Jen Pastiloff",
            "datePublished": "Fri, 07 Jun 2019 07:00:00 -0000",
            "description": "In this episode, Rachel is joined by her dear friend, writer, public speaker and teacher of all things love, Jen Pastiloff to celebrate the release of Jen’s book ‘On Being Human’. The two have an intimate chat on vulnerability, bullshit stories we tell ourselves, and how to let ourselves off the hook. So often, we believe that we don’t fit it or that we are not enough. But the truth is, we are all human and we are all allowed to take up space in this world.\r\nTune in for a raw and real episode that will remind you of your life’s purpose.\r\nLearn more about your ad choices. Visit podcastchoices.com/adchoices",
            "length": "0",
            "sourceUrl": "https://traffic.megaphone.fm/DGT6511737004.mp3"
        },
        {
            "title": "To Love and Let Go",
            "datePublished": "Fri, 31 May 2019 07:00:00 -0000",
            "description": "In this episode, Rachel finds herself in a huge moment of joy; SHE FINISHED WRITING HER BOOK! While her first book flowed out of her easily, this second book was five years in the making. She recounts the story of writing the first book, going on tour, and the tragic events that turned that happy time into the hardest of her life. But sharing her grief was the first step to healing… and writing down how she felt was the beginning of what would become book number two.\r\nTune into this episode to hear the heartfelt story and the exciting news of what’s coming. Then preorder Rachel’s new book! You can go to bit.ly/toloveandletgo or search To Love and Let Go by Rachel Brathen on Amazon or wherever you get your books.\r\nLearn more about your ad choices. Visit podcastchoices.com/adchoices",
            "length": "0",
            "sourceUrl": "https://traffic.megaphone.fm/DGT1138417053.mp3"
        },
        {
            "title": "Medical Medium on How To Take Charge of Your Health",
            "datePublished": "Fri, 24 May 2019 07:00:00 -0000",
            "description": "In this episode, Rachel is joined by Anthony William, known to the world as Medical Medium. Anthony is a healer, a best selling author and the creator of the famous celery juice movement. \r\nTaking everyone, especially women, on a journey towards better health, Rachel and Anthony discuss everything from chronic illnesses and mental health problems, to thyroid issues, fibromyalgia and acne. Anthony shares his thoughts on vegan and paleo diets, his take on vaccines and the importance of empowering women when it comes to their health. For too long, women haven’t been taken seriously by the medical community. Now, as Anthony moves his mission forward and gives concrete reasons for health problems plaguing so many, he gives a voice to those looking for answers.\r\nTune in for an episode that may change your life, your health, and maybe even your morning routine as Anthony shares the one single thing you should add into your life (you probably guessed it!).\r\nLearn more about your ad choices. Visit podcastchoices.com/adchoices",
            "length": "0",
            "sourceUrl": "https://traffic.megaphone.fm/DGT5040242953.mp3"
        },
        {
            "title": "F*ck Your Abortion Ban",
            "datePublished": "Fri, 17 May 2019 07:00:00 -0000",
            "description": "This week’s episode may spark some debate as Rachel joins the pro-choice versus anti-abortion discussion. Growing up in Sweden, abortion has been legal Rachel’s entire life (and her mother’s and grandmother’s!). Now living in Aruba where abortion is illegal and seeing the current political happenings in the United States, she can no longer keep quiet - for the sake of her own daughter and women everywhere. \r\nCheck your privilege, use critical thinking and tune into this episode to join the discussion. We all have the power to have hard conversations, to protest, to march and to use our voice. We all have the power to change the world.\r\nLearn more about your ad choices. Visit podcastchoices.com/adchoices",
            "length": "0",
            "sourceUrl": "https://traffic.megaphone.fm/DGT5480829922.mp3"
        },
        {
            "title": "Who Do You Need To Forgive? (And Should You Always?)",
            "datePublished": "Fri, 10 May 2019 07:00:00 -0000",
            "description": "In this episode, Rachel answers deep and personal questions from her Instagram community - ones that stirred her heart while reading them:\r\nHow do you forgive someone who really hurt you? \r\nIs there a way to know that we’re on the right path in life? \r\nHow do we continue to practice self-care when we are feeling especially low? \r\nBeginning with a gratitude meditation you’ll get the opportunity to tap into your center, feel your feelings and evoke the powerful vibration of gratitude within yourself. Rachel shares some deep gratitude for the community and then moves on to the topics at hand. Is it true that we “have to” forgive everyone that’s ever harmed us? What is the true meaning of forgiveness? How do we know that are on the right path? And how do we stick with our self-care practice on those particularly challenging days? Sharing insight on forgiveness, life purpose and self-care, Rachel talks about how to navigate challenging times in life and also draws on examples from her own life. \r\nListen in for a heart-opening episode that is sure to give you tools on how to navigate your own healing journey.\r\nLearn more about your ad choices. Visit podcastchoices.com/adchoices",
            "length": "0",
            "sourceUrl": "https://traffic.megaphone.fm/DGT8806621245.mp3"
        },
        {
            "title": "How To Let Your Wounds Make You Wiser",
            "datePublished": "Fri, 03 May 2019 07:00:00 -0000",
            "description": "In this episode, Rachel is on a path to let things GO. In a regular day we often swing from high to low more times than we can count. Having just been triggered by some not-great news, she shares how when she is present with her emotions, she can track how quickly contentment can be replaced with a feeling of unease. What if instead of letting it throw us off track, we can use our triggers as keys to unlock what’s inside of us to learn more about who we really are? The big things that throw us off often relate to childhood wounds. What does your inner child have to say? Are you reacting from an old wound, or are you able to respond from the present moment? In this episode Rachel urges us to go deeper and look at whats behind a situation you are working through that’s challenging you. She discusses the importance of first recognizing what you may be carrying from your childhood and the emotional triggers it manifests. She shares how to allow space for that doubtful voice in your head - and how to use it to give yourself a reality check. Tune in for an episode that provides concrete tools for tapping into the present moment, healing old wounds and embracing the highs and lows of life.\r\nLearn more about your ad choices. Visit podcastchoices.com/adchoices",
            "length": "0",
            "sourceUrl": "https://traffic.megaphone.fm/DGT3874252670.mp3"
        },
        {
            "title": "How To Heal Your Heart",
            "datePublished": "Fri, 26 Apr 2019 07:00:00 -0000",
            "description": "In this episode, Rachel is fresh out of a 7-day retreat leading the art of feeling your feelings, alongside her own teacher from Path of Love.\r\nShe shares the experiences of her childhood that taught her to hide her negative emotions and the work she has done since to allow herself to hold space for anger, frustration and sadness - all the feelings we think we should never feel.\r\nRachel deeply knows that doing this work is part of her life purpose - watching people release trauma and grief that they’ve held onto for years is the closest she has ever felt to God. \r\nHowever, now she is realizing that being so busy, being so sick, and being the “facilitator” instead of a participant has stopped her own desires from coming to the surface. Mainly, her deep desire to have a second baby.\r\nTune in for an episode that will allow you to release control and feel everything in the spectrum of emotions that makes up the human experience.\r\nLearn more about your ad choices. Visit podcastchoices.com/adchoices",
            "length": "0",
            "sourceUrl": "https://traffic.megaphone.fm/DGT9450625684.mp3"
        },
        {
            "title": "Female Entrepreneurship and Redefining Success with Sophia Amoruso",
            "datePublished": "Fri, 19 Apr 2019 07:00:00 -0000",
            "description": "In this episode, Rachel is joined by an unbelievably inspiring entrepreneur known for being a leader in business (and named the richest self made woman of all time!); founder of Nasty Gal and GirlBoss - Sophia Amoruso.\r\nWith these titles and successes behind her, Sophia jumps right in to speaking from the heart by sharing the depressive funk she has been in lately. Starting from nothing and growing a company worth 100 million+ that ended up bankrupt - Sophia shares her definition of failure, the mistakes she made in her first business, and what resiliency actually looks like. So often, it is people telling it like it is that is the most inspiring.\r\nTune in for an uplifting episode that will get you through any of those crappy days we often have. After all, life will always have ups and downs we can’t control, but we can embrace the uncertainty and keep showing up.\r\nLearn more about your ad choices. Visit podcastchoices.com/adchoices",
            "length": "0",
            "sourceUrl": "https://traffic.megaphone.fm/DGT1174322045.mp3"
        },
        {
            "title": "Spring Cleaning For The Body: My Cleanse Story",
            "datePublished": "Fri, 12 Apr 2019 07:00:00 -0000",
            "description": "In this episode, Rachel discusses her current eating and health habits. Over the past months she has not felt 100% and it has left her trying anything and everything that can bring her back to her usual self. She gave up alcohol, caffeine, sugar and went to a raw food diet, with celery juice every morning topped with a parasite cleanse.The topic of diets can be so challenging to navigate with all the information out there pulling us in a million directions. Ultimately, what we put in our bodies should make us feel good (it doesn’t matter how we look!). Tune in for an episode where Rachel goes through all the effects she has experienced so far on her journey towards health.\r\nLearn more about your ad choices. Visit podcastchoices.com/adchoices",
            "length": "0",
            "sourceUrl": "https://traffic.megaphone.fm/DGT5234534452.mp3"
        },
        {
            "title": "How To Set Boundaries And Never, Ever Betray Yourself with Stephanie Birch",
            "datePublished": "Fri, 05 Apr 2019 07:00:00 -0000",
            "description": "In this episode, Rachel is joined by Stephanie Birch, yoga teacher, writer, photographer, and play-at-home-mom.\r\nStephanie opens up about being an introvert and her relationship with writing. She then dives into a deep sharing on her journey through postpartum depression and finding her way to yoga.\r\nRachel and Steph continue to discuss the important pieces of motherhood. Especially - it’s important to allow your children to set boundaries with you. And it’s okay to unintentionally disappoint them every now and then. At the end of the day, your children don’t need a perfect parent. They just need one that allows them to grow into their own authentic selves.Tune in for an inspirational episode that just may bring you to your journal, your yoga mat and, of course, your own authentic self too.\r\nLearn more about your ad choices. Visit podcastchoices.com/adchoices",
            "length": "0",
            "sourceUrl": "https://traffic.megaphone.fm/DGT2828167956.mp3"
        },
        {
            "title": "Hilary Swank on Overcoming the Burden of ‘Perfect'",
            "datePublished": "Fri, 29 Mar 2019 07:00:00 -0000",
            "description": "In this episode, Rachel is joined by two-time academy award winning actress, entrepreneur, activist, and animal lover, Hilary Swank. Rachel was one of the first people that Hilary Swank followed on Instagram and the two of them have a surprising amount of similarities. Diving into a conversation that vibrates with authenticity, Hilary discusses everything from growing up in a trailer park excluded from the local children to connecting with characters in books that sparked the desire to become an actress. Finding fame at a young age and growing up the limelight, Hilary shares the heaviness she felt to have it all together and how she learned to tune into what is really important. For Hilary, that is her family, finding time for self-care and never missing an opportunity for growth.\r\nTune into a down to earth episode that will allow you to embrace the beautiful messiness of your own life as Hilary and Rachel reflect on the burden of ‘perfect’ and how to overcome it.\r\nLearn more about your ad choices. Visit podcastchoices.com/adchoices",
            "length": "0",
            "sourceUrl": "https://traffic.megaphone.fm/DGT9686184794.mp3"
        },
        {
            "title": "Navigating Marriage & Kids with Dennis Schoneveld​",
            "datePublished": "Fri, 22 Mar 2019 07:00:00 -0000",
            "description": "In this episode, Rachel and Dennis are on a super romantic couple’s trip to Bogota, Colombia (Disclaimer: Rachel’s passport was expiring and they used this as a frantic excuse for a date night getaway).\r\nAs expected with Dennis on the show, you are in for another hilarious and slightly inappropriate episode. Rachel and Dennis discuss everything from their level of education and the education they hope Luna will have to vegan food and all the delicious things they are trying in Bogota and when they plan to have their next baby (although they disagree on it). Filled with other fun things, such as vomit and lice, you are sure to be laughing your butt off through out the entire show.\r\nLearn more about your ad choices. Visit podcastchoices.com/adchoices",
            "length": "0",
            "sourceUrl": "https://traffic.megaphone.fm/DGT6949426326.mp3"
        },
        {
            "title": "Vulnerability Will Change Your Life",
            "datePublished": "Fri, 15 Mar 2019 07:00:00 -0000",
            "description": "In this episode, Rachel is back from Costa Rica and home to Aruba. Coming from a very vulnerable place, where she attended the burial of her best friend, she realized: we often act the way we think we should in front of others, instead of allowing ourselves the space to be vulnerable. Especially around our families and those that know us best, we see how we usually act reflected from them and act accordingly.\r\nBut there is something that pain, grief and trauma bring up that tears down all our walls of protection we build around ourselves. It is a terrible time in our lives, but using this as a catalyst to drop into radical vulnerability during normal day-to-day moments can be totally liberating. It will help you realize that life is short and there is no time to sit through anything that isn’t real.\r\nTune in for an episode that will help you find the sprinkles of gratitude among times of pain, sadness and loss and the practice of finding those places of vulnerability to return to again and again.\r\nLearn more about your ad choices. Visit podcastchoices.com/adchoices",
            "length": "0",
            "sourceUrl": "https://traffic.megaphone.fm/DGT2810538082.mp3"
        },
        {
            "title": "How To Cope With Loss ",
            "datePublished": "Fri, 08 Mar 2019 08:00:00 -0000",
            "description": "In this episode, Rachel is approaching a heavy day. Five years ago, she spent Envision Festival with her best friend. She didn’t know it then, but it was the last time she would see her - she past away a few days after. Now, Rachel is at Envision Festival again after giving birth to Luna and heavy feelings are still being stirred up. She shares the story of this day of mourning and the mysterious synchronicity around Luna’s birth and her return to Costa Rica this year that gave meaning to it all. \r\nWhen we lose a big love in our life we have to remember: we were so lucky to experience a love that deep. We had something that cracked our hearts open, gave us so much, and still gives us lessons each and every day. We may never fully heal, but this episode will cement your faith in the notion that the loved ones we’ve lost are never too far away.\r\nLearn more about your ad choices. Visit podcastchoices.com/adchoices",
            "length": "0",
            "sourceUrl": "https://traffic.megaphone.fm/DGT1319639085.mp3"
        },
        {
            "title": "Trusting Your Intuition and the Birth Heard Around the World with Ashley Albrand",
            "datePublished": "Fri, 01 Mar 2019 08:00:00 -0000",
            "description": "In this episode, Rachel is joined once again by intergalactic goddess, Ashley Albrand. Ashley shares the birth story of each of her 4 children - including the birth heard around the world as she delivered her surprise (and breach) twins on her own in Costa Rica. \r\nOn a mission to empower women to be the sovereign of their own desires, to stay in alignment with their feelings and to spread a message of self love and awakening, tune in for an episode with Rachel and Ashley that will give you the confidence to reach for your deepest dreams in life. Everything you desire is on its way.\r\nLearn more about your ad choices. Visit podcastchoices.com/adchoices",
            "length": "0",
            "sourceUrl": "https://traffic.megaphone.fm/DGT1806079824.mp3"
        },
        {
            "title": "You Are Not Sick - You're Healing",
            "datePublished": "Fri, 22 Feb 2019 08:00:00 -0000",
            "description": "In this episode, Rachel and her entire family are in Costa Rica - and super sick. Every time Rachel travels here, anything that is stirring inside her is brought to the surface. This time, becoming sick has Rachel reminiscing on her astrology teachings from last year and recognizing what happens if she does not slow down. With this intense flu Rachel is thrown into a pattern of judgemental thinking and worst case scenarios popping up into her head, bringing about some serious anxiety. In the midst of it all, one simple moment of meditation snapped her out of her funk and she realized: she isn’t sick, she is just going through a healing. Tune in for an emotional episode on shedding layers, struggling through something dark and coming out on the other side. Whatever you are struggling with right now, remember: there is a lesson to learn and a blessing to receive.\r\nLearn more about your ad choices. Visit podcastchoices.com/adchoices",
            "length": "0",
            "sourceUrl": "https://traffic.megaphone.fm/DGT7549634565.mp3"
        },
        {
            "title": "How To Manifest Anything You Want",
            "datePublished": "Fri, 15 Feb 2019 08:01:00 -0000",
            "description": "In this episode, Rachel is recording from Costa Rica. After living there for many years, this is Rachel’s first time back since having Lea Luna and her life is dramatically different.\r\nWhen Rachel lived in Costa Rica before, she was broke and in and out of work. What kept her knowing all would work out was the practice of manifestation through visualization. \r\nComing back to Costa Rica reignited this practice again and Rachel was reminded of all the possibilities she used to see when it came to the big picture, which to her is changing the world.\r\nWhen it comes to manifesting your greatest dreams, such as the career you dream of, the family you always wanted, or changing the world, it is important to manifest smaller things along the way for practice. If you want something, don’t look at all the obstacles in your way! Look at all the possibilities and see them in your mind. Tune in for an episode that will broaden your scope of what you believe is possible and give concrete actionable advice on how to turn your motivation into action and your action into big changes in the world.\r\nLearn more about your ad choices. Visit podcastchoices.com/adchoices",
            "length": "0",
            "sourceUrl": "https://traffic.megaphone.fm/DGT7890814527.mp3"
        },
        {
            "title": "Deepak Chopra Wants You To Move, Sleep and Practice Gratitude",
            "datePublished": "Fri, 08 Feb 2019 08:01:00 -0000",
            "description": "In this episode, Rachel is joined by none other than Deepak Chopra! World renowned author, speaker and health guru, Deepak brings his wisdom and shares it with us in a beautiful episode on how to create a more balanced, peaceful and sustainable world. To him, it’s simple. We begin by creating more balanced, peaceful and sustainable lives for ourselves. Deepak shares his best advice and insights with emphasis on the importance of moving your body, sleeping well each night, and taking moments to reflect on what you are most grateful for. Tune in for an episode that is sure to inspire big change in your life. All is connected - and it is never too late to begin. More resources from Deepak Chopra are available at http://isharonline.org/.\r\nLearn more about your ad choices. Visit podcastchoices.com/adchoices",
            "length": "0",
            "sourceUrl": "https://traffic.megaphone.fm/DGT6530210271.mp3"
        },
        {
            "title": "Should We All Turn Our Passion Into a Business? With Jessica Taylor",
            "datePublished": "Fri, 01 Feb 2019 08:01:00 -0000",
            "description": "Jessica Taylor, good friend of Rachel's, joins the podcast to discuss the sate of the online yoga world and the hardships of running your own business. \r\nLearn more about your ad choices. Visit podcastchoices.com/adchoices",
            "length": "0",
            "sourceUrl": "https://traffic.megaphone.fm/DGT7321491970.mp3"
        },
        {
            "title": "What If We All Just Did Whatever the F*ck We Want? ",
            "datePublished": "Fri, 25 Jan 2019 08:01:00 -0000",
            "description": "Rachel shares some big life challenges she's had over the past week, such as cutting out her braid that her best friend put in her hair 12 years ago, waxing her legs, trying CBD oil and completing a triathlon, all while dealing with a crazy toddler.\r\nLearn more about your ad choices. Visit podcastchoices.com/adchoices",
            "length": "0",
            "sourceUrl": "https://traffic.megaphone.fm/DGT6974534392.mp3"
        },
        {
            "title": "What If Every Challenge Is a Blessing In Disguise?",
            "datePublished": "Fri, 18 Jan 2019 08:01:00 -0000",
            "description": "Rachel shares lessons her daughter, Luna, teaches her on a daily basis and how often times these \"teachers\" shop up through immensely challenging moments and hold the key to self realization. \r\nLearn more about your ad choices. Visit podcastchoices.com/adchoices",
            "length": "0",
            "sourceUrl": "https://traffic.megaphone.fm/DGT3749070727.mp3"
        },
        {
            "title": "Nurturing Your Friendships with Olivia Rothschild ",
            "datePublished": "Fri, 11 Jan 2019 08:03:00 -0000",
            "description": "In this episode, Rachel is recording from NYC with her best friend Olivia Rothschild. Rachel and Olivia “met half way” in NYC for the only reason that they wanted to spend some time together and have a little break from the husbands and the babies. They chat about life, sex, having more babies, shaving, veganism and all the usual things best friends talk about.\r\nWho do you call when you just need to talk to someone? How do you stay close with your best friends that live far away? Tune in for an episode on the meaning of friendship and the connections that we would fly across the world for.\r\nLearn more about your ad choices. Visit podcastchoices.com/adchoices",
            "length": "0",
            "sourceUrl": "https://traffic.megaphone.fm/DGT4456615251.mp3"
        },
        {
            "title": "Calm and Confident in 2019",
            "datePublished": "Fri, 04 Jan 2019 08:03:00 -0000",
            "description": "Welcome to the first From the Heart episode of 2019 where Rachel shares her intentions for the new year. First, reflecting on 2018 and the challenges that it brought into her life, Rachel notices that she was shook by a loss of confidence. From working too hard and too much, chasing around a crazy toddler and having social media telling her all the things she was doing wrong, Rachel felt self-doubt creep in and latch onto her in the spot that was most vulnerable. This had her questioning every decision she made in her businesses and with her family and friends the entire year.\r\nSometimes, when you have many voices telling you what to do, your inner voice becomes cloudy and overshadowed. Listen in as Rachel discovers the answer to this - sitting in silence and bringing calm and peace into her life to allow her inner wisdom to shine through. In 2019, Rachel intends to embody the calm, confident, inner wild woman that doesn’t give a f*ck what other people think. What are you planning to embrace in 2019?\r\nLearn more about your ad choices. Visit podcastchoices.com/adchoices",
            "length": "0",
            "sourceUrl": "https://traffic.megaphone.fm/DGT3377118895.mp3"
        },
        {
            "title": "Rituals to Set Your New Years Intentions",
            "datePublished": "Fri, 28 Dec 2018 08:03:00 -0000",
            "description": "In this episode, Christmas has just ended and Rachel is feeling the relief. She realizes why people spend the holidays with their extended family - because leaving all the cooking to one person is too big of a job! Rachel discusses the pressure she put on herself to create the perfect Christmas for her family and how it left her missing her mom and wondering exactly what she was trying to recreate.\r\nWith Christmas over for the year, Rachel’s focus shifts to New Years. Intention setting as the year turns is one of her most sacred rituals. She shares her best practices and tips to arrive at her intentions and affirmations and invites you to join in as well.\r\nTune into this episode for a beautifully guided meditation and specific instructions from Rachel’s personal ritual to help you settle into the feeling you want to manifest in your life as 2019 approaches. Beginning the new year with your mind clear and your heart focused is a powerful tool we can all use to manifest what our soul is craving.\r\nLearn more about your ad choices. Visit podcastchoices.com/adchoices",
            "length": "0",
            "sourceUrl": "https://traffic.megaphone.fm/DGT3240900531.mp3"
        },
        {
            "title": "Holidays, Trauma and the Santa Claus Problem",
            "datePublished": "Fri, 21 Dec 2018 08:03:00 -0000",
            "description": "In this episode, Rachel touches on an unexpected parenting issue her and Dennis have come across - Dennis doesn’t want to be Santa for Christmas. Christmas is an especially important time for Rachel and she reflects on her past to figure out why that is. Prior to having her baby girl, Rachel placed so much emphasis on her birthday. Not too long ago, she realized that a happy birthday meant separating from loss and trauma that plagued this celebration before.\r\nSince leaving Sweden, Christmas has been the time of year Rachel loves the most. Coming from complex family dynamics (learn more about these in the episode, “From Suicide to Sobriety” with Rachel’s mom, Shama), Rachel realizes that having a Christmas where everyone is together and happy means so much to her. Spending the holidays with her little family is a time to create happy memories with Dennis and fill Luna’s childhood with Christmas joy and magic. But now, with Dennis and Rachel not seeing eye-to-eye on the importance of Santa Claus, Rachel tries to decide the best course of action moving forward.\r\nThere is beauty in this time of year, even if it is sometimes messy. What are your Christmas stories and traditions? Share and let’s see what this time of year brings us all.\r\nLearn more about your ad choices. Visit podcastchoices.com/adchoices",
            "length": "0",
            "sourceUrl": "https://traffic.megaphone.fm/DGT2554561200.mp3"
        },
        {
            "title": "Let Your Inner Wild Woman Roar",
            "datePublished": "Fri, 14 Dec 2018 08:03:00 -0000",
            "description": "In this episode, Rachel discusses the disconnect between what resonates with her inner voice versus what society tells her. She wonders what her life would be like if she fully let the wild woman inside of her blossom - not the woman who has been conditioned by society. \r\nThese thoughts were triggered after Rachel noticed a pattern of how often she tells Luna how beautiful she is. Of course, this isn’t a bad thing to do - our children are all beautiful - but Rachel realized that this is exactly how she was brought up. Putting an emphasis on our looks, however well-meaning, can lead us obsessing over our exterior as we grow up - but what if you didn’t have to do anything to be worthy? What if you didn’t have to look good or accomplish things or be successful, but you could feel validated just from being exactly the way you are? This is how Rachel wants Luna to grow up. She doesn’t want her to grow up watching her mom do things she hates just to please society - like shaving her legs.\r\nAnything we do that doesn’t make us feel happy and whole should be cut out. For the sake of our daughters and our sons, so they know they can grow up being exactly themselves. Rachel’s conclusion: she needs to let her wild woman roar (and that might include not shaving her legs).\r\nLearn more about your ad choices. Visit podcastchoices.com/adchoices",
            "length": "0",
            "sourceUrl": "https://traffic.megaphone.fm/DGT1042354885.mp3"
        },
        {
            "title": "Maternity Leave Schmaternity Leave",
            "datePublished": "Fri, 07 Dec 2018 08:03:00 -0000",
            "description": "In this episode, Rachel is on her very first day of maternity leave - and it is not going well. She discusses everything that led her to this moment, from feeling burnt out and tired from work with a heavy burden of responsibility on her shoulders. So she took time off and... cleaned the house, walked the dogs, fed the goats, took out the garbage, browsed Instagram and felt like she did nothing of value to help her slow down.\r\nAfter some evaluating, Rachel recognizes that her challenge doesn’t just lie in slowing down, but in practicing mindfulness and staying present in all the moments in between.\r\nAre there areas in your life where practicing mindfulness is a challenge? Where are you not present and how can you better focus your attention? Maybe its the in-between moments - standing at the grocery store line, driving to work, cooking dinner - that really matter. And maybe the key to finding inner peace is available to us, all the time.\r\nLearn more about your ad choices. Visit podcastchoices.com/adchoices",
            "length": "0",
            "sourceUrl": "https://traffic.megaphone.fm/DGT1058532031.mp3"
        },
        {
            "title": "The Art Of Slowing Down",
            "datePublished": "Fri, 30 Nov 2018 08:03:00 -0000",
            "description": "In this episode, Rachel talks about her absolute inability to slow down. After a very intense few years culminating with back-to-back retreats and trainings, her body has started giving her serious signals to work at a slower pace. How do you slow down when moving fast is all you know? Rachel wraps her head around the fact that there is never a time that she is not working. Not on her honeymoon, not after having a baby, not even when she got so sick she had to get a steroid injection in her butt! \r\nShe talks about how leading her latest yoga teacher training while incredibly sick finally allowed her the space to slow down, take a real vacation, and make the decision to go on a very overdue maternity leave. And it also helped her to realize that the world will not stop if she is not constantly on the move.\r\nOur life’s purpose is not something that comes easy for us, it is something we have to work at. Rachel discusses her own life purpose - which just may be learning to slow down and sit with her emotions. Tune in to this episode and then find a way for yourself to slow down this week! Put everything away. Be with your children. Cook dinner. Whatever you are focusing on, immerse yourself in that fully. Be wherever you are - because that is the only place you can be.\r\nLearn more about your ad choices. Visit podcastchoices.com/adchoices",
            "length": "0",
            "sourceUrl": "https://traffic.megaphone.fm/DGT8654495672.mp3"
        },
        {
            "title": "What Scares You? (Part 2)",
            "datePublished": "Fri, 23 Nov 2018 08:03:00 -0000",
            "description": "In this episode, Rachel continues sharing with her group of yoga teacher trainees as they discuss Fear and the answer to the question, “What Scares You?”\r\nHow does fear hold you back? Does it run your life? Does it paralyze you? How does it show up day-to-day? Listen to what this community had to say about it - it may sound very familiar.\r\nThen of course, the participants turn to another question, “What if that fear wasn’t present?” Or “What if fear didn’t have such a big part of our lives?”. What would your life be like without this fear steering the ship? What is the first thing you would do? How would you live differently?\r\nTune in for the second segment of this raw and beautiful podcast. Especially if you’re in need of a good cry, a bit of heart opening, or you just want to sit down and feel your feelings for a moment. Fear may be present in all of our lives, but the first step to moving past it is to recognize that we all fear the same things.\r\nLearn more about your ad choices. Visit podcastchoices.com/adchoices",
            "length": "0",
            "sourceUrl": "https://traffic.megaphone.fm/DGT2768240580.mp3"
        },
        {
            "title": "What Scares You? (Part 1)",
            "datePublished": "Fri, 16 Nov 2018 08:03:00 -0000",
            "description": "In this episode, Rachel is once again joined by her yoga teacher trainees for a special two-part podcast segment.\r\nThe topic of this group sharing is Fear and answering the question “What scares you?”. We are all dealing with fears somewhere in our own lives - in our relationships, family or work lives. Sometimes fear is purposeful, but often it holds us back or paralyzes us. Here, the participants share their deepest fears for the world to hear, speaking openly on their challenges and struggles in a way that will move your heart deeply.\r\nThe sharing then turns to a second question, “What if that fear wasn’t present?” Or “What if fear didn’t have such a big part of our lives?”. If we were released from what holds us back the most - how would our lives be different? How would we act differently? Sharing powerful statements, the participants speak their hearts’ deepest desires - what they crave the most and how they would fully embrace life released from worry, anxiety and fear.\r\nTune in for another beautiful episode of community sharing. It is this openness and raw bravery that shows us all we are not alone, we all feel the same way, and we are all capable of letting go of what does not serve us.\r\nLearn more about your ad choices. Visit podcastchoices.com/adchoices",
            "length": "0",
            "sourceUrl": "https://traffic.megaphone.fm/DGT1607050276.mp3"
        },
        {
            "title": "The Family Podcast",
            "datePublished": "Fri, 09 Nov 2018 08:03:00 -0000",
            "description": "For the first time ever, Rachel is joined by two guests, her husband and her mom! Rachel had the brilliant idea to invite them both on to take control of the show while she is sick and battling a throat infection - but that didn’t work out for her!\r\nThe three discuss everything from their relationship to what they love and the most about each other and what they are annoyed by (chewing, slow talking, and time spent in the bathroom top the list). They also answer some very anticipated questions, such as why Dennis cried at the end of his Iron Man, how he feels being vegan (he’s angry) and how in the world Rachel and her mom are going to survive doing a half Iron Man of their own. \r\nTune in for an episode on family dynamics that will have you laughing out loud and remind you of the importance of family - whether they are near or far.\r\nLearn more about your ad choices. Visit podcastchoices.com/adchoices",
            "length": "0",
            "sourceUrl": "https://traffic.megaphone.fm/DGT9300280148.mp3"
        },
        {
            "title": "Yoga, Judgment and Lea Luna in The Luna Shala",
            "datePublished": "Fri, 02 Nov 2018 07:03:00 -0000",
            "description": "In this episode, Rachel is immersed in leading her third yoga teacher training while Luna is with grandma and Dennis is at an Iron Man race. \r\nRachel reminisces on all the programs she has led since Luna was born, from the ones that were super overwhelming while breastfeeding to the ones that are easier now that Luna is older. Rachel is used to hosting large groups, but it was having a baby that made her realize she has a deep desire to merge her community with her family life and be more accepting and supportive of families as a whole.\r\nThis idea was challenged recently when she shared a post of Luna laughing in the group of teacher trainees and received incredible backlash for allowing her daughter to join the circle. This leads her into a deep conversation on social media drama, her own triggers and the epidemic of judgement that exists especially for mothers.\r\nDisagreements are part of life, but the next time you find yourself disagreeing with someone can you bring more compassion and understanding into the discussion? Can you sit with what triggers you and separate your feelings from the actions of others? At the end of the day, we are all more similar than we are different. The small actions of support you can offer to others matter more than you think.\r\nLearn more about your ad choices. Visit podcastchoices.com/adchoices",
            "length": "0",
            "sourceUrl": "https://traffic.megaphone.fm/DGT4134518359.mp3"
        },
        {
            "title": "The Bet with Dennis Schoneveld",
            "datePublished": "Fri, 26 Oct 2018 07:03:00 -0000",
            "description": "In this episode, Rachel is joined once again by her husband and baby daddy, Dennis Schoneveld! Both Rachel and Dennis have big things coming up - Dennis is participating in his second Iron Man at the same time that Rachel is leading a yoga teacher training. They discuss what happened the last time Dennis did an Iron Man - and how it was the most they’ve ever fought as a couple. Recognizing that Rachel is much calmer this time around (maybe due to the Path of Love retreat she recently attended?), the couple makes a deal - Dennis will attend a Path of Love retreat if Rachel will participate in a Half Iron Man (!!).\r\nFinishing off the episode with some questions from the community, Dennis discusses Rachel’s nagging, what gives him anxiety, how he handles social media drama, what finally made him go vegan - and of course, when to expect baby number two. \r\nTune in for another great conversation between Rachel and Dennis that will redefine the word ‘compromise’ and have everyone cracking up.\r\nLearn more about your ad choices. Visit podcastchoices.com/adchoices",
            "length": "0",
            "sourceUrl": "https://traffic.megaphone.fm/DGT4396371953.mp3"
        },
        {
            "title": "Holding On and Letting Go",
            "datePublished": "Fri, 19 Oct 2018 07:03:00 -0000",
            "description": "In this episode Rachel begins by discussing her newly launched Yoga Girl Community - a safe space for people to open their hearts online. From receiving so many deep and personal messages through emails and social media, she knew she needed to find a space to connect us all in a deeper and more tangible way. With the Yoga Girl Community comes the tradition of Sharing Sunday. Speaking deeper on this and sharing herself, Rachel opens up about her desires to be a participant again - to be unknown and invisible. To step away from things to do deep, emotional work anonymously. To be a regular person and take regular vacations. Diving further, Rachel notices a striking duality that is present in her life - she wants to let go of everything and step away, but at the same time she has a need to control all around her. Noticing that this pattern is related to the environment she grew up in, she discusses the idea that in order to change something about ourselves, we need to go all the way back to the root of what caused it and start our work from there. \r\nWhat patterns do you carry with you from childhood? Which ones serve you and what can you let go of? Join Rachel as she works through this herself and comes away with the notion that while it may be hard to trust - it is safe to let go.\r\nLearn more about your ad choices. Visit podcastchoices.com/adchoices",
            "length": "0",
            "sourceUrl": "https://traffic.megaphone.fm/DGT4312201142.mp3"
        },
        {
            "title": "Feel Your F*cking Feelings with JP Sears",
            "datePublished": "Fri, 12 Oct 2018 07:03:00 -0000",
            "description": "In this episode Rachel is joined by JP Sears, the comedian, author, speaker, emotional healing coach and YouTuber (with over 300 million accumulated views!). Sharing from the heart what has been present in his life lately, JP opens up about feeling lonely and insignificant and how it is through merging comedy and spirituality that he seeks to bring awakening to others. It is, as he says, one of the best ways to let go of the ego, not take things too seriously, and have some fun along the way. With that, JP even shares the only video he has ever deleted and how to handle negative or critical comments from others.\r\nDiving from there into a deep conversation on vulnerability, Rachel and JP notice a common thread as they discuss the emotional distance they felt from their fathers, as well as their need to be “rescuers”. As the discussion draws to a close, Rachel and JP discuss how important it is to feel your feelings as they come - and how this will lead to true change in this world.\r\nHow can we drop our ego and open ourselves up to being vulnerable? What is it about feeling our feelings that will create true change in our society? Join in as Rachel and JP discuss these questions in what is a witty, lighthearted and reassuring conversation.\r\nLearn more about your ad choices. Visit podcastchoices.com/adchoices",
            "length": "0",
            "sourceUrl": "https://traffic.megaphone.fm/DGT7442952159.mp3"
        },
        {
            "title": "Path of Love",
            "datePublished": "Fri, 05 Oct 2018 07:03:00 -0000",
            "description": "In this weeks episode Rachel speaks to us from Path of Love, a retreat she has been assisting for the past week in Motala, Sweden.\r\nTo begin, Rachel tells the story of her own Path of Love experience when she participated in May, 2016. She shares the story of what brought her there (she finally went after booking it twice and cancelling!) and what came out of it (Hint: Her name is Lea Luna). \r\nRachel has been waiting to return to Path of Love ever since, and again has been experiencing new epiphanies each and every day. She speaks of the dualities between the masculine and feminine that exist in her life and relates them to her relationship with her mother and father. It is by doing this work that Rachel has realized how her past and her relationships have shaped her into the person she is today - a person who can take all that she has learned and transform it into meaning.\r\nWhat we go through in life is challenging, but it does not come without purpose. Sometimes it is easy to see the lesson we are learning, sometimes it takes years to discover. Join Rachel in this conversation on healing from trauma, counting your past as a blessing and finding your purpose in the world.\r\nLearn more about your ad choices. Visit podcastchoices.com/adchoices",
            "length": "0",
            "sourceUrl": "https://traffic.megaphone.fm/DGT6378733605.mp3"
        },
        {
            "title": "Imperfection, Self-Doubt and Grief as a Journey",
            "datePublished": "Fri, 28 Sep 2018 07:03:00 -0000",
            "description": "In this episode Rachel is joined by none other than Cheryl Strayed! Cheryl is a novelist, essayist, column writer and podcast host with the Number 1 New York Times best selling memoir “Wild” (you’ve probably seen the movie, starring Reese Witherspoon!) along with several novels under her belt. \r\nRachel begins the episode by reminiscing on Cheryl’s novel “Tiny Beautiful Things” and how it was on her bedside table for years to support her whenever she was going through something challenging. Discussing her Dear Sugar days, Cheryl opens up about the deep and emotional messages she received and how she poured herself into this work that created the deepest sense of kinship with her readers that she has ever known.\r\nDiving into a beautiful conversation on perfectionism and how striving for unattainable balance is a form of imbalance, Cheryl and Rachel beautifully note the dualities of life - especially how they relate to the grief we experience in heartbreaking moments that stays with us for a lifetime.\r\nRelease old patterns that do not serve you, try to find acceptance in every situation in life and tune in to listen to an episode with one of the most inspiring advice givers that this world has to offer.\r\nLearn more about your ad choices. Visit podcastchoices.com/adchoices",
            "length": "0",
            "sourceUrl": "https://traffic.megaphone.fm/DGT3300817427.mp3"
        },
        {
            "title": "Everyone Can Be A Yoga Girl",
            "datePublished": "Fri, 21 Sep 2018 07:03:00 -0000",
            "description": "The wait is finally over. Welcome to Yoga Girl! In this episode, Rachel shares the news she has been wanting to spill forever - we have launched! All the secrets and hints are finally being revealed and this podcast is all about Yoga Girl - the lifestyle, the movement, the brand and the community. Rachel answers all the questions that come in and goes in depth into detail on why she created this platform and what it means for the future. How did this grow from an instagram handle into a community focused on self-love, sustainability, and inclusivity? From the moment six years ago when the @yoga_girl instagram began, Rachel shares the critical moments from losing her best friend, to getting married and having Lea Luna that shaped her - and all of us - into what it is today.\r\nJoin us on www.yogagirl.com to read authentic stories, take heartfelt yoga classes, and be of service to the world. Yoga is for everyone - no matter your age, size, gender, or anything else. This practice is for us all. We can all look within, we can all change the world. Everyone can be a Yoga Girl.\r\nLearn more about your ad choices. Visit podcastchoices.com/adchoices",
            "length": "0",
            "sourceUrl": "https://traffic.megaphone.fm/DGT8953964221.mp3"
        },
        {
            "title": "Catching Up",
            "datePublished": "Fri, 14 Sep 2018 07:03:00 -0000",
            "description": "Feeling emotional, Rachel begins her first solo episode in almost a month catching up on all the recent changes that have come about in her life – from launching her YouTube channel to getting steps closer to the big initiative she has been hinting at so much. With James Aspey visiting Rachel in Aruba, it is no surprise that veganism has also been a topic on her mind. She discusses her family dynamic; how Rachel and Luna are vegan while Dennis is not – and how Dennis was admittedly worried about living with 4 vegans for more than a week (tune in to see how that worked out for him!). \r\nFrom smaller things like what we eat in a day to larger things like the complicated topic of cultural appropriation, Rachel touches on judgment and how the fear of being judged is often the first to surface when others view parts of our lives negatively. Moving from this space, she opens up about what she has learned, the changes she has made so far, and how making the yoga practice available for everyone is her number one priority.\r\nHow do you receive those challenging moments where your identity is questioned? How do you embrace change – is it towards the direction of more unity and inclusivity or is it further away? Tune in with Rachel as she discusses these topics with the goal of bringing this community together in a way that has never been done before.\r\nLearn more about your ad choices. Visit podcastchoices.com/adchoices",
            "length": "0",
            "sourceUrl": "https://traffic.megaphone.fm/DGT3207834615.mp3"
        },
        {
            "title": "How to Be a True Ally to Women of Color with Rachel Cargle",
            "datePublished": "Fri, 07 Sep 2018 07:03:00 -0000",
            "description": "In this episode, Rachel introduces her community to Rachel Cargle. A writer, speaker, and educator, Rachel Cargle’s work is centered around educating white women on how they can support women of color in genuine ways. Rachel Cargle begins this discussion by sharing how she began this journey of activism and how she didn’t have a choice as a black woman trying to exist in a world not built to support her. Oppositely, our host Rachel openly shares her ignorance and her fears as a white woman – how scared she was to have this conversation, to do something wrong, and to come across as racist. This sparks one of the most honest and deep conversations yet, on why it is so crucial for all of us to have this conversation – and why it is a privilege if you choose not to have it.\r\nOffering clear definitions and examples of tone policing, spiritual bypassing, white saviourism and exceptionalism, Rachel Cargle clearly shows how good intentions are not enough to erase our impact on society. The truest form of love is anchored in action.\r\nJoin the conversation, get uncomfortable, acknowledge your mistakes, question your past, and learn how to be a true ally to women of color. As a community we must do this work, allow ourselves to sit with discomfort and not remain quiet.\r\nLearn more about your ad choices. Visit podcastchoices.com/adchoices",
            "length": "0",
            "sourceUrl": "https://traffic.megaphone.fm/DGT9848726573.mp3"
        },
        {
            "title": "Cultural Appropriation with Susanna Barkataki ",
            "datePublished": "Fri, 31 Aug 2018 07:03:00 -0000",
            "description": "In this episode, Rachel invites Susanna Barkataki to discuss the topic of cultural appropriation. Susanna is a teacher, inclusivity promoter, yoga culture advocate and the author of the original article, “How to Decolonize Your Yoga Practice” that was widely circulated across social media over the past few weeks. The conversation begins with Susanna speaking on her personal history of experiencing racism and marginalization growing up in an Indian-British family in the UK and US. Using this as a starting point to discuss what has happened to yoga culture in the Western world, Rachel and Susanna then dive into a deep conversation on this topic. \r\nWhat is cultural appropriation? Where do we draw the line between cultural appreciation and appropriation? Rachel opens up to share her fears and past behaviours while Susanna offers true heartfelt advice on how westerners can continue practicing with deep respect for this ancient practice. Join Rachel and Susanna as they discuss these difficult but important questions and open the door for a shift in mindset to take place.\r\nLearn more about your ad choices. Visit podcastchoices.com/adchoices",
            "length": "0",
            "sourceUrl": "https://traffic.megaphone.fm/DGT2541015444.mp3"
        },
        {
            "title": "Life on Tour with Nathan Connelly",
            "datePublished": "Fri, 24 Aug 2018 07:03:00 -0000",
            "description": "In this episode, Rachel is joined by the talented, humble and down-to-earth guitarist from Snow Patrol, NathanConnolly. First discussing how they randomly ended up in LA together through the connection of a mutual friend, Nathan then dives into how the first show opening for Ed Sheeran went, and what life touring is like (hint: he needs it). From his beginnings singing in a gospel choir to joining Snow Patrol overnight when he was 20, Nathan talks through the history and dynamic of the band, what it felt like to gain recognition for your work, and the meaningfulness that comes when fans take your songs and make them their own. Admitting that he felt nervous talking personally about himself in the beginning of the show, Nathan didn’t let that stop him and Rachel from having a meaningful conversation on everything from brotherhood, living far away from your family, the fine line between being humble and apologetic, making music your life, mental health – and even whether or not he’s sick of the smash-hit “Chasing Cars” yet.\r\nLearn more about your ad choices. Visit podcastchoices.com/adchoices",
            "length": "0",
            "sourceUrl": "https://traffic.megaphone.fm/DGT8478761143.mp3"
        },
        {
            "title": "Here, Now with Seal",
            "datePublished": "Fri, 17 Aug 2018 07:03:00 -0000",
            "description": "In this episode Rachel is joined by none other than beloved international singer, Seal! True to the spirit of the From the Heart podcast, Seal begins the episode by giving a refreshingly honest answer to how he is feeling in his life now compared to a year ago. He shares how his perspective has changed from feeling helpless, victimized and isolated to feeling simply fantastic – and the incredible story that brought him there. After being forced to search for answers, Seal discusses the three major changes he recently made in his life, from how he lets go of control to his guidelines for connecting with other people. Offering beautiful wisdom and serious life advice – join Rachel and Seal as they discuss true happiness, the lessons they’ve learned from their children, finding your life purpose and everything in between.\r\nLearn more about your ad choices. Visit podcastchoices.com/adchoices",
            "length": "0",
            "sourceUrl": "https://traffic.megaphone.fm/DGT3743930930.mp3"
        },
        {
            "title": "Staying in Alignment - How To Bring Yourself Back To Balance",
            "datePublished": "Fri, 10 Aug 2018 07:03:00 -0000",
            "description": "What does alignment mean for you? What do you need to feel good? Recognizing what is truly important for you is the first step to living a life rooted in your own truth. \r\nRachel begins this episode speaking from the heart on how she has compromised her alignment over the previous weeks. Through being tired from working non-stop for too long and getting caught up in late-night Netflix episodes she lost her routine of getting up before sunrise. She speaks on the patterns of misalignment that have showed up throughout her life – and how she even compromised herself for social media(!).\r\n Comparing this to times in her life where she has felt 100% aligned, Rachel recognizes it is simple acts of self-care – simple things like waking up early, staying active, keeping your house in order – that bring the most peace to her life. With that, she speaks of the need for true rest, which does not take place in front of a television.\r\nLearn more about your ad choices. Visit podcastchoices.com/adchoices",
            "length": "0",
            "sourceUrl": "https://traffic.megaphone.fm/DGT4826083881.mp3"
        },
        {
            "title": "My Favorite Books on Yoga and Spirituality",
            "datePublished": "Fri, 03 Aug 2018 07:03:00 -0000",
            "description": "In this episode Rachel shares her all-time favorite books on Yoga and Spirituality. She dives into the words that came along with her on adventures, the stories that supported her, and the passages that changed her life. Books often represent so much more than the paper they are made out of. To Rachel, her books are sacred keepsakes that are filled with little notes, letters, and pictures that tell the story of what she was feeling as she held these books in her hand. \r\nDo you have books in your life that you return to again and again for many different reasons? From “The Power of Now” by Eckhart Tolle, “Be Here Now” by Ram Dass, Pema Chodron’s “When Thing’s Fall Apart: Heart Advice for Difficult Times” to Rasha’s “Oneness”, join Rachel as she shares the personal connection she has to her favorite books and stories from her own life inspired by each one.\r\nLearn more about your ad choices. Visit podcastchoices.com/adchoices",
            "length": "0",
            "sourceUrl": "https://traffic.megaphone.fm/DGT1603651518.mp3"
        },
        {
            "title": "The Inner Critic (part 2)",
            "datePublished": "Fri, 27 Jul 2018 07:03:00 -0000",
            "description": "In this episode Rachel continues sharing with the rest of her Yoga Teacher Training group on their Inner Critic. The group shares the judgmental, disapproving thoughts they harbour when that negative voice we all have in our heads is leading the way. Now hearing from 50 women from 15 different countries that have shared their most hurtful thoughts they carry about themselves, it becomes so evident that no matter where we come from or how old we are - we are all the same. Then turning toward the Inner Best Friend - the women share the voice that speaks to them with unconditional love and support. What does your inner critic say to you? What would life be like if we spoke to ourselves the way we speak to our best friends? Tune in for the final part of this emotional and vulnerable episode.\r\nLearn more about your ad choices. Visit podcastchoices.com/adchoices",
            "length": "0",
            "sourceUrl": "https://traffic.megaphone.fm/DGT3651628338.mp3"
        },
        {
            "title": "The Inner Critic (part 1)",
            "datePublished": "Fri, 20 Jul 2018 07:03:00 -0000",
            "description": "In this episode Rachel invites her Yoga Teacher Training group to join her in sharing a piece of what their inner critic - that judgmental, disapproving voice we all carry in the back of our heads - speaks of, and what life is like when we live from that place. 52 women from 15 different countries share from a place of deep vulnerability and then turn toward the Inner Best Friend - a voice that speaks with unconditional love and support. What would life be like if I spoke to myself the way I speak to the people I love? Tune in for a very different and heartfelt episode.\r\nLearn more about your ad choices. Visit podcastchoices.com/adchoices",
            "length": "0",
            "sourceUrl": "https://traffic.megaphone.fm/DGT3866284812.mp3"
        },
        {
            "title": "How To Improve Your Alignment and Find A Sustainable Yoga Practice with Lara Heimann",
            "datePublished": "Fri, 13 Jul 2018 07:03:00 -0000",
            "description": "In this episode Rachel is joined once again by yoga teacher, physiotherapist and anatomy genius Lara Heimann. Currently leading a yoga teacher training together, Rachel and Lara discuss everything from their best mothering tips to Lara’s sustainable home. Diving into a deep conversation on the role functional anatomy plays in a yoga practice, Lara breaks down simple poses like downward facing dog, plank, and chaturanga, and notes the common misconceptions people typically bring with them to class. With social media glorifying the overly bendy yogi, they discuss the need to move away from the idea that yoga is simply a pose. Instead, Lara expresses the need for us to be constant critical thinkers when moving in our body in order to protect ourselves from injury. We can find this sense of confidence in our practice by truly connecting to our core – the center of our bodies where all is integrated. It is through our core that we find our sense of courage and strength in ourselves, and ultimately our goals and purpose in life. \r\nLearn more about your ad choices. Visit podcastchoices.com/adchoices",
            "length": "0",
            "sourceUrl": "https://traffic.megaphone.fm/DGT5816170374.mp3"
        },
        {
            "title": "Moving Through Pain and Holding Space For Growth",
            "datePublished": "Fri, 06 Jul 2018 13:56:00 -0000",
            "description": "Rachel begins this episode by sharing the immense feeling of gratitude she has carried with her lately. Currently immersed in leading a yoga teacher training, she speaks of the deep bond of sisterhood that has been apparent since this new group stepped into the shala. Sensing an overall shift in the feminist movement, Rachel shares how inspiring it is to be surrounded by women that uplift and support one another. \r\nAs we all move along our journeys towards healing, it is crucial to have a community we can turn to that will listen to our struggles and give us tools to move through them. Only by working through the dark and defining moments from our past can we begin to create real change in the world. Rachel dives into the pivotal moments of her life that have shaped her, and how they changed throughout the years, as she was able to open up about them. She ends the episode with the single most defining moment of her life today – and how it is different from all the rest.\r\nLearn more about your ad choices. Visit podcastchoices.com/adchoices",
            "length": "0",
            "sourceUrl": "https://traffic.megaphone.fm/DGT3347406611.mp3"
        },
        {
            "title": "A Wedding Anniversary and Making Things Work with Dennis Schoneveld",
            "datePublished": "Fri, 29 Jun 2018 07:03:00 -0000",
            "description": "In this episode, Rachel is joined by her husband Dennis on their 4th wedding anniversary – after they both almost forgot it. They begin by diving into the intense Spring they had; traveling from country to country in Europe, with a toddler and a dog, while working towards a major business launch. Dennis touches on what traveling means to him after growing up on a tiny island. He also shares what it was like to be on his own with the baby, and his brave decision to travel across the Atlantic with her alone. \r\nGetting into questions from listeners, Rachel and Dennis discuss their favorite and least favorite things about one another, what Dennis thinks his life would be like if he never met Rachel, his previous girlfriends (even one that Rachel didn’t know about), and when they plan to have more kids.\r\nAs a married couple that are raising a baby and running a business together, Dennis and Rachel conclude by sharing how they compromise to make things work, routines that keep them together, and what’s important at the end of the day – like celebrating their anniversary.\r\nLearn more about your ad choices. Visit podcastchoices.com/adchoices",
            "length": "0",
            "sourceUrl": "https://traffic.megaphone.fm/DGT1650048011.mp3"
        },
        {
            "title": "Epiphanies, Self-Care and Being Alone ",
            "datePublished": "Fri, 22 Jun 2018 07:03:00 -0000",
            "description": "In this episode, Rachel speaks of her time away from her husband and baby girl and the epiphanies that accompanied her during this time alone. She recollects on her past, and how her childhood shaped her into a ‘fixer’ who always put other’s needs before her own. Now as a working mother, Rachel notices how her attention is pulled in thousands of directions, and still never on herself. After six days on her own, Rachel speaks of the shift she felt in her inner energy and how she reconnected to the grounded and calm person she is at her core. Diving further into this topic, she discusses the ways she can keep this feeling of space and translate it into her everyday life. She realizes that to be a better mother, wife, friend, boss, and more the best thing she can do is take care of herself first. \r\nWe all need to make sure our cup is full before we try to fill others. It is possible to use the resources we have to arrive to a place where prioritizing ourselves is natural. Recognizing this is the first step, then we can go squeeze our loved ones.\r\nLearn more about your ad choices. Visit podcastchoices.com/adchoices",
            "length": "0",
            "sourceUrl": "https://traffic.megaphone.fm/DGT5661498970.mp3"
        },
        {
            "title": "Project Alone Time",
            "datePublished": "Fri, 15 Jun 2018 07:03:00 -0000",
            "description": "In this episode, Rachel speaks on the importance of taking alone time to rejuvenate and practice self-care. With the demands of everyday life, taking time for ourselves can be challenging but is so necessary if we wish to offer our best selves to the world.\r\nRachel begins the episode by sharing the emotions that surfaced as she left her baby girl and husband back in Sweden and arrived to Aruba alone. She discusses what led her to travel home early and why leaving Lea Luna was especially challenging for her this time. Diving further into this topic, Rachel speaks of the guilt and shame she places on herself as a new mother and how we are often our own worst critics. With five days of alone time ahead of her, Rachel shares the fears she faced, what led her to a shift in mindset, and how she plans to fully embrace this opportunity to unwind, practice self-love, and focus on what she wants to do, guilt-free. She ends by sharing the first moments she spent grounding herself back home – the best destination of all.\r\nLearn more about your ad choices. Visit podcastchoices.com/adchoices",
            "length": "0",
            "sourceUrl": "https://traffic.megaphone.fm/DGT9053573669.mp3"
        },
        {
            "title": "Yoga with Usher and An Emergency Toolkit For Wellbeing ",
            "datePublished": "Fri, 08 Jun 2018 07:03:00 -0000",
            "description": "Learn more about your ad choices. Visit podcastchoices.com/adchoices",
            "length": "0",
            "sourceUrl": "https://traffic.megaphone.fm/DGT1602544033.mp3"
        },
        {
            "title": "Healing by Feeling",
            "datePublished": "Fri, 01 Jun 2018 07:03:00 -0000",
            "description": "In this episode Rachel discusses the need to release stored emotions and the challenges that arise within us (and later reflected in the state of all of humanity) when we don’t have space to open up and release what’s inside. \r\nBeginning with a guided 15-minute meditation to first find a place of silence before diving in, she moves on to sharing an experience she just had in Dynamic Meditation. Answering questions she often gets about this strange and somewhat wild way of meditating, she uses this opportunity to describe the Dynamic Meditation she often practices and also discuss the controversial figure Osho and his teachings.\r\nShe ventures into the important topic of letting anger and resentment go, and how already as children we are raised that such emotions are shameful. Everyone needs a safe space free of judgment to own their feelings! She gives helpful tips on how to release suppressed emotion, and why it’s important to do so every day. She concludes by coming back to a core principle in her life – that if we fix what’s on the inside, we can then fix what’s on the outside to create true change in the world.\r\nLearn more about your ad choices. Visit podcastchoices.com/adchoices",
            "length": "0",
            "sourceUrl": "https://traffic.megaphone.fm/DGT1401877808.mp3"
        },
        {
            "title": "Triggers and Teachings",
            "datePublished": "Fri, 25 May 2018 07:03:00 -0000",
            "description": "In this episode Rachel dives into the topic of using relationships and challenges for growth, finding ways to express your emotions no matter what society says and the beauty of letting your inner child come out to play. \r\nShe begins by discussing the different place she is in this week compared to last. From feeling ungrounded and stagnant, Rachel talks about diving back into work-mode and the new energy that came with it. By moving away from the idea of feeling busy and more into the idea of simply doing, Rachel mentions how stretching on the floor when playing with Lea Luna, or coming into a single child’s pose can be crucial for arriving back home. Diving further into this topic, Rachel talks about how we can all benefit from making yoga part of our every day, weaving practice into everything we do and using it as a tool to ground us again and again. She also talks about her style of parenting and how she deals with Lea Luna’s tantrums and how at the end of the day, a single deep breath can do wonders.\r\nLearn more about your ad choices. Visit podcastchoices.com/adchoices",
            "length": "0",
            "sourceUrl": "https://traffic.megaphone.fm/DGT7305658731.mp3"
        },
        {
            "title": "Wedding Wonders and Tough Travels",
            "datePublished": "Fri, 18 May 2018 07:03:00 -0000",
            "description": "In this episode Rachel talks about her latest European adventures at her best friend’s wedding in the South of France. Feeling like she was taking an intermission from life for the past couple of weeks, Rachel moved around at a high pace and speaks of a deep feeling of being uprooted. She discusses the changes she has seen lately, not only in her group of friends since her wedding four years ago, but in herself as well. Wondering whether this is a transitional feeling or a true personality change, Rachel delves into the reasons she feels so ungrounded – partly due to the difficulties she faced as a vegan in the South of France. She talks about the importance of feeling your feet on the ground, moving the body and nourishing ourselves with good food. Diving further into the topic of veganism, Rachel shares her tips for vegans when traveling, how her own advice didn’t work at all on this particular trip, and the lessons she learned for next time.\r\nLearn more about your ad choices. Visit podcastchoices.com/adchoices",
            "length": "0",
            "sourceUrl": "https://traffic.megaphone.fm/DGT8839047636.mp3"
        },
        {
            "title": "Powering Through and Mellowing Out",
            "datePublished": "Fri, 11 May 2018 07:03:00 -0000",
            "description": "In this episode Rachel reflects on her latest weekend trip to LA to teach a yoga class at a fitness festival. She talks about the different mindset she had being separated from her baby girl compared to previous solo trips, and how this allowed her to turn on the fiery side of her personality so she could tackle an intense weekend with a strict run of show. She shares how staying in the here and now reminded her why she travels to teach yoga for a living – to have fun and connect with her community. Rachel then dives into discussing the flight home, how exhausted she was, and how she lost connection to the here and now. Realizing that her softer side emerged just as she was reuniting with her husband and baby girl, Rachel comes to an epiphany that everything happens in perfect timing.\r\nLearn more about your ad choices. Visit podcastchoices.com/adchoices",
            "length": "0",
            "sourceUrl": "https://traffic.megaphone.fm/DGT2718462155.mp3"
        },
        {
            "title": "On The Road Again",
            "datePublished": "Fri, 04 May 2018 07:03:00 -0000",
            "description": "In this episode Rachel is joined by her husband Dennis while traveling through south of France. They talk about their adventures through Europe and their differences in terms of the kind of traveling they enjoy. Dennis shares what it’s like seeing the world from the eyes of a someone who grew up on a tiny island and Rachel shares how she has changed as a traveler since becoming a mom. They share their favorite parts of the journey so far, challenges that keep coming up and also talk about where in the world they see themselves raising their baby girl. \r\nLearn more about your ad choices. Visit podcastchoices.com/adchoices",
            "length": "0",
            "sourceUrl": "https://traffic.megaphone.fm/DGT5176707604.mp3"
        },
        {
            "title": "Mind, Body and Stories About Pain",
            "datePublished": "Fri, 27 Apr 2018 07:03:00 -0000",
            "description": "In this episode Rachel shares her experience with training with a Naprapath for 8 straight days and learning new, unconventional ways of moving her body. She talks about how she has built a story around her back pain and an old injury and the epiphany that the story around the pain actually may have led her to more of the same. She shares some of the out-of-the-box exercises she has done over the past week, ignoring everything she has learned about yogic alignment, moving out of her comfort zone and leaving the idea of comfort far, far behind. \r\nLearn more about your ad choices. Visit podcastchoices.com/adchoices",
            "length": "0",
            "sourceUrl": "https://traffic.megaphone.fm/DGT4490820686.mp3"
        },
        {
            "title": "Stress, Anxiety and Accepting The Present Moment",
            "datePublished": "Fri, 20 Apr 2018 07:03:00 -0000",
            "description": "How can we practice being present in the here and now when the moment we are in is particularly challenging? In today’s episode Rachel talks about her latest travels to Europe and how parents should receive awards at the end of long travels with babies. She shares everything that went wrong and how, even with the best intentions, she lost her cool and spent almost two whole days overwhelmed with stress and anxiety. She talks about the power of making peace with the moment and how accepting the here and now can completely transform your life.\r\nLearn more about your ad choices. Visit podcastchoices.com/adchoices",
            "length": "0",
            "sourceUrl": "https://traffic.megaphone.fm/DGT9429093514.mp3"
        },
        {
            "title": "Movement as Medicine with Lara Heimann",
            "datePublished": "Fri, 13 Apr 2018 07:03:00 -0000",
            "description": "In this episode Rachel is joined by Lara Heimann, physical therapist and anatomy genius. They talk about the dreaded P-word (P-A-I-N) and Lara gives great advice on how to deal with physical discomfort long term. They talk about the dreaded text-neck that’s impacting young adults all across the globe and what remedies to take to avoid it (listen carefully because this applies to us all!). They also discuss my official release, how to stay well-aligned and injury free working a desk job, and the key to a healthy life: movement as medicine.\r\nLearn more about your ad choices. Visit podcastchoices.com/adchoices",
            "length": "0",
            "sourceUrl": "https://traffic.megaphone.fm/DGT6286101111.mp3"
        },
        {
            "title": "Serenity, Now",
            "datePublished": "Fri, 06 Apr 2018 07:03:00 -0000",
            "description": "In this episode Rachel is experiencing a few days of serious pain and tells the story of her latest project on her path toward peace: a bathtub. After being given the advice to soak in water as a practice of self-care, she sets out to install a bathtub in her house and what was supposed to be a 2-day project suddenly took on a life of it’s own and became 3 weeks of construction and, of course, disturbance. She shares the realization of how being on the path toward peace can often keep us on the path and never let us arrive at the destination. Oftentimes when we think of relaxation and serenity we have a list of boxes to tick off to get there; we meditate, practice yoga, switch our phones off, read a book, brew a cup of tea, drink a glass of wine, draw a bath… When what was supposed to become a new practice of self-care instead became another element of stress, Rachel realized that she can indeed spend every evening soaking in a bathtub, candles lit, but that peace still won’t be guaranteed. Are these elements necessary? Or is there a way to make peace with what is here, now; whether we are in pain or at ease? Listen in to hear more.\r\nLearn more about your ad choices. Visit podcastchoices.com/adchoices",
            "length": "0",
            "sourceUrl": "https://traffic.megaphone.fm/DGT8396601172.mp3"
        },
        {
            "title": "From Suicide to Sobriety",
            "datePublished": "Fri, 30 Mar 2018 07:03:00 -0000",
            "description": "In this episode Rachel is joined by her mother! They talk about Rachel’s life growing up and Rachel shares their family constellation including every marriage and divorce and all the step dads, step moms, step siblings and half siblings… It’s pretty much the most complicated family history of all time! Her mom tells her life story and the struggles she went through in her childhood leading to her moving out to live on her own at a very young age, losing her father to cancer and her struggle with bulimia and alcoholism that followed. She also talks openly about her suicide attempts and how after her last near-death experience she lost everything, including her children, and how the darkness that followed was actually the beginning of a whole new life. They also talk about the 12 steps, sobriety, finding a way out of depression and using service as a way to heal your heart.\r\nLearn more about your ad choices. Visit podcastchoices.com/adchoices",
            "length": "0",
            "sourceUrl": "https://traffic.megaphone.fm/DGT9416829191.mp3"
        },
        {
            "title": "52 Weeks of Speaking From The Heart",
            "datePublished": "Fri, 23 Mar 2018 07:03:00 -0000",
            "description": "This episode marks the 1-year anniversary of the podcast and Rachel celebrates 52 weeks of storytelling, epiphanies, tears and so much laughter. She shares how in a way, podcasting has become part of her personal development and allows her to in an honest way process her emotions every week... Sort of like therapy! She gives her gratitude to the community for listening and holding space and also shares her biggest inspirations and favorite spiritual teachers.\r\nLearn more about your ad choices. Visit podcastchoices.com/adchoices",
            "length": "0",
            "sourceUrl": "https://traffic.megaphone.fm/DGT9164096180.mp3"
        },
        {
            "title": "Gratitude, Cloning and Turning a Bad Day Around",
            "datePublished": "Fri, 16 Mar 2018 07:03:00 -0000",
            "description": "In this episode Rachel shares the love she feels for her dog and how the fear of losing him drove her to doing some very (very, very) irrational things (including the craziest story you’ve ever heard). She talks about deep soul connection with another being, fear of loss, the issue with “perfection” and how allowing yourself to be human brings the biggest relief. She also shares a recent experience with a bad moment and how it you’re not careful, it can snowball into a bad day and how at the end of it all, gratitude is the most important practice. \r\nLearn more about your ad choices. Visit podcastchoices.com/adchoices",
            "length": "0",
            "sourceUrl": "https://traffic.megaphone.fm/DGT1283413552.mp3"
        },
        {
            "title": "A Perfect Storm",
            "datePublished": "Fri, 09 Mar 2018 08:03:00 -0000",
            "description": "In this weeks podcast Rachel talks about how she deals with social media drama and how more than anything, its a reflection of our inner world and can be a great lesson in sitting with your emotions. She talks about her deep longing of being of service and how it has evolved from moving snails across the road when she was a little girl to launching non-profit initiatives today, and shares a recent experience with online drama. When it comes to doing good, people will always judge and voice their own opinions! The question is how to learn from each other and remember the true intention behind your actions. She walks us though the ins-and-outs of her new social media marketing initiative and opens up about making mistakes, being humans and how at the end of the day, we are all doing the best we can.\r\nLearn more about your ad choices. Visit podcastchoices.com/adchoices",
            "length": "0",
            "sourceUrl": "https://traffic.megaphone.fm/DGT3949728544.mp3"
        },
        {
            "title": "Astrology - The Art of Aligning with Your Life’s Purpose with Debra Silverman",
            "datePublished": "Fri, 02 Mar 2018 08:03:00 -0000",
            "description": "How does the full moon affect us? What does Mercury in Retrograde mean? Does each person really have a destiny? In this weeks episode Rachel is joined by Debra Silverman; psychologist and astrologer with over 40 years in the field. Debra has dedicated her life to helping people heal emotional wounds by aligning with their life’s purpose (she works with Madonna, Sting, Trevor Hall and many more - this woman is literally an astrologer of the stars... To the stars!). Rachel and Debra start off by talking about the skepticism around astrology and the ancient science that lies at the core of the practice. Debra explains how deepening your connection to the stars and the planets can help change your life, and how understanding your chart can make so much fall into place. Rachel shares her own recent experience with astrology and how suddenly, so much is making complete sense in her life. They also talk about the different aspects of an astrological chart, using astrology to support your relationship, manifesting abundance and how we are all responsible to bring more light into the world.\r\nLearn more about your ad choices. Visit podcastchoices.com/adchoices",
            "length": "0",
            "sourceUrl": "https://traffic.megaphone.fm/DGT2637823577.mp3"
        },
        {
            "title": "Life After Death and Healing Emotional Pain ",
            "datePublished": "Fri, 23 Feb 2018 08:03:00 -0000",
            "description": "In this weeks episode Rachel talks about her experience with death and loss. After losing her best friend, her grandmother and her dog within the span of just a few months, her entire life was turned upside down. In this episode she shares little pieces of her experience and talks about emotional healing and how it’s not a linear process. She shares her experience writing her second book - on the topic of grief and death - and how it’s bringing to surface a pain she has been running from for a long time. She also talks about growing up with a suicidal mother and how always waiting for the other shoe to drop is causing a lot of fear and pain to show up in her own experience of motherhood. \r\nLearn more about your ad choices. Visit podcastchoices.com/adchoices",
            "length": "0",
            "sourceUrl": "https://traffic.megaphone.fm/DGT1142360266.mp3"
        },
        {
            "title": "Social Media Marketing and Making Money With a Purpose",
            "datePublished": "Fri, 16 Feb 2018 08:03:00 -0000",
            "description": "In this episode Rachel gets into the topic of social media marketing, ads and staying authentic in how you portray yourself in social media. She talks about her frustration with big corporations that take advantage of the yoga community to make big bucks and shares her own decision to never use her Instagram platform for marketing (and why that might be changing in the near future!). She also talks about the importance of making money to change the world, what being true in the online world actually means and how being real and vulnerable is the single most important thing when it comes to truly inspiring others.  Show sponsor links Third Love - www.ThirdLove.com/Heart Take Care Of - www.takecareof.com (Promo code: Heart) Goop - www.Goop.com/yogagirl\r\nLearn more about your ad choices. Visit podcastchoices.com/adchoices",
            "length": "0",
            "sourceUrl": "https://traffic.megaphone.fm/DGT8677576236.mp3"
        },
        {
            "title": "Sex, Sarcasm and The Meaning of Consent with Dennis Schoneveld",
            "datePublished": "Fri, 09 Feb 2018 08:03:00 -0000",
            "description": "In this episode Rachel is joined by her husband Dennis (who’s getting more candid and slightly more inappropriate for every episode!). They start off talking about a recent disagreemenGt they had and how they process things completely differently when they fight. They then dive into the sensitive topic of the #MeToo movement - Dennis shares some stories from his past and they discuss the true meaning of consent and then Dennis tells the hilarious story of their first night together (what!!). Taking questions from social media they also get into the topic of jealousy, exes, their hectic schedule and how they stay balanced in their relationship (hint: it requires having a good sense of humor). Show sponsor links Havenly - www.havenly.com/yogagirl Four Sigmatic - www.foursigmatic.com/yogagirl Daily Harvest - www.daily-harvest.com (Promo code YogaGirl) Quip - www.getquip.com/yogagirl \r\nLearn more about your ad choices. Visit podcastchoices.com/adchoices",
            "length": "0",
            "sourceUrl": "https://traffic.megaphone.fm/DGT3504500663.mp3"
        },
        {
            "title": "Competition and Jealousy - The Business of Yoga",
            "datePublished": "Fri, 02 Feb 2018 08:03:00 -0000",
            "description": "In this episode Rachel dives into the very sensitive subject of competition, jealousy and cattiness in the world of yoga and business. She shares her own stories of being on both sides of the spectrum - both having felt nervous about other teachers competing with her and having had other teachers create drama over competition. She shares specific stories from different times in her life as a yoga teacher and entrepreneur and candidly shares both the challenge and the learning of each situation. Operating out of lack will always make us feel like we don’t have enough and this is where most sense of competition and jealousy stems from - the fear of not being able to provide for ourselves. But what if we operate out of abundance and out of knowing that we are cared for? This sets us up for success in a completely different way! Tune in to learn some big life lessons on how to grow your business and stay anchored in passion and love for the work you do in the world.\r\nLearn more about your ad choices. Visit podcastchoices.com/adchoices",
            "length": "0",
            "sourceUrl": "https://traffic.megaphone.fm/DGT8199648913.mp3"
        },
        {
            "title": "Believe In The Good Things Coming with Nahko Bear",
            "datePublished": "Fri, 26 Jan 2018 08:03:00 -0000",
            "description": "In this episode Rachel is joined by her friend (and favorite musician!) Nahko Bear. Rachel shares the story of how she first connected to Nahko’s music and how it helped her move through the grief of her best friend’s passing, and Nahko shares what it’s like to write music that deeply impacts people all over the world. They talk about the importance of spiritual discipline and trusting that life brings you where you’re supposed to go (especially when things get really, really hard) and Nahko shares some of the hardships he is working through at the moment. They also talk about the blessings and challenges that come along with being leaders in their respective communities, the importance of activism and standing up for what you believe in and how at the end of the day, the way we care for Mother Earth is a true reflection of how we care for ourselves.\r\nLearn more about your ad choices. Visit podcastchoices.com/adchoices",
            "length": "0",
            "sourceUrl": "https://traffic.megaphone.fm/DGT6457699965.mp3"
        },
        {
            "title": "Magic Happens Where Your Comfort Zone Ends with Chris Burkard",
            "datePublished": "Fri, 19 Jan 2018 08:03:00 -0000",
            "description": "In this episode Rachel is joined by Chris Burkard: photographer, explorer, creative director, author and speaker. Chris has gained worldwide recognition for his photography and art over the past few years and is especially known for his travels to remote places and extreme weather surf photography. How do you turn your passion into your career? What’s it like balancing creative talent with running a large-scale business? Chris shares how he got started (and how, when it comes to pursuing a dream, we all have to start at the bottom!), what inspires him as a photographer and stories from his life on the road. They talk about nature conservation, bringing deep purpose into your work, parenthood and using past mistakes as a way to grow. Chris also gives his best tips for staying grounded on the road.\r\nLearn more about your ad choices. Visit podcastchoices.com/adchoices",
            "length": "0",
            "sourceUrl": "https://traffic.megaphone.fm/DGT8045708695.mp3"
        },
        {
            "title": "From Resentment to Kindness (with a Fever of 103)",
            "datePublished": "Fri, 12 Jan 2018 08:03:00 -0000",
            "description": "In this episode Rachel’s talks about anger and resentment. When we feel wronged or hurt, instead of lashing out, is there a way we can use challenging situations as a way to grow? As something she’s personally dedicated to working on in 2018 Rachel gets candid and honest about her personal anger issues and how harboring resentment holds her back in relationships. While struggling through her baby girls first bout of sickness she finds herself feeling fearful and sleep deprived, eventually leading to anger and feeling resentment toward a close friend. Acknowledging your anger is important - it’s when we cling to it and it becomes resentment that it starts tripping us up! Realizing that resentment takes us away from kindness and compassion and separates us from finding a solution to the problem is the first step to letting it go. \r\nLearn more about your ad choices. Visit podcastchoices.com/adchoices",
            "length": "0",
            "sourceUrl": "https://traffic.megaphone.fm/DGT2951182289.mp3"
        },
        {
            "title": "Turning Dreams Into Reality",
            "datePublished": "Fri, 05 Jan 2018 08:03:00 -0000",
            "description": "In this episode rachel records live on Instagram with thousands of people tuning in! Over 100,000 people tuned in to listen and ask questions. Rachel starts off by sharing how she went out dancing with her little sister the night before and for the first time since pre-pregnancy woke up feeling the effects of a night on the town. Her conclusion? No amount of fun is worth it when you’re spending the next day with your baby! After sharing candidly about beating herself up and feeling like an irresponsible mom she dives into answering questions from the audience on manifesting dreams, dealing with anxiety and fear, getting energized to continue pursuing your goals on days where all you want to do is lie on the couch, nailing down an awesome business idea, letting go of resentment, staying motivated to make a change in the world while feeling weighed down by pain and much, much more.  \r\nLearn more about your ad choices. Visit podcastchoices.com/adchoices",
            "length": "0",
            "sourceUrl": "https://traffic.megaphone.fm/DGT9923353658.mp3"
        },
        {
            "title": "Setting Intentions and Manifesting Love",
            "datePublished": "Fri, 29 Dec 2017 08:03:00 -0000",
            "description": "In this episode Rachel shares her intentions for 2018 and invites her listeners to join in. Setting intentions for the new year is a deeply spiritual practice and to find out what we want to manifest we need to begin by looking at what we have struggled with during the year that’s passed! Rachel talks about how the idea of losing weight, starting a new exercise regimen and changing who we are is always doomed to fail and that to find long-lasting balance we need to look at what lies beneath wanting to change who we are. She opens up about her own resolutions and challenges; how can you learn to slow down when it’s in your nature to move? How do you ask for help when you’re used to doing everything yourself? How can we make space for healing in a world that constantly demands us to perform and be perfect? Join Rachel as she shares her best tips on how to set loving intentions and create ceremony to ring in the new year from the heart. \r\nLearn more about your ad choices. Visit podcastchoices.com/adchoices",
            "length": "0",
            "sourceUrl": "https://traffic.megaphone.fm/DGT7766319951.mp3"
        },
        {
            "title": "The Inappropriate Husband with Dennis Schoneveld",
            "datePublished": "Fri, 22 Dec 2017 08:03:00 -0000",
            "description": "In this episode Rachel is joined by her husband Dennis for what might just be the most hilarious (and politically incorrect) episode ever. They have a conversation thats both relaxed, heated and slightly inappropriate at times about everything from meat eating vs veganism, living a privileged life, the challenges of running a yoga studio, parenthood and what it’s like to spend literally every hour of the day together. Dennis shares what he loves most about Rachel (hint: we should have edited some stuff out but didn’t), gives his best advice for finding your way in life and how at the end of the day, its all about gratitude.\r\nLearn more about your ad choices. Visit podcastchoices.com/adchoices",
            "length": "0",
            "sourceUrl": "https://traffic.megaphone.fm/DGT8527953258.mp3"
        },
        {
            "title": "Family Business (and A Little Bit of Politics)",
            "datePublished": "Fri, 15 Dec 2017 08:03:00 -0000",
            "description": "In this episode Rachel shares the story of how she left her baby for the first time ever to travel to Los Angeles for a photoshoot and how, inevitably, chaos ensued. From having an incredibly difficult time leaving Aruba in the first place to arriving to find LA on fire (literally!) she spent the weekend arguing with her brother about politics, fighting with her husband about how to care for the baby, going head to head with the airlines about getting home on time and even found herself in a confrontation with a complete stranger about how her friend was raising her toddler. A whirlwind of a weekend, indeed! She talks about how to bridge the gap with our family members when we can’t see eye-to-eye (is it possible?), letting go of control, facing your fears at your own pace and how, sometimes, all you need is a really good cry.\r\nLearn more about your ad choices. Visit podcastchoices.com/adchoices",
            "length": "0",
            "sourceUrl": "https://traffic.megaphone.fm/DGT3584362484.mp3"
        },
        {
            "title": "Best Friends Forever - with Olivia Rothschild!",
            "datePublished": "Fri, 08 Dec 2017 08:03:00 -0000",
            "description": "In this episode Rachel’s best friend takes over as host of the show to interview Rachel! They start off talking about Rachel’s fears about leaving her baby for the first time and Olivia asks some very serious questions Rachel normally does not answer (like, “when was the first time you ever farted in front of Dennis?”) and they then venture toward more serious subjects (...like pooping during childbirth). After getting the many questions about bodily functions out of the way they dive into the stories from their high school days, what it’s like having husbands that are BFF’s and the very important subject of #MeToo - what’s next? They talk about how we can raise vulnerable boys and empowered girls while continuing to smash the patriarchy and strive for equality in the most loving way possible. They also talk about how to find your true passion in life and stay on course even when life throws you challenges.\r\nLearn more about your ad choices. Visit podcastchoices.com/adchoices",
            "length": "0",
            "sourceUrl": "https://traffic.megaphone.fm/DGT6298945899.mp3"
        },
        {
            "title": "#MeToo ",
            "datePublished": "Fri, 01 Dec 2017 08:03:00 -0000",
            "description": "In this weeks episode Rachel joins the #MeToo movement and shares her own stories of sexual harassment and abuse. She journeys back to the first moment she every felt objectified as a young girl and retells a few experiences with varying degrees of intensity where she felt violated, taken advantage of or abused. She also dives into the challenging topic of victim blaming and how speaking up and shedding light on our experiences can lead toward empowerment.\r\nLearn more about your ad choices. Visit podcastchoices.com/adchoices",
            "length": "0",
            "sourceUrl": "https://traffic.megaphone.fm/DGT8392596002.mp3"
        },
        {
            "title": "Relatable Feminism, Anti-Bullying and Loving Yourself No Matter What with Violet Benson",
            "datePublished": "Fri, 24 Nov 2017 08:03:00 -0000",
            "description": "In this episode Rachel is joined by comedian and social media superstar Violet Benson, also known as Daddy Issues! Violet rose to stardom through her wildly popular meme account @daddyissues_ on Instagram where she highlights relatable and controversial topics through the eyes of the millennial woman. They talk about how Violet’s struggles with being bullied and having low self-esteem led her to create the social media alter ego that completely changed her life and Rachel shares her own experiences with not fitting in as a young teen. They dive into the topic of feminism, gender inequality in the comedy world, using online influence to make people smile and how in the end, we should all just be a little bit kinder to each other (especially on the internet!). \r\nLearn more about your ad choices. Visit podcastchoices.com/adchoices",
            "length": "0",
            "sourceUrl": "https://traffic.megaphone.fm/DGT1868269523.mp3"
        },
        {
            "title": "Are We What We Eat? with Ella Mills",
            "datePublished": "Fri, 17 Nov 2017 08:03:00 -0000",
            "description": "In this episode Rachel is joined by Ella Mills; creator of the insanely popular food blog Deliciously Ella. Ella healed herself from a devastating disease through plant based food and a healthy lifestyle and has since dedicated her life to inspiring the world through the art of cooking. They talk about how our eating habits affect our lives, the emotional connection we hold to the diet we were raised with, adding broccoli to your pepperoni pizza and how when it comes to making good choices for your body, learning by doing is the best way! Ella shares how she went from never giving food much thought to vibrantly glowing with health, and how she turned what was a small personal blog into a hugely successful business with 70+ employees. They also talk about the difficult side of social media, what it’s like to have millions of people following your every move and much more. \r\nLearn more about your ad choices. Visit podcastchoices.com/adchoices",
            "length": "0",
            "sourceUrl": "https://traffic.megaphone.fm/DGT3308176147.mp3"
        },
        {
            "title": "Healing Physical Pain, Finding Your Core and Movement As a Spiritual Practice with Lara Heimann",
            "datePublished": "Fri, 10 Nov 2017 08:03:00 -0000",
            "description": "In this episode Rachel is joined by Lara Heimann; physical therapist, master yoga teacher and anatomy genius. They talk about one thing and one thing only: THE BODY. Your body is a miracle! Yet we rarely treat it as such. In this episode you get to learn some of the many misaligned cues taught by yoga teachers all over the world and why the overly flexible yoga body, though so celebrated within the yoga community, is actually inching its way closer to injury with every downward dog. Lara shares stories of working with patients with severe neurological injuries and how her MB in physical therapy helped shape a brand new form of yoga. Rachel shares her own history of jumping from teacher to teacher and, through practicing intensely, having ended up with injury or pain more than a few times in her life. They talk about movement as a deeply spiritual practice, how to form the essential habit of practicing yoga (mindfully!) every day and how to heal yoga-related pain in the lower back, shoulders and neck. They also dive into the topic of how tapping into your core can completely change your life (and how it has absolutely nothing to do with a six-pack!). \r\nLearn more about your ad choices. Visit podcastchoices.com/adchoices",
            "length": "0",
            "sourceUrl": "https://traffic.megaphone.fm/DGT7597431567.mp3"
        },
        {
            "title": "Self-Love, Fear of Dying, Rose Quartz Spheres and a Crappy Day",
            "datePublished": "Fri, 03 Nov 2017 07:03:00 -0000",
            "description": "In this episode Rachel gets real and emotional about her hardships in the midst of a particularly crappy day. She talks about her contrasting struggle with low self esteem and the huge fear she carries around the wellbeing of her daughter while simultaneously feeling content and happy in leading her first teacher training. She dives into the topic of teaching yoga the \"right\" way, what it means to find your true voice as a teacher, cursing in class and how fear can push us into arguments with our loved ones. She also talks about the inner critic; that judgmental voice we all have at the back of the head telling us we're not good enough, and how to counter it by showing up with self compassion.  \r\nLearn more about your ad choices. Visit podcastchoices.com/adchoices",
            "length": "0",
            "sourceUrl": "https://traffic.megaphone.fm/DGT9813823490.mp3"
        },
        {
            "title": "Walking Through Fire, Letting The Other Shoe Drop and Telling Your Story with Glennon Doyle",
            "datePublished": "Fri, 27 Oct 2017 07:03:00 -0000",
            "description": "In this episode Rachel is joined by Glennon Doyle; #1 NYT Best-Selling author, activist, philanthropist and founder of Momastery; an online platform that changes the lives of millions through storytelling. Glennon shares the story of how she found the love of her life in soccer player Abby Wambach immediately following the release of her #1 New York Times Bestseller Love Warrior (a tale of marriage redemption!) and the value of being truthful - even when it's inconvenient. They talk about the importance of allowing your children to feel everything life has in store for them (even when it's painful), building resilience through struggle, recovering from addiction and letting the other shoe drop. Glennon gives some beautiful advice on how to heal through story telling and how when shit hits the fan and you've found yourself in a pit of dispair, rather than trying to climb your way up sometimes the best thing to do is simply to sit down.\r\nLearn more about your ad choices. Visit podcastchoices.com/adchoices",
            "length": "0",
            "sourceUrl": "https://traffic.megaphone.fm/DGT5857585574.mp3"
        },
        {
            "title": "Peace, Love and Veganism with James Aspey",
            "datePublished": "Fri, 20 Oct 2017 07:03:00 -0000",
            "description": "In this episode Rachel is joined by James Aspey; vegan, animal rights activist and public speaker. James replaced drugs, cancer and bulimia with veganism, surfing and meditation and his story is an incredible inspiration to people across the globe. After being diagnosed with Leukemia which led him into drug addiction he changed his life drastically and started a journey in search of health and happiness. Through becoming vegan and experiencing first-hand the amazing ways it improved his life (and what it does for the planet!) he has since dedicated his life's work to spreading the message of loving kindness, peace and veganism. In this episode Rachel shares her struggle with having transitioned away from being vegan and how it's affected her life and together they dive into the topic of veganism, health, animals and what it means to live a life that aligns with loving kindness. \r\nLearn more about your ad choices. Visit podcastchoices.com/adchoices",
            "length": "0",
            "sourceUrl": "https://traffic.megaphone.fm/DGT7060612557.mp3"
        },
        {
            "title": "The Sleep Episode",
            "datePublished": "Fri, 13 Oct 2017 07:03:00 -0000",
            "description": "Sleep is a spiritual practice and without it, we cannot function (there is a reason sleep deprivation is used as a form or torture)! In this episode Rachel shares how she got her baby girl to sleep through the night - almost! After struggling with intense sleep deprivation for two months she decided to take charge and has since read eight books, had two sleep consultations, asked the world for advice through social media and googled her way to things that actually WORK. In this podcast episode she lists all the things she applied to help set healthy sleep habits for her daughter and how, finally, they are sleeping soundly. \r\nLearn more about your ad choices. Visit podcastchoices.com/adchoices",
            "length": "0",
            "sourceUrl": "https://traffic.megaphone.fm/DGT5345838435.mp3"
        },
        {
            "title": "Becoming Yoga Girl",
            "datePublished": "Fri, 06 Oct 2017 07:03:00 -0000",
            "description": "In this episode Rachel shares the story of how Yoga Girl came into existence! She talks about how her Instagram account came to be and recalls the first time anyone every recognized her from social media (not as much fun as you might think!). She tells the hilarious story of how she taught her first-ever yoga class abroad (it involves a Chipotle burrito and almost vomiting out of nervousness) after cold-calling studios and begging them to let her teach, and how that was the spark that launched her journey as an international yoga instructor. She shares what it’s been like to grow from teaching in small yoga studios to huge stadiums and concert halls, dealing with judgement from other teachers and finally harnessing her own power and allowing herself to truly shine.\r\nLearn more about your ad choices. Visit podcastchoices.com/adchoices",
            "length": "0",
            "sourceUrl": "https://traffic.megaphone.fm/DGT1698273182.mp3"
        },
        {
            "title": "The Spiritual Practice of Making Music with Trevor Hall",
            "datePublished": "Fri, 29 Sep 2017 07:03:00 -0000",
            "description": "In this episode Rachel is joined by singer-songwriter Trevor Hall! Trevor shares his life story and get ready because this one comes with a TON of wisdom. He shares how a deeply rooted passion for music launched him into a successful career as an artist without ever actually setting out to become famous in the traditional sense of the word. They talk about the struggles he had to overcome to arrive at a place of living his truth, keeping up a spiritual practice while living on the road and redefining the meaning of success and abundance. Trevor shares how being dropped from a major label turned out to be his biggest blessing and what it's like being the yoga worlds favorite musician! They also talk about how to find your purpose in life, music as a true spiritual practice and Trevor shares how some very challenging health issues helped birth a brand new album.\r\nLearn more about your ad choices. Visit podcastchoices.com/adchoices",
            "length": "0",
            "sourceUrl": "https://traffic.megaphone.fm/DGT2479516712.mp3"
        },
        {
            "title": "The Flight From Hell",
            "datePublished": "Fri, 22 Sep 2017 07:03:00 -0000",
            "description": "In this episode Rachel tells the hilarious story of how she flew from Stockholm to Aruba last week and how everything that could have gone wrong did (at the same time!). Prepare for some very disgusting but crazy funny storytelling! She also talks a little bit about anger and transforming it through comic relief. \r\nLearn more about your ad choices. Visit podcastchoices.com/adchoices",
            "length": "0",
            "sourceUrl": "https://traffic.megaphone.fm/DGT1105516988.mp3"
        },
        {
            "title": "The Challenges of Parenthood, Being a Stay-At-Home Dad and Becoming Iron Man with Dennis Schoneveld",
            "datePublished": "Fri, 15 Sep 2017 07:03:00 -0000",
            "description": "In this episode Rachel is joined by her husband Dennis and together they dive in to an honest reflection of their challenges as new parents. They talk about their recent fights over Dennis training for an Iron Man race, not having any alone time, masculine vs feminine roles and being a \"modern family\" with Dennis as a stay-at-home dad and Rachel as a working mom. They also touch on subjects like gender equality, feminism and learning how to make space for your own needs while co-creating partnership.\r\nLearn more about your ad choices. Visit podcastchoices.com/adchoices",
            "length": "0",
            "sourceUrl": "https://traffic.megaphone.fm/DGT6628361122.mp3"
        },
        {
            "title": "Becoming a Force of Good In The World By Feeling Your Feelings and Choosing Your Community With Care",
            "datePublished": "Fri, 08 Sep 2017 07:03:00 -0000",
            "description": "In this episode Rachel talks about the magnificent power of taking charge of your emotional well being. When we feel whole and safe, we are able to harness that energy and take charge to make a difference in the world - in our own way. YOU have the power to change the world. You do! She talks about the challenge of staying away from gossip and drama and gives examples on how to continuously bring love into situations that try to pull us toward negativity and judgement. Rachel also dives into the topic of making vulnerability the new \"normal\", not letting frustration build up and stagnate and the positive cycle of choosing to show up with love - every single day. \r\nLearn more about your ad choices. Visit podcastchoices.com/adchoices",
            "length": "0",
            "sourceUrl": "https://traffic.megaphone.fm/DGT5212479982.mp3"
        },
        {
            "title": "Just a Mom - Sleep Deprivation and Other Stories ",
            "datePublished": "Fri, 01 Sep 2017 07:03:00 -0000",
            "description": "In this episode Rachel gets real about her in-the-moment struggles: dealing with some serious sleep deprivation. She talks about her greatest challenges as a mother, being sensitive about comments she's getting on Instagram, feeling overall crappy and the realization that she wants to be more than \"just a mom\".  \r\nLearn more about your ad choices. Visit podcastchoices.com/adchoices",
            "length": "0",
            "sourceUrl": "https://traffic.megaphone.fm/DGT1162967356.mp3"
        },
        {
            "title": "A Story of Rape and Responsibility with Thordis Elva",
            "datePublished": "Fri, 25 Aug 2017 07:03:00 -0000",
            "description": "In this episode Rachel is joined by Thordis Elva; writer, journalist, public speaker and crusader for women’s rights. Thordis shares the powerful and painful story of how she was raped by her boyfriend at only 16 years old, the downward spiral it sent her on and how she was able to eventually find healing by confronting her perpetrator (who she ended up writing a book with!). They talk about the widespread issue of rape and sexual abuse and how the blame is often places on the survivor instead of on the victim and most importantly: what we can do to change the conversation. Thordis also shares some beautiful advice and support for survivors listening in.\r\nLearn more about your ad choices. Visit podcastchoices.com/adchoices",
            "length": "0",
            "sourceUrl": "https://traffic.megaphone.fm/DGT7764179726.mp3"
        },
        {
            "title": "Body Positivity and Finding Self-Love In a World of Non-Acceptance",
            "datePublished": "Fri, 18 Aug 2017 07:03:00 -0000",
            "description": "How can we find self-love in a society that constantly pushes us toward non-acceptance? In this episode, Rachel talks about body positivity and loving her postpartum body while struggling with that little voice in the back of her mind telling her she isn't good enough. She shares a recent and fairly amusing story of how the insecurity sent her spiraling into some truly irrational behavior and gives tips on how to stop the vicious cycle of self-judgement. By directing attention away from the stressful chatter of the mind we can move toward feeling grounded in the body - but it's not easy! She also talks about bringing energy toward what we want to create versus what we don't need and learning to appreciate the quiet moments - all while struggling with sleep deprivation.\r\nLearn more about your ad choices. Visit podcastchoices.com/adchoices",
            "length": "0",
            "sourceUrl": "https://traffic.megaphone.fm/DGT8580466271.mp3"
        },
        {
            "title": "Hard Lessons Learned and The Business of Yoga ",
            "datePublished": "Fri, 11 Aug 2017 07:16:00 -0000",
            "description": "In this episode Rachel opens up about feeling taken advantage of and how it's a pattern that continuously shows up in her life. She shares a few examples of some very hard lessons she's had to learn in the yoga industry over the years and how even though they helped her grow and learn, she still finds herself too trusting in an industry that's sometimes everything but \"zen\". She also dives into the concept of forgiveness after having been hurt and tries to make sense of learning how to balance output with input.\r\nLearn more about your ad choices. Visit podcastchoices.com/adchoices",
            "length": "0",
            "sourceUrl": "https://traffic.megaphone.fm/DGT9625188703.mp3"
        },
        {
            "title": "Being Vulnerable, Feeling Your Feelings and Owning Your Sh*t",
            "datePublished": "Fri, 04 Aug 2017 07:03:00 -0000",
            "description": "In this episode Rachel talks about a new practice she’s incorporated into her life: the art of being vulnerable. She talks about how being vulnerable and feeling your feelings right away sets us up for a whole new lightness of being, the challenge of making and keeping girlfriends and how to tap into a sensitive place as a teacher so we can improve the quality of what we share with the world. \r\nLearn more about your ad choices. Visit podcastchoices.com/adchoices",
            "length": "0",
            "sourceUrl": "https://traffic.megaphone.fm/DGT7799313990.mp3"
        },
        {
            "title": "Life After Death, Facing Your Worst Fear and The Power Of A Brief Life with Amelia Barnes",
            "datePublished": "Fri, 28 Jul 2017 12:42:00 -0000",
            "description": "In this episode Rachel is joined by Amelia Barnes; yoga teacher, artist, designer and author of the book Landon's Legacy. In 2014 Amelia's son Landon was born. He died four days later. This episode is the painful but powerful story about how Landon passed away and the gut-wrenching journey that followed. Rachel was moving through the loss of her best friend around this very same time and together they dive into the topic of death, loss, healing through sharing, grieving out in the open and finding purpose in pain. In this episode you can expect lots of tears, but also inspiration to continue on and begin again after the worst has happened. Keep a box of tissues nearby - this episode is truly from the heart. \r\nLearn more about your ad choices. Visit podcastchoices.com/adchoices",
            "length": "0",
            "sourceUrl": "https://traffic.megaphone.fm/DGT2293839585.mp3"
        },
        {
            "title": "Following Your Passion, Turning Failure Into Success and Never Ever Giving Up On Love with Matt Cutshall",
            "datePublished": "Fri, 21 Jul 2017 07:03:00 -0000",
            "description": "In this episode Rachel is joined by Matt Cutshall; actor, singer, comedian and social media influencer living in LA. Matt shares the story of how he started a pop/rock band and spent five years of his life fighting relentlessly for that dream only to have it all fall apart right at the cusp of success. He also shares the contrast of growing up in a trailer park to the life he leads now and how it instilled a longing to give back to the world. They also dive into the magical topic of love and relationships - Matt recently found true love in his best friend @arielle and shares the full story of how deep friendship evolved into romance. This might just be the most anticipated love story ever played out on social media! \r\nLearn more about your ad choices. Visit podcastchoices.com/adchoices",
            "length": "0",
            "sourceUrl": "https://traffic.megaphone.fm/DGT5028094011.mp3"
        },
        {
            "title": "Mindful Relationships and Making Sacrifices For Mother Earth with Waylon Lewis",
            "datePublished": "Fri, 14 Jul 2017 07:03:00 -0000",
            "description": "In this episode Rachel is joined by Waylon Lewis; environmentalist, meditation teacher and founder of elephantjournal.com. They talk about sustainable living, the current political climate and the Buddhist view on mindful relationships. Waylon shares how he risked it all for the sake of caring for Mother Earth and gives his best tips for living a green life. \r\nLearn more about your ad choices. Visit podcastchoices.com/adchoices",
            "length": "0",
            "sourceUrl": "https://traffic.megaphone.fm/DGT1190728434.mp3"
        },
        {
            "title": "Using Hardships To Fuel Your Fire with Isabella Löwengrip",
            "datePublished": "Fri, 07 Jul 2017 07:03:00 -0000",
            "description": "How can we transform darkness into light? In this episode Rachel is joined by entrepreneur, mom and super-blogger Isabella Löwengrip. They talk about juggling a successful career with the responsibilities of motherhood, the importance of women supporting women, using hardships to fuel your fire and how to become your own best friend. Isabella shares how being bullied in school and leaving home at a young age inspired her to start her own business and the importance of making healthy choices every day - not just for your body, but for your mind.\r\nLearn more about your ad choices. Visit podcastchoices.com/adchoices",
            "length": "0",
            "sourceUrl": "https://traffic.megaphone.fm/DGT1602120289.mp3"
        },
        {
            "title": "Venting: The Art of Working Through Struggles and Returning to Gratitude",
            "datePublished": "Fri, 30 Jun 2017 07:03:00 -0000",
            "description": "In this episode, Rachel talks about her travels to Sweden, feeling overworked, the challenge of running a business as a new mom and why trying to be \"superwoman\" and doing it all just doesn't work. She also talks about how opening up about pain is the first step to healing, failing the no-sugar challenge (ugh!) and what she and her husband are struggling with as parents.\r\nLearn more about your ad choices. Visit podcastchoices.com/adchoices",
            "length": "0",
            "sourceUrl": "https://traffic.megaphone.fm/DGT2509832121.mp3"
        },
        {
            "title": "From Burning Out to Changing The World with Olivia Rothschild",
            "datePublished": "Fri, 23 Jun 2017 07:03:00 -0000",
            "description": "In this episode Rachel is joined by her best friend and co-worker Olivia Rothschild. They talk about going through pregnancy and childbirth together and Olivia shares the story of how a scary burn out led her to leaving the corporate world and founding the non-profit 109 World. They also dive into fun stories from growing up and traveling the world together and how life is changing as they are settling into motherhood.\r\nLearn more about your ad choices. Visit podcastchoices.com/adchoices",
            "length": "0",
            "sourceUrl": "https://traffic.megaphone.fm/DGT9252529027.mp3"
        },
        {
            "title": "Living With Asthma, Using Meditation to Heal and Learning How to Breathe with Bee Bosnak",
            "datePublished": "Fri, 16 Jun 2017 07:09:00 -0000",
            "description": "Can meditation change your life? In this episode Rachel is joined by Bee Bosnak, meditation expert and yoga teacher from New York. They chat about growing up with asthma, learning how to breathe through yoga and meditation and finding tools to heal emotional pain through sitting in silence.\r\nLearn more about your ad choices. Visit podcastchoices.com/adchoices",
            "length": "0",
            "sourceUrl": "https://traffic.megaphone.fm/DGT9994677642.mp3"
        },
        {
            "title": "The Vaccination Debate and Social Media Regrets",
            "datePublished": "Fri, 09 Jun 2017 07:03:00 -0000",
            "description": "In this episode Rachel shares her own experience with making the decision to vaccinate her baby girl, the backlash she received online when she shared it with the world and how she is navigating this very delicate subject.\r\nLearn more about your ad choices. Visit podcastchoices.com/adchoices",
            "length": "0",
            "sourceUrl": "https://traffic.megaphone.fm/DGT5234619603.mp3"
        },
        {
            "title": "Quitting Sugar and Making Changes Out of Love",
            "datePublished": "Fri, 02 Jun 2017 07:03:00 -0000",
            "description": "In this episode Rachel talks about her sweet tooth; something that used to mean enjoying dessert after dinner but that lately has become a full-on addiction. How can we make changes in our diet (or in our lives) and stick with them? Is there a way to find a loving approach to quitting bad habits? Join Rachel as she embarks on a journey of freeing herself from sugar and get inspired to look at your own life: is there something you need to surrender to make space for more love in your life? Let’s find out!\r\nLearn more about your ad choices. Visit podcastchoices.com/adchoices",
            "length": "0",
            "sourceUrl": "https://traffic.megaphone.fm/DGT8211114730.mp3"
        },
        {
            "title": "Learning From Pain, Working Through Baggage and Learning The Art of Letting Go",
            "datePublished": "Fri, 26 May 2017 07:03:00 -0000",
            "description": "Is it possible to be so connected to another human being that their pain can be physically felt within you? What happens when we are unable to let go of emotional pain from our past? This, and much more is answered in this weeks podcast episode. Rachel gets deep and personal and touches on a few traumatic experiences from her past - the death of her stepfather, her mothers suicide attempt and a car accident she suffered through in her teens. She talks about the physical pain she has carried throughout her life and the realization that it’s all connected to past emotional pain. \r\nLearn more about your ad choices. Visit podcastchoices.com/adchoices",
            "length": "0",
            "sourceUrl": "https://traffic.megaphone.fm/DGT1809765998.mp3"
        },
        {
            "title": "Yoga Every Damn Day",
            "datePublished": "Fri, 19 May 2017 07:03:00 -0000",
            "description": "In this episode Rachel shares how she found the yoga practice and how she started the movement that is #yogaeverydamnday. She also shares her best tips for starting up or maintaining a daily yoga practice, what yoga is like after having a baby and why suffering from intense back pain in the early stages of her practice turned out to be her biggest blessing.\r\nLearn more about your ad choices. Visit podcastchoices.com/adchoices",
            "length": "0",
            "sourceUrl": "https://traffic.megaphone.fm/DGT4420898240.mp3"
        },
        {
            "title": "Taking a leap for love with Dennis Schoneveld",
            "datePublished": "Fri, 12 May 2017 07:27:00 -0000",
            "description": "In this episode Rachel is joined by her husband Dennis and their baby girl, Lea Luna! They talk about how they first fell in love, what it's like working together with your spouse, life as new parents, dealing with social media fame and much more. Dennis shares how he found his passion for yoga (it wasn't through Rachel!) and why he was reluctant to be a guest on the show.\r\nLearn more about your ad choices. Visit podcastchoices.com/adchoices",
            "length": "0",
            "sourceUrl": "https://traffic.megaphone.fm/DGT4836006314.mp3"
        },
        {
            "title": "No Bulls**t Motherhood with Jen Pastiloff",
            "datePublished": "Fri, 05 May 2017 07:05:00 -0000",
            "description": "In this episode Rachel is joined by writer and yoga teacher Jen Pastiloff. Listen in as they dive into topics like how to deal with social media trolls, body image and eating disorders, the power of staying authentic online, keeping your sanity as a new mom, yoga and much more. \r\nLearn more about your ad choices. Visit podcastchoices.com/adchoices",
            "length": "0",
            "sourceUrl": "https://traffic.megaphone.fm/DGT8752324389.mp3"
        },
        {
            "title": "The Guilt Of The New Mom",
            "datePublished": "Fri, 28 Apr 2017 07:05:00 -0000",
            "description": "In this episode Rachel shares her struggles as a new mom and the guilt and self-doubt that often comes with motherhood. She also talks about the practice of sitting with pain and finding growth and healing by learning how to not escape emotions when they come our way.\r\nLearn more about your ad choices. Visit podcastchoices.com/adchoices",
            "length": "0",
            "sourceUrl": "https://traffic.megaphone.fm/DGT5157749240.mp3"
        },
        {
            "title": "Mother-Daughter Insights, Sobriety and Loving Lea Luna with Shama Persson",
            "datePublished": "Fri, 21 Apr 2017 07:03:00 -0000",
            "description": "In this episode Rachel is joined by none other than her mom! Together they discuss how they’ve managed to let go of the weight of a heavy past, her mom’s newfound sobriety, what it’s like living 5,000 miles apart and the beauty of mother- and grandmotherhood.\r\nLearn more about your ad choices. Visit podcastchoices.com/adchoices",
            "length": "0",
            "sourceUrl": "https://traffic.megaphone.fm/DGT1012307142.mp3"
        },
        {
            "title": "Overcoming Adversity, Healing Trauma and Parenting Your Own Way with Ashley Albrand",
            "datePublished": "Fri, 14 Apr 2017 07:05:00 -0000",
            "description": "In this episode of From The Heart, Rachel is joined by Ashley Albrand; yoga teacher and ex-professional hip-hop dancer turned modern-day medicine woman and healer. Ashley tells her amazing story about overcoming intense trauma and abuse and how she found healing through practicing yoga and living in tune with nature.\r\nLearn more about your ad choices. Visit podcastchoices.com/adchoices",
            "length": "0",
            "sourceUrl": "https://traffic.megaphone.fm/DGT9864598931.mp3"
        },
        {
            "title": "Manifesting Abundance",
            "datePublished": "Fri, 07 Apr 2017 07:03:00 -0000",
            "description": "What is the true meaning of success? Is it possible to manifest financial freedom and still stay true to who you are? How can we do business with a heart? To answer these questions we dive into the topic of money, success and manifesting abundance. In this episode Rachel shares stories from her past to find the secrets to how she built a thriving business out of nothing. Coupling spirituality with abundance, we explore the idea of using meditation as a tool to cultivate trust and with it, the life you've always dreamed of. \r\nLearn more about your ad choices. Visit podcastchoices.com/adchoices",
            "length": "0",
            "sourceUrl": "https://traffic.megaphone.fm/DGT5103551878.mp3"
        },
        {
            "title": "The Birth Story",
            "datePublished": "Fri, 31 Mar 2017 07:03:00 -0000",
            "description": "In this first episode of \"From The Heart”, Rachel gets intimate and personal, sharing her detailed birth story with the world for the very first time. On March 13, she gave birth to a beautiful baby girl: Lea Luna. Longing for an unmedicated water birth at home, she ended up going to the hospital after 18 hours of intense labor. In this episode, Rachel shares the full story and how even when things don't happen the way you've planned... Life tends to play out exactly the way it's supposed to.\r\nLearn more about your ad choices. Visit podcastchoices.com/adchoices",
            "length": "0",
            "sourceUrl": "https://traffic.megaphone.fm/DGT5100363792.mp3"
        },
        {
            "title": "Teaser Episode",
            "datePublished": "Fri, 24 Mar 2017 18:21:24 -0000",
            "description": "From the Heart: Conversations with Yoga Girl debuts Friday March 31st!\r\nLearn more about your ad choices. Visit podcastchoices.com/adchoices",
            "length": "0",
            "sourceUrl": "https://traffic.megaphone.fm/DGT3393679944.mp3"
        }
    ]
}