{
    "artwork": "http://is3.mzstatic.com/image/thumb/Music71/v4/12/62/4a/12624ac5-6647-3ee2-16a1-60e8b96cbed7/source/100x100bb.jpg",
    "description": "My goal with blog Talk Radio is to provide  up-to-date information about the Fitness, Nutrition, and our Advanced HCG Diet protocol.  You will learn new  diet tips, little tricks, and gain powerful Insight into achieving fast and permanent weight loss with the advanced HCG diet by HCG Body for Life. You will discover how to get un-stuck, avoid weight stall, increase fat loss results and how to gain lean muscle while losing tons of unwanted pounds and inches from the No. 1 HCG diet coach in the world.",
    "feedURL": "http://www.blogtalkradio.com/thehcgdietcoach/podcast",
    "podcastURL": "http://www.blogtalkradio.com/thehcgdietcoach",
    "title": "HCG Body For Life!",
    "episodes": [
        {
            "title": "Self Evaluation vs Self Criticism - Do This 5 Minute Daily Exercise",
            "datePublished": "Wed, 06 May 2020 20:00:00 GMT",
            "description": "Taking Personal Inventory of The Five to Seven Most Important Areas of Your Life and Look For Opportunities to Improve Each Area.\r\n\r\nJust a quick and easy simple daily exercise that will give you an opportunity to make small subtle changes each day to improve the quality of your life, health, and happiness.\r\n\r\nCheck out my new book at https://www.10dayketoresetdiet.com\r\n\r\nCheckout my website for anything HCG @ https://colinfwatson.com\r\n\r\nSee you next time.\r\n\r\n \r\n\r\nNamaste,\r\n\r\n \r\n\r\nColin\r\n",
            "length": "28643623",
            "sourceUrl": "https://www.blogtalkradio.com/thehcgdietcoach/2020/05/06/self-evaluation-vs-self-criticism--do-this-5-minute-daily-exercise.mp3",
            "snNo": "10",
            "epNo": "10",
            "categories": [
                {
                    "_": "Health",
                    "$": {
                        "domain": "https://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "Introducing The  All New 10-Day Keto Reset Diet",
            "datePublished": "Tue, 28 Apr 2020 20:00:00 GMT",
            "description": "If you're listening to this podcast or reading this page, you're most likely a woman over 30 who is trying to lose weight and are completely frustrated because your slow metabolism is STEALING your quality of life.\r\n\r\nSimply put, if your ENERGY PROCESSOR (your metabolism) is out of whack, your body will most likely start packing on the pounds, no matter what you do. Or, the weight refuses to come off even when you eat healthily and exercise your butt off.\r\n\r\nAnd if that's not bad enough, when you do finally lose the weight, you experience rapid REBOUND weight gain that put the weight back on twice as fast as it came off.\r\n\r\nLook, there is a HUGE obstacle in your way especially when in your 30's, 40's, and 50's, and it's your SLOW metabolism. Unfortunately for most women, your genetic makeup can make losing weight a little more challenging; and when this suddenly happens to you, it seems almost as if something has taken over your body and you have absolutely no control of what happening to it.\r\n\r\nHi, my name is Colin! That's my amazing wife Jayne and our beautiful granddaughter, Lexy in the above photo. I am a fitness nutrition coach and author of two highly successful weight loss books. I have spent over ten years searching for a solution to help women as they season, perfect their diet & exercise routines, unlock their true potential, and avoid getting discouraged if or when they fall off track.\r\n\r\nMany of my listeners have had difficulty keeping the weight off after completing my advanced HCG diet. for others the struggle is real. Simply agind and menopaus is making it more difficult to lose weight in their 40's 50' and 60's this is where the 10-Day Keto Reset diet will be the game changer. To learn more and read about how it came about. Go to https://www.10dayketoresetdiet.com/ .\r\n",
            "length": "42833338",
            "sourceUrl": "https://www.blogtalkradio.com/thehcgdietcoach/2020/04/28/introducing-the-all-new-10-day-keto-reset-diet.mp3",
            "snNo": "10",
            "epNo": "9",
            "categories": [
                {
                    "_": "Health",
                    "$": {
                        "domain": "https://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "Covid19 and Black America - We Need to Wake The \"F\" Up",
            "datePublished": "Tue, 21 Apr 2020 21:00:00 GMT",
            "description": "COVID-19 is more likely to kill black Americans, and for those that survive, the pandemic will take a devastating toll on their jobs and future earning potential, a new McKinsey & Co. report finds.\r\n\r\nBlack Americans are about 30% more likely than white Americans to have health conditions that exacerbate the effects of the virus, such as hypertension and diabetes, the report published Tuesday says. Black workers are also overrepresented in high-contact essential services, making up 33% of nursing assistants and 39% of hospital orderlies. “Black workers are putting their lives and health on the line,” the report reads. \r\n\r\nThe black community will also probably take a disproportionate hit from the economic fallout of the pandemic. A nationwide lockdown has put more jobs held by black people at risk, the report finds. They are almost twice as likely to live in the counties and work in positions at the highest risk of immediate and long-standing economic disruption. An estimated 39% of jobs held by black workers are at risk, compared with 34% for white workers.\r\n\r\nThis disease is revealing an underlying weakness in the black community and its poor health, bad eating habits, chronic—illnesses like diabetes, heart disease, and ovesity. We've got to wake up and start taking better care of our health.\r\n\r\nIf you're looking for a healthy eating plan that can help you release body fat and improve all your health markers in 30-days. Go to https://ColinFWatson.com\r\n\r\nFor women over 30 with a slow metabolism check out The 10-Day Keto Reset Diet @ https://www.10dayketoresetdiet.com/\r\n",
            "length": "18527757",
            "sourceUrl": "https://www.blogtalkradio.com/thehcgdietcoach/2020/04/21/covid19-and-black-america--we-need-to-wake-the-f-up.mp3",
            "snNo": "10",
            "epNo": "8",
            "categories": [
                {
                    "_": "Health",
                    "$": {
                        "domain": "https://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "How I Met God",
            "datePublished": "Wed, 04 Mar 2020 22:00:00 GMT",
            "description": "How I Met God...\r\n\r\nIn this episode, I share with you the strange event that completely changes the direction of my life and led me to spiritual awakening and daily practice that's been life-changing.\r\n\r\nWhy I write a three-page letter to God each gay and how this daily DMO has created huge personal, spiritual, physical and financial breakthroughs.\r\n\r\n \r\n\r\nNamaste,\r\n\r\nColin F. Watson\r\n",
            "length": "23175559",
            "sourceUrl": "https://www.blogtalkradio.com/thehcgdietcoach/2020/03/04/how-i-met-god.mp3",
            "categories": [
                {
                    "_": "Health",
                    "$": {
                        "domain": "https://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "Why Anyone Who Struggles To Lose Weight Should Consider The Advanced HCG Deit",
            "datePublished": "Wed, 30 Oct 2019 17:30:00 GMT",
            "description": "If you're tired of being sick and tired and are looking for a fast, safe, and effective way to lose body fat and get in the body of your life, this episode is for you.  To DOWNLOAD A FREE COPY OF MY NEWEST EBOOK - Burn The Fat Reveal The Muscle... Click HERE now to grab your copy why they still last. \r\n\r\nNamaste Colin F. Watson.\r\n",
            "length": "12983651",
            "sourceUrl": "https://www.blogtalkradio.com/thehcgdietcoach/2019/10/30/why-anyone-who-struggles-to-lose-weight-should-consider-the-advanced-hcg-deit.mp3",
            "categories": [
                {
                    "_": "Health",
                    "$": {
                        "domain": "https://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "How The Advanced HCG Diet Differs From Dr. Simeons HCG Protocol",
            "datePublished": "Wed, 23 Oct 2019 17:30:00 GMT",
            "description": "In this episode I explain in detail why our advanced HCG protocol ROCKS and how it differs from Dr. Simeons Origianl HCG Diet Protocol. To DOWNLOAD A FREE COPY OF MY NEWEST EBOOK - Burn The Fat Reveal The Muscle Clcik HERE To Download. \r\n\r\n \r\n\r\nNamaste,\r\n\r\n \r\n\r\nColin\r\n\r\n \r\n",
            "length": "19201675",
            "sourceUrl": "https://www.blogtalkradio.com/thehcgdietcoach/2019/10/23/how-the-advanced-hcg-diet-differs-from-dr-simeons-hcg-protocol.mp3",
            "categories": [
                {
                    "_": "Health",
                    "$": {
                        "domain": "https://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "Why You MUST Gain 6 to 10 Pounds During HCG Diet Phase 1 Loading",
            "datePublished": "Wed, 16 Oct 2019 17:30:00 GMT",
            "description": "If You Don't Gain Sufficient Weight I HCG diet Phase 1, You Wont Lose Effectivelyt In HCG Diet Phase 2. This Is one of the most crucual mistakes new and repeating HCG dieters make when following the advanced HCG diet. Failure to gain sufficient weight in phase 1 can be a recipe for desater, In this new episode I explain why.  To DOWNLOAD A COPY OF MY NEWEST EBOOK -Burn The Fat Reveal The Musscle Click HERE to get your FREE Copy. \r\n\r\nNamaste,\r\n\r\nColin F. Watson\r\n\r\nThe Heavenly Body Magician\r\n\r\n \r\n",
            "length": "9970219",
            "sourceUrl": "https://www.blogtalkradio.com/thehcgdietcoach/2019/10/16/why-you-must-gain-6-to-10-pounds-during-hcg-diet-phase-1-loading.mp3",
            "categories": [
                {
                    "_": "Health",
                    "$": {
                        "domain": "https://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "Stop Following Dr. Simeons HCG Diet",
            "datePublished": "Wed, 09 Oct 2019 17:00:00 GMT",
            "description": "Why Dr. Simeons HCG Protocol Is Out-Dated and Causing You to Lose Muscle and In Some Cases Hair. Many who follow the old out-dated Dr. Simoens protocol are experiencing loss of lean muscle, low energy, repeated weight stalls, and in extreme cases in a woman especially, hair loss. In this podcast, I share with you why we made the necessary changes to the HCG diet to update it and bring it into the 21st century. By implementing the changes we've made in our advanced HCG protocol you'll not only feel better, butdr you also achieve faster and more sustained fat loss results. DOWNLOAD A FREE COPY OF MY NEWEST EBOOK - Burn The Fat Reveal The Muscle - Clink HERE Bhttp://burnthefatrevealthemuscle.com/\r\n",
            "length": "12874141",
            "sourceUrl": "https://www.blogtalkradio.com/thehcgdietcoach/2019/10/09/stop-following-dr-simeons-hcg-diet.mp3",
            "categories": [
                {
                    "_": "Health",
                    "$": {
                        "domain": "https://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "I'll Never Make You Responsible For My Feelings",
            "datePublished": "Thu, 21 Feb 2019 00:30:00 GMT",
            "description": "I'll Never Make You Responsible For My Feelings:. On Valentine's day Jayne and I shared our philosopy on dealing wiht emptions, and making a vow to never make either of us responsible for THE OTHER PERSONS feelingd.\r\n\r\nNamaste,\r\n\r\nColln\r\n",
            "length": "23667960",
            "sourceUrl": "https://www.blogtalkradio.com/thehcgdietcoach/2019/02/21/ill-never-make-you-responsible-for-my-feelings.mp3",
            "categories": [
                {
                    "_": "Health",
                    "$": {
                        "domain": "https://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "WHAT HAPPENED TO US AFTER 6 MONTHS ON HGH \"THE GEL\"?",
            "datePublished": "Sat, 09 Feb 2019 18:30:00 GMT",
            "description": "FOR MORE INFO CLICK HERE https://linktr.ee/colinfwatson I BROKE MY BACK LAST YEAR AND COULDN'T WALK  WITHOUT A WALKER FOR OVER 7 MONTHS. Today I'm about 85% recovered I still have some lower back pain daily and nerve damage in my left leg but I'm so grateful for this product \"THE GEL\" that helped me put back on more than 20 pounds of lean muscle.\r\n\r\nIn this Podcst Jayne and I discuss our personal results after being on the NEW HGH Gel for 6 months. The benefit of using the gel is highly beneficial for anyone looking for renewed health and more.\r\n\r\nThe benefits of using HGH come in various forms, it can be used someone who wants to take advantage of the anti aging effects it delivers.\r\n\r\nOr it could be used by someone who wants to build muscle mass and lose fat faster.\r\n\r\nHere we have a complete list of all the HGH benefits you may experience when using this drug.\r\nIncreases protein synthesis (More muscle growth)Promotes lipolysis (your body burns off more fat)Faster recovery after workoutsDeeper sleepHigher libidoHigher energy levelsBetter cholesterol levelsStimulates growth in childrenStronger bonesEnhanced immune systemTisse regenerationFaster regeneration of cellsBetter blood pressureDeeper sleepReduces risk of cardiovascular diseaseBetter moodLower risk of obesityHelps prevent erectile dysfunctionEnhanced growth of hair and nailsMore enduranceImproved cognitive function\r\n \r\n",
            "length": "24562416",
            "sourceUrl": "https://www.blogtalkradio.com/thehcgdietcoach/2019/02/09/what-happened-to-us-after-6-months-on-hgh-the-gel.mp3",
            "categories": [
                {
                    "_": "Health",
                    "$": {
                        "domain": "https://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "How To Use Intermittent Fasting with The Advanced HCG Diet.",
            "datePublished": "Thu, 31 Jan 2019 18:30:00 GMT",
            "description": "How To Use Intermittent Fasting with The HCG Diet.\r\n\r\nIntermittent fasting is the ancient secret of health. It is ancient because it has been practiced throughout all of human history. It’s a secret because this powerful habit has been virtually forgotten.\r\n\r\nBut now many people are re-discovering this dietary intervention. It can carry huge benefits if it is done right: weight loss, increased energy, reversal of type 2 diabetes and many other things. Plus, you’ll save time and money.\r\n\r\nCombining \"IF\" with our advanced HCG diet can be extremely powerful and rewarding in many ways.\r\nStart your morning fast with a Bulletproof coffee or teaYour fasting window can be as long or as short as you want it to be. 8 -hours 10-hours, 12-hours 16-hours, or even as much as 20 hours.A few things to remember about \"IF\" and The HCG diet, is that you must eat all of your meals and calories, during the feeding window.Start slowly with your fasting window durations. Start small and work your way up over the first two weeks. start 8:30PM to 8:30AM 8:30PM to 10:30AM the after a week go longer... 8:30PM to 12:30PMIt's best to do cardio in the morning, and if possible, weight training in the evening after your first meal and snack.Hydrate, Hydrate, Hydrate - You must drink 1 gallon of water or more each and every day. PERIOD!For those of you who are athletic and want to add a few pounds of lean muscle. You must go higher on protein on every training/lifting day.If you feel hungry during the day before your eating window opens up. For God's sake eat. You've fasted enough for that day. Either come back tomorrow and see if you can go longer or simply shorten your fasting window.\r\nI hope you find my new HCG \"IF\" protocol super effective and it helps you to achieve the body of your life even faster.\r\n",
            "length": "26981400",
            "sourceUrl": "https://www.blogtalkradio.com/thehcgdietcoach/2019/01/31/how-to-use-intermittent-fasting-with-the-advanced-hcg-diet.mp3",
            "snNo": "10",
            "epNo": "7",
            "categories": [
                {
                    "_": "Weight Loss",
                    "$": {
                        "domain": "https://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "A New Year A New Life... My First Podcast Of 2019",
            "datePublished": "Wed, 16 Jan 2019 23:00:00 GMT",
            "description": "TBD\r\n",
            "length": "26665422",
            "sourceUrl": "https://www.blogtalkradio.com/thehcgdietcoach/2019/01/16/a-new-year-a-new-life-my-first-podcast-of-2019.mp3",
            "snNo": "10",
            "epNo": "6",
            "categories": [
                {
                    "_": "Weight Loss",
                    "$": {
                        "domain": "https://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "Can Writing An Amends Letter Help You Achieve Massive Weight Loss Success",
            "datePublished": "Wed, 08 Nov 2017 23:30:00 GMT",
            "description": "A few weeks ago I was asked to consider a compelling thought process by my spiritual adviser.\r\n\r\nI was asked this very question. \"Would you be open to the concept that you have created every aspect of your life that you feel is not working for you,\" I asked Steve to clarify what he meant.\r\n\r\nIf you don't like how your wife speaks to you, you created that.\r\n\r\nIf your business isn't running like a well-oiled machine and isn't as profitable as you'd like, you created that.\r\n\r\nIf your relationships with your children, family members, friends, customers are not flourishing, you created that.\r\n\r\nIf you don't like the way you look and feel, you created that.\r\n\r\nHe went on and on covering every complaint I have uttered about my life during our past sessions and ask me one last question...\r\n\r\nDO YOU WANT A BETTER, HAPPIER, HEALTHIER MORE LOVING LIFE?\r\n\r\nARE YOU WILL TO TAKE ON A TASK THAT WILL LEAD YOU TO THE LIFE YOU SO RICHLY DESERVE?\r\n\r\nI answered YES,\r\n\r\nSteve then ask me what part of my life did I want to work on first, and without hesitation, I said my relationship with my fantastic wife, Jayne.\r\n\r\nSo he asked me to write an amends letter to Jayne, apologizing to her for anything and everything I've done to create what was missing from our marriage, relationship, and friendship that had changed from when we first started dating.\r\n\r\nSo I had to go back to the beginning more than 17 years ago all the way to present day.\r\n\r\nThe exercise was very powerful, it often brought me to tears, and what happened next I will share with you live in the podcast.\r\n\r\nNamaste,\r\n\r\nThe light in me sees, meets and greets the amazing light in you.\r\n\r\nColin\r\n",
            "length": "32689468",
            "sourceUrl": "https://www.blogtalkradio.com/thehcgdietcoach/2017/11/08/can-writing-an-amends-letter-help-you-achieve-massive-weight-loss-success-1.mp3",
            "snNo": "10",
            "epNo": "4",
            "categories": [
                {
                    "_": "Health",
                    "$": {
                        "domain": "https://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "5 Reasons Why You Can't Lose Weight and It Has Nothing To Do With Your Diet.",
            "datePublished": "Fri, 27 Jan 2017 02:00:00 GMT",
            "description": "Join me LIVE for another no holds bard conversation on why you keep struggling to lose weight and keep it off for life.\r\n\r\nOnce you understand why you've failed, you can finally begin to learn the how.\r\n\r\nI'm also going to share with you why I feel my simple three part system can help anyone who wants to achieve their New Years resolution to lose weight by Spring Break do so easily and effectively.\r\n\r\nThursday, January 26th at 6 pm PST, 8 pm CST, and 9 pm EST.\r\n\r\nUntil then Live Life Powerfully!\r\n\r\nLove Ya,\r\n\r\nColin\r\n",
            "length": "70533165",
            "sourceUrl": "https://www.blogtalkradio.com/thehcgdietcoach/2017/01/27/5-reasons-why-you-cant-lose-weight-and-it-has-nothing-to-do-with-your-diet.mp3",
            "categories": [
                {
                    "_": "Health",
                    "$": {
                        "domain": "https://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "Have You Been Cursed By The HCG Diet?",
            "datePublished": "Thu, 12 Jan 2017 02:00:00 GMT",
            "description": "In my first radio Podcast of 2017, I will be discussing a topic I've never discussed before.\r\n\r\nThe curse of the HCG diet.\r\n\r\nWhy those who have done the HCG diet successfully can never forget their first HCG round and the success they experienced with relative easy, and how that success becomes the focal point of every following method used to release body fat for years to come.\r\n\r\nIt is my sincere hope that shedding light on this real phenomena, will help many of you realize what's been getting in the way of your success, provide you with a few solutions on how to break this curse and help you find weight release success post-HCG diet.\r\n\r\nPlease join me LIVE for my fist 2017 breakout show this Wednesday, January 11'th at 6 PM PST\r\n\r\nI'm excited to be back on the radio live. It's been waaaay to long.\r\n\r\nNamaste,\r\n\r\nColin\r\n",
            "length": "86532224",
            "sourceUrl": "https://www.blogtalkradio.com/thehcgdietcoach/2017/01/12/have-you-been-cursed-by-the-hcg-diet.mp3",
            "categories": [
                {
                    "_": "Health",
                    "$": {
                        "domain": "https://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "4 Signs Your Scale Is Only Helping You Loose At Dieting Not Loose Weight!",
            "datePublished": "Fri, 25 Mar 2016 00:30:00 GMT",
            "description": "Join Me Live at 5:30pm PST Thursday March 24, 2016\r\n\r\nI've seen so many perfectly successful weight loss journey's sabataged do the miss understood the feedback from your home scale. or by one having an unhealthy relationship with their scale.\r\n\r\nIt's just a number... Right?\r\n\r\nBut it's all too easy to become a slave to your scale—letting that number dictate how you feel about yourself and your body,your day, your spouse and the list goes on.\r\n\r\nExperts say focusing too intently on what you weigh can squelch your motivation to stick with your diet and exercise goals. At the same time, some studies show that people who weigh themselves often are better at dodging weight gain. \r\n\r\nSo what the best approach to slaying the scale dragon and yet still feeling good about your weight loss progress, so you can finally finsh what you stared and reach become your ideal self.\r\n\r\nOn this episdode of \"Are Your Fitter Than A 50 Year Old\" I'll disclose the 4  signs you're a scale junkie and how to get clean and sober fast.\r\n\r\nSee you there,\r\n\r\nLove ya!\r\n\r\nColin\r\n\r\n \r\n\r\n \r\n\r\nYour Privacy Rights | About Us\r\n\r\nHere are four signs you need to rethink your attitude or actions when it comes to your bathroom scale. (Hack your gut bacteria for easier-than-ever weight loss.)\r\n",
            "length": "0",
            "sourceUrl": "https://www.blogtalkradio.com/thehcgdietcoach/2016/03/25/4-signs-your-scale-is-only-helping-you-loose-at-dieting-not-loose-weight.mp3",
            "categories": [
                {
                    "_": "Health",
                    "$": {
                        "domain": "https://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "I Gained The Weight Back and My (Go To Diet) Stopped Working... Now What?",
            "datePublished": "Fri, 04 Mar 2016 02:00:00 GMT",
            "description": "Tonight Live at 6 PM PST and 9 PM EST\r\n\r\nWhat to do when your favorite diet (HCG) stops working, and you need a new lifestyle plan for long-term success!\r\n\r\nWhy you should never give up on your dream of looking great, feeling amazing and having the health and body of your dreams.\r\n\r\nIf I were not willing to look beyond my program, and be open to something new, I would not be experiencing the renewed, health, energy and fitness level I have been able to achieve over the last 42 days.\r\n\r\nTonight I'm going to share with you what you must do in the next 25 days to change your health, body, and life if you want to feel finally free of dieting once and for all.\r\n\r\nJoin me live and I will give you all of the juicy details!\r\n\r\nSee you soon,\r\n\r\nColin\r\n\r\n \r\n",
            "length": "83852353",
            "sourceUrl": "https://www.blogtalkradio.com/thehcgdietcoach/2016/03/04/i-gained-the-weight-back-and-my-go-to-diet-stopped-working-now-what.mp3",
            "categories": [
                {
                    "_": "Health",
                    "$": {
                        "domain": "https://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "NutritionPlanX Part II - How to get lean and live a Fat - Metabolized life!",
            "datePublished": "Thu, 11 Feb 2016 02:00:00 GMT",
            "description": " Tonight 6PM PST\r\n\r\n\r\n\tNutritionPlanX Part II - How to get nutritionally balanced, detox your body, and live a Fat-Metabolized life in 30 days..\r\n\r\n\r\n\tThe buzz about my all new nutritionplanX is trending in a big way...\r\n\r\n\r\n\tBecause everyone who hears about NutritionPlanX and gets it, has to have it!\r\n\r\n\r\n\tUntil you detox the body and get it nutritionally balanced, you can pretty much forget about getting lean, fit and sexy.\r\n\r\n\r\n\tPERIOD!!!\r\n\r\n\r\n\tJoin me tonight LIVE and I will share with you what I've discovered.\r\n\r\n\r\n\tHow I'm using this new program to change, my health, build a lean, sexy body at 54 years old.\r\n\r\n\r\n\tSkyrocket my energy, sleep better, build strength, improve my stamina, and feel better than I have in years all in less than 30 days.\r\n\r\n\r\n\tThis WILL change your life forever as it has changed mine.\r\n\r\n\r\n\tKnowledge is power and NutrtionplanX is the tool you need to get finally off the hampster wheel to stop dieting and start living in the body of your life...\r\n",
            "length": "87313473",
            "sourceUrl": "https://www.blogtalkradio.com/thehcgdietcoach/2016/02/11/nutritionplanx-part-ii--how-to-get-lean-and-live-a-fat--metabolized-life.mp3",
            "categories": [
                {
                    "_": "Health",
                    "$": {
                        "domain": "https://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "6PM PST... My New Nutrition Plan - X Revealed... Phase 2-3.0",
            "datePublished": "Thu, 21 Jan 2016 02:00:00 GMT",
            "description": "My first podcast of 2016 and it going to have you jumping out of your skin with excitment!\r\n\r\nI can only recall one time in my life when it comes to my health, fitness, and physic where I was more excited than I am now.\r\n\r\nIt was seven and a half years ago when my former me, who was 48 pounds over weight, had sleep apnea, high blood pressure and a borderline diabetic stumbled across the HCG diet.\r\n\r\nI was 47 years old, and I looked in the mirror and saw someone I had not seen since I was bout 25.\r\n\r\nSince that time, I have dedicated my time, energy, heart and soul in helping people like you, who were just like me, who look in the mirror every day and don't like what the see.\r\n\r\nLet's be completely honest, you most likely HATE what you see looking back at you!\r\n\r\nThis is why I am SOOOO EXCITED to reveal my New Nutrition Plan X.\r\n\r\nWhen I think of all of you, that Jayne and I have had been blessed to help improve your health and body images over the years it brings me to tears.\r\n\r\nMy New Nutrition Plan X as I call it, and I'll explain why tonight, is my Deja Vue moment of feeling that same excitement I had when I launched my very first YouTube video sharing my stunning results with what is now known as HCG Body for Life!\r\n\r\nIf you have followed my advise in the past and like thousand of others, have achieved levels of fat loss success not seen before. You will be amazed again.\r\n\r\nBut tonight, I be expressly speaking to all of you SERIAL HCG DIETERS, who have had trouble maintaining your ideal weight long-term.\r\n\r\nWhat's about to happen to your life tonight is going to be nothing short of AMAZING!\r\n\r\nSo DO NOT MISS THIS  LIVE CALL. If you can't make it LIVE, it will be recorded.\r\n\r\nSpace is LIMITED so be first on the lines to guarantee your spot to hear about my New Nutrition Plan - X aka Phase 2-3.0!\r\n\r\nSee You Tonight,\r\n\r\nColin\r\n\r\n \r\n\r\n \r\n",
            "length": "115498968",
            "sourceUrl": "https://www.blogtalkradio.com/thehcgdietcoach/2016/01/21/6pm-pst-my-new-nutrition-plan--x-revealed-phase-2-30.mp3",
            "categories": [
                {
                    "_": "Health",
                    "$": {
                        "domain": "https://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "My Hypothyroid 6 week protocol revealed, does it work?",
            "datePublished": "Fri, 18 Sep 2015 01:00:00 GMT",
            "description": "A few weeks ago I talked about my quest to improve my thyroid function and stabilize my weight.\r\n\r\nJayne and I completely change the way we eat eliminating foods that we discovered were possibly slowing down our thyroid function and replaced it with foods that supported greater thyroid function.\r\n\r\nThursday night I will be sharing our results with you, and if this is something I would recommend for my clients and customers.\r\n\r\nTune in to hear all about if it worked.\r\n\r\nI will also be revealing the order numbers of the three customers who won our double your order sweepstakes from our Labor Day sale.\r\n\r\nThese three lucky people will automatically have their orders doubled which they can choose to either have shipped out right away or held in our warehouse for a future round.\r\n\r\nCould the you be one of our lucky winners? Tune in Thursday night to find out live!\r\n",
            "length": "86396888",
            "sourceUrl": "https://www.blogtalkradio.com/thehcgdietcoach/2015/09/18/my-hypothyroid-6-week-protocol-revealed-does-it-work.mp3",
            "categories": [
                {
                    "_": "Health",
                    "$": {
                        "domain": "https://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "Hypothyroidism, How to find out if you have it in as little as 5 minutes...",
            "datePublished": "Thu, 06 Aug 2015 01:00:00 GMT",
            "description": "Are you suffering from Hypothyroidism and don't know it…?\r\n\r\nThis could be one of the most important topics I'll ever cover... You'll want to hear this first hand. #Justsayin!\r\n\r\nWhether you’re aware of it or not, there’s a major problem today surrounding hypothyroidism diets and treatments. And unfortunately you’re caught right in the middle of it… Today, 99% of hypothyroidism diets and treatments, medically-based and naturally-based alike, don’t work, because they are missing key pieces to the hypothyroidism puzzle.\r\n\r\nThey are mostly promoting diets, drugs, and supplements that are not only potential dangerous but offer nothing more than a band-aid fix in an attempt to cover up the MUCH bigger and more serious problem.\r\n\r\nIn fact, I’m going to share with you just a little of what I've learned about this medical research showing that 90% of hypothyroidism sufferers treated by modern medicine today show absolutely ZERO IMPROVEMENT in their symptoms and thyroid function (actually their symptoms got worse).\r\n\r\nNot only do I know they don’t work based on medical research and clinical experience, but as a current hypothyroidism sufferer, Jayne and I know this because W’ve tried many of the conventional treatments and experienced the frustrations first hand. What I didn’t realize at the time was how many of these healthy foods we were eating that was actually making our condition worse, and causing more damage to our thyroid.\r\n\r\nBut that was before we discovered the Revolutionary Thyroid Research that I'm confident will change our lives and maybe yours forever, and that's what I will be sharing with you on today's podcast.\r\n\r\nCall in live or watch me on Pariscope...\r\n\r\nSee you soon,\r\n\r\nColin\r\n",
            "length": "82937858",
            "sourceUrl": "https://www.blogtalkradio.com/thehcgdietcoach/2015/08/06/hypothyroidism-how-to-find-out-if-you-have-it-in-as-little-as-5-minutes.mp3",
            "categories": [
                {
                    "_": "Health",
                    "$": {
                        "domain": "https://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "Ask Me Anything HCG -July 21st 2015",
            "datePublished": "Wed, 22 Jul 2015 01:00:00 GMT",
            "description": "Join Me Tuesday July 21st for my live show...\r\n\r\nAsk Me Anything HCG!\r\n\r\nAsk Me Anything HCG is one of my favorite show topics because it tells me exactly you want to know.\r\n\r\nIt is also a great opportunity for you to get answers to questions you've found difficulty finding answers to.\r\n\r\nIt's easy to participate and be a part of this show because I invite you to send in your questions via email before the show airs, that way if you can't catch the live broadcast, you can listen to the playback and in most cases you'll hear the answers to your special questions.\r\n\r\nI only ask that you make your questions HCG protocol specific.\r\n\r\nThis is not an opportunity for you to ask about order status or when your package will arrive.\r\n\r\nI'm looking for you to ask you most pressing questions, the one question that by knowing the answer could make the difference between your success or failure.\r\n\r\nSo either hit the reply button and send me your questions between now and 3 PM PST Tuesday July 21st.\r\n\r\nIf you see this message from another platform other than my email list, then send your question to colin.watson22@gmail.com and put \"ASK Me Anything\" in the subject line.\r\n\r\nUntil then, Live Life Powerfully!\r\n\r\nLove ya,\r\n\r\nColin\r\n",
            "length": "87068131",
            "sourceUrl": "https://www.blogtalkradio.com/thehcgdietcoach/2015/07/22/ask-me-anything-hcg-july-21st-2015.mp3",
            "categories": [
                {
                    "_": "Health",
                    "$": {
                        "domain": "https://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "Obesity and Infidelity Is there An Unspoken Connection",
            "datePublished": "Thu, 04 Jun 2015 01:30:00 GMT",
            "description": "Tonight I will share with you something I have NEVER spoken about in public or private...\r\n\r\nI 'll share my theory about the connection between your perceived self-image and infidelity.\r\n\r\nHow men and woman can often confuse the need for self-love and replace it with the need for external love and affection.\r\n\r\nAs always, I will be sharing my personal struggle with this issue, how it effected me and my family, what I did to understand the process and how getting losing weight and getting healthy exposed a truth to me that I did not know!\r\n\r\nJoin me tonight LIVE at 6:30PM PST It's going to be intense...\r\n\r\nTalk To You Soon,\r\n\r\nColin\r\n",
            "length": "42696330",
            "sourceUrl": "https://www.blogtalkradio.com/thehcgdietcoach/2015/06/04/obesity-and-infidelity-is-there-an-unspoken-connection.mp3",
            "categories": [
                {
                    "_": "Health",
                    "$": {
                        "domain": "https://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "Tonight At 6PM PST - What is The ALL NEW Phase 2-2.0 and Why Should You Care?",
            "datePublished": "Thu, 21 May 2015 01:00:00 GMT",
            "description": "What is The ALL NEW Phase 2-2.0 and Why Should You Care?\r\n\r\nOn today's show, I'll be giving you a preview of the soon to be released ALL NEW HCG Body for Life Phase 2-2.0.\r\n\r\nWhy I found a need to tweak the protocol again, my reasons and philosophies behind the changes, and why this newest version of HCG Body for life reveals the secret to long-term fat loss.\r\n\r\nHow to build a lean fit, strong body with my ALL NEW Phase 2-2.0\r\n\r\nI'll also be talking about what's on the horizon that will make getting dialed in, balanced and staying lean, fit and healthy, easier than every before.\r\n\r\nJoin me tonight at 6PM PST and get all the exclusive details live, up close and personal.\r\n\r\nSee you tonight!\r\n\r\nNamaste,\r\n\r\nColin\r\n",
            "length": "87197698",
            "sourceUrl": "https://www.blogtalkradio.com/thehcgdietcoach/2015/05/21/tonight-at-6pm-pst--what-is-the-all-new-phase-2-20-and-why-should-you-care.mp3",
            "categories": [
                {
                    "_": "Health",
                    "$": {
                        "domain": "https://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "How Losing Weight In The Face Of Adversity Can Create A Platform for Success!",
            "datePublished": "Fri, 24 Apr 2015 01:00:00 GMT",
            "description": "I'm Back My People... LOL\r\n\r\nOn today's show, I'll be discussing how choosing to lose weight while facing adversity or a life challenge can create a platform for success.\r\n\r\nHow to avoid getting caught up living in your past success or failures. And, what how to use the challenges of your day to day life from being a hinderance to into to being tools for massive success.\r\n\r\nJoin me on today's show.\r\n\r\nI'll be also live streaming this via video on my HCG Body Boot Camp Fan Page!\r\n\r\nClick HERE to watch LIVE!\r\n\r\nSee you tonight at 6:00PM PST\r\n\r\nLove Ya,\r\n\r\nColin\r\n",
            "length": "86453731",
            "sourceUrl": "https://www.blogtalkradio.com/thehcgdietcoach/2015/04/24/how-losing-weight-in-the-face-of-adversity-can-create-a-platform-for-success.mp3",
            "categories": [
                {
                    "_": "Health",
                    "$": {
                        "domain": "https://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "How To  Dominate Your Double Unders - With CrossFit Expert Robby Blanchard",
            "datePublished": "Mon, 16 Mar 2015 17:00:00 GMT",
            "description": "How To  Dominate Your Double Unders - With CrossFit Expert Robby Blanchard\r\n\r\nRobby Blanchard is the Owner of CrossFit Reach and Reach Athletics LLC.\r\n\r\nHe has over 8 year of experience in the fitness industry as a Coach, Trainer, Competitor and Gym Owner.\r\n\r\nRobby holds a Bachelor's in Exercise Science from Fitchburg State University along with a Masters in Business Administration.\r\n\r\nHe is a L1 CrossFit trainer and hold a CrossFit Strongman and Olympic Lifting Certifications.\r\n\r\nRobby is a USAW-Level 1 coach and run's Reach Barbell Club, one of only a few sanctioned USAW gyms in Massachusetts.\r\n\r\nRobby is also the creator of Dominate Your Double Unders and Perfect your pullups training systems\r\n\r\nIf you'd lie to learn more about Robby B's products and services, go to http://crossfitreach.com/\r\n",
            "length": "44470149",
            "sourceUrl": "https://www.blogtalkradio.com/thehcgdietcoach/2015/03/16/how-to-dominate-your-double-unders--with-crossfit-expert-robby-blanchard.mp3",
            "categories": [
                {
                    "_": "Health",
                    "$": {
                        "domain": "https://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "My Conversation with Author of The 7 Minute Millionaire - Tony Neumeyer",
            "datePublished": "Wed, 18 Feb 2015 23:00:00 GMT",
            "description": "How to attain success in all areas of your life including financial, business, relationships, health and more.\r\n\r\nLearn From Someone That Has Done It, Taught It & Lived It!\r\n\r\nTony Neumeyer has spoken on stages internationally, with people such Mark Victor Hansen, Bob Proctor, Doug Wead and more. He has coached and trained thousands of people utilizing the techniques he used to achieve remarkable success as a professional entrepreneur. He was awarded an honorary doctorate degree from the Canyonville Christian Academy for his contributions and speaking.\r\n\r\nIt was shortly after his son was born in the early 90s he discovered the secrets that propelled him to earn $600,0000.00 in a single day and earn millions of dollars in several areas. Tony has trained, advised and worked with people to help them change their lives and earn millions of dollars. Specifically, Tony doesn’t just teach people how to achieve their dreams he actually programs you with habits of success using, in part, what he calls PPMs, Personal Programing Messages.\r\n\r\nTony’s success techniques programs you for accelerated achievement so you can obtain all of your aspirations and goals. These techniques make achievement simpler and keeps you on track if you have had trouble doing so in the past. You really can become financially free using his step by step process and attain success in all areas of your life including financial, business, relationships, health and more.\r\n\r\nHis courses are not fluff; be prepared to do some work.\r\n\r\nPrepare to live your dreams!\r\n\r\nwww.the7minuatemillionaire.com\r\n\r\nYou're not going to want to miss this podcast.\r\n",
            "length": "57032748",
            "sourceUrl": "https://www.blogtalkradio.com/thehcgdietcoach/2015/02/18/my-conversation-with-author-of-the-7-minute-millionaire--tony-neumeyer.mp3",
            "categories": [
                {
                    "_": "Health",
                    "$": {
                        "domain": "https://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "Finding Your \"Authentic Beauty & Strength.\" With Ashley Drummonds",
            "datePublished": "Fri, 30 Jan 2015 22:00:00 GMT",
            "description": "Finding Your \"Authentic Beauty & Strength.\" With Ashley Drummonds\r\n\r\nFor a long time I was pursuing what everybody wants, and that is to have \"abs\".\r\n\r\nI did the whole egg whites, broccoli, chicken, bland foods to prepare for photo  and video and shoots, I would lose weight, but I was miserable and hated eating!\r\n\r\nEvery single time I would have to prepare for a photo shoot, I knew I would have to return to 5 egg whites,1/2 cup oats, broccoli, chicken, etc.\r\n\r\nI love doing my photo shoots, but hated the meal prep involved in getting the look and body composition I wanted.\r\n\r\nSo I would find myself having to count the days until my next \"cheat meal\".\r\n\r\nAfter A LOT of testings, I finally created the first Vanilla Cake Batter  Pancake and was hooked!\r\n\r\nI ate these every morning instead of the traditional \"diet foods\" I normally would eat to prepare for my photo shoots. I ending up not only feeling better, but looking leaner and stronger for this shoot then the one prior!\r\n\r\nI decided to turn ABS pancakes into a product in order to help other men and women find an easier way to stick to a nutrition plan without feeling deprived, or like they're always dieting! :)\r\n\r\nThe ABS name is an acronym for \"Authentic Beauty & Strength\" because I found my \"authentic\" path. I found something that works for me and my lifestyle.\r\n\r\nI believe each person has their unique beauty and strength, and this brand is what represents that; so this is the philosophy behind ABS Pancakes. Our tag line, \"I got my ABS eating Pancakes\" came from my personal success achieving my ABS, and my journey helped me fully embrace and find my own \"Authentic Beauty & Strength\" :)\r\n\r\nAshley Drummonds,\r\n\r\nIf you would like to try ABS Pancakes Click Here!\r\n\r\n \r\n",
            "length": "38672637",
            "sourceUrl": "https://www.blogtalkradio.com/thehcgdietcoach/2015/01/30/finding-your-authentic-beauty-strength-with-ashley-drummonds.mp3",
            "categories": [
                {
                    "_": "Health",
                    "$": {
                        "domain": "https://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "Are Your Hormones Stopping You From Losing Weight? - HRT Expert Dr Judi G.",
            "datePublished": "Thu, 22 Jan 2015 02:00:00 GMT",
            "description": "Hormones and Weight Loss - HRT Expert Dr Judi Goldstobne.\r\n\r\nToday's re-broadcast show:\r\n\r\nMy interview with Bio-Identical hormone replacement expert Dr Judi Goldstobne. We Will discuss the benefits of the HCG diet and how to use it to fight the aging process..\r\n\r\nJayne and I used Dr. Goldstone for more than four years now and have experienced first hand the benefits of HRT with the HCG diet.\r\n\r\nListen to this call, and you may discover why you're having difficulties losing weight or keeping it off for life.\r\n\r\n \r\n\r\nEnjoy,\r\n\r\nColin\r\n",
            "length": "19107422",
            "sourceUrl": "https://www.blogtalkradio.com/thehcgdietcoach/2015/01/22/are-your-hormones-stopping-you-from-losing-weight--hrt-expert-dr-judi-g.mp3",
            "categories": [
                {
                    "_": "Health",
                    "$": {
                        "domain": "https://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "New health and Wellness Approach: Old Meets New- with  KJ Landis",
            "datePublished": "Tue, 06 Jan 2015 02:00:00 GMT",
            "description": "New health, wellness approach: Old Meets New with KJ Landis\r\n\r\nMy good friend and Author KJ Landis knows how healthy eating, a support system, inspiration, and motivation are to both the body and the mind. Through research, a strict clean eating protocol, and mindful attention to her intention, KJ lost 50 pounds in just 60 days following our HCG Body for Life protocol.\r\n\r\nShe has since vowed to pass on her knowledge to others in her newly authored book, podcast, and video.\r\n\r\nOne of my brightest and most successful coaching students returns to share the vast knowledge she had gain since her transformation.\r\n\r\nKJ Landis’ new lifestyle guide, “Superior Self: Reaching Superior Health for a Superior Self” (published by Balboa Press), is her chosen method of paying it forward. The book reveals how Landis lost so much fat so quickly by healing herself through nutrition and tapping into her higher power.\r\n\r\n“Superior Self” helps people learn why they eat what they eat, assures them that it is not their fault if they choose less-than-vital foods, and then assists in educating them in healthier choices.\r\n\r\nKJ explains the ancient primal ways of eating and provides basic macronutrient and micronutrient guides.She outlines her nine-step program; Superior Self's Guide to Wellness from Within, which will help you dramatically improve their minds, body, and spirits, through a simple weekly elimination process.\r\n\r\nPlease join KJ and Myself Monday night at 6:00PM PST to discover how to achieve your Superior Self.\r\n",
            "length": "86655187",
            "sourceUrl": "https://www.blogtalkradio.com/thehcgdietcoach/2015/01/06/new-health-and-wellness-approach-old-meets-new-with-kj-landis.mp3",
            "categories": [
                {
                    "_": "Health",
                    "$": {
                        "domain": "https://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "Your Words Have Power Part II - How To Stop Talking Yourself Fat",
            "datePublished": "Fri, 19 Dec 2014 02:00:00 GMT",
            "description": "Join me Thursday December 18th at 6:00 PM PST\r\n\r\nFor part two of “Ask me anything HCG” and discover why the words you speak, and the thoughts that consume your mind are what's really hindering your weight loss success.\r\n\r\nHow to change the conversation in your mind to create mind-blowing fat loss results NOW!\r\n\r\nJoin me, call in, or email me your questions.\r\n\r\nWe'll also announce the winners of last week’s LIVE coaching call.\r\n\r\nSee you here!\r\n\r\nColin\r\n",
            "length": "86904709",
            "sourceUrl": "https://www.blogtalkradio.com/thehcgdietcoach/2014/12/19/your-words-have-power-part-ii--how-to-stop-talking-yourself-fat.mp3",
            "categories": [
                {
                    "_": "Health",
                    "$": {
                        "domain": "https://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "Ask Me Anything HCG-LIVE Coaching Call",
            "datePublished": "Thu, 11 Dec 2014 02:00:00 GMT",
            "description": "Its time to get back to doing what I love best and that's solving your HCG diet protocol problems. I want you to have a place you can come every week to help you stay on track and reach your goal.\r\n\r\nFREE COACHING WEKLY WINNER:\r\n\r\nEvery week a  new caller  who calls in live or sends in a their question via email.  Will win a free 45 minute one-on-one coaching session we me. \r\n\r\nDuring this session we’ll peal back the onion and reveal what’s been stopping you from reaching your weight loss goals, and put together a custom game plan for success. ($150 VALUE.)\r\n\r\nHow would you like to get rid of your limiting beliefs about your weight?\r\n\r\nHow would you like to increase your self-dialog so that you could shed as much weight as you wanted easily and effortlessly any time you wanted under any circumstances?\r\n\r\nWould your weight loss success be different if you had the ability to achieve your desired outcome each and every time?\r\n\r\nIf you want to know the answers to this and more… Join on this weeks coaching call.\r\n\r\nThe majority of my private clients are shocked to discover what's REALLY has been getting in their way achieving success each and every time they attempt to lose weight successfully.\r\n\r\nOnce you know what's blocking you... There is nothing that can stop you!!\r\n\r\nMake sure you call in LIVE and participate... Ask you're pressing question, get back on track, and show up for you.\r\n\r\nThen, WATCH the magic happen!\r\n\r\nSee you Wednesday December 10th 6:00PM PST\r\n\r\n \r\n\r\n \r\n",
            "length": "86885483",
            "sourceUrl": "https://www.blogtalkradio.com/thehcgdietcoach/2014/12/11/ask-me-anything-hcg-live-coaching-call.mp3",
            "categories": [
                {
                    "_": "Health",
                    "$": {
                        "domain": "https://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "Ask Me Anything HCG Part II",
            "datePublished": "Thu, 17 Jul 2014 01:00:00 GMT",
            "description": "On today's show we will continue where we left off last show answering your questions you sent in via email. We will then open the line for our live Q & A session. Bring your questions, any current issues you may be having on protocol now, and of course your enthusiasm as we tackle your most pressing HCG diet issues.\r\n\r\nTalk to you soon,\r\n\r\n \r\n\r\nColin\r\n\r\n \r\n",
            "length": "27535520",
            "sourceUrl": "https://www.blogtalkradio.com/thehcgdietcoach/2014/07/17/ask-me-anything-hcg-part-ii.mp3",
            "categories": [
                {
                    "_": "Health",
                    "$": {
                        "domain": "https://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "Your Top Three HCG Diet Problems Revealed...",
            "datePublished": "Thu, 03 Jul 2014 01:00:00 GMT",
            "description": "Hello listeners, A few weeks ago I sent out an email to my list and asked the question...\r\n\r\n\"What Do You Want To Know About HCG Diet Weight Loss?\"\r\n\r\nToday and over the next few weeks we are going to answer each and every question I received in order to put together a series of Q and A podcast for you to revisit for future reference.\r\n\r\nSo if you're slightly curious about what are the top three HCG diet problem you’ve said that is getting in your way of success, then we've chosen three of the to cover for this week radio show podcast.\r\n\r\nJoin me tonight ad 6:00PM PST and I'll provide you with my answerss and my unique perspective as the worlds No. 1 HCG Diet Coach.\r\n\r\nSee you tonight!\r\n\r\nColin\r\n\r\n \r\n",
            "length": "21473120",
            "sourceUrl": "https://www.blogtalkradio.com/thehcgdietcoach/2014/07/03/your-top-three-hcg-diet-problems-revealed.mp3",
            "categories": [
                {
                    "_": "Health",
                    "$": {
                        "domain": "https://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "The Begginers Mind... How To Win at Losing Weight",
            "datePublished": "Thu, 22 May 2014 01:00:00 GMT",
            "description": "  \r\n\r\nIn this episode of HCG Body Talk, I will discuss a powerful mindset that anyone can learn that will finally teach you how to win the game of losing weigh once and for all.\r\n\r\nThis simple but powerful technique could be the one fundinmental tool you need to help you achieve the body of your life bofore summer.\r\n\r\nIf you've had multipal failed attemps at losing weight ewith the HCG diet protocol, and want to finally have a breakthrough to help you reach your goal weight. Then make sure to tune into this show and hear this simple secret as I reveal it live.\r\n\r\nSee you there,\r\n\r\n \r\n\r\nMuch Love,\r\n\r\nColin\r\n\r\n  \r\n",
            "length": "13158560",
            "sourceUrl": "https://www.blogtalkradio.com/thehcgdietcoach/2014/05/22/the-begginers-mind-how-to-win-at-losing-weight.mp3",
            "categories": [
                {
                    "_": "Health",
                    "$": {
                        "domain": "https://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "Phase 3-2.0 Revealed... How To Easily Stabilize In Phase 3",
            "datePublished": "Thu, 08 May 2014 01:00:00 GMT",
            "description": "Hello HCG Body for Life Tribe,\r\n\r\nOn todays show, I will be revealing the results of the ALL NEW HCG Body for Life Phase 3-2.0.\r\n\r\nI feel comfortable with the feedback that this groundbreaking information can now be revealed to our entire HCG-BFL Family.\r\n\r\nSo if you want to be in the know, and be one of the first to experience the power of P3-2.0 you wont want to miss this call.\r\n\r\nWhat will P3-2.0 Do for you?\r\nEasily Stabilize You Weight.Burn more body fat while in P3.Shut down your body’s ability to store body fat.Lose up to 10 additional pounds of fatEat Any Food You Want.Break free from counting calories\r\nSee you tonight!\r\n\r\nLove ya,\r\n\r\nColin\r\n\r\n \r\n",
            "length": "21594080",
            "sourceUrl": "https://www.blogtalkradio.com/thehcgdietcoach/2014/05/08/phase-3-20-revealed-how-to-easily-stabilize-in-phase-3.mp3",
            "categories": [
                {
                    "_": "Health",
                    "$": {
                        "domain": "https://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "Ask Me Anything HCG Diet... 2014",
            "datePublished": "Thu, 13 Mar 2014 01:00:00 GMT",
            "description": "Join Me On The Radio…\r\n\r\nEvery year we have several shows dedicated to answering those questions many of you just can't seem to find the answers to, or simply want to know my unique HCG Body for Life approach/perspectives to the different phases of the advanced HCG diet protocol.\r\n\r\nWe \"Ask Me Anything HCG\" is your opportunity to ask that burning question you've just got to get the answer to...\r\n\r\nSo call in, join the fun, ask the questions, and I do my best to give you my unique perspective...\r\n\r\nSee you there live on Wednesday March 5th at 6:00PM PST\r\n\r\nChow for now,\r\n\r\nColin\r\n\r\nThe HCG Diet Coach\r\n\r\n \r\n",
            "length": "22008224",
            "sourceUrl": "https://www.blogtalkradio.com/thehcgdietcoach/2014/03/13/ask-me-anything-hcg-diet-2014.mp3",
            "categories": [
                {
                    "_": "Health",
                    "$": {
                        "domain": "https://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "My First Radio Podcast Of 2014... What On My Mind?",
            "datePublished": "Thu, 06 Feb 2014 02:00:00 GMT",
            "description": "\r\n\r\nI've received several emails asking me when I was going to get back on the radio and re-connect with my HCG Body for Life Tribe...\r\n\r\nWell today is that day...\r\n\r\nI a recent survey I sent out to the members of my email list when ask specific questions about their weight loss journeys...\r\n\r\n47.40% of you said that they've been trying to lose weight and get in shape for their entire lives...\r\n\r\n48.88% of you said that you have attempted to lose weight and failed more than 10 times...\r\n\r\n67.71 % of you said that your #1 problem was losing fat...\r\n\r\n78.65% of you said you were ready to do whatever it took to lose the weight this year...\r\n\r\nSo if this is how you feel... Then I want you to join me tonight and share with me what is stopping you?\r\n\r\nWhat is holding you back?\r\n\r\nWhat do you need right now to get on the other side of this once and for all?\r\n\r\nJoin me tonight LIVE for my first radio shows podcast of 2014!\r\n\r\nLet's have a breakthrough moment.... What do you say?\r\n\r\nSee you tonight,\r\n\r\nLove ya,\r\n\r\nColin\r\n\r\n \r\n",
            "length": "21614816",
            "sourceUrl": "https://www.blogtalkradio.com/thehcgdietcoach/2014/02/06/my-first-radio-podcast-of-2014-what-on-my-mind.mp3",
            "categories": [
                {
                    "_": "Health",
                    "$": {
                        "domain": "https://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "How To Use Your Favorite Quotes To Inspire HCG Diet Success",
            "datePublished": "Thu, 31 Oct 2013 01:00:00 GMT",
            "description": " Trick or Treat!! Favorite quotes and how they can motivate us on our Hcg journey:\r\n\r\n Join us October 30, 2013 at 6 pm PST for treats from our favorite motivators.\r\n We will share with you the quotes that have influenced our lives from authors, songs, speakers, and how it can be applied to help youi reach, your goals in life, and achiev HCG diet Success!\r\n Bring one of your favorite quest to the show and share how it has help you to achieve success in your life or HCG diet journey!\r\n Q & A session after the show!\r\n  \r\nColin Watson and KJLandis\r\n",
            "length": "21607616",
            "sourceUrl": "https://www.blogtalkradio.com/thehcgdietcoach/2013/10/31/how-to-use-your-favorite-quotes-to-inspire-hcg-diet-success.mp3",
            "categories": [
                {
                    "_": "Health",
                    "$": {
                        "domain": "https://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "Phase 4 Life Recipe Book creators Joe and Heather Julliani",
            "datePublished": "Thu, 17 Oct 2013 01:00:00 GMT",
            "description": " On this segment of HCG Body Talk I have my special guest and good friends Heather and Joe Juliani.\r\n\r\n Heather and Joe on my request put together an awesome new phase for recipe book for those you following our HCG Body for life protocol or who just don't know how or what to eat after P3.\r\n\r\n Phase 4 Life- Life's A Journey Not A Diet\r\n\r\n Is really for anyone's phase 4 of life. Simply meaning what to  eat when all the dieting is over and want to keep what you've  achieved... The body of my life.\r\n\r\n We'll be discussing why the biook, what's in it, how to use it, and how to be the first to get it...\r\n Phase 4 Life- Life's A Journey Not A Diet...\r\n Join us on this call\r\n  \r\n See you there,\r\n  \r\n Colin, Jayne, Joe and Heather\r\n P.S. I'll also be discussing our upcoming NEW HCG 90 day challenge.. 1 Million Pound March-90 Day Transformation Challenge!\r\n",
            "length": "18979904",
            "sourceUrl": "https://www.blogtalkradio.com/thehcgdietcoach/2013/10/17/phase-4-life-recipe-book-creators-joe-and-heather-julliani.mp3",
            "categories": [
                {
                    "_": "Health",
                    "$": {
                        "domain": "https://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "Secret Underground Eating Alternative For A Healthier You",
            "datePublished": "Thu, 26 Sep 2013 01:00:00 GMT",
            "description": " Secret Underground Eating Alternative For A Healthier You\r\n On this episode of HCG Body Talk Radio - My co-host KJ Landis will reveal secret underground eating alternative for healing the body, prevent disease, and achieving superior health...\r\n How these strategies keep pointing back to our HCG Body for Life way of eating, and how you can easily integrate this way if eating into your lifestyle to creating your superior self!!\r\n\r\n Thanks in advance to KJ for hosting the show...\r\n See you there,\r\n  \r\n Colin\r\n",
            "length": "21478632",
            "sourceUrl": "https://www.blogtalkradio.com/thehcgdietcoach/2013/09/26/secret-underground-eating-alternative-for-a-healthier-you.mp3",
            "categories": [
                {
                    "_": "Health",
                    "$": {
                        "domain": "https://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "How I Lost100lb Loss In 8 Months With HCG",
            "datePublished": "Thu, 19 Sep 2013 01:00:00 GMT",
            "description": " HCG Rapid Weight Loss – Celebrating a 100lb Loss w/HCG Body for Life\r\n Today I just wanted to share with everyone that I have lost 100lbs by usingHCG Body for Life program.  I am so thankful for the guidance I have been given.  \r\n For God giving me the vision to keep seeking until I found a product that worked and for Colin F. Watson CEO of HCG Body for Life.  \r\n Without him I would have thought HCG was just another gimmicky weight loss program that did not work for me.\r\n Join Us on This Call If you want to know how to lose 100Lbs or more in just a few short months...\r\n  \r\n See you then,\r\n Colin\r\n",
            "length": "17366123",
            "sourceUrl": "https://www.blogtalkradio.com/thehcgdietcoach/2013/09/19/how-i-lost100lb-loss-in-8-months-with-hcg.mp3",
            "categories": [
                {
                    "_": "Health",
                    "$": {
                        "domain": "https://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "Why HCG Works and Is A Game Changer... w/ Guest KJ Landis",
            "datePublished": "Wed, 04 Sep 2013 01:00:00 GMT",
            "description": " This is going to be a great show with my special guest KJ Landis..\r\n Kimberly \"KJ\" Landis is by far one of HCG Body for Life's best success stories!\r\n The show today will focus on real life after HCG, tips and tricks with food and exercise and supplements to keep you at peak health for a long time, and spiritual discoveries along the way...\r\n It changes the paradigm of everything we thought we knew about diet and exercise in the last century. That's why it was kicked out of the USA and Simeons had to live in Italy to continue his life's work.\r\n There will be so many new HCG diet tips revealed on this show, you Don't Want To Miss This Call!\r\n  \r\n See you there!\r\n  \r\n Colin, Jayne and KJ\r\n",
            "length": "21992304",
            "sourceUrl": "https://www.blogtalkradio.com/thehcgdietcoach/2013/09/04/why-hcg-works-and-is-a-game-changer-w-guest-kj-landis-1.mp3",
            "categories": [
                {
                    "_": "Health",
                    "$": {
                        "domain": "https://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "TODAY'S Show 6:00 PM PST- Ask Me Anything HCG... ",
            "datePublished": "Fri, 28 Jun 2013 01:00:00 GMT",
            "description": "HCG Body Talk - Ask Me Anything HCG... 11/28 5:30 PST\r\nby The hCG Diet Coach\r\nThursday, June 27, 2013 05:30PM PST\r\n  \r\nCall in to speak with the host (347) 994-1727\r\nMy Ask Me Anything HCG show are quite popular, because people get an opportunity to get real answers to real HCG diet questions. Without the hype or conjecture. This show will be no different. So if you want answers to your pressing HCG diet questions, join me on this call.\r\nAnd remember... The only stupid quest is the one that went unasked and subsequently unanswered.\r\nJoin My on Google Hangout \"Here\"!\r\nIf you cant make the live show then send me your questions in advance by email at colin@colinfwatson.com or simply hit \"Reply\" and write in your question...\r\nSee you there! \r\nAll the best,\r\n  \r\nColin",
            "length": "21697643",
            "sourceUrl": "https://www.blogtalkradio.com/thehcgdietcoach/2013/06/28/todays-show-600-pm-pst-ask-me-anything-hcg.mp3",
            "categories": [
                {
                    "_": "Health",
                    "$": {
                        "domain": "https://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "I Discovered A Problem With The HCG Diet... Oh My!",
            "datePublished": "Fri, 24 May 2013 00:30:00 GMT",
            "description": " On this show I will reveal a new fatal flaw in the HCG diet protocol that is causing havoc with HCG dieters worldwide. What it is, how to handle it, and what to do to fix the problem. This is not a show you want to miss.\r\n Believe me!\r\n  \r\n See you there!\r\n Colin\r\n",
            "length": "21441225",
            "sourceUrl": "https://www.blogtalkradio.com/thehcgdietcoach/2013/05/24/i-discovered-a-problem-with-the-hcg-diet-oh-my-god.mp3",
            "categories": [
                {
                    "_": "Health",
                    "$": {
                        "domain": "https://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "HCG Body Talk -Ask Me Anything HCG",
            "datePublished": "Fri, 10 May 2013 00:30:00 GMT",
            "description": " Have questions about Phases 1,2 3 or 4 of the HCG diet...? Join me on this call and Ask me anything HCG...\r\n This show is where you want to be if you have questions about the HCG diet protocol. So join me on this call and finally get those nagging questions answered. This is where you learn the fastest way to get, the Body Of Your Life!\r\n",
            "length": "17805816",
            "sourceUrl": "https://www.blogtalkradio.com/thehcgdietcoach/2013/05/10/hcg-body-talk-ask-me-anything-hcg.mp3",
            "categories": [
                {
                    "_": "Health",
                    "$": {
                        "domain": "https://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "Why Timing Is Everything, Are You Re",
            "datePublished": "Thu, 25 Apr 2013 00:30:00 GMT",
            "description": " TODAY'S Show 5:30PST - Why Timing Is Everything, Are You Really Ready To Lose Weight\r\n On today's show, to discuss the importance of timing as it pertains to creating a space for hCG diet success.\r\n\r\n I'll also be discussing how to know when you're really ready to lose weight, or if you're just posturing…\r\n\r\n Knowing when to move forward and went to take pause, could make your journey or weight loss goals either very easy, or next to impossible to achieve.\r\n\r\n Johnny on today's call and help me explore these topics. I'll also be making some pretty exciting announcements…!\r\n\r\n See you soon,\r\n\r\n Colin\r\n",
            "length": "19608683",
            "sourceUrl": "https://www.blogtalkradio.com/thehcgdietcoach/2013/04/25/why-timing-is-everything-are-you-re.mp3",
            "categories": [
                {
                    "_": "Health",
                    "$": {
                        "domain": "https://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "The Secret HCG Diet Success Formula You're Missing Out On",
            "datePublished": "Thu, 04 Apr 2013 00:30:00 GMT",
            "description": " The Secret HCG Diet Success Formula You're Missing Out On...\r\n And the worst part is, it's absolutely FREE! On this call I' disclosing for the first time the #1 HCG diet success formula, that's absolutely free, and it will increase you're HCG diet success 110%.\r\n This is a system that a few of my biggest success stories discovered, used, and now share with their own coaching client to help them achieve amazing HCG diet success.\r\n I'll show you how to tap into this free HCG diet success system so you can increase your HCG diet success, and help other do the same.\r\n Talk to you then,\r\n Colin\r\n",
            "length": "15922492",
            "sourceUrl": "https://www.blogtalkradio.com/thehcgdietcoach/2013/04/04/the-secret-hcg-diet-success-formula-youre-missing-out-on.mp3",
            "categories": [
                {
                    "_": "Health",
                    "$": {
                        "domain": "https://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "Why you haven't been able to lose like your first HCG round!",
            "datePublished": "Thu, 21 Mar 2013 00:30:00 GMT",
            "description": " Why you haven't been able to lose like your first HCG round!\r\n The No. #1 complaint I hear is \"Why am I not losing like I did on my first HCG diet round?\" There is a real reason why each subsequent HCG round seems to be more challenging... On this show I will disclose the secret to achieving amazing results on any subsequent round of HCG and what it takes to reach your ideal body weight.\r\n Join me on today's call and finally get that \"Ah Ha\" Moment...!\r\n See you there...!\r\n",
            "length": "21656474",
            "sourceUrl": "https://www.blogtalkradio.com/thehcgdietcoach/2013/03/21/why-you-havent-been-able-to-lose-like-your-first-hcg-round.mp3",
            "categories": [
                {
                    "_": "Health",
                    "$": {
                        "domain": "https://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "Does The HCG Diet Really Produce Perminent Weight Loss...?",
            "datePublished": "Thu, 07 Mar 2013 01:30:00 GMT",
            "description": "On today's show we'll explore if permanent weight loss is actually possible, or is this another Yo-Yo diet in disguise. \r\nJoin me on todays call to discuss this topic and more...\r\nSee you there!\r\nColin\r\n",
            "length": "21285953",
            "sourceUrl": "https://www.blogtalkradio.com/thehcgdietcoach/2013/03/07/does-the-hcg-diet-really-produce-perminent-weight-loss.mp3",
            "categories": [
                {
                    "_": "Health",
                    "$": {
                        "domain": "https://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "HCG Underground Coaching Call #3",
            "datePublished": "Sat, 23 Feb 2013 02:00:00 GMT",
            "description": " This is a private call for HCG Underground members only... If you are not a current member please do not join this call. We'll be discussing breaking through previous weight set point stalls, fluctuation in weight and how you attitude will determine your outcome!\r\n Also, we'll have an extensive Q and A session for members.\r\n See you  here!\r\n Colin\r\n",
            "length": "11653039",
            "sourceUrl": "https://www.blogtalkradio.com/thehcgdietcoach/2013/02/23/hcg-underground-coaching-call-3.mp3",
            "categories": [
                {
                    "_": "Health",
                    "$": {
                        "domain": "https://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "HCG Diet and Exercise- What works and what doesn't!",
            "datePublished": "Thu, 14 Feb 2013 01:30:00 GMT",
            "description": "While on the HCG diet phase 2, not all exercise is created equal. Today I will discuss the best exercises for phase 2 that maximize fat loss and yield huge dividends in the quest to drop pounds and inches.\r\n\r\nWhat's too little and, what is too much exercise that can cause stalls, weight gain, hunger, and fatigue.\r\n\r\nJoin me on my next live call as we cover these topics.\r\n\r\nSee you there,\r\n\r\nColin",
            "length": "14731935",
            "sourceUrl": "https://www.blogtalkradio.com/thehcgdietcoach/2013/02/14/hcg-diet-and-exercise-what-works-and-what-doesnt.mp3",
            "categories": [
                {
                    "_": "Health",
                    "$": {
                        "domain": "https://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "hCG Body Talk - HCG Underground Coaching Call #2",
            "datePublished": "Thu, 07 Feb 2013 02:00:00 GMT",
            "description": " This is an exclusive call for HCG Underground Revolution members only!\r\n On this call we will be going over the modules and discussing what challenges you may be experiencing during phase 2 or phase 3.\r\n We will also be discussing how best to participate in the coaching program to increase your success and how to laser in on your final weight loss goals.\r\n The second part of the call will be an open forum to discuss anything and everything HCG.\r\n See you on the member only call.\r\n Regards,\r\n  \r\n Colin\r\n",
            "length": "17844059",
            "sourceUrl": "https://www.blogtalkradio.com/thehcgdietcoach/2013/02/07/hcg-body-talk--hcg-underground-coaching-call-2-1.mp3",
            "categories": [
                {
                    "_": "Health",
                    "$": {
                        "domain": "https://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "HCG Body Talk -Ask Me Anything HCG",
            "datePublished": "Thu, 31 Jan 2013 01:30:00 GMT",
            "description": " Today's show topic \"Ask Me Anything HCG\" is for those of you whom have pressing HCG diet questions for which you've either had difficulties finding the answers to, or would simply like another opinion...\r\n This is your opportunity to get the facts... Join me on todays call and I'll do my very best to get all of your questions answered. If you can't make the show live, then email your questions to me ASAP to Colin@ColinFWatson.com.\r\n See you tonight!\r\n Colin\r\n",
            "length": "19114446",
            "sourceUrl": "https://www.blogtalkradio.com/thehcgdietcoach/2013/01/31/hcg-body-talk-ask-me-anything-hcg.mp3",
            "categories": [
                {
                    "_": "Health",
                    "$": {
                        "domain": "https://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "HCG UNdergroud Group Call #1",
            "datePublished": "Thu, 24 Jan 2013 02:00:00 GMT",
            "description": " On this show we'll meet the team members of HCG Underground revolution this will be a private call for members only. We will cover the site content and have a extended Q & A session.\r\n  \r\n See you there!\r\n  \r\n Colin\r\n",
            "length": "19277868",
            "sourceUrl": "https://www.blogtalkradio.com/thehcgdietcoach/2013/01/24/hcg-undergroud-group-call-1-1.mp3",
            "categories": [
                {
                    "_": "Health",
                    "$": {
                        "domain": "https://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "Why 88% Of You Will Dump New Years Weight Loss Resolutions ",
            "datePublished": "Thu, 03 Jan 2013 01:30:00 GMT",
            "description": " On my first show of 2013, I want to discuss Power of intention vs New Years Resolutions...\r\n The definition of Resolution means to resolve again... If you are truly looking to have a powerful and successful 2013 in all aspects of your life. Then consider invoking your \"Power of Intention\"\r\n On today's show we'll explore creating a strong and effective power of intention to not only achieve excellent health, vitality, and prosperity... But how to use it to manifest the body of your life in the next 90 days!\r\n Join me on this eye opening call.\r\n\r\n\r\n\"If you can dream it, then you can achieve it. You will get all you want in life if you help enough other people get what they want.\"   Zig Ziglar\r\n",
            "length": "15084483",
            "sourceUrl": "https://www.blogtalkradio.com/thehcgdietcoach/2013/01/03/dump-new-years-resolutions-do-this-to-lose-weight-in-2013.mp3",
            "categories": [
                {
                    "_": "Health",
                    "$": {
                        "domain": "https://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "The 12 Most Important Days of The HCG Diet... Do you know?",
            "datePublished": "Thu, 13 Dec 2012 01:30:00 GMT",
            "description": " Most HCG dieter start their HCG journey without these 12 crucial keys for success... These 12 days need to be implemented before you start the protocol to ensure your success. No one ever talks about them... Most people don't know them... and why you should attempt the diet without doing them...!\r\n Join me on today's call and discover the 12 most important days of the HCG diet!\r\n See you there!\r\n  \r\n Colin\r\n",
            "length": "15279879",
            "sourceUrl": "https://www.blogtalkradio.com/thehcgdietcoach/2012/12/13/the-12-most-important-days-of-the-hcg-diet-do-you-know.mp3",
            "categories": [
                {
                    "_": "Health",
                    "$": {
                        "domain": "https://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "hCG Body Talk - Ask Me Anything HCG... 11/28 5:30 PST",
            "datePublished": "Thu, 29 Nov 2012 01:30:00 GMT",
            "description": " My Ask Me Anything HCG show are quite popular, because people get an opportunity to get real answers to real HCG diet questions. Without the hype or conjecture. This show will be no different. SO if you want answers to your pressing HCG questions, join me on this call.\r\n And remember... The only stupid quest is the one that went un-asked and subsequently un-answered.\r\n If you can't make the live show then send me your questions in advance by email at colin@colinfwatson.com\r\n See you there!\r\n  \r\n All the best,\r\n  \r\n Colin\r\n",
            "length": "21313329",
            "sourceUrl": "https://www.blogtalkradio.com/thehcgdietcoach/2012/11/29/hcg-body-talk--ask-me-anything-hcg-1128-530-pst-1.mp3",
            "categories": [
                {
                    "_": "Health",
                    "$": {
                        "domain": "https://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "HCG Diet Phase 4 Discover how to Eat to Live. Rather than...",
            "datePublished": "Thu, 08 Nov 2012 01:30:00 GMT",
            "description": " Phase 4 of the HCG diet. By HCG Body for life we believe in the premise \"Eat To Live\" Not Live To Eat..\r\n On this call we will you'll discover how to know which foods you body loves, and which foods you must avoid in order to keep you new found health and body. Our phase 4 helps you create a comprehensive personal game plan designed just for you... \r\n No other HCG diet plan goes into this much dept on how you can lock in your weight set point for life. I'll reveal the  two simple trick I use to keeping my body weight with 2 to 5 pounds of my end weight.\r\n Join me on this call, see you there,\r\n  \r\n Colin\r\n  \r\n  \r\n",
            "length": "14074276",
            "sourceUrl": "https://www.blogtalkradio.com/thehcgdietcoach/2012/11/08/hcg-diet-phase-4-discover-how-to-eat-to-live-rather-than.mp3",
            "categories": [
                {
                    "_": "Health",
                    "$": {
                        "domain": "https://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "Why your relationships can make or break your diet success!",
            "datePublished": "Thu, 18 Oct 2012 00:30:00 GMT",
            "description": " The topic of today's radio show podcast is... Why your relationships can make or break your diet success!\r\n Many of us often fail to realize the impact our decision to lose weight can have on our relationships and circle of influence.\r\n Being blindsided by unexpected backlash from your friends, coworkers, and family members, can have  devastating impact on your decision to change you body and your; often sabotage your weight loss success.\r\n Today I'll discuss some tips that hopefully will help you to make sure that you and your significant other are on the same page.\r\n Join me on todays show.\r\n See you there,\r\n Colin\r\n",
            "length": "13646913",
            "sourceUrl": "https://www.blogtalkradio.com/thehcgdietcoach/2012/10/18/why-your-relationships-can-make-or-break-your-diet-success-1.mp3",
            "categories": [
                {
                    "_": "Health",
                    "$": {
                        "domain": "https://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "Why Dr. Simeons HCG Protocol Doesn't Work Part 2 Cont...",
            "datePublished": "Thu, 11 Oct 2012 00:30:00 GMT",
            "description": " Why Dr. Simeons HCG Protocol Doesn't Work for the masses.\r\n People often wonder why their HCG diet success seems to diminish dramatically after their very first round of HCG.\r\n Why they experience numerous weight loss stalls during their HCG diet phase 2 rounds.\r\n And, why it seems that some do very well on Dr. Simeons protocol, and why others fail miserably. Today I'll shed some light on why Dr. Simeons HCG protocol delivers diminished results.\r\n Why, living in US automatically creates a problem for dramatic weight loss success using the Simeons HCG diet platform.\r\n Join me on today's call.\r\n See you there...\r\n  \r\n Colin\r\n",
            "length": "21484274",
            "sourceUrl": "https://www.blogtalkradio.com/thehcgdietcoach/2012/10/11/why-dr-simeons-hcg-protocol-doesnt-work-part-2-cont.mp3",
            "categories": [
                {
                    "_": "Health",
                    "$": {
                        "domain": "https://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "hCG Body Talk -Ask me anything HCG",
            "datePublished": "Thu, 04 Oct 2012 00:30:00 GMT",
            "description": " Phase 1, 2, 3 or 4 are open topics for discussion... of the HCG diet... \"The fat loss phase, muscle building and stabilization phase and eating for life phase\" are considered to be the most important phases of the HCG diet Protocol. Learn how to get lean, build muscle, at re-set your weight set point the right way and build your HCG Body For Life!\r\n",
            "length": "10334377",
            "sourceUrl": "https://www.blogtalkradio.com/thehcgdietcoach/2012/10/04/hcg-body-talk-ask-me-anything-hcg.mp3",
            "categories": [
                {
                    "_": "Health",
                    "$": {
                        "domain": "https://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "How to produce consistent HCG diet fat loss results...",
            "datePublished": "Thu, 13 Sep 2012 00:30:00 GMT",
            "description": " Most people often miss out on consistent fat loss results by making these (4) four small mistakes which produce massive frustration and failure among HCG dieters!\r\n  \r\n In this show I will reveal these mistakes and show you how can produce consistent HCG diet fat loss results...\r\n  \r\n See you there!\r\n  \r\n Colin\r\n",
            "length": "19884745",
            "sourceUrl": "https://www.blogtalkradio.com/thehcgdietcoach/2012/09/13/how-to-produce-consistent-hcg-diet-fat-loss-results.mp3",
            "categories": [
                {
                    "_": "Health",
                    "$": {
                        "domain": "https://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "hCG Body Talk -Ask Me Anything HCG ",
            "datePublished": "Thu, 30 Aug 2012 00:30:00 GMT",
            "description": " Today we're going to end the month of August with another show asking anything hCG. Join me on the call and get those tough questions answered once and for all.\r\n\r\n See you there!\r\n",
            "length": "14644999",
            "sourceUrl": "https://www.blogtalkradio.com/thehcgdietcoach/2012/08/30/hcg-body-talk-ask-me-anything-hcg.mp3",
            "categories": [
                {
                    "_": "Health",
                    "$": {
                        "domain": "https://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "hCG Body Talk - Ask Me Anything HCG...",
            "datePublished": "Thu, 02 Aug 2012 00:30:00 GMT",
            "description": " As we begin the month of August 2012, I'd like to start the month off with our highly acclaimed show topic... Ask me anything HCG.\r\n\r\n This gives those of your new to the HCG  diet, and HCG diet veterans an  opportunity to ask those questions that you may have found difficulty finding answers to in the online forums.\r\n\r\n So please join me on the show today as we launch the month of August 2012 and get the answers to your most pressing  HCG diet questions from the HCG Diet Coach…\r\n\r\n I'll see you there, and remembered always Live Life Powerfully!\r\n",
            "length": "20103337",
            "sourceUrl": "https://www.blogtalkradio.com/thehcgdietcoach/2012/08/02/hcg-body-talk--ask-me-anything-hcg.mp3",
            "categories": [
                {
                    "_": "Health",
                    "$": {
                        "domain": "https://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "Replay-HCG Diet Discovery with Kimberly Landis",
            "datePublished": "Thu, 26 Jul 2012 00:30:00 GMT",
            "description": " This is a replay of my interview with Ms. Kimberly Landis, who happens to be one of our best HCG Body for Life pupils.\r\n Kim shares several powerful tips for HCG Body for Life protocol success. So if you missed it live, this is your opportunity to catch the show again.\r\n This tips may just be what you've been looking for in order to finally reach, or surpass your HCG diet goals!\r\n  \r\n Enjoy!\r\n Colin\r\n",
            "length": "15868157",
            "sourceUrl": "https://www.blogtalkradio.com/thehcgdietcoach/2012/07/26/replay-hcg-diet-discovery-with-kinberly-landis.mp3",
            "categories": [
                {
                    "_": "Health",
                    "$": {
                        "domain": "https://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "HCG-EODD-My New Approach To Phase 4 That Rocks!",
            "datePublished": "Thu, 12 Jul 2012 00:30:00 GMT",
            "description": " Phase 4 of the HCG Body for Life protocol has made maintaining lost weight easier than ever for thousands of people... With my NEW HCG EODD approach to phase 4 eating, you may finally discover a way of eating that is easy to do, simple to follow, and will help you maintain your waist line for good!\r\n How would you like to end the summer thinner than when you started?\r\n Join me on the call and discover my never before released secrets to phase 4 success.\r\n  \r\n See you there! \r\n  \r\n Colin\r\n",
            "length": "15868157",
            "sourceUrl": "https://www.blogtalkradio.com/thehcgdietcoach/2012/07/12/hcg-eodd-my-new-approach-to-phase-4-that-rocks.mp3",
            "categories": [
                {
                    "_": "Health",
                    "$": {
                        "domain": "https://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "hCG Body Talk - My Phase 3 Modifications For Success...",
            "datePublished": "Thu, 21 Jun 2012 00:30:00 GMT",
            "description": " The infamous Phase 3  \"The muscle building and stabilization phase\" is considered to be the most important phase of the HCG diet Protocol.\r\n Since I am currently in P3, I thought it would be a good time to cover a few updates, and shed some light on how to stabilize inn P3 and still lose body fat! !\r\n See you there!\r\n Colin\r\n",
            "length": "15272147",
            "sourceUrl": "https://www.blogtalkradio.com/thehcgdietcoach/2012/06/21/hcg-body-talk--my-phase-3-modifications-for-success.mp3",
            "categories": [
                {
                    "_": "Health",
                    "$": {
                        "domain": "https://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "hCG Body Talk - HCG BFL Success Story Ms. Kimberly Landis",
            "datePublished": "Thu, 14 Jun 2012 00:30:00 GMT",
            "description": " Kim lost 33 pounds in 34 days following the HCG Body for Life principals, and  a total 41 pounds in 60 days.\r\n Kim was able to regained her her \"TRUE SELF\"  as she says, which was her  \"BIG Y\" for stating the protocol.\r\n In the 90's Kim was a fashion model who like many of us woke up one day weighing 183 pounds. Today she Is lean and sexy once again...\r\n But what Kim really gained was new knowledge of how to eat, what foods you can substitute, and some very cool tips and trick to maximize anyone's HCG Body for Life protocol results.\r\n She's even taught me a few new tricks!\r\n Join us on this call... I promise you, you will be very enlightening and you'll walk away inspire, motivated, and armed with new info that will make your HCG protocol success much easier!\r\n See you there!\r\n Regards,\r\n Colin\r\n",
            "length": "21669848",
            "sourceUrl": "https://www.blogtalkradio.com/thehcgdietcoach/2012/06/14/hcg-body-talk--hcg-bfl-success-story-ms-kimberly-landis.mp3",
            "categories": [
                {
                    "_": "Health",
                    "$": {
                        "domain": "https://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "HCG Diet Relapse & Recover... Call #2",
            "datePublished": "Fri, 01 Jun 2012 01:00:00 GMT",
            "description": " This will be our 2nd meeting of HCG Relapse and Recover...\r\n This is the place to come to share discover what is stopping you from having the health and body of your life... On this call you will have an opportunity to open up and identify the problem and together we will create a solution.\r\n This call is only for those of you who truly want to have a breakthrough and reach your desired weight by the end of summer 2012.\r\n See you here!\r\n Colin\r\n",
            "length": "20247951",
            "sourceUrl": "https://www.blogtalkradio.com/thehcgdietcoach/2012/06/01/hcg-diet-relapse-recover-call-2.mp3",
            "categories": [
                {
                    "_": "Health",
                    "$": {
                        "domain": "https://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "hCG Body Talk - Ask Me Anything HCG",
            "datePublished": "Thu, 31 May 2012 00:30:00 GMT",
            "description": " This show is for the HCG diet newbie or veteran who has specific HCG diet related questions that you may be having difficulties finding the answer to... Join me on the call today, and I'll do my best to answer all of your questions.\r\n  \r\n See you later!\r\n  \r\n Colin\r\n",
            "length": "21766188",
            "sourceUrl": "https://www.blogtalkradio.com/thehcgdietcoach/2012/05/31/hcg-body-talk--ask-me-anything-hcg.mp3",
            "categories": [
                {
                    "_": "Health",
                    "$": {
                        "domain": "https://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "HCG Diet Relapse & Recover... First Meeting",
            "datePublished": "Fri, 25 May 2012 01:00:00 GMT",
            "description": " This will be our fisrt meeting of HCG Relapse and Recover...\r\n This is the place to come to share discover what is stopping you from having the health and body of your life... On this call you will have an opportunity to open up and identify the problem and together we will create a solution.\r\n This call is only for those of you who truly want to have a breakthrough and reach your desired weight by the end of summer 2012.\r\n See you here!\r\n Colin\r\n",
            "length": "21603811",
            "sourceUrl": "https://www.blogtalkradio.com/thehcgdietcoach/2012/05/25/hcg-diet-relapse-recover-first-meeting.mp3",
            "categories": [
                {
                    "_": "Health",
                    "$": {
                        "domain": "https://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "hCG Body Talk - How To Cheat on The HCG Diet And Win!",
            "datePublished": "Thu, 17 May 2012 00:30:00 GMT",
            "description": " Wednesday May 16th @ 5:30 PST\r\n How To Cheat On The HCG Diet and Win...!\r\n Although cheating on this protocol can sometimes comes with a big price, knowing how to make smarter choices can mean the difference between gaining big or not gaining at all. I'll discuss with you some of my tips and tricks  to keeping the pounds and inches moving in only one direction.... Down!\r\n See you tonight on the call!\r\n HCG Body for Life... For the body of your life!\r\n Colin\r\n",
            "length": "21572046",
            "sourceUrl": "https://www.blogtalkradio.com/thehcgdietcoach/2012/05/17/hcg-body-talk--how-to-cheat-on-the-hcg-diet-and-win.mp3",
            "categories": [
                {
                    "_": "Health",
                    "$": {
                        "domain": "https://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "How to Stop Emotional Eating & Mindless Snacking!",
            "datePublished": "Thu, 10 May 2012 00:30:00 GMT",
            "description": " Knowing how to stop emotional eating goes beyond diets and exercise. These ways to overcome mindless snacking are about identifying emotional versus physical hunger.\r\n If you want to stop emotional eating, you need to be honest with yourself about why you're snacking mindlessly. To overcome cravings, you must identify what you're really feeling -- and cope with your feelings differently. All the weight loss tips in the world won't help you stop eating emotionally unless you know why you're compelled to snack mindlessly!\r\n JOIN ME ON THIS CALL...\r\n See you there,\r\n Colin\r\n",
            "length": "21457525",
            "sourceUrl": "https://www.blogtalkradio.com/thehcgdietcoach/2012/05/10/how-to-stop-emotional-eating-mindless-snacking.mp3",
            "categories": [
                {
                    "_": "Health",
                    "$": {
                        "domain": "https://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "hCG Body Talk - Mastering HCG Diet Once and For All",
            "datePublished": "Thu, 03 May 2012 00:30:00 GMT",
            "description": " Today I'm discussing how to finally master the HCG diet... How to nail down all 4 phases, achieve the body of your life and  stay \"Semper Fit\" Fit for Life.\r\n\"HCG Body for Life Summer Slim Down\"\r\n The All New HCG Diet Relapse and Recovery Workshop...!\r\n Tune in and see the magic happen!!!\r\n",
            "length": "21487200",
            "sourceUrl": "https://www.blogtalkradio.com/thehcgdietcoach/2012/05/03/hcg-body-talk--mastering-hcg-diet-phase-3.mp3",
            "categories": [
                {
                    "_": "Health",
                    "$": {
                        "domain": "https://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "Why the 26 Day HCG Diet Cycle May Be Obsolete ",
            "datePublished": "Thu, 12 Apr 2012 00:30:00 GMT",
            "description": "  \r\n On this weeks show, we will discuss why the 26 day HCG cycle may be ineffective for most people to reach their weight loss goals. And, why balancing your hormones, could be the missing link to achieving your natural body weight with ease.\r\n By using a new cutting edge approach in BHRT (Bio Identical Hormone Replacement Therapy) you may be able to fill in the missing link for losing weight quickly, easily, and keeping it off for life!\r\n Join me on today's call!\r\n  \r\n Regards, \r\n  \r\n Colin\r\n",
            "length": "14547824",
            "sourceUrl": "https://www.blogtalkradio.com/thehcgdietcoach/2012/04/12/why-the-26-day-hcg-diet-cycle-may-be-obsolete-1.mp3",
            "categories": [
                {
                    "_": "Health",
                    "$": {
                        "domain": "https://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "How To Turn HCG Diet Relapse Into A Revelation Part 2",
            "datePublished": "Thu, 05 Apr 2012 00:30:00 GMT",
            "description": "\r\n   Today’s show is a continuation of last week’s show that was interrupted by technical difficulties... This show is for those of you whom have relapse in your weight loss journey and have reached, or gotten really close to your weight loss goals, only to find yourself a few months later with most or all of the weight back again.\r\n\r\n   If you're hiding and living with the feelings of defeat, shame, and embarrassment tune in... These feelings can be paralyzing… We are going to discuss how to embrace defeat and begin your journey of HCG diet recovery.  I will reveal my plan to help each and every one of you get back your health, and once again have the body of your life by summer 2012.\r\n\r\n   Join me on the call as I share with you for the first time, our most powerful mission yet!\r\n\r\n    \r\n",
            "length": "21547595",
            "sourceUrl": "https://www.blogtalkradio.com/thehcgdietcoach/2012/04/05/how-to-turn-hcg-diet-relapse-into-hcg-diet-revelation-part-2.mp3",
            "categories": [
                {
                    "_": "Health",
                    "$": {
                        "domain": "https://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "How to Conquer HCG Diet Relapse and Embrace HCG Diet Recover",
            "datePublished": "Thu, 29 Mar 2012 00:30:00 GMT",
            "description": " Today’s show is for those of you whom have relapse in your weight loss journey… Those of you that have either reached, or gotten really close to your weight loss goals, only to find yourself a few months later with most or all of the weight back again.\r\n This show is for those for you who are hiding…, living with the feelings of defeat, shame, and embarrassment. These feelings can be paralyzing… We are going to discuss how to embrace defeat and begin your journey of HCG diet recovery.  I will reveal my plan to help each and every one of you get back your health, and once again have the body of your life by summer 2012.\r\n Join me on the call as I share with you for the first time, our most powerful mission yet!\r\n",
            "length": "3753401",
            "sourceUrl": "https://www.blogtalkradio.com/thehcgdietcoach/2012/03/29/how-to-conquer-hcg-diet-relapse-and-embrace-hcg-diet-recover.mp3",
            "categories": [
                {
                    "_": "Health",
                    "$": {
                        "domain": "https://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "HCG Body Talk - How To Guarantee HCG Diet Success...",
            "datePublished": "Thu, 15 Mar 2012 00:30:00 GMT",
            "description": "  \r\n\r\n   HCG Body Talk - How To Guarantee HCG Diet Success...\r\n\r\n   People ask me all the time why there are some who can start the HCG body for life diet protocol and have it be the easiest weight loss protocol they have ever done... while others struggle from the very beginning with losing weight, constantly cheating and experience complete and utter frustration.\r\n\r\n   I will reveal the secrets to having overwhelming success with the No. #1 fat loss diet protocol in the world! Tune in and discover my simple secrets for having the body of your life.\r\n\r\n   See you there...\r\n\r\n   Colin\r\n",
            "length": "21755530",
            "sourceUrl": "https://www.blogtalkradio.com/thehcgdietcoach/2012/03/15/hcg-body-talk--how-to-guarantee-hcg-diet-success.mp3",
            "categories": [
                {
                    "_": "Health",
                    "$": {
                        "domain": "https://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "Why HCG with this type of vegetarian can increase fat loss..",
            "datePublished": "Thu, 01 Mar 2012 01:30:00 GMT",
            "description": "  \r\n\r\n  Vegetarian HCG diet protein options! This show is not just for vegetarians who want to do the HCG diet... I'm going to show you why being this type of vegetarian could actually increase your fat loss by 25 to 30%. And why eating this way for most of you, especially woman can help you, lose it fast, maintain it easier, and keep the weight off for life\r\n\r\n   \r\n\r\n  See you tonight!\r\n\r\n  Colin\r\n",
            "length": "21277385",
            "sourceUrl": "https://www.blogtalkradio.com/thehcgdietcoach/2012/03/01/why-hcg-with-this-type-of-vegetarian-can-increase-fat-loss-1.mp3",
            "categories": [
                {
                    "_": "Health",
                    "$": {
                        "domain": "https://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "Why Buy HCG From Overseas Pharmacies... And Is It Legal?",
            "datePublished": "Thu, 23 Feb 2012 01:30:00 GMT",
            "description": " Is the FDA on a mission to stop the HCG diet...?\r\n On this weeks show, we'll discuss why we recommend buying HCG from overseas and online pharmacies... Some of you have ask why we use Canadian or overseas pharmacies?\r\n What are the laws on buying prescription drugs from out of the US.\r\n Is it legal?\r\n Is it safe?\r\n Should we be concernd with getting counterfit drugs.\r\n Why the FDA warns about buying precription drugs online.\r\n All this and more...\r\n Join me on this call!\r\n See you there,\r\n Colin\r\n",
            "length": "22575984",
            "sourceUrl": "https://www.blogtalkradio.com/thehcgdietcoach/2012/02/23/hcg-body-talk--mastering-hcg-diet-phase-3.mp3",
            "categories": [
                {
                    "_": "Health",
                    "$": {
                        "domain": "https://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "Brown Fat vs Yellow Fat. Which Fat is The Right Fat loss?",
            "datePublished": "Thu, 26 Jan 2012 01:30:00 GMT",
            "description": " Did you know you had two kinds of fat?\r\n There is brown fat and yellow fat. Some of us have more of one of these types of fat than the other. So which is the right fat to lose, why does it matter, and howdo you lose it efficiently while on the HCG Body for life diet protocol.. Simply said, how to really \"burn the fat and reveal the muscle!\r\n Tune in and find out all the details.\r\n See you there,\r\n Colin\r\n",
            "length": "21853123",
            "sourceUrl": "https://www.blogtalkradio.com/thehcgdietcoach/2012/01/26/brown-fat-vs-yellow-fat-which-fat-is-the-right-fat-loss-1.mp3",
            "categories": [
                {
                    "_": "Health",
                    "$": {
                        "domain": "https://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "Why 67% of HCG dieters won't reach their desired weight",
            "datePublished": "Thu, 19 Jan 2012 01:30:00 GMT",
            "description": "  \r\n\r\n67% of HCG dieters failed to truly understand the importance of why Dr. Simeons called his manuscript Pounds & Inches... Today I'm going to discuss why thousands of HCG diets are either quiting prematurely, or simply fail to lose their desired amount of weight with the HCG diet. And,  why men more than woman make this crucial mistake!\r\n\r\n  Are you one of the 33% who succeed, or the 67% who are cheating yourself out of having the body of your life?\r\n\r\n  Find out tonight on the show!\r\n\r\n-- \r\n\"If you can dream it, then you can achieve it. You will get all you want in life if you help enough other people get what they want.\"   Zig Ziglar \r\n",
            "length": "21835987",
            "sourceUrl": "https://www.blogtalkradio.com/thehcgdietcoach/2012/01/19/why-67-of-hcg-dieters-wont-reach-their-desired-weight-1.mp3",
            "categories": [
                {
                    "_": "Health",
                    "$": {
                        "domain": "https://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "HCG Protein Shake. How to use is to maximize results!",
            "datePublished": "Thu, 12 Jan 2012 01:30:00 GMT",
            "description": " On today's show I'll discuss how to use the new and very popular HCG protein shake to maximize fat-loss results. When is the perfect time to take it, and when not to... If uses correctly this could make losing weight on the HCG diet protocol easier and more effective, in addition to helping you build lean muscle mass, increased metabolism, and long-term weight management.\r\n  \r\n See you tonight!\r\n Regards,\r\n Colin\r\n",
            "length": "14942586",
            "sourceUrl": "https://www.blogtalkradio.com/thehcgdietcoach/2012/01/12/hcg-protein-shake-how-to-use-is-to-maximixe-results.mp3",
            "categories": [
                {
                    "_": "Health",
                    "$": {
                        "domain": "https://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "The last show of 2011... Recap the 20 best HCG diet tips!",
            "datePublished": "Thu, 29 Dec 2011 01:30:00 GMT",
            "description": " HCG-Ology all about the HCG body for life fat loss system.\r\n A quick replay of the events of 2011 and what you can expect from HCG Body for life in 2012... Together we can all have and create our very own healthy, fit, strong and sexy, HCG Body for LIFE!\r\n Happy New Year!\r\n Much Love...\r\n Colin and Jayne\r\n",
            "length": "14646044",
            "sourceUrl": "https://www.blogtalkradio.com/thehcgdietcoach/2011/12/29/the-last-show-of-2011-recap-the-20-best-hcg-diet-tips.mp3",
            "categories": [
                {
                    "_": "Health",
                    "$": {
                        "domain": "https://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "HCG Body Talk - Ask Me Anything HCG...",
            "datePublished": "Thu, 08 Dec 2011 01:30:00 GMT",
            "description": " Ask me anything HCG is one of our most popular  shows. This give you an opportunity to ask me your specific HCG diet related questions. We will also discuss the latest news about the FDA going after Homeopathic HCG sales here in the US and what will the mean for all HCG diet sales...\r\n Join me on the call today at 5:30PM PST... If you have specific question you would like covered on the show and are unable to make it live.. Email your question (s) to colin@colinfwatson.com.\r\n See you tonight!\r\n",
            "length": "14532359",
            "sourceUrl": "https://www.blogtalkradio.com/thehcgdietcoach/2011/12/08/hcg-body-talk--ask-me-anything-hcg.mp3",
            "categories": [
                {
                    "_": "Health",
                    "$": {
                        "domain": "https://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "How To Stop Holiday Weight Gain Cold!",
            "datePublished": "Thu, 01 Dec 2011 01:30:00 GMT",
            "description": " Join me today as we discuss a few simple tips to minimize holiday weight gain, and what to do to get the body of your life in 2012.\r\n See you there :))\r\n",
            "length": "11600585",
            "sourceUrl": "https://www.blogtalkradio.com/thehcgdietcoach/2011/12/01/hcg-body-talk-new-challenge-new-body-new-life.mp3",
            "categories": [
                {
                    "_": "Health",
                    "$": {
                        "domain": "https://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "What Would Dr. Simeons Say Part II",
            "datePublished": "Thu, 10 Nov 2011 01:30:00 GMT",
            "description": "On today's show, I will finish my review of Dr. Simeons Pounds and Inches protocol as it was designed... We'll reveal the truth about how much weight loss is considered normal on the HCG diet, How often this protocol should be done, and has the Internet altered or diminished the overall success of this weight loss cure.\r\n Se you there...\r\n",
            "length": "21769323",
            "sourceUrl": "https://www.blogtalkradio.com/thehcgdietcoach/2011/11/10/what-would-dr-simeons-say-part-ii.mp3",
            "categories": [
                {
                    "_": "Health",
                    "$": {
                        "domain": "https://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "What would Dr. Simeons do..?",
            "datePublished": "Thu, 03 Nov 2011 00:30:00 GMT",
            "description": " What Did Dr. Simeons Really Say about HCG diet weight loss…?\r\n On today’s radio show I am going to dissect Dr. Simeons Pounds and Inches protocol and finally reveal the truth about HCG diet weight loss as prescribed by Dr. Simeons. What he wrote in his manuscript, how much weight you are really supposed to lose; the diet menu, and what he says about exercise… And how this information has been misconstrued, altered and downright distorted…  If you know the facts, you may realize that your weight loss numbers may actually be right on target!\r\n See you there!\r\n",
            "length": "21628470",
            "sourceUrl": "https://www.blogtalkradio.com/thehcgdietcoach/2011/11/03/hcg-body-talk-tbd.mp3",
            "categories": [
                {
                    "_": "Health",
                    "$": {
                        "domain": "https://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "What Do The HCG Diet Coach And TV's Dr. House Have in Common",
            "datePublished": "Thu, 27 Oct 2011 00:30:00 GMT",
            "description": " On this call, you'll discover what the \"HCG Diet Coach\" and TVs \"Dr. Gregory House\" have in common, and how these similarities could could help you reach your weight loss goals, or more importantly, discover the reason why you're not!\r\n Those of you on the call live will receive a special bonus for being there live...!\r\n Tune in and a hear it for yourself!\r\n",
            "length": "20562048",
            "sourceUrl": "https://www.blogtalkradio.com/thehcgdietcoach/2011/10/27/hcg-body-talk-tbd.mp3",
            "categories": [
                {
                    "_": "Health",
                    "$": {
                        "domain": "https://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "HCG Diet Myth-Busters... To 10 HCG diet myths revealed..",
            "datePublished": "Thu, 13 Oct 2011 00:30:00 GMT",
            "description": "  \r\n So have you heard some of these HCG diet myths and wondered if they're true or not...   Tune into today's radio show and find out! If what you know or what you believe to be true about the HCG diet is in deed \"Fact or Myth\"   See you there...   :-)   Colin",
            "length": "21526070",
            "sourceUrl": "https://www.blogtalkradio.com/thehcgdietcoach/2011/10/13/hcg-diet-myth-busters-to-10-hcg-diet-myths-revealed-1.mp3",
            "categories": [
                {
                    "_": "Health",
                    "$": {
                        "domain": "https://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "HCG-Body Talk: 11 Ways To Beat HCG Diet Hunger Issues...",
            "datePublished": "Thu, 06 Oct 2011 00:30:00 GMT",
            "description": " There are some who begin the diet on the wrong foot and end up suffering with hunger issues... Today's show I will talk about 11 easy ways to stop the hunger monster dead in his tracks!\r\n Join me on the call this call and increase your HCG diet success by getting easy control over hunger issues.\r\n TTYS,\r\n Colin\r\n",
            "length": "14585440",
            "sourceUrl": "https://www.blogtalkradio.com/thehcgdietcoach/2011/10/06/hcg-body-talk-new-challenge-new-body-new-life.mp3",
            "categories": [
                {
                    "_": "Health",
                    "$": {
                        "domain": "https://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "How I Changed My Body, My life, & Now Earn a Passion Check",
            "datePublished": "Thu, 15 Sep 2011 00:30:00 GMT",
            "description": " Join me as we discuss the how to create your own HCG Body for Life referral business. By teaming up with us to help transform lives. Getting a passion check instead of a paycheck!\r\n  \r\n The business of HCG Body for Life... For the body of your life!\r\n See you there :))\r\n  \r\n Colin\r\n",
            "length": "14582096",
            "sourceUrl": "https://www.blogtalkradio.com/thehcgdietcoach/2011/09/15/hcg-body-talk-new-challenge-new-body-new-life.mp3",
            "categories": [
                {
                    "_": "Health",
                    "$": {
                        "domain": "https://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "Meet the WINNER'S of HCG-90Xtreme Challenge #1",
            "datePublished": "Thu, 08 Sep 2011 00:30:00 GMT",
            "description": " Join us as we crown the champions of HCG-90X #1 and hear their incredible transformation stories. These two winners are truly inspirational and remarkable people.\r\n Don't miss this call...\r\n  \r\n See you there!\r\n  \r\n Colin and Jayne\r\n",
            "length": "18124301",
            "sourceUrl": "https://www.blogtalkradio.com/thehcgdietcoach/2011/09/08/meet-the-winners-of-hcg-90xtreme-challenge-1.mp3",
            "categories": [
                {
                    "_": "Health",
                    "$": {
                        "domain": "https://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "My Guest Dr Judi Goldstone HCG diet & Anti Aging Expert!",
            "datePublished": "Thu, 01 Sep 2011 00:30:00 GMT",
            "description": " My interview with HCG diet doctor and Bio Identical hormone replacement expert Dr Judi Goldstobne. We Will be discuss the benefits of the HCG diet and how to use it to fight the aging process..\r\n Jayne and I use Dr. Goldstone for more than two years now, and have experienced first hand the benefits of HRT and the HCG diet. Join us on the call and get your questions answered.\r\n",
            "length": "19107550",
            "sourceUrl": "https://www.blogtalkradio.com/thehcgdietcoach/2011/09/01/hcg-body-talk--mastering-hcg-diet-phase-3.mp3",
            "categories": [
                {
                    "_": "Health",
                    "$": {
                        "domain": "https://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "Mastering Phase 3 and My HCG-90X 21 Day Challenge Update",
            "datePublished": "Thu, 11 Aug 2011 00:30:00 GMT",
            "description": " I will be sharing my HCG-90Xtreme Challenge results so to date... and convering Phase 3 of the HCG diet... \"The muscle building and stabilization phase\" how to travel while in phase 3 of the HCG diet Protocol.\r\n",
            "length": "11822730",
            "sourceUrl": "https://www.blogtalkradio.com/thehcgdietcoach/2011/08/11/hcg-body-talk--mastering-hcg-diet-phase-3.mp3",
            "categories": [
                {
                    "_": "Health",
                    "$": {
                        "domain": "https://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "This sucks... Why is my friend is losing more than me...",
            "datePublished": "Thu, 28 Jul 2011 00:30:00 GMT",
            "description": " This sucks my friend cheats and is losing more than me...\r\n Does this sound like you or someone you know? Well there is a reason why some people lose more weight than others and why comparing your seults to others will only lead to your failure not theirs.\r\n",
            "length": "14454410",
            "sourceUrl": "https://www.blogtalkradio.com/thehcgdietcoach/2011/07/28/hcg-body-talk--mastering-hcg-diet-phase-3.mp3",
            "categories": [
                {
                    "_": "Health",
                    "$": {
                        "domain": "https://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "How I gained 10 pounds in 2 weeks to do HCG90Xtreme II",
            "datePublished": "Thu, 21 Jul 2011 00:30:00 GMT",
            "description": " The scariest part about choosing to gain weight for this next challenge is not the weight gain, the bear belly or even tight fitting cloths... What really scares me is re-formation of bad habits,and loss of discipline that scares me most. Join me on the call today and share what really scares you.\r\n",
            "length": "20221620",
            "sourceUrl": "https://www.blogtalkradio.com/thehcgdietcoach/2011/07/21/hcg-body-talk--mastering-hcg-diet-phase-3.mp3",
            "categories": [
                {
                    "_": "Health",
                    "$": {
                        "domain": "https://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "HCG-90Xtreme II- Do you really want weight loss success?",
            "datePublished": "Thu, 07 Jul 2011 00:30:00 GMT",
            "description": " Are You ready for HCG-90X challenge II The official rules and contest specifics... HCG-90Xtreme Challenge II official rules, and requirements. This show is all about the biggest HCG diet challenge launch ever... how to finally get that HCG Body for LIFE! What to expect and how to get registered.\r\nSee you there...Colin        ",
            "length": "14564960",
            "sourceUrl": "https://www.blogtalkradio.com/thehcgdietcoach/2011/07/07/hcg-body-talk--mastering-hcg-diet-phase-3.mp3",
            "categories": [
                {
                    "_": "Health",
                    "$": {
                        "domain": "https://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "hCG Body Talk -Ask Me Anything HCG",
            "datePublished": "Thu, 23 Jun 2011 00:30:00 GMT",
            "description": " Today's call  is an open forum call for any HCG diet related questions. Take this opportunity to get your questions answered, and arm yourself with the information needed to succeed. Please make sure to have specific questions in mind, and not just \"How does the HCG diet work?\"\r\n See you there!\r\n",
            "length": "21590227",
            "sourceUrl": "https://www.blogtalkradio.com/thehcgdietcoach/2011/06/23/hcg-body-talk-tbd.mp3",
            "categories": [
                {
                    "_": "Health",
                    "$": {
                        "domain": "https://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "hCG Body Talk -HCG-90Xtreme Challen II Update!",
            "datePublished": "Thu, 16 Jun 2011 00:30:00 GMT",
            "description": "On today's show we will will be discussing the newest HCG-90X challenge coming up in June and, I'll share with you the interesting dilemma we have going on right now with HCG-90Xteme Challenge 1. \"Should I stay or should I go?\"  This is the question on the table for the current challenge members. Let's find out together, what's going to happen... Join me on the call live!\r\n",
            "length": "21437881",
            "sourceUrl": "https://www.blogtalkradio.com/thehcgdietcoach/2011/06/16/hcg-body-talk-tbd.mp3",
            "categories": [
                {
                    "_": "Health",
                    "$": {
                        "domain": "https://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "hCG Body Talk -New Fat Loss Challenge, New Body, New Life!",
            "datePublished": "Thu, 09 Jun 2011 00:30:00 GMT",
            "description": " HCG-Ology all about the HCG body for life fat loss! Join me as we discuss the new upcoming challenge, the new HCG-90X Affiliate program, and how the power of right community can help you finally beat the battle of the bulge!\r\n",
            "length": "21757620",
            "sourceUrl": "https://www.blogtalkradio.com/thehcgdietcoach/2011/06/09/hcg-body-talk-tbd.mp3",
            "categories": [
                {
                    "_": "Health",
                    "$": {
                        "domain": "https://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "HCG Body - HCG diet- Eating Out, Traveling, and Vacationing",
            "datePublished": "Thu, 26 May 2011 00:30:00 GMT",
            "description": " Tonight we'll discuss how to handle Eeating Out, Traveling, and Vacationing all while on protocol. Should it be done, can it be done, and if so, how is it done...  I'll discuss simple tips on how to navigate planned events during phase 2 and 3 of the HCG Body for Life diet protocol to keep the scale moving in the right direction!\r\n",
            "length": "19893104",
            "sourceUrl": "https://www.blogtalkradio.com/thehcgdietcoach/2011/05/26/hcg-body-talk--mastering-hcg-diet-phase-3.mp3",
            "categories": [
                {
                    "_": "Health",
                    "$": {
                        "domain": "https://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "hCG Body Talk -The Power Of Community and HCG Diet Success!",
            "datePublished": "Thu, 12 May 2011 00:30:00 GMT",
            "description": " On todays show, I will be discussing the power of community when it comes to HCG diet success.\r\n Give some updates on week 1 of the 90 day challenge.\r\n And, share with you,  how I almost cancelled the challenge and was ready to walk away... What stopped me, and how this information may stop you from quitting on yourselves.\r\n",
            "length": "20920865",
            "sourceUrl": "https://www.blogtalkradio.com/thehcgdietcoach/2011/05/12/hcg-body-talk-tbd.mp3",
            "categories": [
                {
                    "_": "Health",
                    "$": {
                        "domain": "https://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "HCG-90X challenge official rules and contest specifics...",
            "datePublished": "Thu, 05 May 2011 00:30:00 GMT",
            "description": " HCG-90X Challege rule and requirments. All about the HCG body for life 90 day fat loss challenge. What you need to do to complete your registation and prepare for transformation success!\r\n",
            "length": "14590038",
            "sourceUrl": "https://www.blogtalkradio.com/thehcgdietcoach/2011/05/05/hcg-body-talk-tbd.mp3",
            "categories": [
                {
                    "_": "Health",
                    "$": {
                        "domain": "https://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "Today's Show-HCG90X Challenge... Interview With Our Mrs. X",
            "datePublished": "Thu, 28 Apr 2011 00:30:00 GMT",
            "description": " On this short call, we are going to go into more detail about the New HCG-90X challenge, introduce you to the our mystery trainer who will be bring to you her unique style of cardio kickboxing and fat burning workouts for the 12 week challenge.\r\n Recently seen on The View last week, she has a huge heart, tons of energy, and is committed to helping each and every new member of HCG 90X build he body of their lives! So join us tonight at 5:30 PST.\r\n\r\n  \r\n",
            "length": "15188764",
            "sourceUrl": "https://www.blogtalkradio.com/thehcgdietcoach/2011/04/28/hcg-body-talk--mastering-hcg-diet-phase-3.mp3",
            "categories": [
                {
                    "_": "Health",
                    "$": {
                        "domain": "https://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "The All New HCG-90Xtreme Weight Loss Challenge!",
            "datePublished": "Thu, 14 Apr 2011 00:30:00 GMT",
            "description": "\r\n\tHCG-Ology-The All New HCG Body 4 Life Fat Loss Challenge!\r\n\r\n\r\n\tThe Next HCG Body 4 Life fat loss challenge is just around the corner. We will be discussing when the new challenge will be, what’s new about it, and why you don’t want to miss it. Introducing the HCG-90Xtreme Transformation Program.\r\n\r\n\r\n\t This new challenge is going to be different than anything we have done before. HCG90Xtreme private members only coaching program designed to deliver the hottest NEW HCG Body transformation system and challenge of its kind.\r\n\r\n\r\n\tMultiple winners, Multiple prizes, and Extreme Fat Loss Results,  Join me on the call to find out why our private corporate coaching clients are willing to pay us upwards of $10k to $25k for this new HCG90Xtreme transformation program, and how you’ll get to test drive it before they do! See you there!\r\n",
            "length": "21732333",
            "sourceUrl": "https://www.blogtalkradio.com/thehcgdietcoach/2011/04/14/hcg-body-talk-tbd.mp3",
            "categories": [
                {
                    "_": "Health",
                    "$": {
                        "domain": "https://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "-Ask me anything HCG & Winner of the HCG Body4Life 40 Day Challenge Announced",
            "datePublished": "Thu, 31 Mar 2011 00:30:00 GMT",
            "description": "Our \"Ask Me Anything HCG\" shows ares always a very popular show. This give new and experienced HCG dieter a venue to ask that one question they can't seem to find the answers to. We will also announce the winners of our 1st HCG 4o day challenge. Email me your HCG questions to me in advance to HCGDietCoach@gmail.com before 2:30PM PST",
            "length": "12780065",
            "sourceUrl": "https://www.blogtalkradio.com/thehcgdietcoach/2011/03/31/hcg-body-talk-tbd.mp3",
            "categories": [
                {
                    "_": "Health",
                    "$": {
                        "domain": "https://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "hCG Body Talk -The 10 most important days of the HCG diet that can make or break your success!",
            "datePublished": "Thu, 24 Mar 2011 00:30:00 GMT",
            "description": "Do you know what the 10 most important days are of the HCG diet protocol? Did you know that if you can master 10 days down you'll literally skyrocket your HCG diet weight loss success. Tune in today to discover these never before talk about HCG diet secrets to success!",
            "length": "16271070",
            "sourceUrl": "https://www.blogtalkradio.com/thehcgdietcoach/2011/03/24/hcg-body-talk--mastering-hcg-diet-phase-3.mp3",
            "categories": [
                {
                    "_": "Health",
                    "$": {
                        "domain": "https://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "hCG Body Talk - Interview With Loribeth Dalton from ThicktoThin",
            "datePublished": "Thu, 17 Mar 2011 00:30:00 GMT",
            "description": "Loribeth Dalton, public speaker, Career and Life Coach, and successful HCG dieter shares her amazing story of transformation and how she finally conquered her lifelong struggle with obesity. How she lost close to 100 pounds, gained much of it back and then finally mastered her weight and metabolism with the HCG diet, and by implementing our Advanced HCG Body 4 Life protocol has able to double her fat loss, and reveal her true body within.",
            "length": "21857094",
            "sourceUrl": "https://www.blogtalkradio.com/thehcgdietcoach/2011/03/17/hcg-body-talk--mastering-hcg-diet-phase-3.mp3",
            "categories": [
                {
                    "_": "Health",
                    "$": {
                        "domain": "https://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "hCG -Ology 2 - Why 90% of HCG dieter are doing the diet wrong!",
            "datePublished": "Thu, 10 Mar 2011 01:30:00 GMT",
            "description": "The HCG diet... Why 90% of HCG dieter are doing won't achieve permanent weight loss. Understanding how to do the HCG diet right, to achieve permanent fat loss. ",
            "length": "21834106",
            "sourceUrl": "https://www.blogtalkradio.com/thehcgdietcoach/2011/03/10/hcg-body-talk--mastering-hcg-diet-phase-3.mp3",
            "categories": [
                {
                    "_": "Health",
                    "$": {
                        "domain": "https://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "hCG Body Talk - Ask Me Anything HCG Diet ",
            "datePublished": "Thu, 24 Feb 2011 01:30:00 GMT",
            "description": "Ask me anything HCG and Mastering Phase3 of the HCG diet... \"The muscle building and stabilization phase\" This will be a general Q & A regarding the HCG diet, and mastering Phase 3 for those looking for long term weight management. ",
            "length": "21800043",
            "sourceUrl": "https://www.blogtalkradio.com/thehcgdietcoach/2011/02/24/hcg-body-talk--mastering-hcg-diet-phase-3.mp3",
            "categories": [
                {
                    "_": "Health",
                    "$": {
                        "domain": "https://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "HCG-Ology... So Why  HCG, and is it for you?",
            "datePublished": "Thu, 17 Feb 2011 01:30:00 GMT",
            "description": "Tonight's call is all about the HCG diet, how it works, why it works, and who should or shouldn't use the protocol. We will also have a live Q&A session for those who just are not sure if this will work for you. Join Us, ONLY 50 spots available. ",
            "length": "21749888",
            "sourceUrl": "https://www.blogtalkradio.com/thehcgdietcoach/2011/02/17/hcg-body-talk--mastering-hcg-diet-phase-3.mp3",
            "categories": [
                {
                    "_": "Health",
                    "$": {
                        "domain": "https://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "hCG Body Talk - HCG Body 4 Life 40 Day Challenge",
            "datePublished": "Thu, 10 Feb 2011 01:30:00 GMT",
            "description": "HCG Body for Life 40 day challenge, How to drop 25 more pounds in the next 21 days!Get you body turbo charged.",
            "length": "21213855",
            "sourceUrl": "https://www.blogtalkradio.com/thehcgdietcoach/2011/02/10/hcg-body-talk--mastering-hcg-diet-phase-3.mp3",
            "categories": [
                {
                    "_": "Health",
                    "$": {
                        "domain": "https://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "hCG Body Talk - Live 40 Day Challenge Coaching Call",
            "datePublished": "Thu, 03 Feb 2011 01:30:00 GMT",
            "description": "This is a live 40 day challenge coaching call where we will discuss this weeks action plan, and get feedback form the tribe on how the journey has been so far. Join the call share your journey with us. Here to creating your HCG Body For Life!",
            "length": "14630789",
            "sourceUrl": "https://www.blogtalkradio.com/thehcgdietcoach/2011/02/03/hcg-body-talk--mastering-hcg-diet-phase-3.mp3",
            "categories": [
                {
                    "_": "Health",
                    "$": {
                        "domain": "https://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "hCG Body Talk - Mastering HCG Diet Phase 3",
            "datePublished": "Thu, 13 Jan 2011 01:30:00 GMT",
            "description": "Phase 3 of the HCG diet... \"The muscle building and stabilization phase\" is considered to be the most important phase of the HCG diet Protocol. Learn how to build muscle, at re-set your weight set point the right way and build your HCG Body For Life!",
            "length": "6300026",
            "sourceUrl": "https://www.blogtalkradio.com/thehcgdietcoach/2011/01/13/hcg-body-talk--mastering-hcg-diet-phase-3.mp3",
            "categories": [
                {
                    "_": "Health",
                    "$": {
                        "domain": "https://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "WIN A 7 DAY CRUISE- New Years Resolution 43 day hcg fat loss challenge",
            "datePublished": "Thu, 30 Dec 2010 01:30:00 GMT",
            "description": "New Years Resolution 43 Day Weight Loss Challenge. On today's show we'll discuss New Years resolution weight loss goals, and the launch of a 43 day HGG Body for life weight loss challenge whereby the winner will receive a Free Vacation Voucher for a 7 day Caribbean cruise. Join us on the call for the details. Only 50 spots available.",
            "length": "14448559",
            "sourceUrl": "https://www.blogtalkradio.com/thehcgdietcoach/2010/12/30/hcg-body-talk--mastering-hcg-diet-phase-3.mp3",
            "categories": [
                {
                    "_": "Health",
                    "$": {
                        "domain": "https://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "hCG Body Talk - Share Your HCG Diet Success Story!",
            "datePublished": "Thu, 09 Dec 2010 01:30:00 GMT",
            "description": "Today' show is about success stories, milestones, and the celebration of just taking this journey. Call in and share your success with us! Together we'll inspire others to create their HCG Body for Life!",
            "length": "11622945",
            "sourceUrl": "https://www.blogtalkradio.com/thehcgdietcoach/2010/12/09/hcg-body-talk--mastering-hcg-diet-phase-3.mp3",
            "categories": [
                {
                    "_": "Fitness",
                    "$": {
                        "domain": "https://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "hCG Body Talk - How Much Are Those Extra Pounds Really Costing You?",
            "datePublished": "Thu, 18 Nov 2010 01:30:00 GMT",
            "description": "Today we'll take a closer look on how much our weight controls our lives, and what we could be missing out on if we choose to hold on to those extra pounds. To your HCG Body For Life!",
            "length": "4018805",
            "sourceUrl": "https://www.blogtalkradio.com/thehcgdietcoach/2010/11/18/hcg-body-talk--mastering-hcg-diet-phase-3.mp3",
            "categories": [
                {
                    "_": "Health",
                    "$": {
                        "domain": "https://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "How To Embrace and Breakthrough Weight Stalls",
            "datePublished": "Thu, 11 Nov 2010 00:30:00 GMT",
            "description": "Many HCG dieter become fearful and frustrated when it come to the inevitable stalls in weight loss. \"The Plateau\" Today, I will give you some insight to the cause of weight stalls, and how to look at it in a different way for fast and easy weight loss. We will also finish the Ask Me Anything HCG questions for last week.",
            "length": "3712023",
            "sourceUrl": "https://www.blogtalkradio.com/thehcgdietcoach/2010/11/11/hcg-body-talk--mastering-hcg-diet-phase-3.mp3",
            "categories": [
                {
                    "_": "Health",
                    "$": {
                        "domain": "https://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "hCG Body Talk - Ask me anything HCG",
            "datePublished": "Thu, 04 Nov 2010 00:30:00 GMT",
            "description": "Today show we have another episode of \"Ask Me Anything HCG\" This is where we answer your HCG questions on the show,and have a live Q and A call. Send your questions to hcgdietcoach@gmail.com before 4:00 PM PST today, and we will try and answer all of your questions. Regards, Colin and Jayne",
            "length": "10573241",
            "sourceUrl": "https://www.blogtalkradio.com/thehcgdietcoach/2010/11/04/hcg-body-talk--mastering-hcg-diet-phase-3.mp3",
            "categories": [
                {
                    "_": "Health",
                    "$": {
                        "domain": "https://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "Members Only- Mastering The HCG Diet 12 Wk Course",
            "datePublished": "Thu, 21 Oct 2010 00:30:00 GMT",
            "description": "Open Discussion-Help Jayne and I create a new program for you,  designed to help you maintain your weight through the holiday season, and get you ready for your HCG Body for life New Years Resolution Body Transformation!",
            "length": "6955177",
            "sourceUrl": "https://www.blogtalkradio.com/thehcgdietcoach/2010/10/21/hcg-body-talk--mastering-hcg-diet-phase-3.mp3",
            "categories": [
                {
                    "_": "Health",
                    "$": {
                        "domain": "https://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "hCG Body Talk - HCG Diet for Your Health",
            "datePublished": "Thu, 14 Oct 2010 00:30:00 GMT",
            "description": "Today's show will be an open discussion and Q an A session. I will be having a brief discussion about HCG diet and our overall health and then open the lines for question and success stories. So join us today at 5:30 PST Together we're creating a movement called HCG Body For Life!",
            "length": "10910720",
            "sourceUrl": "https://www.blogtalkradio.com/thehcgdietcoach/2010/10/14/hcg-body-talk--mastering-hcg-diet-phase-3.mp3",
            "categories": [
                {
                    "_": "Health",
                    "$": {
                        "domain": "https://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "hCG Body Talk - Phase 4-How To Maintain Your HCG Body For Life! ",
            "datePublished": "Thu, 07 Oct 2010 00:30:00 GMT",
            "description": "Phase 4 of the HCG diet... \"Will it be life a usual?\" Learning how to keep the weight off is the biggest challenge most of us face when it comes to judging the success of a diet. I'm going to offer a few tips that can help to keep you within the 2 pound of your end weight. How to maintain your HCG Body For Life!",
            "length": "10856072",
            "sourceUrl": "https://www.blogtalkradio.com/thehcgdietcoach/2010/10/07/hcg-body-talk--mastering-hcg-diet-phase-3.mp3",
            "categories": [
                {
                    "_": "Health",
                    "$": {
                        "domain": "https://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "Mastering Phase 3 The HCG Body For Life Way",
            "datePublished": "Thu, 30 Sep 2010 00:30:00 GMT",
            "description": "Phase 3 of the HCG Body for Life diet... \"The muscle building and stabilization phase\" is considered to be the most important phase of the HCG diet Protocol. Learn how to build muscle, at re-set your weight set point the right way and build your HCG Body For Life!",
            "length": "10892576",
            "sourceUrl": "https://www.blogtalkradio.com/thehcgdietcoach/2010/09/30/hcg-body-talk--mastering-hcg-diet-phase-3.mp3",
            "categories": [
                {
                    "_": "Health",
                    "$": {
                        "domain": "https://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "hCG Body Talk - Ask Me Anythin HCG Part 2",
            "datePublished": "Thu, 23 Sep 2010 00:30:00 GMT",
            "description": "This show is a continuation of the Ask me anything show from two weeks ago. Send me your hCG question to colin.watson22@gmail.com. Together, we can create your HCG Body For Life!",
            "length": "10690400",
            "sourceUrl": "https://www.blogtalkradio.com/thehcgdietcoach/2010/09/23/hcg-body-talk--mastering-hcg-diet-phase-3.mp3",
            "categories": [
                {
                    "_": "Health",
                    "$": {
                        "domain": "https://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "hCG Body Talk - Ask Me Anything HCG",
            "datePublished": "Thu, 09 Sep 2010 00:30:00 GMT",
            "description": "This will be an open forum to answer questions sent in via email from our listeners. So here's your chance. Send you HCG diet questions to hcgdietcoach@gmail.com. All question or topic requiest must be in by 3:00PM PST Here's to building your HCG Body For Life!",
            "length": "7367456",
            "sourceUrl": "https://www.blogtalkradio.com/thehcgdietcoach/2010/09/09/hcg-body-talk--mastering-hcg-diet-phase-3.mp3",
            "categories": [
                {
                    "_": "Health",
                    "$": {
                        "domain": "https://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "hCG Body Talk - HCG Body for Life Phase 1 & 2",
            "datePublished": "Thu, 02 Sep 2010 00:30:00 GMT",
            "description": "for life weight loss system... How it differs from Trudeau and Simeons protocol, Why it works, and how it will help you transform your body and build lien sexy toned muscle and shape. Join Jayne and me at 5:30 PST. Build your hcgbody for life",
            "length": "4756880",
            "sourceUrl": "https://www.blogtalkradio.com/thehcgdietcoach/2010/09/02/hcg-body-talk--mastering-hcg-diet-phase-3.mp3",
            "categories": [
                {
                    "_": "Health",
                    "$": {
                        "domain": "https://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "hCG Body Talk - End Emotional Eating  & Self Esteem and Weight Loss",
            "datePublished": "Thu, 12 Aug 2010 00:30:00 GMT",
            "description": "Today we're going to discuss how to end emotional eating, and also discuss how our self esteem can improve or hinder your weight loss success. Our Goal is Creating and Keeping Our HCG Body For Life!",
            "length": "6175892",
            "sourceUrl": "https://www.blogtalkradio.com/thehcgdietcoach/2010/08/12/hcg-body-talk--mastering-hcg-diet-phase-3.mp3",
            "categories": [
                {
                    "_": "Weight Loss",
                    "$": {
                        "domain": "https://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "hCG Body for Life Talk Radio - Today we will announce our Free Vacation Package Winners",
            "datePublished": "Thu, 05 Aug 2010 00:30:00 GMT",
            "description": "On today's show we will discuss out long awaited book release this coming weekend, and also announce the 2 winners of our free vacation package giveaways' for completing our survey last month. so find out if you are the one of the winners, be on the call TODAY!build your HCG Body For Life! Sign up to be on the list to be able to get a copy of the book when it released...This is a limited release! http://howtofeelgoodnakedin26days.com",
            "length": "8852503",
            "sourceUrl": "https://www.blogtalkradio.com/thehcgdietcoach/2010/08/05/hcg-body-talk--mastering-hcg-diet-phase-3.mp3",
            "categories": [
                {
                    "_": "Health",
                    "$": {
                        "domain": "https://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "hCG Body Talk - HCG Diet Weight Loss-Through Inpiration, Motivation, or Desperation You Choose!",
            "datePublished": "Thu, 29 Jul 2010 00:30:00 GMT",
            "description": "Today's show we will be discussing HCG Diet Weight Loss success and which path you have chosen either through Inspiration, Motivation, or Desperation, which path produces faster and easier weight loss results and how to reveal your true HCG body for life!",
            "length": "10439912",
            "sourceUrl": "https://www.blogtalkradio.com/thehcgdietcoach/2010/07/29/hcg-body-talk--mastering-hcg-diet-phase-3.mp3",
            "categories": [
                {
                    "_": "Health",
                    "$": {
                        "domain": "https://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "hCG Body Talk - Kelly H. share her struggle with weight loss",
            "datePublished": "Thu, 22 Jul 2010 00:30:00 GMT",
            "description": "On today's show, I though it would be nice to here a real hcg weight loss challenge story from someone who is walking the walk right now.\r\n\r\nI find Kelli's story very inspiring and I believe it will help others to take the HCG challenge and claim their lives back! Kelly H. One of coaching students shares her story! Please join us on the call.\r\n\r\n",
            "length": "14132372",
            "sourceUrl": "https://www.blogtalkradio.com/thehcgdietcoach/2010/07/22/hcg-body-talk--mastering-hcg-diet-phase-3.mp3",
            "categories": [
                {
                    "_": "Health",
                    "$": {
                        "domain": "https://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "So What's Your Excuse?",
            "datePublished": "Thu, 15 Jul 2010 00:30:00 GMT",
            "description": "Excuses Begone... Today's show, we are going to explore some of the excuses we use that get in the way of reaching our goals. What excuses have used in the past, or are currently using now that are getting in the way of your weight loss goals. This will be an open discussion for those of us on the call.  ",
            "length": "14618668",
            "sourceUrl": "https://www.blogtalkradio.com/thehcgdietcoach/2010/07/15/hcg-body-talk--mastering-hcg-diet-phase-3.mp3",
            "categories": [
                {
                    "_": "Health",
                    "$": {
                        "domain": "https://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "hCG Body Talk - Mastering HCG Diet Phase 3",
            "datePublished": "Thu, 08 Jul 2010 00:30:00 GMT",
            "description": "Learn why 95% of most HCG dieters are doing the HCG diet wrong. ! and...How to avoid Protein Edema, and the roller coaster weight loss.",
            "length": "14469456",
            "sourceUrl": "https://www.blogtalkradio.com/thehcgdietcoach/2010/07/08/hcg-body-talk--mastering-hcg-diet-phase-3.mp3",
            "categories": [
                {
                    "_": "Health",
                    "$": {
                        "domain": "https://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "hCG Body Talk - How To Prepare Mentally for The HCG Diet",
            "datePublished": "Thu, 01 Jul 2010 00:30:00 GMT",
            "description": "Many HCG dieters have a 10 to 14 day waiting period before their HCG arrives in the mail. Today we are going to share with you ACTION PLAN... \"How to get past the obstacles that stop you from reaching your weight loss goals\" 10 day action plan for weight loss success! ",
            "length": "12893123",
            "sourceUrl": "https://www.blogtalkradio.com/thehcgdietcoach/2010/07/01/hcg-body-talk--mastering-hcg-diet-phase-3.mp3",
            "categories": [
                {
                    "_": "Health",
                    "$": {
                        "domain": "https://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "hCG Body Talk - Ask Me Anything HCG...",
            "datePublished": "Thu, 24 Jun 2010 00:30:00 GMT",
            "description": "On today's call, I will be answering questions from people from my FaceBook page, and my wife Jayne will be on the call to provide a woman's prospective about the HCG diet. Together, we will be providing live answers to the top 10 questions of the week. If these ? spark some of your own, please chime in. Together, let's build your HCG Body For Life! ",
            "length": "14490563",
            "sourceUrl": "https://www.blogtalkradio.com/thehcgdietcoach/2010/06/24/hcg-body-talk--mastering-hcg-diet-phase-3.mp3",
            "categories": [
                {
                    "_": "Health",
                    "$": {
                        "domain": "https://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "hCG Body Talk - Exercise and the HCG diet",
            "datePublished": "Thu, 17 Jun 2010 00:30:00 GMT",
            "description": "Dr. Simeons say, do not exercise while on the HCG diet. So should you? I say Hell yes! I'll explain why I think the good Dr. is wrong, and if you do chose to exercise, how to do it right for  maximum weight loss.How To Build an HCG Body For Life!",
            "length": "14630162",
            "sourceUrl": "https://www.blogtalkradio.com/thehcgdietcoach/2010/06/17/hcg-body-talk--mastering-hcg-diet-phase-3.mp3",
            "categories": [
                {
                    "_": "Health",
                    "$": {
                        "domain": "https://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "hCG Body Talk - TBD",
            "datePublished": "Thu, 10 Jun 2010 00:30:00 GMT",
            "description": "How to build your HCG Body For Life!",
            "length": "190926",
            "sourceUrl": "https://www.blogtalkradio.com/thehcgdietcoach/2010/06/10/hcg-body-talk--mastering-hcg-diet-phase-3.mp3",
            "categories": [
                {
                    "_": "Health",
                    "$": {
                        "domain": "https://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "hCG Body Talk -You can't get enough of what you don't want!",
            "datePublished": "Thu, 03 Jun 2010 00:30:00 GMT",
            "description": "In this weeks episode, we are going to discuss, how to avoid the triggers and obstacles that cause you to fail in your weight loss goal. How to get family and friends to support you, so you reach your weight loss goals. \"You can't get enough of what you don't want\"!",
            "length": "14349711",
            "sourceUrl": "https://www.blogtalkradio.com/thehcgdietcoach/2010/06/03/hcg-body-talk--mastering-hcg-diet-phase-3.mp3",
            "categories": [
                {
                    "_": "Health",
                    "$": {
                        "domain": "https://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "hCG Body For Life-  Phase 4-“Eating to live, Not living to eat.” ",
            "datePublished": "Thu, 27 May 2010 00:30:00 GMT",
            "description": "Phase 4 Re-introducing carbs and sugars into your diet. This can be a very tricky and dangerous game when it comes to maintaining your new weight. We will discuss portion control and carb shifting to make living with your new body easy!",
            "length": "12598543",
            "sourceUrl": "https://www.blogtalkradio.com/thehcgdietcoach/2010/05/27/hcg-body-talk--mastering-hcg-diet-phase-3.mp3",
            "categories": [
                {
                    "_": "Health",
                    "$": {
                        "domain": "https://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "hCG Body Talk - Mastering HCG Diet Phase 3",
            "datePublished": "Thu, 20 May 2010 00:30:00 GMT",
            "description": "Phase 3 of the HCG diet... \"The muscle building and stabilization phase\" is considered to be the most important phase of the HCG diet Protocol. Learn how to build muscle, at re-set your weight set point the right way and build your HCG Body For Life!",
            "length": "9856441",
            "sourceUrl": "https://www.blogtalkradio.com/thehcgdietcoach/2010/05/20/hcg-body-talk--mastering-hcg-diet-phase-3.mp3",
            "categories": [
                {
                    "_": "Health",
                    "$": {
                        "domain": "https://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "hCG Body Talk - HCG Diet Basics",
            "datePublished": "Thu, 13 May 2010 00:30:00 GMT",
            "description": "This episode of the show we will be covering hCG Diet Basics, Phase 1, Phase 2, What to buy,and how to preparing for success!",
            "length": "11200807",
            "sourceUrl": "https://www.blogtalkradio.com/thehcgdietcoach/2010/05/13/hcg-body-talk--hcg-diet-basics.mp3",
            "categories": [
                {
                    "_": "Health",
                    "$": {
                        "domain": "https://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "Hcg Body Talk Episode 1",
            "datePublished": "Wed, 05 May 2010 22:30:00 GMT",
            "description": "This is the first radio show which will cover the hCG Diet Basic, &  \"Don't Be A Try Baby\" Having the right mindset for hCG diet success. \r\n\r\nFor more free hCG Diet tips visit: http://HcgDietRevealed.com",
            "length": "6970433",
            "sourceUrl": "https://www.blogtalkradio.com/thehcgdietcoach/2010/05/05/hcg-body-talk-episode-1.mp3",
            "categories": [
                {
                    "_": "Health",
                    "$": {
                        "domain": "https://www.blogtalkradio.com/"
                    }
                }
            ]
        }
    ]
}