{
    "artwork": "http://is2.mzstatic.com/image/thumb/Music122/v4/44/9e/b0/449eb07f-c748-2966-2b07-d0571d3cadbc/source/100x100bb.jpg",
    "description": "The people behind The Intercept’s fearless reporting and incisive commentary—Jeremy Scahill, Glenn Greenwald, Betsy Reed and others—discuss the crucial issues of our time: national security, civil liberties, foreign policy, and criminal justice.  Plus interviews with artists, thinkers, and newsmakers who challenge our preconceptions about the world we live in.",
    "feedURL": "http://feeds.feedburner.com/InterceptedWithJeremyScahill",
    "podcastURL": "https://theintercept.com/podcasts",
    "title": "Intercepted with Jeremy Scahill",
    "episodes": [
        {
            "title": "American Mythology: The Presidency of Donald Trump (Part Seven: Climate Carnage)",
            "datePublished": "Thu, 22 Oct 2020 10:00:00 GMT",
            "description": "<p>In his denial&nbsp;of science, Donald Trump has guided the U.S. far past the tipping point of mitigating the unfolding existential threat of the climate crisis.&nbsp;Under both Democratic and Republican administrations over decades, U.S. climate policy has fallen far short of the urgent action scientists have demanded. In crucial ways, Donald Trump has been far more dangerous than his deeply-flawed predecessors. Trump seems to actually revel in his dangerous denial of fundamental and scientifically indisputable realities. In part seven of “<a href=\"https://theintercept.com/series/american-mythology/\" rel=\"noopener noreferrer\" target=\"_blank\">American Mythology</a>,” we examine how the Trump administration has catapulted the corporate-fueled deregulation crusade dramatically forward. In the past four years, Trump has undone or weakened up to 70 rules and regulations aimed at protecting the environment, while another 30 policy changes are still underway. The majority of these 100 changes are being done at the Environmental Protection Agency, which is currently headed by a former lobbyist for the coal industry who fought the Obama administration’s attempts at environmental regulations. Trump has overseen the largest rollback of federal land protection in U.S. history, opening environmentally-sensitive areas for corporate and industrial development and has portrayed himself as opening up “God’s great creation” to mining and extraction, freeing it from government protections. We analyze the corporate and industry executives and lobbyists Trump has placed in key environmental positions, his withdrawal from the Paris Climate Accord, and hear from environmentalists and scholars on how to proceed if the earth is to remain inhabitable.</p> &#10;&nbsp;<br /><hr><p style='color: grey; font - size: 0.75em; '>See <a style='color: grey; ' target='_blank' rel='noopener noreferrer' href='https://acast.com/privacy'>acast.com/privacy</a> for privacy and opt-out information.</p>",
            "length": "35164631",
            "sourceUrl": "https://sphinx.acast.com/intercepted-with-jeremy-scahill/americanmythology-thepresidencyofdonaldtrump-partseven-climatecarnage-/media.mp3"
        },
        {
            "title": "American Mythology: The Presidency of Donald Trump (Part Six: The Looting of the Nation)",
            "datePublished": "Wed, 21 Oct 2020 10:00:00 GMT",
            "description": "<p>Donald Trump has run the White House like his family business with one primary aim: to enrich his brand, his family and his cronies. In part six of American Mythology, we examine how Trump and the GOP — at times with help from the Democrats — have opened the gates to the federal feeding trough for corporate greed and unaccountability. Throughout the 2016 campaign Trump claimed that, unlike Hillary Clinton, he was not beholden to corporate or special interests and that he would uplift the working class. Once in power, he appointed record numbers of Goldman Sachs veterans to his administration, passed sweeping tax cuts for the wealthiest Americans, attacked organized labor, and chiseled away at an already abysmal health care system. Unprecedented inequality and stagnant wages have persisted. Fewer Americans currently have health insurance than when Trump was sworn into office. These sharp economic injustices have come into clear focus during the Coronavirus pandemic: Corporate robber barons like Jeff Bezos have increased their wealth by billions while 40 percent of Americans say they couldn’t withdraw $400 in the event of an unexpected emergency. In America, eight million more people have descended into poverty in recent months, as the wealth of billionaires grew by $845 billion dollars.</p> &#10;&nbsp;<br /><hr><p style='color: grey; font - size: 0.75em; '>See <a style='color: grey; ' target='_blank' rel='noopener noreferrer' href='https://acast.com/privacy'>acast.com/privacy</a> for privacy and opt-out information.</p>",
            "length": "29134394",
            "sourceUrl": "https://sphinx.acast.com/intercepted-with-jeremy-scahill/americanmythology-thepresidencyofdonaldtrump-partsix-thelootingofthenation-/media.mp3"
        },
        {
            "title": "American Mythology: The Presidency of Donald Trump (Part Five: Courting Corporate Theocracy)",
            "datePublished": "Tue, 20 Oct 2020 10:00:00 GMT",
            "description": "<p>While all eyes&nbsp;remain on the presidential election in November, Donald Trump has already secured a multi-generational victory with his radical reshaping of the judicial branch of government. In part five of “<a href=\"https://theintercept.com/series/american-mythology/\" rel=\"noopener noreferrer\" target=\"_blank\">American Mythology</a>,” we look at how the Trump administration has outsourced hundreds of federal judicial appointments to the right-wing Federalist Society and Heritage Foundation. The appointments made<a href=\"https://theintercept.com/2018/01/09/trump-judicial-nominees-2018-senate-democrats/\" rel=\"noopener noreferrer\" target=\"_blank\">&nbsp;during the past four years</a>&nbsp;will impact almost every aspect of life in the U.S.: health care, marriage equality, worker’s rights, freedom of speech and press, guns, racism, women’s rights, war powers, and others. We dig into the ideologies and organizations at the center of Trump’s judicial strategy, the influence of the Koch brothers, and the&nbsp;<a href=\"https://theintercept.com/2018/10/04/brett-kavanaugh-supreme-court-confirmation-corporate-regulations/\" rel=\"noopener noreferrer\" target=\"_blank\">corporate</a>&nbsp;and social agenda the GOP wants their new judges to impose. The stakes go well beyond the 2020 election: The impact of an extreme right-wing Supreme Court majority not only&nbsp;<a href=\"https://theintercept.com/2020/10/11/abortion-supreme-court-amy-coney-barrett/\" rel=\"noopener noreferrer\" target=\"_blank\">threatens reproductive rights</a>, it could shut down any progressive attempts at lawmaking for decades to come.&nbsp;In some ways, confirming Judge Amy Coney Barrett is more important to the GOP than Trump winning reelection.</p> &#10;&nbsp;<br /><hr><p style='color: grey; font - size: 0.75em; '>See <a style='color: grey; ' target='_blank' rel='noopener noreferrer' href='https://acast.com/privacy'>acast.com/privacy</a> for privacy and opt-out information.</p>",
            "length": "27749955",
            "sourceUrl": "https://sphinx.acast.com/intercepted-with-jeremy-scahill/americanmythology-thepresidencyofdonaldtrump-partfive-courtingcorporatetheocracy-/media.mp3"
        },
        {
            "title": "American Mythology: The Presidency of Donald Trump (Part Four: \"You Think Our Country's So Innocent?\")",
            "datePublished": "Mon, 19 Oct 2020 10:00:00 GMT",
            "description": "<p>On matters of&nbsp;war, Donald Trump has consistently spoken and acted in contradictory and unorthodox ways. He campaigned in 2016 with a mixed message of attacking the legacy of the Iraq war and U.S. military adventurism, while simultaneously pledging to commit war crimes and promote imperialism as a matter of policy. On part four of American Mythology, we take an in-depth look at Trump’s war and national security policies. He escalated drone strikes in Somalia and Afghanistan, authorized troop surges and massive bombings in Iraq, launched cruise missile strikes in Syria, and threatened to “totally destroy North Korea.” On the other hand, he signed a deal with the Taliban to withdraw U.S. forces, attempted to end the Korean War, and claims to have fired John Bolton to avoid being in “World War 6.” In assessing Trump’s war policies, we seek to navigate past the rhetoric from Trump and his critics and examine his place in the history of U.S. presidents. In many ways, Trump has represented a continuity of U.S. policy with largely tactical differences from his predecessors. Overall, Trump built on some of the worst excesses of the Bush/Cheney administration and took advantage of the weak guardrails left behind by the Obama administration.</p> &#10;&nbsp;<br /><hr><p style='color: grey; font - size: 0.75em; '>See <a style='color: grey; ' target='_blank' rel='noopener noreferrer' href='https://acast.com/privacy'>acast.com/privacy</a> for privacy and opt-out information.</p>",
            "length": "64517676",
            "sourceUrl": "https://sphinx.acast.com/intercepted-with-jeremy-scahill/americanmythology-thepresidencyofdonaldtrump-partfour-youthinkourcountryssoinnocent-/media.mp3"
        },
        {
            "title": "American Mythology: The Presidency of Donald Trump (Part Three: The Neo-Confederate in Chief)",
            "datePublished": "Fri, 16 Oct 2020 10:00:00 GMT",
            "description": "<p>On the campaign&nbsp;and as president, Donald Trump has worked hard to resurrect the George Wallace strand of U.S. politics: He has consistently used racist and bigoted language to accompany his policy onslaughts. In part three of American Mythology, we examine the ways Trump has used racialized fear-mongering and incitement in both word and deed; from his Muslim ban, to his denigration of immigrants, to his attacks on the Black Lives Matter Movement. Trump has openly encouraged police to act extrajudicially, brutally, and with impunity, while simultaneously emboldening violent white nationalists and militias. He has even defended a young man accused of shooting and killing BLM protesters. As he campaigns for reelection, Trump is hedging on many of his 2016 tactics, but now is backed by the&nbsp;extraordinary power of the executive branch. The Justice Department, virtually privatized by Trump, appears to be coordinating its official functions with his reelection effort.&nbsp;Trump is intensifying his voter disenfranchisement operation and he has threatened to remain in office regardless of the election results. We dig deep into Trump, race, and the wars at home.</p> &#10;&nbsp;<br /><hr><p style='color: grey; font - size: 0.75em; '>See <a style='color: grey; ' target='_blank' rel='noopener noreferrer' href='https://acast.com/privacy'>acast.com/privacy</a> for privacy and opt-out information.</p>",
            "length": "51246234",
            "sourceUrl": "https://sphinx.acast.com/intercepted-with-jeremy-scahill/americanmythology-thepresidencyofdonaldtrump-partthree-theneo-confederateinchief-/media.mp3"
        },
        {
            "title": "American Mythology: The Presidency of Donald Trump (Part Two: Administration of Xenophobia)",
            "datePublished": "Thu, 15 Oct 2020 10:00:01 GMT",
            "description": "<p>In the nearly&nbsp;four years that Trump has been in office, his administration has&nbsp;<a href=\"https://theintercept.com/collections/the-war-on-immigrants/\" rel=\"noopener noreferrer\" target=\"_blank\">transformed U.S. immigration</a>&nbsp;at a breakneck pace and governed with an overtly xenophobic posture toward immigrants. In episode two of our audio documentary series “<a href=\"https://theintercept.com/series/american-mythology/\" rel=\"noopener noreferrer\" target=\"_blank\">American Mythology</a>,” we chronicle the Trump administration’s war against immigrants from the southern border to the Muslim ban and beyond. Trump has already implemented more than 400 changes to immigration rules and regulations, changes that will impact millions of people. But to portray the extremism of this administration on immigration as an entirely radical departure from decades of policy under Democrats and Republicans is inaccurate. While Trump has wielded his signature cruelty in implementing new policy and has made some far-reaching changes, significant aspects of his policy are rooted in the agendas of his predecessors, from Bill Clinton to George W. Bush and Barack Obama. Trump inherited an already punitive and authoritarian deportation machine constructed by both his Democratic and Republican predecessors and has taken it to new extremes. This episode offers an overview of what has changed and what has remained the same, featuring&nbsp;the voices of lawyers, immigrants, activists, journalists, and others who are on the front lines of the battle over immigrant rights.</p> &#10;&nbsp;<br /><hr><p style='color: grey; font - size: 0.75em; '>See <a style='color: grey; ' target='_blank' rel='noopener noreferrer' href='https://acast.com/privacy'>acast.com/privacy</a> for privacy and opt-out information.</p>",
            "length": "36705868",
            "sourceUrl": "https://sphinx.acast.com/intercepted-with-jeremy-scahill/americanmythology-thepresidencyofdonaldtrump-parttwo-administrationofxenophobia-/media.mp3"
        },
        {
            "title": "American Mythology: The Presidency of Donald Trump (Part One: Manufacturing the Carnage)",
            "datePublished": "Wed, 14 Oct 2020 10:00:09 GMT",
            "description": "<p>Donald Trump is&nbsp;often portrayed as an aberration of U.S. history, an outsider who seized power and is intent on destroying democracy as we know it. In the premiere episode of American Mythology, we examine the ways that Trump has proven to be a particularly dangerous autocrat who doesn’t believe in any semblance of a democratic process. But that story cannot be told without also exploring how various U.S. systems and the policies of Trump’s predecessors carved the way for many of his most dangerous actions.&nbsp;Featuring interviews with lawmakers, journalists, activists and dissidents, world renowned historians, and constitutional scholars and lawyers on the front lines of scores of battles against the Trump administration, this episode offers an overview of how the Republican Party has embraced Trump as a Trojan horse to ram through its most extreme — and long-standing — policy agendas. It also probes the role of Democratic Party leaders in facilitating some of Trump and the GOP’s most dangerous policies and lays out the stakes of the 2020 presidential election, which Trump is already calling illegitimate.</p> &#10;&nbsp;<br /><hr><p style='color: grey; font - size: 0.75em; '>See <a style='color: grey; ' target='_blank' rel='noopener noreferrer' href='https://acast.com/privacy'>acast.com/privacy</a> for privacy and opt-out information.</p>",
            "length": "49823852",
            "sourceUrl": "https://sphinx.acast.com/intercepted-with-jeremy-scahill/americanmythology-thepresidencyofdonaldtrump-partone-manufacturingthecarnage-/media.mp3"
        },
        {
            "title": "BONUS: A Story of Asylum, and Musician Lido Pimienta on Her New Album \"Miss Colombia\"",
            "datePublished": "Wed, 16 Sep 2020 10:00:00 GMT",
            "description": "<p>On this bonus episode of Intercepted, journalist John Washington, whose latest reporting for The Intercept expanded on an explosive new whistleblower complaint alleging that mass hysterectomies occurred at an ICE detention facility, reads an excerpt from his new book, “The Dispossessed: A Story of Asylum and the US-Mexican Border and Beyond.” And the Colombian-Canadian musician Lido Pimienta talks about her latest album,&nbsp;<em>Miss Colombia</em>, and how the 2015 Miss Universe Pageant inspired her to look critically at anti-blackness in Colombia. She’s currently organizing a relief fund for Colombian families affected by Covid-19, which you can learn more about <a href=\"https://www.gofundme.com/f/243qv4ds40\" rel=\"noopener noreferrer\" target=\"_blank\">here</a>.</p><p><br></p><p>A very special thanks to our friend Francisco Bravo for his help with this episode.</p> &#10;&nbsp;<br /><hr><p style='color: grey; font - size: 0.75em; '>See <a style='color: grey; ' target='_blank' rel='noopener noreferrer' href='https://acast.com/privacy'>acast.com/privacy</a> for privacy and opt-out information.</p>",
            "length": "36074381",
            "sourceUrl": "https://sphinx.acast.com/intercepted-with-jeremy-scahill/bonus-astoryofasylum-andmusicianlidopimientaonhernewalbummisscolombia/media.mp3"
        },
        {
            "title": "Escape From the Nuclear Family: Covid-19 Should Provoke a Re-Think of How We Live",
            "datePublished": "Wed, 05 Aug 2020 10:00:35 GMT",
            "description": "<p>As Washington cuts off desperately needed aid to the unemployed, millions of families face the reality that many K-12 schools likely aren’t reopening, and young adults look ahead to a bleak future, reality is setting in that the Covid 19 crisis was not a blip. This week on Intercepted: guest host Naomi Klein argues that it’s time for some big bold thinking about how we can safely live, work, and learn with the virus — and maybe even enjoy ourselves. She takes us to visit friends in Oakland, California who have been living in a multi-family housing compound for years. Longtime environmental justice organizer and co-founder of&nbsp;<a href=\"https://movementgeneration.org/\" rel=\"noopener noreferrer\" target=\"_blank\">Movement Generation</a>&nbsp;Gopal Dayeneni explains that living in a democratic community with friends, rather than a single-family home, has meant far more capacity to deal with the labor of lockdown, and far less isolation for everyone. Klein is also joined by Rutgers University- Newark historian Neil Maher to discuss how a reboot of the New Deal-era Civilian Conservation Corps could provide opportunities for young adults to find work, battle climate disruption, and live in their own communities of peers.</p> &#10;&nbsp;<br /><hr><p style='color: grey; font - size: 0.75em; '>See <a style='color: grey; ' target='_blank' rel='noopener noreferrer' href='https://acast.com/privacy'>acast.com/privacy</a> for privacy and opt-out information.</p>",
            "length": "79329791",
            "sourceUrl": "https://sphinx.acast.com/intercepted-with-jeremy-scahill/escapefromthenuclearfamily-covid-19shouldprovokeare-thinkofhowwelive/media.mp3"
        },
        {
            "title": "Weak State: How the Coronavirus Pandemic Exposed America’s Dysfunctional Democracy",
            "datePublished": "Wed, 22 Jul 2020 10:00:00 GMT",
            "description": "<p>As Donald Trump&nbsp;promises the pandemic will&nbsp;“disappear,” the U.S. simultaneously grapples with a public health disaster, economic collapse, and a social crisis. This week on Intercepted: The Intercept’s Murtaza Hussain is joined by military expert and&nbsp;anthropologist David&nbsp;Kilcullen.&nbsp;He&nbsp;discusses the global national security implications unleashed by the coronavirus and the decline in U.S. dominance and the liberal international system.&nbsp;Kilcullen&nbsp;also examines the catastrophic consequences that could come from rising tensions within the country and between the U.S. and China. Hussain is also joined by Indian writer&nbsp;Pankaj Mishra, author of many books, including,“From the Ruins of Empire: The Intellectuals Who Remade Asia.” Mishra lays out how the rise of free market ideology in the U.S. and Britain has undermined democracy and diminished social protections for ordinary people. He dismisses the idea of a Joe Biden administration as any departure from the status quo and describes how hope lies in the power of nonviolent social movements.</p> &#10;&nbsp;<br /><hr><p style='color: grey; font - size: 0.75em; '>See <a style='color: grey; ' target='_blank' rel='noopener noreferrer' href='https://acast.com/privacy'>acast.com/privacy</a> for privacy and opt-out information.</p>",
            "length": "53635502",
            "sourceUrl": "https://sphinx.acast.com/intercepted-with-jeremy-scahill/weakstate-howthecoronaviruspandemicexposedamerica-sdysfunctionaldemocracy/media.mp3"
        },
        {
            "title": "The Revolutionary Life of Paul Robeson: Scholar Gerald Horne on the Great Antifascist Singer, Artist and Rebel",
            "datePublished": "Wed, 15 Jul 2020 10:00:00 GMT",
            "description": "<p>As Trump vows to smash leftist movements, we take a comprehensive look at the life of the revolutionary Black socialist, antifascist, and artist Paul Robeson. University of Houston historian Dr. Gerald Horne, author of “Paul Robeson: The Artist as Revolutionary,” discusses Robeson’s life from his early years to his time in Europe on the brink of a fascist war. The son of an escaped slave, Robeson rose to international fame as a singer and actor, but committed himself to the liberation of oppressed people across the globe and was a tenacious fighter for the freedom of Black people in the U.S. Robeson was heavily surveilled by the FBI and CIA, dragged before the House Un-American Activities Committee and was stripped of his passport by a U.S. government afraid that he would become a “Black Stalin.”</p> &#10;&nbsp;<br /><hr><p style='color: grey; font - size: 0.75em; '>See <a style='color: grey; ' target='_blank' rel='noopener noreferrer' href='https://acast.com/privacy'>acast.com/privacy</a> for privacy and opt-out information.</p>",
            "length": "66405710",
            "sourceUrl": "https://sphinx.acast.com/intercepted-with-jeremy-scahill/therevolutionarylifeofpaulrobeson-scholargeraldhorneonthegreatantifascistsinger-artistandrebel/media.mp3"
        },
        {
            "title": "An Interview with Nancy Pelosi Challenger Shahid Buttar and a Look at the History of Fascist Movements in the U.S.",
            "datePublished": "Wed, 08 Jul 2020 10:01:00 GMT",
            "description": "<p>A bipartisan coalition&nbsp;of lawmakers led by Rep. Liz Cheney, daughter of Dick Cheney, is trying to stop Trump from withdrawing troops from Afghanistan. This week on Intercepted: As the longest continuous war in U.S. history enters its 19th year, Congressional Democrats and Republicans are joining together in an effort to keep the war going. Constitutional lawyer and activist Shahid Buttar, who is challenging House Speaker Nancy Pelosi for her Congressional seat in San Francisco, alleges that Pelosi’s leadership during the Trump era has amounted to enabling Trump at his worst while simultaneously working to block the potential good that could come from ending the Afghanistan war. Buttar also discusses his views on surveillance, the climate crisis, the role of large tech companies in violating human rights, and he assesses the state of the Democratic Party ahead of the November elections.</p><p><br></p><p>In a spate of recent speeches, Donald Trump has portrayed himself as a noble warrior in the battle to protect America’s heritage. He is consistently railing against a long list of perceived enemies, including anarchists, Marxists, immigrants, while preemptively casting doubts on the validity of the 2020 election. And as he campaigns, Trump is increasingly operating — whether intentional or not —&nbsp;from a playbook that is eerily reminiscent of the America First movement in the United States that operated in the 1930s. These were allies of Germany’s Nazi Party, the most famous amongst them was famed pilot Charles Lindbergh. California State University historian Bradley W. Hart, author of “Hitler's American Friends: The Third Reich's Supporters in the United States,” discusses the history of the movements and figures in U.S. history who supported Hitler and the Third Reich in the years before and during World War II. Hart also discusses Hitler’s affection for Henry Ford and details the rise and fall of radical rightwing radio host Fr. Charles Coughlin whose broadcasts into tens of millions of homes built support for fascism in the U.S.</p> &#10;&nbsp;<br /><hr><p style='color: grey; font - size: 0.75em; '>See <a style='color: grey; ' target='_blank' rel='noopener noreferrer' href='https://acast.com/privacy'>acast.com/privacy</a> for privacy and opt-out information.</p>",
            "length": "73093973",
            "sourceUrl": "https://sphinx.acast.com/intercepted-with-jeremy-scahill/aninterviewwithnancypelosichallengershahidbuttarandalookatthehistoryoffascistmovementsintheu.s-/media.mp3"
        },
        {
            "title": "Confederacy Inc.: Donald Trump, Racist Police, and the Whitewashing of History",
            "datePublished": "Wed, 01 Jul 2020 10:00:48 GMT",
            "description": "<p>As cases of Covid-19 skyrocket across the U.S., Trump&nbsp;passionately focuses&nbsp;on defending the legacy of the Confederacy and white supremacist monuments. Native American historian Nick Estes explains the crimes against Indigenous people committed by the four presidents whose faces are carved into Mount Rushmore.</p><p><br></p><p>Black Lives Matter&nbsp;demonstrations against police brutality&nbsp;and systemic racism continue across the U.S. as calls to defund the police intensify. University of Iowa historian Simon Balto, author of the new book “Occupied Territory: Policing Black Chicago from Red Summer to Black Power,” lays out the origins of the Chicago Police Department as a moralistic enforcement agency in the late 1800s and its transformation into a militarized terror force deployed to&nbsp;control Black people in Chicago while simultaneously crushing movements for workers rights, tenant rights, and basic human rights.</p> &#10;&nbsp;<br /><hr><p style='color: grey; font - size: 0.75em; '>See <a style='color: grey; ' target='_blank' rel='noopener noreferrer' href='https://acast.com/privacy'>acast.com/privacy</a> for privacy and opt-out information.</p>",
            "length": "61450499",
            "sourceUrl": "https://sphinx.acast.com/intercepted-with-jeremy-scahill/confederacyinc.-donaldtrump-racistpolice-andthewhitewashingofhistory/media.mp3"
        },
        {
            "title": "The Rebellion Against Racial Capitalism",
            "datePublished": "Wed, 24 Jun 2020 10:00:00 GMT",
            "description": "<p>Dr. Robin D.G. Kelley, a distinguished history professor at UCLA, explains why he believes the current abolitionist movement has the potential to fundamentally change the country and offers a historical analysis of the weaponization of racial capitalism throughout U.S. history. He also tells the story of the Black-led communist party of Alabama in the aftermath of the Great Depression and the racist roots of U.S.-style policing.</p><p><br></p><p>As Attorney General William Barr continues to preside over a Justice Department being wielded as a political and legal weapon to defend Trump, Hina Shamsi of the ACLU explains the dangerous use of military and intelligence surveillance systems to spy on activists, the characterizations of activists as terrorists, and discusses the ongoing drone strikes overseas.</p> &#10;&nbsp;<br /><hr><p style='color: grey; font - size: 0.75em; '>See <a style='color: grey; ' target='_blank' rel='noopener noreferrer' href='https://acast.com/privacy'>acast.com/privacy</a> for privacy and opt-out information.</p>",
            "length": "101017122",
            "sourceUrl": "https://sphinx.acast.com/intercepted-with-jeremy-scahill/therebellionagainstracialcapitalism/media.mp3"
        },
        {
            "title": "Ruth Wilson Gilmore Makes the Case for Abolition (Part 2)",
            "datePublished": "Wed, 10 Jun 2020 17:01:00 GMT",
            "description": "<p>Chenjerai Kumanyika, assistant professor of journalism and media studies at Rutgers University, hosts a special two part discussion. Kumanyika is co-host of the podcasts Uncivil and Scene on Radio. He is an organizer with 215 People’s Alliance,&nbsp;and the Debt Collective. He is joined for this special episode of Intercepted by&nbsp;the iconic geographer and abolitionist Ruth Wilson Gilmore, author of \"Golden Gulag: Prisons, Surplus, Crisis, and Opposition in Globalizing California.\" Gilmore is one of the world’s preeminent scholars on prisons and the machinery of carceral punishment and policing. In this discussion,&nbsp;she offers a sweeping and detailed analysis of the relentless expansion and funding of&nbsp;police and prisons, and how&nbsp;locking people in cages has become central to the American project.&nbsp;Gilmore offers a comprehensive road map for understanding how we have arrived at the present political moment of brutality and rebellion, and&nbsp;she lays out the need&nbsp;for prison abolition and defunding police forces.</p> &#10;&nbsp;<br /><hr><p style='color: grey; font - size: 0.75em; '>See <a style='color: grey; ' target='_blank' rel='noopener noreferrer' href='https://acast.com/privacy'>acast.com/privacy</a> for privacy and opt-out information.</p>",
            "length": "30000676",
            "sourceUrl": "https://sphinx.acast.com/intercepted-with-jeremy-scahill/ruthwilsongilmoremakesthecaseforabolition-part2-/media.mp3"
        },
        {
            "title": "Ruth Wilson Gilmore Makes the Case for Abolition (Part 1)",
            "datePublished": "Wed, 10 Jun 2020 17:00:00 GMT",
            "description": "<p>Chenjerai Kumanyika, assistant professor of journalism and media studies at Rutgers University, hosts a special two part discussion. Kumanyika is co-host of the podcasts Uncivil and Scene on Radio. He is an organizer with 215 People’s Alliance,&nbsp;and the Debt Collective. He is joined for this special episode of Intercepted by&nbsp;the iconic geographer and abolitionist Ruth Wilson Gilmore, author of \"Golden Gulag: Prisons, Surplus, Crisis, and Opposition in Globalizing California.\" Gilmore is one of the world’s preeminent scholars on prisons and the machinery of carceral punishment and policing. In this discussion,&nbsp;she offers a sweeping and detailed analysis of the relentless expansion and funding of&nbsp;police and prisons, and how&nbsp;locking people in cages has become central to the American project.&nbsp;Gilmore offers a comprehensive road map for understanding how we have arrived at the present political moment of brutality and rebellion, and&nbsp;she lays out the need&nbsp;for prison abolition and defunding police forces.</p> &#10;&nbsp;<br /><hr><p style='color: grey; font - size: 0.75em; '>See <a style='color: grey; ' target='_blank' rel='noopener noreferrer' href='https://acast.com/privacy'>acast.com/privacy</a> for privacy and opt-out information.</p>",
            "length": "52621045",
            "sourceUrl": "https://sphinx.acast.com/intercepted-with-jeremy-scahill/ruthwilsongilmoremakesthecaseforabolition-part1-/media.mp3"
        },
        {
            "title": "The Rebellion in Defense of Black Lives Is Rooted in U.S. History. So Too Is Trump’s Authoritarian Rule",
            "datePublished": "Wed, 03 Jun 2020 17:00:00 GMT",
            "description": "<p>With the threat of a widespread military deployment in U.S. cities looming, the president is acting as an authoritarian dictator. Dr. Keisha Blain, author of \"Set the World on Fire: Black Nationalist Women and the Global Struggle for Freedom,\" discusses the history of black rebellion against police violence, the deadly ‘Red Summer” of 1919, and the life of Ida B. Wells. Dr. Blain, a history professor at the University of Pittsburgh, also discusses the context of various protests tactics and the weaponization of the legacy of Dr. Martin Luther King, Jr. Police forces across the U.S. are functioning as violent militias equipped with military gear. Operating like a violent counterinsurgency force, the government has used drones and is using other military and intelligence-grade surveillance systems on protesters. Stuart Schrader, author of \"Badges Without Borders: How Global Counterinsurgency Transformed American Policing\" and a lecturer at Johns Hopkins, analyzes the long and intertwined history between policing in the U.S. and abroad. Schrader also discusses the context of U.S. military deployment on&nbsp;American soil and the long tradition of militarized police forces.</p> &#10;&nbsp;<br /><hr><p style='color: grey; font - size: 0.75em; '>See <a style='color: grey; ' target='_blank' rel='noopener noreferrer' href='https://acast.com/privacy'>acast.com/privacy</a> for privacy and opt-out information.</p>",
            "length": "171358055",
            "sourceUrl": "https://sphinx.acast.com/intercepted-with-jeremy-scahill/therebellionindefenseofblacklivesisrootedinu.s.history.sotooistrump-sauthoritarianrule/media.mp3"
        },
        {
            "title": "The Disenfranchiser: Donald Trump’s Attack on Voting Rights and the Threat to Native Sovereignty",
            "datePublished": "Wed, 27 May 2020 17:00:00 GMT",
            "description": "<p>The modern Republican Party has mastered the art of voter suppression and gerrymandering, but the president is now seeking to exploit the pandemic to aid these efforts. In between tweets accusing Joe Scarborough of being involved with the death of an intern decades ago and spending time on the golf course as the U.S. neared 100,000 coronavirus deaths, Trump has offered an overwhelmingly fictional narrative about Democratic voter fraud punctuated by warnings of the election being illegitimate before a single vote has been cast. Mother Jones senior reporter Ari Berman, author of \"Give Us The Ballot: The Modern Struggle for Voting Rights in America,\" analyzes the strategy of Trump and the GOP and lays out what he considers the nightmare scenario for the November election. As Trump continues to downplay the human toll of Covid-19, he is doubling down on his push for states to quickly reopen. Many of the states that have reopened surround Indian country and the Chairman of the Hopi Tribe reservation says, “we have a wildfire burning around us.”&nbsp;Journalist Rebecca Nagle, host of the podcast This Land, discusses how the coronavirus is disproportionately impacting native communities, explains some major cases before the U.S. Supreme Court on indigenous land rights, and talks about Trump’s battles against native tribes.</p> &#10;&nbsp;<br /><hr><p style='color: grey; font - size: 0.75em; '>See <a style='color: grey; ' target='_blank' rel='noopener noreferrer' href='https://acast.com/privacy'>acast.com/privacy</a> for privacy and opt-out information.</p>",
            "length": "66492149",
            "sourceUrl": "https://sphinx.acast.com/intercepted-with-jeremy-scahill/thedisenfranchiser-donaldtrump-sattackonvotingrightsandthethreattonativesovereignty/media.mp3"
        },
        {
            "title": "The Jungle and the Pandemic: The Meat Industry, Coronavirus, and an Economy in Crisis",
            "datePublished": "Wed, 20 May 2020 17:00:00 GMT",
            "description": "<p>As the Covid-19 U.S. death toll climbs toward 100,000 and unemployment is nearing 20 percent, House Democrats have offered up a bill that is intended to offer a sharp contrast to the corporatist Republican agenda. HuffPost senior reporter Zach Carter analyzes how Nancy Pelosi quashed progressive calls for action within her own party and delivered a bill filled with corporate gifts, means-tested crumbs for many, along with some good proposals. Carter also discusses his new book \"The Price of Peace: Money, Democracy, and the Life of John Maynard Keynes\" and the influence the famed economist maintains to this day. As Trump claims the meat industry is back on track, meat plant workers are getting sick in droves. Even before the coronavirus pandemic, the industry consistently maintains the highest workplace injury rate among manufacturing and private industry. Journalist Ted Genoways, author of “The Chain: Farm, Factory, and the Fate of Our Food,” discusses the lives and deaths of meat workers and looks back at Upton Sinclair’s novel “The Jungle” and its parallels to the modern meat industry. Other podcasts make money from advertising and corporate sponsors. We don’t have ads — Intercepted is powered by its members. When you support Intercepted, you become a part of the journalism that holds the powerful to account. Become a member — together we can make a difference. This is a community effort. Your donation, no matter the amount, makes a difference. Generous support of listeners like you is what makes our fierce and independent reporting possible. Do what you can. Become a member at theintercept.com/join.&nbsp;All donations are welcome. You can make a one-time gift or become a sustaining member.</p> &#10;&nbsp;<br /><hr><p style='color: grey; font - size: 0.75em; '>See <a style='color: grey; ' target='_blank' rel='noopener noreferrer' href='https://acast.com/privacy'>acast.com/privacy</a> for privacy and opt-out information.</p>",
            "length": "61972176",
            "sourceUrl": "https://sphinx.acast.com/intercepted-with-jeremy-scahill/thejungleandthepandemic-themeatindustry-coronavirus-andaneconomyincrisis/media.mp3"
        },
        {
            "title": "What Reconstruction and the New Deal Can Teach Us About What Comes After the Pandemic Presidency",
            "datePublished": "Wed, 13 May 2020 17:00:00 GMT",
            "description": "<p>David Blight, Pulitzer prize winning author of \"Frederick Douglass: Prophet of Freedom\" and a Yale history professor, discusses the era of Reconstruction, the swift dismantling of its hard fought gains, and the enduring power of white supremacy. As Joe Biden talks of building a presidency in the spirit of FDR and the New Deal, Greg Grandin, whose book \"The End of the Myth: From the Frontier to the Border Wall in the Mind of America\" won the 2020 Pulitzer in nonfiction, discusses the battle for the New Deal, who was left out of its gains, and analyzes what such a program would look like in the aftermath of the Trump presidency.</p> &#10;&nbsp;<br /><hr><p style='color: grey; font - size: 0.75em; '>See <a style='color: grey; ' target='_blank' rel='noopener noreferrer' href='https://acast.com/privacy'>acast.com/privacy</a> for privacy and opt-out information.</p>",
            "length": "76182436",
            "sourceUrl": "https://sphinx.acast.com/intercepted-with-jeremy-scahill/whatreconstructionandthenewdealcanteachusaboutwhatcomesafterthepandemicpresidency/media.mp3"
        },
        {
            "title": "Donald Trump, Joe Biden, and the Politics of Sexual Misconduct",
            "datePublished": "Wed, 06 May 2020 17:00:00 GMT",
            "description": "<p>Two dozen women have accused Donald Trump of sexual misconduct, harassment and assault, including rape. Trump has responded by denigrating, mocking and attacking his accusers. Eight women have made allegations of misconduct against Biden and one of them has accused him of sexual assault. Biden, who is running on a campaign to restore dignity and honesty to the White House, emphatically denies he assaulted his former staffer Tara Reade and has sought to explain away his conduct toward his other accusers by portraying his unwanted touching as his way of being affectionate. The New Republic’s Melissa Gira Grant discusses Reade’s allegations, Biden’s response and the broader discourse in the media and Democratic Party surrounding the actions of the presumptive nominee toward women. And former Nevada lawmaker Lucy Flores says Joe Biden touched her inappropriately, kissed her head and sniffed her hair when he was campaigning for her. She says she didn’t report it to the Obama White House at the time for fear of retaliation or rejection, but when Biden began to run for president she felt an obligation to speak out. Flores was soon followed by seven other women sharing similar stories. She discusses her experience with Biden, what it means that the Democratic party is standing by him and the impact of a choice between Trump and Biden.</p> &#10;&nbsp;<br /><hr><p style='color: grey; font - size: 0.75em; '>See <a style='color: grey; ' target='_blank' rel='noopener noreferrer' href='https://acast.com/privacy'>acast.com/privacy</a> for privacy and opt-out information.</p>",
            "length": "80523059",
            "sourceUrl": "https://sphinx.acast.com/intercepted-with-jeremy-scahill/donaldtrump-joebiden-andthepoliticsofsexualmisconduct/media.mp3"
        },
        {
            "title": "BONUS: Race, Trust, and the Chicago Police — The Investigation of Courtney Copeland’s Murder",
            "datePublished": "Fri, 01 May 2020 10:00:00 GMT",
            "description": "\n        <p>The new podcast <a href=\"https://theintercept.com/podcasts/somebody/\">Somebody</a> documents Shapearl Wells’s quest to find out what happened to Courtney Copeland, her 22-year-old son who wound up with a bullet in his back outside a Chicago police station in 2016 and died soon after.</p><p>On April 30, Topic Studios, The Intercept, and Chicago-based journalism nonprofit Invisible Institute presented <a href=\"https://theintercept.com/2020/04/28/race-trust-chicago-police-somebody-podcast/\">a live conversation</a> and listening session focused on Shapearl’s experiences confronting Chicago Police and challenging the city’s long-standing racial disparities. The event was hosted by Intercept co-founding editor Jeremy Scahill and featured Somebody co-hosts Shapearl and Alison Flowers, a journalist at the Invisible Institute.</p>\n       &#10;&nbsp;<br /><hr><p style='color: grey; font - size: 0.75em; '>See <a style='color: grey; ' target='_blank' rel='noopener noreferrer' href='https://acast.com/privacy'>acast.com/privacy</a> for privacy and opt-out information.</p>",
            "length": "118640145",
            "sourceUrl": "https://sphinx.acast.com/intercepted-with-jeremy-scahill/bonus-race-trust-andthechicagopolice-theinvestigationofcourtneycopeland-smurder/media.mp3"
        },
        {
            "title": "Viral Injustice",
            "datePublished": "Wed, 29 Apr 2020 10:00:00 GMT",
            "description": "\n        <p>While the statistics are grim, the harsh reality is how the Trump administration — as well as some governors and mayors — handled this crisis made the situation much more deadly than it should have been. New York Magazine writer Zak Cheney-Rice discusses how the economic, social, racial, and gender injustices that predate this pandemic have impacted the most vulnerable people in the United States. He also discusses Trump’s incompetence, Joe Biden’s strategy of being seldom seen or heard, and how all of this might impact the 2020 presidential election.</p><p>Trump and his radical anti-immigrant minion Stephen Miller are already exploiting the crisis to ram through radical measures aimed at immigrants, as ICE deports detainees infected with the coronavirus disease. John Washington, author of “The Dispossessed: A Story of Asylum at the U.S.-Mexico Border and Beyond,” discusses the dueling messages to migrant workers from a White House that openly espouses hate and wants them deported while government agencies have categorized many as “essential workers.” Washington also discusses his latest piece for The Intercept, “We Need to Reverse the Damage Trump Has Done in Latin America. Biden’s Plans Don’t Cut It.”</p><p>And Intercepted listeners share more of their stories of life during the pandemic.</p><p><em>If you or someone you know needs emotional support or is contemplating suicide, resources include the </em><a href=\"https://www.crisistextline.org/text-us/\"><em>Crisis Text Line</em></a><em>, the </em><a href=\"https://suicidepreventionlifeline.org/talk-to-someone-now/\"><em>Suicide Prevention Lifeline</em></a><em>, </em><a href=\"https://www.thetrevorproject.org/\"><em>the Trevor Project</em></a><em>, or </em><a href=\"https://www.iasp.info/\"><em>the International Association for Suicide Prevention</em></a><em>.</em></p>\n       &#10;&nbsp;<br /><hr><p style='color: grey; font - size: 0.75em; '>See <a style='color: grey; ' target='_blank' rel='noopener noreferrer' href='https://acast.com/privacy'>acast.com/privacy</a> for privacy and opt-out information.</p>",
            "length": "66809306",
            "sourceUrl": "https://sphinx.acast.com/intercepted-with-jeremy-scahill/viralinjustice/media.mp3"
        },
        {
            "title": "Coronavirus and the Radical Religious Right's Bumbling Messiah",
            "datePublished": "Wed, 22 Apr 2020 10:00:00 GMT",
            "description": "\n        <p>Hidden behind the scenes of protests against Democratic governors is the role of radical fringe groups, gun enthusiasts, and right-wing financiers, some with ties to the family of Education Secretary Betsy DeVos. Author Jeff Sharlet discusses the rise of right-wing religious extremists, influential members, their broader strategy, and how the shutdown protesters are being used as disposable pawns in a much longer game. Sharlet’s books “The Family” and “C-Street” chronicle the history and strategy now permeating the Trump administration and the Republican Party.</p><p>As his administration rolls out its phased plan for “re-opening America,” Dr. Seema Yasmin, a former officer in the Epidemic Intelligence Service at the U.S. Centers for Disease Control and Prevention, analyzes the insanity of Trump’s daily briefings, his strategy to withhold aid from states based on how nice governors are to him, and what should be done to overcome the pandemic scientifically and socially. Plus, Intercepted listeners share their often gut-wrenching stories of struggling to survive in a country rocked by the nightmare of economic uncertainty in the time of the coronavirus crisis.</p><p><em>If you or someone you know needs emotional support or is contemplating suicide, resources include the </em><a href=\"https://www.crisistextline.org/text-us/\"><em>Crisis Text Line</em></a><em>, the </em><a href=\"https://suicidepreventionlifeline.org/talk-to-someone-now/\"><em>Suicide Prevention Lifeline</em></a><em>, </em><a href=\"https://www.thetrevorproject.org/\"><em>the Trevor Project</em></a><em>, or </em><a href=\"https://www.iasp.info/\"><em>the International Association for Suicide Prevention</em></a><em>.</em></p>\n       &#10;&nbsp;<br /><hr><p style='color: grey; font - size: 0.75em; '>See <a style='color: grey; ' target='_blank' rel='noopener noreferrer' href='https://acast.com/privacy'>acast.com/privacy</a> for privacy and opt-out information.</p>",
            "length": "63739274",
            "sourceUrl": "https://sphinx.acast.com/intercepted-with-jeremy-scahill/coronavirusandtheradicalreligiousrightsbumblingmessiah/media.mp3"
        },
        {
            "title": "BONUS: \"Burials Are Cheaper Than Deportations\"",
            "datePublished": "Fri, 17 Apr 2020 10:00:00 GMT",
            "description": "\n        <p>Across the United States right now, there are over 32,000 people in the custody of Immigration and Customs Enforcement, otherwise known as ICE. </p><p>Tucked away in remote corners of the country, ICE’s detention centers have long had issues with providing adequate medical care, and have been proven breeding grounds for disease. Just last year, an outbreak of mumps overtook dozens of ICE facilities, infecting nearly 900 detainees.</p><p>For the tens of thousands of people currently detained by ICE during the coronavirus pandemic, for whom social distancing is impossible, there is widespread fear that an even more pervasive and deadly outbreak could occur.</p><p>Carceral facilities — prisons, jails — like ICE detention centers, have much higher infection rates than the general public. On Riker’s Island, for example, the rate of infection is seven times that of New York City.</p><p>As of Thursday, there have been 100 confirmed cases of coronavirus among ICE detainees, and 25 cases among ICE employees at detention centers, according to ICE’s own website.</p><p>The Intercept's Ryan Devereaux has been speaking directly to detainees inside of an ICE facility in Etowah County, Alabama. ICE maintains that it is following appropriate CDC protocols. But as Ryan recently reported in his story <a href=\"https://theintercept.com/2020/04/12/coronavirus-ice-detention-jail-alabama/\">“'Burials Are Cheaper Than Deportations': Virus Unleashes Terror in a Troubled Ice Detention Center,”</a> detainees in this facility, overwhelmed by their own precarious conditions in the face of the coronavirus threat, were forced to radically take matters into their own hands to ensure their own safety.</p>\n       &#10;&nbsp;<br /><hr><p style='color: grey; font - size: 0.75em; '>See <a style='color: grey; ' target='_blank' rel='noopener noreferrer' href='https://acast.com/privacy'>acast.com/privacy</a> for privacy and opt-out information.</p>",
            "length": "40763345",
            "sourceUrl": "https://sphinx.acast.com/intercepted-with-jeremy-scahill/bonus-burialsarecheaperthandeportations/media.mp3"
        },
        {
            "title": "Introducing Somebody Episode 1: Courtney",
            "datePublished": "Wed, 15 Apr 2020 10:00:00 GMT",
            "description": "\n        <p>On March 4, 2016, Shapearl Wells wakes up to a bamming at her door. It’s the police, telling her that her 22-year-old son, Courtney Copeland, has been shot. Detectives tell her Courtney drove his BMW to a police station for help. But Shapearl’s grief turns into suspicion when police start asking her questions, so she launches her own investigation into her son’s murder, teaming up with journalists from the Invisible Institute to confront the cops and find the truth about Courtney's death. </p><p>This week on Intercepted: We air the first episode of Somebody, a new podcast from the Invisible Institute, The Intercept, Topic Studios, and iHeartRadio, in association with Tenderfoot TV. Somebody explores the racial disparities and turbulent relationship between law enforcement and citizens in one of America’s largest cities.</p><p>Listen and subscribe wherever you get your podcasts, and for more information go to <a href=\"http://somebodypodcast.com/\">somebodypodcast.com</a>.</p><p>Intercepted will be back next week.</p>\n       &#10;&nbsp;<br /><hr><p style='color: grey; font - size: 0.75em; '>See <a style='color: grey; ' target='_blank' rel='noopener noreferrer' href='https://acast.com/privacy'>acast.com/privacy</a> for privacy and opt-out information.</p>",
            "length": "71718247",
            "sourceUrl": "https://sphinx.acast.com/intercepted-with-jeremy-scahill/introducingsomebodyepisode1-courtney/media.mp3"
        },
        {
            "title": "The Failed State of America",
            "datePublished": "Fri, 10 Apr 2020 10:00:00 GMT",
            "description": "\n        <p>Bernie Sanders has suspended his campaign for the Democratic nomination for president as the country continues to be rocked by Covid-19 cases and hospitals are struggling to obtain basic supplies. The U.S. has seen almost 20 million unemployment claims in just the past few weeks while new data is revealing that Covid-19 is killing African Americans disproportionately in some major cities. What we are witnessing in stark reality is — contrary to the rhetoric of American greatness — a mask now being lifted to reveal a failed state. </p><p>On the new Intercepted: Jacobin magazine executive editor, Seth Ackerman, discusses the pandemic, capitalism, the suspension of the Sanders campaign, and the future of the U.S.</p>\n       &#10;&nbsp;<br /><hr><p style='color: grey; font - size: 0.75em; '>See <a style='color: grey; ' target='_blank' rel='noopener noreferrer' href='https://acast.com/privacy'>acast.com/privacy</a> for privacy and opt-out information.</p>",
            "length": "118050377",
            "sourceUrl": "https://sphinx.acast.com/intercepted-with-jeremy-scahill/thefailedstateofamerica/media.mp3"
        },
        {
            "title": "Pandemic Racism: The Wisconsin Primary, Disenfranchisement, and the Cost of Life",
            "datePublished": "Wed, 08 Apr 2020 10:00:00 GMT",
            "description": "\n        <p>Milwaukee’s Health Commissioner, Dr. Jeanette Kowalik, discusses the Wisconsin Supreme Court's reckless disregard for public safety as they force the state to conduct in-person voting. Dr. Kowalik analyzes why some 70% of Covid-19 deaths in Milwaukee are African Americans and why the city has declared racism a public health crisis. She also analyses the expected consequences of Tuesday’s crowded voting lines at limited number of polling sites across Wisconsin. </p><p>Author and scholar Dr. Ibram X. Kendi, author of \"How to Be Antiracist,\" discusses what the data tells us about race and coronavirus in America. He draws historical parallels between the Trump administration response and the Mississippi flood of 1927 and analyzes what it means for the U.S. to have to choose between Donald Trump and Joe Biden.</p><p>Fired Amazon worker Christian Smalls responds to the company’s smear campaign organized against him during a meeting attended by the wealthiest person in the world, Jeff Bezos.</p><p>And Intercepted listeners share their stories of struggle during the pandemic.</p><p><em>If you or someone you know needs emotional support or is contemplating suicide, resources include the </em><a href=\"https://www.crisistextline.org/text-us/\"><em>Crisis Text Line</em></a><em>, the </em><a href=\"https://suicidepreventionlifeline.org/talk-to-someone-now/\"><em>Suicide Prevention Lifeline</em></a><em>, </em><a href=\"https://www.thetrevorproject.org/\"><em>the Trevor Project</em></a><em>, or </em><a href=\"https://www.iasp.info/\"><em>the International Association for Suicide Prevention</em></a><em>.</em></p>\n       &#10;&nbsp;<br /><hr><p style='color: grey; font - size: 0.75em; '>See <a style='color: grey; ' target='_blank' rel='noopener noreferrer' href='https://acast.com/privacy'>acast.com/privacy</a> for privacy and opt-out information.</p>",
            "length": "67864761",
            "sourceUrl": "https://sphinx.acast.com/intercepted-with-jeremy-scahill/pandemicracism-thewisconsinprimary-disenfranchisement-andthecostoflife/media.mp3"
        },
        {
            "title": "Essential Workers and the Reverse Robin Hood Coronavirus Bailout",
            "datePublished": "Wed, 01 Apr 2020 10:00:00 GMT",
            "description": "\n        <p>Workers at Amazon, Instacart, and Whole Foods have gone on strike demanding safe work conditions. Amazon has already fired one organizer and continues to pump out misinformation and propaganda as Jeff Bezos continues to rake in billions of dollars. We hear from the fired Amazon manager Christian Smalls and talk to Jacobin magazine reporter Meagan Day about her reporting on the conditions of some essential workers impacted by the coronavirus pandemic, Joe Biden’s campaign against Medicare for All, and the shortage of supplies in hospitals.</p><p>Emergency Room nurse John Pearson, from Highland Hospital in Oakland, explains why his colleagues had to start a GoFundMe campaign for vital medical equipment. He talks about the lack of supplies to deal with the coming surge of coronavirus cases and why he believes that this crisis demands the implementation of a single-payer healthcare system. He also talks about the California health care workers <a href=\"https://actionnetwork.org/petitions/california-healthcare-workers-real-solutions-to-the-pandemic\">petition</a> to Governor Gavin Newsom.</p><p>Intercepted listeners share their stories of struggle during the pandemic — we hear from people losing jobs, facing mounting debt, working in unsafe conditions, and worrying about what the future holds for the most vulnerable people.</p><p>As Congress pats itself on the back for the bipartisan $2.2 trillion “stimulus” package Trump signed into law, journalist David Dayen, executive editor of The American Prospect, breaks down the corporate interests and powerful people who stand to gain the most from the looting of taxpayer funds. Dayen analyzes the portions of the bill aimed at bailing out struggling families, workers, small business owners, and explains why he believes Elizabeth Warren and Bernie Sanders were wrong to vote in favor of the bailout.</p><p>And if you or someone you know needs emotional support or is contemplating suicide, resources include the <a href=\"https://www.crisistextline.org/text-us/\">Crisis Text Line</a>, the <a href=\"https://suicidepreventionlifeline.org/talk-to-someone-now/\">Suicide Prevention Lifeline</a>, <a href=\"https://www.thetrevorproject.org/\">the Trevor Project</a>, or <a href=\"https://www.iasp.info/\">the International Association for Suicide Prevention</a>. </p>\n       &#10;&nbsp;<br /><hr><p style='color: grey; font - size: 0.75em; '>See <a style='color: grey; ' target='_blank' rel='noopener noreferrer' href='https://acast.com/privacy'>acast.com/privacy</a> for privacy and opt-out information.</p>",
            "length": "113168882",
            "sourceUrl": "https://sphinx.acast.com/intercepted-with-jeremy-scahill/essentialworkersandthereverserobinhoodcoronavirusbailout/media.mp3"
        },
        {
            "title": "Capitalist Death Panels: If Corporate Vultures Get Their Way, We’ll Be Dead",
            "datePublished": "Wed, 25 Mar 2020 10:00:00 GMT",
            "description": "\n        <p>As Congress continues to negotiate a bailout, Republicans seem intent on exploiting the crisis to enrich Wall Street, while Democrats offer meek resistance. Matt Bruenig of the Peoples Policy Project breaks down the various proposals in Congress, compares the U.S. plans with other countries’ responses, and lays out some of the tenets of what a bailout for the people should look like.</p><p>Meanwhile, the fate of more than 2 million people locked up in U.S. jails and prisons hangs in the balance as coronavirus begins to spread among incarcerated populations. Workers at carceral facilities are also getting sick. While some cities are working to release pre-trial detainees and people convicted of non-violent technical crimes, legal groups and human rights organizations are sounding the alarm bells on what could be a horrifying aspect of the coronavirus pandemic hitting people who are literally prevented from social distancing. Premal Dharia, Founder and Director of of the Defender Impact Initiative, describes the situation in carceral facilities across the U.S. and why she is warning of a humanitarian disaster if action is not taken immediately.</p>\n       &#10;&nbsp;<br /><hr><p style='color: grey; font - size: 0.75em; '>See <a style='color: grey; ' target='_blank' rel='noopener noreferrer' href='https://acast.com/privacy'>acast.com/privacy</a> for privacy and opt-out information.</p>",
            "length": "60216161",
            "sourceUrl": "https://sphinx.acast.com/intercepted-with-jeremy-scahill/capitalistdeathpanels-ifcorporatevulturesgettheirway-we-llbedead/media.mp3"
        },
        {
            "title": "Organizer Mariame Kaba: We Need a People’s Bailout to Confront Coronavirus",
            "datePublished": "Thu, 19 Mar 2020 10:00:00 GMT",
            "description": "\n        <p>After weeks of downplaying the seriousness of the virus and at times implying it was a hoax, the Trump administration has announced a series of government responses to the crisis. While some actions, such as expanded testing, emergency aid to states and production of medical supplies, are aimed directly at protecting public health, serious questions abound about the economic survival of millions of people. </p><p>Organizer Mariame Kaba discusses the realities facing some of the most vulnerable people in our society, from poor and working families to prisoners and immigration detainees and beyond. While the virus does not discriminate in who it infects, it will have a disproportionately devastating impact on communities that already faced dire crises before coronavirus. Kaba discusses “mutual aid” actions taking place across the country where ordinary people are pooling resources and offering direct responses to those in the most need.</p>\n       &#10;&nbsp;<br /><hr><p style='color: grey; font - size: 0.75em; '>See <a style='color: grey; ' target='_blank' rel='noopener noreferrer' href='https://acast.com/privacy'>acast.com/privacy</a> for privacy and opt-out information.</p>",
            "length": "41934238",
            "sourceUrl": "https://sphinx.acast.com/intercepted-with-jeremy-scahill/organizermariamekaba-weneedapeople-sbailouttoconfrontcoronavirus/media.mp3"
        },
        {
            "title": "Naomi Klein and Jeremy Scahill Discuss Coronavirus, the Election, and Solidarity in the Midst of a Pandemic",
            "datePublished": "Tue, 17 Mar 2020 10:00:00 GMT",
            "description": "\n        <p>The U.S. failed to respond quickly to the coronavirus and as it spreads, it is likely to overwhelm the outdated and overwhelmingly privatized health care infrastructure. Author Naomi Klein and Jeremy Scahill discuss the bipartisan ruling coalition that created and supported a health system where profits are more important than public health; how the corporate vultures are circling the crisis, and how ordinary people are rising to help each other. They also discuss the Democratic primary and the looming fate of many states’ voters; the last Democratic debate between Bernie Sanders and Joe Biden and the two candidates' platforms.</p>\n       &#10;&nbsp;<br /><hr><p style='color: grey; font - size: 0.75em; '>See <a style='color: grey; ' target='_blank' rel='noopener noreferrer' href='https://acast.com/privacy'>acast.com/privacy</a> for privacy and opt-out information.</p>",
            "length": "49022968",
            "sourceUrl": "https://sphinx.acast.com/intercepted-with-jeremy-scahill/naomikleinandjeremyscahilldiscusscoronavirus-theelection-andsolidarityinthemidstofapandemic/media.mp3"
        },
        {
            "title": "We Need to Talk About Joe",
            "datePublished": "Tue, 10 Mar 2020 10:00:00 GMT",
            "description": "\n        <p>With Michigan and other states voting in primaries today, the justice movements backing the Sanders campaign are making the case that nominating Joe Biden to take on Donald Trump is a grave risk. Poet Aja Monet and organizer Astra Taylor discuss the mini-manifesto from a multi-generational, multi-racial coalition of feminists: “<a href=\"https://medium.com/@ajamonetbacquie/rising-for-a-global-feminist-future-with-the-movement-to-elect-bernie-sanders-87ba395d30b8\">Rising for a Global Feminist Future with the Movement to Elect Bernie Sanders</a>.” </p><p>As Biden’s campaign seeks to keep him away from open microphones and limit his public appearances, serious questions are being asked about Biden’s mental health and his decades of right-wing positions and policies. Nathan Robinson, editor-in-chief of Current Affairs, discusses Biden’s record on criminal justice, the climate crisis, women’s reproductive rights, war, and trade. Robinson accurately predicted Trump would defeat Hillary Clinton and he argues it will all happen again if Biden is the candidate in November. His latest article is titled, “<a href=\"https://www.currentaffairs.org/2020/03/democrats-you-really-do-not-want-to-nominate-joe-biden\">Democrats, You Really Do Not Want To Nominate Joe Biden</a>.”</p>\n       &#10;&nbsp;<br /><hr><p style='color: grey; font - size: 0.75em; '>See <a style='color: grey; ' target='_blank' rel='noopener noreferrer' href='https://acast.com/privacy'>acast.com/privacy</a> for privacy and opt-out information.</p>",
            "length": "75895300",
            "sourceUrl": "https://sphinx.acast.com/intercepted-with-jeremy-scahill/weneedtotalkaboutjoe/media.mp3"
        },
        {
            "title": "Super Tuesday: Which Side Are You On?",
            "datePublished": "Tue, 03 Mar 2020 11:00:00 GMT",
            "description": "\n        <p>It’s Super Tuesday and the battle lines are drawn in a campaign that will not only determine who will face Donald Trump in the general election, but also the future of the Democratic Party.</p><p>The Intercept’s Lee Fang discusses who is funding and running the Biden campaign, the role of dark money in the attack against Sanders, and the looming influence of super delegates.</p><p>As the Democratic establishment intensifies its battle to ward off a Sanders insurgency, former Hillary Clinton adviser Peter Daou describes why he is now backing Sanders. Daou also discusses the opposition files compiled on Sanders and rejects the claims he has not been “vetted.”</p>\n       &#10;&nbsp;<br /><hr><p style='color: grey; font - size: 0.75em; '>See <a style='color: grey; ' target='_blank' rel='noopener noreferrer' href='https://acast.com/privacy'>acast.com/privacy</a> for privacy and opt-out information.</p>",
            "length": "50986172",
            "sourceUrl": "https://sphinx.acast.com/intercepted-with-jeremy-scahill/supertuesday-whichsideareyouon-/media.mp3"
        },
        {
            "title": "Bernie’s Fight Against Trump, the GOP, the Democratic Establishment, and Corporate Media",
            "datePublished": "Wed, 26 Feb 2020 11:00:00 GMT",
            "description": "\n        <p>As Bloomberg launches a massive attack ad campaign against Sanders ahead of the South Carolina and Super Tuesday primaries, Sanders is facing a multi-pronged battle against the most powerful political and economic forces in the country.</p><p>From Columbia, South Carolina, Rev. Jesse Jackson discusses the red-baiting of Sanders, offers his views on Democratic Socialism, and suggests Bloomberg should have run against Trump in the Republican primary. Jackson, who won the South Carolina primary in 1984 and 1988, discusses his presidential runs and Joe Biden’s claims of involvement with the civil rights movement. </p><p>Intercepted producer Laura Flynn and Intercept journalist Aída Chavez report from Nevada on how the Latinx community propelled Sanders to victory.</p><p>Plus, Jeremy Scahill takes on the red-baiting scare tactics being deployed against Sanders.</p>\n       &#10;&nbsp;<br /><hr><p style='color: grey; font - size: 0.75em; '>See <a style='color: grey; ' target='_blank' rel='noopener noreferrer' href='https://acast.com/privacy'>acast.com/privacy</a> for privacy and opt-out information.</p>",
            "length": "58813794",
            "sourceUrl": "https://sphinx.acast.com/intercepted-with-jeremy-scahill/bernie-sfightagainsttrump-thegop-thedemocraticestablishment-andcorporatemedia/media.mp3"
        },
        {
            "title": "BONUS: We Are Not Your Firewall",
            "datePublished": "Tue, 25 Feb 2020 11:00:00 GMT",
            "description": "\n        <p>Billionaire former mayor of New York City, Michael Bloomberg, has announced he is going to unleash a spate of attack ads against Sanders; while Pete Buttigieg and Joe Biden are harping about comments Sanders made on 60 Minutes where he praised Cuba’s literacy efforts. The red-baiting attacks on Sanders are most definitely going to increase this week ahead of the South Carolina primary Saturday and next week’s Super Tuesday contest. Sanders is simultaneously battling his challengers and an often openly hostile corporate media culture.</p><p>On MSNBC, his victory in Nevada was compared to the Nazi invasion of France, one of the networks paid pundits referred to the Sanders national campaign press secretary as coming from the “Island of Misfit Black Girls” and host Chuck Todd compared Sanders's twitter followers to Nazi “brown shirts.” Meanwhile, a surrogate for Buttigieg called on Sanders to “muzzle” his top African American campaign representative, while Mike Bloomberg’s campaign put out a statement accusing Sanders of being “Trump’s new bro” and focused overwhelmingly on attacking the comments of senior Black women on the Sanders campaign.</p><p>In this Intercepted special, Sanders top national surrogate, Sen. Nina Turner, and campaign press secretary Briahna Joy Gray discuss the attacks against them, the red-baiting attacks against Sanders, and why they believe Sanders could pull off a major upset in South Carolina.</p>\n       &#10;&nbsp;<br /><hr><p style='color: grey; font - size: 0.75em; '>See <a style='color: grey; ' target='_blank' rel='noopener noreferrer' href='https://acast.com/privacy'>acast.com/privacy</a> for privacy and opt-out information.</p>",
            "length": "41175670",
            "sourceUrl": "https://sphinx.acast.com/intercepted-with-jeremy-scahill/bonus-wearenotyourfirewall/media.mp3"
        },
        {
            "title": "BONUS: Inside the Secretive Court at Guantanamo Bay as CIA Torture Architect Testifies",
            "datePublished": "Fri, 21 Feb 2020 11:00:00 GMT",
            "description": "\n        <p>Last month, The Intercept's research editor Margot Williams reported from Camp Justice at Guantanamo Bay during an extraordinary moment in the 40th pre-trial hearing for the five men accused of plotting 9/11. The men are being charged with crimes that can result in the death penalty and pre-trial hearings have been continuing in this case since 2012. During this hearing, the architect of the CIA's torture program, Dr. James Mitchell, was brought to the war court as a witness. This was the first time that Mitchell appeared in open court. Williams describes her reporting trip, Mitchell's testimony, and how the legacy of CIA torture, with FBI complicity, has marred every aspect of the 9/11 case for nearly eight years.</p>\n       &#10;&nbsp;<br /><hr><p style='color: grey; font - size: 0.75em; '>See <a style='color: grey; ' target='_blank' rel='noopener noreferrer' href='https://acast.com/privacy'>acast.com/privacy</a> for privacy and opt-out information.</p>",
            "length": "21920695",
            "sourceUrl": "https://sphinx.acast.com/intercepted-with-jeremy-scahill/bonus-insidethesecretivecourtatguantanamobayasciatorturearchitecttestifies/media.mp3"
        },
        {
            "title": "Mike Bloomberg Ran Stasi-Style Police and Surveillance Operations Against Muslim Americans",
            "datePublished": "Wed, 19 Feb 2020 11:00:00 GMT",
            "description": "\n        <p>As Bloomberg nears a half a billion dollars in paid ads for his presidential campaign, he is intensifying his attacks on Bernie Sanders. Meanwhile, the red-baiting smears against Sanders are resurfacing as he surges in national polls. NYU Professor Nikhil Pal Singh, author of \"Race and America’s Long War,\" dissects the record of Bloomberg, what his candidacy says about the state of electoral politics in the U.S. and discusses Bloomberg’s “racial terror” tactics in New York. </p><p>Attorney Diala Shamas, of the Center for Constitutional Rights, who fought Bloomberg over his Muslim surveillance program, describes the NYPD’s “Demographics Unit” that targeted Muslim Americans, businesses, houses of worship, and restaurants. Shamas compares the surveillance program to some of the activities of the East German Stasi secret police and says Bloomberg’s use of the program should be seen as an ominous sign of what he might do as president.</p>\n       &#10;&nbsp;<br /><hr><p style='color: grey; font - size: 0.75em; '>See <a style='color: grey; ' target='_blank' rel='noopener noreferrer' href='https://acast.com/privacy'>acast.com/privacy</a> for privacy and opt-out information.</p>",
            "length": "58602855",
            "sourceUrl": "https://sphinx.acast.com/intercepted-with-jeremy-scahill/mikebloombergranstasi-stylepoliceandsurveillanceoperationsagainstmuslimamericans/media.mp3"
        },
        {
            "title": "\"It's Armageddon Time for the Democratic Party\"",
            "datePublished": "Wed, 12 Feb 2020 11:00:00 GMT",
            "description": "\n        <p>Consumer advocate and former presidential candidate Ralph Nader talks about the state of the Democratic primary, the corporate DNC panic over Bernie Sanders and Elizabeth Warren and what would happen to the Democratic party if Sanders wins. Nader also discusses a phone call he had with House Speaker Nancy Pelosi just before the impeachment process began. </p><p>As Michael Bloomberg buys his way into the Democratic primary, he is plastering the airwaves with hagiographic advertisements that ignore his awful record on race, labor unions and how he escalated the Stop-and-Frisk program as mayor of New York. Intercept investigative reporter Lee Fang talks about Bloomberg’s advisers and the strategy to block Sanders or Warren from getting the nomination, possibly seeking to force a brokered convention.</p>\n       &#10;&nbsp;<br /><hr><p style='color: grey; font - size: 0.75em; '>See <a style='color: grey; ' target='_blank' rel='noopener noreferrer' href='https://acast.com/privacy'>acast.com/privacy</a> for privacy and opt-out information.</p>",
            "length": "146688503",
            "sourceUrl": "https://sphinx.acast.com/intercepted-with-jeremy-scahill/itsarmageddontimeforthedemocraticparty/media.mp3"
        },
        {
            "title": "On the Ground in Iowa",
            "datePublished": "Tue, 04 Feb 2020 11:00:00 GMT",
            "description": "\n        <p>While the Iowa Democratic Party has thoroughly fumbled reporting official results of Monday’s caucuses, Sen. Bernie Sanders’s campaign has released figures showing a significant lead. ﻿</p><p>The Intercept’s Washington D.C. bureau chief Ryan Grim reports from the ground in Iowa and traces the rise of today’s progressive moment to Rev. Jesse Jackson’s 1988 presidential campaign. Producers Jack D’Isidoro and Elise Swain speak with caucus-goers in Ottumwa, where meatpacking union workers in the first satellite caucus of the state emphatically supported Sanders. During a caucus at Drake University, Grim speaks with Rep. Ro Khanna and Pod Save America’s Tommy Vietor about Bernie Sanders and electability. At the Sanders campaign victory party in Des Moines, Sanders gives a speech before election results are known, and Chapo Trap House’s Matt Christman weighs in on this political moment. </p>\n       &#10;&nbsp;<br /><hr><p style='color: grey; font - size: 0.75em; '>See <a style='color: grey; ' target='_blank' rel='noopener noreferrer' href='https://acast.com/privacy'>acast.com/privacy</a> for privacy and opt-out information.</p>",
            "length": "34083061",
            "sourceUrl": "https://sphinx.acast.com/intercepted-with-jeremy-scahill/onthegroundiniowa/media.mp3"
        },
        {
            "title": "John Bolton and the Giant Impeachment",
            "datePublished": "Wed, 29 Jan 2020 11:00:00 GMT",
            "description": "\n        <p>Donald Trump’s legal team, including Allan Dershowitz and Ken Starr, argue that the president cannot be impeached for abusing his power. As the battle over Bolton testifying before the Senate intensifies, The Daily Beast’s Spencer Ackerman discusses the longterm impact of the trial on extreme executive power. He also describes his report that Saudi Arabia plotted to kidnap a critic of the regime on U.S. soil and the Cold War rhetoric deployed by the House Managers.</p><p>While Bernie Sanders and Elizabeth Warren are often portrayed in the media as being kindred political souls with identical and similar positions, there are some important differences, particularly on foreign policy. Sarah Lazare, a writer at In These Times, discusses Warren’s hawkish side, her team of advisers and her evolving position on Israel.</p>\n       &#10;&nbsp;<br /><hr><p style='color: grey; font - size: 0.75em; '>See <a style='color: grey; ' target='_blank' rel='noopener noreferrer' href='https://acast.com/privacy'>acast.com/privacy</a> for privacy and opt-out information.</p>",
            "length": "51457572",
            "sourceUrl": "https://sphinx.acast.com/intercepted-with-jeremy-scahill/johnboltonandthegiantimpeachment/media.mp3"
        },
        {
            "title": "Bernie Sanders, Joe Biden and the Rewriting of Iraq War History",
            "datePublished": "Wed, 22 Jan 2020 11:00:00 GMT",
            "description": "\n        <p>Donald Trump’s impeachment trial is already unfolding as a Mitch McConnell-coordinated farce. The charges against Trump are serious, but they beg the question of why Congress has never impeached a president for war crimes. None of the three Senate trials of a president was for imperial crimes committed in plain sight, despite a long history of presidents invading countries, killing civilians, and torturing prisoners.</p><p>Constitutional and international law scholar Marjorie Cohn discusses the trial of Trump, the refusal of lawmakers to prosecute war crimes, and presents the case that Trump should be impeached for assassinating Iranian Gen. Qassim Suleimani in Baghdad.</p><p>This month marks 29 straight years that the US has been bombing Iraq. Joe Biden, who proactively aided and abetted the Bush administration’s drive for war, has been openly lying about his record, but Bernie Sanders also has some serious questions he needs to answer about his own support for regime change, missile strikes, and deadly economic sanctions. Jeremy Scahill and Sam Husseini, of the Institute for Public Accuracy, present a thorough history of both candidates records on Iraq over the past three decades.</p>\n       &#10;&nbsp;<br /><hr><p style='color: grey; font - size: 0.75em; '>See <a style='color: grey; ' target='_blank' rel='noopener noreferrer' href='https://acast.com/privacy'>acast.com/privacy</a> for privacy and opt-out information.</p>",
            "length": "62824268",
            "sourceUrl": "https://sphinx.acast.com/intercepted-with-jeremy-scahill/berniesanders-joebidenandtherewritingofiraqwarhistory/media.mp3"
        },
        {
            "title": "Iran: What Next?",
            "datePublished": "Tue, 14 Jan 2020 11:00:00 GMT",
            "description": "\n        <p>Jeremy Scahill hosts a live discussion in New York on the unfolding crisis with Intercept senior columnist Mehdi Hasan, reporter Murtaza Hussain, national security editor Vanessa Gezari, and senior news editor Ali Gharib. They discuss what the latest developments mean for Iran and the U.S. and how tensions have rapidly escalated since Donald Trump came to office. Will Trump’s current posture hold, or will he order more violence?</p>\n       &#10;&nbsp;<br /><hr><p style='color: grey; font - size: 0.75em; '>See <a style='color: grey; ' target='_blank' rel='noopener noreferrer' href='https://acast.com/privacy'>acast.com/privacy</a> for privacy and opt-out information.</p>",
            "length": "108476111",
            "sourceUrl": "https://sphinx.acast.com/intercepted-with-jeremy-scahill/iran-whatnext-/media.mp3"
        },
        {
            "title": "Intercepted Is Powered by Its Members",
            "datePublished": "Sun, 29 Dec 2019 11:00:00 GMT",
            "description": "\n        <p>Other podcasts make money from advertising and corporate sponsors. We don’t have ads — Intercepted is powered by its members.</p><p>When you support Intercepted, you become a part of the journalism that holds the powerful to account. Become a member — together we can make a difference.</p><p>If you become a sustaining member at $10/month, we’ll send you our stylish Intercepted t-shirt.</p><p>This is a community effort. Your donation, no matter the amount, makes a difference. Generous support of listeners like you is what makes our fierce and independent reporting possible.</p><p>Do what you can. Become a member at <strong>theintercept.com/support</strong>. </p><p>All donations are welcome. You can make a one-time gift or become a sustaining member.</p><p>Thank you! We’ll see you in 2020.</p>\n       &#10;&nbsp;<br /><hr><p style='color: grey; font - size: 0.75em; '>See <a style='color: grey; ' target='_blank' rel='noopener noreferrer' href='https://acast.com/privacy'>acast.com/privacy</a> for privacy and opt-out information.</p>",
            "length": "5508035",
            "sourceUrl": "https://sphinx.acast.com/intercepted-with-jeremy-scahill/interceptedispoweredbyitsmembers/media.mp3"
        },
        {
            "title": "Capitalism’s Consigliere",
            "datePublished": "Wed, 18 Dec 2019 11:00:00 GMT",
            "description": "\n        <p>Former senior health insurance executive-turned-whistleblower Wendell Potter explains McKinsey’s role in our insurance nightmare and how Pete Buttigieg is using industry talking points to attack Medicare for All. Potter also discusses his career working for insurance giants, soaring medical costs in the U.S. and his role in killing Hillary Clinton’s health care initiative in the 1990s.</p><p>Propublica reporter Ian MacDougall discusses McKinsey’s relationship with the Saudi regime, its work for Rikers island, and how it helped push opioids to doctors and patients. MacDougall also lays out his reporting on how McKinsey’s work for ICE in detaining and deporting immigrants disturbed career immigration officials.</p><p>And, the Justice Department’s Inspector General blasted the FBI over its lies and omissions in obtaining a secret FISA warrant to spy on Trump campaign operative Carter Page. Intercept co-founder Glenn Greenwald discusses how the report vindicates civil liberties activists and serves as a striking rebuke of the bipartisan love affair with law enforcement and intelligence agencies.</p>\n       &#10;&nbsp;<br /><hr><p style='color: grey; font - size: 0.75em; '>See <a style='color: grey; ' target='_blank' rel='noopener noreferrer' href='https://acast.com/privacy'>acast.com/privacy</a> for privacy and opt-out information.</p>",
            "length": "160431493",
            "sourceUrl": "https://sphinx.acast.com/intercepted-with-jeremy-scahill/capitalism-sconsigliere/media.mp3"
        },
        {
            "title": "We Tortured Some Folks",
            "datePublished": "Wed, 11 Dec 2019 11:00:00 GMT",
            "description": "\n        <p>Monday marked the five year anniversary of the release of the Senate Intelligence Committee’s executive summary on the CIA’s torture program. The former top Senate Intelligence Committee investigator, Daniel Jones and his team combed through 6.3 million pages of CIA records. Jones discusses the years-long battle with the Bush and Obama administrations to make public the findings of this still-classified 7,000 page report. In this bonus episode, Jones expands on the torture report findings.  </p><p>Jones is the subject of the new feature film, The Report, starring Adam Driver and Annette Bening, and the host of its companion podcast, The Report Podcast, with Kelly McEvers, where they unpack the story of the CIA’s torture program, the Senate’s investigation, and ensuing cover-up.</p>\n       &#10;&nbsp;<br /><hr><p style='color: grey; font - size: 0.75em; '>See <a style='color: grey; ' target='_blank' rel='noopener noreferrer' href='https://acast.com/privacy'>acast.com/privacy</a> for privacy and opt-out information.</p>",
            "length": "91940917",
            "sourceUrl": "https://sphinx.acast.com/intercepted-with-jeremy-scahill/wetorturedsomefolks/media.mp3"
        },
        {
            "title": "The CIA Torture Cover-Up",
            "datePublished": "Wed, 04 Dec 2019 11:00:00 GMT",
            "description": "\n        <p>As Washington D.C. remains focused on the Trump impeachment, Daniel Jones, the former top Senate Intelligence Committee investigator into the CIA torture program discusses the years-long battle with the Bush and Obama administrations to make public the findings of his still-classified 7,000 page report. Jones, the subject of the new feature film, The Report, starring Adam Driver and Annette Bening, discusses his findings. He tells the story of how the CIA, under John Brennan, spied on the Senate investigators and accessed their classified computers.</p><p>As a rebellion in Iraq forces the resignation of the country’s prime minister, Iraqi activist Raed Jarrar describes the roots of the protests, the impact of foreign intervention by numerous countries, and the history of the U.S. encouraging sectarianism in Iraq.</p><p>Plus, \"Bigger Than Baghdad\" — we hear new music from Iraqi-Canadian hip-hop artist Narcy about the protests in Iraq.</p>\n       &#10;&nbsp;<br /><hr><p style='color: grey; font - size: 0.75em; '>See <a style='color: grey; ' target='_blank' rel='noopener noreferrer' href='https://acast.com/privacy'>acast.com/privacy</a> for privacy and opt-out information.</p>",
            "length": "66285546",
            "sourceUrl": "https://sphinx.acast.com/intercepted-with-jeremy-scahill/theciatorturecover-up/media.mp3"
        },
        {
            "title": "A Message from Jeremy on Giving Tuesday",
            "datePublished": "Tue, 03 Dec 2019 11:00:00 GMT",
            "description": "\n        <p>Other podcasts make money from advertising and corporate sponsors. We don’t have ads — Intercepted is powered by its members.</p><p>All donations are welcome. You can make a one-time gift or become a sustaining member.  </p><p>If you become a sustaining member at $10/month, we’ll send you our stylish Intercepted t-shirt.</p><p>This is a community effort. Your donation, no matter the amount, makes a difference. Generous support of listeners like you is what makes our fierce and independent reporting possible.</p><p>Do what you can. Become a member at <strong>theintercept.com/support</strong>.</p><p>Thank you! We’ll be back tomorrow with a full show.</p>\n       &#10;&nbsp;<br /><hr><p style='color: grey; font - size: 0.75em; '>See <a style='color: grey; ' target='_blank' rel='noopener noreferrer' href='https://acast.com/privacy'>acast.com/privacy</a> for privacy and opt-out information.</p>",
            "length": "2168452",
            "sourceUrl": "https://sphinx.acast.com/intercepted-with-jeremy-scahill/amessagefromjeremyongivingtuesday/media.mp3"
        },
        {
            "title": "Whistleblower Jeffrey Sterling’s Life as an “Unwanted Spy”",
            "datePublished": "Wed, 27 Nov 2019 11:00:00 GMT",
            "description": "\n        <p>Jeffrey Sterling was indicted in 2010 on charges under the Espionage Act for allegedly leaking sensitive national security information to then-New York Times reporter James Risen. Sterling discusses his time as a CIA case officer and how his internal complaint about Operation Merlin, a half-baked CIA scheme that had tried to disrupt Iran’s nuclear weapons development, led to his firing. Sterling explains the discrimination suit he filed against the CIA and how there is no evidence that he was the source for Risen, who is now The Intercept's senior national security correspondent. Sterling also shares what it was like to be charged under the Espionage Act and comments on the appalling hostility toward whistleblowers in the U.S. Sterling’s new book is “Unwanted Spy: The Persecution of an American Whistleblower.”</p>\n       &#10;&nbsp;<br /><hr><p style='color: grey; font - size: 0.75em; '>See <a style='color: grey; ' target='_blank' rel='noopener noreferrer' href='https://acast.com/privacy'>acast.com/privacy</a> for privacy and opt-out information.</p>",
            "length": "41153741",
            "sourceUrl": "https://sphinx.acast.com/intercepted-with-jeremy-scahill/whistleblowerjeffreysterling-slifeasan-unwantedspy-/media.mp3"
        },
        {
            "title": "Ghosts of Mossadegh: The Iran Cables, U.S. Empire, and the Arc of History",
            "datePublished": "Wed, 20 Nov 2019 11:00:00 GMT",
            "description": "\n        <p>Iranian-American author and analyst Hooman Majd discusses a century of history marked by intervention and threats from major world powers. Beginning with Britain, Russia, and Germany battling for control of Iran’s oil, Majd and Jeremy Scahill discuss the CIA coup against Mohammed Mossadegh in 1953, the Islamic revolution, and the seizure of the U.S. embassy in Tehran in 1979 and how Washington has repeatedly tried to bring down the government of the Islamic Republic. The Intercept’s investigative series The Iran Cables offers historical insight into Iran’s operations in neighboring Iraq, which are informed by the bloody history of the Iran-Iraq War, the U.S. invasion, subsequent occupation, and the shattering of Iraqi society.</p>\n       &#10;&nbsp;<br /><hr><p style='color: grey; font - size: 0.75em; '>See <a style='color: grey; ' target='_blank' rel='noopener noreferrer' href='https://acast.com/privacy'>acast.com/privacy</a> for privacy and opt-out information.</p>",
            "length": "53410526",
            "sourceUrl": "https://sphinx.acast.com/intercepted-with-jeremy-scahill/ghostsofmossadegh-theirancables-u.s.empire-andthearcofhistory/media.mp3"
        },
        {
            "title": "What the Iran Cables Tell Us About the U.S.-Made Hellscape in Iraq",
            "datePublished": "Tue, 19 Nov 2019 11:00:00 GMT",
            "description": "\n        <p>Early Monday morning, a few minutes past midnight, The Intercept published a major series of investigative stories based on a cache of more than 700 pages of secret Iranian intelligence files detailing years of “painstaking work by Iranian spies to co-opt the country’s leaders, pay Iraqi agents working for the Americans to switch sides, and infiltrate every aspect of Iraq’s political, economic, and religious life.” On this special episode of Intercepted: The Intercept’s Murtaza Hussein and New York Times reporter Farnaz Fassihi discuss the revelations.</p><p>The leak of these files is historic. The Iran Cables paint a picture of the actions of a rational nation state actor’s intervention in the affairs of a neighbor whose government once launched a devastating war against it with the backing of the world’s preeminent superpower, the U.S. For more than six decades, successive U.S. governments have waged military and economic war on Iran and Iraq. In the post-9/11 world, the U.S. overthrew the governments of two of Iran’s most threatening neighbors, Saddam Hussein and the Taliban, while simultaneously coming dangerously close to an all out regime change war against Iran. The 2003 invasion shattered Iraq and the documents in the Iran Cables tell the story of the secret activities of its neighbor Iran.</p>\n       &#10;&nbsp;<br /><hr><p style='color: grey; font - size: 0.75em; '>See <a style='color: grey; ' target='_blank' rel='noopener noreferrer' href='https://acast.com/privacy'>acast.com/privacy</a> for privacy and opt-out information.</p>",
            "length": "35140082",
            "sourceUrl": "https://sphinx.acast.com/intercepted-with-jeremy-scahill/whattheirancablestellusabouttheu.s.-madehellscapeiniraq/media.mp3"
        },
        {
            "title": "Bolivia and Brazil at the Crossroads",
            "datePublished": "Wed, 13 Nov 2019 11:00:00 GMT",
            "description": "\n        <p>As right-wing forces attack indigenous Bolivians and allies of Morales, the Trump administration says the toppling of the democratically-elected government “preserves democracy.” Anthropologist and Bolivia scholar Bret Gustafson offers a nuanced analysis of how the coup unfolded, who benefits from the crisis, and what is at stake for the overwhelmingly indigenous population.</p><p>Brazil’s former president Luiz Inácio Lula da Silva is now free after spending a year and a half behind bars. He says he wants to run for president and fight the far right regime of Jair Bolsonaro. The Intercept’s Glenn Greenwald talks about his recent conversation with Lula, the threats against Intercept journalists in Brasil, and the latest on the corruption investigation into Justice Minister Sergio Moro.</p>\n       &#10;&nbsp;<br /><hr><p style='color: grey; font - size: 0.75em; '>See <a style='color: grey; ' target='_blank' rel='noopener noreferrer' href='https://acast.com/privacy'>acast.com/privacy</a> for privacy and opt-out information.</p>",
            "length": "44935175",
            "sourceUrl": "https://sphinx.acast.com/intercepted-with-jeremy-scahill/boliviaandbrazilatthecrossroads/media.mp3"
        },
        {
            "title": "The Case of Rodney Reed",
            "datePublished": "Wed, 13 Nov 2019 00:18:21 GMT",
            "description": "\n        <p>On this special episode of Intercepted, Jordan Smith and Liliana Segura discuss the case of Rodney Reed.</p><p>The state of Texas has set an execution date of November 20 for Reed. He has been on death row since 1998, following his conviction in the murder of a young woman named Stacy Stites in April of 1996. There is an overwhelming amount of evidence in this case that Reed is innocent, and a very compelling case to be made that Stites’s fiancee at the time of her murder should be the focus of this case. Her fiancee was a police officer at the time of her killing. He is also now a convicted felon himself with a shocking track record of violent assault and rape. Rodney Reed’s life is now hanging in the balance, and an unlikely coalition of high profile people are trying to halt this execution, including Texas Republican politicians and elected officials. Perhaps most prominent among them is Sen. Ted Cruz. </p><p><a href=\"https://twitter.com/chronic_jordan\"><strong>Jordan Smith</strong></a> and <a href=\"https://twitter.com/LilianaSegura\"><strong>Liliana Segura</strong></a><strong> </strong>are both journalists at The Intercept and the cohosts of <a href=\"https://theintercept.com/podcasts/murderville/\"><strong>Murderville</strong></a>. Check out all of their work on this case at <a href=\"https://theintercept.com/search/?s=rodney%20reed\"><strong>The Intercept</strong></a>.</p><p><strong>If you like what we do, support our show by going to </strong><a href=\"http://theintercept.com/join\"><strong>TheIntercept.com/join</strong></a><strong>.</strong></p>\n       &#10;&nbsp;<br /><hr><p style='color: grey; font - size: 0.75em; '>See <a style='color: grey; ' target='_blank' rel='noopener noreferrer' href='https://acast.com/privacy'>acast.com/privacy</a> for privacy and opt-out information.</p>",
            "length": "24739160",
            "sourceUrl": "https://sphinx.acast.com/intercepted-with-jeremy-scahill/thecaseofrodneyreed/media.mp3"
        },
        {
            "title": "The Case for Economic Disobedience",
            "datePublished": "Wed, 06 Nov 2019 11:00:00 GMT",
            "description": "\n        <p>Organizer Astra Taylor, author of “Democracy May Not Exist, but We’ll Miss It When It’s Gone,” analyzes “minoritarian” rule in the U.S., how capitalism undermines democracy, and lays out concrete ideas for fighting back. </p><p>Keeanga-Yamahtta Taylor, author of “Race for Profit,” talks about the history of how the U.S. government and predatory lenders conspired against Black home ownership in the United States. She also explains why privatizing affordable housing initiatives is a recipe for continued disaster.</p>\n       &#10;&nbsp;<br /><hr><p style='color: grey; font - size: 0.75em; '>See <a style='color: grey; ' target='_blank' rel='noopener noreferrer' href='https://acast.com/privacy'>acast.com/privacy</a> for privacy and opt-out information.</p>",
            "length": "48233561",
            "sourceUrl": "https://sphinx.acast.com/intercepted-with-jeremy-scahill/thecaseforeconomicdisobedience/media.mp3"
        },
        {
            "title": "American Horrors",
            "datePublished": "Wed, 30 Oct 2019 10:00:00 GMT",
            "description": "\n        <p>Amidst the grandstanding and partisan bickering, no one wants to talk about the decades of U.S. policy that helped give rise to ISIS and al Qaeda. Jeremy Scahill discusses how U.S. policy opened a Pandora’s box in Iraq and Syria.</p><p>Islamic studies scholar Amanda Rogers discusses the actual founder of ISIS, Abu Musab al Zarqawi, and how ISIS adopted tactics from the U.S. “war on terror.”</p><p>War reporter Mike Giglio talks about his time on the ground covering ISIS. He documents this experience in his new book,  “Shatter the Nations: ISIS and the War for the Caliphate.”</p>\n       &#10;&nbsp;<br /><hr><p style='color: grey; font - size: 0.75em; '>See <a style='color: grey; ' target='_blank' rel='noopener noreferrer' href='https://acast.com/privacy'>acast.com/privacy</a> for privacy and opt-out information.</p>",
            "length": "53570526",
            "sourceUrl": "https://sphinx.acast.com/intercepted-with-jeremy-scahill/americanhorrors/media.mp3"
        },
        {
            "title": "Omnicidal Tendencies",
            "datePublished": "Wed, 23 Oct 2019 10:00:00 GMT",
            "description": "\n        <p>Legendary peace activist Liz McAlister has spent her entire life resisting U.S. war. The 79-year-old grandmother of six, who is on trial with her Kings Bay Plowshares co-defendants, explains why she and her friends snuck onto a U.S. nuclear base to deliver an indictment of the U.S. government.</p><p>Rudy Giuliani has emerged as Donald Trump’s dollar store Roy Cohn and he has put himself right in the center of the impeachment inquiry. Journalist Johnny Dwyer, author of “The Districts,” chronicles Giuliani’s time as a prosecutor in the Southern District of New York, Giuliani’s connections to shady characters from a host of countries and why he may never face indictment.</p><p>Journalist Emily Guendelsberger went undercover working at Amazon, McDonald’s and Convergys. She discusses her experience in the dystopic world of low wage work and her new book “On the Clock, What Low-Wage Work Did to Me and How It Drives America Insane.”</p>\n       &#10;&nbsp;<br /><hr><p style='color: grey; font - size: 0.75em; '>See <a style='color: grey; ' target='_blank' rel='noopener noreferrer' href='https://acast.com/privacy'>acast.com/privacy</a> for privacy and opt-out information.</p>",
            "length": "67856663",
            "sourceUrl": "https://sphinx.acast.com/intercepted-with-jeremy-scahill/omnicidaltendencies/media.mp3"
        },
        {
            "title": "Wasteland of Corruption",
            "datePublished": "Wed, 16 Oct 2019 10:00:00 GMT",
            "description": "\n        <p>Adam Serwer of The Atlantic discusses the impeachment inquiry, the cruelty of the Trump presidency and the state of play in Washington D.C.</p><p>As Turkey continues its brutal incursion into parts of Syria, U.S. politicians accuse Trump of “betraying” the Kurds. Jeremy Scahill and Dr. Kamran Matin of Sussex University discuss the long history of U.S. support for despotic regimes as they’ve waged genocidal campaigns against Kurdish people.</p><p>Author Fatima Bhutto has two new books out, a novel “The Runaways” and “New Kings of the World: Dispatches from Bollywood, Dizi, and K-Pop.” Bhutto discusses these books, the role of the CIA in Hollywood and the evolving story of Pakistan in the post-9/11 world.</p>\n       &#10;&nbsp;<br /><hr><p style='color: grey; font - size: 0.75em; '>See <a style='color: grey; ' target='_blank' rel='noopener noreferrer' href='https://acast.com/privacy'>acast.com/privacy</a> for privacy and opt-out information.</p>",
            "length": "80161397",
            "sourceUrl": "https://sphinx.acast.com/intercepted-with-jeremy-scahill/wastelandofcorruption/media.mp3"
        },
        {
            "title": "The Trump Effect",
            "datePublished": "Wed, 09 Oct 2019 10:00:00 GMT",
            "description": "\n        <p>Jeremy Scahill is back. Well, sort of. He passes the reins over to Intercepted's producers. </p><p>A recent <a href=\"https://airwars.org/wp-content/uploads/2019/07/Airwars-News-in-Brief-US-media-reporting-of-civilian-harm.pdf\">report</a> from Airwars investigates the incredibly thin media coverage of civilian harm during the U.S. war against ISIS. The author of that report, investigative researcher Alexa O'Brien, shares her findings with associate producer Elise Swain. </p><p>Lead producer Jack D'Isidoro interviews Wilfred Chan, who dives deep into the pro-democracy uprising in Hong Kong and explores the protesters' demands. </p><p>The Intercept's Jordan Smith discusses the first abortion case before the Supreme Court since Trump’s new appointments with producer Laura Flynn. They analyze the latest in the war against women's reproductive rights.</p>\n       &#10;&nbsp;<br /><hr><p style='color: grey; font - size: 0.75em; '>See <a style='color: grey; ' target='_blank' rel='noopener noreferrer' href='https://acast.com/privacy'>acast.com/privacy</a> for privacy and opt-out information.</p>",
            "length": "60887137",
            "sourceUrl": "https://sphinx.acast.com/intercepted-with-jeremy-scahill/thetrumpeffect/media.mp3"
        },
        {
            "title": "We've Got Impeachment",
            "datePublished": "Wed, 02 Oct 2019 10:00:00 GMT",
            "description": "\n        <p>D.C. Bureau Chief Ryan Grim hosts and gives the long history of Hunter Biden in Ukraine. </p><p>Senior National Security Correspondent James Risen explains Donald Trump’s abuse of power, comments on the New York Times publishing information about the whistleblower, he calls for an end to leak prosecutions, especially under the Espionage Act. </p><p>Grim and Risen are joined by Edward Baumgartner, a researcher on Ukraine and Russia, and Kristofer Harrison, a former Defense and State Department adviser during the George W. Bush administration. They discuss Joe and Hunter Biden’s involvement in Ukraine, and the interests of various Trump associates in Ukraine including Rudy Giuliani, Michael Cohen, and Paul Manafort. </p><p>Reporter Murtaza Hussain asks why the moral outrage over Trump’s abuse of political power is so much greater than it is for America’s endless wars and rising civilian deaths.</p>\n       &#10;&nbsp;<br /><hr><p style='color: grey; font - size: 0.75em; '>See <a style='color: grey; ' target='_blank' rel='noopener noreferrer' href='https://acast.com/privacy'>acast.com/privacy</a> for privacy and opt-out information.</p>",
            "length": "42509996",
            "sourceUrl": "https://sphinx.acast.com/intercepted-with-jeremy-scahill/wevegotimpeachment/media.mp3"
        },
        {
            "title": "We Were Warned: The Climate Emergency and the Surveillance State",
            "datePublished": "Wed, 25 Sep 2019 10:00:00 GMT",
            "description": "\n        <p>Senior Correspondent Naomi Klein imagines what real climate justice could look like and talks about her new book, “On Fire: The Burning Case for a Green New Deal.” </p><p>The Intercept’s Sharon Lerner tells Intercepted’s Elise Swain about her groundbreaking reporting on toxic industrial chemicals.</p><p>NSA Whistleblower Edward Snowden reads an excerpt from his new memoir, “Permanent Record,” and reflects on his time since revealing the broad scope of NSA surveillance with Micah Lee, First Look Media’s Director of Information Security.</p>\n       &#10;&nbsp;<br /><hr><p style='color: grey; font - size: 0.75em; '>See <a style='color: grey; ' target='_blank' rel='noopener noreferrer' href='https://acast.com/privacy'>acast.com/privacy</a> for privacy and opt-out information.</p>",
            "length": "69535411",
            "sourceUrl": "https://sphinx.acast.com/intercepted-with-jeremy-scahill/wewerewarned-theclimateemergencyandthesurveillancestate/media.mp3"
        },
        {
            "title": "BONUS: Philosopher Srecko Horvat",
            "datePublished": "Wed, 03 Jul 2019 10:00:00 GMT",
            "description": "\n        <p>Philosopher Srecko Horvat discusses the historical lessons we can learn from the guerrilla struggle against fascism waged by the Partisans in Yugoslavia during World War II. Horvat also talks about  the recent surge in extreme right-wing political forces in Europe and what that trend and Julian Assange’s case mean for the future of democracy.</p><p>Intercepted is going on hiatus for the summer and will return with new episodes in September 2019.</p>\n       &#10;&nbsp;<br /><hr><p style='color: grey; font - size: 0.75em; '>See <a style='color: grey; ' target='_blank' rel='noopener noreferrer' href='https://acast.com/privacy'>acast.com/privacy</a> for privacy and opt-out information.</p>",
            "length": "69835701",
            "sourceUrl": "https://sphinx.acast.com/intercepted-with-jeremy-scahill/bonus-philosophersreckohorvat/media.mp3"
        },
        {
            "title": "Whitewashing History",
            "datePublished": "Wed, 26 Jun 2019 10:00:00 GMT",
            "description": "\n        <p>Rutgers professor and co-host of the Uncivil podcast Chenjerai Kumanyika argues that demands for reparations should include challenging the driving forces behind slavery: capitalism and imperialism. </p><p>The Intercept’s Ryan Devereaux gives an update on the trial for humanitarian aid worker Scott Warren and discusses the dehumanization that has allowed the war on immigrants to continue for decades. </p><p>Artist and musician Nakhane reflects on growing up queer in South Africa and talks about his new record, “You Will Not Die.”</p><p>This is our last episode of the season. Intercepted is going on hiatus for the summer and will return with new episodes in September 2019.</p>\n       &#10;&nbsp;<br /><hr><p style='color: grey; font - size: 0.75em; '>See <a style='color: grey; ' target='_blank' rel='noopener noreferrer' href='https://acast.com/privacy'>acast.com/privacy</a> for privacy and opt-out information.</p>",
            "length": "57948062",
            "sourceUrl": "https://sphinx.acast.com/intercepted-with-jeremy-scahill/whitewashinghistory/media.mp3"
        },
        {
            "title": "Gulf of Tonkin Redux",
            "datePublished": "Wed, 19 Jun 2019 10:00:00 GMT",
            "description": "\n        <p>As the U.S. accuses Iran of attacking civilian ships while offering scant evidence, grave historical parallels are emerging with the Gulf of Tonkin incidents in 1964 that were manipulated to justify Lyndon Johnson’s dramatic escalation of the war in Vietnam. </p><p>California Democrat Rep. Ro Khanna is preparing legislation aimed at stopping an attack on Iran and he says he would not put it past National Security Adviser John Bolton to manipulate evidence. </p><p>Journalist Negar Mortazavi of The Independent analyzes what war with Iran would look like and exposes the State Department’s funding of propaganda operations against Iran. </p><p>Democracy Now! host Amy Goodman talks about the parallels with the build up to the Iraq invasion of 2003 and shares stories from her early life as a journalist.</p>\n       &#10;&nbsp;<br /><hr><p style='color: grey; font - size: 0.75em; '>See <a style='color: grey; ' target='_blank' rel='noopener noreferrer' href='https://acast.com/privacy'>acast.com/privacy</a> for privacy and opt-out information.</p>",
            "length": "67173564",
            "sourceUrl": "https://sphinx.acast.com/intercepted-with-jeremy-scahill/gulfoftonkinredux/media.mp3"
        },
        {
            "title": "Running for Justice",
            "datePublished": "Wed, 12 Jun 2019 10:00:00 GMT",
            "description": "\n        <p>In a bombshell series of reports, The Intercept Brasil has revealed dirty tricks used in the prosecution of the leftist former president Luiz Inácio Lula da Silva on corruption charges and improper coordination among prosecutors and judges. Glenn Greenwald discusses the documents in the leaked archive and what this means for Trump ally Jair Bolsonaro. </p><p>Tiffany Cabán, a queer Latina public defender from Queens, New York, talks about her battle with the Democratic Party machine in her bid to become a prosecutor opposed to the carceral state. Chesa Boudin, whose parents were sentenced to lengthy prison terms when he was 14-months-old, is trying to overhaul San Francisco’s justice system and radically change the relationship between cops and the DA. </p><p>As paramilitary forces carry out a massacre against non-violent protesters in Sudan, we get a report from filmmaker Hajooj Kuka who was wounded in the raid in Khartoum last week. And we hear the music of Sudanese-American Ahmed Gallab, the lead singer-songwriter of the band Sinkane, and his experience of monitoring the major developments in his home country.</p>\n       &#10;&nbsp;<br /><hr><p style='color: grey; font - size: 0.75em; '>See <a style='color: grey; ' target='_blank' rel='noopener noreferrer' href='https://acast.com/privacy'>acast.com/privacy</a> for privacy and opt-out information.</p>",
            "length": "69116428",
            "sourceUrl": "https://sphinx.acast.com/intercepted-with-jeremy-scahill/runningforjustice/media.mp3"
        },
        {
            "title": "Criminalizing Freedom",
            "datePublished": "Wed, 05 Jun 2019 10:00:00 GMT",
            "description": "\n        <p>Fanatical opponents of a woman’s right to choose are pushing to criminalize abortion and women's healthcare providers. Historian Johanna Schoen, Rutgers professor and author, talks about when abortion was illegal and the history of coercive policies from forced sterilization to blocking access to sex education, birth control, and abortions. </p><p>Whistleblower Reality Winner has spent more than two years in prison for allegedly leaking a top-secret NSA document on Russian cyber attacks on software used in some U.S. voting systems. Her mother, Billie Winner-Davis, describes her daughter’s prison conditions and makes the case for why she should be freed. </p><p>As Donald Trump wraps up his state visit to the United Kingdom, we speak with philosopher and activist Srećko Horvat about the historical lessons we can learn from the guerrilla struggle against fascism waged by the Partizans in Yugoslavia during World War II, as well as the recent surge in extreme right-wing political forces in Europe.</p><p>If you like what we do, support our show by going to <a href=\"http://theintercept.com/join\">TheIntercept.com/join</a> to become a member.</p>\n       &#10;&nbsp;<br /><hr><p style='color: grey; font - size: 0.75em; '>See <a style='color: grey; ' target='_blank' rel='noopener noreferrer' href='https://acast.com/privacy'>acast.com/privacy</a> for privacy and opt-out information.</p>",
            "length": "76275659",
            "sourceUrl": "https://sphinx.acast.com/intercepted-with-jeremy-scahill/criminalizingfreedom/media.mp3"
        },
        {
            "title": "BONUS: \"We've Got People\"",
            "datePublished": "Sun, 02 Jun 2019 10:00:00 GMT",
            "description": "\n        <p>As Democrats continue to debate whether to initiate an impeachment inquiry, Trump seems to be going nuts from the Democrats’ continuing probe into his possible obstruction of justice, corruption, and abuse of power. The Intercept’s Ryan Grim explains Nancy Pelosi’s rise to power within the Democratic Party, her political origins, and what her possible end game strategy is for Trump. Grim also weighs in on the large 2020 Democratic candidate field and talks about his new book, “We’ve Got People: From Jesse Jackson to Alexandria Ocasio-Cortez, the End of Big Money and the Rise of a Movement.”</p>\n       &#10;&nbsp;<br /><hr><p style='color: grey; font - size: 0.75em; '>See <a style='color: grey; ' target='_blank' rel='noopener noreferrer' href='https://acast.com/privacy'>acast.com/privacy</a> for privacy and opt-out information.</p>",
            "length": "150606347",
            "sourceUrl": "https://sphinx.acast.com/intercepted-with-jeremy-scahill/bonus-wevegotpeople/media.mp3"
        },
        {
            "title": "A Coup Against the First Amendment",
            "datePublished": "Wed, 29 May 2019 10:00:00 GMT",
            "description": "\n        <p>For the first time in U.S. history, the government is criminally prosecuting a publisher for printing truthful information. Whether Assange is extradited or not, this case casts a dangerous cloud over aggressive national security reporting and means criminalizing journalism is on the table. Jameel Jaffer, director of the Knight First Amendment Institute at Columbia University and former top lawyer at the ACLU, analyzes the indictment and explains why he believes this case represents a grave threat to a free press. </p><p>As Democrats continue to debate whether to initiate an impeachment inquiry against Trump, Nancy Pelosi seems to be getting under The Donald’s skin. The Intercept’s Ryan Grim explains Pelosi’s rise to power within the Democratic Party, her political origins and what her possible end game strategy is for Donald Trump. Grim also discusses his new book “We’ve Got People: From Jesse Jackson to Alexandria Ocasio-Cortez, the End of Big Money and the Rise of a Movement.”</p><p>If you like what we do, support our show by going to <a href=\"http://theintercept.com/join\">TheIntercept.com/join</a> to become a member.</p>\n       &#10;&nbsp;<br /><hr><p style='color: grey; font - size: 0.75em; '>See <a style='color: grey; ' target='_blank' rel='noopener noreferrer' href='https://acast.com/privacy'>acast.com/privacy</a> for privacy and opt-out information.</p>",
            "length": "66329154",
            "sourceUrl": "https://sphinx.acast.com/intercepted-with-jeremy-scahill/acoupagainstthefirstamendment/media.mp3"
        },
        {
            "title": "Authoritarians Like Us",
            "datePublished": "Wed, 22 May 2019 10:00:00 GMT",
            "description": "\n        <p>National Security Adviser John Bolton is more powerful than ever and is obsessed with regime change in Tehran. His boss is threatening to bring the “end of Iran” as some news outlets help spread the administration’s unveiled attempt to gin up a Gulf of Tonkin-style justification for war. Iranian author and analyst Hooman Majd explains how we got here and how Iran’s leaders view the Trump administration. </p><p>Trump loves to talk about locking up his political opponents and with William Barr as his attorney general, it may not be unthinkable. That is precisely what the former President of Brazil, Luiz Inácio Lula da Silva, is charging happened to him. Lula, the once popular leftist president of Brazil, is serving a 12-year prison sentence on corruption charges. But, in an exclusive prison interview with The Intercept’s Glenn Greenwald, Lula says his prosecution was an attempt to destroy him and the Workers Party he built. Greenwald discusses his interview and plays highlights of his conversation with Lula.</p>\n       &#10;&nbsp;<br /><hr><p style='color: grey; font - size: 0.75em; '>See <a style='color: grey; ' target='_blank' rel='noopener noreferrer' href='https://acast.com/privacy'>acast.com/privacy</a> for privacy and opt-out information.</p>",
            "length": "63656421",
            "sourceUrl": "https://sphinx.acast.com/intercepted-with-jeremy-scahill/authoritarianslikeus/media.mp3"
        },
        {
            "title": "The Espionage Axe",
            "datePublished": "Wed, 15 May 2019 10:00:00 GMT",
            "description": "\n        <p>Trevor Timm, executive director of the Freedom of the Press Foundation, talks about the weaponization of this law for use in stopping investigative journalism and the case of Air Force veteran Daniel Hale, who is facing 50 years in prison. </p><p>Organizer Bill Fletcher Jr. discusses the Trump administration’s intensifying military threats against Iran, the ongoing coup attempt in Venezuela and offers strategic thoughts on how to view the 2020 Democratic primary field. </p><p>Dr. Krystal Redman, executive director of SPARK Reproductive Justice Now in Georgia, talks about the spate of new laws being implemented in several states that seek to criminalize abortion and women’s health care providers.</p>\n       &#10;&nbsp;<br /><hr><p style='color: grey; font - size: 0.75em; '>See <a style='color: grey; ' target='_blank' rel='noopener noreferrer' href='https://acast.com/privacy'>acast.com/privacy</a> for privacy and opt-out information.</p>",
            "length": "74972416",
            "sourceUrl": "https://sphinx.acast.com/intercepted-with-jeremy-scahill/theespionageaxe/media.mp3"
        },
        {
            "title": "Everywhere Is War",
            "datePublished": "Wed, 08 May 2019 10:00:00 GMT",
            "description": "\n        <p>The Intercept’s Murtaza Hussain discusses Trump’s motley crew of regime change warriors, what war with Iran would look like, and the strategy behind the economic sanctions. </p><p>At nearly 90 years old, former Senator Mike Gravel may be the oldest candidate for president, but he also has the dankest social media memes. Gravel discusses his insurgent run for the Democratic nomination led by his campaign volunteers who are teenagers.</p><p>The Intercept’s Jordan Smith talks about her latest reporting on abortion. </p><p>In honor of the 100th anniversary of Pete Seeger’s birth, we hear some never before released recordings and talk with Jeff Place, the curator and senior archivist of The Smithsonian Folkways Collection’s career-spanning anthology of Seeger’s work.</p><p>If you like what we do, support our show by going to <a href=\"http://theintercept.com/join\">TheIntercept.com/join</a> to become a member.</p>\n       &#10;&nbsp;<br /><hr><p style='color: grey; font - size: 0.75em; '>See <a style='color: grey; ' target='_blank' rel='noopener noreferrer' href='https://acast.com/privacy'>acast.com/privacy</a> for privacy and opt-out information.</p>",
            "length": "75793258",
            "sourceUrl": "https://sphinx.acast.com/intercepted-with-jeremy-scahill/everywhereiswar/media.mp3"
        },
        {
            "title": "Shadow Players",
            "datePublished": "Wed, 01 May 2019 10:00:00 GMT",
            "description": "\n        <p>The Intercept’s editor-in-chief Betsy Reed, investigative journalist Matthew Cole, and national security editor Vanessa Gezari discuss how Erik Prince went from exile in the United Arab Emirates to a shadow player in Trump world. </p><p>Famed Pentagon Papers lawyer James Goodale, former counsel to the New York Times, discusses the dangerous precedent the prosecution of Julian Assange would set and criticizes “establishment” media outlets for not speaking out. </p><p>War reporter Dahr Jamail, who reported inside Fallujah during the first U.S. siege, has now deployed to the frontlines of the war to save the climate. He reads from his new book, ”The End of Ice: Bearing Witness and Finding Meaning in the Path of Climate Disruption.\"</p>\n       &#10;&nbsp;<br /><hr><p style='color: grey; font - size: 0.75em; '>See <a style='color: grey; ' target='_blank' rel='noopener noreferrer' href='https://acast.com/privacy'>acast.com/privacy</a> for privacy and opt-out information.</p>",
            "length": "64014002",
            "sourceUrl": "https://sphinx.acast.com/intercepted-with-jeremy-scahill/shadowplayers/media.mp3"
        },
        {
            "title": "Introducing Running from COPS",
            "datePublished": "Wed, 24 Apr 2019 10:00:00 GMT",
            "description": "\n        <p>We’d like to introduce you to Running from COPS — a new podcast from our sister company Topic Studios and the team behind Missing Richard Simmons.</p><p>After 30 years on television, COPS has evolved into a constant messaging machine about policing in America. Running from COPS is the result of an 18-month investigation and delves deep into how the show actually gets made, how much control police departments really have over the final product, and the harrowing stories of the people who have ended up on camera.</p><p>If you like what you hear, the show is out now on all podcast platforms. Just search for “Running from COPS.”</p><p>Intercepted will be back with new episodes next week.</p>\n       &#10;&nbsp;<br /><hr><p style='color: grey; font - size: 0.75em; '>See <a style='color: grey; ' target='_blank' rel='noopener noreferrer' href='https://acast.com/privacy'>acast.com/privacy</a> for privacy and opt-out information.</p>",
            "length": "1978947",
            "sourceUrl": "https://sphinx.acast.com/intercepted-with-jeremy-scahill/introducingrunningfromcops/media.mp3"
        },
        {
            "title": "Immoral Compass",
            "datePublished": "Wed, 10 Apr 2019 10:00:00 GMT",
            "description": "\n        <p>Ryan Grim, the Washington DC bureau chief of The Intercept, discusses the departure of Homeland Security Secretary Kirstjen Neilsen and the historic War Powers Resolution vote that just passed Congress.</p><p>Investigative reporter Aura Bogado, of Reveal, discusses the Trump administration’s current immigration policies, the ongoing family separations and Bernie Sanders rejection of the concept of “open borders.” </p><p>The Intercept’s Micah Lee discusses the bizarre case of the Chinese national who talked her way onto Trump’s Mar-a-Lago resort with a bunch of cash, USB drives with malware and some counter surveillance equipment. </p><p>Two Catholic Worker peace activists explain why they snuck onto a US military base, poured their own blood and attempted to deliver an indictment of President Trump. Carmen Trotta of the New York Catholic Worker and Martha Hennessy, the granddaughter of Dorothy Day, discuss their legal strategy, why they acted, and the history of the Plowshares movement.</p>\n       &#10;&nbsp;<br /><hr><p style='color: grey; font - size: 0.75em; '>See <a style='color: grey; ' target='_blank' rel='noopener noreferrer' href='https://acast.com/privacy'>acast.com/privacy</a> for privacy and opt-out information.</p>",
            "length": "79882824",
            "sourceUrl": "https://sphinx.acast.com/intercepted-with-jeremy-scahill/immoralcompass/media.mp3"
        },
        {
            "title": "American Dystopia",
            "datePublished": "Wed, 03 Apr 2019 10:00:00 GMT",
            "description": "\n        <p>The Intercept’s Alice Speri discusses her investigation into the FBI’s creation of the term “black identity extremist” and explains why this label is so dangerous. </p><p>Science fiction author Cory Doctorow walks us through the dystopian yet highly plausible futures in his new book “Radicalized.” </p><p>Plus, Katie Alice Greer of the band Priests describes how history and mythology influenced their new record, “The Seduction of Kansas.”</p>\n       &#10;&nbsp;<br /><hr><p style='color: grey; font - size: 0.75em; '>See <a style='color: grey; ' target='_blank' rel='noopener noreferrer' href='https://acast.com/privacy'>acast.com/privacy</a> for privacy and opt-out information.</p>",
            "length": "49778158",
            "sourceUrl": "https://sphinx.acast.com/intercepted-with-jeremy-scahill/americandystopia/media.mp3"
        },
        {
            "title": "The Day After Mueller",
            "datePublished": "Wed, 27 Mar 2019 10:00:00 GMT",
            "description": "\n        <p>Naomi Klein analyzes the epic media failure on Trump-Russia and discusses the agenda for change and resistance that should have been. </p><p>Rolling Stone’s Matt Taibbi details how on Trump-Russia the media failed to do its job.</p><p>Ali Abunimah, of the Electronic Intifada, lays out the scandal in plain sight: Israeli collusion with Trump and the broader U.S. political power structure. </p><p>The Intercept’s Jon Schwarz tells the bizarre tale of China’s illegal influence over the presidential campaign of Jeb Bush. </p><p>And Alison Klayman talks about her film \"The Brink,\" a look at the past year of Steve Bannon’s project to bring his white nationalist agenda global.</p>\n       &#10;&nbsp;<br /><hr><p style='color: grey; font - size: 0.75em; '>See <a style='color: grey; ' target='_blank' rel='noopener noreferrer' href='https://acast.com/privacy'>acast.com/privacy</a> for privacy and opt-out information.</p>",
            "length": "198778457",
            "sourceUrl": "https://sphinx.acast.com/intercepted-with-jeremy-scahill/thedayaftermueller/media.mp3"
        },
        {
            "title": "Radical White Terrorism",
            "datePublished": "Wed, 20 Mar 2019 10:00:00 GMT",
            "description": "\n        <p>Guardian columnist Nesrine Malik talks about the “ghoulish routine” in the media and among politicians that increasingly emerges in the aftermath of massacres of Muslims by white supremacists. </p><p>The Intercept’s Murtaza Hussain explains why, as a non-white Western Muslim, he felt compelled to analyze the “manifesto” of the shooter. </p><p>University of Chicago historian Kathleen Belew, author of “Bring the War Home: The White Power Movement and Paramilitary America,” discusses the history of white power movements and why she draws a distinction between white power and white supremacy.</p>\n       &#10;&nbsp;<br /><hr><p style='color: grey; font - size: 0.75em; '>See <a style='color: grey; ' target='_blank' rel='noopener noreferrer' href='https://acast.com/privacy'>acast.com/privacy</a> for privacy and opt-out information.</p>",
            "length": "54968249",
            "sourceUrl": "https://sphinx.acast.com/intercepted-with-jeremy-scahill/radicalwhiteterrorism/media.mp3"
        },
        {
            "title": "The American Machine: Police Torture to Drone Assassinations",
            "datePublished": "Wed, 13 Mar 2019 10:00:00 GMT",
            "description": "\n        <p>Famed civil rights lawyer Flint Taylor discusses his 13 year struggle for justice for Fred Hampton, his work in exposing the torture program in Chicago that was unleashed on black men, and his career fighting against violent corrupt cops, the city of Chicago, and J. Edgar Hoover’s FBI. Taylor’s new memoir is called \"The Torture Machine: Racism and Police Violence in Chicago.\" </p><p>Hina Shamsi of the American Civil Liberties Union talks about the expansion of drone strikes under Trump, how Obama paved the way for his successor, and what we might expect from Attorney General William Barr. </p><p>Meghan McCain is not Jewish, but she is accusing a Jewish comic artist of creating “one of the most anti-semitic things” she has ever seen: a cartoon about her hypocrisy in attacking Ilhan Omar and appropriating Jewish suffering. Artist Eli Valley talks about why he drew it and why he believes McCain’s attacks on his cartoon proves the very point he was making.</p>\n       &#10;&nbsp;<br /><hr><p style='color: grey; font - size: 0.75em; '>See <a style='color: grey; ' target='_blank' rel='noopener noreferrer' href='https://acast.com/privacy'>acast.com/privacy</a> for privacy and opt-out information.</p>",
            "length": "73146950",
            "sourceUrl": "https://sphinx.acast.com/intercepted-with-jeremy-scahill/theamericanmachine-policetorturetodroneassassinations/media.mp3"
        },
        {
            "title": "American Misdirection",
            "datePublished": "Wed, 06 Mar 2019 11:00:00 GMT",
            "description": "\n        <p>Journalist and Russiagate critic Aaron Maté presents his dissenting analysis, what he believes is behind the investigation, and how the scandal has distracted from other urgent issues. </p><p>We hear a speech from professor Shoshana Zuboff, author of “The Age of Surveillance Capitalism: The Fight for a Human Future at the New Frontier of Power.”</p><p>As the Trump administration intensifies its air war in Somalia, journalist Harun Maruf, author of “Inside Al-Shabaab: The Secret History of Al-Qaeda’s Most Powerful Ally,\" discusses the war in Somalia and the seldom mentioned history of how the George W. Bush administration helped overthrow the only force that had brought peace to Somalia since the early 1990s.</p>\n       &#10;&nbsp;<br /><hr><p style='color: grey; font - size: 0.75em; '>See <a style='color: grey; ' target='_blank' rel='noopener noreferrer' href='https://acast.com/privacy'>acast.com/privacy</a> for privacy and opt-out information.</p>",
            "length": "74348457",
            "sourceUrl": "https://sphinx.acast.com/intercepted-with-jeremy-scahill/americanmisdirection/media.mp3"
        },
        {
            "title": "The Secrets of American Power",
            "datePublished": "Wed, 27 Feb 2019 11:00:00 GMT",
            "description": "\n        <p>California Rep. Ro Khanna tells us he is ready to invoke the War Powers Act in an effort to stop military action in Venezuela. </p><p>New York Times reporter Charlie Savage discusses the rise of the unitary executive theory and how Attorney General William Barr could impact the Trump scandals and U.S. national security policy.</p><p>Carol Rosenberg, the only journalist covering the Guantanamo prison and trials full-time, joins us for a wide-ranging conversation. She discusses 17 years of reporting, controversies around prosecuting detainees, and the evidence that Haspel's covert career included a stint at GTMO.  </p><p>Jordan Carver, the author of “Spaces of Disappearance: the Architecture of Extraordinary Rendition,” takes us on an audio journey mapping the covert CIA program.</p>\n       &#10;&nbsp;<br /><hr><p style='color: grey; font - size: 0.75em; '>See <a style='color: grey; ' target='_blank' rel='noopener noreferrer' href='https://acast.com/privacy'>acast.com/privacy</a> for privacy and opt-out information.</p>",
            "length": "81168475",
            "sourceUrl": "https://sphinx.acast.com/intercepted-with-jeremy-scahill/thesecretsofamericanpower/media.mp3"
        },
        {
            "title": "Regime Change We Can Believe In",
            "datePublished": "Wed, 20 Feb 2019 11:00:00 GMT",
            "description": "\n        <p>Venezuela scholar George Ciccariello-Maher and journalist Kim Ives discuss recent developments and examine the massive protests rocking Haiti’s U.S.-backed president. </p><p>The Intercept’s Jon Schwarz details the bloody and murderous career of Elliott Abrams, the man now in charge of U.S.-Venezuela operations. </p><p>And journalist Sharif Abdel Kouddous explains the failed revolution in Egypt and outlines U.S.-backed dictator General Abdel Fattah el-Sisi’s plot to make himself president for life.</p>\n       &#10;&nbsp;<br /><hr><p style='color: grey; font - size: 0.75em; '>See <a style='color: grey; ' target='_blank' rel='noopener noreferrer' href='https://acast.com/privacy'>acast.com/privacy</a> for privacy and opt-out information.</p>",
            "length": "86371893",
            "sourceUrl": "https://sphinx.acast.com/intercepted-with-jeremy-scahill/regimechangewecanbelievein/media.mp3"
        },
        {
            "title": "Neoliberalism or Death: The U.S. Economic War Against Venezuela",
            "datePublished": "Wed, 13 Feb 2019 11:00:00 GMT",
            "description": "\n        <p>House Speaker Nancy Pelosi officially endorses the attempted coup in Venezuela, joining forces with Donald Trump and his posse of neoconservatives. Venezuela’s Vice Foreign Minister Carlos Ron responds to the threats of military action, the reports about covert U.S. activity in the country, and discusses the impact of the sanctions on Venezuela. </p><p>Former United Nations rapporteur Alfred de Zayas is accusing the U.S. of attempting to “asphyxiate” Venezuela with economic warfare and says the U.S. should be investigated by the International Criminal Court. Zayas wrote a UN report on Venezuela in late 2018 that was scathing in its assessment of U.S. policy towards Venezuela under both Obama and Trump. He talks about what he found during his investigation. </p><p>And we go inside the mind of journalist Sam Husseini who tried to ask convicted criminal Elliott Abrams about his past and the present U.S. lies about Venezuela.</p>\n       &#10;&nbsp;<br /><hr><p style='color: grey; font - size: 0.75em; '>See <a style='color: grey; ' target='_blank' rel='noopener noreferrer' href='https://acast.com/privacy'>acast.com/privacy</a> for privacy and opt-out information.</p>",
            "length": "70864105",
            "sourceUrl": "https://sphinx.acast.com/intercepted-with-jeremy-scahill/neoliberalismordeath-theu.s.economicwaragainstvenezuela/media.mp3"
        },
        {
            "title": "Trump Headlines a Benefit Concert for Imperialism",
            "datePublished": "Wed, 06 Feb 2019 11:00:00 GMT",
            "description": "\n        <p>Donald Trump received big bipartisan applause at his State of the Union.</p><p>Vijay Prashad discusses the state of imperialism in the world, the battle for Venezuela, India’s upcoming election, and the history of U.S. dirty operations across the globe. </p><p>As right-wing media and politicians have gone berserk over the FBI raid on the home of Trump crony, Roger Stone, whistleblower Reality Winner remains behind bars. The Intercept’s Peter Maass discusses the hypocrisy surrounding the two cases and we hear excerpts from the recent play, “<a href=\"https://theintercept.com/2019/01/02/reality-winner-play-is-this-a-room/\">Is This A Room: Reality Winner Verbatim Transcription</a>,” created by Tina Satter. The play is based entirely on the verbatim transcript of the FBI interrogation of Winner the day she was arrested. </p><p>Plus, a sneak peak at the new film Donald Trump’s Day Off.</p>\n       &#10;&nbsp;<br /><hr><p style='color: grey; font - size: 0.75em; '>See <a style='color: grey; ' target='_blank' rel='noopener noreferrer' href='https://acast.com/privacy'>acast.com/privacy</a> for privacy and opt-out information.</p>",
            "length": "73588179",
            "sourceUrl": "https://sphinx.acast.com/intercepted-with-jeremy-scahill/trumpheadlinesabenefitconcertforimperialism/media.mp3"
        },
        {
            "title": "Donald Trump and the Yankee Plot to Overthrow the Venezuelan Government",
            "datePublished": "Wed, 30 Jan 2019 11:00:00 GMT",
            "description": "\n        <p>Investigative journalist Allan Nairn talks about the history of U.S. crimes in Central America, the time he told Abrams, on national television, he should stand trial for war crimes and the threat of U.S. military action in Venezuela. </p><p>Former adviser to Hugo Chavez, Eva Golinger, and journalist and educator Roberto Lovato discuss how Venezuela was thrust into economic crisis, who is responsible, and what Washington really wants.</p>\n       &#10;&nbsp;<br /><hr><p style='color: grey; font - size: 0.75em; '>See <a style='color: grey; ' target='_blank' rel='noopener noreferrer' href='https://acast.com/privacy'>acast.com/privacy</a> for privacy and opt-out information.</p>",
            "length": "62835739",
            "sourceUrl": "https://sphinx.acast.com/intercepted-with-jeremy-scahill/donaldtrumpandtheyankeeplottooverthrowthevenezuelangovernment/media.mp3"
        },
        {
            "title": "Intercept Podcast Special: Alexandria Ocasio-Cortez",
            "datePublished": "Mon, 28 Jan 2019 22:01:00 GMT",
            "description": "\n        <p>Today we’re presenting a podcast special from our Intercept colleagues in DC. New York Rep. Alexandria Ocasio-Cortez joins Intercept reporters Ryan Grim and Briahna Joy Gray for an in-depth conversation about her fresh approach to politics, her thoughts on 2020, and her insurgent congressional campaign. As a new member of the House Financial Services Committee, she’s already shaping the conversation with her call to raise the top marginal tax rate to 70%. And former North Carolina congressman Brad Miller, a progressive Democrat who served for years on the committee, joins the conversation to talk about the challenges Ocasio-Cortez will face there.</p>\n       &#10;&nbsp;<br /><hr><p style='color: grey; font - size: 0.75em; '>See <a style='color: grey; ' target='_blank' rel='noopener noreferrer' href='https://acast.com/privacy'>acast.com/privacy</a> for privacy and opt-out information.</p>",
            "length": "96366991",
            "sourceUrl": "https://sphinx.acast.com/intercepted-with-jeremy-scahill/interceptpodcastspecial-alexandriaocasio-cortez/media.mp3"
        },
        {
            "title": "Donald Trump and the Media Temple of BOOM!",
            "datePublished": "Wed, 23 Jan 2019 11:00:00 GMT",
            "description": "\n        <p>Longtime investigative journalist Michael Isikoff of Yahoo! News analyzes the Buzzfeed News bombshell report that Trump ordered Michael Cohen to lie to cover up a planned Trump Tower in Moscow. Robert Mueller is disputing the report and Isikoff offers his own critique of the story and what we know to be true thus far. </p><p>Popular economist and adviser to Bernie Sanders 2016 campaign Stephanie Kelton talks about Modern Monetary Theory, the lies told by Republicans and Democrats about deficits, and whether young workers will ever get Social Security benefits. </p><p>Los Angeles public school teachers appear to have won some major victories as a result of their historic strike. We speak to Noriko Nakada, an 8th grade English teacher at Emerson Middle School in LA, and labor journalist Sarah Jaffe, who covered the strike for The Nation.</p>\n       &#10;&nbsp;<br /><hr><p style='color: grey; font - size: 0.75em; '>See <a style='color: grey; ' target='_blank' rel='noopener noreferrer' href='https://acast.com/privacy'>acast.com/privacy</a> for privacy and opt-out information.</p>",
            "length": "191263754",
            "sourceUrl": "https://sphinx.acast.com/intercepted-with-jeremy-scahill/donaldtrumpandthemediatempleofboom-/media.mp3"
        },
        {
            "title": "One Wall, Supersized, Extra Racism, Hold the Wars",
            "datePublished": "Wed, 16 Jan 2019 11:00:00 GMT",
            "description": "\n        <p>Trump says he wants to end U.S. wars abroad, while he threatens to use emergency powers to further militarize U.S. immigration enforcement. On Twitter, Trump advocates isolationism, while embracing lifelong warmongers like John Bolton and Benjamin Netanyahu. </p><p>Investigative reporter and historian Gareth Porter analyzes Trump's pledge to pull troops from Syria and Afghanistan. He breaks down why Israel and the Pentagon don't want to see an end to U.S. militarism. </p><p>Historian Greg Grandin lays out the nativist roots of the U.S. Border Patrol, its connection to CIA dirty wars in Latin America, and nearly 100-years of brutality and impunity. </p><p>Sudan has been rocked by large demonstrations for the past month, threatening the regime of Omar al-Bashir, who is wanted by the International Criminal Court. Despite Bashir’s pariah status, Trump has lifted some longstanding sanctions against his regime. Journalist Hana Baba discusses her recent trip to Sudan and what the protests are really about.</p>\n       &#10;&nbsp;<br /><hr><p style='color: grey; font - size: 0.75em; '>See <a style='color: grey; ' target='_blank' rel='noopener noreferrer' href='https://acast.com/privacy'>acast.com/privacy</a> for privacy and opt-out information.</p>",
            "length": "71745241",
            "sourceUrl": "https://sphinx.acast.com/intercepted-with-jeremy-scahill/onewall-supersized-extraracism-holdthewars/media.mp3"
        },
        {
            "title": "Introducing Murderville (Part 2)",
            "datePublished": "Thu, 13 Dec 2018 11:01:00 GMT",
            "description": "\n        <p>Introducing Murderville, a new investigative podcast from The Intercept.  Episode 2: The Trial. Devonia Inman goes on trial for his life. But there’s really no evidence against him. Witnesses keep changing their stories. And the jury never hears about an alternate suspect — a man who was just arrested for a brazen murder of two prominent community members.</p><p>The full seven-episode Murderville series is available now on Stitcher Premium, or free on all platforms starting December 20. To subscribe, go to <a href=\"http://theintercept.com/murderville\">theintercept.com/murderville</a>.</p>\n       &#10;&nbsp;<br /><hr><p style='color: grey; font - size: 0.75em; '>See <a style='color: grey; ' target='_blank' rel='noopener noreferrer' href='https://acast.com/privacy'>acast.com/privacy</a> for privacy and opt-out information.</p>",
            "length": "85600138",
            "sourceUrl": "https://sphinx.acast.com/intercepted-with-jeremy-scahill/introducingmurderville-part2-/media.mp3"
        },
        {
            "title": "Introducing Murderville (Part 1)",
            "datePublished": "Thu, 13 Dec 2018 11:00:00 GMT",
            "description": "\n        <p>Introducing Murderville, a new investigative podcast from The Intercept.  Episode 1: Murder at Taco Bell. A murder in the small southern town of Adel, Georgia, sent Devonia Inman to jail 20 years ago.  He was accused of robbing and shooting a woman named Donna Brown in a Taco Bell parking lot.  He swore he was innocent and there were good reasons to believe him. And while he awaited trial, three more brutal killings took place in Adel. Did police get the wrong man?</p><p>The full seven-episode Murderville series is available now on Stitcher Premium, or free on all platforms starting December 20. To subscribe, go to <a href=\"http://theintercept.com/murderville\">theintercept.com/murderville</a>.</p>\n       &#10;&nbsp;<br /><hr><p style='color: grey; font - size: 0.75em; '>See <a style='color: grey; ' target='_blank' rel='noopener noreferrer' href='https://acast.com/privacy'>acast.com/privacy</a> for privacy and opt-out information.</p>",
            "length": "82186734",
            "sourceUrl": "https://sphinx.acast.com/intercepted-with-jeremy-scahill/introducingmurderville-part1-/media.mp3"
        },
        {
            "title": "Supreme Injustices",
            "datePublished": "Wed, 12 Dec 2018 11:00:00 GMT",
            "description": "\n        <p>Dan Kaufman, author of \"The Fall of Wisconsin: Conservative Conquest of a Progressive Bastion and The Future Of American Politics,\" digs into the history, analyzes the latest Republican conspiracy and lays out why we all should study the Wisconsin model. </p><p>Longtime criminal justice reporters Liliana Segura and Jordan Smith talk about their gripping new true crime podcast, Murderville, which tells the story of a series of grisly killings in a small Georgia town and the man they believe has been wrongly imprisoned. </p><p>Canadian hip-hop artist and host of Netflix's \"Hip-Hop Evolution,\" Shad, talks about his roots, class warfare, and his imaginative new album “A Short Story About a War.”</p>\n       &#10;&nbsp;<br /><hr><p style='color: grey; font - size: 0.75em; '>See <a style='color: grey; ' target='_blank' rel='noopener noreferrer' href='https://acast.com/privacy'>acast.com/privacy</a> for privacy and opt-out information.</p>",
            "length": "60641439",
            "sourceUrl": "https://sphinx.acast.com/intercepted-with-jeremy-scahill/supremeinjustices/media.mp3"
        },
        {
            "title": "George H. W. Bush, American War Criminal",
            "datePublished": "Wed, 05 Dec 2018 11:00:00 GMT",
            "description": "\n        <p>Jeremy Scahill details the crimes of George H.W. Bush, the sick propaganda of the corporate media memorials; and the trail of blood, death, and tears Bush leaves behind. </p><p>Independent journalist Arun Gupta covers decades of Bush, from his time at the helm of the CIA, to the presidency. Gupta discusses Bush’s support for Manuel Noriega and his eventual invasion of Panama, the pardoning of Iran-Contra criminals, the dirty wars in Central America, the support for Saddam Hussein, and the launch of the Gulf War. </p><p>Acclaimed Iraqi poet and scholar Sinan Antoon describes his life under the U.S.-backed dictatorship of Saddam, the horrors of the Gulf War, and how Bush’s destruction of Iraqi civilian society led to the rise of ISIS.</p>\n       &#10;&nbsp;<br /><hr><p style='color: grey; font - size: 0.75em; '>See <a style='color: grey; ' target='_blank' rel='noopener noreferrer' href='https://acast.com/privacy'>acast.com/privacy</a> for privacy and opt-out information.</p>",
            "length": "120888866",
            "sourceUrl": "https://sphinx.acast.com/intercepted-with-jeremy-scahill/georgeh.w.bush-americanwarcriminal/media.mp3"
        },
        {
            "title": "Killing Asylum",
            "datePublished": "Wed, 28 Nov 2018 11:00:00 GMT",
            "description": "\n        <p>Decades of CIA death squads, economic warfare, coups, and support for authoritarian rule played a central role in the exodus of refugees from Central America. Donald Trump is now threatening to shoot the fleeing victims. Honduran professor Suyapa Portillo Villeda analyzes how Washington created the crisis. </p><p>Jeremy Scahill details the history of John Negroponte and the Contra death squads in Nicaragua and the case of a U.S. Jesuit priest murdered in Honduras during Negroponte’s tenure. </p><p>The Intercept’s Ryan Devereaux and Melissa del Bosque of The Investigative Fund at the Nation Institute talk about the militarization of the border, the prosecution of humanitarian volunteers who help immigrants and the nativist, white supremacists driving U.S. policy. </p><p>Director Alex Winter talks about his film documenting the hundreds of reporters who produced the Panama Papers — more than 11 million documents showing systematic tax evasion and money laundering by some of the world’s most powerful people.</p>\n       &#10;&nbsp;<br /><hr><p style='color: grey; font - size: 0.75em; '>See <a style='color: grey; ' target='_blank' rel='noopener noreferrer' href='https://acast.com/privacy'>acast.com/privacy</a> for privacy and opt-out information.</p>",
            "length": "86306384",
            "sourceUrl": "https://sphinx.acast.com/intercepted-with-jeremy-scahill/killingasylum/media.mp3"
        },
        {
            "title": "BONUS: Rapper Vic Mensa",
            "datePublished": "Wed, 21 Nov 2018 11:00:00 GMT",
            "description": "\n        <p>The Chicago-based hip-hop artist Vic Mensa not only raps about Chicago police killings of black and brown people, about apartheid in Palestine, the poisoning of the water in Flint, Michigan, but he also goes to where the silence is and speaks out. </p><p>In the aftermath of the police shooting of Laquan MacDonald, Mensa was in the streets and gave voice to the movement that led to the conviction of second-degree murder for Chicago Police officer Jason Van Dyke. Mensa has traveled in Palestine with the poet Aja Monet, and he has gone to Flint to help amplify the voices of a community that was poisoned and continues to be poisoned. During the Standing Rock movement, he joined to support the water protectors fighting against the Dakota Access Pipeline. </p><p>He speaks about his activism, what he saw in Palestine, being a gun owner who supports gun control, and the revolutionary figures that inspire his work.</p>\n       &#10;&nbsp;<br /><hr><p style='color: grey; font - size: 0.75em; '>See <a style='color: grey; ' target='_blank' rel='noopener noreferrer' href='https://acast.com/privacy'>acast.com/privacy</a> for privacy and opt-out information.</p>",
            "length": "137543616",
            "sourceUrl": "https://sphinx.acast.com/intercepted-with-jeremy-scahill/bonus-rappervicmensa/media.mp3"
        },
        {
            "title": "Donald Trump and the Counterrevolutionary War",
            "datePublished": "Wed, 14 Nov 2018 11:00:00 GMT",
            "description": "\n        <p>Columbia University professor Bernard Harcourt lays out the multi-decade history of paramilitarized politics in the U.S., how the tactics of the “War on Terror” have come back to American soil, and why no one talks about drone strikes anymore. </p><p>Academy Award-winning director Michael Moore talks about his recent visit from the FBI in connection to the pipe bomb packages and who he thinks should run against Trump in 2020. </p><p>Journalist and lawyer Josie Duffy Rice analyzes the battle over vote counts in Florida and Georgia, the Republican campaign to suppress black voters, the gutting of the Voting Rights Act, and why she isn’t protesting the firing of Jeff Sessions. </p><p>Jeremy Scahill explains why Nancy Pelosi and Chuck Schumer need to go away.</p>\n       &#10;&nbsp;<br /><hr><p style='color: grey; font - size: 0.75em; '>See <a style='color: grey; ' target='_blank' rel='noopener noreferrer' href='https://acast.com/privacy'>acast.com/privacy</a> for privacy and opt-out information.</p>",
            "length": "89377166",
            "sourceUrl": "https://sphinx.acast.com/intercepted-with-jeremy-scahill/donaldtrumpandthecounterrevolutionarywar/media.mp3"
        },
        {
            "title": "The Rot Within the American System",
            "datePublished": "Wed, 07 Nov 2018 11:00:00 GMT",
            "description": "\n        <p>Journalist Chris Hedges has spent the past 15 years trying to ring the alarm about the dangers of the U.S. political system and the impact of a corporate and financial coup d’etat that happened long ago. He talks about the growing power of “Christian fascists,” predicts a major financial crash and offers ideas on how to fight back. </p><p>In 1923, a year after Mussolini took power in Italy, one radical and visionary woman saw his rise for what it was and warned of the grave dangers the world would face if fascism spread. Her name was Clara Zetkin. Acclaimed writer and actor Deborah Eisenberg performs a selection of Zetkin's writing, which was recently published as a book, “Fighting Fascism: How to Struggle and How to Win.” </p><p>Also, new music from the incredible visual artist and musician Lonnie Holley who is out with a new album called \"MITH.\"</p><p>Join Michael Moore, Jeremy Scahill, and Marshall Curry for a special post-election screening and discussion about the rise of hate crimes and right-wing political violence in the age of Trump on November 9th, in New York City. Tickets are available <a href=\"http://www.docnyc.net/film/fahrenheit-119/\">here.</a></p>\n       &#10;&nbsp;<br /><hr><p style='color: grey; font - size: 0.75em; '>See <a style='color: grey; ' target='_blank' rel='noopener noreferrer' href='https://acast.com/privacy'>acast.com/privacy</a> for privacy and opt-out information.</p>",
            "length": "78746322",
            "sourceUrl": "https://sphinx.acast.com/intercepted-with-jeremy-scahill/therotwithintheamericansystem/media.mp3"
        },
        {
            "title": "The Doctrine of American Mythology",
            "datePublished": "Wed, 31 Oct 2018 10:00:00 GMT",
            "description": "\n        <p>NYU’s Ruth Ben-Ghiat, and Yale’s Jason Stanley discuss Trump’s brand of authoritarianism and dissect the similarities and differences between Trump and fascist leaders Mussolini and Hitler. </p><p>Actor Ty Jones, Producing Artistic Director at The Classical Theatre of Harlem, perform’s Langston Hughes’s poem “Let America Be America Again.” </p><p>Fairness and Accuracy in Reporting’s Adam Johnson breaks down how white supremacy and fascism are discussed in U.S. media, hypocrisy on Saudi Arabia and the false both-sides paradigm on radical rightwing violence and terrorism. </p><p>And hardcore punk musician Julian Cashwan Pratt, of Show Me the Body, talks about  \"Work Sets You Free,\" a silent visual essay juxtaposing federal prisons in America with the band’s own footage of visits to concentration camps while touring Europe.</p>\n       &#10;&nbsp;<br /><hr><p style='color: grey; font - size: 0.75em; '>See <a style='color: grey; ' target='_blank' rel='noopener noreferrer' href='https://acast.com/privacy'>acast.com/privacy</a> for privacy and opt-out information.</p>",
            "length": "93077459",
            "sourceUrl": "https://sphinx.acast.com/intercepted-with-jeremy-scahill/thedoctrineofamericanmythology/media.mp3"
        },
        {
            "title": "Royal Murderers",
            "datePublished": "Wed, 24 Oct 2018 10:00:00 GMT",
            "description": "\n        <p>Journalist Rula Jebreal, who conducted one of the last interviews with Jamal Khashoggi before he was executed, discusses possible motives for his murder and shares audio from the interview. Sam Husseini, a journalist who once asked a top Saudi official to defend the legitimacy of his regime, joins for a roundtable on the history of U.S. support for Saudi Arabia, the intentional amnesia of the politicians demanding action, and the slaughter in Yemen. </p><p>Renowned playwright Naomi Wallace has a new one-person play about Yemen. Intercepted has adapted it into a radio drama performed by Ismail Khalidi. </p><p>Indigenous historian Nick Estes discusses the ongoing attacks on native people, voter disenfranchisement, the Red Power movement and the latest on the fight against major oil and gas pipelines.</p>\n       &#10;&nbsp;<br /><hr><p style='color: grey; font - size: 0.75em; '>See <a style='color: grey; ' target='_blank' rel='noopener noreferrer' href='https://acast.com/privacy'>acast.com/privacy</a> for privacy and opt-out information.</p>",
            "length": "82993690",
            "sourceUrl": "https://sphinx.acast.com/intercepted-with-jeremy-scahill/royalmurderers/media.mp3"
        },
        {
            "title": "Brazil on the Brink. The Saudi Regime Under Fire.",
            "datePublished": "Wed, 17 Oct 2018 10:00:00 GMT",
            "description": "\n        <p>Glenn Greenwald is host and he breaks down the rise of the most extreme right-wing candidate in the democratic world and explains why Brazil’s young and fragile democracy leaves it far more susceptible to a return of military rule. </p><p>Glenn is joined by the Vice Presidential candidate on the Worker’s Party ticket running against Bolsonaro, Manuela d’Ávila, for a wide-ranging interview about Bolsonaro, the campaign she and the Worker’s Party are running, and the severe dangers posed to Brazilian democracy. </p><p>Journalist Sarah Aziza gives an in-depth analysis of the alleged brutal murder of journalist Jamal Khashoggi that has rocked the journalistic world and started a debate over the U.S. relationship with Saudi Arabia.</p>\n       &#10;&nbsp;<br /><hr><p style='color: grey; font - size: 0.75em; '>See <a style='color: grey; ' target='_blank' rel='noopener noreferrer' href='https://acast.com/privacy'>acast.com/privacy</a> for privacy and opt-out information.</p>",
            "length": "58820088",
            "sourceUrl": "https://sphinx.acast.com/intercepted-with-jeremy-scahill/brazilonthebrink.thesaudiregimeunderfire-/media.mp3"
        },
        {
            "title": "Chicago Claps Back",
            "datePublished": "Wed, 10 Oct 2018 10:00:00 GMT",
            "description": "\n        <p>Chicago claps back in a live show recorded in the Windy City.</p><p>Poet, scholar, and author Eve Ewing, revolutionary educator Bill Ayers, activist Charlene Carruthers, and journalist Jamie Kalven discuss the murder conviction of the Chicago Police officer who gunned down Laquan McDonald, the neoliberal tenure of Mayor Rahm Emanuel, and the war on Chicago’s public schools. </p><p>Plus, musician Malcolm London performs and Eve Ewing reads a poem which imagines the mundane normalcies of life for Emmett Till — if he hadn't been murdered.</p>\n       &#10;&nbsp;<br /><hr><p style='color: grey; font - size: 0.75em; '>See <a style='color: grey; ' target='_blank' rel='noopener noreferrer' href='https://acast.com/privacy'>acast.com/privacy</a> for privacy and opt-out information.</p>",
            "length": "117109846",
            "sourceUrl": "https://sphinx.acast.com/intercepted-with-jeremy-scahill/chicagoclapsback/media.mp3"
        },
        {
            "title": "BONUS: From Nation State to Empire State",
            "datePublished": "Fri, 05 Oct 2018 10:00:00 GMT",
            "description": "\n        <p>Most analysis of Donald Trump’s election to the U.S. presidency in 2016 focuses on immediate causes and, of course, its effects. In a recent speech, NYU history professor Nikhil Pal Singh took a longer historical view, sketching three arcs of U.S. history that have yielded the durable commitments to racism, militarism, and unequal class power that have sharpened over the past two decades. </p><p>Considering the historical development of the United States as an empire-state, rather than as a nation-state, he argues, is essential to understanding what it has meant, and what it might mean going forward, to bend the future toward greater equality and justice – both in the United States and in its relationship to the wider world. He argues that the election of Trump and the failure of Hillary Clinton may be the clearest signals yet, of the decline of U.S. empire. Rather than a cause for pessimism, he says, this moment is an opportunity to enliven a new politics and begin a new story — but only if we are honest about our past. </p><p>Singh is the author of \"Black is a Country\" and \"Race and America’s Long War.\" He is also the founding co-director of NYU’s Prison Education Project. This speech was delivered on September 26th at the Lensic Theater in Santa Fe, New Mexico. The event was sponsored by the Lannan Foundation, which granted Intercepted permission to share it with our audience.</p>\n       &#10;&nbsp;<br /><hr><p style='color: grey; font - size: 0.75em; '>See <a style='color: grey; ' target='_blank' rel='noopener noreferrer' href='https://acast.com/privacy'>acast.com/privacy</a> for privacy and opt-out information.</p>",
            "length": "42767942",
            "sourceUrl": "https://sphinx.acast.com/intercepted-with-jeremy-scahill/bonus-fromnationstatetoempirestate/media.mp3"
        },
        {
            "title": "Raging Bullsh*t",
            "datePublished": "Wed, 03 Oct 2018 10:00:00 GMT",
            "description": "\n        <p>If the Democrats retake the House, Rep. Hank Johnson will be the chair of a subcommittee that has subpoena power to continue the investigation of Kavanaugh. He explains his position on Kavanaugh and also Justice Clarence Thomas and his history of alleged sexual harassment of Anita Hill. </p><p>Former White House lawyer, Supreme Court clerk and current constitutional law professor Kate Shaw and Democracy Now! host Amy Goodman offer an in-depth analysis of the battle over Kavanaugh. </p><p>The Intercept’s Peter Maass got a copy of Kavanaugh friend Mark Judge’s novel about their drunken high school years. We made a radio drama of some of the scenes from the book, including a character named Bart O’Kavanaugh. </p><p>We hear brand new music from musician and radical indigenous queer feminist Katherine Paul, aka Black Belt Eagle Scout. </p><p>Plus, Donald Trump says he has never had a drink, but how different would he be if he liked beer as much as Brett Kavanaugh?</p>\n       &#10;&nbsp;<br /><hr><p style='color: grey; font - size: 0.75em; '>See <a style='color: grey; ' target='_blank' rel='noopener noreferrer' href='https://acast.com/privacy'>acast.com/privacy</a> for privacy and opt-out information.</p>",
            "length": "83322074",
            "sourceUrl": "https://sphinx.acast.com/intercepted-with-jeremy-scahill/ragingbullsh-t/media.mp3"
        },
        {
            "title": "American Dissident: Noam Chomsky on the State of the Empire",
            "datePublished": "Wed, 26 Sep 2018 10:00:00 GMT",
            "description": "\n        <p>Famed dissident Noam Chomsky breaks down the Trump presidency; the defeat of the U.S. in Afghanistan; what he believes is a just position on Syria’s civil war; and the agenda of Vladimir Putin and Russia. He also discusses the impact of big social media companies and explains why a life of resisting and fighting is worth it. </p><p>Jeremy Scahill analyzes Trump’s U.N. speech and gives context to the seldom-discussed bipartisan support for much of Trump’s global agenda. </p><p>Dallas Hip Hop artist Bobby Sessions talks about police killings and this political moment. We also hear music from his new EP, \"RVLTN (Chapter 1): The Divided States of AmeriKKKa.\"</p>\n       &#10;&nbsp;<br /><hr><p style='color: grey; font - size: 0.75em; '>See <a style='color: grey; ' target='_blank' rel='noopener noreferrer' href='https://acast.com/privacy'>acast.com/privacy</a> for privacy and opt-out information.</p>",
            "length": "78814788",
            "sourceUrl": "https://sphinx.acast.com/intercepted-with-jeremy-scahill/americandissident-noamchomskyonthestateoftheempire/media.mp3"
        },
        {
            "title": "Hurricane Colonialism",
            "datePublished": "Wed, 19 Sep 2018 10:00:00 GMT",
            "description": "\n        <p>One year ago, Hurricane Maria ravaged Puerto Rico, but U.S. colonialism prepared the ground for the deadly crisis. </p><p>Journalist Juan González exposes how Wall Street, the bipartisan Washington political machine, and climate change conspired to kill thousands of Puerto Ricans. </p><p>The Intercept’s Naomi Klein outlines the neoliberal economic attack on Puerto Rico and a shock doctrine in motion. </p><p>Puerto Rican musician Ileana Mercedes Cabra Joglar, better known as iLe, talks about her new song, \"Odio\" and the struggle for Puerto Rican independence.</p>\n       &#10;&nbsp;<br /><hr><p style='color: grey; font - size: 0.75em; '>See <a style='color: grey; ' target='_blank' rel='noopener noreferrer' href='https://acast.com/privacy'>acast.com/privacy</a> for privacy and opt-out information.</p>",
            "length": "76580852",
            "sourceUrl": "https://sphinx.acast.com/intercepted-with-jeremy-scahill/hurricanecolonialism/media.mp3"
        },
        {
            "title": "Donald Trump, the Democrats and the Illusion of American Greatness",
            "datePublished": "Wed, 12 Sep 2018 10:00:00 GMT",
            "description": "\n        <p>Constitutional law professor Zephyr Teachout is running to be the New York Attorney General, and has vowed to put Trump and his organization in her legal sights if she wins. She talks about why she believes Trump may have violated the emoluments clause and her plan to undermine his potential pardons. </p><p>Socialist academic Dr. Keeanga-Yamahtta Taylor talks about socialism, capitalism and what real resistance looks like in Trump’s America.</p><p>On the 17th anniversary of 9/11, the longest continuous U.S. war in history continues in Afghanistan. Rep. Barbara Lee tells the story of her historic lone vote against the Authorization for the Use of Military Force, and the harassment and death threats she received after her speech on September 14, 2001. </p><p>We speak with Nathan Robinson, the editor of Current Affairs magazine, and Intercept senior politics editor Briahna Joy Gray about the state of left politics, the midterm elections and the reappearance of Barack Obama.</p>\n       &#10;&nbsp;<br /><hr><p style='color: grey; font - size: 0.75em; '>See <a style='color: grey; ' target='_blank' rel='noopener noreferrer' href='https://acast.com/privacy'>acast.com/privacy</a> for privacy and opt-out information.</p>",
            "length": "92780184",
            "sourceUrl": "https://sphinx.acast.com/intercepted-with-jeremy-scahill/donaldtrump-thedemocratsandtheillusionofamericangreatness/media.mp3"
        },
        {
            "title": "Double Negative",
            "datePublished": "Wed, 25 Jul 2018 10:00:00 GMT",
            "description": "\n        <p>Russian-American journalist Masha Gessen analyzes the fallout from the Trump-Putin summit, what Putin actually wants from Trump, and the indictment of 12 Russian GRU officers. The Intercept’s Micah Lee offers a technical analysis of the indictment of Russian intelligence operatives. NYU professor Nikhil Pal Singh talks about the ahistorical analogies used to describe Trump and <em>l’affaire</em> Russia. Experimental electronic musician Oneohtrix Point Never discusses his Russian roots, Steve Bannon's favorite book, and the inspiration for his cinematically dystopic album, \"Age Of.\"</p>\n       &#10;&nbsp;<br /><hr><p style='color: grey; font - size: 0.75em; '>See <a style='color: grey; ' target='_blank' rel='noopener noreferrer' href='https://acast.com/privacy'>acast.com/privacy</a> for privacy and opt-out information.</p>",
            "length": "84341096",
            "sourceUrl": "https://sphinx.acast.com/intercepted-with-jeremy-scahill/doublenegative/media.mp3"
        },
        {
            "title": "A Message from Jeremy",
            "datePublished": "Wed, 18 Jul 2018 10:00:00 GMT",
            "description": "\n        <p>We're off this week, but we'll be back with a new episode of Intercepted on July 25th.</p>\n       &#10;&nbsp;<br /><hr><p style='color: grey; font - size: 0.75em; '>See <a style='color: grey; ' target='_blank' rel='noopener noreferrer' href='https://acast.com/privacy'>acast.com/privacy</a> for privacy and opt-out information.</p>",
            "length": "435542",
            "sourceUrl": "https://sphinx.acast.com/intercepted-with-jeremy-scahill/amessagefromjeremy/media.mp3"
        },
        {
            "title": "A Judicial Coup, the Carceral State, and the War Against Us All",
            "datePublished": "Wed, 11 Jul 2018 10:00:00 GMT",
            "description": "\n        <p>Dr. Abdul El-Sayed, 33, is running for governor of Michigan on a campaign of creating a single-payer health care system, raising the minimum wage to $15, legalizing marijuana, and a sweeping overhaul of the state’s criminal justice system. He discusses his campaign, his views on the Democratic Party, the Flint water catastrophe, and why he believes he can accomplish his agenda despite the powerful right-wing forces in Michigan politics. </p><p>As the internment of immigrant families continues, we revisit Scahill's 2017 conversation with educator and organizer Mariame Kaba. She retraces the evolution of the U.S. prison system, from convict leasing to three-strikes law, and the devastating generational impact these policies have disproportionately had on black and brown communities.</p><p>Filmmaker Michelle Latimer discusses her new documentary \"Nuuca,\" a nuanced exploration of the brutal transformation that oil extraction brought to one North Dakotan community. The film follows three young indigenous women who struggle with an influx of men and rising rates of sexual abuse, rape, and kidnappings.</p>\n       &#10;&nbsp;<br /><hr><p style='color: grey; font - size: 0.75em; '>See <a style='color: grey; ' target='_blank' rel='noopener noreferrer' href='https://acast.com/privacy'>acast.com/privacy</a> for privacy and opt-out information.</p>",
            "length": "68582711",
            "sourceUrl": "https://sphinx.acast.com/intercepted-with-jeremy-scahill/ajudicialcoup-thecarceralstate-andthewaragainstusall/media.mp3"
        },
        {
            "title": "Intercepted Live from Brooklyn",
            "datePublished": "Wed, 27 Jun 2018 10:00:00 GMT",
            "description": "\n        <p>Legendary reporter Seymour Hersh on what he thinks of Donald Trump, his analysis of the Trump/Russia story, and some wild stories from his new memoir, “Reporter.” ACLU attorney Lee Gelernt recounts the latest on the immigrant families that are being ripped apart and separated indefinitely, and shares personal stories of the victims he represents in a nationwide class action suit against the Trump administration. Activist Mariame Kaba explains the historical foundations of the American carceral state and calls for the abolition of ICE and the prison industrial complex. Multimedia artist and rapper Yassin Alsalman, better known by Narcy, performs an original spoken word and premieres his new song, “Yemenade.”</p>\n       &#10;&nbsp;<br /><hr><p style='color: grey; font - size: 0.75em; '>See <a style='color: grey; ' target='_blank' rel='noopener noreferrer' href='https://acast.com/privacy'>acast.com/privacy</a> for privacy and opt-out information.</p>",
            "length": "66565562",
            "sourceUrl": "https://sphinx.acast.com/intercepted-with-jeremy-scahill/interceptedlivefrombrooklyn/media.mp3"
        },
        {
            "title": "Administration of Hate",
            "datePublished": "Wed, 20 Jun 2018 10:00:00 GMT",
            "description": "\n        <p>The Intercept’s Ryan Devereaux talks about his recent reporting in the border state of Arizona and paints a harrowing picture of the human toll of family separations by ICE. Alice Speri lays out her investigation of sexual abuse by ICE officers and contractors in immigration detention centers. </p><p>Sohail Daulatzai discusses his new book,\" With Stones in Our Hands: Writings on Muslims, Racism and Empire,\" and explains why the film \"The Battle of Algiers\" is still relevant more than 50 years since its release. </p><p>The legendary resistance singer Barbara Dane shares stories from her 91 years on earth fighting militarism, racism, and economic injustice. Plus, Homeland Security Secretary Kirstjen Nielsen competes on Jeopardy! and we hear a cover of “The Partisan” from composers and musicians Leo Heiblum of Mexico and Tenzin Choegyal of Tibet.</p>\n       &#10;&nbsp;<br /><hr><p style='color: grey; font - size: 0.75em; '>See <a style='color: grey; ' target='_blank' rel='noopener noreferrer' href='https://acast.com/privacy'>acast.com/privacy</a> for privacy and opt-out information.</p>",
            "length": "75468502",
            "sourceUrl": "https://sphinx.acast.com/intercepted-with-jeremy-scahill/administrationofhate/media.mp3"
        },
        {
            "title": "Kim Meets Trump",
            "datePublished": "Wed, 13 Jun 2018 10:00:00 GMT",
            "description": "\n        <p>As TV pundits gasped at the sight of the North Korean and U.S. flags side by side and Trump treating Kim Jong-un as an “equal,” most Koreans supported the summit. UC Santa Cruz professor Christine Hong talks about the significance of this moment, how the U.S. has sabotaged peace in the past and what an end to the war might look like. Tom Engelhardt, editor of TomDispatch, shares an essay on American militarism from his new book \"A Nation Unmade by War.\" Journalist Elisabeth Rosenthal explains why the U.S. healthcare system is so bad and how Trump and the Republicans are trying to make it even worse. Musical artist Yasmine Hamdan shares her thoughts on war, the Middle East, Trump, and her groundbreaking music. Plus, Trump stops by Mr. Roger’s Neighborhood.</p>\n       &#10;&nbsp;<br /><hr><p style='color: grey; font - size: 0.75em; '>See <a style='color: grey; ' target='_blank' rel='noopener noreferrer' href='https://acast.com/privacy'>acast.com/privacy</a> for privacy and opt-out information.</p>",
            "length": "82842596",
            "sourceUrl": "https://sphinx.acast.com/intercepted-with-jeremy-scahill/kimmeetstrump/media.mp3"
        },
        {
            "title": "The Persecution of Reality Winner",
            "datePublished": "Wed, 06 Jun 2018 10:00:00 GMT",
            "description": "\n        <p> While Paul Manafort enjoyed the comforts of his Hamptons mansion on house arrest, Winner was denied bond, kept in a jail and has been subjected to a public smear campaign by Jeff Sessions’ Justice Department. She was the first whistleblower charged under President Trump and her treatment is unprecedented. </p><p>Former drone technician-turned-whistleblower Lisa Ling talks about the campaign to free Winner. Trevor Timm of Freedom of the Press Foundation breaks down how the government is stripping Winner of her right to a fair trial. The Intercept’s Peter Maass highlights the injustice and hypocrisy of her treatment. Intercept editor in chief Betsy Reed and reporter Sam Biddle talk about the top secret NSA document she allegedly leaked, the irony of the media silence about Winner’s treatment, and why First Look Media is funding her defense. To support Reality Winner's legal defense fund, click <a href=\"http://theintercept.com/supportreality\">here</a>.</p><p>Come see Intercepted live in Brooklyn, NY on June 21 with featured guest, Pulitzer Prize-winning journalist Seymour Hersh. Tickets are now <a href=\"https://theintercept.com/tickets/\">available</a>.</p>\n       &#10;&nbsp;<br /><hr><p style='color: grey; font - size: 0.75em; '>See <a style='color: grey; ' target='_blank' rel='noopener noreferrer' href='https://acast.com/privacy'>acast.com/privacy</a> for privacy and opt-out information.</p>",
            "length": "55574357",
            "sourceUrl": "https://sphinx.acast.com/intercepted-with-jeremy-scahill/thepersecutionofrealitywinner/media.mp3"
        },
        {
            "title": "White Fear",
            "datePublished": "Wed, 30 May 2018 10:00:00 GMT",
            "description": "\n        <p>ICE and U.S. Customs and Border Protection have become authoritarian shock forces, operating with impunity, ripping children from their parents’ arms, and enforcing the anti-immigrant edicts of Trump and Sessions. But the horrors did not start with Trump. This week on Intercepted: Alexandria Ocasio-Cortez is challenging one of the most powerful Democrats in the country for his Congressional seat. She is running on a platform of social and economic justice and she has called for ICE to be abolished. Professor Eddie Glaude Jr. of Princeton on white supremacy and law enforcement, the “rot” in the establishment Democratic Party, and Trump’s obsession with Black athletes.</p>\n       &#10;&nbsp;<br /><hr><p style='color: grey; font - size: 0.75em; '>See <a style='color: grey; ' target='_blank' rel='noopener noreferrer' href='https://acast.com/privacy'>acast.com/privacy</a> for privacy and opt-out information.</p>",
            "length": "67773828",
            "sourceUrl": "https://sphinx.acast.com/intercepted-with-jeremy-scahill/whitefear/media.mp3"
        },
        {
            "title": "The Killing Machine",
            "datePublished": "Wed, 23 May 2018 10:00:00 GMT",
            "description": "\n        <p>Journalist Allan Nairn analyzes Trump's rise to power, the agenda of the extremist Republican Party, and dissects the latest on the Trump/Russia investigation. Author and retired psychologist Dr. Jeffrey Kaye discusses the U.S. Army Field Manual and its Appendix M. This document is the current U.S. policy on the treatment of foreign detainees. Kaye explains why some of its currently “approved” tactics are torture. Syrian journalist Marwan Hisham and artist Molly Crabapple discuss their new book, \"Brothers of the Gun: A Memoir of the Syrian War.\" Plus, the bizarre and frightening story of how the CIA created a shellfish toxin dart gun.</p>\n       &#10;&nbsp;<br /><hr><p style='color: grey; font - size: 0.75em; '>See <a style='color: grey; ' target='_blank' rel='noopener noreferrer' href='https://acast.com/privacy'>acast.com/privacy</a> for privacy and opt-out information.</p>",
            "length": "97150841",
            "sourceUrl": "https://sphinx.acast.com/intercepted-with-jeremy-scahill/thekillingmachine/media.mp3"
        },
        {
            "title": "War Crimes and Collective Punishment",
            "datePublished": "Wed, 16 May 2018 10:00:00 GMT",
            "description": "\n        <p>Blacklisted academic Norman Finkelstein discusses his meticulous, scholarly documentation of the collective punishment of Gaza, “the largest concentration camp in the world.” The son of two Nazi concentration camp survivors, Finkelstein is an incendiary academic whose work has infuriated the Israeli government for decades. His latest book, \"Gaza: An Inquest Into its Martyrdom,\" has not been reviewed in a single U.S. newspaper. He talks about the latest massacre in Gaza, the history of US support for Israel’s war crimes and why he believes Iran is out-maneuvering Netanyahu. </p><p>Sen. Ron Wyden, a longtime member of the Intelligence Committee, blasts the CIA propaganda campaign in support of Haspel and accuses the Republicans of engaging in a secret confirmation process. Jeremy also asks Wyden if he believes CIA personnel involved with torture should be criminally prosecuted, what he thinks of Edward Snowden and why James Clapper, Obama’s director of national intelligence, was never charged with perjury. </p><p>Plus, Jared Kushner speaks a little too much truth at the Jerusalem embassy.</p>\n       &#10;&nbsp;<br /><hr><p style='color: grey; font - size: 0.75em; '>See <a style='color: grey; ' target='_blank' rel='noopener noreferrer' href='https://acast.com/privacy'>acast.com/privacy</a> for privacy and opt-out information.</p>",
            "length": "75313048",
            "sourceUrl": "https://sphinx.acast.com/intercepted-with-jeremy-scahill/warcrimesandcollectivepunishment/media.mp3"
        },
        {
            "title": "Just Following Orders",
            "datePublished": "Wed, 09 May 2018 10:00:00 GMT",
            "description": "\n        <p>As a bipartisan gaggle of spies and politicians lobby for Gina Haspel to become CIA director, we look at how after World War II, the U.S. and its allies prosecuted Japanese soldiers for waterboarding American POWs. Journalist Matt Taibbi talks about Trump, Russia, Putin, Stormy Daniels and the liberal embrace of authoritarianism. Sarah Jaffe reports on the teachers’ strikes across the U.S., the fight for unions and the rebellion of low wage workers. Former Goldman Sachs and Bear Sterns executive Nomi Prins talks about central banks, the Federal Reserve and economic neoliberalism. Plus, Melania Trump launches a campaign to educate her husband.</p>\n       &#10;&nbsp;<br /><hr><p style='color: grey; font - size: 0.75em; '>See <a style='color: grey; ' target='_blank' rel='noopener noreferrer' href='https://acast.com/privacy'>acast.com/privacy</a> for privacy and opt-out information.</p>",
            "length": "84909270",
            "sourceUrl": "https://sphinx.acast.com/intercepted-with-jeremy-scahill/justfollowingorders/media.mp3"
        },
        {
            "title": "War Games",
            "datePublished": "Wed, 02 May 2018 10:00:00 GMT",
            "description": "\n        <p>Trita Parsi of the National Iranian American Council confronts the lies and propaganda emanating from Israel and the White House on Iran and nuclear weapons. As Trump prepares his Nobel Peace Prize tweets and the afterparty for his upcoming summit with Kim Jong-un, Christine Ahn looks at U.S. war crimes in Korea, Pyongyang's strategy, and the quiet revolution that swept Moon Jae-in into power in South Korea. Mark Keam, a former top Senate lawyer and current delegate to Virginia’s legislature, talks about the CIA spying on the Senate, Haspel and torture, and the growing movement to block her confirmation.</p>\n       &#10;&nbsp;<br /><hr><p style='color: grey; font - size: 0.75em; '>See <a style='color: grey; ' target='_blank' rel='noopener noreferrer' href='https://acast.com/privacy'>acast.com/privacy</a> for privacy and opt-out information.</p>",
            "length": "86905338",
            "sourceUrl": "https://sphinx.acast.com/intercepted-with-jeremy-scahill/wargames/media.mp3"
        },
        {
            "title": "BONUS: Ralph Nader on Gina Haspel, John Bolton, Syria and the ‘decrepit’ Democratic Party",
            "datePublished": "Sun, 29 Apr 2018 10:00:00 GMT",
            "description": "\n        <p>Ralph Nader is the best known public advocate in modern U.S. history, and has run for president four times. On this special episode of Intercepted, we are going to dig deep into several issues facing the country and the world right now. Nader rose to prominence in the 1960s after blowing the lid on extreme safety issues with General Motors and other car manufacturers’ products. His book, \"Unsafe at Any Speed,\" was an influential investigation and exposé. Throughout his life, Nader has waged countless campaigns aimed at food safety, worker, and environmental protections.</p><p>At the age of 84, he continues to wage the very same battles he has from the start of his public life. His latest book, “Breaking Through Power,” chronicles his various battles against the U.S. government, big corporations and concentrated political power. The latest Intercepted featured an excerpt of our interview with Nader. What follows is the entire conversation.</p>\n       &#10;&nbsp;<br /><hr><p style='color: grey; font - size: 0.75em; '>See <a style='color: grey; ' target='_blank' rel='noopener noreferrer' href='https://acast.com/privacy'>acast.com/privacy</a> for privacy and opt-out information.</p>",
            "length": "54052020",
            "sourceUrl": "https://sphinx.acast.com/intercepted-with-jeremy-scahill/bonus-ralphnaderonginahaspel-johnbolton-syriaandthe-decrepit-democraticparty/media.mp3"
        },
        {
            "title": "The Haspel Ultimatum",
            "datePublished": "Wed, 25 Apr 2018 10:00:00 GMT",
            "description": "\n        <p>Ralph Nader analyzes the state of the Democratic Party, the DNC lawsuit against Russia, and lays out the John Bolton threat. Whistleblower and Senate candidate Chelsea Manning talks about prison, comparisons to Edward Snowden, and her campaign. And artist Ricardo Cortés (\"Go the Fuck to Sleep\") talks about the secret history of the coca and cola in your Coke, his post-9/11 coloring book about xenophobia, and his latest work, “Sea Creatures from the Sky,” a children’s book about otherness.</p>\n       &#10;&nbsp;<br /><hr><p style='color: grey; font - size: 0.75em; '>See <a style='color: grey; ' target='_blank' rel='noopener noreferrer' href='https://acast.com/privacy'>acast.com/privacy</a> for privacy and opt-out information.</p>",
            "length": "94887844",
            "sourceUrl": "https://sphinx.acast.com/intercepted-with-jeremy-scahill/thehaspelultimatum/media.mp3"
        },
        {
            "title": "Evening at the Talk House (Part 3)",
            "datePublished": "Wed, 18 Apr 2018 12:00:00 GMT",
            "description": "\n        <p>Intercepted presents \"Evening at the Talk House\", an original play by Wallace Shawn.  Part 3 of 3.  All it takes is complacency to enable the dirty work of an authoritarian regime.</p><p>Cast: JANE - Annapurna Sriram; DICK - Wallace Shawn; ROBERT - Matthew Broderick; TED - John Epperson; NELLIE - Jill Eikenberry; TOM - Larry Pine; ANNETTE - Claudia Shear; BILL - Michael Tucker</p><p><em>Based on the original U.S. theatrical production directed by Scott Elliott for the New Group in New York. Written by Wallace Shawn. Directed and produced by Pejk Malinovski. Assistant Director Marie Masters. Original music by John Epperson. Additional music, mixing, and sound design by Bart Warshaw. Executive producers Jeremy Scahill and Leital Molad.</em></p>\n       &#10;&nbsp;<br /><hr><p style='color: grey; font - size: 0.75em; '>See <a style='color: grey; ' target='_blank' rel='noopener noreferrer' href='https://acast.com/privacy'>acast.com/privacy</a> for privacy and opt-out information.</p>",
            "length": "50120073",
            "sourceUrl": "https://sphinx.acast.com/intercepted-with-jeremy-scahill/eveningatthetalkhouse-part3-/media.mp3"
        },
        {
            "title": "Evening at the Talk House (Part 2)",
            "datePublished": "Wed, 18 Apr 2018 11:00:00 GMT",
            "description": "\n        <p>Intercepted presents \"Evening at the Talk House\", an original play by Wallace Shawn.  Part 2 of 3.  As drinks and hors d’oeuvres are consumed, small talk evolves into more sinister topics.</p><p>Cast: JANE - Annapurna Sriram; DICK - Wallace Shawn; ROBERT - Matthew Broderick; TED - John Epperson; NELLIE - Jill Eikenberry; TOM - Larry Pine; ANNETTE - Claudia Shear; BILL - Michael Tucker</p><p><em>Based on the original U.S. theatrical production directed by Scott Elliott for the New Group in New York. Written by Wallace Shawn. Directed and produced by Pejk Malinovski. Assistant Director Marie Masters. Original music by John Epperson. Additional music, mixing, and sound design by Bart Warshaw. Executive producers Jeremy Scahill and Leital Molad.</em></p>\n       &#10;&nbsp;<br /><hr><p style='color: grey; font - size: 0.75em; '>See <a style='color: grey; ' target='_blank' rel='noopener noreferrer' href='https://acast.com/privacy'>acast.com/privacy</a> for privacy and opt-out information.</p>",
            "length": "43899007",
            "sourceUrl": "https://sphinx.acast.com/intercepted-with-jeremy-scahill/eveningatthetalkhouse-part2-/media.mp3"
        },
        {
            "title": "Evening at the Talk House (Part 1)",
            "datePublished": "Wed, 18 Apr 2018 10:00:00 GMT",
            "description": "\n        <p>Intercepted presents \"Evening at the Talk House\", an original play by Wallace Shawn.  Part 1 of 3.  A group of writers and actors reunite to celebrate a collaboration from their past. But the world is now very different. And so are they</p><p>Cast: JANE - Annapurna Sriram; DICK - Wallace Shawn; ROBERT - Matthew Broderick; TED - John Epperson; NELLIE - Jill Eikenberry; TOM - Larry Pine; ANNETTE - Claudia Shear; BILL - Michael Tucker</p><p><em>Based on the original U.S. theatrical production directed by Scott Elliott for the New Group in New York. Written by Wallace Shawn. Directed and produced by Pejk Malinovski. Assistant Director Marie Masters. Original music by John Epperson. Additional music, mixing, and sound design by Bart Warshaw. Executive producers Jeremy Scahill and Leital Molad.</em></p>\n       &#10;&nbsp;<br /><hr><p style='color: grey; font - size: 0.75em; '>See <a style='color: grey; ' target='_blank' rel='noopener noreferrer' href='https://acast.com/privacy'>acast.com/privacy</a> for privacy and opt-out information.</p>",
            "length": "55920126",
            "sourceUrl": "https://sphinx.acast.com/intercepted-with-jeremy-scahill/eveningatthetalkhouse-part1-/media.mp3"
        },
        {
            "title": "A Nation Addicted to War",
            "datePublished": "Wed, 11 Apr 2018 10:00:00 GMT",
            "description": "\n        <p>Historian Andrew Bacevich and Jeremy make the case against escalating U.S. military action in Syria even if Assad’s forces were behind the attack. The acclaimed novelist Arundhati Roy talks about her new novel, \"The Ministry of Utmost Happiness,\" and offers insights on Kashmir, Narendra Modi, Trump, and more. Actor and writer Wallace Shawn (My Dinner with Andre, The Princess Bride) talks about the U.S. assassination program, imperial wars and collective responsibility. He and Jeremy also discuss \"Evening at the Talk House,\" Shawn’s new audio drama premiering next week on Intercepted. </p>\n       &#10;&nbsp;<br /><hr><p style='color: grey; font - size: 0.75em; '>See <a style='color: grey; ' target='_blank' rel='noopener noreferrer' href='https://acast.com/privacy'>acast.com/privacy</a> for privacy and opt-out information.</p>",
            "length": "88356146",
            "sourceUrl": "https://sphinx.acast.com/intercepted-with-jeremy-scahill/anationaddictedtowar/media.mp3"
        },
        {
            "title": "Injustice League",
            "datePublished": "Wed, 04 Apr 2018 10:00:00 GMT",
            "description": "\n        <p>Yousef Mema, a 24-year-old nursing student in Gaza who witnessed the massacre, describes the killings and the aftermath and he has a message for U.S. lawmakers. Then, key narratives about the Orlando Pulse nightclub shooter, Omar Mateen, and his motives and alleged accomplices are falling apart. The Intercept’s Glenn Greenwald talks about the new information. We speak to two DA candidates in California: Geneviéve Jones-Wright of San Diego and Pamela Price of Alameda County. If successful, these new, progressive DAs could shake the criminal justice industry to its core and find themselves at war with the Trump White House.  And, Frank from Donnie Darko pays a visit to the White House.</p>\n       &#10;&nbsp;<br /><hr><p style='color: grey; font - size: 0.75em; '>See <a style='color: grey; ' target='_blank' rel='noopener noreferrer' href='https://acast.com/privacy'>acast.com/privacy</a> for privacy and opt-out information.</p>",
            "length": "76433540",
            "sourceUrl": "https://sphinx.acast.com/intercepted-with-jeremy-scahill/injusticeleague/media.mp3"
        },
        {
            "title": "Donald Trump's 'Stache Infection",
            "datePublished": "Wed, 28 Mar 2018 10:00:00 GMT",
            "description": "\n        <p>Famed women’s rights attorney Gloria Allred, who has a case against Trump that may result in her deposing the president, analyzes the legal battles ahead for the president. Former national security briefer to George HW Bush, Ray McGovern, talks about John Bolton, Russia, and the CIA’s twitter account engaging in domestic propaganda. The Intercept’s Ryan Grim and Alex Emmons talk about Kushner, the Presidential Daily Brief, and MBS’s royal putsch that made him next in line for the Saudi throne. And punk musician Alice Bags of The Bags talks about the early punk scene in Los Angeles, feminism, her career and we hear music from her new album, “Blueprint.”</p>\n       &#10;&nbsp;<br /><hr><p style='color: grey; font - size: 0.75em; '>See <a style='color: grey; ' target='_blank' rel='noopener noreferrer' href='https://acast.com/privacy'>acast.com/privacy</a> for privacy and opt-out information.</p>",
            "length": "84860789",
            "sourceUrl": "https://sphinx.acast.com/intercepted-with-jeremy-scahill/donaldtrumpsstacheinfection/media.mp3"
        },
        {
            "title": "Presenting: Deconstructed with Mehdi Hasan",
            "datePublished": "Fri, 23 Mar 2018 13:00:00 GMT",
            "description": "\n        <p>In the debut episode of The Intercept’s new podcast, Mehdi Hasan sits down with independent senator and former presidential candidate Bernie Sanders to discuss why the mainstream press ignores so many of the economic issues that affect the lives of average Americans: poverty, homelessness, and inequality. Subscribe at <a href=\"http://theintercept.com/deconstructed\">theintercept.com/deconstructed</a> or search for Deconstructed on your podcast platform of choice.</p>\n       &#10;&nbsp;<br /><hr><p style='color: grey; font - size: 0.75em; '>See <a style='color: grey; ' target='_blank' rel='noopener noreferrer' href='https://acast.com/privacy'>acast.com/privacy</a> for privacy and opt-out information.</p>",
            "length": "22513632",
            "sourceUrl": "https://sphinx.acast.com/intercepted-with-jeremy-scahill/presenting-deconstructedwithmehdihasan/media.mp3"
        },
        {
            "title": "Legacy of Blood",
            "datePublished": "Wed, 21 Mar 2018 10:00:00 GMT",
            "description": "\n        <p>Jeremy digs deep into the U.S. legacy in Iraq.  Mehdi Hasan, host of the new Intercept podcast \"Deconstructed,\" talks about the commercial that 60 Minutes ran for the Saudi crown prince Mohammed bin Salman and the war in Syria. Matthew Cole talks about how, before becoming FBI director, Chris Wray supervised an investigation that found that Blackwater founder Erik Prince likely broke U.S. laws. The Intercept’s Sam Biddle takes us inside the Cambridge Analytica scandal and the chaos at Facebook. And artist, writer, and educator Eve Ewing talks about her new book \"Electric Arches,\"</p>\n       &#10;&nbsp;<br /><hr><p style='color: grey; font - size: 0.75em; '>See <a style='color: grey; ' target='_blank' rel='noopener noreferrer' href='https://acast.com/privacy'>acast.com/privacy</a> for privacy and opt-out information.</p>",
            "length": "91966299",
            "sourceUrl": "https://sphinx.acast.com/intercepted-with-jeremy-scahill/legacyofblood/media.mp3"
        },
        {
            "title": "The Lyin', the Rich and the Warmongers",
            "datePublished": "Wed, 14 Mar 2018 10:00:00 GMT",
            "description": "\n        <p>The Intercept’s Matthew Cole and Jeremy analyze the major re-shuffle in Trumpland and what it means for the future of the planet. Rep. Jan Schakowsky, who led the investigation of Erik Prince and Blackwater for years in Congress, analyzes the ongoing scandal over his alleged role in the Trump era. Musical artists Ana Tijoux and Lila Downs talk about the politics of colonialism, neoliberalism, and revolution and their new collaboration, Tinta Roja.</p>\n       &#10;&nbsp;<br /><hr><p style='color: grey; font - size: 0.75em; '>See <a style='color: grey; ' target='_blank' rel='noopener noreferrer' href='https://acast.com/privacy'>acast.com/privacy</a> for privacy and opt-out information.</p>",
            "length": "82827890",
            "sourceUrl": "https://sphinx.acast.com/intercepted-with-jeremy-scahill/thelyin-therichandthewarmongers/media.mp3"
        },
        {
            "title": "Covert History, Revolutionary Hip-Hop, and the Politics of Empire",
            "datePublished": "Wed, 07 Mar 2018 11:00:00 GMT",
            "description": "\n        <p>This week we're taking a step back to look at the larger implications of the Trump administration. Rebel historian and professor Alfred McCoy breaks down the history of America's geopolitical maneuvering and how it has shifted under Obama and Trump. He explains why Trump reminds him of disgraced former British Prime Minister, Sir Anthony Eden. We also speak to acclaimed hip-hop artist Felipe Coronel, better known as Immortal Technique, on issues of American imperialism, racism, global covert actions, and capitalism — topics that his lyrics often tackle head-on. He details the connection between Black Lives Matter and opposing the drone killing of black and brown people across the world. Plus, he shares a powerful freestyle verse on the state of life in America today. And Sam Nunberg stars in \"Swingers.\"</p>\n       &#10;&nbsp;<br /><hr><p style='color: grey; font - size: 0.75em; '>See <a style='color: grey; ' target='_blank' rel='noopener noreferrer' href='https://acast.com/privacy'>acast.com/privacy</a> for privacy and opt-out information.</p>",
            "length": "67288471",
            "sourceUrl": "https://sphinx.acast.com/intercepted-with-jeremy-scahill/coverthistory-revolutionaryhip-hop-andthepoliticsofempire/media.mp3"
        },
        {
            "title": "BONUS: Mat Johnson Talks \"Incognegro,\" Guns, Black Panther, and Growing up in Philadelphia",
            "datePublished": "Sun, 04 Mar 2018 13:00:00 GMT",
            "description": "\n        <p>In 1958, a Virginia couple, Mildred Jeter and Richard Loving, married in the District of Columbia. About four months after their marriage, the Virginia county they lived in issued a criminal indictment charging the Lovings with violating Virginia’s ban on interracial marriage. Mildred was black and Richard was white.</p><p>Their case, Loving v. Virginia, eventually reached the U.S. Supreme Court. And it would take nearly a decade before all state laws prohibiting interracial marriage were struck down.</p><p>A new series from TOPIC.com tells the story of Americans born to one black parent and one white parent after the 1967 Supreme Court decision. The series is titled “The Loving Generation.”</p><p>From Melissa Harris-Perry to Mat Johnson, and Panama Jackson, The Loving Generation features a diversity of voices examining the borderland between “blackness” and “whiteness.”</p><p>Johnson is an award winning novelist and comic book writer. His graphic novel series \"Incognegro\" centers around a mixed race detective who goes undercover as a white man to solve racially-motivated crimes. His latest work is titled \"Incognegro: Renaissance.\" Mat is also a professor at the University of Houston Creative Writing Program.</p>\n       &#10;&nbsp;<br /><hr><p style='color: grey; font - size: 0.75em; '>See <a style='color: grey; ' target='_blank' rel='noopener noreferrer' href='https://acast.com/privacy'>acast.com/privacy</a> for privacy and opt-out information.</p>",
            "length": "57590694",
            "sourceUrl": "https://sphinx.acast.com/intercepted-with-jeremy-scahill/bonus-matjohnsontalksincognegro-guns-blackpanther-andgrowingupinphiladelphia/media.mp3"
        },
        {
            "title": "White Supremacy and the Church of the Second Amendment",
            "datePublished": "Wed, 28 Feb 2018 11:00:00 GMT",
            "description": "\n        <p>Historian Roxanne Dunbar-Ortiz argues that the Second Amendment is rooted in genocide, slave patrols and says it should be abolished. Artist Tanna Tucker and historian Nestor Castillo take us on an audio tour of their new graphic history for <a href=\"https://thenib.com/black-and-red\">The Nib</a>, “Black and Red: The History of Black Socialism in America.” And acclaimed novelist Mat Johnson talks about guns, the NFL, the Black Panther film, and growing up bi-racial in Philadelphia.</p>\n       &#10;&nbsp;<br /><hr><p style='color: grey; font - size: 0.75em; '>See <a style='color: grey; ' target='_blank' rel='noopener noreferrer' href='https://acast.com/privacy'>acast.com/privacy</a> for privacy and opt-out information.</p>",
            "length": "79396557",
            "sourceUrl": "https://sphinx.acast.com/intercepted-with-jeremy-scahill/whitesupremacyandthechurchofthesecondamendment/media.mp3"
        },
        {
            "title": "RussiaMania: Glenn Greenwald vs. James Risen",
            "datePublished": "Wed, 21 Feb 2018 11:00:00 GMT",
            "description": "\n        <p>James Risen and Glenn Greenwald have both won Pulitzer prizes. They both have found themselves in the crosshairs of the U.S. government for their journalism. And they both write for The Intercept. But Jim and Glenn have taken very different approaches to covering the Trump/Russia story. This week on Intercepted, they go head-to-head in a debate.</p>\n       &#10;&nbsp;<br /><hr><p style='color: grey; font - size: 0.75em; '>See <a style='color: grey; ' target='_blank' rel='noopener noreferrer' href='https://acast.com/privacy'>acast.com/privacy</a> for privacy and opt-out information.</p>",
            "length": "49489519",
            "sourceUrl": "https://sphinx.acast.com/intercepted-with-jeremy-scahill/russiamania-glenngreenwaldvs.jamesrisen/media.mp3"
        },
        {
            "title": "BONUS: The Laundering of American Empire",
            "datePublished": "Sat, 17 Feb 2018 11:00:00 GMT",
            "description": "\n        <p>The Trump presidency is itself a provocation. But is he the most dangerous president ever? Is he really so outside the norm of the policies of his predecessors? The short answer, when it comes to substance and policy, is: not yet. </p><p>There is a particular risk in erasing the line between horrible things Trump does with horrible things the U.S. has done for a long time and acting like it is all Trump. It’s a complicated conversation, but it is one we should have. It means exploring the roots of white supremacy in the U.S., the way American wars are constantly put through a laundering process to make them seem noble and brave, the way “real American” has been defined and continues to be defined in our society. For eight years, we had the first black president in U.S. history and now we have a reality TV host who spends a great deal of time tweeting and watching TV. So what is unique to Trump and what is embedded in the politics of empire in the U.S.?</p><p>Professor Nikhil Pal Singh has spent years studying trends in U.S. policies throughout history, domestically and internationally. He is professor of Social and Cultural Analysis and History at New York University. His latest book is “Race and America’s Long War.” He is unafraid to take on the golden calves of “American exceptionalism” and challenges us all to examine both the forrest and the trees of American Empire.</p>\n       &#10;&nbsp;<br /><hr><p style='color: grey; font - size: 0.75em; '>See <a style='color: grey; ' target='_blank' rel='noopener noreferrer' href='https://acast.com/privacy'>acast.com/privacy</a> for privacy and opt-out information.</p>",
            "length": "183767829",
            "sourceUrl": "https://sphinx.acast.com/intercepted-with-jeremy-scahill/bonus-thelaunderingofamericanempire/media.mp3"
        },
        {
            "title": "America's Distribution of Violence",
            "datePublished": "Wed, 14 Feb 2018 11:00:00 GMT",
            "description": "\n        <p>As Trump continues his obsession with the MS-13 street gang, The Intercept’s Alice Speri reports on how this “war on gangs” has given the green light for federal agents to target high school students for deportation. NYU professor Nikhil Singh talks about race and America’s long war, and offers a provocative perspective on some of the golden calves of \"American exceptionalism.\" Iran analyst Holly Dagres of TheIranist discusses the politics of regime change and the recent protests in Iran. Plus, Stormy Daniels helps Trump wag the dog.</p>\n       &#10;&nbsp;<br /><hr><p style='color: grey; font - size: 0.75em; '>See <a style='color: grey; ' target='_blank' rel='noopener noreferrer' href='https://acast.com/privacy'>acast.com/privacy</a> for privacy and opt-out information.</p>",
            "length": "82150060",
            "sourceUrl": "https://sphinx.acast.com/intercepted-with-jeremy-scahill/americasdistributionofviolence/media.mp3"
        },
        {
            "title": "BONUS: Jim Risen Goes Inside the NSA’s Secret Channel to Russia",
            "datePublished": "Mon, 12 Feb 2018 11:00:00 GMT",
            "description": "\n        <p>The legendary national security reporter James Risen has a fascinating new expose detailing how U.S. intelligence agencies opened a secret communications channel with Russian operatives, who were offering to sell damaging or compromising intelligence on Donald Trump. In this special bonus episode of Intercepted, James Risen lays out the whole story.</p>\n       &#10;&nbsp;<br /><hr><p style='color: grey; font - size: 0.75em; '>See <a style='color: grey; ' target='_blank' rel='noopener noreferrer' href='https://acast.com/privacy'>acast.com/privacy</a> for privacy and opt-out information.</p>",
            "length": "39529220",
            "sourceUrl": "https://sphinx.acast.com/intercepted-with-jeremy-scahill/bonus-jimrisengoesinsidethensa-ssecretchanneltorussia/media.mp3"
        },
        {
            "title": "Memo and Memoer",
            "datePublished": "Wed, 07 Feb 2018 11:00:00 GMT",
            "description": "\n        <p>Former State Department official Peter van Buren and civil liberties advocate Julian Sanchez offer provocative analysis the Nunes memo. Academy Award winner Errol Morris and actor Peter Sarsgaard talk about their new hybrid-documentary series Wormwood and present their case that a US Army scientist was murdered by the CIA in 1953. Yemeni analyst Nadwa al Dawsari details the key events of the past 20 years.</p>\n       &#10;&nbsp;<br /><hr><p style='color: grey; font - size: 0.75em; '>See <a style='color: grey; ' target='_blank' rel='noopener noreferrer' href='https://acast.com/privacy'>acast.com/privacy</a> for privacy and opt-out information.</p>",
            "length": "93919503",
            "sourceUrl": "https://sphinx.acast.com/intercepted-with-jeremy-scahill/memoandmemoer/media.mp3"
        },
        {
            "title": "BONUS: The NFL's Violent Ballet",
            "datePublished": "Thu, 01 Feb 2018 11:00:00 GMT",
            "description": "\n        <p>This year in the National Football League, there have been 281 recorded concussions that players have suffered — spanning from the pre-season right up to the last playoff games. This weekend is Super Bowl Sunday. That is a macabre sort of record — it represents the most concussions in a season since the NFL started keeping track six years ago. The hits that these players take over and over during their careers can lead to very serious brain damage and a  degenerative condition known as Chronic Traumatic Encephalopathy or CTE.</p><p>We are doing this special episode of Intercepted to highlight a gut-wrenching new short film that The Intercept’s Josh Begley has directed. It is called \"Concussion Protocol.\"</p><p>In this special bonus episode of Intercepted, Josh Begley, The Intercept’s Shaun King and Donte Stallworth, a ten year veteran of the NFL, discuss brain injuries, the #TakeAKnee protests, and Trump’s attacks on athletes.</p><p>Josh Begley’s video “Concussion Protocol” can be viewed at <a href=\"https://theintercept.com/NFL\">theintercept.com/NFL</a>.</p>\n       &#10;&nbsp;<br /><hr><p style='color: grey; font - size: 0.75em; '>See <a style='color: grey; ' target='_blank' rel='noopener noreferrer' href='https://acast.com/privacy'>acast.com/privacy</a> for privacy and opt-out information.</p>",
            "length": "39331352",
            "sourceUrl": "https://sphinx.acast.com/intercepted-with-jeremy-scahill/bonus-thenflsviolentballet/media.mp3"
        },
        {
            "title": "Hate of the Union",
            "datePublished": "Wed, 31 Jan 2018 11:00:00 GMT",
            "description": "\n        <p>Naomi Klein and Jeremy analyze Trump’s threats toward North Korea, his Executive Order on Guantanamo and the attack on immigrants, the poor, and the environment. Veteran journalist Juan González dissects the roots of fascism, the rise of authoritarian movements, and global migration trends. Marcy Wheeler gives a brief analysis of a theory floated by a former CIA officer that the “Steele dossier” contains Russian disinformation. Ali Abunimah of Electronic Intifada discusses Israeli collusion with the Trump campaign and Mike Pence’s trip to Israel. And Franklin James Fisher of the band Algiers talks about their music from \"The Underside of Power.\"</p>\n       &#10;&nbsp;<br /><hr><p style='color: grey; font - size: 0.75em; '>See <a style='color: grey; ' target='_blank' rel='noopener noreferrer' href='https://acast.com/privacy'>acast.com/privacy</a> for privacy and opt-out information.</p>",
            "length": "82849960",
            "sourceUrl": "https://sphinx.acast.com/intercepted-with-jeremy-scahill/hateoftheunion/media.mp3"
        },
        {
            "title": "First They Came For the Immigrants",
            "datePublished": "Wed, 24 Jan 2018 11:00:00 GMT",
            "description": "\n        <p>As Donald Trump forges ahead with his plans for mass deportations and Democrats flail in their response, Ninaj Roul and Yanira Arias describe the plight of hundreds of thousands of people in imminent danger of deportation. Journalist Nick Pinto reveals how ICE agents are staking out churches and homes of immigrant rights activists. Intercept Washington D.C. bureau chief Ryan Grim breaks down a clause slipped into the budget bill that gives the White House authority to fund CIA programs without oversight. We talk to revolutionary musical artist Seun Kuti, son of the legendary Afrobeat pioneer Fela, and hear music from his forthcoming album, Black Times.</p>\n       &#10;&nbsp;<br /><hr><p style='color: grey; font - size: 0.75em; '>See <a style='color: grey; ' target='_blank' rel='noopener noreferrer' href='https://acast.com/privacy'>acast.com/privacy</a> for privacy and opt-out information.</p>",
            "length": "86295225",
            "sourceUrl": "https://sphinx.acast.com/intercepted-with-jeremy-scahill/firsttheycamefortheimmigrants/media.mp3"
        },
        {
            "title": "BONUS: Leading Marxist Scholar David Harvey on Trump, Wall Street and Debt Peonage",
            "datePublished": "Sun, 21 Jan 2018 13:00:00 GMT",
            "description": "\n        <p>We live in a society that does not study its own history —  its unvarnished history — and often current events are analyzed in a vacuum that almost never includes the context or history necessary to understand what is new, what is old and how we got to where we are. As Trump celebrates his first year in office and demonstrations confront a year of his rule, leading Marxist scholar David Harvey sat down for an interview on Intercepted. Harvey is one of the leading Marxist thinkers in the world and a leading authority on Marx’s \"Das Kapital,\" which turned 150 years old late last year. Harvey is Distinguished Professor of Anthropology and Geography at the City University of New York.</p>\n       &#10;&nbsp;<br /><hr><p style='color: grey; font - size: 0.75em; '>See <a style='color: grey; ' target='_blank' rel='noopener noreferrer' href='https://acast.com/privacy'>acast.com/privacy</a> for privacy and opt-out information.</p>",
            "length": "77926570",
            "sourceUrl": "https://sphinx.acast.com/intercepted-with-jeremy-scahill/bonus-leadingmarxistscholardavidharveyontrump-wallstreetanddebtpeonage/media.mp3"
        },
        {
            "title": "White Mirror",
            "datePublished": "Wed, 17 Jan 2018 11:00:00 GMT",
            "description": "\n        <p>Jeremy lays out the bloody US history in Haiti and El Salvador and blasts the bipartisan, selective amnesia and historical revisionism that “American exceptionalism” demands. Rep. Tulsi Gabbard discusses U.S. regime change, North Korea and why Bernie Sanders would have defeated Trump. As Robert Mueller hits Bannon with a Grand Jury subpoena, former CIA operative and  Cipher Brief columnist John Sipher and journalist Marcy Wheeler of Emptywheel analyze the Russia investigation and the Steele dossier. Leading Marxist scholar David Harvey talks about debt peonage in the age of Trump and the crimes of capitalism.</p>\n       &#10;&nbsp;<br /><hr><p style='color: grey; font - size: 0.75em; '>See <a style='color: grey; ' target='_blank' rel='noopener noreferrer' href='https://acast.com/privacy'>acast.com/privacy</a> for privacy and opt-out information.</p>",
            "length": "102579761",
            "sourceUrl": "https://sphinx.acast.com/intercepted-with-jeremy-scahill/whitemirror/media.mp3"
        },
        {
            "title": "BONUS: All The News Unfit to Print",
            "datePublished": "Wed, 03 Jan 2018 11:00:00 GMT",
            "description": "\n        <p>James Risen is a legend in the world of investigative and national security journalism. As a reporter for the New York Times, Risen broke some of the most important stories of the post 9/11 era, from the warrantless surveillance against Americans conducted under the Bush-Cheney administration, to black prison sites run by the CIA, to failed covert actions in Iran. Risen has won the Pulitzer and other major journalism awards. But perhaps what he is now most famous for is fighting a battle under both the Bush and Obama administrations as they demanded — under threat of imprisonment —the name of one of Risen’s alleged confidential sources. But it isn’t just the government that Risen had to fight. He also battled his own editors and other powerful figures at the New York Times. Risen is now a senior national security correspondent at The Intercept where his incredible inside story has now been published. We talk with Risen about his career at the New York Times in a special edition of Intercepted.</p>\n       &#10;&nbsp;<br /><hr><p style='color: grey; font - size: 0.75em; '>See <a style='color: grey; ' target='_blank' rel='noopener noreferrer' href='https://acast.com/privacy'>acast.com/privacy</a> for privacy and opt-out information.</p>",
            "length": "60914958",
            "sourceUrl": "https://sphinx.acast.com/intercepted-with-jeremy-scahill/bonus-allthenewsunfittoprint/media.mp3"
        },
        {
            "title": "Full Metal Jackass",
            "datePublished": "Wed, 13 Dec 2017 11:00:00 GMT",
            "description": "\n        <p>Former Nixon White House counsel John Dean talks about the Mueller investigation, how the CIA may benefit from Trump’s presidency and how Trump stacks up to Nixon and Reagan. Pentagon Papers whistleblower Daniel Ellsberg talks about the classified secrets he has kept for decades. He has just published his story in a new book, The Doomsday Machine. Field of Vision takes us inside the very strange world of Steve Bannon’s films. Patterson Hood of the band Drive-By Truckers performs.</p>\n       &#10;&nbsp;<br /><hr><p style='color: grey; font - size: 0.75em; '>See <a style='color: grey; ' target='_blank' rel='noopener noreferrer' href='https://acast.com/privacy'>acast.com/privacy</a> for privacy and opt-out information.</p>",
            "length": "90749908",
            "sourceUrl": "https://sphinx.acast.com/intercepted-with-jeremy-scahill/fullmetaljackass/media.mp3"
        },
        {
            "title": "Who's Afraid of the Alt-Deep State?",
            "datePublished": "Wed, 06 Dec 2017 11:00:00 GMT",
            "description": "\n        <p>Matthew Cole joins Jeremy for a discussion about their explosive report in The Intercept that Blackwater founder Erik Prince has been pitching a private spy operation to the White House and CIA. Activist and comedian Randy Credico, who has been hit with a subpoena from the House Intelligence Committee investigating Trump and Russia, joins us.  Journalist Barrett Brown talks about the FBI’s campaign against him and offers a critique of Wikileaks. Singer Amanda Palmer talks about her provocative new video for a cover she did of Pink Floyd’s “Mother.\"</p>\n       &#10;&nbsp;<br /><hr><p style='color: grey; font - size: 0.75em; '>See <a style='color: grey; ' target='_blank' rel='noopener noreferrer' href='https://acast.com/privacy'>acast.com/privacy</a> for privacy and opt-out information.</p>",
            "length": "100189688",
            "sourceUrl": "https://sphinx.acast.com/intercepted-with-jeremy-scahill/whosafraidofthealt-deepstate-/media.mp3"
        },
        {
            "title": "Very Bad Men",
            "datePublished": "Wed, 29 Nov 2017 11:00:00 GMT",
            "description": "\n        <p>This week on Intercepted: Sen. Chris Murphy blasts the US government for its role in the destruction of Yemen. Jeremy tears apart Thomas Friedman’s gross love letter to the Saudi Crown Prince and talks about the bi-partisan war against journalism from Bill Clinton to Donald Trump. The Intercept’s Betsy Reed and Buzzfeed’s Katie Baker analyze this unprecedented public fight against sexual assaulters. Analysis from Harare, Zimbabwe on the ouster of Robert Mugabe. Comedian Joe Para performs a dramatic reenactment of a secret Snowden document.</p>\n       &#10;&nbsp;<br /><hr><p style='color: grey; font - size: 0.75em; '>See <a style='color: grey; ' target='_blank' rel='noopener noreferrer' href='https://acast.com/privacy'>acast.com/privacy</a> for privacy and opt-out information.</p>",
            "length": "89071062",
            "sourceUrl": "https://sphinx.acast.com/intercepted-with-jeremy-scahill/verybadmen/media.mp3"
        },
        {
            "title": "The Distraction in Chief",
            "datePublished": "Wed, 15 Nov 2017 11:00:00 GMT",
            "description": "\n        <p>This week on Intercepted: Rami Khouri breaks down the Saudi agenda in the Middle East, its destruction of Yemen and the bizarre case of the exiled Lebanese prime minister. Aram Roston of Buzzfeed, Spencer Ackerman of the Daily Beast, and The Intercept’s Matthew Cole join Jeremy for a discussion on the mysterious death of a Green Beret in Mali and why the CIA and US military are quite content with the Trump presidency. Wikileaks slid into Donald Trump Jr.’s DMs. Intercept co-founder Glenn Greenwald analyzes what the messages say and how the media covered the story. And we talk to two newly elected Democrats in Virginia: Lee Carter and Elizabeth Guzman. Donald Trump stars in American Beauty.</p>\n       &#10;&nbsp;<br /><hr><p style='color: grey; font - size: 0.75em; '>See <a style='color: grey; ' target='_blank' rel='noopener noreferrer' href='https://acast.com/privacy'>acast.com/privacy</a> for privacy and opt-out information.</p>",
            "length": "91498167",
            "sourceUrl": "https://sphinx.acast.com/intercepted-with-jeremy-scahill/thedistractioninchief/media.mp3"
        },
        {
            "title": "Say Hello to My Little Hands",
            "datePublished": "Wed, 08 Nov 2017 11:00:00 GMT",
            "description": "\n        <p>This week on Intercepted: Rep. Ro Khanna calls for a complete end to all U.S. military assistance to Saudi Arabia and the  catastrophe in Yemen. The former chief prosecutor at Guantanamo, Col. Morris Davis, blasts Trump over his interference in the case of Army Sergeant Bowe Bergdahl and the recent terror attack in New York. And as the Paradise Papers rock the world of the rich who use offshore banks and law firms, we get analysis from Nomi Prins.</p>\n       &#10;&nbsp;<br /><hr><p style='color: grey; font - size: 0.75em; '>See <a style='color: grey; ' target='_blank' rel='noopener noreferrer' href='https://acast.com/privacy'>acast.com/privacy</a> for privacy and opt-out information.</p>",
            "length": "87644789",
            "sourceUrl": "https://sphinx.acast.com/intercepted-with-jeremy-scahill/sayhellotomylittlehands/media.mp3"
        },
        {
            "title": "Criminal Indictments at Home, Secret Wars Abroad",
            "datePublished": "Wed, 01 Nov 2017 10:00:00 GMT",
            "description": "\n        <p>This week on Intercepted: New York Times reporter Charlie Savage and former federal prosecutor Ken White of Popehat break down the recent indictment and plea deal and what it may mean for Trump. Investigative journalist Nick Turse and Kenya scholar Samar Al-Bulushi take us into the world of US militarism in Africa: secret drone bases, US commandos and Washington-backed African forces operating under the guise of the “war on terror.” Musician Roberto Lange of Helado Negro performs.</p>\n       &#10;&nbsp;<br /><hr><p style='color: grey; font - size: 0.75em; '>See <a style='color: grey; ' target='_blank' rel='noopener noreferrer' href='https://acast.com/privacy'>acast.com/privacy</a> for privacy and opt-out information.</p>",
            "length": "72102347",
            "sourceUrl": "https://sphinx.acast.com/intercepted-with-jeremy-scahill/criminalindictmentsathome-secretwarsabroad/media.mp3"
        },
        {
            "title": "Mike Pence is The Koch Brothers' Manchurian Candidate",
            "datePublished": "Wed, 25 Oct 2017 10:00:00 GMT",
            "description": "\n        <p>This week on Intercepted: Investigative journalist Jane Mayer exposes the Koch Brother puppet masters behind Vice President Mike Pence’s rise to power and the ruthless pursuit of corporate profits that put Pence a heartbeat from the presidency.We speak to Chinese dissident and renown artist Ai Weiwei about the humanitarian catastrophe of the 65 million globally displaced migrants and his new documentary, Human Flow. And we end with Deerhoof's Greg Saunier on the songs of “Mountain Moves.”</p>\n       &#10;&nbsp;<br /><hr><p style='color: grey; font - size: 0.75em; '>See <a style='color: grey; ' target='_blank' rel='noopener noreferrer' href='https://acast.com/privacy'>acast.com/privacy</a> for privacy and opt-out information.</p>",
            "length": "71358368",
            "sourceUrl": "https://sphinx.acast.com/intercepted-with-jeremy-scahill/mikepenceisthekochbrothersmanchuriancandidate/media.mp3"
        },
        {
            "title": "Canada is Racist Too",
            "datePublished": "Wed, 18 Oct 2017 10:00:00 GMT",
            "description": "\n        <p>This week on Intercepted live from Toronto: A recent poll puts activist Desmond Cole in prime position to win the mayorship. We talk to him about Canada’s stop and frisk and how Cole would change Toronto. Journalist Naomi Klein warns that the Trudeau and Trump brands may have more in common than expected. And returning Iraqi-Canadian hip-hop artist Narcy gives a powerful live performance.</p><p>Become a sustaining member! Go to <a href=\"https://theintercept.com/join\">theintercept.com/join</a> for more.</p>\n       &#10;&nbsp;<br /><hr><p style='color: grey; font - size: 0.75em; '>See <a style='color: grey; ' target='_blank' rel='noopener noreferrer' href='https://acast.com/privacy'>acast.com/privacy</a> for privacy and opt-out information.</p>",
            "length": "73838064",
            "sourceUrl": "https://sphinx.acast.com/intercepted-with-jeremy-scahill/canadaisracisttoo/media.mp3"
        },
        {
            "title": "The White Stuff",
            "datePublished": "Wed, 11 Oct 2017 10:00:00 GMT",
            "description": "\n        <p>Trump sent Mike Pence on a mission to protest black protesters at an NFL game. Acclaimed author and journalist Ta-Nehisi Coates talks about Trump, Obama, Bernie Sanders, Hillary Clinton, the NFL and much more. Mehrsa Baradaran breaks down the roots of economic apartheid in the US, the ongoing impact of slavery on black communities and offers a provocative history of black banks. And the lead singer of Mashrou Leila, Hamed Sinno, talks about being queer and Arab in the Middle East and Trump’s America.</p>\n       &#10;&nbsp;<br /><hr><p style='color: grey; font - size: 0.75em; '>See <a style='color: grey; ' target='_blank' rel='noopener noreferrer' href='https://acast.com/privacy'>acast.com/privacy</a> for privacy and opt-out information.</p>",
            "length": "90664728",
            "sourceUrl": "https://sphinx.acast.com/intercepted-with-jeremy-scahill/thewhitestuff/media.mp3"
        },
        {
            "title": "Guns Before Country",
            "datePublished": "Wed, 04 Oct 2017 10:00:00 GMT",
            "description": "\n        <p>This week, Jeremy talks about the Coalition of the Killing — gun lobbyists, politicians and weapons manufacturers — the only beneficiaries of the massacre in Las Vegas. Alynda Segarra of the band Hurray for the Riff Raff explores her Puerto Rican roots and performs new songs. Former US Army Ranger Rory Fanning talks about his slain comrade, NFL star-turned soldier Pat Tillman. Historian Jeanne Theoharis shreds the sanitizing of the legacies of Martin Luther King Jr. and Rosa Parks. And Donald Trump takes his love of guns into the Twilight Zone.</p><p>Support our show — become a member!  <a href=\"http://theintercept.com/join\">theintercept.com/join</a></p><p>Panoply's podcast listener survey: <a href=\"http://survey.panoply.fm\">survey.panoply.fm</a></p>\n       &#10;&nbsp;<br /><hr><p style='color: grey; font - size: 0.75em; '>See <a style='color: grey; ' target='_blank' rel='noopener noreferrer' href='https://acast.com/privacy'>acast.com/privacy</a> for privacy and opt-out information.</p>",
            "length": "76246095",
            "sourceUrl": "https://sphinx.acast.com/intercepted-with-jeremy-scahill/gunsbeforecountry/media.mp3"
        },
        {
            "title": "For Whom the Trump Trolls",
            "datePublished": "Wed, 27 Sep 2017 10:00:00 GMT",
            "description": "\n        <p>This week on Intercepted, physicist David Wright from the Union of Concerned Scientists explains how easy it would be for Trump to launch a nuclear strike. Professor James Fernandez of NYU talks about the Abraham Lincoln Brigade, the 3,000 Americans who tried to stop fascism before it spread in Europe. We speak with the directors of a haunting new film about a terror attack in an Israeli bus station that leads to the brutal mob killing of an innocent Eritrean immigrant. And Donald Trump gets a visit from the two Bobs in his Office Space.</p>\n       &#10;&nbsp;<br /><hr><p style='color: grey; font - size: 0.75em; '>See <a style='color: grey; ' target='_blank' rel='noopener noreferrer' href='https://acast.com/privacy'>acast.com/privacy</a> for privacy and opt-out information.</p>",
            "length": "76100513",
            "sourceUrl": "https://sphinx.acast.com/intercepted-with-jeremy-scahill/forwhomthetrumptrolls/media.mp3"
        },
        {
            "title": "'Merican Psycho",
            "datePublished": "Wed, 20 Sep 2017 10:00:00 GMT",
            "description": "\n        <p>Jeremy analyzes Trump’s belligerent UN speech and the massive military budget the Democrats just gave him. Journalist Gary Rivlin takes us deep inside the world of the Goldman Sachs executives now working for Trump. Poet Aja Monet performs. The Intercept’s Alice Speri investigates the militarization of police and how Israel is training American cops. Plus, Donald Trump stars in American Psycho.</p>\n       &#10;&nbsp;<br /><hr><p style='color: grey; font - size: 0.75em; '>See <a style='color: grey; ' target='_blank' rel='noopener noreferrer' href='https://acast.com/privacy'>acast.com/privacy</a> for privacy and opt-out information.</p>",
            "length": "69953206",
            "sourceUrl": "https://sphinx.acast.com/intercepted-with-jeremy-scahill/mericanpsycho/media.mp3"
        },
        {
            "title": "The Super Bowl of Racism",
            "datePublished": "Wed, 13 Sep 2017 10:00:00 GMT",
            "description": "\n        <p>NSA whistleblower Edward Snowden discusses the massive Equifax data breach and allegations of Russian interference in the US election. Commentator Shaun King explains his call for a boycott of the NFL and talks about his campaign to bring violent neo-Nazis to justice. Rapper Open Mike Eagle performs.</p>\n       &#10;&nbsp;<br /><hr><p style='color: grey; font - size: 0.75em; '>See <a style='color: grey; ' target='_blank' rel='noopener noreferrer' href='https://acast.com/privacy'>acast.com/privacy</a> for privacy and opt-out information.</p>",
            "length": "66767520",
            "sourceUrl": "https://sphinx.acast.com/intercepted-with-jeremy-scahill/thesuperbowlofracism/media.mp3"
        },
        {
            "title": "Atlas Golfed — U.S.-Backed Think Tanks Target Latin America",
            "datePublished": "Wed, 09 Aug 2017 10:00:00 GMT",
            "description": "\n        <p>This week on Intercepted: Jeremy gives an update on the aftermath of Blackwater’s 2007 massacre of Iraqi civilians. Intercept reporter Lee Fang lays out how a network of libertarian think tanks called the Atlas Network is insidiously shaping political infrastructure in Latin America. We speak with attorney and former Hugo Chavez adviser Eva Golinger about the Venezuela's political turmoil.And we hear Claudia Lizardo of the Caracas-based band, La Pequeña Revancha, talk about her music and hopes for Venezuela.</p>\n       &#10;&nbsp;<br /><hr><p style='color: grey; font - size: 0.75em; '>See <a style='color: grey; ' target='_blank' rel='noopener noreferrer' href='https://acast.com/privacy'>acast.com/privacy</a> for privacy and opt-out information.</p>",
            "length": "67556891",
            "sourceUrl": "https://sphinx.acast.com/intercepted-with-jeremy-scahill/atlasgolfed-u.s.-backedthinktankstargetlatinamerica/media.mp3"
        },
        {
            "title": "Pyongyang and the White House Gang",
            "datePublished": "Wed, 02 Aug 2017 10:00:00 GMT",
            "description": "\n        <p>News from the White House this week has been like a twisted mash up of Here Comes Honey Boo Boo, Macbeth, Project Runway and a Mr. Bean movie. Dime-store Sopranos reject Anthony Scaramucci was fired after just 10 days as White House communications director. Reince Priebus is out as chief of staff, Gen. John Kelly is in. And with spiking tensions between the United States and North Korea, we reflect on the history of the region. Plus, The Intercept’s Naomi Klein talks to U.K. Labour Party leader Jeremy Corbyn about the lessons the Democratic Party could learn from Corbyn’s unexpected electoral success.</p>\n       &#10;&nbsp;<br /><hr><p style='color: grey; font - size: 0.75em; '>See <a style='color: grey; ' target='_blank' rel='noopener noreferrer' href='https://acast.com/privacy'>acast.com/privacy</a> for privacy and opt-out information.</p>",
            "length": "56310139",
            "sourceUrl": "https://sphinx.acast.com/intercepted-with-jeremy-scahill/pyongyangandthewhitehousegang/media.mp3"
        },
        {
            "title": "Glenn Greenwald on the New Cold War",
            "datePublished": "Wed, 26 Jul 2017 10:00:00 GMT",
            "description": "\n        <p>With all the constant hype about Russia, you’d think we were living in a new Cold War. This week on Intercepted: Glenn Greenwald fills in for Jeremy Scahill, and we take a deep dive into the origins and evolution of the Trump-Russia story. Fox News' Tucker Carlson and Glenn find something they can actually agree on (the Democratic establishment’s Russia hysteria), but diverge on Tucker’s coverage of immigration and crime. Russian-American writer Masha Gessen explains how conspiracy thinking is a mirror of the leaders we put in power.</p>\n       &#10;&nbsp;<br /><hr><p style='color: grey; font - size: 0.75em; '>See <a style='color: grey; ' target='_blank' rel='noopener noreferrer' href='https://acast.com/privacy'>acast.com/privacy</a> for privacy and opt-out information.</p>",
            "length": "53964234",
            "sourceUrl": "https://sphinx.acast.com/intercepted-with-jeremy-scahill/glenngreenwaldonthenewcoldwar/media.mp3"
        },
        {
            "title": "Veni, Vidi, Tweeti",
            "datePublished": "Wed, 19 Jul 2017 10:00:00 GMT",
            "description": "\n        <p>Donald Trump enjoyed playing fireman and asking where the fire is. Hint: all around you, Mr. President. This week on Intercepted: the famed rebel academic, Alfred McCoy, whose book on narcotrafficking the CIA tried to stop from being published, lays out his meticulously argued theory that the U.S. empire will fall by the year 2030. The Washington Post’s media columnist, Margaret Sullivan, talks about Trump ratcheting up the war on whistleblowers and the existence of a free press.</p>\n       &#10;&nbsp;<br /><hr><p style='color: grey; font - size: 0.75em; '>See <a style='color: grey; ' target='_blank' rel='noopener noreferrer' href='https://acast.com/privacy'>acast.com/privacy</a> for privacy and opt-out information.</p>",
            "length": "63245744",
            "sourceUrl": "https://sphinx.acast.com/intercepted-with-jeremy-scahill/veni-vidi-tweeti/media.mp3"
        },
        {
            "title": "Dumb, Dumber and Don Jr.",
            "datePublished": "Wed, 12 Jul 2017 10:00:00 GMT",
            "description": "\n        <p>This week on Intercepted: Don Jr. is in the shit throne over a secret meeting he had with a Russian lawyer. Could this be, as many in the media are claiming, the smoking gun of Russia collusion? Intercept co-founder Glenn Greenwald weighs in and debunks a forged NSA document sent to Rachel Maddow. Intercept reporters Alice Speri and Alleen Brown talk about the shadowy mercenary company TigerSwan. We also hear music from Victoria Ruiz of the punk band Downtown Boys.</p>\n       &#10;&nbsp;<br /><hr><p style='color: grey; font - size: 0.75em; '>See <a style='color: grey; ' target='_blank' rel='noopener noreferrer' href='https://acast.com/privacy'>acast.com/privacy</a> for privacy and opt-out information.</p>",
            "length": "61854088",
            "sourceUrl": "https://sphinx.acast.com/intercepted-with-jeremy-scahill/dumb-dumberanddonjr-/media.mp3"
        },
        {
            "title": "The House of Trump",
            "datePublished": "Wed, 28 Jun 2017 10:00:00 GMT",
            "description": "\n        <p>President Trump said when it comes to health insurance, he would cover everyone. He lied. Meanwhile the Crown Prince of America, Jared Kushner, and Mohammed Bin Salman, Crown Prince of Saudi Arabia, play house with foreign policy. This week: Al Jazeera’s Mehdi Hasan fills in for Jeremy Scahill. Intercept reporter Murtaza Hussain and journalist Rula Jebreal discuss the global consequences of the House of Trump’s meddling in the Middle East. Historian Tom Holland joins Mehdi for a debate on the role of Islam within the Islamic State. Plus, actor Bill Camp reprises his role as the “SIGINT Philosopher.”</p>\n       &#10;&nbsp;<br /><hr><p style='color: grey; font - size: 0.75em; '>See <a style='color: grey; ' target='_blank' rel='noopener noreferrer' href='https://acast.com/privacy'>acast.com/privacy</a> for privacy and opt-out information.</p>",
            "length": "54473041",
            "sourceUrl": "https://sphinx.acast.com/intercepted-with-jeremy-scahill/thehouseoftrump/media.mp3"
        },
        {
            "title": "Dispatch from the Dirtbag Left",
            "datePublished": "Wed, 21 Jun 2017 10:00:00 GMT",
            "description": "\n        <p>While all eyes in Washington remain focused on the Russia investigation, a Republican firm forgot to secure its invasive personal data on 198 million American voters. This week on Intercepted: We speak to radical librarian Alison Macrina of the Library Freedom Project about the fight against digital surveillance. Sam Biddle gives an update on attacks on U.S. voting systems. And, we speak with one of the rising stars of the “dirtbag left,” Felix Biederman of Chapo Trap House.</p>\n       &#10;&nbsp;<br /><hr><p style='color: grey; font - size: 0.75em; '>See <a style='color: grey; ' target='_blank' rel='noopener noreferrer' href='https://acast.com/privacy'>acast.com/privacy</a> for privacy and opt-out information.</p>",
            "length": "53564539",
            "sourceUrl": "https://sphinx.acast.com/intercepted-with-jeremy-scahill/dispatchfromthedirtbagleft/media.mp3"
        },
        {
            "title": "The Trump Mixtape — Dante’s Inferno meets Disco Inferno",
            "datePublished": "Wed, 14 Jun 2017 10:00:00 GMT",
            "description": "\n        <p>Donald Trump has a great affinity for strongmen and for unquestioned loyalty of those who work for him. This week on Intercepted: Trump’s besties in Saudi Arabia convinced him that Qatar is the premiere Arab nation sponsoring terrorism. Amnesty International’s Sherine Tadros and al Jazeera’s Mehdi Hasan analyze the hypocrisy-laden, bizarre crisis. Jeremy discusses the prosecution of an alleged NSA leaker. MSNBC’s Chris Hayes talks Russia, Trump, the media and his new book A Colony in a Nation. DJ Spooky imagines a Trump-inspired mash-up of Dante’s Inferno and Disco Inferno.</p>\n       &#10;&nbsp;<br /><hr><p style='color: grey; font - size: 0.75em; '>See <a style='color: grey; ' target='_blank' rel='noopener noreferrer' href='https://acast.com/privacy'>acast.com/privacy</a> for privacy and opt-out information.</p>",
            "length": "66459762",
            "sourceUrl": "https://sphinx.acast.com/intercepted-with-jeremy-scahill/thetrumpmixtape-dante-sinfernomeetsdiscoinferno/media.mp3"
        },
        {
            "title": "The Woman Democrats Love to Hate",
            "datePublished": "Wed, 07 Jun 2017 10:00:00 GMT",
            "description": "\n        <p>The Green Party’s Jill Stein has been widely attacked by Democrats simply for running for president. Some blame her for Hillary Clinton’s loss. This week, Stein strikes back at her critics and reveals the story behind the infamous Moscow dinner where she was seated with Vladimir Putin and Gen. Michael Flynn. The Intercept’s DC bureau chief Ryan Grim digs into the contents of a newly published top secret NSA document outlining alleged Russian cyberattacks against software companies that service U.S. elections. And singer-songwriter Damien Jurado performs.</p>\n       &#10;&nbsp;<br /><hr><p style='color: grey; font - size: 0.75em; '>See <a style='color: grey; ' target='_blank' rel='noopener noreferrer' href='https://acast.com/privacy'>acast.com/privacy</a> for privacy and opt-out information.</p>",
            "length": "56006413",
            "sourceUrl": "https://sphinx.acast.com/intercepted-with-jeremy-scahill/thewomandemocratslovetohate/media.mp3"
        },
        {
            "title": "There's Something About Jared",
            "datePublished": "Wed, 31 May 2017 10:00:00 GMT",
            "description": "\n        <p>This week, the scandal spotlight shines on Trump’s influential (and strangely quiet) son-in-law. We talk to national security correspondent Spencer Ackerman of The Daily Beast about Jared Kushner’s alleged meetings with Russian officials to establish back channel communications. Organizer and scholar Mariame Kaba offers a people’s history of prisons in the US and the politicians—both Democrats and Republicans—who have made them what they are today. And we hear an incredible rendition of “The Partisan” from composers and musicians Leo Heiblum of Mexico and Tenzin Choegyal of Tibet. </p>\n       &#10;&nbsp;<br /><hr><p style='color: grey; font - size: 0.75em; '>See <a style='color: grey; ' target='_blank' rel='noopener noreferrer' href='https://acast.com/privacy'>acast.com/privacy</a> for privacy and opt-out information.</p>",
            "length": "57115879",
            "sourceUrl": "https://sphinx.acast.com/intercepted-with-jeremy-scahill/theressomethingaboutjared/media.mp3"
        },
        {
            "title": "Donald Trump and his League of Extraordinary Despots",
            "datePublished": "Wed, 24 May 2017 10:00:00 GMT",
            "description": "\n        <p>This week, Donald Trump stood in a sea of tyrants and joined in a bizarre group petting of a glowing white orb. Professor As’ad AbuKhalil dissects Trump’s summit in Saudi Arabia and the role Trump’s friends in the Middle East play in fueling such horrors as the attack on Manchester. The Intercept’s new DC bureau chief, Ryan Grim, and national security reporter Matthew Cole discuss Gen. Michael Flynn and whether anyone in the Trump administration realizes how insane their boss is. And Steve Earle performs live.</p>\n       &#10;&nbsp;<br /><hr><p style='color: grey; font - size: 0.75em; '>See <a style='color: grey; ' target='_blank' rel='noopener noreferrer' href='https://acast.com/privacy'>acast.com/privacy</a> for privacy and opt-out information.</p>",
            "length": "64077211",
            "sourceUrl": "https://sphinx.acast.com/intercepted-with-jeremy-scahill/donaldtrumpandhisleagueofextraordinarydespots/media.mp3"
        },
        {
            "title": "Donald and the Terrible, Horrible, No Good, Very Bad Presidency",
            "datePublished": "Wed, 17 May 2017 10:00:00 GMT",
            "description": "\n        <p>Donald Trump is spectacularly bad at being president. This week on Intercepted, investigative journalist Marcy Wheeler and The Intercept’s Glenn Greenwald analyze the latest insanity emanating from the White House. Pulitzer Prize-winning journalist Tim Weiner and Intercept writer Trevor Aaronson discuss the firing of James Comey and debate his FBI legacy. And Palestinian author and journalist Rula Jebreal explains why President Trump is going to Saudi Arabia and Israel on his first international trip.</p>\n       &#10;&nbsp;<br /><hr><p style='color: grey; font - size: 0.75em; '>See <a style='color: grey; ' target='_blank' rel='noopener noreferrer' href='https://acast.com/privacy'>acast.com/privacy</a> for privacy and opt-out information.</p>",
            "length": "58695458",
            "sourceUrl": "https://sphinx.acast.com/intercepted-with-jeremy-scahill/donaldandtheterrible-horrible-nogood-verybadpresidency/media.mp3"
        },
        {
            "title": "James Comey, Chelsea Manning and the secrets America keeps",
            "datePublished": "Wed, 10 May 2017 10:00:00 GMT",
            "description": "\n        <p>Donald Trump’s complicated relationship with FBI Director James Comey came to a shocking conclusion in Tuesday night’s episode of American shitshow. Glenn Greenwald analyzes Comey’s firing. Next week, Chelsea Manning will be freed from prison. We hear exclusive audio from her trial and talk to journalist Alexa O’Brien. And French civil liberties activist Yasser Louati says despite her defeat in the presidential election, many of Marine Le Pen’s ideas are already embedded in mainstream French politics. And a premiere track from hip-hop artists MC Sole and DJ Pain 1.</p>\n       &#10;&nbsp;<br /><hr><p style='color: grey; font - size: 0.75em; '>See <a style='color: grey; ' target='_blank' rel='noopener noreferrer' href='https://acast.com/privacy'>acast.com/privacy</a> for privacy and opt-out information.</p>",
            "length": "64074901",
            "sourceUrl": "https://sphinx.acast.com/intercepted-with-jeremy-scahill/jamescomey-chelseamanningandthesecretsamericakeeps/media.mp3"
        },
        {
            "title": "BONUS: Jeremy talks Milo on Politically Re-Active",
            "datePublished": "Wed, 03 May 2017 10:00:00 GMT",
            "description": "\n        <p>We're still a week away from the beginning of season two, but here's a taster of Jeremy's interview on our sister podcast, Politically Re-Active. Jeremy clears the air on his cancelled appearance on \"Real Time with Bill Maher\" with hosts W. Kamau Bell and Hari Kondabolu, and much more. To hear the full interview, subscribe to Politically Re-Active or head to politicallyreactive.com.</p>\n       &#10;&nbsp;<br /><hr><p style='color: grey; font - size: 0.75em; '>See <a style='color: grey; ' target='_blank' rel='noopener noreferrer' href='https://acast.com/privacy'>acast.com/privacy</a> for privacy and opt-out information.</p>",
            "length": "11101212",
            "sourceUrl": "https://sphinx.acast.com/intercepted-with-jeremy-scahill/bonus-jeremytalksmiloonpoliticallyre-active/media.mp3"
        },
        {
            "title": "Wikileaks vs the CIA",
            "datePublished": "Wed, 19 Apr 2017 10:00:00 GMT",
            "description": "\n        <p>Wikileaks founder Julian Assange hits back at Trump’s CIA director Mike Pompeo after Pompeo accused Wikileaks of being a “hostile non-state intelligence agency.” In a wide-ranging interview, Assange discusses the allegations Wikileaks was abetted by Russian intelligence in its publication of DNC emails, and the new-found admiration for him by FOX News and Donald Trump. Also, why Assange believes he and Hillary Clinton may get along if they ever met in person. And we premiere an unreleased song by Tom Morello of Rage Against the Machine.</p>\n       &#10;&nbsp;<br /><hr><p style='color: grey; font - size: 0.75em; '>See <a style='color: grey; ' target='_blank' rel='noopener noreferrer' href='https://acast.com/privacy'>acast.com/privacy</a> for privacy and opt-out information.</p>",
            "length": "59327489",
            "sourceUrl": "https://sphinx.acast.com/intercepted-with-jeremy-scahill/wikileaksvsthecia/media.mp3"
        },
        {
            "title": "The Emperor’s New Cruise Missiles",
            "datePublished": "Wed, 12 Apr 2017 10:00:00 GMT",
            "description": "\n        <p>Nothing brings warmongers, hawks and elites from both parties closer than a cruise missile strike. This week’s Intercepted will piss off Assad supporters and the Democrats and Republicans fawning over Trump’s newest war. Former Congressman Dennis Kucinich questions the official story on the chemical weapons attack. Murtaza Hussain on what Assad gains by using chemical weapons. And, Maher Arar is a Syrian-born Canadian engineer who was kidnapped at JFK airport by US operatives after 9/11 and rendered to Syria and tortured by Assad’s agents. Arar says he opposes Assad and US intervention. All that and a bucket of media stupidity to celebrate beautiful missiles.</p>\n       &#10;&nbsp;<br /><hr><p style='color: grey; font - size: 0.75em; '>See <a style='color: grey; ' target='_blank' rel='noopener noreferrer' href='https://acast.com/privacy'>acast.com/privacy</a> for privacy and opt-out information.</p>",
            "length": "57148018",
            "sourceUrl": "https://sphinx.acast.com/intercepted-with-jeremy-scahill/theemperor-snewcruisemissiles/media.mp3"
        },
        {
            "title": "Trump's Secret Prince",
            "datePublished": "Wed, 05 Apr 2017 10:00:00 GMT",
            "description": "\n        <p>Erik Prince—the most infamous mercenary in modern U.S. history—is Trump’s secret emissary. This week, an exclusive interview with Rep. Jan Schakowsky, who has fought a decades-long battle against Prince. Tavis Smiley talks about the “Santa Claus-ification” of Dr. Martin Luther King Jr. on the 50th anniversary of King’s militant speech against the Vietnam War. Rep. Barbara Lee reflects on her own historic anti-war speech, delivered three days after 9/11. And Vice President Pence, who can’t be alone in a room with a woman who is not his wife, goes Psycho.</p><p><em>Please take a moment to fill out Panoply's survey about the shows you listen to, love, and what else you'd like to hear: </em><a href=\"http://survey.panoply.fm\"><em>survey.panoply.fm</em></a><em>.  Many thanks!</em></p>\n       &#10;&nbsp;<br /><hr><p style='color: grey; font - size: 0.75em; '>See <a style='color: grey; ' target='_blank' rel='noopener noreferrer' href='https://acast.com/privacy'>acast.com/privacy</a> for privacy and opt-out information.</p>",
            "length": "54887768",
            "sourceUrl": "https://sphinx.acast.com/intercepted-with-jeremy-scahill/trumpssecretprince/media.mp3"
        },
        {
            "title": "Trump Declares War on the Planet",
            "datePublished": "Wed, 29 Mar 2017 10:00:00 GMT",
            "description": "\n        <p>Donald Trump officially rejects climate change and unofficially declares war on planet Earth. Naomi Klein takes us on a terrifying journey into Trump’s real life version of The Purge. Boots Riley of The Coup discusses Trump and hip hop and performs. Murtaza Hussain talks about the US bombings in Iraq and Syria that have killed 1,000 civilians in one month. And, we talk to the developer of an app that tracks US drone strikes that Apple has censored 13 times.</p>\n       &#10;&nbsp;<br /><hr><p style='color: grey; font - size: 0.75em; '>See <a style='color: grey; ' target='_blank' rel='noopener noreferrer' href='https://acast.com/privacy'>acast.com/privacy</a> for privacy and opt-out information.</p>",
            "length": "53108660",
            "sourceUrl": "https://sphinx.acast.com/intercepted-with-jeremy-scahill/trumpdeclareswarontheplanet/media.mp3"
        },
        {
            "title": "Could Trump Start World War III?",
            "datePublished": "Wed, 22 Mar 2017 10:00:00 GMT",
            "description": "\n        <p>Donald Trump has not started any new wars… yet. But his administration is pouring gasoline on several initiated by his predecessors. This week on Intercepted: US forces are deploying in Syria, as drone strikes expand in Yemen. And Russia and Iran loom over everything. We talk to veteran war correspondents Anand Gopal and Iona Craig. Glenn Greenwald analyzes James Comey’s testimony on Capitol Hill and exposes a major lie spread about Edward Snowden. Actor William Camp “stars” in the real life story of the spy who became “the Socrates of the NSA.”</p>\n       &#10;&nbsp;<br /><hr><p style='color: grey; font - size: 0.75em; '>See <a style='color: grey; ' target='_blank' rel='noopener noreferrer' href='https://acast.com/privacy'>acast.com/privacy</a> for privacy and opt-out information.</p>",
            "length": "55840701",
            "sourceUrl": "https://sphinx.acast.com/intercepted-with-jeremy-scahill/couldtrumpstartworldwariii-/media.mp3"
        },
        {
            "title": "Snowden vs. Trump",
            "datePublished": "Wed, 15 Mar 2017 10:00:00 GMT",
            "description": "\n        <p>This week, Intercepted is live from the SXSW Festival in Austin. Edward Snowden joins us via video feed from Moscow. He discusses Trump’s allegations of Obama’s wiretapping, analyzes some of the CIA’s hacking capabilities, and blasts critics who accuse him of being a Russian agent. And we talk to Libyan-American hip hop artist Kayem, who was forced to keep a low profile the past several years after multiple detentions and visits from the FBI. He shares some verses with Intercepted.</p>\n       &#10;&nbsp;<br /><hr><p style='color: grey; font - size: 0.75em; '>See <a style='color: grey; ' target='_blank' rel='noopener noreferrer' href='https://acast.com/privacy'>acast.com/privacy</a> for privacy and opt-out information.</p>",
            "length": "50219778",
            "sourceUrl": "https://sphinx.acast.com/intercepted-with-jeremy-scahill/snowdenvs.trump/media.mp3"
        },
        {
            "title": "Ready to Lie",
            "datePublished": "Wed, 08 Mar 2017 11:00:00 GMT",
            "description": "\n        <p>The Notorious B.I.G. famously alleged that federal agents were mad because he was flagrant. Trump also believes he has beef with the Feds, accusing Obama of tapping his phones. The Intercept’s Matthew Cole and journalist Marcy Wheeler dissect the accusations and the (curious) denials. Sam Biddle and Josh Begley explain what the CIA hacking docs published by Wikileaks say about our “smart” TVs and phones. Journalist Aura Bogado confronts Trump’s assault on undocumented immigrants. Punk band Anti-Flag performs. Plus, Trump “stars” in a scene from Goodfellas. Can he get out of Mar-a-Lago alive?</p>\n       &#10;&nbsp;<br /><hr><p style='color: grey; font - size: 0.75em; '>See <a style='color: grey; ' target='_blank' rel='noopener noreferrer' href='https://acast.com/privacy'>acast.com/privacy</a> for privacy and opt-out information.</p>",
            "length": "63827413",
            "sourceUrl": "https://sphinx.acast.com/intercepted-with-jeremy-scahill/readytolie/media.mp3"
        },
        {
            "title": "Donald in Wonderland",
            "datePublished": "Wed, 01 Mar 2017 11:00:00 GMT",
            "description": "\n        <p>Ex-CIA analyst Nada Bakos and former FBI agent Clint Watts explain how Trump’s administration could use “alternative intelligence” to justify dangerous military actions. Shane Bauer of Mother Jones breaks down the connections between immigration raids and soaring private prison profits. Plus the world premiere of a song by the Iraqi-Canadian hip hop artist Narcy. We bet you never thought you’d hear Steve Bannon’s name rapped in autotune.</p>\n       &#10;&nbsp;<br /><hr><p style='color: grey; font - size: 0.75em; '>See <a style='color: grey; ' target='_blank' rel='noopener noreferrer' href='https://acast.com/privacy'>acast.com/privacy</a> for privacy and opt-out information.</p>",
            "length": "64054441",
            "sourceUrl": "https://sphinx.acast.com/intercepted-with-jeremy-scahill/donaldinwonderland/media.mp3"
        },
        {
            "title": "The Undisciplined Authoritarian",
            "datePublished": "Wed, 22 Feb 2017 11:00:00 GMT",
            "description": "\n        <p>New York Times investigative reporter James Risen breaks down Trump’s declaration that journalists are the enemy and analyzes Trump’s royal court. ACLU lawyer Chase Strangio and former New England Patriots star Donté Stallworth talk about the war on the transgender community and the rising resistance of pro athletes. Sam Biddle exposes the Trump-connected firm that helped the NSA spy on the world and actor Wallace Shawn stars as an NSA operative who is worried about adversaries spying on his luncheons. Plus music from Anohni.</p>\n       &#10;&nbsp;<br /><hr><p style='color: grey; font - size: 0.75em; '>See <a style='color: grey; ' target='_blank' rel='noopener noreferrer' href='https://acast.com/privacy'>acast.com/privacy</a> for privacy and opt-out information.</p>",
            "length": "64258669",
            "sourceUrl": "https://sphinx.acast.com/intercepted-with-jeremy-scahill/theundisciplinedauthoritarian/media.mp3"
        },
        {
            "title": "We Are All in Trump’s Hunger Games Now",
            "datePublished": "Wed, 15 Feb 2017 11:00:00 GMT",
            "description": "\n        <p>The first contestant in Donald Trump’s reality administration has left the West Wing. This week, Glenn Greenwald offers some provocative pushback on the Russia fear-mongering surrounding Gen. Michael Flynn’s resignation (or firing). Naomi Klein walks the dark aisles of the Trump family department store. Former Congresswoman Liz Holtzman, a key figure in the impeachment of Richard Nixon, explains how impeachment actually works. And Hina Shamsi of the ACLU recounts her interrogation at the border. Plus a performance from Jedi Mind Tricks. </p>\n       &#10;&nbsp;<br /><hr><p style='color: grey; font - size: 0.75em; '>See <a style='color: grey; ' target='_blank' rel='noopener noreferrer' href='https://acast.com/privacy'>acast.com/privacy</a> for privacy and opt-out information.</p>",
            "length": "58637120",
            "sourceUrl": "https://sphinx.acast.com/intercepted-with-jeremy-scahill/weareallintrump-shungergamesnow/media.mp3"
        },
        {
            "title": "Trump's Cabinet of Killers and Why Orange is the New Anti-Black",
            "datePublished": "Wed, 08 Feb 2017 11:00:00 GMT",
            "description": "\n        <p>This week, investigative reporter Allan Nairn breaks down Trump's relationship with the CIA and the killer assembly of neocons and right-wing conspiracists running the U.S. war machine. Princeton professor Keeanga Yamahtta-Taylor dismantles Obama's problematic legacy and offers strategic advice for resisting Trump. The Intercept's own distinguished alt-historian, Jon Schwarz, offers a lesson on the origins of presidential executive orders. And Kimya Dawson gives a raw performance of a new song about racism and the police state.</p>\n       &#10;&nbsp;<br /><hr><p style='color: grey; font - size: 0.75em; '>See <a style='color: grey; ' target='_blank' rel='noopener noreferrer' href='https://acast.com/privacy'>acast.com/privacy</a> for privacy and opt-out information.</p>",
            "length": "56949115",
            "sourceUrl": "https://sphinx.acast.com/intercepted-with-jeremy-scahill/trumpscabinetofkillersandwhyorangeisthenewanti-black/media.mp3"
        },
        {
            "title": "Trump Week Two: The Rise of Chief Yookeroo",
            "datePublished": "Wed, 01 Feb 2017 11:00:00 GMT",
            "description": "\n        <p>Donald Trump is signing executive orders like autographed pictures. This week on Intercepted: Two former senior FBI agents blast the “Muslim ban” and Trump’s campaign to make torture great again. Constitutional rights lawyers dissect the (il)legalities of Trump’s orders. Rep. Barbara Lee confronts the president's terrifying approach to government.  New secret documents reveal how Trump could resurrect J. Edgar Hoover’s legacy. Brother Ali freestyles a verse, and Peter Sarsgaard stars in the bizarre true story of an NSA operative with vacation tips for deploying to Guantanamo. </p>\n       &#10;&nbsp;<br /><hr><p style='color: grey; font - size: 0.75em; '>See <a style='color: grey; ' target='_blank' rel='noopener noreferrer' href='https://acast.com/privacy'>acast.com/privacy</a> for privacy and opt-out information.</p>",
            "length": "50640401",
            "sourceUrl": "https://sphinx.acast.com/intercepted-with-jeremy-scahill/trumpweektwo-theriseofchiefyookeroo/media.mp3"
        },
        {
            "title": "The Clock Strikes Thirteen, Donald Trump is President",
            "datePublished": "Wed, 25 Jan 2017 11:00:00 GMT",
            "description": "\n        <p>The clock struck thirteen on January 20, Donald Trump is the president of the United States and episode one of Intercepted is here. Intercept co-founder Glenn Greenwald and editor-in-chief Betsy Reed join Jeremy Scahill for a discussion on the crazy apocalyptic present. They break down Trump’s attacks on the media, that insane speech he gave at the CIA and the state of the Democratic party. Naomi Klein sends in a dispatch from the Women’s March on Washington. Jeremy goes deep into the secretive world of Seymour Hersh’s kitchen, and shoots the shit with the legendary Pulitzer Prize-winning journalist about why he calls Trump a “circuit breaker.\" And we hear a spoken word performance from hip-hop artist Immortal Technique. </p>\n       &#10;&nbsp;<br /><hr><p style='color: grey; font - size: 0.75em; '>See <a style='color: grey; ' target='_blank' rel='noopener noreferrer' href='https://acast.com/privacy'>acast.com/privacy</a> for privacy and opt-out information.</p>",
            "length": "51851603",
            "sourceUrl": "https://sphinx.acast.com/intercepted-with-jeremy-scahill/theclockstrikesthirteen-donaldtrumpispresident/media.mp3"
        },
        {
            "title": "Introducing Intercepted with Jeremy Scahill",
            "datePublished": "Fri, 13 Jan 2017 18:38:00 GMT",
            "description": "\n        <p>Hear a preview of Intercepted, a new podcast coming January 25 from the people behind the fearless, adversarial journalism of The Intercept. Every week, host Jeremy Scahill will discuss the crucial issues of our time with fellow reporters, and outspoken writers, artists and thinkers.</p>\n       &#10;&nbsp;<br /><hr><p style='color: grey; font - size: 0.75em; '>See <a style='color: grey; ' target='_blank' rel='noopener noreferrer' href='https://acast.com/privacy'>acast.com/privacy</a> for privacy and opt-out information.</p>",
            "length": "3230595",
            "sourceUrl": "https://sphinx.acast.com/intercepted-with-jeremy-scahill/introducinginterceptedwithjeremyscahill/media.mp3"
        }
    ]
}