{
    "artwork": "http://is5.mzstatic.com/image/thumb/Music122/v4/21/4e/cf/214ecf37-3c0a-1529-ddb2-61694893f5e9/source/100x100bb.jpg",
    "description": "Invisible Office Hours is a weekly podcast for people that aren't confined to a literal office or that aren't confined by conventional thinking.\n\nHosted by Jason Zook and Paul Jarvis the show covers a wide range of topics that all touch on aligning your thinking with your journey, and dealing with the bumps along the way. Topics include criticism, selling out, positivity and the show airs every Tuesday for the first season!",
    "feedURL": "http://feeds.soundcloud.com/users/soundcloud:users:99254565/sounds.rss",
    "podcastURL": "https://pjrvs.com",
    "title": "Invisible Office Hours",
    "episodes": [
        {
            "title": "S8.01 - We may be working on too many things",
            "datePublished": "Wed, 04 Jul 2018 00:00:00 +0000",
            "description": "It seems we’ve switched roles! Paul Jarvis, normally the focused one who takes on less, has started working on a few new (awesome) software projects. Jason Zook, on the other hand, is trying to pair all his projects down into one singular offering. Tune in to this episode for our business update!",
            "length": "72416861",
            "sourceUrl": "http://www.podtrac.com/pts/redirect.mp3/feeds.soundcloud.com/stream/465256029-invisibleofficehours-s8-01-we-may-be-working-on-too.mp3"
        },
        {
            "title": "S8.04 - Who do we admire?",
            "datePublished": "Sat, 30 Jun 2018 16:41:47 +0000",
            "description": "Jason and Paul have never really had mentors or hugely influential figures in their lives. In fact, they both tend to run the opposite way when people of authority try to offer advice. But they have to admire other creators and biz owners, right? Find out if Paul and Jason are completely egotistical jerks, or if they have some stories to share.",
            "length": "50692178",
            "sourceUrl": "http://www.podtrac.com/pts/redirect.mp3/feeds.soundcloud.com/stream/465265869-invisibleofficehours-s804-who-do-we-admire.mp3"
        }
    ]
}