{
    "artwork": "http://is3.mzstatic.com/image/thumb/Music6/v4/4b/a8/b8/4ba8b8e6-91cd-73a3-83d8-a61a3457c971/source/100x100bb.jpg",
    "description": "Insurance Journal TV - Property and causualty insurance news and features.",
    "feedURL": "http://www.insurancejournal.tv/channels/itunes/feed/",
    "podcastURL": "http://www.insurancejournal.tv",
    "publisher": "bpedroso",
    "title": "iTunes – Insurance Journal TV",
    "episodes": [
        {
            "title": "EP. 14: What an Election Green Wave in Five States Means for the Industry, Insurers",
            "datePublished": "Thu, 12 Nov 2020 09:50:35 +0000",
            "description": "<p>Elections Part II</p>\n<p>Nov. 3 came and went, and while there’s some still contentious feelings around who won the Presidential race and neither a blue nor red wave ebbed, voters did enthusiastically greenlight cannabis. Arizona, Mississippi, Montana, New Jersey and South Dakota are now states where cannabis is either legal for medicinal or adult use. We asked a pair of experts what this means for cannabis and for insurance professionals.   </p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.insurancejournal.tv/videos/18781/\">EP. 14: What an Election Green Wave in Five States Means for the Industry, Insurers</a> appeared first on <a rel=\"nofollow\" href=\"https://www.insurancejournal.tv\">Insurance Journal TV</a>.</p>\n",
            "length": "7193006",
            "sourceUrl": "http://cdn.insurancejournal.tv/mp3/20201113_cannabis_podcast_14.mp3",
            "categories": [
                "Editors' Featured",
                "Home Page",
                "Insuring Cannabis Podcast",
                "iPhone",
                "iTunes",
                "Podcasts",
                "Cannabis",
                "Don Jergler",
                "Election",
                "insurance",
                "morgan fox"
            ]
        },
        {
            "title": "Covid Ups the Ante for Artificial Intelligence",
            "datePublished": "Mon, 09 Nov 2020 10:00:50 +0000",
            "description": "<p>Meet Henriette Fleischmann, a rising insurtech star. She’s COO of Hosta Labs, which uses artificial intelligence to automate the detection of conditions, risks, materials and replacement values to make residential property underwriting faster, safer and more reliable. AI works best, she says, with repetitive tasks following a pattern. Insurance professionals still will cover more sophisticated property assessments – the “outliers.” Listen as Henriette outlines a start-up navigating growth in a pandemic. “I have a heavily loaded scheduled with Zoom Mania, as I call it. It’s back-to-back meetings for everyone.” On the one side she can attend more virtual events without travel time; the downside is the lack of human connection and one-and-one relationships. On balance, Covid has helped the AI market “quite a bit,” Henriette observes. “Carriers are literally forced into touchless and digitized solutions. You can’t just sit it out. It&#8217;s not clear when it’s going to end.”</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.insurancejournal.tv/videos/18742/\">Covid Ups the Ante for Artificial Intelligence</a> appeared first on <a rel=\"nofollow\" href=\"https://www.insurancejournal.tv\">Insurance Journal TV</a>.</p>\n",
            "length": "",
            "sourceUrl": "http://cdn.insurancejournal.tv/mp3/20201109_on_point.mp3",
            "categories": [
                "iPhone",
                "iTunes",
                "On Point",
                "henriette fleischmann",
                "on point",
                "peter van aartrijk"
            ]
        },
        {
            "title": "IJ Academy Aftershow: Renting a Car? Don’t Think Twice About That Loss Damage Waiver",
            "datePublished": "Fri, 30 Oct 2020 01:25:08 +0000",
            "description": "<p>In this weeks IJ Academy Aftershow, Patrick and George welcomes David Thompson, instructor for this weeks class, <a href=\"https://www.ijacademy.com/rental-cars-more-than-meets-the-eye\">Rental Cars &#8211; More Than Meets the Eye.</a>. Thompson talk with the IJA team about the challenges of remote teaching, why that loss damage waiver is worth the thirty bucks, and why his BBQ skills might make a future episode!  </p>\n<p>Not yet a member of the academy? <a href=\"https://www.ijacademy.com/members/memberships\">Join Today!</a></p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.insurancejournal.tv/videos/18762/\">IJ Academy Aftershow: Renting a Car? Don&#8217;t Think Twice About That Loss Damage Waiver</a> appeared first on <a rel=\"nofollow\" href=\"https://www.insurancejournal.tv\">Insurance Journal TV</a>.</p>\n",
            "length": "120227146",
            "sourceUrl": "http://cdn.insurancejournal.tv/itunes/20201029_ija_aftershow.mp4",
            "categories": [
                "Academy of Insurance",
                "iPhone",
                "iTunes",
                "David Thompson",
                "george jack",
                "IJA",
                "insurance",
                "Insurance Journal Academy",
                "patrick wraight",
                "Rental Cars"
            ]
        },
        {
            "title": "EP. 13: How Election Results Could Greenlight Federal Cannabis Legalization",
            "datePublished": "Thu, 29 Oct 2020 10:00:38 +0000",
            "description": "<p>Nov. 3 is the big day, and while the big story for voters is the choice between diametrically opposed presidential candidates, the scent of cannabis legalization has quietly wafted over ballots across the nation. Voters in five states will get to decide whether to legalize, and with a dozen contentious seats up for grabs in the U.S. Senate, what will the results do for efforts to decriminalize the plant and create safe banking and insurance for the budding industry? We asked a man in the middle of it all for a rundown and what the elections mean for cannabis.   </p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.insurancejournal.tv/videos/18757/\">EP. 13: How Election Results Could Greenlight Federal Cannabis Legalization</a> appeared first on <a rel=\"nofollow\" href=\"https://www.insurancejournal.tv\">Insurance Journal TV</a>.</p>\n",
            "length": "7909639",
            "sourceUrl": "http://cdn.insurancejournal.tv/mp3/20201027_cannabis_podcast_13.mp3",
            "categories": [
                "Insuring Cannabis Podcast",
                "iPhone",
                "iTunes",
                "Podcasts"
            ]
        },
        {
            "title": "EP. 1: Insurance’s Digital Transformation in the COVID-19 Era",
            "datePublished": "Wed, 28 Oct 2020 10:00:34 +0000",
            "description": "<p>“Insurance is a technology industry now.”<br />\n <br />\nThat’s according to Todd Lukens, chief information security officer at Nationwide.<br />\n <br />\n“You think about the entire workflow of how insurance works, everything from creating a quote to binding to utilizing artificial intelligence and machine learning and our claims processes and our fraud processes, it&#8217;s a technology industry,” he adds.<br />\n <br />\nIn the first episode of Insurance Journal’s bi-monthly Insuring Cyber Podcast, Lukens speaks with host Elizabeth Blosfield about what Nationwide is learning from its transition to a hybrid operating model with 98% of its workforce being remote &#8211; a move the company announced in April as the coronavirus pandemic was ramping up. <br />\n <br />\nAlso in this episode, Pete Arterburn, digital transformation lead at Aon Affinity, discusses how the insurance industry is being pushed to embrace tech with COVID-19 at its heels. He explains what this means for a relationship-driven industry in terms of connecting with its customer base and attracting top talent.<br />\n <br />\n“I think ultimately we&#8217;re going to start to see tectonic shift,” he says. “You&#8217;re going to start to see a number of agencies maximize that technology capability to really move to that virtual environment…I really do think that will continue to be the new norm.”<br />\n <br />\nThanks for listening. Check back twice a month for new episodes of the Insuring Cyber Podcast every other Wednesday.</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.insurancejournal.tv/videos/18740/\">EP. 1: Insurance’s Digital Transformation in the COVID-19 Era</a> appeared first on <a rel=\"nofollow\" href=\"https://www.insurancejournal.tv\">Insurance Journal TV</a>.</p>\n",
            "length": "10851701",
            "sourceUrl": "http://cdn.insurancejournal.tv/mp3/20201028_cyber_podcast_01.mp3",
            "categories": [
                "Editors' Featured",
                "Home Page",
                "Insuring Cyber Podcast",
                "iPhone",
                "iTunes",
                "Podcasts",
                "Aon Affinity",
                "Coronavirus",
                "covid19",
                "cyber",
                "elizabeth blosfield",
                "insurance",
                "Nationwide",
                "peter arterburn",
                "Todd Lukens"
            ]
        },
        {
            "title": "Personal Vs. Corporate Brand: One and the Same?",
            "datePublished": "Mon, 26 Oct 2020 10:00:29 +0000",
            "description": "<p>What does a firm do when its people (e.g. salespeople) have a giant personality out in the marketplace? When they can appear even larger than the corporate brand itself? Interesting question, and we found the right pro to address it. On this recording, management and design consultant Fiona Gray shares helpful ideas about personal vs. corporate brands. Perhaps instead of reigning in people, “maybe we look at the mother ship company and address its own brand for any deficiencies,” she says. “Often there is something missing in the marketplaces about the brand.” Listen as Fiona addresses when and how companies should consider a brand refresh, using core values in particular as a way to guide behavior of producers or field folks. “This is a great time to find out what you stand for,” Fiona says. “Don’t take your employees or customers for granted. You want to continue to be moving forward and being relevant.” Bonus: You’ll love Fiona’s accent – the King’s English!</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.insurancejournal.tv/videos/18655/\">Personal Vs. Corporate Brand: One and the Same?</a> appeared first on <a rel=\"nofollow\" href=\"https://www.insurancejournal.tv\">Insurance Journal TV</a>.</p>\n",
            "length": "",
            "sourceUrl": "http://cdn.insurancejournal.tv/mp3/20201026_on_point.mp3",
            "categories": [
                "iPhone",
                "iTunes",
                "On Point",
                "fiona berry gray",
                "on point",
                "peter van aartrijk"
            ]
        },
        {
            "title": "EP. 12: Budtender Liability Soon to be a Thing?",
            "datePublished": "Thu, 15 Oct 2020 20:12:11 +0000",
            "description": "<p>A budtender can tell you the difference between Laughing Buddha and Acapulco Gold, or which vape pen may last the longest. But some of these experts at your friendly neighborhood dispensary are sometimes asked, and offer, advice beyond such innocuous subjects, creating a potential for issues down the road. We have yet to see a proliferation of budtender liability lawsuits, but they’re probably coming, according to experts we spoke with.</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.insurancejournal.tv/videos/18731/\">EP. 12: Budtender Liability Soon to be a Thing?</a> appeared first on <a rel=\"nofollow\" href=\"https://www.insurancejournal.tv\">Insurance Journal TV</a>.</p>\n",
            "length": "9326411",
            "sourceUrl": "http://cdn.insurancejournal.tv/mp3/20201016_cannabis_podcast_12.mp3",
            "categories": [
                "Insuring Cannabis Podcast",
                "iPhone",
                "iTunes",
                "Podcasts"
            ]
        },
        {
            "title": "Publisher Reflects on 50 Years of Insurance Fun",
            "datePublished": "Mon, 12 Oct 2020 10:00:51 +0000",
            "description": "<p>Normally we aim to peek into the future with our guests. On this recording, we check out the past. Mark Wells is an industry icon who’s been at the helm of Insurance Journal for the last 50 years. That’s right, during what is an otherwise dreadful year (hello, pandemic), Mark is popping some champagne – or perhaps some fine pinot noir, as we’ll hear – to celebrate a half-century of challenges, tears, fears and mostly cheers. When Mark assumed leadership of Insurance Journal from his dad in 1970, the insurance industry and California had a different relationship. Boy have things changed! And if you think insurance is a competitive environment, you should try insurance publishing. Mark and his super heroes made it happen. Experimentation is in their DNA.</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.insurancejournal.tv/videos/18671/\">Publisher Reflects on 50 Years of Insurance Fun</a> appeared first on <a rel=\"nofollow\" href=\"https://www.insurancejournal.tv\">Insurance Journal TV</a>.</p>\n",
            "length": "",
            "sourceUrl": "http://cdn.insurancejournal.tv/mp3/20201012_on_point.mp3",
            "categories": [
                "iPhone",
                "iTunes",
                "On Point",
                "Mark Wells",
                "media",
                "on point",
                "peter van aartrijk",
                "publishing",
                "Wells Media Group"
            ]
        },
        {
            "title": "SPONSORED: How to Make a Marketing Plan for Your Agency",
            "datePublished": "Fri, 02 Oct 2020 21:40:07 +0000",
            "description": "<p>A marketing plan is more than just tactics and a budget. It’s a guide to your agency’s marketing strategy. It will help you identify and reach your audience. ITC&#8217;s Chief Marketing Officer Becky Schroeder explains how to create a marketing plan for your insurance agency.</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.insurancejournal.tv/videos/18706/\">SPONSORED: How to Make a Marketing Plan for Your Agency</a> appeared first on <a rel=\"nofollow\" href=\"https://www.insurancejournal.tv\">Insurance Journal TV</a>.</p>\n",
            "length": "68830256",
            "sourceUrl": "http://cdn.insurancejournal.tv/itunes/20201001_uc_itc.mp4",
            "categories": [
                "iPhone",
                "iTunes",
                "User Contributed",
                "becky Schroeder",
                "insurance",
                "ITC",
                "marketing"
            ]
        },
        {
            "title": "EP. 11: Where Are All the Cannabis Lawsuits?",
            "datePublished": "Thu, 01 Oct 2020 21:00:43 +0000",
            "description": "<p>Remember the infamous McDonald’s hot coffee lawsuit from the 1990s? If blazing java on a crotch had the makings for a juicy lawsuit, you’d think that plaintiff’s attorneys would be packing the courts with filings over a product like cannabis. But so far there haven’t been that many lawsuits in the space. What’s going on? We found a few legal experts and an underwriter to answer that question. Lawsuit watchers take heart, there are a few good suits worth watching.  </p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.insurancejournal.tv/videos/18700/\">EP. 11: Where Are All the Cannabis Lawsuits?</a> appeared first on <a rel=\"nofollow\" href=\"https://www.insurancejournal.tv\">Insurance Journal TV</a>.</p>\n",
            "length": "9426384",
            "sourceUrl": "http://cdn.insurancejournal.tv/mp3/20201002_cannabis_podcast_11.mp3",
            "categories": [
                "Editors' Featured",
                "Insuring Cannabis Podcast",
                "iPhone",
                "iTunes",
                "Cannabis",
                "lawsuits",
                "litigation",
                "Marijuana"
            ]
        },
        {
            "title": "Increasing Diversity All About Dollars… And Sense",
            "datePublished": "Mon, 28 Sep 2020 10:00:19 +0000",
            "description": "<p>George Woods, a senior exec with Guy Carpenter, is an intriguing guest. He’s knowledgeable about insurance technology advances. You’ll hear about those on this recording. And he’s thoughtful about ways to increase diversity and inclusion in the industry. Making sure D&#038;I initiatives permeate the organization requires that part of managers’ compensation be linked to their effectiveness with these initiatives, George says. He takes a broad view: “Diversity isn’t just gender and ethnicity and race. It could be age or education. Ivy League vs. a state school. Someone who grew up in a rural versus urban environment. A creative versus analytical mind. Left brain or right brain. There are so many things that come into play.” Pay equity is an issue too, he adds. “Look at your organization and how you’re presently recruiting. How do you change that? And once you recruit the talent, who do you see getting promoted most of the time?” You’ll enjoy this discussion with a passionate industry insider.</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.insurancejournal.tv/videos/18584/\">Increasing Diversity All About Dollars… And Sense</a> appeared first on <a rel=\"nofollow\" href=\"https://www.insurancejournal.tv\">Insurance Journal TV</a>.</p>\n",
            "length": "16176437",
            "sourceUrl": "http://cdn.insurancejournal.tv/mp3/20200928_on_point.mp3",
            "categories": [
                "iPhone",
                "iTunes",
                "On Point",
                "george woods",
                "Guy Carpenter",
                "insurance",
                "on point",
                "peter van aartrijk",
                "Technology"
            ]
        },
        {
            "title": "EP. 10: Want to Do Business with the Cannabis Industry? Learn about Sales Fatigue First",
            "datePublished": "Wed, 16 Sep 2020 22:18:06 +0000",
            "description": "<p>If you’re unfamiliar with the term “sales fatigue” and you’re trying to do business in the cannabis industry, take a seat and listen up. We also asked experts in this week’s sales-focused Insuring Cannabis podcast whether being a cannabis consumer gives sellers of insurance and other products and services a boost and about nuances of selling to legacy vs. green rush operators? </p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.insurancejournal.tv/videos/18662/\">EP. 10: Want to Do Business with the Cannabis Industry? Learn about Sales Fatigue First</a> appeared first on <a rel=\"nofollow\" href=\"https://www.insurancejournal.tv\">Insurance Journal TV</a>.</p>\n",
            "length": "8436468",
            "sourceUrl": "http://cdn.insurancejournal.tv/mp3/20200918_cannabis_Podcast_10.mp3",
            "categories": [
                "Insuring Cannabis Podcast",
                "iPhone",
                "iTunes",
                "Cannabis",
                "Don Jergler",
                "insuring cannabis podcsat"
            ]
        },
        {
            "title": "VIDEO: Carrier Management ExecTalk: COVID-19: An Industry Wake-Up Call",
            "datePublished": "Wed, 16 Sep 2020 18:35:47 +0000",
            "description": "<p>As part of Carrier Management’s new ExecTalk series, Tracey Gibbons, senior vice president, underwriting, at Third Point Re, discusses how COVID-19 has been a wake-up call for the re/insurance industry. In a video filmed in early September 2020, Gibbons addresses the challenges that reinsurers face when underwriting pandemic risk, how COVID-19 has affected carriers’ appetite for pandemic risk, the growing awareness within the industry of the potential for hidden pandemic exposures, and the feasibility of government backstops for pandemic risk.</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.insurancejournal.tv/videos/18642/\">VIDEO: Carrier Management ExecTalk: COVID-19: An Industry Wake-Up Call</a> appeared first on <a rel=\"nofollow\" href=\"https://www.insurancejournal.tv\">Insurance Journal TV</a>.</p>\n",
            "length": "136821234",
            "sourceUrl": "http://cdn.insurancejournal.tv/itunes/20200902_tracey_gibbons_exec.mp4",
            "categories": [
                "Big Re",
                "iPhone",
                "iTunes",
                "bigre",
                "Carrier Management",
                "exectalk",
                "L.S. Howard",
                "reinsurance",
                "tracey Gibbons"
            ]
        },
        {
            "title": "Lockton Re: Creating Choice in Reinsurance with Talent, Analytics, Relationships",
            "datePublished": "Wed, 16 Sep 2020 18:29:22 +0000",
            "description": "<p>In March 2019, independent broker Lockton, sensing that a consolidating reinsurance market was lacking choice, made a major commitment to globally expand its reinsurance operations. Since then it has attracted a roster of talent with considerable experience. Two of these Lockton experts, Tim Gardner and Ross Howard, are well known in reinsurance circles. Gardner is today the global CEO of Lockton Re and Howard is global chairman. They see Lockton Re on the road to becoming the third largest reinsurance broker. Here Gardner from the U.S. and Howard from London talk about Lockton Re&#8217;s approach to creating choice, the difference experienced talent and state-of-the-art analytics make, the effect of the pandemic, and how this hard market differs from others.  </p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.insurancejournal.tv/videos/18580/\">Lockton Re: Creating Choice in Reinsurance with Talent, Analytics, Relationships</a> appeared first on <a rel=\"nofollow\" href=\"https://www.insurancejournal.tv\">Insurance Journal TV</a>.</p>\n",
            "length": "258436714",
            "sourceUrl": "http://cdn.insurancejournal.tv/itunes/20200818_lockton_re.mp4",
            "categories": [
                "Carrier Management",
                "Editors' Featured",
                "iPhone",
                "iTunes",
                "Andrew Simpson",
                "bigre",
                "coronaviris",
                "lockton re",
                "pandemic",
                "ross howard",
                "tim gardner"
            ]
        },
        {
            "title": "VIDEO: Machine Cover’s CEO: Reinsurance Is on the Verge of “Fairly Remarkable Change”",
            "datePublished": "Tue, 15 Sep 2020 18:42:23 +0000",
            "description": "<p>According to Inder-Jeet “IJ” Gujral, reinsurance is on the “cusp of fairly remarkable change over the next several years.” Gujral is founder and CEO of Machine Cover, an InsurTech that provides technology needed to bring parametrics into the insurance and reinsurance marketplaces. Recently, he spoke with Carrier Management Editor Mark Hollmer about the juxtaposition of parametrics and reinsurance and what he thinks about reinsurance innovation so far. Also in the mix: A little bit about Byzantine history, of which Gujral is a fan. </p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.insurancejournal.tv/videos/18612/\">VIDEO: Machine Cover&#8217;s CEO: Reinsurance Is on the Verge of &#8220;Fairly Remarkable Change&#8221;</a> appeared first on <a rel=\"nofollow\" href=\"https://www.insurancejournal.tv\">Insurance Journal TV</a>.</p>\n",
            "length": "159826278",
            "sourceUrl": "http://cdn.insurancejournal.tv/itunes/20200821_ij_gujral.mp4",
            "categories": [
                "Big Re",
                "Carrier Management",
                "iPhone",
                "iTunes",
                "bigre",
                "IJ Gujral",
                "Inder-Jeet Gujral",
                "mark hollmer",
                "reinsurance"
            ]
        },
        {
            "title": "AUDIO: Re/Insurance Liability Trends During the COVID-19 Crisis",
            "datePublished": "Mon, 14 Sep 2020 15:53:11 +0000",
            "description": "<p>Chirag Shah, Executive Vice President, Casualty Reinsurance at Willis Re, discusses how the COVID-19 crisis is affecting liability trends. During an interview conducted early September for this podcast, Shah pointed to the significant market correction taking place in the North American liability space, driven by social inflation and adverse loss development. Nevertheless, Shah says, there has been an increased demand for casualty reinsurance as insurers confront threats to both the asset and liability sides of their balance sheets – and look to reinsurers for more solutions to help them with their evolving needs.</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.insurancejournal.tv/videos/18640/\">AUDIO: Re/Insurance Liability Trends During the COVID-19 Crisis</a> appeared first on <a rel=\"nofollow\" href=\"https://www.insurancejournal.tv\">Insurance Journal TV</a>.</p>\n",
            "length": "11912623",
            "sourceUrl": "http://cdn.insurancejournal.tv/mp3/20200902_chrag_shah.mp3",
            "categories": [
                "Big Re",
                "iPhone",
                "iTunes",
                "bigre",
                "Carrier Management",
                "chirag shah",
                "L.S. Howard",
                "reinsurance"
            ]
        },
        {
            "title": "VIDEO: Lockton Re Execs Explain How This Hard Market Differs From Others",
            "datePublished": "Mon, 14 Sep 2020 11:15:25 +0000",
            "description": "<p>Lockton Re’s Tim Gardner, global CEO, and Ross Howard, global chairman, have been through their share of hard markets. But no two hard markets are exactly the same. Here they explain what’s different this time around.</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.insurancejournal.tv/videos/18608/\">VIDEO: Lockton Re Execs Explain How This Hard Market Differs From Others</a> appeared first on <a rel=\"nofollow\" href=\"https://www.insurancejournal.tv\">Insurance Journal TV</a>.</p>\n",
            "length": "46637069",
            "sourceUrl": "http://cdn.insurancejournal.tv/itunes/20200818_lockton_re_02.mp4",
            "categories": [
                "Big Re",
                "Carrier Management",
                "Editors' Featured",
                "iPhone",
                "iTunes",
                "Andrew Simpson",
                "big re",
                "lockton re",
                "reinsurance",
                "ross howard",
                "tim gardner"
            ]
        },
        {
            "title": "Bringing Back the “Home Office”",
            "datePublished": "Mon, 14 Sep 2020 10:00:52 +0000",
            "description": "<p>What company would relocate its corporate offices in the middle of a pandemic? Well, Badger Mutual recently did just that – moving from the outskirts of Milwaukee right downtown to cool digs in an old Pabst Beer plant. What does this mean for the carrier’s employees? It means that while some folks are coming back to the office, options still continue for working at home, says COO Dan Wolfgram. A hybrid approach started before the pandemic has resulted in flexible work scenarios, he says. On this recording, Wolfgram discusses the rationale for the new home office, local community spirit, agency relationships, and communicating with policyholders in a difficult time, especially many restaurant owner clients. Wolfgram’s 32-year background working with a local broker brings a fresh perspective to this small carrier.</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.insurancejournal.tv/videos/18544/\">Bringing Back the &#8220;Home Office&#8221;</a> appeared first on <a rel=\"nofollow\" href=\"https://www.insurancejournal.tv\">Insurance Journal TV</a>.</p>\n",
            "length": "12205295",
            "sourceUrl": "http://cdn.insurancejournal.tv/mp3/20200914_on_point.mp3",
            "categories": [
                "iPhone",
                "iTunes",
                "On Point",
                "agents",
                "badger mutual",
                "branding",
                "dan wolfgram",
                "insurance",
                "on point",
                "peter van aaartrijk",
                "podcast"
            ]
        },
        {
            "title": "VIDEO: Lockton Re Imagined: Bringing Choice to Reinsurance Brokerage",
            "datePublished": "Sun, 13 Sep 2020 17:10:47 +0000",
            "description": "<p>Lockton Re has been expanding where it believes it can meet the need for real choice in a consolidating reinsurance brokerage field. The firm seeks to distinguish itself with talent, analytics and service. Here Tim Gardner, global CEO, and Ross Howard, global chairman, explain how they imagine Lockton Re’s role in the changing reinsurance world.</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.insurancejournal.tv/videos/18606/\">VIDEO: Lockton Re Imagined: Bringing Choice to Reinsurance Brokerage</a> appeared first on <a rel=\"nofollow\" href=\"https://www.insurancejournal.tv\">Insurance Journal TV</a>.</p>\n",
            "length": "69103462",
            "sourceUrl": "http://cdn.insurancejournal.tv/itunes/20200818_lockton_re_01.mp4",
            "categories": [
                "Big Re",
                "Carrier Management",
                "Editors' Featured",
                "iPhone",
                "iTunes",
                "Andrew Simpson",
                "big re",
                "lockton re",
                "reinsurance",
                "reinsurance brokerage",
                "ross howard",
                "tim gardner"
            ]
        },
        {
            "title": "AUDIO: The Effects of COVID-19 on the Re/Insurance Industry – and Some of the Lessons Learned",
            "datePublished": "Fri, 11 Sep 2020 20:28:18 +0000",
            "description": "<p>In a wide-ranging interview, conducted in early August 2020, David Flandro, Managing Director, Analytics, at London-based Hyperion X, the data and technology-focused division of Hyperion Insurance Group, provides an update on how the COVID-19 crisis is affecting the re/insurance industry. Among these lessons are the need for contract clarity, that virtual business dealings can be embraced quickly with technology, and that costs can be removed from the value chain with innovation and competition. </p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.insurancejournal.tv/videos/18635/\">AUDIO: The Effects of COVID-19 on the Re/Insurance Industry – and Some of the Lessons Learned</a> appeared first on <a rel=\"nofollow\" href=\"https://www.insurancejournal.tv\">Insurance Journal TV</a>.</p>\n",
            "length": "11915483",
            "sourceUrl": "http://cdn.insurancejournal.tv/mp3/20200810_david_flandro.mp3",
            "categories": [
                "Big Re",
                "iPhone",
                "iTunes",
                "bigre",
                "david flandro",
                "L.S. Howard",
                "reinsurance"
            ]
        },
        {
            "title": "VIDEO: What Are the Major Changes Being Seen in the Industry as a Result of the COVID-19 Crisis?",
            "datePublished": "Fri, 11 Sep 2020 19:16:06 +0000",
            "description": "<p>David Flandro, Managing Director, Analytics, at London-based Hyperion X, discusses the technological changes the industry is seeing as a result of the COVID-19 pandemic.  </p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.insurancejournal.tv/videos/18629/\">VIDEO: What Are the Major Changes Being Seen in the Industry as a Result of the COVID-19 Crisis?</a> appeared first on <a rel=\"nofollow\" href=\"https://www.insurancejournal.tv\">Insurance Journal TV</a>.</p>\n",
            "length": "80220357",
            "sourceUrl": "http://cdn.insurancejournal.tv/itunes/20200810_david_flandro_04.mp4",
            "categories": [
                "Big Re",
                "iPhone",
                "iTunes",
                "bigre",
                "david flandro",
                "L.S. Howard",
                "reinsurance"
            ]
        },
        {
            "title": "VIDEO: Crisis Highlights Need for Clear Contract Wordings",
            "datePublished": "Fri, 11 Sep 2020 19:15:36 +0000",
            "description": "<p> David Flandro, Managing Director, Analytics, at London-based Hyperion X, looks at the disconnect between what customers think they’re buying as opposed to what the industry thinks it’s selling, which has been highlighted by COVID-19 coverage disputes.</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.insurancejournal.tv/videos/18627/\">VIDEO: Crisis Highlights Need for Clear Contract Wordings</a> appeared first on <a rel=\"nofollow\" href=\"https://www.insurancejournal.tv\">Insurance Journal TV</a>.</p>\n",
            "length": "78257938",
            "sourceUrl": "http://cdn.insurancejournal.tv/itunes/20200810_david_flandro_03.mp4",
            "categories": [
                "Big Re",
                "iPhone",
                "iTunes",
                "bigre",
                "david flandro",
                "L.S. Howard",
                "reinsurance"
            ]
        },
        {
            "title": "EP. 9: A Diversity Buzz Blooming in Cannabis and Insurance?",
            "datePublished": "Thu, 03 Sep 2020 18:24:40 +0000",
            "description": "<p>Diversity is more than just a buzzword in both the cannabis and insurance industries, where efforts to increase the number of women and minorities in leadership roles have been ongoing. In cannabis, a number of states have social equity programs to encourage ownership, and there are several organizations focusing on fostering greater diversity in the industry. Insurance Journal tapped three diverse professionals who make a living in the cannabis and insurance space to get their thoughts on diversity. </p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.insurancejournal.tv/videos/18614/\">EP. 9: A Diversity Buzz Blooming in Cannabis and Insurance?</a> appeared first on <a rel=\"nofollow\" href=\"https://www.insurancejournal.tv\">Insurance Journal TV</a>.</p>\n",
            "length": "6097313",
            "sourceUrl": "http://cdn.insurancejournal.tv/mp3/20200904_cannabis_podcast_09.mp3",
            "categories": [
                "Editors' Featured",
                "Insuring Cannabis Podcast",
                "iPhone",
                "iTunes",
                "diversity",
                "Don Jergler",
                "Insuring Cannabis"
            ]
        },
        {
            "title": "How to Get More Online Reviews",
            "datePublished": "Wed, 02 Sep 2020 01:34:43 +0000",
            "description": "<p>Gaining a good review online has a multitude of benefits. It has an impact on your agency’s public image. Any time you get an outstanding review, you’re proving your agency has what it takes to provide true value. Reviews also have an SEO value for your insurance website. ITC CEO Laird Rixford shares how to get more online reviews.</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.insurancejournal.tv/videos/18610/\">How to Get More Online Reviews</a> appeared first on <a rel=\"nofollow\" href=\"https://www.insurancejournal.tv\">Insurance Journal TV</a>.</p>\n",
            "length": "82869859",
            "sourceUrl": "http://cdn.insurancejournal.tv/itunes/20200901_uc_itc.mp4",
            "categories": [
                "iPhone",
                "iTunes",
                "User Contributed"
            ]
        },
        {
            "title": "Managing Coronavirus Risk Reveals Insurance Blind Spots",
            "datePublished": "Tue, 01 Sep 2020 13:30:41 +0000",
            "description": "<p>Jim Wetekamp, CEO of Riskonnect, on how organizations have been learning what did and didn&#8217;t work about their insurance plans.</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.insurancejournal.tv/videos/18595/\">Managing Coronavirus Risk Reveals Insurance Blind Spots</a> appeared first on <a rel=\"nofollow\" href=\"https://www.insurancejournal.tv\">Insurance Journal TV</a>.</p>\n",
            "length": "23976697",
            "sourceUrl": "http://cdn.insurancejournal.tv/itunes/20200813_jim_wetekamp_02.mp4",
            "categories": [
                "Editors' Featured",
                "iPhone",
                "iTunes",
                "Andrew Simpson",
                "insurance journal",
                "insurance plans",
                "jim wetekamp",
                "riskonnect"
            ]
        },
        {
            "title": "Coronavirus Effect on Climate Change Risk Management",
            "datePublished": "Tue, 01 Sep 2020 13:29:06 +0000",
            "description": "<p>Jim Wetekamp, CEO of Riskonnect, on how while organizations may have to put some investments on hold this year, that doesn&#8217;t mean they are wavering in their commitment to addressing climate issues. In the long term, climate change will evolve as a risk, much like a pandemic.</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.insurancejournal.tv/videos/18597/\">Coronavirus Effect on Climate Change Risk Management</a> appeared first on <a rel=\"nofollow\" href=\"https://www.insurancejournal.tv\">Insurance Journal TV</a>.</p>\n",
            "length": "16579364",
            "sourceUrl": "http://cdn.insurancejournal.tv/itunes/20200813_jim_wetekamp_03.mp4",
            "categories": [
                "Editors' Featured",
                "iPhone",
                "iTunes",
                "Andrew Simpson",
                "Climate Change",
                "Coronavirus",
                "covid19",
                "insurance",
                "jim wetekamp",
                "pandemic",
                "riskonnect"
            ]
        },
        {
            "title": "Quarterbacking Coronavirus Risks",
            "datePublished": "Tue, 01 Sep 2020 13:27:35 +0000",
            "description": "<p>Jim Wetekamp, CEO of Riskonnect, on how the pandemic crisis pushed organizations to bring together all players concerned about risk on the financial and insurance side along with sales, logistics, operations, HR, and corporate strategy to they were able to quarterback their response. </p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.insurancejournal.tv/videos/18593/\">Quarterbacking Coronavirus Risks</a> appeared first on <a rel=\"nofollow\" href=\"https://www.insurancejournal.tv\">Insurance Journal TV</a>.</p>\n",
            "length": "19477388",
            "sourceUrl": "http://cdn.insurancejournal.tv/itunes/20200813_jim_wetekamp_01.mp4",
            "categories": [
                "Editors' Featured",
                "iPhone",
                "iTunes",
                "Andrew Simpson",
                "Coronavirus",
                "covid19",
                "jim wetekamp",
                "riskonnect"
            ]
        },
        {
            "title": "Agent’s Take on Insurance Industry Diversity",
            "datePublished": "Mon, 31 Aug 2020 10:00:15 +0000",
            "description": "<p>Like a lot of agents, Quincy Branch reluctantly joined his dad’s firm, which has grown into a successful Las Vegas-based agency. It was not his first career choice. But unlike most independent agents, Quincy is an African American. And since his dad was one of the pioneers of the National African American Insurance Association (NAAIA), Quincy has a deep historical lens on diversity in the insurance industry. Today’s discussions, he says, “are some of the same conversations we’ve had in the insurance industry for decades. It’s time to stop talking about it and be about it. Put your money where your mouth is. The world is changing. It’s not a pale, male and stale community. We are very diverse and blended.” And once insurance professionals “really commit to diversity and inclusion, you’ll get there.” Quincy urges his fellow principals to see the business initiative behind D&#038;I: “We’re in the business of making money first.” Please listen to this podcast; Quincy shares a lot of frank and helpful insight – especially on the awkward questions from your host!</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.insurancejournal.tv/videos/18542/\">Agent’s Take on Insurance Industry Diversity</a> appeared first on <a rel=\"nofollow\" href=\"https://www.insurancejournal.tv\">Insurance Journal TV</a>.</p>\n",
            "length": "",
            "sourceUrl": "http://cdn.insurancejournal.tv/mp3/20200831_on_point.mp3",
            "categories": [
                "iPhone",
                "iTunes",
                "On Point",
                "agents",
                "diversity",
                "independent agent",
                "insurance",
                "NAAIA",
                "on point",
                "peter van aartrijk",
                "Quincy Branch"
            ]
        },
        {
            "title": "Saying Goodbye to an Insurance Leader– FAIA Chief Grady’s Top 10 Moments",
            "datePublished": "Wed, 26 Aug 2020 21:51:26 +0000",
            "description": "<p>For 22 years, the Florida Association of Insurance Agents has been led by Jeff Grady, president and chief executive officer, who admits that when he started all those years ago he did not expect to “fall in love with insurance agents.”</p>\n<p>Grady joined FAIA from the banking world in 1998 and said he quickly learned about – and came to greatly respect – the work done by the 116-year-old association’s 2,000 agency members across the state.</p>\n<p>In this interview with Insurance Journal, Grady recalled the top 10 moments during his leadership and how those moments also shaped the insurance landscape in Florida.</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.insurancejournal.tv/videos/18586/\">Saying Goodbye to an Insurance Leader– FAIA Chief Grady’s Top 10 Moments</a> appeared first on <a rel=\"nofollow\" href=\"https://www.insurancejournal.tv\">Insurance Journal TV</a>.</p>\n",
            "length": "248029527",
            "sourceUrl": "http://cdn.insurancejournal.tv/itunes/20200818_grady_top10.mp4",
            "categories": [
                "Editors' Featured",
                "iPhone",
                "iTunes",
                "amy o connor",
                "FAIA",
                "florida",
                "jeff grady"
            ]
        },
        {
            "title": "When Crises Collide, Risk Management Requires Smashing Silos",
            "datePublished": "Fri, 21 Aug 2020 19:42:02 +0000",
            "description": "<p>The world is in the midst of a record pandemic. The U.S. is facing an economic downturn and a hurricane season, both of which could set records as well. And there is civil unrest across the country. Jim Wetekamp, CEO of integrated risk management technology firm Riskonnect, and Wells Media&#8217;s Andy Simpson, discuss how organizations are managing through today&#8217;s multiple crises. According to Wetekamp, many organizations have gone from triaging in order to keep people healthy and stay in business to building for the recovery phase. Those managing the best have broken down silos, centralized information from across their organizations and partners, and pivoted to make risk the focus of strategy and action. They are uncovering blind spots in their protections and business lines and are implementing changes to compete in the new normal. Meanwhile, with all that&#8217;s going on, Simpson asks, what&#8217;s happening to efforts to address climate change?</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.insurancejournal.tv/videos/18557/\">When Crises Collide, Risk Management Requires Smashing Silos</a> appeared first on <a rel=\"nofollow\" href=\"https://www.insurancejournal.tv\">Insurance Journal TV</a>.</p>\n",
            "length": "199037385",
            "sourceUrl": "http://cdn.insurancejournal.tv/itunes/20200813_jim_wetekamp.mp4",
            "categories": [
                "Editors' Featured",
                "Home Page",
                "iPhone",
                "iTunes",
                "Andrew Simpson",
                "catastrophe",
                "insurance journal",
                "jim wetekamp",
                "pandemic",
                "riskonnect"
            ]
        },
        {
            "title": "EP. 8: Could COVID be Behind a Cannabis Risk & Compliance Training Proliferation?",
            "datePublished": "Wed, 19 Aug 2020 10:25:42 +0000",
            "description": "<p>Educational opportunities centered around risk and compliance seem to be popping up lately for the cannabis industry. Distance education provider Excelsior College is offering an Advanced Certificate in Cannabis Control. Green Flower Academy has a certificate in Cannabis Compliance and Regulations. Those are just a few. Listen to what experts on continuing education have to say about what’s driving this, and how much the COVID-19 shelter-in-place orders have to do with what appears to be a new learning culture proliferation in the cannabis sector. </p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.insurancejournal.tv/videos/18569/\">EP. 8: Could COVID be Behind a Cannabis Risk &#038; Compliance Training Proliferation?</a> appeared first on <a rel=\"nofollow\" href=\"https://www.insurancejournal.tv\">Insurance Journal TV</a>.</p>\n",
            "length": "5795419",
            "sourceUrl": "http://cdn.insurancejournal.tv/mp3/20200821_cannabis_podcast_08.mp3",
            "categories": [
                "Editors' Featured",
                "Insuring Cannabis Podcast",
                "iPhone",
                "iTunes",
                "agents",
                "Coronavirus",
                "covid19",
                "Don Jergler",
                "education",
                "green academy",
                "insuance"
            ]
        },
        {
            "title": "Nurturing Culture in a Pandemic",
            "datePublished": "Mon, 17 Aug 2020 10:00:31 +0000",
            "description": "<p>What can leaders of insurance organizations do to maintain their corporate cultures in the middle of a pandemic? Zoom video calls aren’t enough. When you keep your people focused on mission, vision and core values, it gives them a sense of purpose in times of stress, says brand and culture consultant Tony Wessling with Chromium Group. A vision statement – why you exist as a firm – provides clarity for work lives that spills over and impacts personal lives. “People are feeling unsure,” Tony says, “so this is where insurance brands really find their purpose – in vision. What are you really working for? What are our clients going through, and how can we help?” The other element is how you do what you do – found in your core values. Tony recommends one-on-one telephone calls and small-group chats. Insurance executives will hear plenty of actionable information on this recording.</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.insurancejournal.tv/videos/18451/\">Nurturing Culture in a Pandemic</a> appeared first on <a rel=\"nofollow\" href=\"https://www.insurancejournal.tv\">Insurance Journal TV</a>.</p>\n",
            "length": "16289720",
            "sourceUrl": "http://cdn.insurancejournal.tv/mp3/20200817_on_point.mp3",
            "categories": [
                "iPhone",
                "iTunes",
                "On Point",
                "Podcasts",
                "chromium group",
                "Coronavirus",
                "covid19",
                "insurance agents",
                "pandemic",
                "peter van aartrijk",
                "remote working",
                "Tony Wessling",
                "work lives"
            ]
        },
        {
            "title": "IJ Academy AfterShow: Commercial Property Master Class",
            "datePublished": "Thu, 06 Aug 2020 22:27:41 +0000",
            "description": "<p>In this weeks IJA AfterShow, the team talks about Patrick&#8217;s recent IJA class, <a href=\"https://www.ijacademy.com/instructors/patrick-wraight/commercial-property-master-class-additional-coverages-coverage-extensions-and-optional-coverages\">Commercial Property Master Class &#8211; Additional Coverages, Coverage Extensions, and Optional Coverages </a>.  Watch as George and Patrick discuss some of the most important costs to consider when dealing with Commercial Property, and so much more!</p>\n<p>Not yet a member of the academy?  <a href=\"https://www.ijacademy.com/members/join\">Join Today!</a></p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.insurancejournal.tv/videos/18550/\">IJ Academy AfterShow: Commercial Property Master Class</a> appeared first on <a rel=\"nofollow\" href=\"https://www.insurancejournal.tv\">Insurance Journal TV</a>.</p>\n",
            "length": "126949363",
            "sourceUrl": "http://cdn.insurancejournal.tv/itunes/20200806_ija_aftershow.mp4",
            "categories": [
                "Academy of Insurance",
                "iPhone",
                "iTunes",
                "aftershow",
                "commercial property",
                "george jack",
                "Insurance Journal Academy",
                "patrick wraight"
            ]
        },
        {
            "title": "EP. 7: Cash is King in Cannabis, But Crime Insurance May be the Crucial Queen",
            "datePublished": "Thu, 06 Aug 2020 16:57:43 +0000",
            "description": "<p>With limited access to banking services, dispensaries have large quantities of cash going in and out their doors daily. Cash is king in the cannabis industry, making these businesses a tempting target for criminals. Prevention is key in thwarting crooks, but insurance plays an important role too. Hear what experts have to say about crime policies in an industry where the greenback rules the land.  </p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.insurancejournal.tv/videos/18540/\">EP. 7: Cash is King in Cannabis, But Crime Insurance May be the Crucial Queen</a> appeared first on <a rel=\"nofollow\" href=\"https://www.insurancejournal.tv\">Insurance Journal TV</a>.</p>\n",
            "length": "7778284",
            "sourceUrl": "http://cdn.insurancejournal.tv/mp3/20200807_cannabis_podcast_07.mp3",
            "categories": [
                "Insuring Cannabis Podcast",
                "iPhone",
                "iTunes",
                "Podcasts",
                "Don Jergler",
                "Insuring Cannabis",
                "podcast",
                "risk"
            ]
        },
        {
            "title": "COVID-19, Hurricane Season, Cyber Risk: Is the Insurance Industry Ready for a Compound Disaster?",
            "datePublished": "Tue, 04 Aug 2020 16:33:13 +0000",
            "description": "<p>With Atlantic hurricane season underway and Tropical Storm Isaias set to continue making its way across the Northeast today, Insurance Journal’s East Editor Elizabeth Blosfield spoke with Scott Fouts, vice president of Hub International’s Risk Services Division, about the impact a natural disaster could have during the ongoing COVID-19 crisis. Fouts also discussed how the pandemic is leading to increased cyber risk as many employees continue to work remotely, and how the insurance industry can prepare for compound events like these.</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.insurancejournal.tv/videos/18538/\">COVID-19, Hurricane Season, Cyber Risk: Is the Insurance Industry Ready for a Compound Disaster?</a> appeared first on <a rel=\"nofollow\" href=\"https://www.insurancejournal.tv\">Insurance Journal TV</a>.</p>\n",
            "length": "67622567",
            "sourceUrl": "http://cdn.insurancejournal.tv/itunes/2020803_scott_fouts.mp4",
            "categories": [
                "Editors' Featured",
                "iPhone",
                "iTunes",
                "agents",
                "Coronavirus",
                "covid19",
                "Disaster",
                "elizabeth blosfield",
                "hub international",
                "insurance",
                "risk",
                "scott fouts",
                "tropical storm isaias"
            ]
        },
        {
            "title": "Disrupt Yourself",
            "datePublished": "Mon, 03 Aug 2020 10:00:39 +0000",
            "description": "<p>Like a lot of insuretech founders, self-described programming geek Jason Kolb fell into the insurance industry – and loves it. It began with his working on technology to support a carrier book roll. Today, with Dais, his team built a platform enabling API connections. Agencies communicate with carriers and policyholders for a host of services (e.g. CSR responsibilities) and expertise (e.g. underwriting). “Agents are entrepreneurial, ambitious, competitive and they want to drive the industry,” he says. In Jason’s view, the traditional agency management systems should heed the evolving landscape. “When you’re dominating the market, one of two things will happen. You will be disrupted, or you will disrupt yourself. It’s painful because some of the revenue streams that have been profitable for a long time won’t be in the future.” The legacy players, he says, “have to make a decision. Will they be open or will they be closed?” Faced with technology pressure and insuretech options, Jason predicts more alliances and consolidation among carriers. “People will look at partnering more. Insurance is just a giant supply chain – one big layer of overlap.”</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.insurancejournal.tv/videos/18455/\">Disrupt Yourself</a> appeared first on <a rel=\"nofollow\" href=\"https://www.insurancejournal.tv\">Insurance Journal TV</a>.</p>\n",
            "length": "14165602",
            "sourceUrl": "http://cdn.insurancejournal.tv/mp3/20200803_on_point.mp3",
            "categories": [
                "iPhone",
                "iTunes",
                "On Point",
                "Podcasts",
                "Jason Kolb",
                "on point",
                "peter van aartrijk"
            ]
        },
        {
            "title": "IJ Academy AfterShow:  Let’s talk about the Gaps",
            "datePublished": "Fri, 24 Jul 2020 01:08:12 +0000",
            "description": "<p>In this weeks IJA AfterShow, the team welcomes Kevin Amrhein as they meet up after his IJA class, <a href=\"https://www.ijacademy.com/instructors/kevin-amrhein/an-hour-with-kevin-fix-my-a-commercial-property-policy-webinar\">An Hour with Kevin: Fix my #%&#038;! Commercial Property Policy</a>.  Watch as Kevin talks about Commercial Property gaps and shares some of his unusual claims stories.  </p>\n<p>Not yet a member of the academy?  <a href=\"https://www.ijacademy.com/members/join\">Join Today!</a></p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.insurancejournal.tv/videos/18525/\">IJ Academy AfterShow:  Let&#8217;s talk about the Gaps</a> appeared first on <a rel=\"nofollow\" href=\"https://www.insurancejournal.tv\">Insurance Journal TV</a>.</p>\n",
            "length": "287148713",
            "sourceUrl": "http://cdn.insurancejournal.tv/itunes/20200723_ija_aftershow.mp4",
            "categories": [
                "Academy of Insurance",
                "iPhone",
                "iTunes"
            ]
        },
        {
            "title": "EP. 6: Wrong Workers’ Comp Class Codes in Cannabis is Worrying",
            "datePublished": "Thu, 23 Jul 2020 22:07:58 +0000",
            "description": "<p>How often are the wrong workers’ compensation class codes being used in the cannabis industry? One expert says about one-in-four cannabis companies are wrongly reporting class codes. Underinsurance, or having no workers’ comp at all, are other issues being commonly seen in the cannabis sector, according to the experts we spoke with. </p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.insurancejournal.tv/videos/18521/\">EP. 6: Wrong Workers’ Comp Class Codes in Cannabis is Worrying</a> appeared first on <a rel=\"nofollow\" href=\"https://www.insurancejournal.tv\">Insurance Journal TV</a>.</p>\n",
            "length": "7173920",
            "sourceUrl": "http://cdn.insurancejournal.tv/mp3/20200724_cannabis_podcast_06.mp3",
            "categories": [
                "Insuring Cannabis Podcast",
                "iPhone",
                "iTunes",
                "Podcasts",
                "Cannabis",
                "Don Jergler",
                "Insuring Cannabis",
                "workers comp"
            ]
        },
        {
            "title": "What You Can Do in Tough Times",
            "datePublished": "Mon, 20 Jul 2020 10:00:29 +0000",
            "description": "<p>Has the pandemic altered independent agent and broker financials? Yes… And no, according to popular guest Dave Tralka, InsurBanc’s CEO. In this second of two installments on the current agent/broker situation, you’ll get up to speed quickly on what you as an owner should be anticipating in the marketplace, how investors view the business, and how to keep your house in order. Some principals have sold during the pandemic; others have hit the pause button, Dave says. In any case, this summer is an excellent time to review how your firm handled the crisis. Dave also discusses how agencies took advantage of the Payroll Protection Loans and his bank’s experience in dealing with them. He wraps up by offering specific actions that owners must take ASAP. These actions will be sure you retain employees and customers, document some pandemic lessons, and position your firm to grow.</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.insurancejournal.tv/videos/18469/\">What You Can Do in Tough Times</a> appeared first on <a rel=\"nofollow\" href=\"https://www.insurancejournal.tv\">Insurance Journal TV</a>.</p>\n",
            "length": "13367657",
            "sourceUrl": "http://cdn.insurancejournal.tv/mp3/20200720_on_point.mp3",
            "categories": [
                "iPhone",
                "iTunes",
                "On Point",
                "agents",
                "Coronavirus",
                "COVID 19",
                "Dave Tralka",
                "insurance",
                "on point",
                "Peter Van Aatrijk",
                "Technology"
            ]
        },
        {
            "title": "Can SEO Translate to Your Bottom Line?",
            "datePublished": "Fri, 10 Jul 2020 23:26:12 +0000",
            "description": "<p>SEO takes time, energy and resources to improve your website’s rankings in search results. But can it influence your bottom line?</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.insurancejournal.tv/videos/18507/\">Can SEO Translate to Your Bottom Line?</a> appeared first on <a rel=\"nofollow\" href=\"https://www.insurancejournal.tv\">Insurance Journal TV</a>.</p>\n",
            "length": "96759478",
            "sourceUrl": "http://cdn.insurancejournal.tv/itunes/20200714_uc_itc.mp4",
            "categories": [
                "iPhone",
                "iTunes",
                "User Contributed",
                "agency",
                "insurance",
                "ITC",
                "Laird Rixford",
                "SEO"
            ]
        },
        {
            "title": "EP. 5: Cyber-Cannabis Insurance Space Screams for More Coverage",
            "datePublished": "Thu, 09 Jul 2020 10:00:19 +0000",
            "description": "<p>Cannabis businesses like many in the small business community have yet to embrace cyber insurance, or see the big risk that lies in wait for them out in cyber space. We spoke to experts on the cyber perils that are unique to cannabis businesses, and why they aren’t buying into cyber.</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.insurancejournal.tv/videos/18487/\">EP. 5: Cyber-Cannabis Insurance Space Screams for More Coverage</a> appeared first on <a rel=\"nofollow\" href=\"https://www.insurancejournal.tv\">Insurance Journal TV</a>.</p>\n",
            "length": "6996303",
            "sourceUrl": "http://cdn.insurancejournal.tv/mp3/20200710_cannabis_podcast_05.mp3",
            "categories": [
                "Insuring Cannabis Podcast",
                "iPhone",
                "iTunes",
                "Podcasts",
                "Cannabis",
                "Don Jergler",
                "insurance",
                "insurance journal",
                "podcast"
            ]
        },
        {
            "title": "“Things Were Going Great!”",
            "datePublished": "Mon, 06 Jul 2020 10:00:59 +0000",
            "description": "<p>Agents and brokers posted a record-setting start to 2020 in organic revenue growth. Even the second quarter should be decent. But the next four or five quarters Q3 will look different, says Harrison Brooks with Reagan Consulting. The pandemic will further the divide between well-run and weaker firms, he says, noting that 2020 will be “the big separator.” Employee benefits has been the first line of business to be hit hard by the crisis, he says. As the sales pipeline has changed dramatically, smart agencies have adapted with technology and workflows. M&#038;A activity has slowed down, but there is still plenty of investor capital available for well-run firms. “We have seen values are still there, at the same levels they’ve been, but buyers are going to take a harder look at the books of business and do even more due diligence,” Harrison says. This data-packed recording will update you on how agents and brokers will perform in the next 12 years.</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.insurancejournal.tv/videos/18466/\">&#8220;Things Were Going Great!&#8221;</a> appeared first on <a rel=\"nofollow\" href=\"https://www.insurancejournal.tv\">Insurance Journal TV</a>.</p>\n",
            "length": "12550742",
            "sourceUrl": "http://cdn.insurancejournal.tv/mp3/20200706_on_point.mp3",
            "categories": [
                "iPhone",
                "iTunes",
                "On Point"
            ]
        },
        {
            "title": "IJ Academy Aftershow: Conversation on Municipal and Law Enforcement Liability Issues",
            "datePublished": "Thu, 02 Jul 2020 21:35:28 +0000",
            "description": "<p>In this video, the Insurance Journal Academy team takes some time to talk about what they learned from the panel on the recent webinar: <a href=\"https://www.insurancejournal.com/research/research/conversation-on-municipal-and-law-enforcement-liability-issues/\">Conversation on Municipal and Law Enforcement Liability Issues</a>.  Watch as Patrick and George offer some thoughts post discussion which we hope will encourage you to check it out for yourself!</p>\n<p>Not yet a member of the academy?  <a href=\"https://www.ijacademy.com/members/join\">Join Today!</a></p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.insurancejournal.tv/videos/18481/\">IJ Academy Aftershow: Conversation on Municipal and Law Enforcement Liability Issues</a> appeared first on <a rel=\"nofollow\" href=\"https://www.insurancejournal.tv\">Insurance Journal TV</a>.</p>\n",
            "length": "221421858",
            "sourceUrl": "http://cdn.insurancejournal.tv/itunes/20200702_ija_aftershow.mp4",
            "categories": [
                "Academy of Insurance",
                "iPhone",
                "iTunes",
                "george jack",
                "municipal and law enforcement",
                "patrick wraight"
            ]
        },
        {
            "title": "EP. 4: Cannabis Business Insurance Buyers Say the Darndest Things",
            "datePublished": "Thu, 25 Jun 2020 10:00:53 +0000",
            "description": "<p>Some of those who are getting into cannabis may have experience buying insurance, but considering cannabis has been legal for less than a decade, this is a whole new world for most people. We thought it would be interesting to take a look inside the cannabis insurance buying process, but through the viewpoint of those who sell insurance. It turns out that what you don’t know, could really hurt you.</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.insurancejournal.tv/videos/18473/\">EP. 4: Cannabis Business Insurance Buyers Say the Darndest Things</a> appeared first on <a rel=\"nofollow\" href=\"https://www.insurancejournal.tv\">Insurance Journal TV</a>.</p>\n",
            "length": "6680345",
            "sourceUrl": "http://cdn.insurancejournal.tv/mp3/20200626_cannabis_podcast_04.mp3",
            "categories": [
                "Insuring Cannabis Podcast",
                "iPhone",
                "iTunes",
                "Podcasts",
                "Cannabis",
                "Don Jergler",
                "insurance"
            ]
        },
        {
            "title": "Do Annual Policies Still Make Sense?",
            "datePublished": "Mon, 22 Jun 2020 10:00:30 +0000",
            "description": "<p>Small businessowners are picking their way through the pandemic. It’s a “massive reset” involving not just restarting businesses, but starting new firms, says Jay Bregman, founder and CEO of insurtech Thimble. And, how those owners view the insurance product could change permanently, he says on this recording. Thimble gives modern workers the flexibility to purchase insurance by the hour, day or month based on their needs – no need for an annual policy. While cancellations are rising in certain job categories, new Thimble policies for freelance janitors and cleaners, landscape architects and others have been increasing. Thimble Monthly customers control their policies via an app, with the ability to scale coverage, add insureds or switch plans instantly. Thimble Monthly can be purchased in just 60 seconds, requires no deposits, and delivers proof of insurance immediately. “Current insurance products simply don’t meet the needs of customers today,” Jay says. This MGA works direct with consumers as well as via retail agents and is primarily backed up by Markel.</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.insurancejournal.tv/videos/18396/\">Do Annual Policies Still Make Sense?</a> appeared first on <a rel=\"nofollow\" href=\"https://www.insurancejournal.tv\">Insurance Journal TV</a>.</p>\n",
            "length": "13738990",
            "sourceUrl": "http://cdn.insurancejournal.tv/mp3/20200622_on_point.mp3",
            "categories": [
                "iPhone",
                "iTunes",
                "On Point",
                "insurtech",
                "jay bregman",
                "on point",
                "Peter Van Aatrijk",
                "thimble"
            ]
        },
        {
            "title": "EP. 3: Most Cannabis Businesses Have Policies With Concerning Exclusions",
            "datePublished": "Thu, 11 Jun 2020 10:00:20 +0000",
            "description": "<p>You might be surprised how many cannabis companies have exclusions in their policies that leave these businesses far more exposed than they realize. It this because business owners and insurance buyers in the budding cannabis industry aren’t yet sophisticated enough to know what they’re getting? It is newb brokers who aren’t sufficiently familiar with their customers’ needs or the policies they are selling? Listen to the latest Insuring Cannabis podcast for answers to those questions and more.</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.insurancejournal.tv/videos/18459/\">EP. 3: Most Cannabis Businesses Have Policies With Concerning Exclusions</a> appeared first on <a rel=\"nofollow\" href=\"https://www.insurancejournal.tv\">Insurance Journal TV</a>.</p>\n",
            "length": "8742993",
            "sourceUrl": "http://cdn.insurancejournal.tv/mp3/20200612_cannabis_podcast_03.mp3",
            "categories": [
                "Insuring Cannabis Podcast",
                "iPhone",
                "iTunes",
                "Podcasts"
            ]
        },
        {
            "title": "SPONSORED: The Biggest Marketing Mistake You Can Make",
            "datePublished": "Mon, 01 Jun 2020 22:56:14 +0000",
            "description": "<p>The decision to buy insurance is not fully logical, and that is where it is easy to make the biggest mistake when marketing your insurance agency.</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.insurancejournal.tv/videos/18442/\">SPONSORED: The Biggest Marketing Mistake You Can Make</a> appeared first on <a rel=\"nofollow\" href=\"https://www.insurancejournal.tv\">Insurance Journal TV</a>.</p>\n",
            "length": "52359679",
            "sourceUrl": "http://cdn.insurancejournal.tv/itunes/20200601_uc_itc.mp4",
            "categories": [
                "iPhone",
                "iTunes",
                "User Contributed",
                "agents",
                "becky Schroeder",
                "insurance",
                "ITC",
                "marketing"
            ]
        },
        {
            "title": "iJam with Honey",
            "datePublished": "Sat, 30 May 2020 00:23:08 +0000",
            "description": "<p>Behind the scenes of the Insurance Journal Directories and <a href=\"https://www.mynewmarkets.com/\">MyNewMarkets.com </a>is one of the coolest people you’ll ever meet. Kristine Honey is the star of this edition of iJam. You’ll hear about some of the strangest market requests and chats she’s had. You’ll also hear: About her irrational fear of cotton balls, why she’s received flowers and chocolate from agents and wholesalers, and why she is passionate about her job.  It’s a fun one, y’all. Enjoy!</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.insurancejournal.tv/videos/18439/\">iJam with Honey</a> appeared first on <a rel=\"nofollow\" href=\"https://www.insurancejournal.tv\">Insurance Journal TV</a>.</p>\n",
            "length": "280135204",
            "sourceUrl": "http://cdn.insurancejournal.tv/itunes/20200529_ijam_vodcast.mp4",
            "categories": [
                "IJAM",
                "iPhone",
                "iTunes",
                "Marketing",
                "Podcasts",
                "ijam",
                "insurance journal",
                "Julie Tinney",
                "Kristine Honey",
                "marketing",
                "MyNewMarkets"
            ]
        },
        {
            "title": "EP. 2: CBD, THC’s Mild-Mannered Kin, is a Risk Worth Watching",
            "datePublished": "Thu, 28 May 2020 22:13:15 +0000",
            "description": "<p>Cannabidiol (CBD), a chemical compound from the Cannabid sativa plant, may be less potent than its stony cannabis cousin THC, however CBD might be the far riskier relative. Nearly a dozen major CBD-related class action lawsuits, as well as a handful of legal and regulatory actions against some CBD companies, are pending. All of this bears watching by those in the sector who manage and deal in risk.</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.insurancejournal.tv/videos/18437/\">EP. 2: CBD, THC’s Mild-Mannered Kin, is a Risk Worth Watching</a> appeared first on <a rel=\"nofollow\" href=\"https://www.insurancejournal.tv\">Insurance Journal TV</a>.</p>\n",
            "length": "11049508",
            "sourceUrl": "http://cdn.insurancejournal.tv/mp3/20200529_cannabis_podcast.mp3",
            "categories": [
                "Insuring Cannabis Podcast",
                "iPhone",
                "iTunes",
                "Podcasts",
                "cannabid",
                "Coronavirus",
                "covid19",
                "CVD",
                "D&O",
                "Don Jergler",
                "insurance",
                "Insuring Cannabis",
                "podcast",
                "risk"
            ]
        },
        {
            "title": "Colorful Reflections from a Technology Veteran",
            "datePublished": "Mon, 25 May 2020 10:00:45 +0000",
            "description": "<p>You’ll get vintage, unfettered Doug Johnston in this recording as he retires after six decades in the insurance and technology business, almost exclusively at Applied Systems, the agency management system provider. Doug got interested in the industry when his father, an independent agent, took him to work one day and also showed him the computer room at Chubb Insurance, which was in the same building. He was hooked. That led to a long stint at Applied, beginning with the earliest years toiling away in the founder’s house. Doug’s dedication to Applied’s brand – and a wicked tongue to go with that – would send some other industry tech operators into a tizzy. For example, when a salesman was trying to get a meeting with Doug at a conference, the response was terse, loud and overheard by many: “Lose my business card.” At the heart of this storied career, though, is a fascination and passion for the independent agency system.</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.insurancejournal.tv/videos/18294/\">Colorful Reflections from a Technology Veteran</a> appeared first on <a rel=\"nofollow\" href=\"https://www.insurancejournal.tv\">Insurance Journal TV</a>.</p>\n",
            "length": "18667252",
            "sourceUrl": "http://cdn.insurancejournal.tv/mp3/20200525_on_point.mp3",
            "categories": [
                "iPhone",
                "iTunes",
                "On Point",
                "Podcasts",
                "doug johnston",
                "Independent Agency System",
                "insurance",
                "peter van aartrijk",
                "Technology"
            ]
        }
    ]
}