{
    "artwork": "http://is3.mzstatic.com/image/thumb/Music71/v4/0e/d5/ed/0ed5edf2-b059-b4a1-b7fe-29fe5308cc7c/source/100x100bb.jpg",
    "description": "Author interviews that explore the latest clinical reviews.",
    "feedURL": "http://jamaclinicalreviews.jamanetwork.libsynpro.com/rss",
    "podcastURL": "http://jama.jamanetwork.com/journal.aspx",
    "title": "JAMA Clinical Reviews: Interviews about ideas & innovations in medicine, science & clinical practice. Listen & earn CME credit.",
    "episodes": [
        {
            "title": "Elevated Liver Function Tests Following Liver Transplant",
            "datePublished": "Tue, 10 Nov 2020 16:00:00 +0000",
            "description": "<p>There are hundreds of thousands of liver transplant patients, all of whom will be seen in general clinical practices. It is common for them to develop elevated liver enzymes--a potentially serious problem that may be a sign that the transplanted liver is failing. Traditionally, patients with these findings are sent to a liver transplant center for an inpatient workup. A new protocol facilitating management of most of these patients in routine outpatient clinics has been developed, greatly improving the efficiency of managing patients with this clinical problem. Fady Kaldas, MD, director of the Dumont-UCLA transplant center, discusses how to manage elevated liver function results in liver transplant patients on an outpatient basis.</p> <p>Related Article(s):</p> <p><a href= \"http://jamanetwork.com/journals/jama/fullarticle/10.1001/jama.2020.15919\"> Outpatient Management of Liver Function Test Abnormalities in Patients With a Liver Transplant</a></p>",
            "length": "16693909",
            "sourceUrl": "http://traffic.libsyn.com/jamaclinicalreviews/Elevated_Liver_Function_Tests_Following_Liver_Transplant.mp3?dest-id=274040"
        },
        {
            "title": "Using e-Cigarettes to Stop Smoking",
            "datePublished": "Tue, 10 Nov 2020 16:00:00 +0000",
            "description": "<p>Are e-cigarettes helpful or harmful as a tool to help people stop smoking? Mark J. Eisenberg, MD, MPH, from the Jewish General Hospital and McGill University in Montreal, Canada, discuss a recent clinical trial he reported in the November 10, 2020, issue of JAMA examining the efficacy of e-cigarettes as a smoking cessation aid.</p> <p>Related Article:</p> <p><a href= \"http://jamanetwork.com/journals/jama/fullarticle/10.1001/jama.2020.18889\"> Effect of e-Cigarettes Plus Counseling vs Counseling Alone on Smoking Cessation</a></p>",
            "length": "24975187",
            "sourceUrl": "http://traffic.libsyn.com/jamaclinicalreviews/Using_e-Cigarettes_to_Stop_Smoking.mp3?dest-id=274040"
        },
        {
            "title": "New Recommendations for How Often to Repeat Colonoscopy Following Polypectomy",
            "datePublished": "Fri, 06 Nov 2020 16:00:00 +0000",
            "description": "<p>A new multisociety guideline was recently released suggesting that for many patients, the interval between colonoscopies following polyp resection is less than previously recommended. Cecelia Zhang, MD, Duke University, and Maylyn Martinez, MD, University of Chicago, discuss the new guideline.</p> <p>Related Article:</p> <p><a href= \"http://jamanetwork.com/journals/jama/fullarticle/10.1001/jama.2020.15001\"> Recommendations for Follow-up Colonoscopy After Polypectomy</a></p>",
            "length": "15519903",
            "sourceUrl": "http://traffic.libsyn.com/jamaclinicalreviews/New_Recommendations_for_How_Often_to_Repeat_Colonoscopy_Following_Polypectomy.mp3?dest-id=274040"
        },
        {
            "title": "The Effect of COVID-19 on the 2020-2021 Influenza Season",
            "datePublished": "Mon, 02 Nov 2020 16:00:00 +0000",
            "description": "<p>Tim Uyeki, MD, chief medical officer for the Influenza Division, National Center for Immunization and Respiratory Diseases, Centers for Disease Control and Prevention (CDC), discusses how the COVID-19 pandemic may affect the 2020-2021 influenza season.</p> <p>Related Article(s):</p> <p><a href= \"http://jamanetwork.com/journals/jama/fullarticle/10.1001/jama.2020.21849\"> Preparing for the 2020-2021 Influenza Season</a></p>",
            "length": "30952347",
            "sourceUrl": "http://traffic.libsyn.com/jamaclinicalreviews/The_Effect_of_COVID-19_on_the_2020-2021_Influenza_Season.mp3?dest-id=274040"
        },
        {
            "title": "Ticagrelor or Clopidogrel for Antiplatelet Therapy After Percutaneous Intervention for Acute Coronary Syndrome?",
            "datePublished": "Tue, 27 Oct 2020 15:00:00 +0000",
            "description": "<p>The Platelet Inhibition and Patient Outcomes (PLATO) trial showed that ticagrelor had better outcomes than clopidogrel for avoiding thrombotic complications following acute coronary syndrome. Subsequent trials suggested that the outcomes for the drugs were about the same. The effects of ticagrelor and clopidogrel were examined in a very large observational study performed by Harlan Krumholz, MD, and colleagues, published in the October 27, 2020, issue of JAMA. Dr Krumholz explains how his study was performed and what it showed.</p> <p>Related Article:</p> <p><a href= \"http://jamanetwork.com/journals/jama/fullarticle/10.1001/jama.2020.16167\"> Association of Ticagrelor vs Clopidogrel With Net Adverse Clinical Events in Patients With Acute Coronary Syndrome Undergoing Percutaneous Coronary Intervention</a></p> <p><a href=\"http://ohdsi.org\">ohdsi.org</a></p>",
            "length": "28556823",
            "sourceUrl": "http://traffic.libsyn.com/jamaclinicalreviews/Ticagrelor_or_Clopidogrel_for_Antiplatelet_Therapy_After_Percutaneous_Intervention_for_Acute_Coronary_Syndrome_.mp3?dest-id=274040"
        },
        {
            "title": "Can We Count on Herd Immunity to Control COVID-19?",
            "datePublished": "Mon, 19 Oct 2020 15:00:00 +0000",
            "description": "<p>Many people are hoping that enough people develop resistance to COVID-19, either from being exposed to the disease or from vaccination, to develop herd immunity that will enable society to return to normal. But will that happen? Saad Omer, MD, from the Yale Institute for Global Health, discusses his JAMA article on herd immunity and how much we can count on having it to return society to normal from this COVID-19 pandemic.</p> <p>Related Article(s):</p> <p><a href= \"http://jamanetwork.com/journals/jama/fullarticle/10.1001/jama.2020.20892\"> Herd Immunity and Implications for SARS-CoV-2 Control</a></p>",
            "length": "15664067",
            "sourceUrl": "http://traffic.libsyn.com/jamaclinicalreviews/Can_We_Count_on_Herd_Immunity_to_Control_COVID-19_.mp3?dest-id=274040"
        },
        {
            "title": "Ten Things Every New Doctor Should Know About Drug Reactions",
            "datePublished": "Tue, 13 Oct 2020 15:00:00 +0000",
            "description": "<p>David Juurlink, MD, PhD, a clinical pharmacologist and professor of internal medicine at Sunnybrook Health Sciences Centre and professor of medicine at the University of Toronto, discusses 10 things new doctors should know about drugs and thir complications as they start practicing medications in the the fourth and final episode of this series.</p>",
            "length": "30387737",
            "sourceUrl": "http://traffic.libsyn.com/jamaclinicalreviews/Ten_Things_Every_New_Doctor_Should_Know_About_Drug_Reactions.mp3?dest-id=274040"
        },
        {
            "title": "Coping With Death",
            "datePublished": "Tue, 06 Oct 2020 15:00:00 +0000",
            "description": "<p>One of the most important things clinicians can do is help patients and their families deal with impending death. Despite its importance, this part of medical care is hardly covered in medical training. Clinicians have to learn this on their own. One of the most powerful ways to find out what it’s like is to go through it yourself. Martin F. Shapiro, MD, professor of medicine at the Weill Cornell School of Medicine, describes along with his sister, Lori Shapiro, what they went through in dealing with their mother’s death. Dr Shapiro relates what he learned to more effectively manage his patients and their families in coping with the end of life.</p> <p>Related Article(s):</p> <p><a href= \"http://jamanetwork.com/journals/jamainternalmedicine/fullarticle/10.1001/jamainternmed.2019.1451\"> The Last Breath—Enriching End-of-Life Moments</a></p>",
            "length": "30471333",
            "sourceUrl": "http://traffic.libsyn.com/jamaclinicalreviews/Coping_With_Death.mp3?dest-id=274040"
        },
        {
            "title": "Sweden and COVID-19",
            "datePublished": "Fri, 02 Oct 2020 15:00:00 +0000",
            "description": "<p>Sweden’s response to the COVID-19 pandemic differed from its neighbors in Europe. Lockdowns were minimized with the belief that they would be more damaging than the virus itself. Much criticism was levied at the country regarding these policies. Anders Tegnell, MD, is the head of the Department of Public Health Analysis and Data Management, Deputy Director General at the Public Health Agency of Sweden, and had been Sweden's state epidemiologist since 2013. He discusses what Sweden did in response to COVID-19 and what their outcomes were.</p> <p>Related Article:</p> <p><a href= \"http://jamanetwork.com/journals/jama/fullarticle/10.1001/jama.2020.8051\"> COVID-19 and Health Equity—A New Kind of “Herd Immunity”</a></p>",
            "length": "10934209",
            "sourceUrl": "http://traffic.libsyn.com/jamaclinicalreviews/Sweden_and_COVID-19.mp3?dest-id=274040"
        },
        {
            "title": "Updated Guidelines for the Treatment of Community-Acquired Pneumonia",
            "datePublished": "Thu, 01 Oct 2020 15:00:00 +0000",
            "description": "<p>In the 13 years since the American Thoracic Society and Infectious Diseases Society of America have issued guidelines for the treatment of community-acquired pneumonia much has changed, resulting in a new guideline with 16 major recommendations. These are reviewed by Maylyn Martinez, MD, from the Department of Medicine at the University of Chicago and JAMA Network Open Associate Editor Angel Desai, MD, from the Department of Medicine at the University of California at Davis.</p> <p>Related Article:</p> <p><a href= \"http://jamanetwork.com/journals/jama/fullarticle/10.1001/jama.2019.21118\"> Diagnosis and Treatment of Adults With Community-Acquired Pneumonia</a></p>",
            "length": "13059533",
            "sourceUrl": "http://traffic.libsyn.com/jamaclinicalreviews/Updated_Guidelines_for_the_Treatment_of_Community-Acquired_Pneumonia.mp3?dest-id=274040"
        },
        {
            "title": "Intimate Partner Violence",
            "datePublished": "Tue, 22 Sep 2020 15:00:00 +0000",
            "description": "<p>Intimate partner violence--also known as domestic abuse--may affect as many as 1 in 3 women. It’s often underreported but that shouldn’t be the case. Harriet L. MacMillan, MD, from the Departments of Psychiatry & Behavioral Neurosciences and Pediatrics at McMaster University, discusses how to identify and intervene in intimate partner violence.</p> <p>Related Article(s):</p> <p><a href= \"http://jamanetwork.com/journals/jama/fullarticle/10.1001/jama.2020.11322\"> Intimate Partner Violence</a></p>",
            "length": "36405766",
            "sourceUrl": "http://traffic.libsyn.com/jamaclinicalreviews/Intimate_Partner_Violence.mp3?dest-id=274040"
        },
        {
            "title": "Failing the Boards—What Happens When the Board Fails Itself?",
            "datePublished": "Tue, 15 Sep 2020 15:00:00 +0000",
            "description": "<p>When trying to administer its qualifying examination during the COVID-19 shutdowns, the American Board of Surgery failed. Jo Buyske, MD, president and chief executive officer of the American Board of Surgery, discusses what went wrong and what they are doing to fix it.</p> <p>Related Article:</p> <p><a href= \"http://jamanetwork.com/journals/jamasurgery/fullarticle/10.1001/jamasurg.2019.4464\"> Association Between Resident Physician Training Experience and Program-Level Performance on Board Examinations</a></p>",
            "length": "46564693",
            "sourceUrl": "http://traffic.libsyn.com/jamaclinicalreviews/Failing_the_BoardsWhat_Happens_When_the_Board_Fails_Itself_.mp3?dest-id=274040"
        },
        {
            "title": "Treating Obstructive Sleep Apnea",
            "datePublished": "Fri, 04 Sep 2020 15:00:00 +0000",
            "description": "<p>A new clinical trial suggests that obstructive sleep apnea (in patients unable to tolerate treatment with CPAP or other devices) can be treated with airway surgery. The author of the study published in JAMA, Stuart MacKay, MBBS, from the University of Wollongong, Australia, discusses the study and treatments for obstructive sleep apnea.</p> <p>Related Article:</p> <p><a href= \"http://jamanetwork.com/journals/jama/fullarticle/10.1001/jama.2020.14265\"> Effect of Multilevel Upper Airway Surgery vs Medical Management on the Apnea-Hypopnea Index and Patient-Reported Daytime Sleepiness Among Patients With Moderate or Severe Obstructive Sleep Apnea</a></p>",
            "length": "17861485",
            "sourceUrl": "http://traffic.libsyn.com/jamaclinicalreviews/Treating_Obstructive_Sleep_Apnea.mp3?dest-id=274040"
        },
        {
            "title": "Understanding Stepped-Wedge Clinical Trials",
            "datePublished": "Thu, 03 Sep 2020 15:00:00 +0000",
            "description": "<p>Cluster randomized trials are performed when an intervention must be delivered to a group of patients like when testing new nursing protocols on award or different means for cleaning beds on a ward. One type of cluster trials is called a stepped-wedge where every cluster in the study ultimately undergoes the intervention. How this works it is explained by Susan Ellenberg, PhD, from the Department of Biostatistics, Epidemiology, and Informatics at the University of Pennsylvania School of Medicine.</p> <p>Related Article:</p> <p><a href= \"http://jamanetwork.com/journals/jama/fullarticle/10.1001/jama.2017.21993\"> The Stepped-Wedge Clinical Trial</a></p>",
            "length": "18274314",
            "sourceUrl": "http://traffic.libsyn.com/jamaclinicalreviews/Understanding_Stepped-Wedge_Clinical_Trials.mp3?dest-id=274040"
        },
        {
            "title": "What Is It Like to Have COVID-19?",
            "datePublished": "Tue, 01 Sep 2020 15:00:00 +0000",
            "description": "<p>COVID-19 continues to rapidly spread throughout the world. In the past few months, the population affected by the disease has shifted from older to younger patients. Public health officials are concerned that younger people seem not to be very compliant with recommendations regarding masking and social distancing. It is believed that younger people think that the adverse consequences of the disease occur in the elderly and not in them. Garrett Salzman, MD, is a resident physician at UCLA and contracted the disease. He is young and healthy, but he has had substantial disability from COVID-19. He tells a cautionary tale of his experience with COVID-19 that this is not a benign disease in young people, that they need to be careful.</p> <p>Related Article:</p> <p><a href= \"http://jamanetwork.com/journals/jama/fullarticle/10.1001/jama.2020.8911\"> Potential Implications of COVID-19 for the 2020-2021 Residency Application Cycle</a></p>",
            "length": "19329912",
            "sourceUrl": "http://traffic.libsyn.com/jamaclinicalreviews/What_Is_It_Like_to_Have_COVID-19_.mp3?dest-id=274040"
        },
        {
            "title": "Update on Bariatric Surgery—2020",
            "datePublished": "Tue, 01 Sep 2020 15:00:00 +0000",
            "description": "<p>Bariatric surgery is unequivocally the most effective means for inducing weight loss and managing diabetes for obese patients. There are numerous other benefits for these operations including improved long-term cardiovascular outcomes. David Arterburn, MD, MPH, a senior investigator from the Kaiser Permanente Washington Health Research Institute, discusses bariatric surgery outcomes.</p> <p>Related Article(s):</p> <p><a href= \"http://jamanetwork.com/journals/jama/fullarticle/10.1001/jama.2020.12567\"> Benefits and Risks of Bariatric Surgery in Adults</a></p>",
            "length": "25733002",
            "sourceUrl": "http://traffic.libsyn.com/jamaclinicalreviews/Update_on_Bariatric_Surgery2020.mp3?dest-id=274040"
        },
        {
            "title": "Update on Ulcerative Colitis—2020",
            "datePublished": "Thu, 27 Aug 2020 15:00:00 +0000",
            "description": "<p>The new American College of Gastroenterology guideline on ulcerative colitis is discussed by one of its authors, David T. Rubin, MD, from the Inflammatory Bowel Disease Center at the University of Chicago, and Maylyn Martinez, MD, also from the University of Chicago.</p> <p>Related Article(s):</p> <p><a href= \"http://jamanetwork.com/journals/jama/fullarticle/10.1001/jama.2020.11583\"> Ulcerative Colitis in Adults</a></p>",
            "length": "22995833",
            "sourceUrl": "http://traffic.libsyn.com/jamaclinicalreviews/Update_on_Ulcerative_Colitis2020.mp3?dest-id=274040"
        },
        {
            "title": "Managing Acute Pancreatitis",
            "datePublished": "Tue, 25 Aug 2020 15:00:00 +0000",
            "description": "<p>Acute pancreatitis can be a devastating disease. Complications of pancreatitis can be minimized by appropriate early, initial management. Joe Hines, MD, and Raman Muthusamy, MD, from UCLA discuss the recent American Gastroenterological Association guideline on managing acute pancreatitis.</p> <p>Related Article(s):</p> <p><a href= \"http://jamanetwork.com/journals/jama/fullarticle/10.1001/jama.2020.2177\"> Initial Management of Acute Pancreatitis</a></p>",
            "length": "12954778",
            "sourceUrl": "http://traffic.libsyn.com/jamaclinicalreviews/Managing_Acute_Pancreatitis.mp3?dest-id=274040"
        },
        {
            "title": "A Physician Gets Cancer",
            "datePublished": "Tue, 18 Aug 2020 15:00:00 +0000",
            "description": "<p>Patients with serious disease fear the unknown. A physician with a serious disease knows the potential outcomes, making it far more difficult to cope. How does a physician react to developing cancer? Adam Stern, MD, an assistant professor of Psychiatry at Harvard Medical School, developed metastatic renal cell carcinoma when he was just 33 years old. He wrote about his experiences as a cancer patient in a Piece of My Mind article in the March 3, 2020, issue of JAMA and spoke about this to JAMA Clinical Reviews.</p> <p>Related Article(s):</p> <p><a href= \"http://jamanetwork.com/journals/jama/fullarticle/10.1001/jama.2020.1033\"> The Secret About Achieving Your Dreams</a></p>",
            "length": "32894299",
            "sourceUrl": "http://traffic.libsyn.com/jamaclinicalreviews/A_Physician_Gets_Cancer.mp3?dest-id=274040"
        },
        {
            "title": "The Consequences of Not Vaccinating for Measles",
            "datePublished": "Fri, 14 Aug 2020 15:00:00 +0000",
            "description": "<p>Before COVID-19, even though most children got vaccinated for measles, too many did not, resulting in worsening outbreaks of measles. People forgot how bad a disease measles is and became lax about getting their children vaccinated. Now in the COVID-19 era everyone is aware of what an out-of-control infectious disease can do and we are all anxiously awaiting a COVID-19 vaccine. Will this experience help encourage parents to get their children vaccinated? We discussed the problems of an adequate measles vaccination with Dr. Saad Omer, PhD, from the Yale Institute for Global Health at Yale University in New Haven, Connecticut.</p> <p>Related Article(s):</p> <p><a href= \"http://jamanetwork.com/journals/jama/fullarticle/10.1001/jama.2020.14828\"> Vaccine Refusal and Measles Outbreaks in the US</a></p>",
            "length": "19479774",
            "sourceUrl": "http://traffic.libsyn.com/jamaclinicalreviews/The_Consequences_of_Not_Vaccinating_for_Measles.mp3?dest-id=274040"
        },
        {
            "title": "The Intersection Between Flu and COVID-19",
            "datePublished": "Fri, 14 Aug 2020 15:00:00 +0000",
            "description": "<p>As the COVID-19 pandemic continues to spread throughout the world, flu season is almost upon us. This is concerning because there will be an overlap between flu and COVID-19 and patients could get both diseases. Daniel Solomon, MD, from the Division of Infectious Diseases at the Brigham and Women’s Hospital of the Harvard Medical School in Boston, discusses COVID-19 and how the flu might pan out this year.</p> <p>Related Article:</p> <p><a href= \"http://jamanetwork.com/journals/jama/fullarticle/10.1001/jama.2020.14661\"> Influenza in the COVID-19 Era</a></p>",
            "length": "15520427",
            "sourceUrl": "http://traffic.libsyn.com/jamaclinicalreviews/The_Intersection_Between_Flu_and_COVID-19.mp3?dest-id=274040"
        },
        {
            "title": "How to Reopen Schools in the COVID-19 Era",
            "datePublished": "Thu, 13 Aug 2020 15:00:00 +0000",
            "description": "<p>One of the most contentious issues relating to COVID-19 is when to reopen schools. This is a complicated matter because placing people in close quarters risks spread of the disease. Yet children being at home makes it difficult for their working parents to manage their affairs and can potentially affect the learning experience. JAMA Associate Editor Preeti Malani, MD, chief health officer for the University of Michigan, discusses school reopening and how the University of Michigan is addressing this problem.</p> <p>Related Article:</p> <p><a href= \"http://jamanetwork.com/journals/jama/fullarticle/10.1001/jama.2020.14348\"> Association Between Statewide School Closure and COVID-19 Incidence and Mortality in the US</a></p>",
            "length": "9864740",
            "sourceUrl": "http://traffic.libsyn.com/jamaclinicalreviews/How_to_Reopen_Schools_in_the_COVID-19_Era.mp3?dest-id=274040"
        },
        {
            "title": "Why Are We Still Talking About Hydroxychloroquine as a Treatment for COVID-19?",
            "datePublished": "Thu, 13 Aug 2020 15:00:00 +0000",
            "description": "<p>The use of hydroxychloroquine as a treatment for COVID-19 serves as an example of what is wrong with medical information being widely disseminated before it is thoroughly vetted by peer review. Preliminary studies of this treatment modality were spread widely, creating false hope that a treatment for COVID-19 existed. Several randomized trials have shown that hydroxychloroquine is not an effective therapy for COVID-19.</p> <p>David Juurlink, MD, PhD, from the University of Toronto summarizes the evidence base regarding hydroxychloroquine and COVID-19.</p> <p>Related Article(s):</p> <p><a href= \"http://jamanetwork.com/journals/jama/fullarticle/10.1001/jama.2020.12839\"> Pathophysiology, Transmission, Diagnosis, and Treatment of Coronavirus Disease 2019 (COVID-19)</a></p>",
            "length": "12642342",
            "sourceUrl": "http://traffic.libsyn.com/jamaclinicalreviews/Why_Are_We_Still_Talking_About_Hydroxychloroquine_as_a_Treatment_for_COVID-19_.mp3?dest-id=274040"
        },
        {
            "title": "A Patient’s Perspective on Nonoperative Treatment of Appendicitis",
            "datePublished": "Tue, 11 Aug 2020 15:00:00 +0000",
            "description": "<p>A major study recently published in JAMA showed that many children who have appendicitis do not need surgery and, if they undergo surgery, may have more disability than if they were treated with antibiotics alone. JAMA Clinical Reviews spoke with a patient in the study whose mother happens to be JAMA Associate Editor Preeti Malani, MD, JAMA’s infectious diseases editor and chief health officer for the University of Michigan. This patient initially was treated with antibiotics, later required appendectomy, and discussed the difficulties he experienced following laparoscopic appendectomy.</p> <p>Related Article:</p> <p><a href= \"http://jamanetwork.com/journals/jama/fullarticle/10.1001/jama.2020.10888\"> Association of Nonoperative Management Using Antibiotic Therapy vs Laparoscopic Appendectomy With Treatment Success and Disability Days in Children With Uncomplicated Appendicitis</a></p>",
            "length": "14043656",
            "sourceUrl": "http://traffic.libsyn.com/jamaclinicalreviews/A_Patient_s_Perspective_on_Nonoperative_Treatment_of_Appendicitis.mp3?dest-id=274040"
        },
        {
            "title": "Updated Pulmonary Embolism Guidelines",
            "datePublished": "Tue, 11 Aug 2020 15:00:00 +0000",
            "description": "<p>The European Society of Cardiology updated its guidelines for pulmonary embolism in 2019. Jonathan Paul, MD, from the University of Chicago discusses what is new in the management of pulmonary embolism based on his August 11, 2020, JAMA Guidelines Synopsis article.</p> <p>Related Article(s):</p> <p><a href= \"http://jamanetwork.com/journals/jama/fullarticle/10.1001/jama.2020.3905\"> Management of Acute Pulmonary Embolism</a></p>",
            "length": "21230835",
            "sourceUrl": "http://traffic.libsyn.com/jamaclinicalreviews/Updated_Pulmonary_Embolism_Guidelines.mp3?dest-id=274040"
        },
        {
            "title": "The Importance of Minimal Clinically Important Differences in Research Studies",
            "datePublished": "Thu, 06 Aug 2020 15:00:00 +0000",
            "description": "<p>Before a study is carried out, it is important to define what is an important difference between groups. This is often not done correctly. Anna McGlothlin, PhD, from Berry Consultants discusses how to assess the minimal clinically important difference in research studies.</p>",
            "length": "13269654",
            "sourceUrl": "http://traffic.libsyn.com/jamaclinicalreviews/Understanding_Pragmatic_TrialsA_JAMA_Stats_Brief.mp3?dest-id=274040"
        },
        {
            "title": "Update on Dexamethasone for the Treatment of COVID-19",
            "datePublished": "Wed, 05 Aug 2020 15:00:00 +0000",
            "description": "<p>Few treatments have proven to be effective for treating COVID-19. Recently, a clinical trial reporting the results of dexamethasone for treating COVID-19 was published and has received a great deal of attention in the popular media. Greg Curfman, MD, JAMA Deputy Editor, reviews the study and discusses what the findings do or do not reveal about the efficacy of dexamethasone for treating COVID-19.</p> <p>Related Article(s):</p> <p><a href= \"http://jamanetwork.com/journals/jama/fullarticle/10.1001/jama.2020.11932\"> Missed Opportunities on Emergency Remdesivir Use</a></p>",
            "length": "12485663",
            "sourceUrl": "http://traffic.libsyn.com/jamaclinicalreviews/Update_on_Dexamethasone_for_the_Treatment_of_COVID-19.mp3?dest-id=274040"
        },
        {
            "title": "Update on Congestive Heart Failure",
            "datePublished": "Tue, 04 Aug 2020 15:00:00 +0000",
            "description": "<p>Congestive heart failure is common and can have devastating effects on patients' quality of life. Until recently few treatments were available, but that has changed. Congestive heart failure management has substantially improved. Hutter Family Professor of Medicine at Harvard Medical School James L. Januzzi Jr, MD, reviews the diagnosis and treatment of congestive heart failure.</p> <p>Related Article(s):</p> <p><a href= \"http://jamanetwork.com/journals/jama/fullarticle/10.1001/jama.2020.10262\"> Heart Failure With Reduced Ejection Fraction</a></p>",
            "length": "21485694",
            "sourceUrl": "http://traffic.libsyn.com/jamaclinicalreviews/Update_on_Congestive_Heart_Failure.mp3?dest-id=274040"
        },
        {
            "title": "Treating Pediatric Appendicitis Nonoperatively",
            "datePublished": "Mon, 27 Jul 2020 15:00:00 +0000",
            "description": "<p>Accumulating evidence in adults has shown that nonoperative treatment of appendicitis is an acceptable means for treatment. A recent prospective study published in JAMA has shown the same is true for children. Most children who are treated with antibiotics instead of surgery for appendicitis do just fine. The lead author for this study, Peter Minneci, MD, from the Nationwide Children’s Hospital of the Ohio State Medical School, discusses his work in investigating alternative ways to treat appendicitis.</p> <p>Related Article:</p> <p><a href= \"http://jamanetwork.com/journals/jama/fullarticle/10.1001/jama.2020.10888\"> Association of Nonoperative Management Using Antibiotic Therapy vs Laparoscopic Appendectomy With Treatment Success and Disability Days in Children With Uncomplicated Appendicitis</a></p>",
            "length": "22119044",
            "sourceUrl": "http://traffic.libsyn.com/jamaclinicalreviews/Treating_Pediatric_Appendicitis_Nonoperatively.mp3?dest-id=274040"
        },
        {
            "title": "Perioperative Risk Assessment",
            "datePublished": "Tue, 21 Jul 2020 15:00:00 +0000",
            "description": "<p>Jeffrey Berger, MD, from the Center for the Prevention of Cardiovascular Disease at the New York University School of Medicine, explains the ins and outs of perioperative cardiovascular risk assessment and management for noncardiac surgery.</p> <p>Related Article(s):</p> <p><a href= \"http://jamanetwork.com/journals/jama/fullarticle/10.1001/jama.2020.7840\"> Perioperative Cardiovascular Risk Assessment and Management for Noncardiac Surgery</a></p>",
            "length": "37075683",
            "sourceUrl": "http://traffic.libsyn.com/jamaclinicalreviews/Perioperative_Risk_Assessment.mp3?dest-id=274040"
        },
        {
            "title": "Drug Treatment for Primary Prevention of Breast Cancer",
            "datePublished": "Tue, 21 Jul 2020 15:00:00 +0000",
            "description": "<p>Some of the nearly 40 000 deaths each year in the US from breast cancer might be avoided through use of medications to prevent breast cancer in high-risk women. Patricia Ganz, MD, Distinguished Professor of Medicine and Public Health at UCLA, reviews the evidence underlying chemoprevention of breast cancer and which women might benefit from the drugs.</p> <p>Related Article(s):</p> <p><a href= \"http://jamanetwork.com/journals/jama/fullarticle/10.1001/jama.2020.9246\"> Medications for Primary Prevention of Breast Cancer</a></p> <p>Breast Cancer Risk Calculators:</p> <p><a href=\"https://bcrisktool.cancer.gov/calculator.html\" target= \"_blank\" rel= \"nofollow noopener noreferrer\">https://bcrisktool.cancer.gov/calculator.html</a><br />  <a href=\"https://tools.bcsc-scc.org/BC5yearRisk/intro.htm\" target= \"_blank\" rel= \"nofollow noopener noreferrer\">https://tools.bcsc-scc.org/BC5yearRisk/intro.htm</a><br />  <a href=\"https://ibis.ikonopedia.com/\" target=\"_blank\" rel= \"nofollow noopener noreferrer\">https://ibis.ikonopedia.com/</a></p> <p> </p>",
            "length": "30503113",
            "sourceUrl": "http://traffic.libsyn.com/jamaclinicalreviews/Drug_Treatment_for_Primary_Prevention_of_Breast_Cancer.mp3?dest-id=274040"
        },
        {
            "title": "Remdesivir and Dexamethasone for the Treatment of COVID-19",
            "datePublished": "Mon, 20 Jul 2020 15:00:00 +0000",
            "description": "<p>Both remdesivir and dexamethasone have been promoted as effective treatments for COVID-19. JAMA Deputy Editor Greg Curfman, MD, and Professor Rachel Sachs, JD, from the Washington University School of Law discuss the science and health policy aspects of these COVID-19 treatments.</p> <p>Related Article(s):</p> <p><a href= \"http://jamanetwork.com/journals/jama/fullarticle/10.1001/jama.2020.11932\"> Missed Opportunities on Emergency Remdesivir Use</a></p>",
            "length": "35128044",
            "sourceUrl": "http://traffic.libsyn.com/jamaclinicalreviews/Remdesivir_and_Dexamethasone_for_the_Treatment_of_COVID-19.mp3?dest-id=274040"
        },
        {
            "title": "How Is COVID-19 Transmitted?",
            "datePublished": "Mon, 13 Jul 2020 15:00:00 +0000",
            "description": "<p>Whether the SARS-CoV-2 virus is transmitted by droplets or aerosol influences which public health interventions might slow its spread. Michael Klompas, MD, professor of medicine at Harvard Medical School, explains evidence to date about mechanisms of coronavirus transmission and implications for pandemic containment and mitigation efforts.</p> <p>Related:</p> <p><a href= \"http://jamanetwork.com/journals/jama/fullarticle/10.1001/jama.2020.12458\"> Airborne Transmission of SARS-CoV-2: Theoretical Considerations and Available Evidence</a></p>",
            "length": "24609836",
            "sourceUrl": "http://traffic.libsyn.com/jamaclinicalreviews/How_Is_COVID-19_Transmitted_.mp3?dest-id=274040"
        },
        {
            "title": "Complications From SSRIs",
            "datePublished": "Fri, 10 Jul 2020 15:00:00 +0000",
            "description": "<p>SSRIs are a commonly used medication. Although complications from them are not common because so many people take these medications, physicians will inevitably see problems such as dependence and withdrawal, hyponatremia, bleeding disorders, and even the uncommon but severe SSRI syndrome. To learn about these potential complications, we spoke with David Juurlink, MD, PhD, an internist and clinical pharmacologist at the University of Toronto.</p>",
            "length": "11739507",
            "sourceUrl": "http://traffic.libsyn.com/jamaclinicalreviews/Complications_From_SSRIs.mp3?dest-id=274040"
        },
        {
            "title": "Acute Kidney Injury Caused by Proton Pump Inhibitors",
            "datePublished": "Wed, 08 Jul 2020 15:00:00 +0000",
            "description": "<p>Proton pump inhibitors are among the most commonly used medicines by patients. They’re generally safe, but they can cause acute kidney injury, and it’s important for clinicians to be aware of this potential complication. David Juurlink, MD, PhD, internist and clinical pharmacologist from the University of Toronto, discusses this important potential complication.</p> <p>Related Article: </p> <p><a href= \"https://jamanetwork.com/journals/jama/fullarticle/10.1001/jamasurg.2015.4233\"> An Evidence-Based Approach to the Treatment of Gastroesophageal Reflux Disease</a></p>",
            "length": "9186240",
            "sourceUrl": "http://traffic.libsyn.com/jamaclinicalreviews/Acute_Kidney_Injury_Caused_by_Proton_Pump_Inhibitors.mp3?dest-id=274040"
        },
        {
            "title": "Diagnosis and Management of Amyloidosis",
            "datePublished": "Tue, 07 Jul 2020 15:00:00 +0000",
            "description": "<p>Although there are only about 4000 new cases of amyloidosis in the US per year, it can cause preserved ejection fraction heart failure, kidney and liver failure, and neuropathy. Amyloidosis is easily diagnosed and treatable, and it should be considered in the differential diagnosis for these diseases. Morie A. Gertz, MD, from the Mayo Clinic in Rochester, Minnesota, talks with JAMA Clinical Reviews about amyloidosis.</p> <p>Related:</p> <p><a href= \"https://jamanetwork.com/journals/jama/fullarticle/10.1001/jama.2020.5493\"> Systemic Amyloidosis Recognition, Prognosis, and Therapy</a></p>",
            "length": "27615963",
            "sourceUrl": "http://traffic.libsyn.com/jamaclinicalreviews/Diagnosis_and_Management_of_Amyloidosis.mp3?dest-id=274040"
        },
        {
            "title": "A Clinical Pharmacologist's Perspective on Penicillin Allergy",
            "datePublished": "Mon, 06 Jul 2020 15:00:00 +0000",
            "description": "<p>Although frequently reported, penicillin allergy is actually uncommon. Penicillins are very effective against a wide variety of infections, and when they can't be used, problems arise. We discussed the problem of penicillin allergy with David Juurlink, MD, PhD, internist and clinical pharmacologist from the University of Toronto.</p> <p>Related Article(s):</p> <p><a href= \"http://jamanetwork.com/journals/jama/fullarticle/10.1001/jama.2018.19283\"> Evaluation and Management of Penicillin Allergy</a></p>",
            "length": "17817486",
            "sourceUrl": "http://traffic.libsyn.com/jamaclinicalreviews/A_Clinical_Pharmacologists_Perspective_on_Penicillin_Allergy.mp3?dest-id=274040"
        },
        {
            "title": "Sample Size Calculation for a Hypothesis Test",
            "datePublished": "Thu, 02 Jul 2020 15:00:00 +0000",
            "description": "<p>One of the most common causes for problems we see in manuscripts at JAMA is an inappropriately calculated study sample size. This seemingly mysterious process is explained by Lynne Stokes, PhD, professor of Statistical Science at Southern Methodist University in Dallas, Texas.</p>",
            "length": "11780114",
            "sourceUrl": "http://traffic.libsyn.com/jamaclinicalreviews/Sample_Size_Calculation_for_a_Hypothesis_Test.mp3?dest-id=274040"
        },
        {
            "title": "Understanding Pragmatic Trials",
            "datePublished": "Thu, 25 Jun 2020 15:00:00 +0000",
            "description": "<p>Generalizability of randomized trials is always limited because of the super-selectivity of the patients enrolled in these trials and the very controlled conditions in which clinical care is delivered. Pragmatic trials are performed in order to provide guidance for how to best deliver clinical care in situations that more closely resemble actual clinical scenarios. Hal Sox, MD, director of peer review for the Patient-Centered Outcomes Research Institute (PCORI), explains how these trials work and what clinical questions they answer.</p> <p>Related:</p> <p><a href= \"http://jamanetwork.com/journals/jama/fullarticle/10.1001/jama.2016.11409\"> Pragmatic Trials: Practical Answers to “Real-world” Questions</a></p>",
            "length": "21657202",
            "sourceUrl": "http://traffic.libsyn.com/jamaclinicalreviews/Understanding_Pragmatic_Trials.mp3?dest-id=274040"
        },
        {
            "title": "Overview of Depression",
            "datePublished": "Tue, 02 Jun 2020 15:00:00 +0000",
            "description": "<p>Nearly 10% of all patients seen in primary care have depression. Although usually mild, when depression is severe the consequences can be serious. Tom Garrick, MD, professor of Psychiatry at the University of Southern California, discusses the diagnosis and treatment of depression.</p> <p>Related:</p> <p><a href= \"http://jamanetwork.com/journals/jama/fullarticle/10.1001/jama.2020.3040\"> Drugs for Depression</a></p>",
            "length": "29917648",
            "sourceUrl": "http://traffic.libsyn.com/jamaclinicalreviews/Overview_of_Depression.mp3?dest-id=274040"
        },
        {
            "title": "The Effect of Hearing Loss on Cognitive Decline",
            "datePublished": "Tue, 19 May 2020 15:00:00 +0000",
            "description": "<p>Even limited hearing loss might be associated with cognitive decline. If true, early intervention with hearing aids might help people have better cognitive performance. Michael Johns III, MD, online editor for JAMA Otolaryngology, speaks with Justin Golub, MD, assistant professor of otolaryngology at Columbia University, whose research has shown that very mild hearing loss can be associated with cognitive disability.</p> <p><a href= \"https://jamanetwork.com/journals/jamaotolaryngology/fullarticle/10.1001/jamaoto.2019.3375\"> Related Article</a> </p>",
            "length": "18155902",
            "sourceUrl": "http://traffic.libsyn.com/jamaclinicalreviews/The_Effect_of_Hearing_Loss_on_Cognitive_Decline.mp3?dest-id=274040"
        },
        {
            "title": "My Father Was Murdered by Terrorists: Recollections of a Trauma Surgeon",
            "datePublished": "Tue, 05 May 2020 15:00:00 +0000",
            "description": "<p>When she was a teenager Melissa Red Hoffman's father was killed by terrorists. Dr Hoffman recalls her father's death and how that has influenced her career and how she can identify with patients and their families at the most difficult moments.</p> <p>Read the story:</p> <p><a href= \"http://jamanetwork.com/journals/jama/fullarticle/10.1001/jama.2020.3101\"> The Sound of Silence—When There Are No Words</a></p>",
            "length": "15573463",
            "sourceUrl": "http://traffic.libsyn.com/jamaclinicalreviews/My_Father_Was_Murdered_by_Terrorists__Recollections_of_a_Trauma_Surgeon.mp3?dest-id=274040"
        },
        {
            "title": "Coronavirus (COVID-19) Update: Ventilatory Management for COVID-Related Respiratory Failure",
            "datePublished": "Fri, 24 Apr 2020 15:00:00 +0000",
            "description": "<p>Management of COVID-19-related respiratory failure differs from what is necessary for ARDS. Rather than having alveolar edema, COVID-19 patients have pulmonary vascular dysregulation. Gas exchange is severely compromised with little reduction in lung compliance. Ventilatory support for COVID-19 patients requires higher than normal tidal volumes with minimal PEEP and allowance for higher than usual serum CO2 levels. How the unique pathophysiology of respiratory failure should be treated is discussed by John J. Marini, MD, professor of medicine at the University of Minnesota.</p>",
            "length": "25706918",
            "sourceUrl": "http://traffic.libsyn.com/jamaclinicalreviews/Coronavirus_COVID-19_Update__Ventilatory_Management_for_COVID-Related_Respiratory_Failure.mp3?dest-id=274040"
        },
        {
            "title": "Parkinson Disease Information for Patients",
            "datePublished": "Tue, 14 Apr 2020 15:00:00 +0000",
            "description": "<p>More than 6 million people worldwide have Parkinson disease. Even though it is classically associated with tremors, the disease has many manifestations and is very treatable for most patients. Michael S. Okun, MD, from the Department of Neurology at the University of Florida, Gainesville, discusses the pathophysiology, clinical presentation, diagnosis, and treatment of Parkinson disease.</p> <p>Related:</p> <p><a href= \"http://jamanetwork.com/journals/jama/fullarticle/10.1001/jama.2020.1224\"> Choosing a Parkinson Disease Treatment</a></p>",
            "length": "15054451",
            "sourceUrl": "http://traffic.libsyn.com/jamaclinicalreviews/Parkinson_Disease_Information_for_Patients.mp3?dest-id=274040"
        },
        {
            "title": "Coronavirus (COVID-19) Update: Reusing Face Masks and N95 Respirators",
            "datePublished": "Wed, 08 Apr 2020 15:00:00 +0000",
            "description": "<p>Shortages of face masks and N95 respirators have forced clinicians and hospitals to reuse these normally disposable items. Ron Shaffer, PhD, former CDC PPE Research Branch Chief, discusses effective sterilization techniques and how to test that the equipment stays protective after sterilization.</p>",
            "length": "38765697",
            "sourceUrl": "http://traffic.libsyn.com/jamaclinicalreviews/Coronavirus_COVID-19_Update__Reusing_Face_Masks_and_N95_Respirators.mp3?dest-id=274040"
        },
        {
            "title": "Treating Pediatric Eczema",
            "datePublished": "Tue, 07 Apr 2020 15:00:00 +0000",
            "description": "<p>Eczema is extremely common in children. Most the time it is easily treated with topical steroids but on occasion it requires systemic therapies. <em>JAMA Pediatrics</em> Editor Dimitri Christakis, MD, MPH, and <em>JAMA Network Open</em> Editor Frederick Rivara, MD, MPH, discuss the results of a clinical trial of a new monoclonal antibody intended to improve eczema in children that was published in the January 2020 issue of <em>JAMA Pediatrics</em>.</p> <p>Related:</p> <p><a href= \"http://jamanetwork.com/journals/jama/fullarticle/10.1001/jama.2018.12334\"> Are Bacteria Transplants the Future of Eczema Therapy?</a></p> <p><a href= \"http://jamanetwork.com/journals/jamapediatrics/fullarticle/10.1001/jamapediatrics.2017.4064\"> Effect of an Intervention to Promote Breastfeeding on Asthma, Lung Function, and Atopic Eczema at Age 16 Years: Follow-up of the PROBIT Randomized Trial</a></p> <p><a href= \"http://jamanetwork.com/journals/jamadermatology/fullarticle/10.1001/jamadermatol.2013.10267\"> Persistence of Childhood Eczema Into Adulthood</a></p> <p><a href= \"http://jamanetwork.com/journals/jamadermatology/fullarticle/10.1001/jamadermatol.2014.3432\"> Association Between Eczema and Stature in 9 US Population-Based Studies</a></p> <p><a href= \"http://jamanetwork.com/journals/jamadermatology/fullarticle/10.1001/jamadermatol.2014.5432\"> Healthcare Utilization, Patient Costs, and Access to Care in US Adults With Eczema: A Population-Based Study</a></p> <p><a href= \"http://jamanetwork.com/journals/jama/fullarticle/10.1001/jama.2016.1459\"> Management of Atopic Dermatitis</a></p> <p><a href= \"http://jamanetwork.com/journals/jama/fullarticle/10.1001/jama.2020.1007\"> Anti-IgE Medication Lessens Pediatric Atopic Dermatitis Severity</a></p> <p><a href= \"http://jamanetwork.com/journals/jama/fullarticle/10.1001/jama.2013.280498\"> Atopic Eczema</a></p>",
            "length": "7121287",
            "sourceUrl": "http://traffic.libsyn.com/jamaclinicalreviews/Treating_Pediatric_Eczema.mp3?dest-id=274040"
        },
        {
            "title": "Coronavirus (COVID-19) Update: Safe Shopping at Stores and Pharmacies",
            "datePublished": "Fri, 03 Apr 2020 15:00:00 +0000",
            "description": "<p>Food and medicine shopping is essential during the COVID-19 pandemic, but requires getting out and standing close to strangers at a time when social distancing and sheltering-in-place are recommended to slow spread of disease. David Aronoff, MD, director of the Division of Infectious Diseases at Vanderbilt University in Nashville, explains how to minimize COVID-19 risk while shopping.</p>",
            "length": "18498633",
            "sourceUrl": "http://traffic.libsyn.com/jamaclinicalreviews/Coronavirus_COVID-19_Update__Safe_Shopping_at_Stores_and_Pharmacies.mp3?dest-id=274040"
        },
        {
            "title": "Coronavirus Disease 2019 (COVID-19) Update: PCR Testing and Shortages",
            "datePublished": "Fri, 27 Mar 2020 20:00:00 +0000",
            "description": "<p>The lack of availability of COVID-19 testing has interfered with the ability to contain the spread of disease. Omai Garner, PhD, laboratory director for Clinical Microbiology in the UCLA health system, explains how PCR testing for COVID-19 works and why testing is in short supply.</p>",
            "length": "30203938",
            "sourceUrl": "http://traffic.libsyn.com/jamaclinicalreviews/Coronavirus_Disease_2019_COVID-19_Update__PCR_Testing_and_Shortages.mp3?dest-id=274040"
        },
        {
            "title": "Coronavirus (COVID-19) Update: Lessons Learned From The 2003 SARS Outbreak",
            "datePublished": "Wed, 25 Mar 2020 15:00:00 +0000",
            "description": "<p>In 2003, Toronto was the North American center for Severe Acute Respiratory Syndrome (SARS). The disease spread through the city’s hospitals before anyone knew what was happening. Dr Allison McGeer was a clinician caring for SARS patients and ultimately was infected herself. She describes her experience as a patient and provider and reviews lessons learned that might help others manage their regional COVID-19 outbreaks.</p> <p>Related:</p> <p><a href= \"http://jamanetwork.com/journals/jama/fullarticle/10.1001/jama.2020.3972\"> Supporting the Health Care Workforce During the COVID-19 Global Epidemic</a></p>",
            "length": "37027216",
            "sourceUrl": "http://traffic.libsyn.com/jamaclinicalreviews/COVID-19__Applying_What_Was_Learned_by_SARS_to_a_Modern_Pandemic.mp3?dest-id=274040"
        },
        {
            "title": "Coronavirus Disease 2019 (COVID-19) Update: How the VA Is Preparing",
            "datePublished": "Wed, 25 Mar 2020 15:00:00 +0000",
            "description": "<p>As COVID-19 spreads, clinicians and health systems are struggling to prepare for a surge of patients. Richard Stone, MD, the US Veterans Health Administration's Executive in Charge, spoke with JAMA about how the VA health system is preparing for this public health emergency.</p>",
            "length": "17350773",
            "sourceUrl": "http://traffic.libsyn.com/jamaclinicalreviews/Coronavirus_Disease_2019_COVID-19_Update__How_the_VA_Is_Preparing.mp3?dest-id=274040"
        },
        {
            "title": "Coronavirus (COVID-19) Update: Chloroquine/Hydroxychloroquine and Azithromycin",
            "datePublished": "Tue, 24 Mar 2020 20:00:00 +0000",
            "description": "<p>Chloroquine was shown in 2004 to be active in vitro against SARS coronavirus but is of unproven efficacy and safety in patients infected with SARS-CoV-2. The drug's potential benefits and risks for COVID-19 patients, without and with azithromycin, is discussed by Dr. David Juurlink, head of the Division of Clinical Pharmacology and Toxicology at Sunnybrook Health Sciences Centre in Toronto.</p>",
            "length": "16619877",
            "sourceUrl": "http://traffic.libsyn.com/jamaclinicalreviews/Coronavirus_COVID-19_Update__Chloroquine_Hydroxychloroquine_and_Azithromycin.mp3?dest-id=274040"
        },
        {
            "title": "Nonalcoholic Steatohepatitis: The Primary Care Perspective",
            "datePublished": "Tue, 24 Mar 2020 15:00:00 +0000",
            "description": "<p>Nonalcoholic steatohepatitis (NASH) is becoming more frequent as the population becomes more obese. This is not a benign problem, and NASH can ultimately lead to cirrhosis and liver failure. It is thought that NASH will ultimately become the most common cause for liver transplant. NASH is usually diagnosed as an incidental finding, but once found requires careful monitoring and patient counseling. Lisa N. Kransdorf, MD, MPH, from UCLA Health in California, discusses the diagnosis and management of NASH from a primary care clinician's perspective.</p>",
            "length": "14867431",
            "sourceUrl": "http://traffic.libsyn.com/jamaclinicalreviews/Nonalcoholic_Steatohepatitis__The_Primary_Care_Perspective.mp3?dest-id=274040"
        },
        {
            "title": "The Diagnosis and Management of Primary Hyperparathyroidism",
            "datePublished": "Tue, 24 Mar 2020 15:00:00 +0000",
            "description": "<p>Hyperparathyroidism is a fairly common disease that causes elevated calcium levels and bone depletion, resulting in fractures and kidney problems. There are medications that can effectively manage hyperparathyroidism, and in some cases surgery is indicated. Michael Yeh, MD, professor and chief of endocrine surgery at UCLA, discusses the management of hyperparathyroidism.</p>",
            "length": "19109727",
            "sourceUrl": "http://traffic.libsyn.com/jamaclinicalreviews/The_Diagnosis_and_Management_of_Primary_Hyperparathyroidism.mp3?dest-id=274040"
        },
        {
            "title": "Coronavirus (COVID-19) Update: Early Safety Signals Around Ibuprofen and Renin-Angiotensin Inhibitors",
            "datePublished": "Fri, 20 Mar 2020 21:45:00 +0000",
            "description": "<p>Emerging information about how SARS-CoV-2 virus infects cells has led to speculation that NSAIDs and ACE inhibitors/angiotensin receptor blockers (ARBs) may worsen clinical disease. Infectious disease physician Carlos del Rio, MD, of Emory University explains the concerns and their clinical implications.</p>",
            "length": "9077286",
            "sourceUrl": "http://traffic.libsyn.com/jamaclinicalreviews/COVID-19_Update_March_18_2020__Why_People_Should_Be_Concerned_About_This_Disease_Ibuprofen_and_Hypertension_Drugs_as_They_Relate_to_COVID-19.mp3?dest-id=274040"
        },
        {
            "title": "Nathan Pritikin and His Diet",
            "datePublished": "Tue, 17 Mar 2020 15:00:00 +0000",
            "description": "<p>Nathan Pritikin was a college dropout who became an entrepreneur. While doing research for the government during World War II, he observed that populations that had extremely limited food availability because of the war had substantially reduced mortality from cardiovascular disease—something unexpected at a time when cardiovascular disease was thought to be due to stress. After the war when food became more available CVD death rates went back up, resulting in Pritikin concluding that CVD was related to diet. Pritikin devised his own very low-fat diet that bears his name and the diet is still in use 65 years later.</p> <p>Related:</p> <p><a href= \"http://jamanetwork.com/journals/jama/fullarticle/10.1001/jama.2019.21266\"> The Pritikin Diet</a></p> <p><a href= \"https://www.drmcdougall.com/health/education/podcast/nathan-pritikin/\"> The Lost Lectures from Nathan Pritikin (drmcdougall.com)</a></p>",
            "length": "22748996",
            "sourceUrl": "http://traffic.libsyn.com/jamaclinicalreviews/Nathan_Pritikin_and_His_Diet.mp3?dest-id=274040"
        },
        {
            "title": "Who Was Nathan Pritikin and Why Is There a Diet Named After Him?",
            "datePublished": "Tue, 17 Mar 2020 15:00:00 +0000",
            "description": "<p>This podcast explains the Pritikin diet to patients. Nathan Pritikin was a college dropout who became an entrepreneur. While doing research for the government during World War II, he observed that populations that had extremely limited food availability because of the war had substantially reduced mortality from cardiovascular disease—something unexpected at a time when cardiovascular disease was thought to be due to stress. After the war when food became more available CVD death rates went back up, resulting in Pritikin concluding that CVD was related to diet. Pritikin devised his own very low-fat diet that bears his name and the diet is still in use 65 years later.</p> <p>Related:</p> <p><a href= \"http://jamanetwork.com/journals/jama/fullarticle/10.1001/jama.2019.21266\"> The Pritikin Diet</a></p> <p><a href= \"https://www.drmcdougall.com/health/education/podcast/nathan-pritikin/\"> The Lost Lectures from Nathan Pritikin (drmcdougall.com)</a></p>",
            "length": "22446384",
            "sourceUrl": "http://traffic.libsyn.com/jamaclinicalreviews/Who_Was_Nathan_Pritikin_and_Why_Is_There_a_Diet_Named_After_Him_.mp3?dest-id=274040"
        },
        {
            "title": "COVID-19 in Seattle: Clinical Features and Managing the Outbreak",
            "datePublished": "Sun, 15 Mar 2020 23:45:00 +0000",
            "description": "<p>Seattle was one of the first US cities to have a COVID-19 outbreak, with a cluster of nursing home-related deaths. However, many people who tested positive for the novel coronavirus never became ill, and in some the clinical illness was indistinguishable from influenza. John Lynch, MD, MPH, an infectious disease physician and medical director for infection prevention and control at the Harborview Medical Center, summarizes his hospital’s experience managing the patients and outbreak.</p>",
            "length": "23096460",
            "sourceUrl": "http://traffic.libsyn.com/jamaclinicalreviews/COVID-19_in_Seattle__Clinical_Features_and_Managing_the_Outbreak.mp3?dest-id=274040"
        },
        {
            "title": "The Effect of the COVID-19 Pandemic on Clinic Operations",
            "datePublished": "Fri, 13 Mar 2020 18:00:00 +0000",
            "description": "<p>Seattle has been a focal point for the US in the coronavirus pandemic. Doug Paauw, MD, professor of medicine at the University of Washington, in Seattle, describes the UW primary care clinic experience as this pandemic evolved. Major lessons learned included accommodating for significant numbers of staff not available to work in the clinic because of school closures, change in workflow because of shortages of personal protective equipment, physicians having to accommodate very large numbers of patient queries via telephone, email, or electronic health record, and the importance of the rapid development of local ability to test for SARS-CoV-2 independent of public health agencies.</p>",
            "length": "20124684",
            "sourceUrl": "http://traffic.libsyn.com/jamaclinicalreviews/The_Effect_of_the_COVID-19_Pandemic_on_Clinic_Operations.mp3?dest-id=274040"
        },
        {
            "title": "Update on Coronavirus: March 6, 2020, by NIAID’s Anthony Fauci, MD",
            "datePublished": "Mon, 09 Mar 2020 15:00:00 +0000",
            "description": "<p>Coronovirus (the virus SARS-CoV-2) continues to spread throughout the world. In recent weeks, there has been an increasing number of cases and deaths in the US. As concern about the virus increases, there is an increasing need for accurate information about the disease and how much concern we should have. Anthony Fauci, MD, is the director of the National Institute for Allergy and Infectious Diseases (NIAID) and has been the main spokesperson for the US government about coronavirus. Dr Fauci spoke with JAMA Editor in Chief Howard Bauchner, MD, about where we are as of today with the SARS-CoV-2 epidemic.</p> <p><a href= \"https://jamanetwork.com/journals/jama/pages/coronavirus-alert\">JAMA Coronavirus Resource Center</a></p>",
            "length": "31944720",
            "sourceUrl": "http://traffic.libsyn.com/jamaclinicalreviews/Update_on_Coronavirus__March_6_2020_by_NIAID_s_Anthony_Fauci_MD.mp3?dest-id=274040"
        },
        {
            "title": "Unprofessional Behavior Leads to Complications",
            "datePublished": "Tue, 25 Feb 2020 16:00:00 +0000",
            "description": "<p>Physicians who act out cause all sorts of problems. Fortunately, only a few clinicians have behavior problems and in the modern era, bad behaviors are not tolerated. Bad behaviors get reported these days and actions are taken against these sorts of clinicians. Clinicians who act out frequently say they are doing so to protect their patients. But are they? William Cooper, MD, MPH, and Gerald B. Hickson, MD, from Vanderbilt University Medical Center in Nashville, Tennessee, discuss a study they published in relating bad behaviors to having more complications of surgical care.</p> <p>Related article:</p> <p><a href= \"http://jamanetwork.com/journals/jamasurgery/fullarticle/10.1001/jamasurg.2019.1738\"> Association of Coworker Reports About Unprofessional Behavior by Surgeons With Surgical Complications in Their Patients</a></p>",
            "length": "10344578",
            "sourceUrl": "http://traffic.libsyn.com/jamaclinicalreviews/Unprofessional_Behavior_Leads_to_Complications.mp3?dest-id=274040"
        },
        {
            "title": "The 2020 Influenza Epidemic—More Serious Than Coronavirus in the US",
            "datePublished": "Tue, 18 Feb 2020 16:00:00 +0000",
            "description": "<p>Although coronavirus disease 2019 (COVID-19) dominates the news in early 2020, it affects few people in the US. In contrast, at the same time the US is experiencing a severe influenza epidemic, which has caused an estimated 250 000 hospitalizations and 14 000 deaths. Timothy Uyeki, MD, lead for the CDC’s 2019 novel coronavirus response team and Chief Medical Officer of CDC’s influenza division, discusses influenza in the US, how it compares to coronavirus, and what both patients and clinicians should know about this year’s flu season.</p> <p><a href=\"https://www.cdc.gov/flu\">CDC's Influenza site</a></p> <p><a href=\"https://www.cdc.gov/flu/weekly\">CDC's Weekly U.S. Influenza Surveillance Report</a></p> <p><a href=\"https://vaccinefinder.org/\">HealthMap Vaccine Finder</a></p>",
            "length": "30065577",
            "sourceUrl": "http://traffic.libsyn.com/jamaclinicalreviews/The_2020_Influenza_EpidemicMore_Serious_Than_Coronavirus_in_the_US.mp3?dest-id=274040"
        },
        {
            "title": "AIDS-Related Chronic Inflammation Leading to Chronic Disease",
            "datePublished": "Tue, 18 Feb 2020 16:00:00 +0000",
            "description": "<p>Great strides have been made in treating HIV, as Anthony Fauci, MD, discusses in this podcast episode. But even substantial viral suppression leaves some virus behind, causing chronic inflammation. Many chronic diseases, including atherosclerotic coronary vascular disease, are worsened by this chronic inflammatory state. Because HIV patients are now living very long lives, they are also developing chronic diseases at a more rapid rate than their non-HIV-infected peers because of this chronic inflammation.</p>",
            "length": "8749986",
            "sourceUrl": "http://traffic.libsyn.com/jamaclinicalreviews/AIDS-Related_Chronic_Inflammation_Leading_to_Chronic_Disease.mp3?dest-id=274040"
        },
        {
            "title": "Parkinson Disease",
            "datePublished": "Tue, 11 Feb 2020 16:00:00 +0000",
            "description": "<p>More than 6 million people worldwide have Parkinson disease. Even though it is classically associated with tremors, the disease has many manifestations and is very treatable for most patients. Michael S. Okun, MD, from the Department of Neurology at the University of Florida, Gainesville, discusses the pathophysiology, clinical presentation, diagnosis, and treatment of Parkinson disease.</p> <p>Related article:</p> <p><a href= \"http://jamanetwork.com/journals/jama/fullarticle/10.1001/jama.2020.0264\"> Parkinson Disease</a></p> <p><em><a href=\"https://www.amamanualofstyle.com/\">AMA Manual of Style</a></em></p>",
            "length": "25613634",
            "sourceUrl": "http://traffic.libsyn.com/jamaclinicalreviews/Parkinson_Disease.mp3?dest-id=274040"
        },
        {
            "title": "Testing for Breast Cancer Susceptibility Genes",
            "datePublished": "Tue, 11 Feb 2020 16:00:00 +0000",
            "description": "<p>Breast cancer is a leading cause of death in women. Some women have a cancer susceptibility gene known as <em>BRCA</em>, and women should be tested for BRCA under some circumstances. Carol Mangione, MD, division chief of General Internal Medicine and Health Services Research at UCLA, discusses when testing is appropriate, and Ranjit Manchanda, MD, PhD, from Barts Cancer Institute in London, UK, discusses the cost-effectiveness of BRCA screening for women who have had breast cancer.</p>",
            "length": "13180285",
            "sourceUrl": "http://traffic.libsyn.com/jamaclinicalreviews/Testing_for_Breast_Cancer_Susceptibility_Genes.mp3?dest-id=274040"
        },
        {
            "title": "Management of Chronic Stable Angina in 2020",
            "datePublished": "Tue, 04 Feb 2020 16:00:00 +0000",
            "description": "<p>Controversy exists regarding how to best manage chronic stable angina. Intuitively, it seems that because it is usually caused by coronary artery lesions, addressing those lesions either via percutaneous coronary angiography or coronary artery bypass operations would be the best way to manage this problem. Several studies have suggested that this is not the case and that results of these interventions are no better than optimal medical management. Recently, a very large trial examining this clinical question has provided results suggesting that any approach works about the same. We interviewed Donald Lloyd-Jones, MD, chair of the department of preventive medicine at Northwestern University, during the recent American Heart Association meeting about this issue.</p> <p>Related articles:</p> <p><a href= \"http://jamanetwork.com/journals/jamacardiology/fullarticle/10.1001/jamacardio.2019.0014\"> Baseline Characteristics and Risk Profiles of Participants in the ISCHEMIA Randomized Clinical Trial</a></p> <p><a href= \"http://jamanetwork.com/journals/jama/fullarticle/10.1001/jama.2015.12735\"> Does This Patient With Chest Pain Have Acute Coronary Syndrome?: The Rational Clinical Examination Systematic Review</a></p> <p><a href= \"http://jamanetwork.com/journals/jama/fullarticle/10.1001/jama.2019.15736\"> Coronary Microvascular Dysfunction Causing Cardiac Ischemia in Women</a></p> <p><a href= \"http://jamanetwork.com/journals/jamainternalmedicine/fullarticle/10.1001/jamainternmed.2019.2407\"> Acupuncture as Adjunctive Therapy for Chronic Stable Angina: A Randomized Clinical Trial</a></p>",
            "length": "7121770",
            "sourceUrl": "http://traffic.libsyn.com/jamaclinicalreviews/Management_of_Chronic_Stable_Angina_in_2020.mp3?dest-id=274040"
        },
        {
            "title": "Treating Conjunctivitis and Dry Eye Disease",
            "datePublished": "Tue, 04 Feb 2020 16:00:00 +0000",
            "description": "<p>Conjunctivitis and dry eye disease are some of the most common conditions patients present with. They are usually benign entities that respond well to conservative measures and usually don’t require medications. However, if medications are necessary, clinicians can find a comprehensive assessment of these drugs recently published in the December 2, 2019, issue of The Medical Letter. An excerpt from this article summarizing information about conjunctivitis and dry eye disease was published in the February 4, 2020 issue of JAMA. Kathryn Colby, MD, PhD, chair of the Department of Ophthalmology & Visual Science at the University of Chicago, explains in this podcast how to treat conjunctivitis and dry eye disease.</p>",
            "length": "18258047",
            "sourceUrl": "http://traffic.libsyn.com/jamaclinicalreviews/Treating_Conjunctivitis_and_Dry_Eye_Disease.mp3?dest-id=274040"
        },
        {
            "title": "2019 Novel Coronavirus: An Update From NIAID Director Anthony Fauci, MD",
            "datePublished": "Thu, 30 Jan 2020 16:45:00 +0000",
            "description": "<p>A new virus known as the 2019 novel coronavirus (2019-nCoV) is rapidly spreading through China. The rapid spread and severity of this illness are worrisome and the possibility that it develops into a pandemic is very real. Anthony Fauci, MD, director of the National Institute of Allergy and Infectious Diseases, provides an update on this new disease.</p>",
            "length": "8248226",
            "sourceUrl": "http://traffic.libsyn.com/jamaclinicalreviews/2019_Novel_Coronavirus__An_Update_From_NIAID_Director_Anthony_Fauci_MD.mp3?dest-id=274040"
        },
        {
            "title": "Football Players and Erectile Dysfunction Associated With Repetitive Head Injury",
            "datePublished": "Wed, 29 Jan 2020 16:00:00 +0000",
            "description": "<p>American football is a dangerous sport and is characterized by violent contact between people that often leads to repetitive head injury. A multitude of health effects may result from this sort of head injury, but a new finding reported in the December issue of JAMA Neurology maintains that football players are at risk for developing low testosterone levels and erectile dysfunction. Rachel Grashow, PhD, from Harvard T.H. Chan School of Public Health and the Football Players Health Study at Harvard Medical School discusses the findings regarding the relationship between head injury and erectile dysfunction.</p>",
            "length": "7554290",
            "sourceUrl": "http://traffic.libsyn.com/jamaclinicalreviews/Football_Players_and_Erectile_Dysfunction_Associated_With_Repetitive_Head_Injury.mp3?dest-id=274040"
        },
        {
            "title": "The Keto, Atkins, and Pritikin Diets",
            "datePublished": "Tue, 28 Jan 2020 16:00:00 +0000",
            "description": "<p>There are many named diets that receive a great deal of attention. But what are they and do they work? David Heber, MD, PhD, from the UCLA Center for Human Nutrition explains these diets.</p> <p>Related articles:</p> <p><a href= \"http://jamanetwork.com/journals/jama/fullarticle/10.1001/jama.2019.18408\"> Ketogenic Diets (Patient Page)</a></p> <p><a href= \"http://jamanetwork.com/journals/jama/fullarticle/10.1001/jama.2017.20639\"> Interest in the Ketogenic Diet Grows for Weight Loss and Type 2 Diabetes</a></p> <p><a href= \"http://jamanetwork.com/journals/jama/fullarticle/10.1001/jama.2014.10397\"> Comparison of Weight Loss Among Named Diet Programs in Overweight and Obese Adults: A Meta-analysis</a></p>",
            "length": "14792349",
            "sourceUrl": "http://traffic.libsyn.com/jamaclinicalreviews/The_Keto_Atkins_and_Pritikin_Diets.mp3?dest-id=274040"
        },
        {
            "title": "The Keto Diet: Advice for Patients",
            "datePublished": "Tue, 28 Jan 2020 16:00:00 +0000",
            "description": "<p>The keto diet is very popular and involves eating very few carbohydrates, a fair amount of fat, and normal amounts of protein. It is one of many ways to lose weight. David Heber, MD, formerly the chair of Clinical Nutrition at UCLA, explains the keto diet.</p> <p>Related article:</p> <p><a href= \"http://jamanetwork.com/journals/jama/fullarticle/10.1001/jama.2019.18408\"> Ketogenic Diets</a></p> <p> </p>",
            "length": "9702877",
            "sourceUrl": "http://traffic.libsyn.com/jamaclinicalreviews/The_Keto_Diet__Advice_for_Patients.mp3?dest-id=274040"
        },
        {
            "title": "The American Heart Association Takes a Stance Against e-Cigarettes",
            "datePublished": "Tue, 21 Jan 2020 16:00:00 +0000",
            "description": "<p>e-Cigarettes are dangerous, but the public has been falsely led to believe that they are safe. Because of this misconception and the inherent dangers, the American Heart Association (AHA) has taken an aggressive stance to educate the public about e-cigarettes, especially their use by kids. Rose Marie Robertson, MD,deputy chief science and medical officer for the AHA, spoke to JAMA about e-cigarettes and the frightening increase in their use among kids.</p> <p>Read the article: <a href= \"http://jamanetwork.com/journals/jama/fullarticle/10.1001/jama.2019.20781\"> The American Heart Association Takes on Vaping</a></p>",
            "length": "6848527",
            "sourceUrl": "http://traffic.libsyn.com/jamaclinicalreviews/The_American_Heart_Association_Takes_a_Stance_Against_e-Cigarettes.mp3?dest-id=274040"
        },
        {
            "title": "An Inconvenient Tooth",
            "datePublished": "Tue, 14 Jan 2020 16:00:00 +0000",
            "description": "<p>Animal bites can be a cause of significant injury and on occasion, fatalities. In this episode, JAMA Fishbein Fellow Angel Desai, MD, MPH discusses the prevention, treatment, and epidemiological oddities of animal bites with Dr Sandra Nelson, Assistant Professor of Medicine at Massachusetts General, Dr Justin Hensley from Children’s Hospital of San Antonio, and others. Desai also talks prevention and risk of rabies acquisition with Dr Catherine Brown, state epidemiologist and public health veterinarian from the Massachusetts Department of Public Health.</p>",
            "length": "43089439",
            "sourceUrl": "http://traffic.libsyn.com/jamaclinicalreviews/An_Inconvenient_Tooth.mp3?dest-id=274040"
        },
        {
            "title": "NICE Guidelines for Heavy Menstrual Bleeding: What to Make of Them",
            "datePublished": "Thu, 19 Dec 2019 16:00:00 +0000",
            "description": "<p>The UK’s National Institute for Health and Care Excellence (NICE) recently issued guidelines for how to manage heavy menstrual bleeding. Guidelines only provide guidance and they must be interpreted for an individual patient's clinical context. Andrew Kauntiz, MD, professor and associate chair in the department of obstetrics and gynecology, University of Florida College of Medicine in Jacksonville, an expert in this topic, discusses these new NICE guidelines and how clinicians should use them.</p> <p>Read the article: <a href= \"http://jamanetwork.com/journals/jama/fullarticle/10.1001/jama.2019.17383\"> Assessment and Management of Heavy Menstrual Bleeding</a></p>",
            "length": "19873356",
            "sourceUrl": "http://traffic.libsyn.com/jamaclinicalreviews/NICE_Guidelines_for_Heavy_Menstrual_Bleeding__What_to_Make_of_Them.mp3?dest-id=274040"
        },
        {
            "title": "The Medical and Political Response to the 2019 Christchurch Mosque Mass Shooting",
            "datePublished": "Tue, 10 Dec 2019 16:00:00 +0000",
            "description": "<p>On March 15, 2019, a lone gunman walked into 2 mosques within minutes of each other in Christchurch, New Zealand, and opened fire with semiautomatic weapons, killing 51 and wounding many more. We spoke to Greg Robertson, MB ChB, the surgeon who coordinated the medical response to this mass casualty event. Robertson talks about what his hospital had to do to manage all these casualties and also how New Zealand quickly changed its laws to restrict the availability of weapons used for these sorts of attacks.</p>",
            "length": "25623019",
            "sourceUrl": "http://traffic.libsyn.com/jamaclinicalreviews/The_Medical_and_Political_Response_to_the_2019_Christchurch_Mosque_Mass_Shooting.mp3?dest-id=274040"
        },
        {
            "title": "What Do I Need to Know About e-Cigarettes and If They Help People Stop Smoking?",
            "datePublished": "Mon, 25 Nov 2019 16:00:00 +0000",
            "description": "<p>Electronic cigarette (e-cigarette) use, otherwise known as “vaping,” has been increasing since 2010. This podcast reviews research on the epidemiology and possible adverse health effects of e-cigarette and nicotine use, and the pitfalls associated with using e-cigarettes as a method to stop smoking. These issues are discussed by Suchitra Krishnan-Sarin, PhD, a professor with the Department of Psychiatry at Yale University School of Medicine, and JAMA Associate Editor George O’Connor, a professor of medicine at Boston University.</p> <p>Related article: <a href= \"https://jamanetwork.com/journals/jama/fullarticle/2755265\">e-Cigarette Use Among Youth in the United States, 2019</a></p>",
            "length": "16708734",
            "sourceUrl": "http://traffic.libsyn.com/jamaclinicalreviews/What_Do_I_Need_to_Know_About_e-Cigarettes_and_If_They_Help_People_Stop_Smoking.mp3?dest-id=274040"
        },
        {
            "title": "The Underappreciated Problem of Cardiac Disease in Women",
            "datePublished": "Mon, 18 Nov 2019 17:30:00 +0000",
            "description": "<p>Barbra Streisand and Noel Bairey Merz, MD, director of the Streisand Women’s Heart Center at Cedars-Sinai in Los Angeles, California, discuss the problem of cardiovascular disease in women and especially coronary microvascular disease, which causes an unusual presentation of cardiac ischemic disease in women.</p>",
            "length": "10155036",
            "sourceUrl": "http://traffic.libsyn.com/jamaclinicalreviews/The_Underappreciated_Problem_of_Cardiac_Disease_in_Women.mp3?dest-id=274040"
        },
        {
            "title": "Review of Atrial Fibrillation Treatment",
            "datePublished": "Tue, 12 Nov 2019 16:00:00 +0000",
            "description": "<p>Atrial fibrillation is a very common problem that is treated with a variety of medications and interventions. Sandip Mukherjee, MD, a contributing editor to The Medical Letter, is the Medical Director of Physician Liaison Services with the Office of the Chief Medical Officer at Yale New Haven Hospital, and an associate professor of medicine at Yale. He summarizes the latest information published in The Medical Letter on treatments for atrial fibrillation.</p>",
            "length": "24503873",
            "sourceUrl": "http://traffic.libsyn.com/jamaclinicalreviews/Review_of_Atrial_Fibrillation_Treatment.mp3?dest-id=274040"
        },
        {
            "title": "Influenza Vaccination in 2019-2020",
            "datePublished": "Wed, 06 Nov 2019 16:00:00 +0000",
            "description": "<p>Winter is coming…and with it, the onset of flu season. In this episode, Jean-Marie Pflomm, PharmD, Editor in Chief of The Medical Letter, decodes flu vaccines: trivalent vs quadrivalent, live attenuated vs inactivated, and much more.</p>",
            "length": "13082355",
            "sourceUrl": "http://traffic.libsyn.com/jamaclinicalreviews/Influenza_Vaccination_in_2019-2020.mp3?dest-id=274040"
        },
        {
            "title": "How Adolescent Boys’ Need for Friendship Affects Their Mental Health",
            "datePublished": "Tue, 05 Nov 2019 16:00:00 +0000",
            "description": "<p>Adolescent boys are notoriously difficult to deal with. However, some of their behaviors mask a need they have for developing intimate friendships. Being adolescent boys living in a macho culture, many deny that they need these relationships. Niobe Way, EdD, professor of Developmental Psychology at New York University, has spent her professional career studying adolescent boys’ relationships with each other and how they affect their behaviors. She explains how to intervene to help them better understand their needs for intimacy, which, in turn, helps them to better relate with people and avoid unpleasant behaviors.</p> <p>Related article: <a href= \"http://jamanetwork.com/journals/jama/fullarticle/10.1001/jama.2017.14591\"> Loneliness Might Be a Killer, but What’s the Best Way to Protect Against It?</a></p> <p><a href= \"https://edhub.ama-assn.org/jn-learning/audio-player/18009128\">CME Quiz</a></p> <p><a href= \"http://pach.org/announcements/press-release-nyu-steinhardt-receives-spencer-foundation-grant-to-address-societal-divisions-in-nyc-middle-school\"> The Listening Project</a></p> <p> </p>",
            "length": "36486001",
            "sourceUrl": "http://traffic.libsyn.com/jamaclinicalreviews/How_Adolescent_Boys__Need_for_Friendship_Affects_Their_Mental_Health.mp3?dest-id=274040"
        },
        {
            "title": "Emerging Applications for Ketamine",
            "datePublished": "Tue, 22 Oct 2019 15:00:00 +0000",
            "description": "<p>Even though it gained notoriety for recreational uses, Ketamine is experiencing a resurgence in clinical settings given its versatility and potential applications, including for pain treatment and depression. David Juurlink, MD, from Sunnybrook Health Sciences Center and John Krystal, MD from Yale University discuss current and emerging applications of this drug.</p>",
            "length": "24608826",
            "sourceUrl": "http://traffic.libsyn.com/jamaclinicalreviews/Emerging_Applications_for_Ketamine.mp3?dest-id=274040"
        },
        {
            "title": "Understanding Lipids and Cardiovascular Risk Through Mendelian Randomization",
            "datePublished": "Tue, 08 Oct 2019 15:00:00 +0000",
            "description": "<p>Mendelian randomization is a powerful technique that enables investigators to mimic randomized clinical trials by characterizing genetic differences between groups of people and studying their clinical outcomes. Brian A. Ference, MD, MPhil, from the University of Cambridge in England, is a leading expert on this topic and spoke with us about how mendelian randomization has facilitated a better understanding of lipid biology and how it relates to cardiovascular risk.</p>",
            "length": "27020393",
            "sourceUrl": "http://traffic.libsyn.com/jamaclinicalreviews/Understanding_Lipids_and_Cardiovascular_Risk_Through_Mendelian_Randomization.mp3?dest-id=274040"
        },
        {
            "title": "Pancreatic Cancer",
            "datePublished": "Tue, 08 Oct 2019 15:00:00 +0000",
            "description": "<p>Pancreatic cancer is the third most common cause of cancer death in the United States. Timothy Donohue, MD, chief of surgical oncology at the University of California, Los Angeles, provides an overview of the disease.</p> <p>Read the articles:</p> <p><a href= \"http://jamanetwork.com/journals/jama/fullarticle/10.1001/jama.2019.10776\"> Screening for Pancreatic Cancer</a></p> <p><a href= \"http://jamanetwork.com/journals/jama/fullarticle/10.1001/jama.2019.14699\"> Pancreatic Cancer</a></p> <p> </p>",
            "length": "25934915",
            "sourceUrl": "http://traffic.libsyn.com/jamaclinicalreviews/Pancreatic_Cancer.mp3?dest-id=274040"
        },
        {
            "title": "Personal Protective Equipment for Health Care Infection Control",
            "datePublished": "Mon, 07 Oct 2019 21:05:00 +0000",
            "description": "<p>Personal protective equipment comprises gloves, gowns, masks, regular respirators, and powered air purifying respirators (PAPRs). In this Clinical Review podcast Trish Perl, MD, of UT Southwestern Medical Center reviews the indications for each and the results of the RESPECT trial, which reported no difference in incidence of laboratory-confirmed influenza among health care personnel randomized to wear N95 respiratory or medical masks. She’s interviewed by JAMA Fishbein fellow Angel Desai, MD.</p>",
            "length": "19026844",
            "sourceUrl": "http://traffic.libsyn.com/jamaclinicalreviews/Personal_Protective_Equipment_for_Health_Care_Infection_Control.mp3?dest-id=274040"
        },
        {
            "title": "Improving Uptake of Preexposure Prophylaxis (PrEP) for HIV in Primary Care",
            "datePublished": "Sun, 06 Oct 2019 19:00:00 +0000",
            "description": "<p>JAMA Fishbein Fellow Angel Desai, MD interviews Douglas S. Krakower, MD at the IDWeek 2019 conference in Washington, D.C.</p> <p>Related article: <a href= \"https://jamanetwork.com/journals/jama/fullarticle/2748807\">Rising PrEP Awareness</a></p>",
            "length": "11348995",
            "sourceUrl": "http://traffic.libsyn.com/jamaclinicalreviews/Improving_Uptake_of_Preexposure_Prophylaxis_PrEP_for_HIV_in_Primary_Care.mp3?dest-id=274040"
        },
        {
            "title": "Update in Clinical Infectious Diseases 2019-2020",
            "datePublished": "Sun, 06 Oct 2019 02:56:34 +0000",
            "description": "<p>This Clinical Review podcast reviews some of the most important advances in clinical infectious diseases presented at IDWeek 2019 including data on rapid testing, new antimicrobial agents, and new strategies for using existing antibiotics to manage antimicrobial resistance. JAMA Fishbein Fellow Angel Desai, MD interviews Helen Boucher, MD of Tufts University.</p>",
            "length": "14165237",
            "sourceUrl": "http://traffic.libsyn.com/jamaclinicalreviews/Update_in_Clinical_Infectious_Diseases_2019-2020.mp3?dest-id=274040"
        },
        {
            "title": "A New Path for Gun Research Funding",
            "datePublished": "Tue, 10 Sep 2019 15:00:00 +0000",
            "description": "<p>Since the passage of the Dickey Amendment in 1996, federal funding for gun violence research has been withheld from the CDC and other federal agencies that should be tasked with figuring out the origins and solutions to this problem. But while the US government has been locked in a political stalemate, other entities are stepping up in a new model for getting the job done.</p>",
            "length": "16322168",
            "sourceUrl": "http://traffic.libsyn.com/jamaclinicalreviews/A_New_Path_for_Gun_Research_Funding.mp3?dest-id=274040"
        },
        {
            "title": "Bariatric Surgery and Cardiovascular Outcomes in Patients With Type 2 Diabetes and Obesity",
            "datePublished": "Tue, 03 Sep 2019 06:30:00 +0000",
            "description": "<p>JAMA Deputy Editor Ed Livingston, MD, interviews Steven Nissen, MD, at the European Society of Cardiology's 2019 conference in Paris, France.</p>",
            "length": "13701857",
            "sourceUrl": "http://traffic.libsyn.com/jamaclinicalreviews/Bariatric_Surgery_and_Cardiovascular_Outcomes_in_Patients_With_Type_2_Diabetes_and_Obesity.mp3?dest-id=274040"
        },
        {
            "title": "Management of Heart Failure in 2019-2020, Part 2",
            "datePublished": "Mon, 02 Sep 2019 06:35:00 +0000",
            "description": "<p>JAMA Deputy Editor Ed Livingston, MD, interviews James Januzzi, MD, at the European Society of Cardiology's 2019 conference in Paris, France.</p>",
            "length": "10935859",
            "sourceUrl": "http://traffic.libsyn.com/jamaclinicalreviews/Management_of_Heart_Failure_in_2019-2020_Part_II.mp3?dest-id=274040"
        },
        {
            "title": "Management of Heart Failure in 2019-2020, Part 1",
            "datePublished": "Mon, 02 Sep 2019 06:30:00 +0000",
            "description": "<p>JAMA Deputy Editor Ed Livingston, MD, interviews Akshay Desai, MD, at the European Society of Cardiology's 2019 conference in Paris, France.</p>",
            "length": "16138515",
            "sourceUrl": "http://traffic.libsyn.com/jamaclinicalreviews/Management_of_Heart_Failure_in_2019-2020_Part_I.mp3?dest-id=274040"
        },
        {
            "title": "The Influence of Obesity on Cancer",
            "datePublished": "Tue, 20 Aug 2019 15:00:00 +0000",
            "description": "<p>Jennifer A. Ligibel, MD, from the Dana-Farber Cancer Institute and Harvard Medical School, Boston, explains how obesity influences the risk of developing cancer and how it influences the prognosis of existing cancer.</p>",
            "length": "20192557",
            "sourceUrl": "http://traffic.libsyn.com/jamaclinicalreviews/The_Influence_of_Obesity_on_Cancer.mp3?dest-id=274040"
        },
        {
            "title": "Responsible Use of Opioids to Treat Cancer Pain",
            "datePublished": "Tue, 06 Aug 2019 15:00:00 +0000",
            "description": "<p>Dr. Eduardo Bruera, Chair of the Department of Palliative Care at MD Anderson, discusses how to responsibly manage cancer pain using opioids.</p>",
            "length": "28027455",
            "sourceUrl": "http://traffic.libsyn.com/jamaclinicalreviews/Responsible_Use_of_Opioids_to_Treat_Cancer_Pain.mp3?dest-id=274040"
        },
        {
            "title": "Diagnosing Menopause",
            "datePublished": "Mon, 22 Jul 2019 15:00:00 +0000",
            "description": "<p>Menopause is inevitable for women. It symptoms are uncomfortable and distressing. For women to best cope with menopause, it is useful to firmly establish the onset so that appropriate counseling can follow. In this podcast, an expert in this field, Nanette Santoro, MD, from the University of Colorado, explains how to diagnose menopause.</p> <p>Read the article: <a href= \"http://jamanetwork.com/journals/jama/fullarticle/10.1001/jama.2019.6250\"> Diagnosing the Onset of Menopause</a></p>",
            "length": "15186114",
            "sourceUrl": "http://traffic.libsyn.com/jamaclinicalreviews/Diagnosing_Menopause.mp3?dest-id=274040"
        },
        {
            "title": "Guns and Suicide",
            "datePublished": "Tue, 16 Jul 2019 15:00:00 +0000",
            "description": "<p>Using firearms to commit suicide is one of the most common causes of firearm related deaths. This can happen even in families where it seems highly unlikely to occur. In this podcast, we tell the story of a policeman’s daughter who got a hold of his gun and tried to kill herself.</p>",
            "length": "26248311",
            "sourceUrl": "http://traffic.libsyn.com/jamaclinicalreviews/Guns_and_Suicide.mp3?dest-id=274040"
        },
        {
            "title": "Subclinical Hypothyroidism",
            "datePublished": "Tue, 09 Jul 2019 15:00:00 +0000",
            "description": "<p>Subclinical hypothyroidism is common, but it is not clear how best to treat it. Anne R. Cappola, MD, ScM, professor of medicine at the University of Pennsylvania, explains how to manage this important clinical condition.</p> <p>Read the article: <a href= \"http://jamanetwork.com/journals/jama/fullarticle/10.1001/jama.2019.9052\"> Subclinical Hypothyroidism: A Review</a></p> <p> </p>",
            "length": "16125217",
            "sourceUrl": "http://traffic.libsyn.com/jamaclinicalreviews/Subclinical_Hypothyroidism.mp3?dest-id=274040"
        },
        {
            "title": "The Clinical Ramifications of Dense Breasts",
            "datePublished": "Tue, 02 Jul 2019 17:00:00 +0000",
            "description": "<p>There are now 36 states and recent federal legislation that require that clinicians inform women about breast density results from mammography. Consequently, clinicians must be aware of the clinical ramifications of dense breasts and what to do about them when found. Karla Kerlikowske, MD, from UCSF explains the risks associated with dense breasts and how to manage patients who have them. CME will be available on July 2 when the print/online issue of JAMA is published.</p>",
            "length": "22786478",
            "sourceUrl": "http://traffic.libsyn.com/jamaclinicalreviews/The_Clinical_Ramifications_of_Dense_Breasts.mp3?dest-id=274040"
        },
        {
            "title": "California’s Attempt to Improve Measles Vaccination Rates",
            "datePublished": "Tue, 02 Jul 2019 15:00:00 +0000",
            "description": "<p>California enacted 3 aggressive laws between 2014 and 2016 in an effort to improve measles vaccination rates. To a large extent these laws were effective in increasing vaccination rates, but some of the improvements were offset by clinicians granting inappropriate medical exemptions for vaccinations. S. Cassandra Pingali, MPH, MS, and Saad B. Omer, MBBS, MPH, PhD, from the Department of Epidemiology at Emory University, Atlanta, Georgia, discuss measles and what happened in California when legislators tried to improve measles vaccination rates. CME will be available on July 2 when the print/online issue of JAMA is published.</p>",
            "length": "19295684",
            "sourceUrl": "http://traffic.libsyn.com/jamaclinicalreviews/California_s_Attempt_to_Improve_Measles_Vaccination_Rates.mp3?dest-id=274040"
        },
        {
            "title": "Reducing the Intensity of Antiplatelet Therapy Following Coronary Stent Procedures",
            "datePublished": "Tue, 25 Jun 2019 15:00:00 +0000",
            "description": "<p>A conversation with Greg Curfman, MD, JAMA Deputy Editor and a cardiologist, who reviews 2 new studies showing that a short duration of dual antiplatelet therapy may not result in more myocardial ischemic events.</p> <p>Read the article: <a href= \"http://jamanetwork.com/journals/jama/fullarticle/10.1001/jama.2019.8145\"> Effect of 1-Month Dual Antiplatelet Therapy Followed by Clopidogrel vs 12-Month Dual Antiplatelet Therapy on Cardiovascular and Bleeding Events in Patients Receiving PCI: The STOPDAPT-2 Randomized Clinical Trial</a></p> <p> </p>",
            "length": "11385866",
            "sourceUrl": "http://traffic.libsyn.com/jamaclinicalreviews/Reducing_the_Intensity_of_Antithrombotic_Therapy_Following_Coronary_Stent_Procedures.mp3?dest-id=274040"
        },
        {
            "title": "The Gabby Giffords Shooting",
            "datePublished": "Tue, 11 Jun 2019 21:00:00 +0000",
            "description": "<p>Over the span of less than a minute, a gunman with a history of mental health issues turned a Safeway parking lot into the scene of a mass shooting, killing 6 and wounding 13 in 20 seconds. In this inaugural episode of the In Our Lane podcast series, we hear the stories of the survivors who wrestled the gunman to the ground and treated the injured during the wait for first responders.</p>",
            "length": "77704748",
            "sourceUrl": "http://traffic.libsyn.com/jamaclinicalreviews/In_Our_Lane__The_Gabby_Giffords_Shooting-_Tucson_AZ_-_January_8_2011.mp3?dest-id=274040"
        },
        {
            "title": "Abnormal Uterine Bleeding",
            "datePublished": "Tue, 04 Jun 2019 15:00:00 +0000",
            "description": "<p>Andrew M. Kaunitz, MD, from the Department of Obstetrics and Gynecology at the University of Florida, Jacksonville, explains how to diagnose and treat various patterns of abnormal uterine bleeding.</p> <p>Read the article: <a href= \"http://jamanetwork.com/journals/jama/fullarticle/10.1001/jama.2019.5248\"> Abnormal Uterine Bleeding in Reproductive-Age Women</a></p> <p> </p>",
            "length": "33756492",
            "sourceUrl": "http://traffic.libsyn.com/jamaclinicalreviews/Abnormal_Uterine_Bleeding.mp3?dest-id=274040"
        },
        {
            "title": "Menopausal Hormone Therapy",
            "datePublished": "Thu, 30 May 2019 15:00:00 +0000",
            "description": "<p>Jan L. Shifren, MD, from the department of obstetrics and gynecology, Massachusetts General Hospital, and Harvard Medical School discusses menopausal symptoms such as hot flashes and how they can be effectively treated by the administration of hormones when given appropriately.</p> <p>Read the article: <a href= \"http://jamanetwork.com/journals/jama/fullarticle/10.1001/jama.2019.5346\"> Menopausal Hormone Therapy</a></p> <p>CME will be available on June 25 when this article appears in the print edition of JAMA.</p>",
            "length": "28638217",
            "sourceUrl": "http://traffic.libsyn.com/jamaclinicalreviews/Menopausal_Hormone_Therapy.mp3?dest-id=274040"
        }
    ]
}