{
    "artwork": "http://is5.mzstatic.com/image/thumb/Music71/v4/f9/20/0f/f9200f64-7160-b861-36df-2fb9b29cdb46/source/100x100bb.jpg",
    "description": "FETIDUS is a Parsec award-winning \"future-noir\" urban fantasy audiobook by James Durham featuring a talented cast and original music score. This freely-downloadable sci-fi/horror/mystery podcast novel is set in the grim and fetid alleys of post-apocalyptic Washington, DC, circa 2034. Art Blanchard, a jaded Washington lobbyist who works for The Foundation for the Ethical Treatment of the Innocently Damned, Undead and Supernatural (FETIDUS), takes up the twisted case of a mysterious woman, which leads him on a thrilling adventure filled with noir-humor, suspense and horror, deep into the world of the shadowy undead. For more information, please visit the author's website: www.jamesdurham.com",
    "feedURL": "http://feeds.jamesdurham.com/jamesdurham",
    "podcastURL": "http://www.jamesdurham.com/updates/",
    "publisher": "James Durham",
    "title": "James Durham Audiobooks - FETIDUS",
    "episodes": [
        {
            "title": "A sea change, a door opens.",
            "datePublished": "Fri, 05 Dec 2014 22:50:39 +0000",
            "description": "Hello Everyone! James Durham here with some big updates!\n\nSometimes cutting right to the point is the best way to handle it. So here \nit is:\n\nEarlier this year, I was diagnosed with cancer.\n\nNow, before you get worried about me, there is very good news. After \ntesting and surgery, the diagnosis is as good as I could hope for. I was \ndiagnosed with a form of cancer that is very curable, and on top of that, I \ncaught it early at stage 1, so I plan to live a long and healthy life. I am \nvery, very lucky.\n\nSo please, no worries about that. I’m fine now, and life is, in fact, \nbetter than ever.\n\nBut through all this, I changed, and I’m continuing to change. In a single, \nsolitary moment, I experienced a profound shift in my heart. And I can’t \nshake it — I don’t want to shake it.\n\nRead on for more...",
            "sourceUrl": "http://feeds.soundcloud.com/stream/180147391-jamesdurham-james-durham-update-dec-2014.mp3"
        },
        {
            "title": "Ringing in the New Year with Gratitude and Excitement!",
            "datePublished": "Wed, 01 Jan 2014 20:31:45 +0000",
            "description": "Happy New Year, my friends and fellow travelers! So here we are, in 2014. \nPretty amazing! Almost unbelievable. Yes, 2014. Wow. Where did 2013 go? And \nhow did we get here so quickly? Read on for more...",
            "sourceUrl": "https://images.squarespace-cdn.com/content/v1/4fed91e5e4b032b1c86f2f08/1388608115358-M66HKUC9UKJXPSEWA58D/ke17ZwdGBToddI8pDm48kHUzxcQwd2DgHE3KO6VtZClZw-zPPgdn4jUwVcJE1ZvWQUxwkmyExglNqGp0IvTJZamWLI2zvYWH8K3-s_4yszcp2ryTI0HqTOaaUohrI8PIjemT7TLA_6Za-g0iyqDFH"
        },
        {
            "title": "Update May 2013 - FETIDUS and 95ers and Balticon, Oh My!",
            "datePublished": "Fri, 17 May 2013 01:19:38 +0000",
            "description": "Hello Everyone! James Durham here with a quick, but important update about \nThe World of FETIDUS, 95ers and related news! In this most auspicious of \nupdates, I discuss some very exciting developments that may cause not only \nthe underworld to tremble, but timespace itself to shudder in anticipation. \nRead on, my friend, read on...",
            "length": "5861278",
            "sourceUrl": "http://feeds.soundcloud.com/stream/92562907-jamesdurham-james-durham-update-may-2013.mp3"
        },
        {
            "title": "FETIDUS Has a New Home",
            "datePublished": "Sun, 17 Mar 2013 05:05:00 +0000",
            "description": "So the time has come to finally move FETIDUS to a new home -- to where it \nshould have been right from the beginning! Where, why, how? What's going \non!? What does it mean? Is it the end of the world? Is it the end of our \ngood friend Art Blanchard? No, please! Read on, fair traveler of the \nInterwebs...",
            "sourceUrl": "https://images.squarespace-cdn.com/content/v1/4fed91e5e4b032b1c86f2f08/1363286595869-LX2PJXGE354DSZ8M9EEI/ke17ZwdGBToddI8pDm48kHUzxcQwd2DgHE3KO6VtZClZw-zPPgdn4jUwVcJE1ZvWQUxwkmyExglNqGp0IvTJZamWLI2zvYWH8K3-s_4yszcp2ryTI0HqTOaaUohrI8PIjemT7TLA_6Za-g0iyqDFH"
        },
        {
            "title": "FETIDUS: The Damned Heir - EP20 (2010)",
            "datePublished": "Tue, 11 Jan 2011 20:58:00 +0000",
            "description": "And so the journey is complete, my friends. Episode 20 is here at last! The \nmassive, thrilling, apocalypse-busting 2-hour finale will take you all the \nway to the end of this twisted, dark tale. FETIDUS: The Damned Heir \nEpisode 20 awaits your listening pleasure. Please, come inside, turn down \nthe lights and join Art Blanchard in this final, most beastly of episodes \nof FETIDUS: The Damned Heir.",
            "length": "114536270",
            "sourceUrl": "http://feeds.soundcloud.com/stream/82994541-jamesdurham-fetidus-the-damned-heir-ep20.mp3"
        },
        {
            "title": "FETIDUS: The Damned Heir - EP19 (2010)",
            "datePublished": "Sun, 21 Nov 2010 20:58:00 +0000",
            "description": "Thunder breaks on this dark, twisted night of fate, and Episode 19 awaits \nhungry ears... as we spin wildly towards the conclusion of FETIDUS: The \nDamned Heir. Join us here as we set the stage for the upcoming and final \nepisode, as Art Blanchard unwinds the mysteries of the Donners with his own \nfate on the line. The journey is nearly complete... do world-changing \nanswers await, does Art finally solve the epic case that could change... \neverything? Come inside and find out...",
            "length": "50730203",
            "sourceUrl": "http://feeds.soundcloud.com/stream/82994540-jamesdurham-fetidus-the-damned-heir-ep19.mp3"
        },
        {
            "title": "FETIDUS: The Damned Heir - EP18 (2010)",
            "datePublished": "Mon, 08 Nov 2010 20:58:00 +0000",
            "description": "And now for the dark and beastly Episode 18. Join us inside one of the most \ndangerous places in post-apocalyptic DC. Art Blanchard tempts fate in this \njumbo-sized episode, as we approach the grand finale a mere two episodes \nfrom now! Please come inside, sit down, turn down the lights, and listen to \nwhat lurks in the shadows...",
            "length": "65565665",
            "sourceUrl": "http://feeds.soundcloud.com/stream/82994539-jamesdurham-fetidus-the-damned-heir-ep18.mp3"
        },
        {
            "title": "FETIDUS: The Damned Heir - EP17 (2010)",
            "datePublished": "Fri, 29 Oct 2010 20:58:00 +0000",
            "description": "The time has nearly come... the finale is only three episodes away! Join us \nhere in roasty Episode 17 as we begin the final countdown. Art Blanchard \nhas a lot to juggle, what with uncovering a mystery or two, and tugging on \nthe dangerous threads of a long-cold case that might lead him to his lost \nlove.",
            "length": "61846183",
            "sourceUrl": "http://feeds.soundcloud.com/stream/82994538-jamesdurham-fetidus-the-damned-heir-ep17.mp3"
        },
        {
            "title": "FETIDUS: The Damned Heir - EP16 (2010)",
            "datePublished": "Fri, 22 Oct 2010 20:57:00 +0000",
            "description": "As we approach the finale, Art Blanchard goes on the offensive with his \nlobbying skills in Episode 16. He's still got it. Download now and listen \nas the stakes in this twisted case grow higher, with political power \nplayers a-plenty in the cards...",
            "length": "57117811",
            "sourceUrl": "http://feeds.soundcloud.com/stream/82994536-jamesdurham-fetidus-the-damned-heir-ep16.mp3"
        },
        {
            "title": "FETIDUS: The Damned Heir - EP15 (2010)",
            "datePublished": "Fri, 15 Oct 2010 20:57:00 +0000",
            "description": "What do you get when you combine an old DC cemetery, a post-apocalyptic \nmystery and Art Blanchard hot on the trail? You get Episode 15! Join in \nwith the gravestones and watch a little conversation unfold between Art and \na gorgeous, twisted dame.",
            "length": "59469458",
            "sourceUrl": "http://feeds.soundcloud.com/stream/82994535-jamesdurham-fetidus-the-damned-heir-ep15.mp3"
        },
        {
            "title": "FETIDUS: The Damned Heir - EP14 (2010)",
            "datePublished": "Fri, 08 Oct 2010 20:57:00 +0000",
            "description": "Episode 14 has arrived for your listening pleasure. This one takes you to \nthe halls of Congress and deep into the shadows of Representative Phil \nDonner, with some revealing appearances by several cast members. The case \nspirals forward, like a festering zombie infection, unchecked by inhibitors \nor preservatives. Enter now, and enjoy!",
            "length": "51861556",
            "sourceUrl": "http://feeds.soundcloud.com/stream/82994534-jamesdurham-fetidus-the-damned-heir-ep14.mp3"
        },
        {
            "title": "FETIDUS: The Damned Heir - EP13 (2010)",
            "datePublished": "Fri, 01 Oct 2010 20:57:00 +0000",
            "description": "Lucky Episode number 13 here! Come and get it. This one takes a dark path \ndown a darker alley into Art Blanchard's shadow-enshrouded mind. Be warned, \nthere are no butterflies and daisies in this episode. Brace yourself, and \ndownload now...",
            "length": "65809063",
            "sourceUrl": "http://feeds.soundcloud.com/stream/82994532-jamesdurham-fetidus-the-damned-heir-ep13.mp3"
        },
        {
            "title": "FETIDUS: The Damned Heir - EP12 (2010)",
            "datePublished": "Fri, 24 Sep 2010 20:56:00 +0000",
            "description": "The twisted case drives deep into the past in Episode 12! Art Blanchard \nvisits the site that may hold dark secrets to the case, and new clues \nemerge like a bad zombie infection, as we barrel down the mountain towards \nthe fateful finale in the coming episodes. Download now, and enjoy.",
            "length": "64420393",
            "sourceUrl": "http://feeds.soundcloud.com/stream/82994531-jamesdurham-fetidus-the-damned-heir-ep12.mp3"
        },
        {
            "title": "FETIDUS: The Damned Heir - EP11 (2010)",
            "datePublished": "Fri, 17 Sep 2010 20:56:00 +0000",
            "description": "Here's Episode 11! If FETIDUS Episodes had individual titles, then this one \nwould be called \"Customer Service\" for sure! You'll see why. Art Blanchard \ncontinues ever forward, ever deeper into the case, as he tracks down \nobscure clues hidden in the past. His fateful journey takes him right into \npost-apocalyptic Salt Lake City, Utah. Download now, and enjoy.",
            "length": "65138062",
            "sourceUrl": "http://feeds.soundcloud.com/stream/82994530-jamesdurham-fetidus-the-damned-heir-ep11.mp3"
        },
        {
            "title": "FETIDUS: The Damned Heir - EP10 (2010)",
            "datePublished": "Fri, 10 Sep 2010 20:56:00 +0000",
            "description": "And now for some steamy, smoldering heat of another kind... Welcome to \nEpisode 10! Art Blanchard is hot on the case, and by hot, I mean really, \nreally hot. When the world has gone to hell, a man has to do what a man has \nto do... to solve a case. And by damn, this case has new leads to follow. \nDownload now, and enjoy.",
            "length": "84727567",
            "sourceUrl": "http://feeds.soundcloud.com/stream/82994529-jamesdurham-fetidus-the-damned-heir-ep10.mp3"
        },
        {
            "title": "FETIDUS: The Damned Heir - EP09 (2010)",
            "datePublished": "Fri, 03 Sep 2010 20:55:00 +0000",
            "description": "Episode 9 has arrived, stealthily, in the middle of the night. What secrets \nlie within? What of the case? And what befalls Art Blanchard? You are only \none click away from finding out. I'm thrilled to bring you Episode 9 of \nFETIDUS: The Damned Heir! And for those that supported Art Blanchard from \nearly on, this one is dedicated to you. I hope you enjoy it.",
            "length": "77790490",
            "sourceUrl": "http://feeds.soundcloud.com/stream/82994528-jamesdurham-fetidus-the-damned-heir-ep09.mp3"
        },
        {
            "title": "FETIDUS: The Damned Heir - EP08 (2010)",
            "datePublished": "Fri, 27 Aug 2010 20:55:00 +0000",
            "description": "And now for Episode 8 of FETIDUS: The Damned Heir! This jumbo-sized episode \nwas one of the most difficult to create of the series, but it was worth \nevery drop of sweat and blood that went into it. Literally and \nfiguratively. This was also the cliffhanger of the original run of FETIDUS. \nI am so thrilled to bring you up to date with this remixed version, so that \nonce you listen to its meaty hour-plus spiral into the dark recesses of Art \nBlanchard's mind, you can be prepared to tune back in next Friday to see \nwhat happens in Episode 9. For those that have waited patiently for Episode \n9, your time is almost here. One more week to go! Until then, please, step \ninside, and join Art Blanchard in this thrilling Episode 8.",
            "length": "92061492",
            "sourceUrl": "http://feeds.soundcloud.com/stream/82994526-jamesdurham-fetidus-the-damned-heir-ep08.mp3"
        },
        {
            "title": "FETIDUS: The Damned Heir - EP07 (2010)",
            "datePublished": "Fri, 20 Aug 2010 20:55:00 +0000",
            "description": "Welcome back for Episode 7 of FETIDUS: The Damned Heir! This one is loaded \nto the noir-esque brim with great performances from the cast and enough \nambiance to make sure you get to know Leigh Donner better than ever. \nThere's plenty of post-apocalyptic goodness inside of it... including a \nlittle experiment where you can hear yours truly sing a song. Yes, that's \nme singing on the radio later on in the episode. Download now and dive into \nEpisode 7 of FETIDUS: The Damned Heir!",
            "length": "62398516",
            "sourceUrl": "http://feeds.soundcloud.com/stream/82994525-jamesdurham-fetidus-the-damned-heir-ep07.mp3"
        },
        {
            "title": "FETIDUS: The Damned Heir - EP06 (2010)",
            "datePublished": "Fri, 13 Aug 2010 20:54:00 +0000",
            "description": "Episode 6 has arrived! Get your fresh Episode 6! The story continues \nunabated, and in this loaded episode, I introduce you to more of the key \nplayers in this ever-deepening mystery of post-apocalyptic political \nintrigue. Download now and experience Episode 6 of FETIDUS: The Damned Heir \nas the pieces of the case begin to fall into place...",
            "length": "55067094",
            "sourceUrl": "http://feeds.soundcloud.com/stream/82994524-jamesdurham-fetidus-the-damned-heir-ep06.mp3"
        },
        {
            "title": "FETIDUS: The Damned Heir - EP05 (2010)",
            "datePublished": "Fri, 06 Aug 2010 20:54:00 +0000",
            "description": "And now the mystery deepens with Episode 5 of FETIDUS: The Damned Heir! The \ncase of Leigh Donner takes on another dimension and clues reveal themselves \nwith subtle and ominous implications. Please, come inside, and visit the \nNational Museum of American History as Art Blanchard tries to decipher the \ntwisted story of a powerful Congressman. Sit down, relax, close your eyes \nand please enjoy this episode.",
            "length": "48032214",
            "sourceUrl": "http://feeds.soundcloud.com/stream/82994523-jamesdurham-fetidus-the-damned-heir-ep05.mp3"
        },
        {
            "title": "FETIDUS: The Damned Heir - EP04 (2010)",
            "datePublished": "Fri, 30 Jul 2010 20:54:00 +0000",
            "description": "And now for Episode 4 of FETIDUS: The Damned Heir! This one is a wild ride, \nso join Art Blanchard as he takes an unexpected detour on his way to the \nNational Museum of American History. Yeah, this is what Washington DC is \nlike in 2034. Sorry to disappoint you if you thought DC would be a blissful \nutopia by then. :)",
            "length": "43671855",
            "sourceUrl": "http://feeds.soundcloud.com/stream/82942766-jamesdurham-fetidus-the-damned-heir-ep04.mp3"
        },
        {
            "title": "FETIDUS: The Damned Heir - EP03 (2010)",
            "datePublished": "Fri, 23 Jul 2010 20:53:00 +0000",
            "description": "Welcome back, fine fiendish friends and listeners far and wide, to Episode \n3 of FETIDUS: The Damned Heir! The plot thickens in this episode as Art \nBlanchard finally sits down with his new mysterious client, Leigh Donner, \nto find out what she's hiding. The political stakes are high and the \nundead-infested streets of Washington, DC could be changed forever.",
            "length": "51077255",
            "sourceUrl": "http://feeds.soundcloud.com/stream/82942764-jamesdurham-fetidus-the-damned-heir-ep03.mp3"
        },
        {
            "title": "FETIDUS: The Damned Heir - EP02 (2010)",
            "datePublished": "Fri, 16 Jul 2010 20:53:00 +0000",
            "description": "The twisted tale continues deep into the mind of Art Blanchard, with \nEpisode 2 of FETIDUS: The Damned Heir! Join us back in the world of \nFETIDUS, stay for a while, and come to know our unlikely hero of sorts, as \nhe delves head-first into a midnight mystery in the dark and fetid alleys \nof Washington, DC.",
            "length": "55098441",
            "sourceUrl": "http://feeds.soundcloud.com/stream/82942763-jamesdurham-fetidus-the-damned-heir-ep02.mp3"
        },
        {
            "title": "FETIDUS: The Damned Heir - EP01 (2010)",
            "datePublished": "Fri, 09 Jul 2010 20:52:00 +0000",
            "description": "In the middle of a smoldering, humid July night, in the dark and fetid \nbackstreets of post-apocalyptic Washington, DC,  circa 2034, Art Blanchard \nis on the hunt.  So begins FETIDUS: The Damned Heir!",
            "length": "60354695",
            "sourceUrl": "http://feeds.soundcloud.com/stream/82942762-jamesdurham-fetidus-the-damned-heir-ep01.mp3"
        }
    ]
}