{
    "artwork": "http://is4.mzstatic.com/image/thumb/Music117/v4/b5/3a/aa/b53aaa71-ee6f-f62f-ee94-1bf4f3ce8989/source/100x100bb.jpg",
    "description": "It is my great pleasure to publish this weekly podcast that supplements my book \"Hacking Engagement\". Listen and get creative ideas on how to engage students tomorrow! Please visit my website: http://jamesalansturtevant.com/ And...for a cornucopia of teacher empowerment resources, visit: http://hacklearning.org/",
    "feedURL": "https://www.spreaker.com/show/1810280/episodes/feed",
    "podcastURL": "https://www.spreaker.com/show/james-sturtevant-hacking-engagement",
    "title": "James Sturtevant Hacking Engagement",
    "episodes": [
        {
            "title": "143 Helping the Technologically Disadvantaged Student...Starring Jalen Wells",
            "datePublished": "Mon, 02 Nov 2020 01:09:39 +0000",
            "description": "Covid has forced educators to take portions of their instruction, or all of their instruction, online. It’s quite an adjustment for all concerned. But imagine, and perhaps you’ve faced this, that a significant portion of your student’s home technology setup is inadequate, or non-existent. What do you?<br /><br />In this episode, we’ll ask Jalen Wells this question. Jalen teaches history at Great Mills High School in Great Mills, Maryland. Many of his students have such technological obstacles. Covid has multiplied exponentially this digital divide. Jalen will talk about what his school has done and what he has done to help these students.",
            "length": "45118894",
            "sourceUrl": "https://api.spreaker.com/download/episode/41750295/143_helping_the_technologically_disadvantaged_student_starring_jalen_wells.mp3"
        },
        {
            "title": "142 Four Ways to Dramatically Improve your Next Zoom Call...Starring Bernard Johnson, Christian Manna and Emily Montgomery",
            "datePublished": "Tue, 27 Oct 2020 21:10:07 +0000",
            "description": "The first time I was a participant in a Zoom call, I was so impressed. It felt so futuristic. I thought highly of it and was excited to do another.<br /><br />Covid however, like with many things we treasure, wiped out this euphoria. Zoom calls sprouted up everywhere. I grew to dread the dreaded Zoom call invitation. Here are some reasons why:<br /><br />They’re too many participants.<br />They’re not engaging.<br />They’re too long.<br />Most are time and place bound.<br /><br />In this episode, I’ll offer a remedy to each of these problems. Here are four objectives that I follow in my engaging Zoom call quest:<br /><br />small intimate experiences<br />highly engaging preparation and discussion prompts<br />30 minute call limit<br />recorded and made available to non-participants<br /><br />I’d like to take each of these objectives and go into a bit more depth",
            "length": "52076887",
            "sourceUrl": "https://api.spreaker.com/download/episode/41668885/142_four_ways_to_dramatically_improve_your_next_zoom_call_starring_bernard_johnson_christian_manna_and_emily_montgomery.mp3"
        },
        {
            "title": "141 Veteran Music Educator Robert Trocchia Takes us to the Mountaintop",
            "datePublished": "Thu, 15 Oct 2020 23:52:19 +0000",
            "description": "In the fall of 1979, I was a freshman in a college dorm trying to adjust to my new surroundings. One thing that I’ve always done to ground myself has been to play the music that I love. I grew up in a small town in Southeastern Ohio that was not diverse. And yet, my musical taste was totally urban. I loved the Isley Brothers and the Brothers Johnson and Earth Wind and Fire. <br /><br />One transformational afternoon, I put on some of my jams, which inspired a guy a couple of doors down to walk to my room, pop his head in, and then joyously proclaim, “I can’t believe you're listening to these jams. I didn't think anyone on this floor loved the Isley Brothers.” That guy was Vince Trocchia and a lifelong friendship evolved from this initial interaction. <br /><br />In October of that magical year, Vince invited me to his house for dinner. I eagerly accepted. I was treated to a magnificent Italian meal and met Vince’s wonderful family. I was so intrigued by his dad Robert.<br /><br />Robert was the iconic local music teacher at Fairfield Union High School in Breman, Ohio. <br />His choir from a small Ohio town:<br />Performed in many of the great cathedrals in the western world<br />Appeared on nearly fifty TV shows<br />And was named one of the top high school choirs in the United States.<br /><br />It was evident from the moment that I met him how much Robert loved his life. I had no idea what I wanted to do with my future at this point, but his example impacted me. I viewed him as immensely rich. This evaluation had nothing to do with his stock portfolio.<br /><br />Robert is now 86-years-old. You would never guess that when you listen to his powerful voice. He seems exactly the same to me as he did forty years ago. <br /><br />When I learned that Robert authored a book about teaching, I knew that I had to get it and that I had to have him as a guest on this podcast. Mountaintop Moments is a wonderful book for any teacher, at any grade level, teaching any subject. Embrace the message of this wise sage!",
            "length": "80257126",
            "sourceUrl": "https://api.spreaker.com/download/episode/41484305/141_veteran_music_educator_robert_trocchia_takes_us_to_the_mountaintop.mp3"
        },
        {
            "title": "141 Veteran Music Educator Robert Trocchia Takes us to the Mountaintop",
            "datePublished": "Thu, 15 Oct 2020 23:47:58 +0000",
            "description": "In the fall of 1979, I was a freshman in a college dorm trying to adjust to my new surroundings. One thing that I’ve always done to ground myself has been to play the music that I love. I grew up in a small town in Southeastern Ohio that was not diverse. And yet, my musical taste was totally urban. I loved the Isley Brothers and the Brothers Johnson and Earth Wind and Fire. <br /><br />One transformational afternoon, I put on some of my jams, which inspired a guy a couple of doors down to walk to my room, pop his head in, and then joyously proclaim, “I can’t believe you're listening to these jams. I didn't think anyone on this floor loved the Isley Brothers.” That guy was Vince Trocchia and a lifelong friendship evolved from this initial interaction. <br /><br />In October of that magical year, Vince invited me to his house for dinner. I eagerly accepted. I was treated to a magnificent Italian meal and met Vince’s wonderful family. I was so intrigued by his dad Robert.<br /><br />Robert was the iconic local music teacher at Fairfield Union High School in Breman, Ohio. <br />His choir from a small Ohio town:<br />Performed in many of the great cathedrals in the western world<br />Appeared on nearly fifty TV shows<br />And was named one of the top high school choirs in the United States.<br /><br />It was evident from the moment that I met him how much Robert loved his life. I had no idea what I wanted to do with my future at this point, but his example impacted me. I viewed him as immensely rich. This evaluation had nothing to do with his stock portfolio.<br /><br />Robert is now 86-years-old. You would never guess that when you listen to his powerful voice. He seems exactly the same to me as he did forty years ago. <br /><br />When I learned that Robert authored a book about teaching, I knew that I had to get it and that I had to have him as a guest on this podcast. Mountaintop Moments is a wonderful book for any teacher, at any grade level, teaching any subject. Embrace the message of this wise sage!",
            "length": "80257126",
            "sourceUrl": "https://api.spreaker.com/download/episode/41484255/141_veteran_music_educator_robert_trocchia_takes_us_to_the_mountaintop.mp3"
        },
        {
            "title": "140 Formative Assessment that’s Engaging and Relevant...Starring Aurora Dollins, Brianna Pasco, and Alex Staton",
            "datePublished": "Thu, 24 Sep 2020 18:18:52 +0000",
            "description": "Formative assessment is not done enough. I believe that part of the problem is that teachers simply don’t know enough about it, or how to do it. I was unclear on both of these counts a decade ago. It makes me sad to think of all the students who matriculated through my class before I became aware of this powerful tactic. <br /><br />Hopefully, this episode will inspire and enlighten you. I finally have students joining me once again.  Aurora Dollins, Brianna Pasco, and Alex Staton are students in my Assessment class at Muskingum University. I love interviewing Education majors because they have a unique perspective. They get what it’s like to be a student, but they are constantly evaluating how they will utilize approaches and tools once they become instructors. <br />﻿",
            "length": "31809264",
            "sourceUrl": "https://api.spreaker.com/download/episode/41105212/140_formative_assessment_that_s_engaging_and_relevant_starring_aurora_dollins_brianna_pasco_and_alex_staton.mp3"
        },
        {
            "title": "139 Path 44...Starring Dr. Dorothy VanderJagt is Prompting you to Pause",
            "datePublished": "Tue, 01 Sep 2020 19:10:49 +0000",
            "description": "Dr. Dorothy VanderJact and I have recently become friends. Dorothy is veteran educator from the great state of Michigan. She’s been a middle school teacher, an elementary principal, a central office administrator, and a college professor. That’s, a lot of perspective. <br /><br />Two months ago, her brand new book Permission to Pause was released. Her timing was perfect. This book will help discombobulated teachers get their bearings and evolve into a state of well-being. While her timing on releasing this book is perfect, it’s worthy COVID or not. Dr. Dorothy wants teachers to pause and reflect. I’m a big fan. In this episode, she’ll tell you why it’s important to pause and reflect and how you can do it!",
            "length": "47655835",
            "sourceUrl": "https://api.spreaker.com/download/episode/40638397/139_path_44_starring_dr_dorothy_vanderjagt_is_prompting_you_to_pause.mp3"
        },
        {
            "title": "138 Path 9...David Crowell Talks Student Motivation",
            "datePublished": "Mon, 24 Aug 2020 15:08:36 +0000",
            "description": "Path 9 in my new book Teaching in Magenta is about Venerating a Veteran. I’m going to read Path 9:<br /><br />One negative aspect of aging is the feeling that you’re losing relevance. I’m fortunate in that younger teachers sometimes reach out to me for guidance. When they do, it makes me feel awesome. I try to give them solid advice, and many are grateful. What they don’t realize is how energizing it is for me when they ask. Today, seek out an older colleague and pay them a compliment or ask for advice. You’ll be doing them (and you) a great service, and they just may give you a wonderful suggestion. <br /><br />Today’s episode is in the spirit of Path 9. Recent episodes that I’ve produced about specific paths in my book have been short. This one, is an exception. This is an extensive conversation with Pennsylvania teaching and coaching legend David Crowell. So–while I’m certainly venerating a veteran, we delve into the provocative topic of motivation. How can educators motivate students? Because this topic is so rich and important, we went on for a bit. <br /><br />I learned about Coach Crowell from my friend the innovative instructional coach Michael Brilla. Michael has been a guest on this podcast twice and like a lot of my guests, we’ve become friends. Michael predicted that Coach Crowell and I would hit it off. He was right! There was only one divergence, however. Coach is more nostalgic than me. But other than that, I found myself doing a lot of head-nodding as I listened to David stress the transformational potential of relationships. <br /><br />While David has retired from the classroom, he’s still coaching wrestling, and is a frequent presenter with the National Wrestling Coaches Association.",
            "length": "75769745",
            "sourceUrl": "https://api.spreaker.com/download/episode/40471654/138_path_9_david_crowell_talks_student_motivation.mp3"
        },
        {
            "title": "137 What did you do During the Pandemic Path 40",
            "datePublished": "Tue, 11 Aug 2020 16:30:09 +0000",
            "description": "Well–ready or not, school will be starting soon, For some of us, it's already started. My first day is next Wednesday. Many colleges, like mine, are in session for 3 months, they then adjourn at Thanksgiving, and then don't resume till January. It'll be the longest winter break that I've ever experienced. That actually sounds pretty awesome. <br /><br />If you're like me, the idea of jumping back in the saddle comes with joy, but a few mixed feelings. There have been aspects of my life over the last few months which have been positive. I'll touch on some of those in this episode. <br /><br />Last spring, I taught virtually like everyone else. This fall, I'll be teaching a blended class. It's a new challenge for me and I'm excited about it. Without a doubt, I'm mostly glad I'm returning next week. But, I haven't been physically in front of students for months. While I'm looking forward to it, there's a small tinge of, Can I still do this? I imagine I'm not alone in this emotion. My prediction is that the vast majority of us will feel totally at home and thrilled to be back in our natural habitat. <br /><br />This program might stoke some ideas for that first week with students. Are you going to talk about the long absence from school? Are you going to address virtual learning last spring? <br /><br />On a TYPICAL first week of school, educators often incorporate some type of prompt which challenges students to reflect on their summer vacation. This first week of school year won't be a typical.",
            "length": "13197266",
            "sourceUrl": "https://api.spreaker.com/download/episode/40269768/137_what_did_you_do_during_the_pandemic_path_40.mp3"
        },
        {
            "title": "136 Path 57 Close Your Door",
            "datePublished": "Tue, 04 Aug 2020 16:53:45 +0000",
            "description": "For the next five weeks, I'm going to try an experiment. My new book Teaching in Magenta was inspired by Niki's gift. My book is divided into 5 sections based on qualities of magenta:<br />Compassion<br />Optimism<br />Balance<br />Adaptability<br />Contentment<br /><br />I'm going to read 1 path from a different section each week. Today, I'll focus on Path 57, which can be found in the section on Balance.",
            "length": "10473601",
            "sourceUrl": "https://api.spreaker.com/download/episode/40141181/136_path_57_close_your_door.mp3"
        },
        {
            "title": "135 Teaching in Magenta–The Elevator Pitch",
            "datePublished": "Wed, 29 Jul 2020 13:04:14 +0000",
            "description": "Imagine that you and I step into an elevator together. Secured under my arm is a copy of my new book Teaching in Magenta.  You notice the book and ask me about it. <br /><br />Your question instantly makes me realize a couple of things:<br /><br />This is a classic scenario for an elevator pitch.<br />I better make these next few seconds count before the doors open and you disappear. <br /><br />So–I lay on you my elevator pitch for Teaching in Magenta: <br /><br />This book provides 100 ways to CREATE a magnificent day in the classroom. Once you start stringing some Magenta Days together, you and your students will experience profound well-being and deep joy. <br /><br />Thankfully, you receive my pitch positively and then inquire, “That sounds interesting. Why did you write it? Why is Magenta in the title? How does one teach in magenta?” <br /><br />This podcast answers those questions.  <br /><br />I’m so excited to bring you this new book Teaching in Magenta. Over the next few weeks, I’ll do 5 short podcasts which detail paths directly from the book. I’m going to help you create 5 magnificent days in your classroom. But today, I’m going to lay some groundwork. <br /><br />Today’s episode will: <br />Explain why I started writing books a decade ago.<br />How I got that book published. <br />Explain why I wrote Teaching in Magenta.<br />Describe Teaching in Magenta.<br /><br />Please check out my book Teaching in Magenta. And if you’re not ready to hit the buy now button on Amazon, but you’re intrigued and you’re willing to listen more as we ride the elevator up a few more floors, check back soon and I’ll describe one path to create a magnificent day for you and your students.",
            "length": "20164852",
            "sourceUrl": "https://api.spreaker.com/download/episode/40033035/135_teaching_in_magenta_the_elevator_pitch.mp3"
        },
        {
            "title": "134 Dr. Traci Tuttle Encourages you to Forge a Partnership with Higher Ed",
            "datePublished": "Mon, 29 Jun 2020 23:22:57 +0000",
            "description": "I was a Poli-Sci and History major in college. My senior year, I made the decision to obtain a teaching certificate. I wasn’t certain what I was going to do, so I decided that I could teach a few years while I sorted it out. <br /><br />﻿One of my first Education classes was Audio Visual Resources. We learned such mystical skills as using a laminator, threading a movie projector, producing copies on a mimeograph machine, and manipulating a film strip. Even at the time, these technologies seemed dated. I couldn’t believe that I was paying tuition for this. That was an easy A. I had other Education classes that were relevant and challenging, but  I secured my teaching certificate without too much sweat and promptly forgot about my preparation experiences once I got my first teaching job. <br /><br />Many educators have similar stories. I’ve heard many a colleague describe their teacher preparation majors as a series of irrelevant hopes that they had to jump through. And this, dear reader, is where Dr. Traci Tuttle makes a dramatic entrance. Traci is the Education Department Chair at Muskingum University. Traci totally understands frustrations with educator preparation programs. She experienced them too. Consequently, she's highly motivated to create a different experience for the Education majors at Muskingum. In this episode she talks about this some, but what really motivates her is her objective to foster partnerships with K-12 educators. I believe she gets this because she spent many years as a K-12 teacher.<br /><br />You’re going to enjoy this convo and hopefully it will inspire you to seek out a partnership with an institution of higher learning.",
            "length": "66694188",
            "sourceUrl": "https://api.spreaker.com/download/episode/34643603/134_dr_traci_tuttle_encourages_you_to_forge_a_partnership_with_higher_ed.mp3"
        },
        {
            "title": "133 Restorative Practices and Trauma Informed Teaching...Starring Dora Riggs",
            "datePublished": "Thu, 04 Jun 2020 22:40:15 +0000",
            "description": "I enjoy conducting professional development, particularly when I’m commissioned to present on teacher wellbeing. I take the audience on a journey of various challenges a teacher faces during different stages of a 30 year career. Because I logged 34 years in a public school classroom, I have plenty of material. I enjoy describing my struggles at various junctures. Generally, I recreate a challenge that was unique to a phase I was navigating. Rarely in these stories, am I the hero. I love to talk about learning valuable lessons–that I often learned the hard way. <br /><br />One such lesson happened 7 years into teaching. I call it my 7-year-itch lesson. I was 32, and I felt stymied. All the incentives in education were internal. Your compensation was based on experience and education level. There were darned few avenues of advancement. You could become an administrator, or a head coach, but neither of those options appealed to me. I felt trapped. So I left teaching and went into the private sector where I’d be compensated based on what I did, not who I was. <br /><br />I have a good skill set for being successful in sales. But just because one has potential, does not mean one should select a certain career path. I had no idea how much I’d miss my students. The interactions I had with sales clients could not compare. These interactions were highly transactional and sometimes confrontational. I desperately missed my students and went hightailing it back. <br /><br />This experience was immensely valuable, because I learned that my love for the relationships that blossomed between students and me far out shadowed frustrations I had with the job. My sabbatical, consequently, was hugely beneficial to my wellbeing. <br /><br />I bring this up, because today I’ll interview a teacher that took such a similar hyattus. This episode is also special because Dora Riggs used to be my student. She not only left a cushy teaching gig in an affluent suburban high school, but she returned to an urban district. Her students and the community where she now teaches, while only 10 miles from her previous school, could not be more different. Dora will talk about her teacher gap year–and more interestingly how it and her new surroundings have impacted her. She loves her new school. She’s become a trauma informed teacher and a disciple of restorative practices. She’s a different teacher–a more empathetic teacher. Dora is going to explain why and how.",
            "length": "77424248",
            "sourceUrl": "https://api.spreaker.com/download/episode/29496431/133_restorative_practices_and_trauma_informed_teaching_starring_dora_riggs.mp3"
        },
        {
            "title": "132-Coach Mike Burgener and the Quest for Mentors",
            "datePublished": "Mon, 04 May 2020 17:12:46 +0000",
            "description": "When I retired from teaching high school last year, I worried about losing all of the social interaction that I got from teaching 150 students daily. So, I secured an adjunct position teaching aspiring educators at Muskingum University. I also teach refugees how to speak English. These teaching gigs have been a joy, but it’s a different life because I’m only teaching 3 days a week–which is also a joy. My new-found freedom affords me the opportunity to explore, grow, and take risks. I also want to keep expanding my human capital. Relationships make life worth living and I love forging new ones. <br /><br />One area of growth that I’ve been exploring this year is fitness. I have so much more time to workout now and I love it. I researched ways that I could challenge myself physically and grow myself socially. At the end of my exploration, I concluded that I should join a Crossfit gym. Crossfit significantly challenges you physically and promotes community. Crossfit gyms are highly social places. That was exactly what I was looking for. <br /><br />I found an excellent local gym–Crossfit Polaris . Kristi Eramo is the owner and a prominent games athlete. I love her teaching style and was excited to learn from her and the other coaches at Polaris. Unfortunately, the Covid 19 Pandemic short-circuited my plans. After just 3 introductory classes, the gym was forced to close. I was left high and dry. <br /><br />So, I got busy coaching myself. I pulled the workout of the day (WOD) off the Crossfit site and started doing them. I watched training videos and listened to podcasts hoping to improve my olympic lifting form. Lifting is a key part to Crossfit. I decided that I was going to take one of the most challenging olympic lifts–the snatch, and learn how to do it. Here’s a description of a snatch:<br />The snatch can be described as jumping a barbell through a range of motion and receiving it into an overhead squat. <br /><br />And here’s a brief video if you’d like to see a young woman perform one expertly.  You have to be strong, mobile, explosive, coordinated, and courageous to perform this lift.  I’m starting from ground zero, but I’m determined to learn this lift. <br /><br />When I searched for Olympic lifting techniques on Google, YouTube, and podcasts, one name kept materializing–Mike Burgener. Now all of you who’re inclined to exit this podcast because you’re not interested in learning about performing an olympic snatch, stop yourself. This program is not about lifting, it’s about teaching. And Mike Burgener is one of this nation’s premier educators. Here’s a bit about Coach Burgener:<br /><br />He has a BA from Notre Dame and played on their 1966 National Championship Football Team.<br />He has an MS from the University of Kentucky in Exercise Physiology, where he was also the strength coach.<br />He was a captain in the Marine Corps.<br />He’s a Senior International Weightlifting Coach for the United States.<br />He’s considered the Godfather of Olympic Lifting for Crossfit.<br />And for decades, Coach Burgener was a proud public educator–teaching high school physical education in California.<br /><br />I got to know Coach Burgener because I sent him an email asking a question. The next thing I knew, I was in his Level 1 weightlifting class. This is a special man and he’s going to talk about his mentors and challenge you to not only listen to the ones you already have but to be open to new ones.",
            "length": "67897841",
            "sourceUrl": "https://api.spreaker.com/download/episode/26708322/132_coach_mike_burgener_and_the_quest_for_mentors.mp3"
        },
        {
            "title": "131-Remind, Voxer, and YouTube have become my CoronaVirus Allstars",
            "datePublished": "Sat, 11 Apr 2020 16:05:49 +0000",
            "description": "I just checked the human toll of Coronavirus before I wrote this sentence. The US is on the verge of 20,000 deaths and the world has surpassed 100,000. It’s been awful to watch these numbers climb. And I, like hopefully you, remain isolated in my home reading way too many news stories about what’s going on in largely isolated cities and towns and overcrowded hospitals. The whole thing is sad, weird, and unsettling. <br /><br />I will say, however that during this dark time, I’ve gotten myself into a routine with some positives. I’m getting more sleep because I don’t have to set an alarm. I’m eating healthy because my wife and I prepare every meal, with the exception of our once a week pizza night. I workout for 90 minutes most days. And my wife and I enjoy sitting down and watching a program together each night before bed.<br /><br />But those are the only positives I can muster. Man do I miss interacting with people. I get really sick of interacting on my computer or phone and also sitting at my desk. I’m seriously thinking about purchasing a standing desk just to keep moving. Now if you’re getting sick of social distancing–think how sick your students are of navigating online lessons. Sadly, they have a ways to go till school is out. <br /><br />This situation reminds me of a January in the late 1970s. I was in high school and the Midwest got clobbered by a catastrophic blizzard. We were out of school for a month. There was no interaction between the school and students at home. There was no internet and no social media. My friends were able to walk to one another’s houses. There was no social distancing, but the snowy environment did lead to a lot of cabin fever. My friends and I treated the entire time like summer vacation. We played in the snow for a month and forgot about school work. We desperately missed seeing our friends and going to basketball games and school dances, but otherwise we just rolled with it. Please remember that although your students are probably bored, given the option between watching Netflix or doing school work, for many, would be an easy choice. When crafting lessons, starting from that understanding will help.  <br /><br />I recently participated in a Times 10 Roundtable Webinar offering ideas for teachers on how they could instruct their students remotely during this bizarre time. I was joined on the panel by Joe Sanfelippo a superintendent from Wisconsin and Chrissy Romano-Arrabito an elementary teacher from New Jersey. The panel was moderated by Mark Barnes who’s the founder of Times 10 Publications. The discussion was well balanced because we got a broad perspective from Joe, and a younger student and economically disadvantaged perspective from Chrissy. I focused on specific ways you could stay connected with students. I’ll expand on those ideas in this episode. <br /><br />I’ll focus on 3 tools that can maintain and perhaps facilitate deeper relationships with your kids during this challenge. These platforms will also help you teach your classes. I’ll offer these tools as suggestions, if you have something you’ve utilized that works better for you, go for it. I’m more interested in ends and not means.",
            "length": "14212095",
            "sourceUrl": "https://api.spreaker.com/download/episode/25297119/131_remind_voxer_and_youtube_have_become_my_coronavirus_allstars.mp3"
        },
        {
            "title": "130-If you’re Forced to Teach Online due to the Coronavirus–Here’s a Template that Embraces Bloom’s Taxonomy",
            "datePublished": "Sun, 15 Mar 2020 17:47:01 +0000",
            "description": "Well, for at least the next 2 weeks, I’m forced to teach my class in a virtual fashion. All teachers in the great state of Ohio are in the same boat. <br /><br />A few years back, Columbus State Community College commissioned me to create an online version of one of their history classes. It was a tremendous learning experience. When I embarked on that journey, I kept reciting a mantra, Make lessons impactful and engaging. I was able to achieve this throughout the creation process and it’s guiding my efforts over the next few weeks. <br /><br />I learned last week that Muskingum, like all higher ed institutions in Ohio, would be closed until the end of March. My experience creating online content gave me a dose of confidence that I could weather this storm. In this episode, I’ll share my template. This template is grounded in Bloom’s Taxonomy and you can use it every week until the crisis eases and we get back to normal.",
            "length": "16617509",
            "sourceUrl": "https://api.spreaker.com/download/episode/23905545/130_if_you_re_forced_to_teach_online_due_to_the_coronavirus_here_s_a_template_that_embraces_bloom_s_taxonomy.mp3"
        },
        {
            "title": "129-How to Prevent Students from Reaching Their Quit Point...Starring Adam Chamberlin and Svetoslav Metijic",
            "datePublished": "Sat, 15 Feb 2020 12:18:21 +0000",
            "description": "I always referred to February as the Dog Days of Education. The weather, at least for those of us who reside in the northeastern quadrant of these here United States, is pretty bleak. Any newness of the second semester is long gone. As the weather warms, at least just a bit, your opportunities for snow days diminishes and even if it’s still frigid and snowy, perhaps you’ve already used your allotted quota. Spring break, that magical academic elixir, is still a ways off. Students, teachers, and even administrators are starting to get, as my mom used to say, a bit bucky. All of these factors make the topic of this episode a perfect antidote for the February blahs.<br /><br />About a month ago, my publisher Mark Barnes tasked me to evaluate some of x10 Publishing’s books. One of my assignments was to assess Quit Point. As part of the review process, I first checked out the Amazon author’s page. I was floored to learn that Adam Chamberlin and Svetoslav Metijic live only 20 miles from me. My old school competes against theirs in sports frequently. Because of our proximity, I was immediately intrigued by these guys. I was further intrigued as I reviewed their book. <br /><br />Quit Point is all about how teachers can spot when students are about to give up and then what teachers can do about it. I cannot imagine any educator who possesses an ounce of empathy not being fascinated with this topic. And isn’t mid February a perfect time to take action when the symptoms of apathy are often acute? If you feel that way...and hopefully you do, please give this episode a try and then check out these guy’s book. As you listen to them articulate their ideas, I’m certain you’ll find them engaging, funny, and totally on point.",
            "length": "41812644",
            "sourceUrl": "https://api.spreaker.com/download/episode/22803357/129_how_to_prevent_students_from_reaching_their_quit_point_starring_adam_chamberlin_and_svetoslav_metijic.mp3"
        },
        {
            "title": "128-Learn Progress Monitoring by Juggling Bean Bags...Starring Ryan McLane",
            "datePublished": "Sat, 11 Jan 2020 17:45:29 +0000",
            "description": "The State of Ohio, where I’ve taught my entire career, is not unique. Students in certain classes that the state considers essential are subject to end of course exams. Student performance on these standardized assessments are a key ingredient in their instructor’s evaluation. If you teach one of those classes, you’re hopefully all about progress monitoring. The last thing you want is to get a terrible surprise when your student’s performances materialize. Throughout the semester, you want to make darned sure your kids are on track. <br /><br />I was one of those teachers, however, that did not have a state-mandated end of course exam. I taught electives. In Ohio, the alternative for teachers who teach electives is for them to complete an SLO–which stands for Student Learning Objective. You were asked to demonstrate with data that your students grew during your class. Sadly, and I feel badly confessing this, this requirement was a bit of a joke. All you had to do was to give a really hard preassessment. The students would struggle on this benchmark and then do much better on their finals. It was therefore easy to demonstrate with data student growth. <br /><br />As a consequence, and once again I’m not proud to admit this, I didn’t do much progress monitoring in my elective classes. I felt really guilty about my past efforts when I began teaching assessment to college students. I was upfront about my slacker efforts in the past and I then became passionate about encouraging my future educators to frequently monitor student progress regardless of their curriculum. <br /><br />To help in this endeavor, I brought in a guru. Ryan McLane was a high school social studies teacher, the principal at a middle school, the principal of an intermediate building, and now he’s an elementary principal and the district director of special education. He’s also the author of Your School Rocks. He’s observed, managed, and conducted progress monitoring at various levels and in diverse subjects. He also does a magnificent PD on progress monitoring. My students loved his presentation, but more importantly, they felt empowered. They’re now anxious to answer the following questions in their upcoming job interviews:    <br />How do you know if students are learning?<br />What are you going to do for those who struggle?<br /><br />These are important questions for any teacher–particularly if you teach an elective. Ryan will talk in this episode about how elective teachers can become progress monitoring officinados. And before you start wondering, This is a podcast on engagement. What does progress monitoring have to do with that? Stay tuned. Ryan is all about engagement. He’s going to explain how you can take a concept that seems dry and clinical–progress monitoring, and make it engaging and empowering for students and teachers.",
            "length": "40289219",
            "sourceUrl": "https://api.spreaker.com/download/episode/21582394/128_learn_progress_monitoring_by_juggling_bean_bags_starring_ryan_mclane.mp3"
        },
        {
            "title": "127-Maybe, You Should Become an Instructional Coach...Starring Michael Brilla",
            "datePublished": "Mon, 16 Dec 2019 02:31:55 +0000",
            "description": "When I was in my early 30's, I got the 7-year-itch. NO, NO, NO...not to split from the lovely Mrs. Sturtevant, far from it. I was questioning my commitment to education. I was an ambitious competitive young guy. My college peers were climbing corporate ladders. They were wearing suits to work and bringing in some serious bank. They seemed so much more adult.<br /><br />I've always been goal-oriented, which was fine for the first few years in teaching when I was still figuring out the job. But my early 30's I found myself wondering, Can I be satisfied doing this till my mid-50's?<br /><br />I've always been a person of action and so I determined it was time to take some.  I left Education to become a salesperson in the private sector. I reasoned that I possessed a good skill set for sales. I was right, but guess what? I was miserable in my new role. On my hasty exit from my classroom, I totally failed to inventory the wondrous positives of being teacher. I was a popular guy in my school and I loved my students. The first 5 minutes of every class was always devoted to bonding. I would describe what was going on in my life and the students would share about their existences. I totally took this magnificent bond with my students for granted. In the private sector, no one cared what I was reading, what workout I was doing, or what I made Mrs. Sturtevant for dinner the previous night. Instead my interactions were highly transactional. <br /><br />After a 1-year sales gig, I hightailed it back to the classroom. It was so good to be home. It was a magnificent learning experience that I still value and it helped me become a much better and more content educator. <br /><br />But my early frustrations with teaching were certainly not unique. Let's face it, teaching doesn't possess many extrinsic motivators. I don't know that that is necessarily a bad thing. Merit pay has never really delivered on its mythical promises. But there are darned few career advancement opportunities. You could become an administrator, a head coach, a department head, or a guidance counselor. If you're ambitious, you must content yourself with creating the best classroom experience for your students. That's wonderful objective, but perhaps, we need some more options. <br /><br />And this dear listener is where my buddy Michael Brilla walks on the Hacking Engagement stage. Michael is a passionate social studies teacher who's been on this program before. He starred on Episode 105 promoting StoryMaps as a marvelous platform. I loved his energy and I utilize StoryMaps every semester, even with my college students. Michael is creative and ultra-approachable. His students just love him. So why in the world would he leave his magical classroom and assume a new role? Please stay put dear listener and learn the what, the why, and the how. Who knows you might come up with an idea to explore this new year.",
            "length": "40966725",
            "sourceUrl": "https://api.spreaker.com/download/episode/20779623/127_maybe_you_should_become_an_instructional_coach_starring_michael_brilla.mp3"
        },
        {
            "title": "126-Joce McBurney-Buell Will Make you Feel a Lot Better About the Future of Education",
            "datePublished": "Fri, 08 Nov 2019 18:34:24 +0000",
            "description": "I once had a veteran colleague lament about the state of teaching. He meditated, WIth all the that they're making us do, if I was in college today, there's no way I'd major in Education. Apparently, he's not alone in this sentiment. If one searches \"Decline in Education Majors\", one will find plenty of evidence that many undergrads feel exactly as my colleague expressed. Here's a link to 2019 Forbes article which relies heavily on data from the National Center for Education Statistics. Over the past decade, Education has suffered the largest exodus compared with other majors–a decline of 19%. While I'm sad that declining numbers of young Americans consider teaching a wonderful career path, this phenomenon does create wonderful opportunities for potential teachers. In the future, jobs may be easier to secure. Teacher pay may have to increase because of supply. This episode will feature one of these aspiring teachers–Joce McBurney-Buell.<br /><br />Last summer, I traveled to Muskingum University to meet with the my dear friend the outgoing Department Chair Rae White. In the midst of our day, she invited me to lunch in the gymnasium which was hosting freshmen students who were also being oriented to campus. Rae and I plopped down at a table full of young people to break bread. Seated beside me was a young woman who seemed to know a lot more about Muskingum than an incoming freshman. As you probably guessed, Joce was my table neighbor and was about to embark on her junior year. She was on campus that day to help ease freshmen with their significant transition from home and high school. As we interacted, I was thrilled to learn that Joce is an Education major. As I observed her and interacted with her, it became quickly apparent that this young women had it going on. I just knew–and it's been confirmed by future interactions, that she was destined to present to my Intro to Education students, which she did last week, and appear on my podcast, which is this episode.<br /><br />We'll discuss her goals and motivations, but what really excites me is what Joce represents. Students such as her point to a bright future in American education. The young people that I interact with in the Education major are excited, driven, and passionate about the calling. Don't get too discouraged about the Forbes article. There are some magnificent young teachers on the horizon.",
            "length": "34071487",
            "sourceUrl": "https://api.spreaker.com/download/episode/19929780/126_joce_mcburney_buell_will_make_you_feel_a_lot_better_about_the_future_of_education.mp3"
        },
        {
            "title": "125-The Remind App is Transformational...Starring Taylor Clemons, Rader Felumlee, and Macy McAdams",
            "datePublished": "Fri, 04 Oct 2019 13:40:46 +0000",
            "description": "2 years ago, I was teaching high school and our building principal setup the Remind App for our staff. I must confess that at first I found the app annoying. The flurry of messages I was receiving from our fearless leader was invasive. Granted, many of the messages were germain to being a teacher at our school and some of them were essential such as, We're on a 2-hour delay and Don't forget, I'm observing you tomorrow. Grudgingly, I began to acknowledge the value of this new mode of communication and collaboration.<br /><br />This fall, I embarked on a new education journey as an adjunct at Muskingum University. I decided to give Remind a try with my students. I quite simply embraced the old cliché, When in Rome, do like the Romans. Over the past decade, I'd experienced the frustration of unrequited emails sent to students. Young folks aren't big fans of emails, but they text the hell out of one another. Remind embraces this proclivity. The messages come through the recipient's device as a text and the receiver can then respond. But Remind isn't just a group thing. Teachers can message students or parents individually and then carry on conversations just with them.<br /><br />On its surface, Remind may seem like it's ripe for inappropriate communication between students and teachers. If those anxieties are stirring in you, please visit this page to read what Remind has to say about its commitment to security and protecting students.<br /><br />To help describe how this app works from the student perspective, I conscripted some of my current primary sources. Taylor Clemons, Rader Felumlee, and Macy McAdams are my current students. These magnificent future teachers will also speculate on how they'll utilize this app in their eventual classrooms.",
            "length": "24958888",
            "sourceUrl": "https://api.spreaker.com/download/episode/19353698/125_the_remind_app_is_transformational_starring_taylor_clemons_rader_felumlee_and_macy_mcadams.mp3"
        },
        {
            "title": "124-Rethinking Deadlines...Starring Josh Frame",
            "datePublished": "Wed, 11 Sep 2019 22:25:47 +0000",
            "description": "Last year, I was teaching high school and our administration assigned a book study to the staff. We read and collaborated on 15 Fixes for Broken Grades by Ken O'Connor. This iconic book is an interesting and provocative read. It challenges standard operating procedure in terms of the way students are assessed. The fix that stirred the pot the most amongst our faculty was Fix #2:<br /><br />Don't reduce marks on work that is submitted late<br /><br />In the program, I mistakenly refer to Fix #2 as Fix #4. On its face, Fix #2 makes sense. You don't want to punish a behavior academically. But, wouldn't Fix #2 encourage procrastination and irresponsibility?<br /><br />Interestingly enough, during my first day this past week with my college students, i challenged them to collaborate in groups on the creation of class norms. One topic that all struggled with was how to deal with late work. To a group, students were in favor of score reduction. I found this fascinating and so we embarked on a magnificent tangential conversation on should an instructor, which they all hope to be one day, punish a behavior academically? The ensuing conversation caused a titanic paradigm shift in many of my students. This episode might be similar to the discussion in my class last week in the sense that you might think about this issue differently.<br /><br />I'll discuss this fascinating idea thoroughly this week with Josh Frame. Josh is a middle school principal and he embraces the idea that students should not suffer academically for behaviors.<br />We'll talk about how he sold this idea to his staff, how he managed the pushback, and how he's adapted his school's response to students who are not appropriately pursuing learning.",
            "length": "38073248",
            "sourceUrl": "https://api.spreaker.com/download/episode/19072843/124_rethinking_deadlines_starring_josh_frame.mp3"
        },
        {
            "title": "123-The Landing Pad...Facilitate a Highly Collaborative Classroom",
            "datePublished": "Wed, 21 Aug 2019 17:24:18 +0000",
            "description": "I wanted to produce an episode before school started and I wasn’t sure if it was going to materialize. Starting next week, I’ll be teaching all new classes, at a new school, and at the college level. It’s been a busy summer, but I’m excited to embark on my next teaching journey. <br /><br />This episode is short and simple, but it has tremendous potential to positively impact the way your class operates and student learning. 10 years ago, my room was cluttered. My wife has a label for people like I was...He’s a piler. That label was true. I did have a lot of piles of paper stacked in chaotic places around my room. I wasn’t proud of this, but when all of my students filed into my class each morning and the day just erupted into frenzied activity, my energies turned towards engaging them and not organizing the flurry of papers that I distributed and then collected.<br /><br />This unsatisfactory situation changed when my school started using Google Drive. The piles of paper disappeared, my drive was organized and easily accessed, and my uncluttered room took on a Feng Shui-like character. I was transformed into such a paperless fan that I decided to create a Landing Pad for many assignments. This virtual collaboration igniter is what I’ll highlight in this episode. It’s not revolutionary, but it’s powerful. I thought it would be useful to share a great and simple idea on the last week of summer vacation.",
            "length": "13387352",
            "sourceUrl": "https://api.spreaker.com/download/episode/18879744/123_the_landing_pad_facilitate_a_highly_collaborative_classroom.mp3"
        },
        {
            "title": "122-Embrace the Marginalized...Starring Fatima Dahir",
            "datePublished": "Thu, 25 Jul 2019 22:39:31 +0000",
            "description": "There's a significant potential that 2 things may happen when you return to school in a couple of weeks:<br /><br />1. Your classroom may be more diverse<br />2. Donald Trump's Send her back tweet may just come up in class discussion<br /><br />In terms of diversity, the demographic trends towards a browner America are indisputable. Sadly, many American schools both urban, suburban, and rural are defying this trend and remaining largely monochrome. If you teach in such a school, you do your students no favors by ignoring America's increasingly diverse trajectory. Your students will most likely work in highly diverse environments in the future. And if you teach in such a school, you also have a moral obligation to make certain that students whom are different are not marginalized.<br /><br />Fatima Dahir certainly felt different when she entered her largely, white and conservative public middle school classroom in suburban Columbus wearing her hijab. Today, she's thriving as a student leader at Ohio State University, but middle school was brutal. In this episode, she'll talk about her significant struggles, along with her social and academic metamorphosis. She'll discuss how teachers can embrace ostracized students. She'll also provide interesting perspective on the controversial statements by Donald Trump and how an educator might cope with classroom debate inspired by this issue. Please listen. This is an important show!",
            "length": "39645920",
            "sourceUrl": "https://api.spreaker.com/download/episode/18642630/122_embrace_the_marginalized_starring_fatima_dahir.mp3"
        },
        {
            "title": "121-Teacher Well-Being...4 Learning Targets for the Fall",
            "datePublished": "Wed, 26 Jun 2019 23:55:07 +0000",
            "description": "Even though it's only June, start thinking about specific ways to create an outstanding school year next fall. That's what I've done throughout my career. Summer gives you breathing room. It allows you to reflect, adjust, and then speculate and plan.<br /><br />One thing that I'm passionate about is teacher well-being. Aside from job satisfaction being a wonderful thing in its own right, happy teachers are better for kids. But acquiring profound job satisfaction may indeed take some planning, adjusting, and paradigm shifting on your part.<br /><br />In pursuit of helping my dear listener obtain that noble goal, I recorded this program. It includes 4 learning targets that will lead to greater teacher fulfillment. Each target will be accompanied by suggestions on how to manifest the target into your professional life. While some of my suggestions may not move you and many you probably do already, it's my belief that you'll be exposed to at least a few ideas that you'll love and want to implement. By doing so, you may just transform next fall. <br /><br />I hope you enjoy the program. It's good to be back behind the mic!<br /><br />Teacher Well-Being Learning Targets:<br /><br />I’m a positive citizen of my school<br />I embrace delayed gratification.<br />I prioritize my well-being<br />I’m grateful to be a teacher",
            "length": "24556901",
            "sourceUrl": "https://api.spreaker.com/download/episode/18390719/121_teacher_well_being_4_learning_targets_for_the_fall.mp3"
        },
        {
            "title": "120-Where Will Sturtevant be Teaching Next Year?",
            "datePublished": "Mon, 20 May 2019 18:23:12 +0000",
            "description": "In the late summer of 1985, I experienced my first day of teaching at Mount Vernon High School in North Central Ohio. That steamy summer day was the inaugural faculty meeting. You know...the one where all the veteran teachers stare at the newbies as they're introduced. Before my principal, Mr. George Perry began the unveiling process, he paid homage to a retiring teacher. Up stepped a nondescript middle-aged man named Art Cassell. Mr. Perry began, \"When Art started teaching in the fall of 1955...\" Those were the last words I heard. I panicked! 1955...1955...I wasn't alive in 1955. How in the hell does anyone teach high school for 30 years, I thought. Then, I started to project into the future, \"Will that be me in 2015? Will I be the old guy waddling up there to get my official pat on the back? I'll be like a museum exhibit.\" <br /><br />I quickly learned, however, that teaching is a wonderful adventure. I couldn't get over how much I loved the work. I couldn't fathom in 1985 that I'd still be teaching high school in 2019, but here I am, at least, for a few more days. At the end of this week, I'll no longer teach high school.<br /><br />This episode will explain exactly why at this juncture in the spacetime continuum I'm transitioning into a new role. Rest assured, this podcast will continue. In fact, in my new role preparing tomorrow's educators at the college level, I'll be inspired to dive even deeper into what creates engaging instruction. And, I'm thrilled that I'm simply migrating to a new classroom. I'll still be in front of students teaching. Rest assured, this podcast will also continue.<br /><br />Thanks for listening so far and there's more to come!",
            "length": "15862767",
            "sourceUrl": "https://api.spreaker.com/download/episode/18026083/120_where_will_sturtevant_be_teaching_next_year.mp3"
        },
        {
            "title": "119-The Plickers Class Discussion Extravaganza",
            "datePublished": "Wed, 17 Apr 2019 13:06:01 +0000",
            "description": "I remember late April of my rookie year as a teacher. I was toast! All my great teaching strategies were worn out. I was scrambling trying to find innovative and engaging ways to present lessons. It was a loooooong 6-weeks till summer vacation.<br /><br />In early June when I did my post-mortem on the year, I vowed to always keep some ideas in the vault for that last 6-weeks home stretch. In fact, I’ve always encouraged rookie teachers to do the same.<br /><br />I have 5 weeks left of school. The weather is warming up here in the Buckeye state. The springtime panorama, which is the window of my classroom, is getting darned inviting. Conversely, reliable teaching strategies are becoming a bit stale. They’ve worked brilliantly all year, but now with the end in sight, I have to change things up in order to maintain that crucial student engagement.<br /><br />This episode will focus on using Plickers as a classroom discussion tool. I first learned of this rather amazing platform while I was conducting PD 2 years ago. I was helping teachers individually when one of the attendees asked, Jim...have you ever used Plickers? I responded, No. I listened to her describe the platform and thought, That sounds fascinating and easy. I want to give it a try. I finally got around to it. The last 9-weeks of the year I love experimenting with new platforms. It was high time for my Plickers' maiden voyage.",
            "length": "9548276",
            "sourceUrl": "https://api.spreaker.com/download/episode/17667846/119_the_plickers_class_discussion_extravaganza_output.mp3"
        },
        {
            "title": "118-Keeping it Fresh with Talking Sticks",
            "datePublished": "Mon, 15 Apr 2019 13:29:42 +0000",
            "length": "9788603",
            "sourceUrl": "https://api.spreaker.com/download/episode/17646692/118_keeping_it_fresh_with_talking_sticks_output.mp3"
        },
        {
            "title": "117-SCAMPER through your Next Teacher Evaluation...Starring Jen Wilson",
            "datePublished": "Fri, 22 Mar 2019 19:28:23 +0000",
            "description": "I remember my first teacher evaluation. I was nervous! I tried to put on a great show. I felt I did okay. Then, a few days later, I remember walking toward the principal's office to hear the verdict. I wasn't sure how this meeting would go. I thought my lesson went well, but I couldn't tell how my principal felt because he always played them close to the vest. Thankfully, he said positive things. I was thrilled and relieved.<br /><br />Decades later, I'm still being observed. But now, all my administrators are younger than me. It makes the entire process a lot less intimidating. I still take observation day seriously, but I'm more relaxed about the process. <br /><br />I wished I would have had the courage to try what I tried last week earlier in my career. I approached my principal about attempting to address a weakness during a formal evaluation. Because he's a good principal, he welcomed my idea. <br /><br />My weakness is personalization. It's something I don't do enough and I'm confused about the nuts and bolts. I'm not opposed to personalizing lessons, I think it's the direction in which the world...and certainly education, is headed, but I needed help. <br /><br />And this, dear reader, is where Jen Wilson enters the scene. Jen is an instructional coach in our school. My principal sent me Jen's way. I've worked with her before and she's great. She suggested that I take my lesson and apply the SCAMPER method.  <br /><br />My experiment of addressing a weakness as the focus of an evaluation was a success. My principal heartily endorsed the idea, he provided awesome resources like Jen Wilson, I gained confidence in terms of personalizing, and my students experienced a solid learning opportunity.",
            "length": "32889330",
            "sourceUrl": "https://api.spreaker.com/download/episode/17408042/117_scamper_through_your_next_teacher_evaluation_staring_jen_wilson_output.mp3"
        },
        {
            "title": "116-Deanna Hess Enthusiastically Turns the Car Keys Over to Her Kids",
            "datePublished": "Tue, 26 Feb 2019 16:40:15 +0000",
            "description": "I stopped coaching football in the fall of 2000. That’s a long time ago. In the spring of 2018, Eric Myers, who’s the Track and Field Coach at our school, surprised me with an unexpected proposition, Jim…you need to get back into coaching. I need an assistant. Coach with me. We’ll have a blast! I was totally unprepared for this solicitation. I responded, Wow…thanks, but I’m long removed from the coaching mindset. It’s been years since I’ve coached. I’m sorry!<br /><br />I was surprised by Eric’s proposition. That was a problem. I said no instinctively without giving it much thought. I promptly dismissed the idea and went on with my busy day.<br /><br />Our minds, however, function in mysterious ways. Last summer on a gorgeous Ohio day, I needed something to do. My wife had an obligation, so I was free to entertain myself. I decided to go hiking at Mohican State Park near Mansfield, Ohio. For some odd reason, as I strolled over the beautiful trails surrounded by sun-dappled hemlocks, I started thinking about coaching again:<br /><br />Man, it would take a lot of time out of my day.<br />Boy, parents become spastic whenever their offspring are even remotely engaged in competition.<br />I’m not as young as I used to be.<br /><br />But these thoughts were overwhelmed by others:<br /><br />When I was coaching I had a relational advantage in the classroom because I bonded with kids on the playing field.<br />While I’m not as young as I used to be, I’m still very fit and coaching might make me feel even younger.<br />I had a lot of fun coaching and there’s no reason to think that couldn’t be the case again.<br />And finally and most importantly, I have a lot to offer those kids in the role of a coach.<br /><br />On my way home from the hike, I called Coach Myers and told him that if he needed me next year, I was available.<br /><br />Now, fast-forward to February of 2019. Eric informed that he did need me to help coach running events, but he really needed a discus coach. This introduced a fascinating new variable. I was a speed guy in high school. I’d never picked up a discus in my life. Eric assured me that I could teach myself and clarified that practice started on the 4th of March, so I needed to get cracking!<br /><br />This is a perfect example of self-directed learning. Over the past 2 weeks, I’ve researched, watched video, interviewed experienced throwers, and practiced the movements. To the amusement and annoyance of wife and offspring, I’ve thrown a lot of things against my basement wall mimicking throwing the discus. My form has evolved. I’m now excited to teach others. Please…repeat after me, When we teach ourselves, it sticks<br /><br />Deanna Hess teaches dual enrollment English at Dover High School in Dover, Delaware. My story about self-directed learning dovetails perfectly with her story about a prompt she recently gave students. Deanna challenged her kids by placing the learning objective at the end of the prompt! In other words, the learning objective represented Point B in a journey. Point A and how students got to Point B, was totally up to them. If this sounds fun, courageous, powerful, and something you’d like to try in your classroom, then you, dear friend, have downloaded the right podcast. Deanna describes her evolution in thinking about the assignment, the twists and turns of its execution, her interesting observations during the process, and the potential as a future instruction tactic. There’s no doubt that this lesson was a powerful learning experience for Deanna’s students.",
            "length": "40515660",
            "sourceUrl": "https://api.spreaker.com/download/episode/17153462/116_deanna_hess_enthusiastically_turns_the_car_keys_over_to_her_kids.mp3"
        },
        {
            "title": "115-Principal Mo Ross Describes what he's Looking for in your Next Evaluation",
            "datePublished": "Mon, 18 Feb 2019 20:23:09 +0000",
            "description": "It's so gratifying when you had a student with whom you were close, they graduate, and then years later you learn that they've achieved much. Mo Ross is a marvelous example of this phenomenon. In college, Mo was an integral member of Otterbein University's 2002 National Division Three Championship Basketball Team. I was still keeping tabs on Mo in 2002 and I was impressed with this lofty accomplishment.<br /><br />But then, I lost track of him. Certainly not on purpose, but I've taught over ten thousand kids in my career. It's hard to follow them all. I reconnected with Mo this past fall due to a tragedy. I coached Mo in Freshman Football many years ago. His best friend, Randy Russell, was also on my team. Randy passed away this past year and Mo and I talked frequently in the wake of this awful development.<br /><br />I was thrilled to learn that Mo had become an educator. In fact, Mo had became a principal. He's the perfect blend of ability, disposition, and vision. As you listen to this talented young man, you'll spot his leadership skills immediately. Those skills were evident to his teammates and me. He guided our freshman football team as the quarterback. His skills are now evident to his teaching staff. His common sense approach and calm supportive demeanor are major assets.<br /><br />This podcast is in need of more administrative perspectives. I frequently interview teachers and students. An administrator can describe student engagement from the objective perch of the classroom evaluation. This episode will give the listener a behind the curtain peak at exactly what's going through an administrator's mind as he watches you matriculate through your lesson.",
            "length": "46019611",
            "sourceUrl": "https://api.spreaker.com/download/episode/17077543/115_principal_mo_ross_describes_what_he_s_looking_for_in_your_next_evaluation.mp3"
        },
        {
            "title": "114-BRAVO...Students in Monica Lewis' Class Practice Mindfulness Daily",
            "datePublished": "Fri, 25 Jan 2019 12:01:16 +0000",
            "description": "Every morning, I spend some solitude on a meditation cushion. This has been an on and off again routine for many years. Over the past 6 months, I've been diligent. The rewards have been palatable:<br /><br />I sleep better<br />I eat better<br />I notice things<br />I'm calmer<br />I'm much kinder and more tolerant<br />I'm less critical of myself<br />I've mended fences<br /><br />I add a minute to my practice each week. I'm working up to 30 minutes. I'm currently at 22. If back in October someone would have told me that I could sit calmly for 22 minutes by mid-January, I would've dismissed them.<br /><br />I certainly don't mean to imply that I bliss-out each morning. Some sessions are a train wreck. My mind resembles a trapeze act. But even on those spastic dawns, I benefit. Perhaps, I need my mind to perform its gymnastics routine in a safe place and then I can move on with my day in a more present fashion.<br /><br />Recently, I was presenting at a local school district's professional development day. After my presentation, I had some free time so I thought I'd duck into some breakout sessions. One, in particular, intrigued me. Monica Lewis is a 4th-grade gifted teacher in Pickerington, Ohio. Her session on Mindfulness in the Classroom was at the top of my dance card. After Monica's fine session, I introduced myself and invited her on my podcast. This episode will mirror her presentation and give me the opportunity to ask questions that many of you may have merely based on the title.",
            "length": "47363897",
            "sourceUrl": "https://api.spreaker.com/download/episode/16838396/114_bravo_students_in_monica_lewis_class_practice_mindfulness_daily.mp3"
        },
        {
            "title": "113- Five Hacks for Bonding with REALLY, REALLY Challenging Kids...or, a Cure for Teacher Insomnia",
            "datePublished": "Sat, 12 Jan 2019 17:50:59 +0000",
            "description": "Do you have a class that you probably should get a little extra in the paycheck for coping with on a daily basis? Do you have students who dominate your thoughts...and not in a good way, when you're away from school? Do you catch yourself having imaginary confrontations with certain kids? Do you have a class that causes you great anxiety as they roll through the door each morning? If you do, join the club. <br /><br />I had such a class last semester. I was wondering, Do I still have it? So, I set to work bonding with these challenging kids. This episode will describe my approach. What I love about this episode, is that all my suggestions are totally in the teacher's control. You're not reliant on student compliance in order to implement these strategies. My hope is that over time your calm, consistent, and persistent efforts will be rewarded. Give my ideas a try. I have confidence in your success! ",
            "length": "24681362",
            "sourceUrl": "https://api.spreaker.com/download/episode/16695165/113_five_hacks_for_bonding_with_really_really_challenging_kids_or_a_cure_for_teacher_insomnia.mp3"
        },
        {
            "title": "112-You Simply Must Try StoryMaps from Knight Lab...Starring Max Muhlbaier and Matt Rease",
            "datePublished": "Mon, 17 Dec 2018 18:04:49 +0000",
            "description": "This past summer, I interviewed Michael Brilla about creating timelines on an amazing platform called Knight Lab. I had my students such create timelines this past September. It was a solid experience for all. The only issue we had with this application was that kids had to fill out a Google Spreadsheet and then submit that sheet to the Knight Lab platform. This one variable caused some frustration with my students. Imagine that!<br /><br />What I love about StoryMaps is there are no spreadsheets involved. Your kids create the entire StoryMap right on the Knight Lab platform. It's totally web-based...which is magical. When kids are done, they hit the share button and they have the link. <br /><br />This is a perfect activity for any lesson that involves events taking place in various locations. I had my students create a StoryMap on the Mongols. <br /><br />To help me tell this story is Max Muhlbaier and Matt Rease. These two articulate young students (primary sources) will describe utilizing this platform.",
            "length": "25168937",
            "sourceUrl": "https://api.spreaker.com/download/episode/16499802/112_you_simply_must_try_storymaps_from_knight_lab_starring_max_muhlbaier_and_matt_rease.mp3"
        },
        {
            "title": "111-A Google Drawing Prompt Template that you can use Over and Over Again...Starring Morgan Schull and Lauren Speelman",
            "datePublished": "Fri, 16 Nov 2018 23:20:09 +0000",
            "description": "2 Months ago, I prompted my students to draw. I was hoping to get some masterpieces. In fairness, I did get a few spectacular and inspiring submissions. Most kids, however, were ambivalent. Many commented, \"I hate drawing!\" Or, \"I suck at drawing!\" They put forth little or no effort and it showed. The entire episode left me wondering, \"How can I do this better next time?\" <br /><br />At this dramatic moment, Google Drawings boldly stepped on stage. I was unfamiliar with this tool, so I watched a brief and empowering tutorial. I use Google Docs and Google Slides and I was encouraged by how my experiences with those 2 tools inspired a rapid learning curve. I created a Google Drawing. As I explain in the program, I became obsessed with the process. I linked my drawing on the prompt I created to give my kids ideas. <br /><br />I decided to unleash this tool on my students. It was a marvelous decision. In this program, 2 of my students, Morgan Schull and Lauren Speelman, will talk about their experiences utilizing Google Drawings. I love these 2 articulate young women. So will you.",
            "length": "24482406",
            "sourceUrl": "https://api.spreaker.com/download/episode/16241466/111_a_google_drawing_prompt_template_that_you_can_use_over_and_over_again_starring_morgan_schull_and_lauren_spellman.mp3"
        },
        {
            "title": "110-TEMPORARILY Morph your Kids into Buddhist, Hindus, and Muslims via the Belief-O-Matic...Starring Sebastian Kirkpatrick and Graham Mackey",
            "datePublished": "Sun, 28 Oct 2018 14:30:02 +0000",
            "description": "It's so hard to entice someone to morph into the perspective of another. Unfortunately, it's darned near impossible for adults and not that easy for kids, who hopefully are more open-minded.<br /><br />I teach in a small town just outside Columbus, Ohio. We are just a couple of miles from the diversity of Columbus. However, our town is growing and diversity is coming. It's my mission to help our kids appreciate different viewpoints. I was overjoyed when I found an online tool that helps greatly in the quest. Introducing the Belief-O-Matic. <br /><br />I challenged my kids to REALLY understand Buddhism, Hinduism, and Islam via the Belief-O-Matic. The students were confronted with 20 questions that they tried to answer as a member of the faith we explored. Please give this a try! I guarantee the experience will be challenging and enlightening. To help me explain how to utilize this cool tool are 2 amazing primary sources. Sebastian Kirkpatrick and Graham Mackey are wonderful guys who are 11th graders at our school and they are articulate salesmen for this tool.  ",
            "length": "23013482",
            "sourceUrl": "https://api.spreaker.com/download/episode/16074904/110_temporarily_morph_your_kids_into_buddhist_hindus_and_muslims_via_the_belief_o_matic_starring_sebastian_kirkpatrick_and_graham_mackey.mp3"
        },
        {
            "title": "109-Adventures in Standards-Based Learning...Starring Mark Robinson",
            "datePublished": "Fri, 12 Oct 2018 20:45:40 +0000",
            "description": "I remember 10th-grade Geometry. I was quite a distracted high schooler. And to accentuate this problem...I was a total humanities guy. Math class was more of a social opportunity as opposed to an academic endeavor. Consequently, I was totally lost. I had virtually no idea what was going on. Unfortunately, there are a lot of kids in Math classes today who resemble the 15-year-old me. <br /><br />So at this juncture of our journey, Mark Robinson enters the fray. Mark is a fabulous Math teacher who embarked this fall on a Standards-Based Learning journey. Standards-Based Learning is a powerful wave that's churning on education's horizon. Mark stops into today to talk about what it is, how it works and evaluates its effectiveness. The 15-year-old James Sturtevant would have thrived with a teacher like Mark. ",
            "length": "28945757",
            "sourceUrl": "https://api.spreaker.com/download/episode/15947913/109_adventures_in_standards_based_learning_starring_mark_robinson.mp3"
        },
        {
            "title": "108-Ben Momeni and Cecilia Sutton Want you to Deliver your Next Lesson Via Padlet",
            "datePublished": "Wed, 26 Sep 2018 20:45:04 +0000",
            "description": "Recently, my buddy Michael Brilla shared information on how to utilize Google Drawings. He sent me a Padlet by Karly Moura. I was mesmerized by this Padlet. The info and the direction were solid...but I was also captivated by the Padlet itself. I immediately started scheming, How can I utilize a Padlet for my next lesson prompt? It was a short skull-session. My World Civ students were due for their research paper prompt. Writing a research paper, for many students, is a daunting task. I decided to deliver my prompt and ample instructions and encouragement via a Padlet.<br /><br />My efforts were fruitful! To back up this audacious claim, I commandeered two original sources. Ben Momeni and Cecilia Sutton are seniors at our school and students in my World Civ class. I permit them to migrate from study hall to my room during the last period of each day. Since I rescue them every 24 hours, they were happy to help me by appearing as guests. They're wonderful, intelligent, and articulate young people. They'll provide onsite reporting on what it's like to have a prompt dropped on you via Padlet. ",
            "length": "17328406",
            "sourceUrl": "https://api.spreaker.com/download/episode/15815099/108_ben_momeni_and_cecilia_sutton_want_you_to_deliver_your_next_lesson_via_padlet.mp3"
        },
        {
            "title": "107-Gamify your Next Lesson...Starring Stephanie Howell",
            "datePublished": "Fri, 10 Aug 2018 15:05:03 +0000",
            "description": "In Episode 68, I demonstrated a zero-tech method of including two classic board games into your instruction. In this episode, Stephanie Howell will take gamification to a whole new level. <br />Stephanie is an Instructional Technology Coordinator at the Pickerington Local School District in suburban Columbus, Ohio. Stephanie and I have interacted for a while and I wanted to interview her last year, but we kept searching for the perfect topic. We found it! She's going to enlighten all of us about gamifying our next lesson. I'm certainly going to try this this fall. Stephanie promotes challenging students to solve a mystery by mimicking the classic board game Clue.<br /><br />But here, dear listener, is the exciting part. Stephanie has done much of the work for us! Navigate to my show notes where you'll find a 17-minute step-by-step instructional video and a Google Doc which will be your roadmap to creating your own gamified lesson.",
            "length": "37186849",
            "sourceUrl": "https://api.spreaker.com/download/episode/15463488/107_gamify_your_next_lesson_starring_stephanie_howell.mp3"
        },
        {
            "title": "106-47 Years of Enticing Kids to Lean Forward...Starring Jim Mahoney",
            "datePublished": "Wed, 08 Aug 2018 19:30:05 +0000",
            "description": "Jim Mahoney is a fantastic public speaker. My original intention for this episode was to help teachers improve their presentations. Yes...this interview provides such direction, but as my convo with Jim evolved, it became apparent that teacher presentations was just one layer of onion skin. Jim's been in the teaching biz for 47 years. He's been a teacher, coach, principal, central office administrator, superintendent, the Executive Director of Battelle for Kids, and finally...he's returned home to the classroom. Jim now enlightens future teachers as a professor at Ohio University. <br /><br />In this episode Jim delves into hooks, transitions, lesson plans, evaluations, reading, presentation, public speaking, storytelling, student-led learning, and more. This is a man that has seen plenty of change and has embraced plenty of change. What shines through is fierce passion for kids and deep wisdom about how to foster learning. Please visit Jim's website to learn more about him, sign-up for his book notes, or ask him a question. Consider this interview a pep-talk for the 2018-2019 school year!",
            "length": "44930755",
            "sourceUrl": "https://api.spreaker.com/download/episode/15449637/106_47_years_of_enticing_kids_to_lean_forward_starring_jim_mahoney.mp3"
        },
        {
            "title": "105 Knight Lab Transforms your Kids into Digital Bards...Starring Michael Brilla",
            "datePublished": "Wed, 11 Jul 2018 14:20:04 +0000",
            "description": "I loved being a student. Sometimes as a teacher, I'd like to trade places with my students. I enjoy learning. Well in this episode, I get to do just that! Michael Brilla is a fabulous middle school history teacher from Pottstown, Pa. Michael is my teacher and I'm his student. He's going to school me about digital storytelling. <br /><br />I'm reading a fascinating book called \"Talk Like TED\" by Carmine Gallo. Carmine evaluates the presentation styles of the most popular TED presenters. One common thread is powerful storytelling. Teachers have a responsibility to help kids evolve as storytellers. It's an essential skill. Michael Brilla and I became acquainted on Twitter. He promoted the idea of digital storytelling. I was instantly intrigued. Michael's platform of choice is Knight Lab. <br /><br />Knight Lab is a free platform gifted to the world from a team of brilliant, talented, and creative faculty and students at Northwestern University. Job 1 when I return to school in one month is to master this powerful platform. I was thrilled to listen to Michael because he's already utilized it extensively and successfully. In this episode, Michael highlights his student's creation of Timelines and Story Maps. Please visit these links and marvel at what Michael's kids created. Digital storytelling has great potential!",
            "length": "31070676",
            "sourceUrl": "https://api.spreaker.com/download/episode/15233772/105_knight_lab_deputizes_your_kids_to_as_digital_storytellers_starring_michael_brilla.mp3"
        },
        {
            "title": "104-Please try a SILENT Socratic Seminar...Compliments of Peergrade and the Stanford History Education Group",
            "datePublished": "Wed, 13 Jun 2018 22:10:05 +0000",
            "description": "Socratic Seminars are a big part of my class. The students circle-up and then dissect complex topics. These are highly engaging, collaborative, and provocative sessions. We do them a lot. However, even if you thoroughly enjoy something, like the taste of a Reese Cup (the relevance of which I'll explain in the episode), if you do it too much...the magic is lost. I'm always looking for ways to improve engagement in class discussion. My kids are totally down with Philosophical Chairs, which I consider a highly successful experiment. A few months ago I ventured down a new a path, the Silent Socratic Seminar. Even as I read the last sentence, it seems absurd. How can you have a class discussion if no one says anything? This episode will demonstrate how you can do just that.",
            "length": "16641620",
            "sourceUrl": "https://api.spreaker.com/download/episode/15042356/104_please_try_a_silent_socratic_seminar_compliments_of_peergrade_and_the_stanford_history_education_group.mp3"
        },
        {
            "title": "103-Authenticity is how Steady Teddy Bonds with Kids...Starring Ted Diepenbrock",
            "datePublished": "Thu, 31 May 2018 18:47:37 +0000",
            "description": "I'm exposed to fascinating guest through common interactions on Twitter. Ted Diepenbrock is one such person. We bantered back and forth about what to discuss in this interview. We settled on bonding with students, while at the same time, empowering them by giving them choices in learning. This is a fine topic and we discuss it thoroughly. But one message came through strongest as I edited our convo:<br /><br />To bond with kids you have to be authentic.<br /><br />Ted is authentic. He's a calm and kind presence in his student's lives. His commitment to bonding with students and his commitment to giving kids choice shines through, but I kept thinking as we spoke about the Myers-Briggs Personality Profile. This measurement determines what gives one energy. For those familiar, I am an ENFP. I'm Extroverted, I'm Intuitive, I'm Feeling, and I'm Perceiving. If you're interested in taking an online version of the Myers-Briggs, head to this link.<br /><br />Ted and I are different. I have the personality of a game show host. This might seem conducive to teaching high school students, but that's a generalization. I've had kids in class that just flat didn't care for me. There haven't been many such youngsters, but I can think of a few. My lack of rapport with these kids bothered me. One brave dissenter finally told me that it was my personality they found off-putting. \"You're just so hyper\", she informed. This didn't make me feel good, but it definitely altered the way I tried to interact with this kid and the way I tried to interact with standoffish kids moving forward. This somewhat painful episode demonstrated that it takes all kinds to teach. While Steady Teddy might score very different on the Myers-Briggs than me, he might of been a better fit for my students who struggle with my over-the-top personality.<br /><br />As you listen to Ted, understand that you are what you are. You don't need to try to be something different.",
            "length": "44861885",
            "sourceUrl": "https://api.spreaker.com/download/episode/14938781/103_authenticity_is_how_steady_teddy_bonds_with_kids_starring_ted_diepenbrock.mp3"
        },
        {
            "title": "102-Unleash your Student Technocracy...Starring Brennan Daugstrup and Shawn Sherburn",
            "datePublished": "Thu, 24 May 2018 12:58:52 +0000",
            "description": "Brennan Daugstrup (The Blog) and Shawn Sherburn (Shrapnel) make me feel great in this episode. If imitation is the sincerest form of flattery, then classify me as flattered to the hilt. These wonderful young guys are highly complimentary of my flipped lectures. But what really frosted my educational gourd, was being informed by my two young friends that when prompted to make videos, they use mine as a template. I hope you enjoy this conversation as much as I treasure their endorsement of my teaching style. Additionally, they teach me about some cool platforms, one of which I'm determined to utilize. Their ingenuity and creativity are why I labeled them technocrats.",
            "length": "28121585",
            "sourceUrl": "https://api.spreaker.com/download/episode/14875485/102_unleash_your_student_technocracy_starring_brennan_daugstrup_and_shawn_sherburn.mp3"
        },
        {
            "title": "101-Meet me in the Agora, the Zero Tech Road to an Epic Class Discussion...Starring Mel Eckelbarger",
            "datePublished": "Thu, 17 May 2018 19:49:31 +0000",
            "description": "It's tough to get students to participate in class discussions. It's tough to keep track of all the tech tools I toss out in this podcast. Well in this episode, I'm determined to alleviate both of these frustrations. I'll provide an engaging and fun class discussion tactic, which will only require great sources, provocative prompts, a stopwatch, 1 sheet of paper, and a pen or pencil.<br /><br />The Agora was the square in an ancient Greek city-state. The Greeks took democracy seriously. Participation was mandatory, juries were massive, being informed was a must. The Greeks accomplished what we try to do in all of our Social Studies classes daily...foster citizenship.<br /><br />I became exposed to the appointment book method of discussing at a PD session many moons ago. I was impressed, but perhaps not that impressed because I totally forgot about it. I did not invent this tactic, but like most teachers, I beg, borrow, and steal, morphing as I go. This past month, I needed a new tactic to employ in an upcoming class discussion. For some odd and welcomed reason, I remembered the PD appointment activity. Eureka...I had my idea and I called it Meet me in the Agora! It went so well that I shared it with my friend, colleague, and neighbor Mel Eckelbarger. Mel utilized my Meet me in the Agora tactic the next day and was most pleased with the results. We'll discuss the particulars of this tactic...how to set it up, execute it, and we'll even troubleshoot Meet me in the Agora.",
            "length": "22156041",
            "sourceUrl": "https://api.spreaker.com/download/episode/14821047/101_meet_me_in_the_agora_the_zero_tech_road_to_an_epic_class_discussion_starring_mel_eckelbarger.mp3"
        },
        {
            "title": "100-Surviving 33 Years in the Classroom...Starring Kevin Ellinwood",
            "datePublished": "Fri, 13 Apr 2018 16:05:05 +0000",
            "description": "I started this podcast in the summer of 2016. I just had completed my book Hacking Engagement. The podcast was meant to supplement the book. There are 50 hacks in Hacking Engagement. My objective in 2016 was to produce 50 episodes. It seemed like climbing a mountain. It was hard to fathom producing 50 episodes...and yet I did. I had so much fun that I went ahead and produced 100! <br /><br />This episode is a celebration of this achievement. I interview Kevin Ellinwood. <br /><br /><br />Kevin Ellinwood. Kevin, like me, is completing his 33rd year in the classroom. Please enjoy this show as we reflect upon 33 glorious years amongst thousands of young people. No episode template...just listen, enjoy, and thanks so much for listening! ",
            "length": "26409479",
            "sourceUrl": "https://api.spreaker.com/download/episode/14532132/100_surviving_33_years_in_the_classroom_starring_kevin_ellinwood.mp3"
        },
        {
            "title": "99-If the Statue of Liberty were a teacher...how would she handle kids who struggle with English...Starring Diann Espinoza",
            "datePublished": "Fri, 06 Apr 2018 17:40:04 +0000",
            "description": "America is changing. According to Pew, by 2050 the US will be 29% Hispanic. If you don't have kids in your class who struggle with English, you will in the future. If you have students that struggle, expect a lot more. I've spoken to colleagues who've experienced such students. Many of these educators expressed frustration. They lack training and resources. In prepping for this episode, I concluded that teachers need to strive to be like the Statue of Liberty...SAY WHAT!?!<br /><br />“Give me your tired, your poor, your huddled masses yearning to breathe free, the wretched refuse of your teeming shore,” she wrote. “Send these, the homeless, tempest-tossed to me, I lift my lamp beside the golden door!”<br /><br />The golden door is an education! Embrace these youngsters. Think how stressful it is for them to not feel free to express themselves.<br /><br />In this episode, I interview a bilingual champion by the name of Diann Espinoza.",
            "length": "38821115",
            "sourceUrl": "https://api.spreaker.com/download/episode/14473929/99_if_the_statue_of_liberty_was_a_teacher_how_would_she_handle_kids_who_struggle_with_english_starring_diann_espinoza.mp3"
        },
        {
            "title": "98-StoryboardThat will Transform your Kids into Editorial Cartoonists",
            "datePublished": "Fri, 30 Mar 2018 17:38:16 +0000",
            "description": "When I was a young teacher, I used to bring my newspaper to study hall. Students would perch on their desks and observe me like vultures. As soon as I was done with the Sports Section, or the Life Section, they would swoop down and devour it! Today, I'm not sure kids could identify a newspaper in a police lineup. What I loved the most about consuming the newspaper each day was the Comic's Page and the Editorial Cartoons. Unfortunately, I don't get a paper anymore. My exposure to comics has diminished significantly. I miss them!<br /><br />So...in this episode, I'll demonstrate how to revive this wonderful medium with the help of a tremendous tech tool called StoryboardThat. I'll also give non-humanities teachers an idea on how they could use it in their curriculum. ",
            "length": "11185422",
            "sourceUrl": "https://api.spreaker.com/download/episode/14424407/98_storyboardthat_will_transform_your_kids_into_editorial_cartoonists.mp3"
        },
        {
            "title": "97-The Virtual Gallery Walk Compliments of Screencastify",
            "datePublished": "Sat, 24 Mar 2018 19:30:06 +0000",
            "description": "Student videos started to get on my nerves. It was the same thing over and over. The kids put most of their efforts into making them funny and violent. The videos seemed more slapstick than expressive. <br /><br />I retooled the way kids create videos and the results have been spectacular. This episode is about HOW I have my students do this and HOW they present their work to one another. Episode 44 is about student presentations via the gallery walk. In this program, I'm going to promote the idea of creating a virtual gallery walk. I was impressed a couple of years ago when I had my kids take a virtual tour of the Caves of Lascaux.  I remember thinking...Wouldn't it be cool if my kids could create a virtual exhibit? <br /><br />My students mastered this challenge with the help of Google Slides and wonderful screen recorder called Screencastify. ",
            "length": "16318394",
            "sourceUrl": "https://api.spreaker.com/download/episode/14375885/97_the_virtual_gallery_walk_compliments_of_screencastify.mp3"
        },
        {
            "title": "96-Jason Connelly is the Man Behind the Curtain...Crafting Powerful and Futuristic Classroom Presentations",
            "datePublished": "Sat, 10 Mar 2018 16:20:04 +0000",
            "description": "Many moons ago, I read a fascinating book about the future. Bill Gates’ book \"The Road Ahead\" inspired me greatly. I couldn’t wait to see if Gates’ fascinating predictions came to fruition. Guess what…most did!<br /><br />This episode will feature a Gates-like futuristic prophet in regard to lesson delivery. Jason Connelly is an instructional designer at Columbus State Community College. I became acquainted with Jason last year. Columbus State commissioned your humble narrator to create the online version of World Civilization 1181. Jason was my mentor and muse in this massive creative challenge.<br /><br />I’ve taken all that I learned from Jason and applied it to my virtual lesson creation. I’ve guided student to create superior projects based on what I learned from Jason. Don’t be intimidated by what you hear today. In my next episode, I’ll explain how to transform a basic storyboard, which I'll encourage you to create, into a powerful video.",
            "length": "38579465",
            "sourceUrl": "https://api.spreaker.com/download/episode/14251335/96_jason_connelly_is_the_man_behind_the_curtin_crafting_powerful_and_futuristic_classroom_presentations.mp3"
        },
        {
            "title": "95-Your Step-by-Step Guide to an Epic Class Discussion Sturtevant-Style",
            "datePublished": "Fri, 02 Mar 2018 22:55:03 +0000",
            "description": "In the midst of your last class discussion, you may have felt some pangs of disappointment. Perhaps, there was not enough engagement. Or maybe, the participation level was not satisfactory. Some students may have monopolized the airwaves. Well...I'm here to help.<br /><br />In this episode, you'll be treated to a step-by-step approach to epic class discussions. This template can be used repeatedly. Welcome, dear friends, to Philosophical Chairs Sturtevant-Style!",
            "length": "14776416",
            "sourceUrl": "https://api.spreaker.com/download/episode/14185775/95_your_step_by_step_guide_to_an_epic_class_discussion_sturtevant_style.mp3"
        },
        {
            "title": "94-Usher in Relevance Courtesy of Elon Musk and Peergrade...Starring Mitchell Charles",
            "datePublished": "Sat, 24 Feb 2018 11:50:05 +0000",
            "description": "I get frustrated when I'm asked to do something irrelevant. Don't you? And yet, many teachers dread when students ask, \"When am I ever going to need to know this stuff?\" It's a rather obnoxious way of asking, \"Is this lesson relevant?\" Now, picture this. You craft a lesson that is so relevant that you hope some kid inquires! This episode is designed to help you create such a lesson. To help in this mission is an awesome primary source.Mitchell Charles is an articulate young man destined for academic brilliance. <br /><br />In World Civilization, we were meandering through a unit on the Industrial Revolution. This topic typically leaves some students cold. My challenge was to make it relevant. I did this with the help of Elon Musk and Peergrade.",
            "length": "31573551",
            "sourceUrl": "https://api.spreaker.com/download/episode/14130865/94_usher_in_relevance_courtesy_of_elon_musk_and_peergrade_starring_mitchell_charles.mp3"
        },
        {
            "title": "93-The Evolving Seamless Relationship Between K12 and Higher Ed...Starring Penny Sturtevant",
            "datePublished": "Sat, 17 Feb 2018 18:10:05 +0000",
            "description": "I get inspiration for my episodes from odd sources. One of my New Year's resolutions is to read more. The past few years, I've been busy writing my book, so I had zero time to consume words because I was too busy creating narratives. That's changed and it's delightful. Currently, I'm reading Elon Musk: Tesla, SpaceX, and the Quest for a Fantastic Future by Ashlee Vance. This book is about Musk's incredible vision, his entrepreneurial spirit, and his dogged determination. The book is also about how crucial it is to embracing change. I've been inspired by reading it! <br /><br />Consequently, I needed to bring a change agent on my podcast. Penny Sturtevant is the College and Career Readiness Coordinator for the Big Walnut Local Schools. Penny is an expert on prevailing trends in education in regard to career ed and college readiness. We discuss the brave new frontier of K12 and Higher Ed's evolving relationship. In the title, I utilized the word seamless. Listen to this powerful episode to learn why.<br /><br />This program does not feature a tactic, a tool, or a lesson to specifically engage kids. Instead, this episode could inspire you to seek out an enrichment path for your students. If you're successful, I predict you'll be greatly inspired as well.",
            "length": "25373104",
            "sourceUrl": "https://api.spreaker.com/download/episode/14077292/93_the_evolving_seamless_realitionship_between_k12_and_higher_ed_starring_penny_sturtevant.mp3"
        },
        {
            "title": "92-Flavor Tomorrow's Lesson with an International Perspective...Courtesy of Brad Gosche and the Columbus Council on World Affairs",
            "datePublished": "Sat, 10 Feb 2018 16:10:04 +0000",
            "description": "I'll bet you've heard your students complain about where they live...the community where you teach them by the way. I did my share of whining when I was a teen. I felt like little New Concord, Ohio was nowhere. And yet, there's virtually no nowhere anymore! We all live and function in a global economy. If your students don't believe it, have them conduct a simple inventory of what they're wearing and carrying. Ask them to record where all of their possessions are manufactured. I'll bet they're not lugging around to much Made in the USA.<br /><br />Unfortunately, some in our nation would like be isolated. This is a fool's errand. Students, on the other hand, who embrace the international nature of modern existence will prosper. Teachers, therefore, have an obligation to help students pursue and master this paradigm. To help in this quest, today's episode will feature the urbane Brad Gosche. Brad is the Vice-President of Education and Communication at the Columbus Council on World Affairs. <br /><br />Here's the council's two-fold mission:<br /><br />To be the leading nonpartisan, globally-focused organization in the Columbus Region. The Council fosters a community that is well-informed about critical international issues as they affect the world, nation and the local region, and whose citizens utilize this insight to make effective decisions in our global society.<br /><br />This episode will not only inspire you to include a global perspective in your curriculum, it will also provide two outstanding activities you can employ tomorrow. The first is Geert Hofstede's country comparison model. The second is taking your kids on a wonderful Trip to Mintana. Please listen to this powerful episode for descriptions of and solid ideas about how to use each.",
            "length": "36281672",
            "sourceUrl": "https://api.spreaker.com/download/episode/14018655/92_flavor_tomorrow_s_lesson_with_an_international_perspective_courtesy_of_brad_gosche_and_the_columbus_council_on_world_affairs.mp3"
        },
        {
            "title": "91-Can your Students Spot a Fascist? Starring Scott Elliott",
            "datePublished": "Sat, 03 Feb 2018 16:44:46 +0000",
            "description": "If you've taught a humanities class, you've probably recognized how frequently Adolf Hitler comes up. Unfortunately, many kid's understanding of Hitler and Fascism doesn't expand much past the Holocaust.<br /><br />Scott Elliott teaches 9th Grade World History with me. Right before Christmas Break, we were yakking about how we could teach Fascism, our first unit in January, in a more engaging and impactful way. Scott found a wonderful resource which formed the backbone of the assignment. The article is by Laurence W. Britt and is entitled Fascism Anyone. The assignment we created challenged kids to rate WWII leaders on the 14 Characteristics Britt articulates and also to apply them to current leaders with authoritarian traits. <br /><br />Please give a listen and if you like what you hear, migrate to my show notes for outstanding links.",
            "length": "17290027",
            "sourceUrl": "https://api.spreaker.com/download/episode/13962985/91_can_your_students_spot_a_fascist_starring_scott_elliott.mp3"
        },
        {
            "title": "90-CYOA (Choose Your Own Assessment)...staring Louis Soper, Will Koppmann, and Mae Reasner",
            "datePublished": "Sat, 27 Jan 2018 16:54:25 +0000",
            "description": "Louis Soper is a middle school social studies teacher in Lancaster, Pennsylvania. Louis has done a remarkable job of empowering his kids to demonstrate their learning. He refers to this process as CYOA, or Choose Your Own Assessment. To help in this endeavor, Louis deputized two of his outstanding students Will Koppmann and Mae Reasner. <br /><br />Student-led learning is a powerful tide in American education. Wax up your board and hop along for the ride!",
            "length": "25915903",
            "sourceUrl": "https://api.spreaker.com/download/episode/13902315/90_cyoa_choose_your_own_assessment_staring_louis_soper_will_koppmann_and_mae_reasner.mp3"
        },
        {
            "title": "89-If your Kids have Grown Tired of Kahoot, Please try Quizlet Live...Starring Jennifer Ladd",
            "datePublished": "Sat, 20 Jan 2018 19:10:04 +0000",
            "description": "I was exposed to Kahoot a few years back. I loved it immediately. It's been a huge hit at our school. Unfortunately, there can be too much of a good thing. Many of our kids are tired of Kahoot. Kahoot also has foundational flaws. Invariably, there are students who emerge as virtually unbeatable in Kahoot. Guessing quickly in Kahoot also can pay huge dividends, so many kids mindlessly respond without investing much thought. I still like Kahoot...but I was thrilled to find an alternative.<br /><br />And here, dear reader, is where Quizlet Live makes a dramatic entrance. I became exposed to this wonderful platform a few months ago. I knew instantly that it was a massive upgrade from Kahoot. Quizlet Live creates a beautiful competition between randomly selected teams of students. On your SmartBoard, students monitor a fascinating horse race unfold. Your students will be enthralled!<br /><br />I have a wonderful guest to help tell the story of Quizlet Live. Jennifer Ladd is an elementary teacher at Scotch Elementary in suburban Detroit. Jennifer and I got to know one another through interacting during a Twitter chat. From the moment we started interacting, I knew she had the potential to be a marvelous guest. I was not disappointed!",
            "length": "23487562",
            "sourceUrl": "https://api.spreaker.com/download/episode/13843907/89_if_your_kids_have_grown_tired_of_kahoot_please_try_quizlet_live_starring_jennifer_ladd.mp3"
        },
        {
            "title": "88-Make your Math Class Enchanting...Starring Denis Sheeran",
            "datePublished": "Sun, 14 Jan 2018 15:14:31 +0000",
            "description": "I remember trudging to Math class in high school...AND I MEAN TRUDGING. I had zero confidence, zero interest, and I could not fathom any relevance in what I was being asked to do. If you're a Math teacher, these adolescent frustrations may sound familiar. Guess what...I get the \"Why do we have to learn this stuff?\" question in history class too. Think about it. It's a fair question. Maybe, educators need to get better at answering it. <br /><br />Today's episode will help you. Denis Sheeran is the Director of Student Achievement at Weehawken Township School District, which is in New Jersey. He's going to help all of us answer that important student question!",
            "length": "42764920",
            "sourceUrl": "https://api.spreaker.com/download/episode/13799723/88_make_your_math_class_enchanting_starring_denis_sheeran.mp3"
        },
        {
            "title": "87-The New Year's Resolution Ice-Breaker Game",
            "datePublished": "Mon, 08 Jan 2018 16:45:05 +0000",
            "description": "Yes...I know it's January 8th, but it's not too late to lay the New Year's Resolution Ice-Breaker Game on your students. This goal-setting opportunity affords teachers a wonderful chance to:<br /><br />deputize students in their resolution quest<br />enlighten kids about their lives outside the classroom<br />make themselves more approachable<br />gives teachers a needed boost in obtaining their goals<br />helps kids get to know one another<br />encourages students to set goals<br />challenges kids to make their goals public, which gives goals more umph<br />This is an exceedingly easy activity to set-up. All you need is a class roster copy for each student and a Padlet Labeled New Year's Resolutions. Pass out a roster to each student and provide each with the Padlet link. I gave my students the following directions:<br /><br />For the next minute, create some resolutions for this year. Please keep the resolutions to yourself and any resolution you publish in this activity must be school-appropriate. <br /><br />Next, choose one resolution you're willing to share. Post it on the Padlet, but DO NOT attach your name!<br /><br />Read each post on the Padlet. Try to match some of the resolutions with your classmates on the roster I provided.",
            "length": "12284553",
            "sourceUrl": "https://api.spreaker.com/download/episode/13748798/87_the_new_year_s_resolution_ice_breaker_game.mp3"
        },
        {
            "title": "86-A NewYear's Resolution that will Transform your Interactions with Kids",
            "datePublished": "Mon, 01 Jan 2018 05:05:03 +0000",
            "description": "Heard enough?  Unfortunately, many adults think that this crop of teenagers are the harbingers of the apocalypse.  They are not.  The world will go on.  Hopefully the previous quotes demonstrate that adults from different times and climbs have felt similar anxiety about their youth.  Harry Truman was right; there is truly nothing new in the World.<br /><br />Episode Template<br /><br />The Problem:<br /><br />Teachers can get fed-up with contemporary youth.<br /><br />The Solution:<br /><br />Learn to accept that many student-teacher annoyances are out of your control.<br /><br />What you can do Tomorrow:<br /><br />Make a list of all the things about contemporary youth that you find distasteful.<br />Eliminate everything on the list that is out of your control.<br />Your New Year's resolution is to focus your energy to help students improve in areas where you have influence and to accept aspects of their nature's that you can't control.<br />Learning to focus in this way will help your students and take a huge burden off your shoulders. HAVE A MARVELOUS 2018 AND THANKS FOR LISTENING!",
            "length": "14754283",
            "sourceUrl": "https://api.spreaker.com/download/episode/13676804/86_a_newyear_s_resolution_that_will_transform_your_interactions_with_kids.mp3"
        },
        {
            "title": "85-Stella got her Groove Back by Becoming Google Certified...Starring Stella Pollard",
            "datePublished": "Mon, 18 Dec 2017 16:12:09 +0000",
            "description": "A 30-year teaching gig is no walk in the park. It's hard to imagine anyone doing the same thing for 30 years, but that's exactly what many teachers do. Please don't interpret this statement as negative towards this noble profession. It certainly was not intended that way...it's just human nature to get restless regardless of how much you love a job. I love teaching. I love my students. However, I've gone through seasons in my career when I felt stymied. Such feelings were my primary motivation to write my books and create this podcast. <br /><br />For some teachers, migrating to administration fulfills their goal-oriented natures, but admin is certainly not for everyone. The rest of us mere teachers must generate our own tactics for battling complacency. This episode offers an idea...become Google certified. <br /><br />To talk about this fascinating option is the effervescent Stell Pollard. Stella is a 4th grade Science teacher from Frankfurt, Kentucky. After her rookie year in the classroom, Stella felt like she needed to up her instructional game. She pursued Google certification as a result of this professional restlessness. In the process, she's transformed her classroom and opened professional doors for herself. Stella is going places! She is not only on a mission to create the best possible learning environment for her kids, but she's also on hero's quest to help colleagues do the same.",
            "length": "29361970",
            "sourceUrl": "https://api.spreaker.com/download/episode/13615743/85_stella_got_her_groove_back_by_becoming_google_certified_starring_stella_pollard.mp3"
        },
        {
            "title": "84-Send your Kids on a Hero's Journey with Storybird...Starring Samantha Hart and Merrick Kasper",
            "datePublished": "Mon, 11 Dec 2017 14:55:03 +0000",
            "description": "Episode 83 was a real treat for me. I yakked with Elontra Hall about something near and dear...storytelling. I'm so committed to enhancing this skill in the classroom, that I just couldn't quit with one episode. What makes this episode so special, is I bring back the original sources. Samantha Hart and Merrick Kasper are here to explore storytelling from their perspective. What's interesting, however, is that these two brilliant young folks don't address teachers using stories, but instead kids using stories to peer teach.<br /><br />My students used the hero's journey template to enlighten their peers. Of course my buddies the Hyperdocs Girls have an outstanding hero's journey template ready and waiting for you to copy and transform.  <br /><br />In addition to a peer teaching storytelling activity, these young ladies will also introduce you to a neat tool called Storybird. Storybird empowers kids to take a story and transform it into a beautiful and enchanting picture book. It's remarkably easy to use and a highly recommend it.  <br /><br />My kids were meandering through a unit on India. We needed to grasp the impact of two remarkable individuals...Siddhartha Gautama and Ashoka. Here's how we did it:<br /><br />Students paired up...one took Gautama and one took Ashoka.<br /><br />Each student then applied their subject to the hero's journey template. Here's my rendition which I created for this assignment. <br /><br />Students made each page of their Storybird a phase in the hero's journey.<br /><br />Kids then enlightened their partner by presenting their Storybird.",
            "length": "20924289",
            "sourceUrl": "https://api.spreaker.com/download/episode/13534302/84_send_your_kids_on_a_hero_s_journey_with_storybird_starring_samantha_hart_and_merrick_kasper_output.mp3"
        },
        {
            "title": "83-A Bard from Detroit Mesmerizes his British Students...Starring Elontra Hall",
            "datePublished": "Mon, 04 Dec 2017 17:00:04 +0000",
            "description": "April Domine, my former superintendent, once made a power suggestion. She encouraged me to read a book by Daniel H. Pink called A Whole New Mind. It was an amazing recommendation. The crux of the book is that the right side of the brain is going to be the star of the future. The subtext of the title says it all: Moving from the Information Age to the Conceptual Age. As I read this excellent book, I felt Daniel was verbalizing everything I’ve always felt about the learning process. And to top it off, he is a fellow Buckeye!<br /><br />Daniel devotes an entire chapter to the power of story. In the opening part of the chapter, he refers to earlier parts of the book. One reference is fact-based. He challenges the reader to recall some important specific data point from one of the opening chapters. No doubt, most of the readers struggled to recall a specific statistic...I certainly did. He then asks readers to recall a fascinating comparison between the legendary John Henry, The Steel Driving Man, and Gary Kasperov, the chess champion defeated by the IBM computer in 1997. Both John Henry and Gary Kasperov demonstrated the limitations of even the most skilled and determined human in the face of advancing technology. When Daniel referred to these rich narratives, the feelings I had when I first read them, the moral, and many of the details, immediately surfaced on my hard-drive.<br /><br />Here is what Daniel Pink has to say:<br /><br />Our difficulty retrieving that isolated factoid, and our relative ease summoning the sad saga of Gary Kasperov, aren’t signs of flaccid intelligence or impending Alzheimer’s. They merely demonstrate how our minds work. Stories are easier to remember because, in many ways, stories are how we remember.<br /><br />And here is where my guest Elontra Hall makes a grand entrance. Elontra is from Detroit, but he lives and teaches in the UK. The story about his migration is fascinating and will be explored in this episode. He and I became friends on Twitter and I instantly loved his vibe. I prompted him to be a guest. He agreed as long as he could talk about storytelling. I was totally down with that condition!",
            "length": "36285458",
            "sourceUrl": "https://api.spreaker.com/download/episode/13498511/83_a_bard_from_detroit_mesmerizes_his_british_students_starring_elontra_hall.mp3"
        },
        {
            "title": "82-Class Clown Mangagement",
            "datePublished": "Sun, 19 Nov 2017 21:12:27 +0000",
            "description": "Many teachers cringe when they hear “humor in the classroom” because it brings to mind the class clown--the scourge of serious learning. First of all, I want to note that not all class clowns are problematic. Some kids are just delightfully funny and have skills to use their humor without harm or disruption. However, there are class clowns that seem to be “the scourge” because teachers just do not know how to deal with them. In the past, many class clowns faced frightening consequences. (Back in the day, they probably took the brunt of the corporal punishment meted out at the principal’s office.) But regardless of the consequences, every school still had class clowns. It is not acceptable to violate the Geneva Convention; so let’s explore a better way to live with class clowns.<br /><br />Teaching is a tough existence if you are at odds with your students. You can learn to welcome them, appreciate their humor, and keep them from disrupting or dismantling classroom plans or relationships. I’ll share some tips that I have learned from working at this challenge.<br /><br />The most effective way to manage class clowns is to connect with them. Education would be a dull enterprise without their humor. Embrace that they exist, and try to get them on your side. And that dear listener...is what this episode will help you do!",
            "length": "15147537",
            "sourceUrl": "https://api.spreaker.com/download/episode/13370764/82_class_clown_mangagement.mp3"
        },
        {
            "title": "81-Make a Kid Feel Great...Give them a Verbal Praise Coupon...Starring Catherine Cook and Audrey Justice",
            "datePublished": "Mon, 13 Nov 2017 20:25:03 +0000",
            "description": "Just the other day...I was cruising down the hallway at my school and I landed on the business end of 3 outstanding compliments in the span of about 5 minutes. These compliments were totally unsolicited and really hit the spot! I felt an adrenaline rush for the remainder of the day as a result. I'll bet you've experienced an unexpected compliment, or two. Didn't you feel like it was Christmas morning?<br /><br />Unfortunately, many are reluctant to praise their fellow man. What a pity. Don't just think, Wow...my buddy is looking really fit. Tell them! They probably need to hear it and it will inspire them to keep working out. <br /><br />When it comes to students, teachers frequently compliment kids on their academic efforts, but how about expanding our repertoire? That's what this episode is about. Two of my original sources...Freshmen Catherine Cook and Audrey Justice will explain the power of teachers paying kids compliments.<br /><br />I'm going to promote a systematic, premeditated, and public way to do just that. The verbal praise coupon is a way to bond with your kids, make them feel great, and perhaps elevate them in the eyes of their peers. If you're tired of awarding the same old extra credit, this episode is for you.",
            "length": "13740407",
            "sourceUrl": "https://api.spreaker.com/download/episode/13306325/81_make_a_kid_feel_great_give_them_a_verbal_praise_coupon_starring_catherine_cook_and_audrey_justice.mp3"
        },
        {
            "title": "80-The Powerful Sarcasm Lesson Plan",
            "datePublished": "Tue, 07 Nov 2017 00:35:03 +0000",
            "description": "One fine day in my little education world...I witnessed the negative power of sarcasm. I was hanging with a colleague who became frustrated with a student's lack of effort. The young man did not have his assignment. Instead of asking the kid...<br /><br />What happened?<br />Were you unclear on instructions?<br />Tell me what's up.<br />Let me help.<br /><br />my teacher comrade responded to the news of the student's lack of preparation with sarcasm, \"Wow...that's really going to prepare you to compete in the global economy!\" This volley was well received by the rest of the class. There was much laughter and a few of the young guy's classmates tossed in some verbal darts aimed at the youngster to support their teacher. The young man laughed too, although he blushed. I wondered if he was really okay with the barb. <br /><br />This entire episode might seem innocent. I'll argue however, that it was a poor relational move on the instructor's part. The teacher absolutely elevated himself at the expense of his student. I don't know if the kid was injured by the comment, but it's conceivable that the sarcasm could have reinforced many of the insecurities the boy already had about himself. While his exterior was saying, \"Good one Mr. X. You got me there!\" Internally, he may have thought, Wow. I guess it's true. Maybe, I am irresponsible. Maybe, I do have a bleak future. <br /><br />I certainly don't know if these thoughts were deviling this kid, but why risk it? I'll argue that you should purge sarcasm from your classroom. This may be a tall order because sarcasm can be a vice. At the time of consumption it feels real good, but the aftershocks can be unsavory. Let's get rid of this tendency and your students can help in this process.",
            "length": "14892592",
            "sourceUrl": "https://api.spreaker.com/download/episode/13236180/80_the_powerful_sarcasm_lesson_plan.mp3"
        },
        {
            "title": "79-Inspire your Kids to Embrace the 6 Degrees of Separation...Starring Russell Doup",
            "datePublished": "Mon, 30 Oct 2017 23:05:03 +0000",
            "description": "Russell Doup is my nephew. Russell Doup is a 25-year-old stockbroker and former Ohio State football player. Russell Doup is living with his uncle...yours truly...while he builds his client base. Consequently, we hang out a lot. About a month ago, we watched The Founder the story of Ray Kroc who was the force behind McDonald's. We both loved the movie. Ray, played by Michael Keaton, was a champion networker. He used this skill to transform a small hamburger stand in California into a dominant multinational corporation. Russell is a 24/7 networker. We agreed that the movie was inspirational and it inspired a passionate conversation about networking.<br /><br />Watching the movie challenged me to inventory all the times I've benefited from networking. I met my lovely wife through social networking (this was old school social networking prior to the internet...I'm talking 1988). Every teaching interview I've landing was the result of personal and direct networking. As Russell and I sat on the couch and discussed the implications of The Founder, a thought struck me, Networking is darned important, but schools don't teach kids how to do it. I turned to my nephew and asked if he ever learned about networking in school. He responded negatively. My experience as a student was the same. In the midst of this Eureka moment, I knew I had to do an episode on networking featuring my networking nephew!",
            "length": "18958129",
            "sourceUrl": "https://api.spreaker.com/download/episode/13173204/79_inspire_your_kids_to_embrace_the_6_degrees_of_separation_starring_russell_doup.mp3"
        },
        {
            "title": "78-DEINSTITUTIONALIZE your Classroom...Starring Casey Ewy, Heather Smith, Haley Smith, and Richard Hancock",
            "datePublished": "Tue, 24 Oct 2017 10:10:04 +0000",
            "description": "On a brilliant October afternoon a couple of decades ago, the fire alarm shattered the tranquility. Our school was experiencing a gas leak. The students and staff hurriedly spilled out of the building and marched on to the practice football field. We were told to stay put and wait till the all clear signal could be issued. You've probably experienced such situations...1,000 adolescents herded outside and told to wait patiently. It was bedlam!<br /><br />What I found so interesting was the reactions of the kids. They exited their institutionalized classrooms into a beautiful day and immediately came to life. As they frolicked in the afternoon sun, one droll young man approached me and said the following, Mr. Sturtevant...our staff much looks better in artificial lighting. I laughed uproariously, but the comment struck me. Just maybe it takes removing kids from a bland, sterile, uniform, institutionalized setting to stoke their creative juices and find joy.  <br /><br />And here dear reader, is where Dr. Casey Ewy makes a dramatic appearance. Dr. Casey teaches at Susan B. Anthony Middle School in Manhattan Kansas. Dr. Casey is all about DEINSTITUTIONALIZING classrooms. Her objective is to build a family atmosphere in her room which will bolster relationships, ignite creativity, and stoke engagement. Joining her on today's episode is her team of like-minded colleagues Richard Hancock, Haley Smith, and Heather Smith.",
            "length": "29224902",
            "sourceUrl": "https://api.spreaker.com/download/episode/13105185/78_deinstitutionalize_your_classroom_starring_casey_ewy_heather_smith_haley_smith_and_richard_hancock.mp3"
        },
        {
            "title": "77-Flipgrid is a Powerful Little Tool that's a Blast...Starring Aharon Rockwell",
            "datePublished": "Tue, 17 Oct 2017 11:19:29 +0000",
            "description": "When evaluating a new tech tool, I must be able to use it within 5 minutes...or I just bag it. If I can't figure it out by then, my students will be lost. I was conducting a PD session in Ft. Worth this past summer. A young lady called me over and said, \"Have you heard of Flipgrid and if so, have you used it?\" My answer was, No and no. I made a mental note to try it when the school year started, but I remember thinking...It has to pass my ease of use test. Last week was 8 weeks in and I finally got around to it. I'm glad I did!<br /><br />Flipgrid is a cool way to encourage student voice. You record a video question and then kids record a 1 to 90-second video on their smartphones or Chromebooks in response. I mastered Flipgrid in about 3 minutes. My students figured it out in 2. This tool is great in terms of providing a creative vehicle for student expression. In last week's episode, Chrissy Romano warned that ostentatious presentation tools like Flipgrid might unravel introverted kids. My response, which Chrissy liked by the way, was to take anxiety away by permitting students who were uncomfortable to interview someone.<br /><br />To help me in my Flipgrid explanation quest is an awesome original source. Aharon Rockwell is a freshman and in my Global Studies class. Aharon knew I had a podcast and approached me about being a guest. I jumped at his offer and I'm glad I did. He's a great guest!",
            "length": "16684929",
            "sourceUrl": "https://api.spreaker.com/download/episode/13057993/77_flipgrid_is_a_powerful_little_tool_that_s_a_blast_starring_aharon_rockwell_output.mp3"
        },
        {
            "title": "76-Quit Trying to Turn your Introverts into Extroverts...Starring Chrissy Romano",
            "datePublished": "Tue, 10 Oct 2017 13:55:02 +0000",
            "description": "A number of years ago, I took the Myers & Briggs personality assessment. I was tabbed an ENFP. When I read the description of my type, I was thrilled. I thought, Yup that's me and I'm glad it's me. <br /><br />My enthusiasm, particularly for the E classification which stands for extrovert, was well-founded. Being an extrovert is the gold standard in America, particularly in our schools. As students, extroverts are the volunteers, the kids who make cheesy videos, the guys who march up to the homecoming queen and ask them out (my wife was a homecoming queen), and the students who inject levity into drab academic settings. As teachers, extroverts are the hams. Even worse, many extroverts seem determined to transform quiet contemplative students into mini versions of them. Extroverts say things like, I'm going to pull you out of your shell, or... Put yourself out there. I've done this! I must change!<br /><br />And here's where my stunning guest, Chrissy Romano-Arribato from the Garden State, makes her grand entrance. As impressive as Chrissy truly is, I invited her on this episode because she's a proud introvert. She's going to help blowhards like me help the 1/3rd of my students that are introverted.",
            "length": "47228466",
            "sourceUrl": "https://api.spreaker.com/download/episode/12997837/76_quit_trying_to_turn_your_introverts_into_extroverts_starring_crissy_romano.mp3"
        },
        {
            "title": "75-The National Anthem, Code Switching, and an EPIC Teachable Moment...Starring Marlena Gross-Taylor",
            "datePublished": "Sun, 01 Oct 2017 23:25:03 +0000",
            "description": "I became politically aware in 1968...my 7th year of existence. The world seemed on fire. The young Jimmy Sturtevant was busy being a kid, but events kept invading my innocence. In April of that year, Martin Luther King was assassinated. Just weeks later, Robert Kennedy suffered the same fate. The insanity of the Democratic convention in Chicago monopolized TV coverage, but what really captivated the young me was the Mexico City Olympic Games. I watched in wonder as one African-American athlete after another shattered world records in the high altitude of Central Mexico. One black American gold medal winner climbed the podium, donned a black glove, raised his fist in the air, and then bowed his head during the National Anthem. <br /><br />This moment came back to me this past week when the NFL/National Anthem controversy descended. I knew that I had to do an episode on this topic. My objective is not to promote my views, but rather to help brother and sister educators navigate the rhetorical minefield that is this issue. I also knew that I needed help. I decided to share my mic with someone who doesn't look like me...someone who has had a different life experience. And that my dear listener...is where my good buddy Marlena Gross Taylor makes a dramatic entrance. <br /><br />In this episode, Marlena and I will break down this issue and build you up in the process. We'll give you courage to tackle your fears and take on this controversy confidently.",
            "length": "59459378",
            "sourceUrl": "https://api.spreaker.com/download/episode/12930386/75_the_national_anthem_code_switching_and_an_epic_teachable_moment_starring_marlena_gross_taylor.mp3"
        },
        {
            "title": "74-Peergrade takes Student Collaboration to an Unprecedented Level...Starring David Kofoed Wind and Kristen Spayde",
            "datePublished": "Tue, 26 Sep 2017 11:25:03 +0000",
            "description": "I like to think that I have a wonderful rapport with my students. And yet…I’m still their teacher which is a significant barrier. I also have 40 years on my kids. To them, I’m someone who has a lot more yesterdays than tomorrows. My observations on their lives, while I hope respected and valued, does not carry the weight of a peer.<br /><br />Just 4 sentences into this intro, the wonderful word peer makes its grand entrance. Peer acceptance, peer constructive criticism, peer praise, and peer collaboration are the powerful fuels that ignite and propel the outstanding education tool called Peergrade. Anyone who’s taught for more than 5 minutes knows the power of peer influence.<br /><br />In this episode, I’ll interview David Kofoed Wind the founder of Peergrade. Peergrade is a marvelous way to capitalize on kid’s natural inclination to listen to their peers. This tool randomly assigns student creations to classmates and then guides and monitors evaluations. Peer feedback is not only highly valued but it’s also welcomed because it’s often couched in contemporary youth vernacular. Kids understand how to communicate with other kids. And finally, a student evaluator who focuses on just one narrative written by just one peer does not suffer eye-strain and fatigue that teachers often experience wading through 100 student narratives. A 1 on1 evaluation experience is a fresher, focused, and perhaps more useful interaction.<br /><br />Joining me in the Room 111 Studios is Kristen Spayde. Kristen may sound familiar. She starred in Episode 39 about going paperless and in Episode 58 when we dished with the HyperDocs Girls. Please give this awesome tool a try!",
            "length": "30416161",
            "sourceUrl": "https://api.spreaker.com/download/episode/12875601/74_peergrade_takes_student_collaboration_to_an_unprecedented_level_starring_david_kofoed_wind_and_kristen_spayde.mp3"
        },
        {
            "title": "73-Impose the 15-Word Gauntlet on your Students...Starring Arielle Brown and Ashlynn Hathaway",
            "datePublished": "Tue, 19 Sep 2017 13:54:18 +0000",
            "description": "f you've taught for any time what so ever, you've probably suffered through painfully boring student presentations. And if you were bored, think of the other students. Let’s strive to make such presentations are:<br /><br />More attractive<br />More engaging<br />Less time-consuming<br />More interactive<br /><br />In order to create such presentations, your kids must first run the gauntlet.<br /><br />According to various sources, fifteen to twenty words is the average sentence length. That seemed long, till I actually wrote a sentence:<br /><br />When I was in high school, I would have laughed uproariously<br /><br />if anyone had informed me that I was destined to be a teacher. (24 words)<br /><br />This will be a wonderful challenge for your students. They may revolt. Not only is it important to reduce the number of words, the limit will also hopefully dissuade copying and pasting. This awful practice flirts with plagiarism and makes for exceedingly dull presentations as students drone the words of another.",
            "length": "15975166",
            "sourceUrl": "https://api.spreaker.com/download/episode/12837793/73_impose_the_15_word_gauntlet_on_your_students_starring_arielle_brown_and_ashlynn_hathaway.mp3"
        },
        {
            "title": "72-A Harvard MBA Inspires Educators to Reach out to People...Just Like Him...Starring Brent Wilkinson",
            "datePublished": "Tue, 12 Sep 2017 12:00:04 +0000",
            "description": "About a decade ago, I attended the Mt. Vernon High School Class of 1981 Reunion. It was a lot of fun for a while, but as the night wore on, my ability to follow and contribute to stories that were unfamiliar with people I didn't know, became problematic. My wife was having a blast and was certainly entitled to uncompromised nostalgic bliss, so I had to step-up my social game.<br /><br />Penny, fortunately introduced me to an old friend...Brent Wilkinson. The next 90 minutes simply evaporated. Brent is a fascinating guy with a wonderful Horatio Alger story. He left Mt. Vernon in 1981 bound for Boston. He went on to captain the Harvard football team, earn his MBA, and thrive as a corporate officer and entrepreneur in Boston's highly competitive private sector. I loved his story, but what impressed me more was his humble recounting of it. Penny and I visited Brent in Boston this past summer. As we strolled the city and interacted with this fascinating guy, I knew I had to get Brent on my podcast.<br /><br />When educators and private sector types collaborate, it creates opportunities not just for students. My experience interacting with business folk has revealed that problems of communication, motivation, and management are largely universal. What's also universal is the value of growing human capital which is exactly what can happen if teachers reach out. Brent and his colleagues will absolutely collaborate with my kids before year's end! Why don't you create such an opportunity for your students?",
            "length": "44922470",
            "sourceUrl": "https://api.spreaker.com/download/episode/12775393/72_a_harvard_mba_inspires_educators_to_reach_out_to_people_just_like_him_starring_brent_wilkinson.mp3"
        },
        {
            "title": "71-Issue the Nonverbal Communication Challenge to your Kids",
            "datePublished": "Tue, 05 Sep 2017 11:20:04 +0000",
            "description": "It's hard to believe, but humans communicated before there were words. We may not realize it, but we still use pre-verbal methods of communicating. There's an entire language that we unknowingly transmit with each interaction...it's nonverbal! It comes naturally to us. All we have to do is tune in to an ancient frequency. Think of when you're trying to communicate with someone who can't speak your language. You default to expressive arm gestures and facial expressions. You probably also do this when communicating to your four legged pal. Dogs are champs at reading nonverbals.<br /><br />As teachers, students come at us in waves. It's hard to give kids our undivided attention, but that's precisely what we should TRY to do. Transmitting the right nonverbals is an essential skill that teachers should master. The good news is that mastering such skills is a blast! You can even get your students in on the game.",
            "length": "17914878",
            "sourceUrl": "https://api.spreaker.com/download/episode/12717253/71_issue_the_nonverbal_communication_challenge_to_your_kids.mp3"
        },
        {
            "title": "70-Don't Just have Kids Read About a Place...SEND THEM THERE...Starring Quin Thomas",
            "datePublished": "Tue, 29 Aug 2017 20:30:04 +0000",
            "description": "Picture this...you're studying really cool places like Machu Picchu, Tiananmen Square, the Coliseum, the Taj Mahal, or Timbuktu. Instead of just yakking about it, or having students reading about it, tell kids to hop on their Chromebooks, fly around the world, and then drop in for a close-up view from ground level. In this episode, Quin Thomas will explain how to do just that with Google Maps.",
            "length": "22216539",
            "sourceUrl": "https://api.spreaker.com/download/episode/12681150/70_don_t_just_have_kids_read_about_a_place_send_them_there_starring_quin_thomas.mp3"
        },
        {
            "title": "69-Rebel Against the Bell...Starring Melissa Maxson",
            "datePublished": "Tue, 22 Aug 2017 23:36:42 +0000",
            "description": "Kids are just starting to get it, they’re finally opening up in a discussion, they’re finding great resources for a research paper, they’re starting to harmonize in choir, their sculptures are just beginning to take shape, their findings in a science experiment are just about to materialize and then the bell rings.<br /><br />This frequently happens to Melissa Maxson’s devoted art students. You know you’ve engaged kids when they say, “Dang, I can’t believe the period is over.” Melissa hears this daily.<br /><br />In this episode, hear Melissa's solution to her frustrations with the uniform 50-minute modules. Listen to her recipe to detonate space/time limitations.",
            "length": "16972784",
            "sourceUrl": "https://api.spreaker.com/download/episode/12631664/69_rebel_against_the_bell_starring_melissa_maxson.mp3"
        },
        {
            "title": "68-BattleVant and SturteVingo...Two Zero Tech Ways to Engage Kids",
            "datePublished": "Wed, 16 Aug 2017 01:54:20 +0000",
            "description": "A great way to engage students is to just have some fun with content. Accomplish this by mimicking two iconic American board games...Battleship and Bingo. Certainly, most of your kids have played, or at least are familiar with both. I reworked both games for my classroom. Of course, I renamed them Battlevant and Sturtevingo. I encourage you to create your own labels for your version of these activities.<br /><br />Any time there’s material you’d like to review, Sturtevingo and Battlevant are wonderful engaging options that can be employed frequently. Battlevant is a team game. I’ll demonstrate it as a two team contest, but it could be used with multiple teams. In Sturtevingo, every man and woman is on their own.",
            "length": "13629006",
            "sourceUrl": "https://api.spreaker.com/download/episode/12553361/68_battlevant_and_sturtevingo_two_zero_tech_ways_to_engage_kids.mp3"
        },
        {
            "title": "67-Context is Key to Engagement...let ReadWriteThink Help",
            "datePublished": "Wed, 09 Aug 2017 04:50:57 +0000",
            "description": "I teach history. Even as a boy, I was a history nerd. Recently, I was enjoying the company of friends at a party. My buddies all have college degrees and are successful in their chosen professions. A historical topic surfaced. I decided to conduct a little wine-inspired experiment. I just listened to them pontificate about a subject I knew a lot about. This is generally not my disposition when vino veritas is factored in. What took place was fascinating. While my friends had a working understanding of the topic, their background chronology was out of whack which, of course, did a serious number on their understanding.  <br /><br />If intelligent adults struggle with context on what would seem common historical knowledge, it would be foolhardy to assume that k-12 students, aside from the budding history nerds, would have a clue about the order of events. Contextual ignorance does not just apply to events, but also processes. Students in math, science, and language arts must understand many processes like the quadratic equation, the scientific method, and MLA citation. Chronological awareness with such concepts breeds confidence, which is crucial to engagement. Let’s inspire some of that awareness with a cool virtual timeline builder.",
            "length": "13600750",
            "sourceUrl": "https://api.spreaker.com/download/episode/12511489/67_context_is_key_to_engagement_let_readwritethink_help.mp3"
        },
        {
            "title": "66-Hacking Engagement Again...THE SEQUEL",
            "datePublished": "Wed, 02 Aug 2017 00:30:05 +0000",
            "description": "When I wrote Hacking Engagement, I was amazed that fifty hacks flowed out of my fingertips and compressed the keys of my laptop. Fifty seemed like a marathon, however, those hacks systematically materialized. When I typed the last period of the last sentence, I thought, Wow. that was a lot of hacks. I need a break. But here I am again...back with 50 more engagement hacks. <br /><br />Hacking Engagement Again is just like its predecessor Hacking Engagement: Both are short, containing a little over 30,000 words apiece. Both are comprised of fifty hacks that are each about 600 words in length. Neither is linear. Instead, they’re like cookbooks; you scan the table of contents and find what you need to make tomorrow’s lesson delicious.",
            "length": "44538050",
            "sourceUrl": "https://api.spreaker.com/download/episode/12481039/66_hacking_engagement_again_the_sequel.mp3"
        },
        {
            "title": "65-Matthew Porricelli Preaches the Gospel of Student-Led Learning and his 4th Grade Disciples Back him 1000%",
            "datePublished": "Wed, 26 Jul 2017 10:45:22 +0000",
            "description": "Matthew Porricelli is a 4th grade teacher at the Mamaroneck Avenue School just outside of Manhattan. In this marvelous episode, we learn about Mr. P's classroom from expert witnesses...his students. These kids are a joy to listen to and the things they describe should be standard operating procedure in every classroom regardless of the level. Mr. P's class sounds like a dream, but what really moved me, was the way these young folks responded to their teacher. It's apparent that there's a bottomless mutual affection. This episode is golden for it's outstanding suggestions on pedagogy, but there's something more...something more profound and important. Matt's students are crazy about him! As you listen to these wonderful voices, keep asking yourself, How can I evolve such a climate in my room?",
            "length": "27925917",
            "sourceUrl": "https://api.spreaker.com/download/episode/12437978/65_matthew_porricelli_preaches_the_gospel_of_student_led_learning_and_his_4th_grade_disciples_back_him_1000.mp3"
        },
        {
            "title": "64-The Learning Scientists have a Vaccine for Test Anxiety",
            "datePublished": "Tue, 18 Jul 2017 09:10:28 +0000",
            "description": "The Learning Scientist are researchers determined to help teachers build academic confidence in their students. They do this by offering proven strategies to help kids achieve. Here is the team:Remarkably, they provide all of this free free advice via a comprehensive and powerful resource, which is their website. <br /><br />In this episode, I’ll discuss with Dr. Smith and Dr. Kupper-Tetzel:<br /><br />How the Learning Scientists came to be<br />How to utilize their tremendous website<br />2 of their 6 strategies<br /><br />Let the Learning Scientists help you help your kids build academic confidence.",
            "length": "0",
            "sourceUrl": "https://api.spreaker.com/download/episode/12352570/64_the_learning_scientists_have_a_vaccine_for_test_anxiety.mp3"
        },
        {
            "title": "63-Collaborating with Students is an Essential 21st-Century Skill...let Ann Coates Help you do it",
            "datePublished": "Wed, 12 Jul 2017 11:35:35 +0000",
            "description": "If one were to make a list of essential educator skills for the 21st-Century, certainly...collaborating with students would be near the top. This episode features a collaboration expert. Ann Coates is a veteran high school teacher in Hanover, Massachusetts. Ann is all about giving timely and meaningful feedback to kids. She states that instant feedback is, where the actions is!<br /><br />Utilize some of Ann's outstanding suggestions and observe your relationships with students evolve as your collaboration with them blossoms. As our education system navigates to a more student-led learning template, student-teacher collaboration will no longer be a cool thing that a few teachers in the building have mastered. It will be an essential skill that ALL educators simply must embrace.",
            "length": "0",
            "sourceUrl": "https://api.spreaker.com/download/episode/12329446/63_collaborating_with_students_is_an_essential_21st_century_skill_let_ann_coates_help_you_do_it.mp3"
        },
        {
            "title": "62-Engage with me about Engagement on the #HackLearning Twitter Chat",
            "datePublished": "Thu, 06 Jul 2017 14:06:09 +0000",
            "description": "On Sunday morning July 9th, from 8:30 to 9:00 AM EST, I will moderate the #HackLearning Twitter Chat. This is in preparation for the release of my second engagement book \"Hacking Engagement Again\", which will be available in early August. Please participate! Here are the questions:<br /><br />8:37-Q1: How do you engage students with lesson hooks?<br />8:45-Q2: What are some strategies that can make lessons ultra-engaging?<br />8:52-Q3: How can the assessment of student learning be conducted in a way that engages learners?<br /><br />Even if you're not available to participate, check out #HackLearning after the fact and see how educators and students from around the world answered these transformational prompts.",
            "length": "0",
            "sourceUrl": "https://api.spreaker.com/download/episode/12294646/62_engage_with_me_about_engagement_on_the_hacklearning_twitter_chat.mp3"
        },
        {
            "title": "61-2 6th Graders from OKC Evaluate Their Teacher's Lesson...Starring Jon Belt, Jordan Flowers, and Conner Odom",
            "datePublished": "Wed, 05 Jul 2017 12:35:15 +0000",
            "description": "Jon Belt teaches 6th grade at Mayfield Middle School in Oklahoma City. Jordan Flowers and Conner Odom are 2 students in Jon's class. This episode is about Jon introducing learning stations in a lesson. The stations mirror the READS method which Jon details in the episode. Introducing movement and structure to class is something all educators should strive for weekly. This episode is worthy for its promotion of this concept, but as I interviewed this empathetic educator and his wonderful young students, another even more powerful dynamic surfaced. Jon Belt has fostered a learning environment where students feel totally comfortable helping Mr. Belt become a better teacher. He asks them to evaluate his teaching and they freely comply in positive and constructive ways. Displaying this powerful and positive dynamic is just as, if not more, important than the excellent learning tactic Jon describes.<br /><br />When I was in 6th grade many moons ago, my teacher was not to be evaluated by students. If I would have offered some teaching advice, I may have ended up on the business end of her paddle. Now, please don't interpret this wrong. I had wonderful teachers growing up. I loved my 6th-grade teacher, Mrs. Bates. It was just a different era. My wonderful teachers would have been even more effective if they would have included, then acted upon, student input.",
            "length": "0",
            "sourceUrl": "https://api.spreaker.com/download/episode/12276255/61_2_6th_graders_from_okc_evaluate_their_teacher_s_lesson_starring_jon_belt_jordan_flowers_and_conner_odom.mp3"
        },
        {
            "title": "60-Morph your Kids into Photojouranalists...Starring Alexandra Lang",
            "datePublished": "Wed, 21 Jun 2017 09:49:57 +0000",
            "description": "Certainly, you’ve heard the old cliché A picture is worth a thousand words. I did some research on this statement and was delighted to learn that prior to photography, individuals used to say, A painting is worth a thousand words. Images, whether captured or manufactured, are powerful. I cannot remember that last Tweet I sent that was imageless. Social media is fueled by compelling images. We need to capitalize on this natural human attraction.<br /><br />Here are five iconic images from American history:<br /><br />1. The painting of George Washington crossing the Delaware<br />2. The WWI Uncle Sam recruiting poster<br />3. The Marines hoisting the flag on Iwo Jima<br />4. Lyndon Johnson taking the oath of office beside a stunned and blood-stained Jackie Kennedy<br />5. Associates of Dr. King standing over his body pointing towards an assassin<br /><br />Do any of these descriptions conjure up mental images? Do they inspire emotions, or perhaps personal narratives? If you weren’t familiar with some of these images, did you Google the description out of curiosity?<br /><br />This episode will demonstrate how to use images in 3 powerful ways:<br /><br />1. To help students understand and a profound concept<br />2. To empower students to create and manipulate images to express themselves<br />3. To hook students in preparation for an impactful lesson",
            "length": "0",
            "sourceUrl": "https://api.spreaker.com/download/episode/12161593/60_morph_your_kids_into_photojouranalists_starring_alexandra_lang.mp3"
        },
        {
            "title": "59-Sometimes you Need to be the Sage on Stage...let Pear Deck Help",
            "datePublished": "Wed, 14 Jun 2017 10:42:00 +0000",
            "description": "Modern educators are discouraged from being the sage on stage. As the overused cliché goes...\"Instead of being the sage on stage, be the guide on the side.\" I'm not a huge fan of this mantra. I understand the need for presentation styles to evolve, but sometimes you need to jump up in front of your kids and inspire them! Even though much of my instruction is flipped, it’s still important to present in front of students. While my kids enjoy my recordings, periodically I treat them to a live performance. A few years ago, my wife and I watched Jersey Boys on the big screen and then we saw it live on stage. There was no comparison. Sometimes, you have to go all Broadway on your kids. Sometimes, you need to be the sage on stage. And here, is where Pear Deck makes its dramatic appearance.",
            "length": "0",
            "sourceUrl": "https://api.spreaker.com/download/episode/12096475/59_sometimes_you_need_to_be_the_sage_on_stage_let_pear_deck_help.mp3"
        },
        {
            "title": "58-Dishin' with the HyperDocs Girls",
            "datePublished": "Wed, 07 Jun 2017 11:40:08 +0000",
            "description": "Kelly Hilton, Lisa Highfill, and Sarah Landis are the co-creators of HyperDocs and authors of the HyperDocs Handbook. These ladies have designed a remarkable website providing teachers with digital lesson templates and plenty of sample HyperDocs. Aside from outstanding organization, the templates are beautiful, which should never be underestimated.<br /><br />I became aware of HyperDocs because of my mentor Kristen Kovak. Not long ago, Kristen waltzed into my room and challenged your humble narrator to start utilizing HyperDocs. In the short time that I've used them, HyperDocs have transformed my Google Classroom feed.",
            "length": "0",
            "sourceUrl": "https://api.spreaker.com/download/episode/12039707/58_dishin_with_the_hyperdocs_girls.mp3"
        },
        {
            "title": "57-Escape Rooms Encourage Students to Sneak Out of your Class...Starring Kayla DeMuth",
            "datePublished": "Wed, 31 May 2017 10:48:47 +0000",
            "description": "Kristen Macklin and Jason Manly are Escape Room Architects. Kristen is a District Media Specialist and Jason a District Instructional Facilitator. When I asked Kristen where she got the idea for student escape rooms, she answered quickly, “Our principal went to one with his kids and loved it. Then, Spanish teacher Jennifer Zimmer appeared and asked for an assessment idea. I did a little research, found an article about educational escape rooms, and then approached Jason Manly with the concept.” What happens next is magical!",
            "length": "0",
            "sourceUrl": "https://api.spreaker.com/download/episode/11989815/57_encourage_students_to_sneak_out_of_your_room_starring_kayla_demuth.mp3"
        },
        {
            "title": "56-Multiply yourself by 26 with Class Playlists...Starring Tracy Enos and Heather Roberti",
            "datePublished": "Wed, 24 May 2017 13:19:29 +0000",
            "description": "I love Spotify. I’ve created a number of cool playlists. My music is known to get guests moving at parties. Most of my playlists consist of songs from my younger days...1970s and 80s R&B. My wife enjoys much of my music, but not all. When I do chores around my house, I often put on my headphones and listen to some of my more ostentatious old skool jamz that I’m certain my wife won’t like. In other words, I personalize my musical consumption. That’s the beauty of the playlists. They provide anytime anywhere jamz on demand. Wouldn’t it be cool if we could personalize tomorrow’s lesson in the same way?   <br /><br />Tracy Enos and her twin sister Heather Roberti are two outstanding middle school educators from West Warwick, Rhode Island. Tracy teaches ELA and Heather is a Math teacher. Both enlightened your humble narrator about the beauty of class playlists. The idea is simple, elegant, and contemporary.",
            "length": "0",
            "sourceUrl": "https://api.spreaker.com/download/episode/11925904/56_multiply_yourself_by_26_with_class_playlists_starring_tracy_enos_and_heather_roberti.mp3"
        },
        {
            "title": "55-Give Students Virtually no Instructions...Starring Charlie Smith",
            "datePublished": "Wed, 17 May 2017 13:31:25 +0000",
            "description": "Picture this...tomorrow you stroll confidently into your first-period class. You gleefully announce the day's essential question. You observe with satisfaction the looks on thirty adolescent faces as their intellectual gears perk to life and start rotating. You then point out that 5 minutes of the class is already in the rear-view mirror, so they better get cracking! You spend the remainder of the period gliding from group to group challenging, inspiring, coaching, offering new perspectives, evaluating, and congratulating. This, my dear friends, is the classroom of the future!",
            "length": "0",
            "sourceUrl": "https://api.spreaker.com/download/episode/11882949/55_give_students_virtually_no_instructions_starring_charlie_smith.mp3"
        },
        {
            "title": "54-Morph Student Identities...Starring Spencer Cappel and Josh Kent",
            "datePublished": "Wed, 10 May 2017 16:00:58 +0000",
            "description": "I'm certain most of my listeners have employed simulations and role play in their class. It's a great way to learn. This episode demonstrates how you can combine role-play and simulations with my favorite student activity.<br /><br />I love Socratic seminars! They’re the embodiment of self-directed learning and student collaboration. Kids take a complex topic, learn about it, and then sit in a circle with their peers and apply it, discuss it, explain it, and ask questions to one another. My experience has been that concepts, events, and topics covered in this fashion leads to deep understanding and significant engagement. But everything, even things you and your students love, will get old if you don’t alter it occasionally.<br /><br />I faced this dilemma in teaching the incredibly complex topic which is the Syrian Civil War. I wanted students to engage in a Socratic Seminar, but I wanted it to be different. We had conducted a number of such seminars and I felt the format was getting a bit stale. So...I decided that in order for my students to understand the Syrian Civil War, they needed to become the powerful actors involved.",
            "length": "0",
            "sourceUrl": "https://api.spreaker.com/download/episode/11820208/54_morph_student_identities_starring_spencer_cappel_and_josh_kent.mp3"
        },
        {
            "title": "53-Entice Kids to Confront Their Phone Obsession and Actually Look Up...AT YOU...Starring Nahom Buckles",
            "datePublished": "Wed, 03 May 2017 14:08:55 +0000",
            "description": "It's so discouraging! You're preaching the gospel of education, enlightenment, self-improvement, promoting humanities' greatest ideas...but then you notice that many kids are staring intently down at their laps. Unfortunately, you know why. They need to put that sweet pair of shoes on their Amazon Wishlist before you notice them obsessing over their screens and redirect them.<br /><br />As a contemporary instructor, I've felt this profound burn. I'll bet you have too. Some teachers are totally hard-nosed. They don't give the kids an inch on phone use during instruction. If that's you...RESPECT! However I, like I suspect many teachers, am not so stern when it comes to students and their phones. Plus, kids are darned adept at subtle screen time. And let's not forget, students can use their devices in class in the pursuit of knowledge. While I'm uncomfortable with prohibition, I'd certainly love to see kids to stare at their phones less during strategic moments of instruction.<br /><br />In this episode, I promote enlightenment over prohibition. I do this with the InTheMoment App.",
            "length": "0",
            "sourceUrl": "https://api.spreaker.com/download/episode/11746870/53_entice_kids_to_confront_their_phone_obsession_and_actually_look_up_at_you_starring_nahom_buckles.mp3"
        },
        {
            "title": "52-Priming the Pump for Tomorrow's Lesson...Starring Campbell Allen and Emma Neeper",
            "datePublished": "Wed, 26 Apr 2017 16:52:50 +0000",
            "description": "You stroll into class and you're stoked! You have an awesome lesson and you can't wait to lay it on your young disciples. Alas! Your students are more interested in who's zoomin' who. You have to compete with contemporary school and youth culture...which is a tall order. You get discouraged because you know that if they gave this lesson their full attention, it would enrich their lives.<br /><br />So...that's the problem and this episode will help you grab them by the virtual lapels and pull them into an amazing learning experience! I brought back some original sources we all love so much...the students! For this episode, I'm joined by Campbell Allen and Emma Neeper ...two wonderful young adults. They took time out of their busy existence to talk about how to prime the pump for tomorrow's lesson.",
            "length": "0",
            "sourceUrl": "https://api.spreaker.com/download/episode/11708758/52_priming_the_pump_for_tomorrow_s_lesson_starring_campbell_allen_and_emma_neeper.mp3"
        },
        {
            "title": "51-Please Apply the You...Y'all...We Template Tomorrow...Starring Norman Eng",
            "datePublished": "Wed, 19 Apr 2017 16:12:35 +0000",
            "description": "Put your hand on a hot stove for a minute, and it will seem like an hour. Sit with a pretty girl, and an hour seems like a minute. That’s relativity. Albert Einstein <br /><br />This wonderful quote is the embodiment of engagement. As teachers...we need to be more like the engaging companion (obviously not in terms of physical attraction) and less like the stove. <br /><br />And that's why I'm simply thrilled to bring you my interview with Norman Eng. We'll discuss the fabulous \"You...Y'all...We\" template. You simply must apply it to tomorrow's lesson!",
            "length": "0",
            "sourceUrl": "https://api.spreaker.com/download/episode/11659219/51_please_apply_the_you_y_all_we_template_tomorrow_starring_norman_eng.mp3"
        },
        {
            "title": "50-Take a Peek at your School in 2037...Starring April Domine",
            "datePublished": "Wed, 12 Apr 2017 21:15:25 +0000",
            "description": "Today, I'm celebrating the release of the 50th episode of the Hacking Engagement Podcast! So, I thought I'd do something special. I interviewed an expert on the future of this noble profession. What will schools look like in 2027? How about 2037? Today's episode will not sound like my other programs. This episode is longer than most...almost 40 minutes. This episode does not have the tight little list at the end explaining what you can do tomorrow. You're certainly encouraged to implement ideas from this conversation into tomorrow's lesson, but I was more focussed on what your lessons and your school will be like 10 and 20 years down the road!<br /><br />My problem with retirement is simple...schools are becoming too fascinating to leave! The way I instruct has changed fundamentally over the past decade. I'm a markedly different teacher than I was last year. I'm closing in on the end of this school year, but I keep thinking about tools, tactics, and strategies I can't wait to try next fall. In short, I'm nowhere near ready to call it quits!<br /><br />Then...I go and interview April Domine and I really get stoked!",
            "length": "0",
            "sourceUrl": "https://api.spreaker.com/download/episode/11598161/50_take_a_peek_at_your_school_in_2037_starring_april_domine.mp3"
        },
        {
            "title": "49-Engage as you Grade...Starring Kaizena",
            "datePublished": "Thu, 06 Apr 2017 09:17:38 +0000",
            "description": "I teach 18-year-olds how to write research papers. I totally get the struggle of students not embracing advice on how to evolve as writers. I was frustrated because I knew my students needed help, but they weren't reading my comments. And then...I met a lovely little app called Kaizena. It detonated my paradigm on providing students with feedback. It transformed grading papers into a collaborative process!",
            "length": "0",
            "sourceUrl": "https://api.spreaker.com/download/episode/11545225/49_engage_as_you_grade_starring_kaizena.mp3"
        },
        {
            "title": "48-Google Classroom...Plus Edublogs...Equals Epic Enrichment...Starring Camden Edwards, Emily Kuederle, and Coltrane Matos",
            "datePublished": "Thu, 30 Mar 2017 08:48:45 +0000",
            "description": "I'll bet you've gazed out at your students and thought:<br /><br />I wonder if some kids aren't being challenged.<br />If I personalize instruction...my your room will be unmanageable.<br />Last spring, I had a student teacher. He was doing well, but one aspect of his instruction...and mine for that matter, that needed work was personalization. While he was busy teaching, I had some downtime and a chance to observe my kids and think. I came up with a method to personalize by combining 2 powerful tech tools...Google Classroom and Edublogs. We employed these 2 tools to offer enrichment to any student who wanted to go deeper in a particular unit.",
            "length": "0",
            "sourceUrl": "https://api.spreaker.com/download/episode/11492733/48_google_classroom_plus_edublogs_equals_epic_enrichment_starring_camden_edwards_emily_kuederle_and_coltrane_matos.mp3"
        },
        {
            "title": "47-6 Incredibly Simple and Powerful Student Incentives",
            "datePublished": "Thu, 16 Mar 2017 09:03:18 +0000",
            "description": "When it comes to the classroom, some students love incentives and competition and some kids hate them. It's been my experience, that incentives motivate many students, but not all. Hence, it's important to offer the right kind of incentives. It's been my mission to include the incentives that are:<br /><br />Fun<br />Low-risk<br />Simple<br />Social in nature<br />Non-academic<br />Engaging<br />Relationship-inducing<br /><br />In this episode, I'll promote 6 such incentives.",
            "length": "0",
            "sourceUrl": "https://api.spreaker.com/download/episode/11387330/47_6_incredibly_simple_and_powerful_student_incentives.mp3"
        },
        {
            "title": "46-Utilize the ENTIRE School Building with this Engaging Scavenger Hunt...Starring Caroline Craig-Bowden and Sandy Smith",
            "datePublished": "Thu, 09 Mar 2017 09:29:56 +0000",
            "description": "As I read through the 20 page assignment on the Industrial Revolution, I kept thinking to myself...\"Wow, this is boring!\" If I was feeling that burn, imagine what my students were going to feel. I decided it was time to break out of the box. In this case, literally break out of the box of the four walls of my classroom. I sent my students on a school-wide scavenger hunt utilizing QR-codes, a hint sheet, and provocative prompts from the reading. This episode will detail this EPIC lesson plan from the vantage point of two of my awesome students. I will also offer advice on how you can create a scavenger hunt at your school.",
            "length": "0",
            "sourceUrl": "https://api.spreaker.com/download/episode/11316305/46_utilize_the_entire_school_building_with_this_engaging_scavenger_hunt_starring_caroline_craig_bowden_and_sandy_smith.mp3"
        },
        {
            "title": "45-How to Bounce Back After a Bad Day in the Classroom",
            "datePublished": "Thu, 02 Mar 2017 10:22:37 +0000",
            "description": "Just because I've authored a couple of books and host a podcast on engagement, does not mean that I don't have challenging days in the classroom. Last Friday was one of those days! The first 3 periods went great. My students were animated and participatory. The last 3 periods were miserable. My kids were lethargic and crabby. They were not the least bit impressed with my lesson. I left home on Friday defeated!<br /><br />Now...I've been teaching a long time. I've learned what to do when I have a miserable day like Friday. I've had plenty such days in my career. In this episode, I'll tell you about my miserable Friday and about 5 coping mechanisms I employ whenever I have a bad day. The good news is that I bounced back on Monday and thoroughly engaged ALL my classes.<br /><br />This episode will help you bounce back too!",
            "length": "0",
            "sourceUrl": "https://api.spreaker.com/download/episode/11177139/45_how_to_bounce_back_after_a_bad_day_in_the_classroom.mp3"
        },
        {
            "title": "44-Stage 27 Student Presentations in 9 Minutes! Starring Kat Brammer and Peter Pohlod",
            "datePublished": "Thu, 23 Feb 2017 09:56:19 +0000",
            "description": "A few years ago, my students matriculated through 2 days of student presentations. IT WAS PAINFUL! I was bored! They were bored! The novelty wore off after about 3 presentations. It wasn't that there weren't some good ones...there were, but many were low energy, filled with endless bullet points, and were rehashing tired topics. Once a student gave their presentation or grasped a concept, they had little incentive to listen to the next gabfest. I vowed I wasn't going to do this to my kids again!",
            "length": "0",
            "sourceUrl": "https://api.spreaker.com/download/episode/11002109/44_27_student_presentations_in_9_minutes_starring_kat_brammer_and_peter_pohlod.mp3"
        },
        {
            "title": "43-3 Totally Original, Easy, Powerful, and Joyful Icebreakers to Randomly Sort Students...Tomorrow",
            "datePublished": "Thu, 16 Feb 2017 10:43:20 +0000",
            "description": "February represents the Dog Days in education. All the freshness of the school year are gone. Spring break is still a long way off and the weather...at least in the great state of Ohio...is nothing to write home about! Sometimes, as you watch your kids march in at the beginning of the period, you feel like you're observing a church congregation full of middle-aged parishioners. Everyone sits in the same pew, shakes hands with the same people, and says pretty much the same things. It's time to shake things up!<br /><br />In today's program, I'm going to give you 3 totally original icebreakers with which you can randomly sort your students. Perhaps, a new seating chart is needed. Or, it's time get kids working with different peers on the next project. These icebreakers will help you rearrange your students socially...BUT THE REAL DRAW...is your students and you will have a blast working through these easy prompts.",
            "length": "0",
            "sourceUrl": "https://api.spreaker.com/download/episode/10757075/43_3_totally_original_easy_powerful_and_joyful_ice_breakers_to_randomly_sort_students_tomorrow.mp3"
        },
        {
            "title": "42-Revolutionize the way your Students Watch Videos...Starring Hannah Fox, Ali Iannucci, Eduardo Lopez, and Tracy Enos",
            "datePublished": "Thu, 09 Feb 2017 11:09:12 +0000",
            "description": "Teachers need to go where the kids are. When in Rome…do like the Romans. When it comes to reaching contemporary youth, please understand that they love video. Whenever there’s downtime, kids immediately start watching video on their devices. Educators need to embrace this tendency.<br /><br />Unfortunately, in many classrooms, video is handled in much the same way as it was in the 1950s. The entire class watches on a big screen at the same time. I loved “Movie Day” in high school. It was a great opportunity to zone out for 50 minutes!<br /><br />In this episode, Tracy Enos and her adolescent posse will clue you in on an amazing free tool which will revolutionize the way you present video. EDpuzzle allows you to embed questions inside a video.",
            "length": "0",
            "sourceUrl": "https://api.spreaker.com/download/episode/10607182/42_revolutionize_the_way_your_students_watch_videos_starring_hannah_fox_ali_iannucci_eduardo_lopez_and_tracy_enos.mp3"
        },
        {
            "title": "41-Feng Shui your Students",
            "datePublished": "Thu, 02 Feb 2017 10:13:52 +0000",
            "description": "Last month...I was chilling in my room 2 days prior to Christmas break. As I surveyed my diggs, I became disgusted with myself! My room was a mess. I had just been enlightening my students about the awesome Asian concept of Chi...an invisible source of energy that permeates the universe. Chi flows through the environment, animals and people, as well as man-made structures. Acupuncture and Tai Chi stimulate the life-giving flow of Chi through a person. The ancient interior decoration practice of Feng Shui can do the same for your home or work-space. I felt like a hypocrite.<br /><br />I decided my room was in desperate need of a Feng Shui makeover! This exercise had great informational power for many parties:<br /><br />I could apply a complex topic from class in a demonstrable way<br /><br />I could become more approachable to my students as they cheered me on in my noble quest. <br /><br />I could also inspire kids to apply Feng Shui to some aspect of their lives.<br /><br />This was an epic exercise in student engagement!",
            "length": "0",
            "sourceUrl": "https://api.spreaker.com/download/episode/10457955/41_feng_shui_your_students.mp3"
        },
        {
            "title": "40-Inspire 100% Participation in Tomorrow’s Class Discussion with Philosophical Chairs...the Stanford History Education Group",
            "datePublished": "Thu, 26 Jan 2017 10:29:35 +0000",
            "description": "I'll wager you'd like to dramatically improve your class discussions! You yearn for discussions where all students participate. You dream about student conversations that tackle compelling topics with DEEP analysis, inquiry, and speculation. I'll also predict you'd love your students to enthusiastically plunge into primary sources evaluating the perspective of the author, contextualizing what they wrote, and then corroborating the source with other primary documents.<br /><br />Last week, my students did exactly this with Lin Zexu's letter to Queen Elizabeth imploring her to end the opium trade in China. It was an epic performance by my students! The instructional template is Philosophical Chairs. What inspired this wonderful class was the Stanford History Education Group. Today, Joel Breakstone, from SHEG, will discuss:<br /><br />-The Stanford History Education Group<br />-Philosophical Chairs<br />-Empowering students to devour primary sources<br />-Inspiring kids to dramatically up their class conversation game",
            "length": "0",
            "sourceUrl": "https://api.spreaker.com/download/episode/10378047/40_inspire_100_participation_in_tomorrow_s_class_discussion_with_philosophical_chairs_joel_breakstone_and_the_stanford_history_education_group.mp3"
        },
        {
            "title": "39-Kristin Kovak Unleashes the Lorax Challenge of Shame",
            "datePublished": "Thu, 19 Jan 2017 10:22:39 +0000",
            "description": "Just yesterday...I was making copies in the Teacher's Lounge when I realized I'd made a mistake and forgot to double-side and staple the set! The practical upshot of this wasteful frenzy was the destruction of innocent paper.<br /><br />Teachers go through reams of paper daily. I must plead guilty to laying waste to forests in my efforts to educate modern youth. Sadly, many of these sheets of decimated vegetation were used by students only temporarily, then discarded often bypassing the recycling bin in route to the landfill. But the tide of history is urging educators to alter their standard operating procedure. It's time to do a \"Paperless Week\".<br /><br />This paperless approach has the potential to engage your students. Sound interesting? I thought so! Give a listen to Kristen Kovak...a paperless guru...the modern Lorax!",
            "length": "0",
            "sourceUrl": "https://api.spreaker.com/download/episode/10328806/39_kristen_kovak_unleashes_the_lorax_challenge_of_shame.mp3"
        },
        {
            "title": "38-Transform your Class into a Daily TED Talk",
            "datePublished": "Thu, 12 Jan 2017 10:43:08 +0000",
            "description": "Educators have an unquenchable thirst to explain. I have this urge. If some students don’t get it, it’s my job to clarify. Unfortunately, this tendency can disengage students who got it the first time.<br /><br />It’s been my observation, both from the standpoint of being a student...and then working with colleagues as an adult, that teachers aren’t the best at weighing the trade-offs of their marathon explanations, presentations, and lectures. Let’s be less windy. Let’s become more attuned to nonverbal cues from our students. When we’ve lost the eyes, when their heads start to droop, when they get fidgety, when they’re unresponsive to prompts, they’re disengaged and we need to adjust. A great template for teacher presentations is the ubiquitous TED Talk.",
            "length": "0",
            "sourceUrl": "https://api.spreaker.com/download/episode/10277512/38_transform_your_class_into_a_daily_ted_talk.mp3"
        },
        {
            "title": "37-Here's the way you do an Epic Class Twitter Chat...Starring Derek Herman",
            "datePublished": "Thu, 05 Jan 2017 10:28:05 +0000",
            "description": "Okay...here's the situation. The semester is winding down and you need to include one more Socratic Seminar on an important topic. But...you look at the calendar and there's no time! Sound familiar? It's a classic necessity is the mother of invention situation.<br />I was faced with just such a scenario one month ago at the conclusion of the previous semester. So...I IMPROVISED! What materialized was awesome and will become a standard activity every semester, till I hang up my spikes! I decided to take my Socratic Seminar virtual and make it a class Twitter chat.",
            "length": "0",
            "sourceUrl": "https://api.spreaker.com/download/episode/10233951/37_here_s_the_way_you_do_an_epic_clas_twitter_chat_with_derek_herman.mp3"
        },
        {
            "title": "36-Students Caroline Gose and Simon Srisongkham Explain how to Build Student Allegiance",
            "datePublished": "Thu, 22 Dec 2016 11:18:54 +0000",
            "description": "When your students are asked to describe themselves....wouldn’t it be cool if they replied, “I’m a proud member of Mr. Sturtevant’s class!” Two awesome students Caroline Gose and Simon Srisongkham are going to explain why this is important and how you might create such a dynamic.",
            "length": "0",
            "sourceUrl": "https://api.spreaker.com/download/episode/10147966/36_students_caroline_gose_and_simon_srisongkham_explain_how_to_build_student_allegiance.mp3"
        },
        {
            "title": "35-Connie Hamilton and Starr Sackstein Urge you to Rethink Homework",
            "datePublished": "Thu, 15 Dec 2016 13:35:03 +0000",
            "description": "There are so many things in education that we do simply because they've always been done...and done a certain way. Take the school calendar. We follow an antiquated model that was crafted to serve our agrarian society in the late 19th Century. But most are accustomed to the typical school calendar regardless of whether it makes sense educationally. The same could be said of homework. Teachers, parents, and administrators must reevaluate the entire homework paradigm. Students are also a crucial voice! It's time to evolve! Connie Hamilton and Starr Sackstein are here to help. On today's episode, they'll talk about their new book \"Hacking Homework\".",
            "length": "0",
            "sourceUrl": "https://api.spreaker.com/download/episode/10111679/35_connie_hamilton_and_starr_sackstein_urge_you_to_rethink_homework.mp3"
        },
        {
            "title": "34-Abigail Myers and Mason Wright are Two Students Urging You to Include Squats and Pushups in your Curriculum",
            "datePublished": "Thu, 08 Dec 2016 15:11:13 +0000",
            "description": "In 2014, my book You've Gotta Connect, which gives teachers tools to forge strong relationships with students, was published. I promote that teachers be approachable and then inject some enjoyment into their courses. This hack will succeed on both counts!<br /><br />On a recent commute to school, I came up with the hairbrained scheme of pulling my students into one of my ridiculous weekend body weight workout challenges. In order that we could all keep tabs on one another, we utilized Voxer...the 21st Century walkie-talkie.<br /><br />This program will tell the story of this AMAZING classroom adventure through the stories of two remarkable high school seniors...Abigail Myers and Mason Wright. Please give a listen and give a weekend challenge, of some sort of activity it certainly doesn't have to be physical, a try.",
            "length": "0",
            "sourceUrl": "https://api.spreaker.com/download/episode/10036215/34_abigail_myers_and_mason_wright_are_two_students_urging_you_to_include_squats_and_pushups_in_your_curriculum.mp3"
        },
        {
            "title": "33-Noah Heath Prescribes Art as an Antidote for Test Anxiety",
            "datePublished": "Thu, 01 Dec 2016 19:00:02 +0000",
            "description": "I recently walked into Noah Heath's room. Noah teaches Psychology. I noticed some interesting art work on the wall. I asked about it. The next 10 minutes simply evaporated as Noah described his recent assessment experiment, “I have a lot of students who are uncomfortable with traditional tests. I wanted to give these kids an option. I let them opt to use art to demonstrate mastery of altered states of consciousness. They were to compare chemically altered consciousness (through drugs) and non-chemically altered consciousness (through hypnosis, meditation, and biofeedback). Traditionally, I give students an essay asking them to compare and contrast. Students who participated in my experiment still had to include a writing component, but it was to explain their artwork. Their creation did the job of comparing and contrasting!”",
            "length": "0",
            "sourceUrl": "https://api.spreaker.com/download/episode/10008694/33_noah_heath_prescribes_art_as_an_antidote_for_test_anxiety.mp3"
        },
        {
            "title": "32-Samantha Bickley and Grace Hofer are Two 16-year-olds that Will Set you Straight about Group Work",
            "datePublished": "Tue, 22 Nov 2016 19:01:02 +0000",
            "description": "Teachers often group kids based on learning styles, ability, and skill sets. Such attributes are pretty easily identifiable, but teachers simply must take compatibility into account as well. I teach 9th graders. Freshmen are spastic and dramatic. If you place the wrong 15-year-olds together, the impact can be pandemic! Also, nothing frosts a motivated 15-years-old’s gourd faster than having to do all the group’s work to cover for slacker colleagues.<br /><br />So...perhaps it's time to listen to two brilliant young people riff about their experiences working in groups. Samantha Bickley and Grace Hofer were in my class last year. Now they're sophomores and I miss them every day. You're going to love their humor, their spirit, and their wisdom about group dynamics!",
            "length": "0",
            "sourceUrl": "https://api.spreaker.com/download/episode/9941874/32_samantha_bickley_and_grace_hofer_are_two_16_year_olds_that_will_set_you_straight_about_group_work.mp3"
        },
        {
            "title": "31-Science Teacher Ryan Mocarski Takes Self-Directed Learning to a Whole New Level",
            "datePublished": "Thu, 17 Nov 2016 14:21:49 +0000",
            "description": "Ryan Mocarski has taught 8th-grade science for 8 years. His 2013 book the \"Mocarski Model\" demonstrates how to create a PBL-centered classroom that's paperless. He believes that if you create a positive classroom environment, all students are able to become academically and socially successful.<br /><br />That sounds like a pretty standard prescription...but his tactics are ground-breaking! Listen to this fascinating young teacher who fearlessly allows kids to DO NOTHING at times in his room! He also wears a suit and tie everyday!",
            "length": "0",
            "sourceUrl": "https://api.spreaker.com/download/episode/9888356/31_science_teacher_ryan_mocarski_takes_self_directed_learning_to_a_whole_new_level.mp3"
        },
        {
            "title": "30-Do Your Students Know how YOU Voted?",
            "datePublished": "Thu, 10 Nov 2016 18:28:58 +0000",
            "description": "Contentious national and state elections are tricky. Students want to know how their teachers vote. But one sure fire way to alienate portions of your class is to be too blustery about your opinions.  Instead, embrace elections as a fantastic opportunity to engage students as they try to guess where you stand.",
            "length": "0",
            "sourceUrl": "https://api.spreaker.com/download/episode/9837518/30_do_your_students_know_how_you_voted.mp3"
        },
        {
            "title": "29-Turn your Students into 5-Year-Olds",
            "datePublished": "Thu, 03 Nov 2016 19:30:17 +0000",
            "description": "When you were 5-years-old and your mamma wanted a little break from the awesome responsibility of raising you, she’d give you some paper and crayons, and for the next 30 minutes, you were blissfully and silently...in the engagement zone. Across the top of the paper, you drew a blue band which represented the sky. A green band at the bottom was grass. In between in a vast white void, was perhaps your house, your dog, a tree, the sun, and a smiling stick figure you. In all honesty, from an artistic standpoint, your drawing sucked, but you didn’t care. You were totally immersed in what you were doing. When you presented it to her, your mom probably marveled at your masterpiece, but you would have been just fine without all her false praise. The truth is, you loved the creative process.",
            "length": "0",
            "sourceUrl": "https://api.spreaker.com/download/episode/9784066/29_turn_your_students_into_5_year_olds.mp3"
        },
        {
            "title": "28-Charlie Rowley Encourages Teachers to let Their Freak Flag Fly",
            "datePublished": "Thu, 27 Oct 2016 18:39:32 +0000",
            "description": "A few years back, Charlie Rowley became my student teacher. Charlie is a really good looking dude. He’s friendly, calm, and to top it off, he was a college football player. Many of my kids were immediately drawn to Charlie, but there was a handful who were totally closed down and not ready to give him a chance. It was like they were thinking, Oh great...another jock Social Studies teacher! I pulled Charlie aside and explained this delicate social dynamic. Charlie didn’t hesitate, “Okay...let’s see if I can win them over. This sounds like fun.” He’s a great guy.<br /><br />Over the next few weeks, Charlie shelved his ego and worked hard to engage his reluctant contingent. It was working. They started warming up to him. And then one day, one of Charlie’s emerging converts made an amazing observation. Listen to this episode to learn how a simple observation from a student revolutionized Charlie's ability to engage his students!",
            "length": "0",
            "sourceUrl": "https://api.spreaker.com/download/episode/9722029/28_charlie_rowley_encourages_teachers_to_let_their_freak_flag_fly.mp3"
        },
        {
            "title": "27-Dorali Arambula...a Beautiful Young Dreamer on More Inclusive Schools",
            "datePublished": "Thu, 20 Oct 2016 16:53:46 +0000",
            "description": "Dorali Arambula is senior at Westerville North High School in suburban Columbus, Ohio. Dorali was born in Mexico, but she moved to the United States at age 2. America is her home. She has no recollection of Mexico.<br /><br />Dorali was in my class 2 years ago. At the end of that school year, her family moved down the road to a neighboring school. As you'll learn in the episode, It was not the first time she'd moved schools. Sit back and listen to her fascinating life journey. Sometimes she's felt welcomed and valued, other times not.<br /><br />With the brutal political rhetoric we've all experienced during this election season, it's so wonderful to hear her uplifting voice! We all have a lot to learn from this beautiful dreamer!",
            "length": "0",
            "sourceUrl": "https://api.spreaker.com/download/episode/9668899/27_dorali_arambula_a_beautiful_young_dreamer_on_more_inclusive_schools.mp3"
        },
        {
            "title": "26-Amanda Reynolds and Channeling Your Inner Yoga Teacher",
            "datePublished": "Thu, 13 Oct 2016 17:21:43 +0000",
            "description": "You might be muttering, “I don’t have an inner yoga teacher.” But please consider Amanda Reynolds’ words before submitting that verdict. She’s an amazing yoga instructor. I know because I’ve taken a lot of her classes. She’s compassionate, gentle, and encouraging. She empowers stiff students to open. If you interact with Amanda outside of the studio, however, you’ll be struck by her intense Ayurvedic Pita nature. She’s enthusiastic, active, focused, and competitive. She kids me that I’m a pita too. Guilty! Amanda’s story is relevant because her daytime job is to teach high school English. She uses her yoga background to channel, and at times mask, her intensity, build relationships, and engage students,",
            "length": "0",
            "sourceUrl": "https://api.spreaker.com/download/episode/9618133/26_amanda_reynolds_and_channeling_your_inner_yoga_teacher.mp3"
        },
        {
            "title": "25-The Celebrity Couple Nickname Game",
            "datePublished": "Thu, 06 Oct 2016 18:20:23 +0000",
            "description": "Staring...Trevor Ambrose, Jack Belcher, Liz Bender, Mikayla Colvin, Alejandrina Hernandez, Christopher Ward<br />The semester just started and you have 150 names to remember...and you must do it fast! Students feel marginalized when you can't remember their names:<br /><br />I’m insignificant<br />Mr. S doesn’t notice me<br />I’m not important<br />Mr. S doesn’t like me<br />I’m invisible<br />Mr. S knows other student’s names. He must like them better<br />A number of years ago, for some odd reason, Brad Pitt and Angelina Jolie came up in class. I referred to them reflexively as Brangelina. I was struck by how every kid knew exactly whom I was referring to. Hmmmm! Perhaps, I thought, I could do the same thing with a student's first and last names. This was the birth of the Celebrity Couple Nickname Game. It has:<br /><br />Been a fun bonding tool<br />Allowed me to remember student names<br />Created powerful allegiance to my class<br />Ten days into class, you don’t want to be saying, “Hey…you in the brown shirt, what’s the answer to #10?”<br /><br />Listen to these incredible student voices promote the power of this technique!",
            "length": "0",
            "sourceUrl": "https://api.spreaker.com/download/episode/9578406/25_the_celebrity_couple_nickname_game_staring_trevor_ambrose_jack_belcher_liz_bender_mikayla_colvin_alejandrina_hernandez_christopher_ward.mp3"
        },
        {
            "title": "24-Hacking Engagement the Book Launch",
            "datePublished": "Thu, 06 Oct 2016 17:52:15 +0000",
            "description": "Please check out my book on Amazon...or, go to this direct link hackingengagement.com",
            "length": "0",
            "sourceUrl": "https://api.spreaker.com/download/episode/9562435/24_hacking_engagement_the_book_launch.mp3"
        },
        {
            "title": "23-Engage the Enraged...here's what you do with those Kids that Keep you Up at Night",
            "datePublished": "Thu, 29 Sep 2016 19:46:57 +0000",
            "description": "Enduring a meal with an obnoxious co-worker, relative, or acquaintance is painful...but it’s just one meal. Imagine an adolescent version of this person striding into your class. Now, you’re confronted with the daily drudgery of interacting with a very biased kid who's quick to profess his bizarre theories. Most importantly, his captive audience...the remainder of your students, will be subjected to his monologues too.<br /><br />But your new student isn’t your crazy uncle. You simply MUST engage him. That’s your job. This obligation may seem distasteful, but flip your paradigm and embrace this as an amazing learning opportunity. This difficult student will be your teacher. He’ll expose your biases, your triggers, your limited perspectives. He’ll engage your empathy, your objectivity, and your fair-mindedness.",
            "length": "0",
            "sourceUrl": "https://api.spreaker.com/download/episode/9486256/23_engage_the_enraged_here_s_what_you_do_with_those_kids_that_keep_you_up_at_night.mp3"
        },
        {
            "title": "22-Michaella Young is your Socratic Circle Customer Support Rep",
            "datePublished": "Wed, 21 Sep 2016 09:13:15 +0000",
            "description": "Socrates understood formative assessment 2500 years ago. His student would make an assertion and then the Great One would start probing. Much like an annoying 3-year-old, he’d keep asking questions and then follow ups. Socrates’ good natured interrogations would cause students to bob and weave…refine and alter. Eventually, the young Athenian would strike bedrock. In the process of finding that firm foundation, this ancient adolescent would demonstrate a solid and evolving understanding of the concept. They still may disagree with classmates and Socrates for that matter, but those disagreements would be based on reason.<br /><br />Unfortunately, when it comes to complex ideas in modern classrooms, many students keep a low profile, totally disengaged, profoundly intimidated. In order to bring such students out of the weeds and into the intellectual light of day, copy the Great One and conduct a Socratic Circle.",
            "length": "0",
            "sourceUrl": "https://api.spreaker.com/download/episode/9446571/22_michaella_young_is_your_socratic_circle_customer_support_rep.mp3"
        },
        {
            "title": "21-Brian Sztabnik Tempers the Template to Unleash Expression",
            "datePublished": "Thu, 15 Sep 2016 19:10:40 +0000",
            "description": "I have to confess, I love it when I’m supplied a template. My editor imposed a template on me for Hacking Engagement. I'd have been lost without it. K-12 education seems a lot like a huge rigid template. In fact, schools are darned similar to standardized mass production facilities. And therein lies the problem. While templates provide direction and form, they’re incredibly restrictive.<br /><br />Brian Sztabnik believes that creativity, student discovery, and self-directed learning can be stifled by over-reliance on templates. He urges teachers to take a courageous step and remove the training wheels.",
            "length": "0",
            "sourceUrl": "https://api.spreaker.com/download/episode/9386305/21_brian_sztabnik_tempers_the_teplate_to_unleash_expression.mp3"
        },
        {
            "title": "20-Gretchen Schultek Bridgers Navigates the Ebb and Flow of Student Engagement for the Entire 50 Minutes Class Period",
            "datePublished": "Thu, 08 Sep 2016 17:15:24 +0000",
            "description": "50 minutes is a long time. When's the last time you were engaged for 50 solid minutes? Interestingly enough...we expect our kids to be engaged for a solid 50 minutes every day. We need to plan for student engagement just like we plan for covering the learning target. To help us in this noble quest is educator, author, podcaster, wife, and mother Gretchen Schultek Bridgers.",
            "length": "0",
            "sourceUrl": "https://api.spreaker.com/download/episode/9348344/20_gretchen_schultek_bridgers_navigates_the_ebb_and_flow_of_student_engagement_for_the_entire_50_minutes_class_period.mp3"
        },
        {
            "title": "19-Kylie Stickrath...A Student Voice Urging You to FLIP your Presentations",
            "datePublished": "Thu, 01 Sep 2016 18:42:01 +0000",
            "description": "I was a history major in college. I was thoroughly invested in my discipline. But even me, a history geek, struggled during marathon lectures. And you should’ve seen my classmates. It was often a massacre. I remember thinking, This is a darned passive way to learn. I could read what he’s saying in a book. I felt like a prisoner with no control. And remember, I was a guy who loved history.<br /><br />This is relevant because I teach dual enrollment history to high school juniors and seniors. Dual enrollment is a college course brought to the high school campus. A few years ago, my principal asked me to teach such a course. The sponsoring college made clear their expectation that lecture would be a big part of the class. I was initially reluctant because I remembered my comatose classmates back in college. I didn’t want to do that to my kids.  <br /><br />Regardless of my hesitancy, I signed on. My challenge was to make lectures engaging. I certainly wasn’t going to stand in front of them and drone on. I decided to try something new.<br /><br />Kylie Stickrath is one of those awesome student voices (primary sources) that's going to urge you to give flipped presentations a try! Kylie was skeptical about flipped presentations. Once she experienced a good one...she became a full-fledged convert! Listen and see if she can convert you!",
            "length": "0",
            "sourceUrl": "https://api.spreaker.com/download/episode/9278356/19_kylie_stickrath_a_student_voice_urging_you_to_flip_your_presentations.mp3"
        },
        {
            "title": "18-Lynne Sturtevant and  the Great War on Yoga Pants (Don't get Buried Under an Avalanche of Spandex)",
            "datePublished": "Thu, 25 Aug 2016 18:20:42 +0000",
            "description": "A few years ago, our administration got all exercised over the yoga pants epidemic. I watched the battle unfold instead of participating in the combat. It was fascinating. The conservative forces of the status quo lost big-time! They got buried under an avalanche of spandex.<br /><br />If you listen to this episode and think, \"Well, if we put those kids in uniforms that problem will be solved\"...you're missing the larger point. Whether or not girls wear yoga pants to school is merely a manifestation of a larger phenomenon. When teachers battle against powerful social trends, they risk becoming irrelevant",
            "length": "0",
            "sourceUrl": "https://api.spreaker.com/download/episode/9229775/18_lynne_sturtevant_and_the_great_war_on_yoga_pants_don_t_get_buried_under_an_avalanche_of_spandex.mp3"
        },
        {
            "title": "17-Debbie Olsen HOOKS Reluctant Readers with Voxer",
            "datePublished": "Thu, 18 Aug 2016 17:20:10 +0000",
            "description": "When I was in 3rd grade, the last thing in the world I wanted to do was read a book. Debbie Olsen, an inclusion teacher from Long Island, New York, certainly recognizes this attitude. So, she decided to use Voxer, the 21st Century Walkie Talkie, to get 9-year-old boys excited about reading! Listen to this episode and you'll be hooked on Voxer's potential to engage your reluctant readers!",
            "length": "0",
            "sourceUrl": "https://api.spreaker.com/download/episode/9172081/17_debbie_olsen_hooks_reluctant_readers_with_voxer.mp3"
        },
        {
            "title": "16-Penny Sturtevant and Strategic Questioning",
            "datePublished": "Thu, 11 Aug 2016 19:10:02 +0000",
            "description": "For the past 30 years, Penny Sturtevant has been a science teacher, a guidance counselor, an assistant principal, a principal, and next year, she’ll work at the district level. Oh...she’s also my wife. Penny has observed her share of lessons. When I asked her about student engagement, she responded immediately, “QUESTIONS.” Quite simply, Penny believes that questioning students is an essential art that can be mastered with practice. In 500 BCE, asking students strategic questions was the foundation of Socrates' instruction. His pedagogy has been celebrated for 2500 years. Penny will help you harness this timeless and powerful educational tactic, not only to engage, but also to foster deep understanding!",
            "length": "0",
            "sourceUrl": "https://api.spreaker.com/download/episode/9132599/16_penny_sturtevant_and_strategic_questioning.mp3"
        },
        {
            "title": "15-Tracy Enos Puts Kids in the Driver's Seat with her Magic Wand",
            "datePublished": "Thu, 04 Aug 2016 19:50:45 +0000",
            "description": "I've always been intimidated by student-directed learning. I hate to admit it, but I'm a bit of a control freak and I worry about classroom anarchy! That's my gut's hesitancy. My head knows that it's a wonderful way for kids to learn and it's highly engaging.<br /><br />If you, like me, are hesitant about student-led learning...I've got a guest that'll help us get over the hump! Tracy Enos is a middle school teacher from Rhode Island. She's ALL about putting students in the driver’s seat! Listen to her impassioned message and then climb in the backseat and fasten your seatbelt.",
            "length": "0",
            "sourceUrl": "https://api.spreaker.com/download/episode/9097414/15_tracy_enos_puts_kids_in_the_driver_s_seat_with_her_magic_wand.mp3"
        },
        {
            "title": "14-Bonus Episode Mark Barnes' Challenging Formative Years in Urban Cleveland",
            "datePublished": "Sun, 31 Jul 2016 17:31:50 +0000",
            "description": "Mark Barnes is familiar to a lot of listeners. He's the founder of the and guiding force behind the increasingly popular and influential Hack Learning brand. But what you might not realize, is that Mark's academic formative years were purely Dickensian. Mark attended the Cleveland Public Schools at a time when the district had a reputation as one of the nation's worst! Mark jokes that he first learned to \"Hack Learning\" when he ditched school some 50 times his senior year. He often traveled to school with an intense feeling of trepidation.<br /><br />From this unlikely, but highly relevant background, Mark has emerged as an international voice for rethinking everything about how kids are taught. Listen to this episode where he talks about his formative years, he elaborates on his successes and failures as a teacher, his launching of the wildly successful Hack Learning platform, and his decision to approach little ole me about writing Hacking Engagement: 50 Tips & Tools To Engage Teachers and Learners Daily, which will be available Septemberish!",
            "length": "0",
            "sourceUrl": "https://api.spreaker.com/download/episode/9096879/14_bonus_episode_mark_barnes_challenging_formative_years_in_urban_cleveland.mp3"
        },
        {
            "title": "13-Nurturing Belonging with Todd Finley",
            "datePublished": "Thu, 28 Jul 2016 20:00:13 +0000",
            "description": "It’s wonderful to have a sense of belonging. When you ask students about their group allegiances, they’ll typically say things like:<br /><br />I’m a follower of a certain religion<br />I’m a member of this family<br />I’m an American<br />I’m an Ohioan<br />I’m a member of a political party<br />I’m a Cleveland Cavs fan<br />I’m a member of the softball team<br />I’m a certain gender<br />I’m a fan of a certain type of music<br />I have a certain sexual identity<br />I’m a fan of the television show Parks and Rec<br />I’m a member of Generation Z<br />Wouldn’t it be cool if students also proclaimed, “I’m a proud member of Mr. Sturtevant’s class!”<br /><br />Dr. Todd Finley of East Carolina has thoroughly researched class identity. In this episode, we’ll discuss why such identity is important and what can be done to foster belonging.",
            "length": "0",
            "sourceUrl": "https://api.spreaker.com/download/episode/9057165/ep13.mp3"
        },
        {
            "title": "12-Assess your Assessments with the Garden State Guru...Michael Dunlea",
            "datePublished": "Thu, 21 Jul 2016 21:56:06 +0000",
            "description": "Picture this, you’re having a medical procedure done. Before they put you under, you tell the doctor, “I want you to perform this procedure from memory. You’re absolutely not permitted to use any resources. You may not look at your phone, consult the internet, and you’re especially not allowed to ask other doctors for help. If you don’t complete the procedure within an hour, you must put down your instruments and exit the operating room!”<br /><br />It would be hard to imagine many patients surviving such a setup. And yet, that’s pretty much what teachers do to kids daily. No wonder many students suffer from test anxiety. Michael Dunlea will challenge conventional thinking when it comes to assessment.",
            "length": "0",
            "sourceUrl": "https://api.spreaker.com/download/episode/9000688/ep_12_assess_your_assessments_with_the_garden_state_guru_michael_dunlea.mp3"
        },
        {
            "title": "11-Olivia Wince and Kathy Wince Explain how to use French Toast to Engage Students",
            "datePublished": "Thu, 14 Jul 2016 22:00:31 +0000",
            "description": "Picture this...you're enjoying a hot cup of Joe on your back patio on a brilliant and crisp April Saturday morning. After a few sips and deep breathes, you check your phone and notice that you'd been mentioned in a tweet. You probably should just put your phone away and continue to bask in the sunshine and the coffee, but curiosity gets the best of you. You follow the signal to Twitter and are ushered into one of the most satisfying experiences of your career! A mom is congratulating you on your lesson prompt enticing students to eat mindfully. Intrigued? I hope so! Please give a listen!",
            "length": "0",
            "sourceUrl": "https://api.spreaker.com/download/episode/8955197/james_sturtevant_ep_11_olivia_wince_and_kathy_wince_explain_how_to_use_french_toast_to_engage_students.mp3"
        },
        {
            "title": "10-Present to Students Like a Zen Master",
            "datePublished": "Thu, 07 Jul 2016 21:24:51 +0000",
            "description": "Presenting to kids in the 21st Century ain't easy! It's hard to engage them...then maintain their interest. When I presented in the past, I was always hypersensitive about my student's engagement level. I'd worry...Did I lose him? Is she listening? He looks like he's nodding off! How can I cover what I need to in the next 5 minutes? I consider myself an engaging presenter, but I was struggling! I needed a new way to do things.<br /><br />My fascinating educator Voxer group made a remarkable book recommendation last summer. I was guided toward Presentation Zen by Garr Reynolds. Occasionally, I've run across books that alter my paradigm fundamentally. That was certainly the case with Garr's!<br /><br />Please listen to this episode and learn how I transformed my presentations. Problem solved!",
            "length": "0",
            "sourceUrl": "https://api.spreaker.com/download/episode/8921575/james_sturtevant_ep_10_present_to_students_like_a_zen_master.mp3"
        },
        {
            "title": "9-Jennifer Gonzalez Creates a Family Atmosphere with the Open Mic",
            "datePublished": "Thu, 30 Jun 2016 10:31:38 +0000",
            "description": "When I asked Jennifer about engagement, I figured she’d offer some high-tech contraption or exotic electronic technique. But while she loves those excursions, she’s also all about relationships, “Our students have hidden talents. In my English class, I encouraged kids to perform for their peers. We called it the Open Mic. These were tight and intimate experiences.\" Listen and learn how to create your own Open Mic Experience!",
            "length": "0",
            "sourceUrl": "https://api.spreaker.com/download/episode/8880276/james_sturtevant_ep_9_jennifer_gonzalez_creates_a_family_atmosphere_with_the_open_mic.mp3"
        },
        {
            "title": "8-Take the Preference Pulse of your Students with SurveyMonkey",
            "datePublished": "Tue, 28 Jun 2016 00:55:55 +0000",
            "description": "Trying to determine what another is thinking is one of life’s great challenges. You may have spent the majority of a first date wondering just that! Understanding another’s preferences can save time, effort, and money. So, when it comes to our student’s preferences, let’s become detective-like and solve some mysteries with SurveyMonkey.",
            "length": "0",
            "sourceUrl": "https://api.spreaker.com/download/episode/8859585/james_sturtevant_ep_8_take_the_preference_pulse_of_your_students_with_surveymonkey.mp3"
        },
        {
            "title": "7-Sara Sawdey Unleashes the Vowel Squad for Peerless Peer Teaching",
            "datePublished": "Sat, 25 Jun 2016 01:14:40 +0000",
            "description": "Sara Sawdey has a knack for engaging 6-year-old boys who instead of sitting in class learning to read and write, would rather be in the gym playing dodgeball. Sara took some of these squirmy guys and transformed them into the Vowel Squad. The Vowel Squad then embarked on a journey of deep understanding and peer teaching!",
            "length": "0",
            "sourceUrl": "https://api.spreaker.com/download/episode/8848288/ep_7_sara_sawdey_unleashes_the_vowel_squad_for_peerless_peer_teaching.mp3"
        },
        {
            "title": "6-Let Me See You Google",
            "datePublished": "Sat, 25 Jun 2016 00:56:04 +0000",
            "description": "Google is the way people in the 21st Century collaborate. Are you using this tool in your classroom? If not, you’re missing a golden engagement opportunity. In this episode, We’ll explore how to introduce Google into your classroom even if you don’t teach at a Google school!",
            "length": "0",
            "sourceUrl": "https://api.spreaker.com/download/episode/8848159/ep_6_let_me_see_you_google.mp3"
        },
        {
            "title": "5-Jen Wilson...the Quick Response Woman...Engages Reluctant Readers",
            "datePublished": "Sat, 25 Jun 2016 00:43:40 +0000",
            "description": "Jen Wilson is the “Quick Response Woman”. She advocates engaging reluctant readers with QR codes. Give a listen and learn how to use QR codes, in every grade and in every subject, to engage learners!",
            "length": "0",
            "sourceUrl": "https://api.spreaker.com/download/episode/8848072/ep_5_jen_wilson_the_quick_response_woman_engages_reluctant_readers.mp3"
        },
        {
            "title": "4-Reverse Engineer Bonding with Students",
            "datePublished": "Sat, 25 Jun 2016 00:30:53 +0000",
            "description": "Teachers are often lectured, “Get to know your students!” That’s not easy to do. A lot of kids can be pretty closed down and if you try to get to know them before they’re ready…it can be counter productive. This episode offers a different approach to bonding with students. Try reverse engineering these relationships!",
            "length": "0",
            "sourceUrl": "https://api.spreaker.com/download/episode/8848022/ep_4_reverse_engineer_bonding_with_students.mp3"
        },
        {
            "title": "3-Andy Jados Adventures in Classroom Management",
            "datePublished": "Sat, 25 Jun 2016 00:19:01 +0000",
            "description": "Andy Jados is a high school principal who’s not afraid to admit that he struggled with classroom management as a teacher. Listen to his fascinating story about how he turned his class around…and how he now helps struggling teachers transform their classrooms!",
            "length": "0",
            "sourceUrl": "https://api.spreaker.com/download/episode/8847958/ep_3_andy_jados_adventures_in_classroom_management.mp3"
        },
        {
            "title": "2-Blogging...21st Century Journaling",
            "datePublished": "Fri, 24 Jun 2016 23:32:54 +0000",
            "description": "Student journaling is in desperate need of a 21st Century public relations face-lift! Listen to this episode to learn how to deeply engage students through blogging. This is blogging at a whole new level, not just…”Tell me your feelings about this topic!”",
            "length": "0",
            "sourceUrl": "https://api.spreaker.com/download/episode/8847693/ep_2_blogging_21st_century_journaling.mp3"
        },
        {
            "title": "1-Classroom Procedures Night at the Improv",
            "datePublished": "Fri, 24 Jun 2016 23:06:29 +0000",
            "description": "In this episode, I’ll inspire you to shelve the word “rules” and christen the word “procedure”. I’ll also promote the engagement potential of “Opening Night”…the first day of school. The heart of this episode, however, is the concept of introducing class procedures through student improvs! Give a listen and change the way you look at the first day of school!",
            "length": "0",
            "sourceUrl": "https://api.spreaker.com/download/episode/8847553/ep_1_classroom_procedures_night_at_the_improv.mp3"
        },
        {
            "title": "0-Hello Colleague Hacking Engagement",
            "datePublished": "Fri, 24 Jun 2016 22:42:32 +0000",
            "description": "This podcast was inspired by my book “Hacking Engagement…”50 Tips and Tools to Engage Teachers and Learners Daily”, which will be available in the late summer of 2016. In this episode, I’ll describe a typical listener who would enjoy and benefit from this program, I’ll provide the episode template, and I’ll introduce myself.",
            "length": "0",
            "sourceUrl": "https://api.spreaker.com/download/episode/8847398/ep_0_hello_colleague_hacking_engagement.mp3"
        }
    ]
}