{
    "artwork": "http://is1.mzstatic.com/image/thumb/Music71/v4/75/75/bd/7575bd13-2804-19da-02f8-7086c318c083/source/100x100bb.jpg",
    "description": "Ever wonder how technology has transformed your life? In this entertaining and informative podcast, Kim Komando provides insight on the ever-changing tech issues and topics that are relevant to you. This free podcast featuring interviews that Kim conducts with experts in their field. You'll gain an in-depth understanding of a wide variety of topics such as the Dark Web, the life of digital nomads, staying focused on the road, what it takes to keep the lights on and so much more.\nSubscribe below to receive the podcast automatically, download to your computer or media player, or listen directly from this podcast page.",
    "feedURL": "http://feeds.podtrac.com/qjDxovCnSaSq",
    "podcastURL": "http://www.komando.com",
    "title": "Komando On Demand",
    "episodes": [
        {
            "title": "Tech after death: Startups breathing new life into the funeral industry",
            "datePublished": "Tue, 10 Nov 2020 11:00:00 -0000",
            "description": "People say there are only two certainties: death and taxes. But another thing is also certain: technological advancement. In this fascinating, thoughtful and surprisingly funny podcast, Kim explores the deathcare industry, where tech startups are shaking up the funeral profession. Cutting-edge technology is changing the way we’re buried, and creative professionals are bringing more innovation than we’ve seen in centuries.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/chtbl.com/track/28E15G/traffic.megaphone.fm/WSMM7817685661.mp3?updated=1604967405"
        },
        {
            "title": "Tech Refresh: Debt collectors in your DMs, faulty AirPods, scam of the week",
            "datePublished": "Fri, 06 Nov 2020 11:00:00 -0000",
            "description": "This week, Allie, Ben, Cassidy and Mike talk Amazon's potential plans to take over rural delivery, new ways debt collectors can harass consumers and a get-rich-quick scheme spreading through a popular app. Plus, the crew reveals the new most-popular video on YouTube and debates a 24-hour break from tech. Spoiler: It's not going to happen.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/chtbl.com/track/28E15G/traffic.megaphone.fm/WSMM1265839982.mp3"
        },
        {
            "title": "Virtual concerts: How livestream acts are taking over the internet",
            "datePublished": "Tue, 03 Nov 2020 11:00:00 -0000",
            "description": "There really is nothing like a concert. The feeling of the music, the energy, the sound. Then the pandemic hit. Musicians are taking their acts digital, and you're probably wondering what all the hype is about. We brought in Stephen White, CEO of StageIt, a web-based venue that hosts live shows via webcam. By the end of this episode, you’ll be able to brag that you know everything about virtual concerts and how to make the most out of them. ",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/chtbl.com/track/28E15G/traffic.megaphone.fm/WSMM2720129263.mp3"
        },
        {
            "title": "Introducing our brand-new podcast, Tech Refresh",
            "datePublished": "Fri, 30 Oct 2020 10:00:00 -0000",
            "description": "Your mission, should you choose to accept it, is to check out this episode of our brand new podcast, Tech Refresh. The talented team at Komando.com dives into the week in tech news and all things digital. Plus, an old favorite is back: Brand New or Not True! See if the crew can stump Mike with a mighty convincing fake tech product. Check it out, and let us know what you think at podcasts@komando.com.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/chtbl.com/track/28E15G/traffic.megaphone.fm/WSMM5825691226.mp3"
        },
        {
            "title": "Best 5 shows you haven't streamed yet",
            "datePublished": "Tue, 27 Oct 2020 11:00:00 -0000",
            "description": "We’ve got more time to watch TV than ever before. That means you might have already blown through your “Must Watch” list. Or maybe you just finished an amazing show and you’re looking to rekindle that spark. Either way, this episode is perfect for anyone wondering what to watch next. Kim sits down with an entertainment expert and tells you just what to watch based on your favorites. You don’t want to miss this!",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/chtbl.com/track/28E15G/traffic.megaphone.fm/WSMM1145644890.mp3"
        },
        {
            "title": "Black Friday 2020: Deals happening right now",
            "datePublished": "Fri, 23 Oct 2020 10:00:00 -0000",
            "description": "Welcome to Christmas in October. In years past, prices usually didn’t hit bottom until Thanksgiving, Black Friday or Cyber Monday. This year, however, retailers are jumping the gun on holiday sales and offering low price guarantees throughout the season. I have a ton of questions about Black Friday and when we should buy what. How can you make sure you get the lowest price? What are some deals to be on the lookout for? That's why I brought in Kristen McGrath, Editor of BlackFriday.com. She’s our go-to gal every year this time of year, and we're bringing you the inside scoop.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/chtbl.com/track/28E15G/traffic.megaphone.fm/WSMM5853989599.mp3"
        },
        {
            "title": "Bonus episode: Full hour of The Kim Komando Show",
            "datePublished": "Mon, 19 Oct 2020 23:05:00 -0000",
            "description": "This week's exclusive episode of Komando On Demand is a full hour of The Kim Komando Show, airing on more than 400 stations across the U.S. Listen on your schedule on the Komando Community. Try it free for 30 days with code at getkim.com. Coming up, while some argue our internet freedoms are under attack in America, it’s nothing compared to what’s happening in other countries since the pandemic began. Plus, there’s a new customer service scam you need to know about before it drains your bank account. And if you’re tired of those non-stop Zoom meetings, you’re not alone. All that and so much more!",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/chtbl.com/track/28E15G/traffic.megaphone.fm/WSMM1828805326.mp3?updated=1603147898"
        },
        {
            "title": "The truth about streaming: What you need to know about Netflix, Hulu and all the rest",
            "datePublished": "Fri, 16 Oct 2020 10:00:00 -0000",
            "description": "We’ve come a long way from the days of mail-in Netflix subscriptions and Blockbuster rentals. Today there are so many streaming services to choose from. You probably subscribe to a few, but have you thought about what those services know about you? With anything tech-related, you have to follow the money. Kim talks with Dan Rayburn, streaming expert and Chairman of the NAB Show Streaming Summit, to take you behind the scenes. This is a conversation that may make you rethink some of your subscriptions.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/chtbl.com/track/28E15G/traffic.megaphone.fm/WSMM3285258162.mp3"
        },
        {
            "title": "Self-driving cars: Are they safe? Is the tech worth the price?",
            "datePublished": "Tue, 13 Oct 2020 15:20:07 -0000",
            "description": "Self-driving cars aren’t some crazy future tech … They’re here now. That raises some questions. Does it actually work? Is it safe? Is it work shelling out $8,000 for Tesla’s “full self-driving” option? To find out, Kim sat down with Consumer Report’s Head of Connected and Automated Vehicle Testing. So hop in and buckle up — we’re diving into the incredible world of automated cars.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/chtbl.com/track/28E15G/traffic.megaphone.fm/WSMM9444456692.mp3"
        },
        {
            "title": "Amazon Prime Day: Strategies to get the best deals and save big money",
            "datePublished": "Thu, 08 Oct 2020 10:00:00 -0000",
            "description": "Amazon Prime Day is in its sixth year, but the 2020 version won't look like years past. The-two day affair kicks off at midnight EST on Tuesday, Oct. 13, and I want to make sure you're prepared to get the most bang for your buck. I brought in shopping expert Kristin McGrath, Editor of BlackFriday.com, to give us the details on what we can expect, offers to hold out for, and the sales to steer clear of. Trust me, you don't want to miss this episode!",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/chtbl.com/track/28E15G/traffic.megaphone.fm/WSMM3897249729.mp3"
        },
        {
            "title": "What if social media and Big Tech paid YOU to use your personal data?",
            "datePublished": "Tue, 06 Oct 2020 10:00:00 -0000",
            "description": "You may think advertising runs the internet, but the big data behind it is where the real profits come from. We're being followed all around the internet and tracked where we go through our phones, watches, tablets, cars, smart speakers and a multitude of other devices. If Big Tech can cash in on our data, why can’t we? Kim talks with author and computer scientist Jaron Lanier — one of the founding fathers of virtual reality — about what it could look like if we truly had control over our info online.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/chtbl.com/track/28E15G/traffic.megaphone.fm/WSMM8348259841.mp3"
        },
        {
            "title": "Election hackers: How secure is the tech we’re using for the next election? Part 2",
            "datePublished": "Fri, 02 Oct 2020 10:00:00 -0000",
            "description": "It’s part 2 of our election episode, and we’re diving even deeper into the 2020 Election’s biggest security threats. We’re talking about ransomware, delays, government hacks and more. Planning to vote this year? You’ve got to listen to this!",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/chtbl.com/track/28E15G/traffic.megaphone.fm/WSMM9418197653.mp3?updated=1601599205"
        },
        {
            "title": "Election hackers: How secure is the tech we’re using for the next election? Part 1",
            "datePublished": "Tue, 29 Sep 2020 10:00:00 -0000",
            "description": "It’s almost time for Americans to vote, and most of us have the same question: Is the tech taking and counting our votes secure? In part one of our Election 2020 deep dive, Kim lays out all the different security threats you have to deal with when you vote. Whether you cast your votes by ballot, voting booth or through a website, you could encounter wannabe election engineers. Luckily, you’ve got Kim Komando on your side. Get all the knowledge you need on how to vote safely.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/chtbl.com/track/28E15G/traffic.megaphone.fm/WSMM7152757873.mp3"
        },
        {
            "title": "Top private investigator shares the dirty secrets about background check websites",
            "datePublished": "Fri, 25 Sep 2020 10:00:00 -0000",
            "description": "You can Google someone or check social media to find out more about them. Eventually, you’ll land on the background check sites. Enter someone’s name and they show you tiny details. Pay a fee and you can get even more info. But what do the pros use to get the intel they need? Kim talks to Rich Robertson, a Certified Legal Investigator who has taken the lead on hundreds of complex criminal and civil cases. Finding any dirt on someone should be an easy task for him. He's got the secrets on the pros use.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/chtbl.com/track/28E15G/traffic.megaphone.fm/WSMM5380991791.mp3"
        },
        {
            "title": "Scam alert! 5 Amazon cons you’ve got to watch out for",
            "datePublished": "Tue, 22 Sep 2020 10:00:00 -0000",
            "description": "With millions of users around the world, Amazon has drawn scammers like moths to flames. There are many different cons that cybercriminals have tailored specifically for Amazon, and they’re complex enough to have stolen millions in cash. That’s why Kim's giving you the low-down on 5 Amazon scams you’ve got to watch out for. With the holiday season right around the corner, this is essential listening for anyone who’s about to start shopping.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/chtbl.com/track/28E15G/traffic.megaphone.fm/WSMM5536289279.mp3"
        },
        {
            "title": "The Social Dilemma shocking insights into how you’re being manipulated",
            "datePublished": "Fri, 18 Sep 2020 10:00:00 -0000",
            "description": "Only two organizations use the term “user,” illegal drugs and Big Tech. If you’re on Facebook, Instagram, Twitter, or another site, you cannot afford to miss this podcast. Algorithms make sure you see only what you want to see and trackers follow you everywhere. Get the inside scoop from Jeff Orlowski, Director of Netflix’s documentary The Social Dilemma.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/chtbl.com/track/28E15G/traffic.megaphone.fm/WSMM2171718151.mp3"
        },
        {
            "title": "Looking for work? Here's where the jobs are - and the skills you need",
            "datePublished": "Tue, 15 Sep 2020 10:00:00 -0000",
            "description": "We're in the middle of a fundamental shift in our workforce. Whether you work for someone else or own your own company, you have to know where we're headed. To do that the right way, you have to let the data speak to you. And to get the facts, Kim tapped into LinkedIn's Principal Economist Dr. Guy Berger. They dive into this changing world to tell you where the jobs are and what you need to know to get one.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/chtbl.com/track/28E15G/traffic.megaphone.fm/WSMM5987371208.mp3"
        },
        {
            "title": "Coping with the pandemic blues with the Silicon Valley therapist",
            "datePublished": "Fri, 11 Sep 2020 10:00:00 -0000",
            "description": "How’d you like to walk around knowing that you’re the guy who made the worst video game in history? A little hard on the ego. Well, Howard Scott Warshaw has definitely bounced back. He and Kim talk about his start at Atari, how he became the therapist for all of Silicon Valley’s movers and shakers, and how to cope with the pandemic. \r\nThis Tech You Should Know podcast is from the archives, but it's definitely one you don’t want to miss.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/chtbl.com/track/28E15G/traffic.megaphone.fm/WSMM1735691762.mp3"
        },
        {
            "title": "Spotting online scams & free tools to fight ransomware",
            "datePublished": "Tue, 08 Sep 2020 10:00:00 -0000",
            "description": "This episode is a special hour of Kim's Tech Insights Show airing on SiriusXM Business Radio. Meet cybercrime hero Michael Gillespie, who fights against ransomware with free tools for victims. Plus, security officer Etay Moar has tips on avoiding pandemic scams, and Steve Ginty, Director of Threat Intelligence for Risk IQ, has the shocking figures behind just how bad things are online right now. You won't believe just how often hackers are trying to break into your tech or attack your business.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/chtbl.com/track/28E15G/traffic.megaphone.fm/WSMM1030129433.mp3"
        },
        {
            "title": "How one woman is raking in $750,000 a year on Instagram",
            "datePublished": "Fri, 04 Sep 2020 10:00:00 -0000",
            "description": "You've seen them online: Life coaches that promise to help you skyrocket your career, get in shape, be a better parent, a better spouse, a better human. But what exactly do they do?We talk to a coach who makes a whopping $750,000 a year helping people break out of their 9-to-5 jobs — and we'll show you how to use your unique skills to do the same.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/chtbl.com/track/28E15G/traffic.megaphone.fm/WSMM3264655377.mp3?updated=1599178419"
        },
        {
            "title": "Things you have laying around worth big money: Part 2",
            "datePublished": "Tue, 01 Sep 2020 10:00:00 -0000",
            "description": "In part 2 of this podcast, Kim dives into the world of sports memorabilia and collectibles. Just how much is that signed baseball card or vintage jersey worth? Collections full of rare or mint items can fetch astounding sums, and you could be sitting on your own gold mine and not even know it.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/chtbl.com/track/28E15G/traffic.megaphone.fm/WSMM5503913305.mp3?updated=1598916093"
        },
        {
            "title": "Things you have laying around worth big money: Part 1",
            "datePublished": "Fri, 28 Aug 2020 10:00:00 -0000",
            "description": "You may be sitting on a gold mine and not even know it. Dive into the world of collectibles with Kim and see how you could find fortune in unexpected places. You can make bank through old tech, classic toys, baseball cards and more. Meet a few people who have done just that, and find out the tricks they use to score impressive finds.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/chtbl.com/track/28E15G/traffic.megaphone.fm/WSMM4819630893.mp3"
        },
        {
            "title": "Unbelievable gadgets coming soon",
            "datePublished": "Tue, 25 Aug 2020 10:00:00 -0000",
            "description": "Think about just how much technology has shaped today's world — from smart assistants in our homes to self-driving cars to powerful computers we carry around in our pockets, But what is the next tech frontier, and what will it look like for our everyday lives? I'll walk you through the wild world of future tech.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/chtbl.com/track/28E15G/traffic.megaphone.fm/WSMM7469666431.mp3"
        },
        {
            "title": "Inside the web's biggest database of hacked logins ",
            "datePublished": "Fri, 21 Aug 2020 10:00:00 -0000",
            "description": "Today we’re giving you an inside look into Have I Been Pwned? — one of the best tools at your disposal when it comes to protecting yourself online. It's the world's largest database of stolen login information. Kim talks to the man behind it, Troy Hunt, to give you a step-by-step guide on what you can do if your info has been compromised. Don't miss this deep dive into online security, no IT degree required.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/chtbl.com/track/28E15G/traffic.megaphone.fm/WSMM3810650254.mp3"
        },
        {
            "title": "Bonus episode: Full hour of The Kim Komando Show",
            "datePublished": "Tue, 18 Aug 2020 10:00:00 -0000",
            "description": "This week's exclusive episode of Tech You Should Know is a full hour of The Kim Komando national radio show. Listen to every episode on your schedule on the Komando Community. Try it free for 30 days at getkim.com. \r\nOnline fraud has been surging since the pandemic began. But have you ever wondered who’s behind it, or where they are? Plus, more bad news for TikTok as it’s been discovered that its Android app has been collecting data it shouldn’t be. And this major city is checking social media feeds to find out if you’re violating quarantine. And that, plus your calls and questions.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/chtbl.com/track/28E15G/traffic.megaphone.fm/WSMM7336567739.mp3"
        },
        {
            "title": "Using tech clues to catch a killer: Part two",
            "datePublished": "Fri, 14 Aug 2020 10:00:00 -0000",
            "description": "In part two of this look at the correlation between shootings and online behavior, Kim talks to retired FBI agent James Fitzgerald and linguistics professor Tim Grant about the tech clues that indicate a potentially dangerous person. Listen for insider tips, case studies and interviews to help you spot trouble before it starts.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/chtbl.com/track/28E15G/traffic.megaphone.fm/WSMM1573826244.mp3"
        },
        {
            "title": "Using tech clues to catch a killer: Part one",
            "datePublished": "Tue, 11 Aug 2020 10:00:00 -0000",
            "description": "What is the connection between violent video games and real-life killing? Many of the culprits in public shootings are online gaming fans. What draws a would-be-killer into doing the unthinkable? In part of one of this chilling podcast, Kim is joined by former law enforcement officer Tim Dees to explore the possibilities.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/chtbl.com/track/28E15G/traffic.megaphone.fm/WSMM2466736969.mp3"
        },
        {
            "title": "Work from home scams & how to spot real jobs",
            "datePublished": "Fri, 07 Aug 2020 10:00:00 -0000",
            "description": "We all know people who have fallen for a scam of one kind or another — and work from home scams are some of the most convincing, and dangerous, ones out there. In this episode, Kim brings you the shocking details of real online job scams, red flags you should look out for and success stories of people who found the real thing and made big money.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/chtbl.com/track/28E15G/traffic.megaphone.fm/WSMM5712570628.mp3"
        },
        {
            "title": "Online banking: How to safely manage your finances, digitally",
            "datePublished": "Tue, 04 Aug 2020 11:00:00 -0000",
            "description": "What do you do when you get a physical check? Say goodbye to driving to the bank to deposit it. Now, you can just fire up your banking app, sign, snap a few pictures and that’s it. But do you know how to set yourself up to bank online the safe way? Kim's got all the steps you need to know.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/chtbl.com/track/28E15G/traffic.megaphone.fm/WSMM9020604312.mp3"
        },
        {
            "title": "5 unbelievable Dark Web stories",
            "datePublished": "Fri, 31 Jul 2020 03:00:00 -0000",
            "description": "There are 15 billion stolen logins swirling around the Dark Web, and you can bet at least one of yours is included. Kim dives into this mysterious, insidious corner of the internet with security consultant and convicted hacker Kevin Mitnick. Hear five shocking, scary and totally true stories of dangers lurking on the Dark Web. From Navy sailors to 16-year-old students, anyone can be a target. Luckily, Kim is here to guide you with practical ways to protect yourself.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/chtbl.com/track/28E15G/traffic.megaphone.fm/WSMM4951673640.mp3"
        },
        {
            "title": "Small biz 101: How to market your company on social media",
            "datePublished": "Tue, 28 Jul 2020 10:00:00 -0000",
            "description": "It doesn't matter if you bring in millions a year or put all your effort into just keeping your small business running — you need to market your business online. With so many digital channels, how do you get the most bang for your digital marketing buck? Kim talks to Jeremy Wood of Hootsuite about using social media to connect with your audience. Mike Huber of Vertical Measures tells us about using social media to build an \"owned\" audience.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/chtbl.com/track/28E15G/traffic.megaphone.fm/WSMM9003937547.mp3"
        },
        {
            "title": "Feeling stressed? Tech to help you relax",
            "datePublished": "Fri, 24 Jul 2020 09:00:00 -0000",
            "description": "Businesses have closed for good. Many people are struggling with the idea of months more of working from home. Others are still out of a job. The pandemic shows no signs of slowing down in some cities. Times are stressful, so Kim is taking a look at how technology can help you slow down, relax and release the stress.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/chtbl.com/track/28E15G/traffic.megaphone.fm/WSMM5620073557.mp3"
        },
        {
            "title": "Hitting the road: Life in an RV",
            "datePublished": "Tue, 21 Jul 2020 11:00:00 -0000",
            "description": "Have you ever had a dream of selling everything for the freedom of the open road? How would you get the internet or entertainment like TV? What about email and staying in touch with family? Regular vacations are off the table this summer, but RVs have never been hotter. This is the story of Jackie and Hal, a couple that sold everything to live in an RV that they fondly call the bus. Learn how they did it, from buying the right RV to making their marriage work 24/7 in a small confined space.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/chtbl.com/track/28E15G/traffic.megaphone.fm/WSMM5081328976.mp3"
        },
        {
            "title": "Cybersecurity: The myths you need to stop believing ",
            "datePublished": "Fri, 17 Jul 2020 11:00:00 -0000",
            "description": "More than half of Americans are working from home, and cybersecurity is on our minds more than ever. Most remote workers are confident their systems are secure, but recent numbers show about half are using their personal computers — which aren't protected the way in-office systems are. Kim talks with Charles Henderson, Global Partner and Head of IBM's X-Force Red, about common security myths and the truth you need to know.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/chtbl.com/track/28E15G/traffic.megaphone.fm/WSMM8699090616.mp3"
        },
        {
            "title": "Bonus episode: Full hour of The Kim Komando Show",
            "datePublished": "Tue, 14 Jul 2020 10:00:00 -0000",
            "description": "This week's exclusive episode of Komando On Demand is a full hour of The Kim Komando national radio show. Listen on your schedule on the Komando Community. Try it free for 30 days at getkim.com. In this hour, governments around the world have been scrambling to get contact tracing apps on smartphones to track the spread of COVID-19. We’ll tell you why it’s not working. Plus, Amazon is close to a major milestone on the stock market. And dozens of models of routers are vulnerable to being hacked. Find out if yours is on the list.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/chtbl.com/track/28E15G/traffic.megaphone.fm/WSMM7878923442.mp3?updated=1594680975"
        },
        {
            "title": "Social media success: The tricks you need to know",
            "datePublished": "Fri, 10 Jul 2020 10:00:00 -0000",
            "description": "In the never-ending noise that is social media, how do you stand out? That's the question business owners and entrepreneurs are asking. Kim talks to top technology influencer Evan Kirstel about ways to shine in a crowded social world. And learn the biggest mistakes to avoid if you're trying to build your brand.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/chtbl.com/track/28E15G/traffic.megaphone.fm/WSMM5089050284.mp3"
        },
        {
            "title": "How a YouTube product reviewer made $40K in a month",
            "datePublished": "Wed, 08 Jul 2020 10:00:00 -0000",
            "description": "Ever wonder how people make money on YouTube? How about making money selling stuff on Amazon and taking a commission off those sales? Sean Cannell combined both and is making $40,000 a month reviewing cameras and accessories. His widely popular ThinkMedia YouTube channel has about 1.2 million subscribers. Learn how he grew his online business and what it takes to do the same yourself.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/chtbl.com/track/28E15G/traffic.megaphone.fm/WSMM2707184903.mp3"
        },
        {
            "title": "Financial freedom: Tips, advice and inspiration",
            "datePublished": "Fri, 03 Jul 2020 10:00:00 -0000",
            "description": "Happy July 4th! In honor of Independence Day, hear from inspiring folks who have struck out on their own and achieved their own financial independence. Get some ideas and inspiration to be your own boss and make money on your terms.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/chtbl.com/track/28E15G/traffic.megaphone.fm/WSMM2424253722.mp3"
        },
        {
            "title": "Flipping flea market finds to a six-figure income",
            "datePublished": "Tue, 30 Jun 2020 10:00:00 -0000",
            "description": "Do you enjoy rifling through the treasures at flea markets, garage sales, thrift shops and even online marketplaces? This one's for you. Rob and Melissa Stephenson turned what started as a side hustle to earn some \"fun money\" into a full-fledged career, and a mighty successful one at that. You'll never believe the items they bought for a few bucks that turned into hundreds or even thousands.\r\nWe talk all things flipping, and you can even learn Rob and Melissa's secrets yourself. Get their pro tips to start your own flipping business, and they'll help you out all along the way. Visit FleaMarketFlipper.com/kim and use promo code KIM to get $100 off their online university.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/chtbl.com/track/28E15G/traffic.megaphone.fm/WSMM2208068364.mp3"
        },
        {
            "title": "Yahoo's famous yodel and the man behind it",
            "datePublished": "Tue, 23 Jun 2020 10:00:00 -0000",
            "description": "In the '90s, Wylie Gustafson recorded a yodel heard 'round the world: The famous \"Ya-hoo-ooo\" no doubt stuck in your head every time you read the company's name. He was paid just a few hundred dollars to record that famous clip ... until he sued Yahoo. Kim and Wylie talk about his iconic voice and the Super Bowl ad that kicked off his battle to get what he was owed.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/chtbl.com/track/28E15G/traffic.megaphone.fm/WSMM3358551935.mp3"
        },
        {
            "title": "Anonymous: Who are they and how they work",
            "datePublished": "Fri, 19 Jun 2020 10:00:00 -0000",
            "description": "You've probably heard of the hacktivist group Anonymous, but what do you know aside from some famous cyberattacks and those signature masks? Kim dives into everything Anonymous with Dr. Gabriella Coleman, an anthropologist and professor at McGill University. She studies hacktivist groups and tells us what Anonymous is up to these days and how you can help stop the spread of their sensational messages.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/chtbl.com/track/28E15G/traffic.megaphone.fm/WSMM8061685861.mp3"
        },
        {
            "title": "Everything you need to know about working from home in 30 minutes",
            "datePublished": "Tue, 16 Jun 2020 10:00:00 -0000",
            "description": "The unemployment numbers so far in 2020 are astounding, with 44 million people filing for unemployment since mid-March. That number is even higher if you factor in self-employed and gig economy workers. So what can you do if you've lost your job or fear you might? Kim talks to a man who makes $10,000 a year in the free time he could be wasting on Netflix. Plus, a teacher making extra cash at home and a caller who wants to take on a new side gig.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/chtbl.com/track/28E15G/traffic.megaphone.fm/WSMM3125067581.mp3"
        },
        {
            "title": "Everything you need to know about social media misinformation in 30 minutes",
            "datePublished": "Fri, 12 Jun 2020 10:00:00 -0000",
            "description": "In the age of social media, news spreads fast. Not just real, trustworthy news either. Kim talks with Darren Linvill, Associate Professor of Communication at Clemson University, who studies social media misinformation. Learn about the unbelievable level of sophistication that goes into fake tweets to make them go viral, plus important advice on how you can spot and avoid spreading misinformation.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/chtbl.com/track/28E15G/traffic.megaphone.fm/WSMM5114214182.mp3"
        },
        {
            "title": "Everything you need to know about online contests in 25 minutes",
            "datePublished": "Tue, 09 Jun 2020 10:00:00 -0000",
            "description": "Carolyn Wilman, the \"Contest Queen,\" has raked in $250K in online contests, sweepstakes and giveaways. She can enter more than 200 sweepstakes in an hour-long sitting, and she joins Kim to tell you how to find the best online contests and how to maximize your chances of winning. Plus, they talk about how contests — and prizes — have changed during the pandemic.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/chtbl.com/track/28E15G/traffic.megaphone.fm/WSMM6674834346.mp3"
        },
        {
            "title": "Everything you need to know about ransomware in 30 minutes",
            "datePublished": "Fri, 05 Jun 2020 10:00:00 -0000",
            "description": "By now, you’ve heard of ransomware attacks that take over computers of people like you but also businesses, hospitals and government agencies. These attacks are up 41% over the last year and it begs the question, why is this tactic so popular? Simply put, it nets hackers big money. In this Komando On Demand, Kim talks to a knight in shining software armor who has made it his mission to thwart ransomware attacks. Plus, cybersecurity tips from Etay Maor, Chief Security Officer at IntSights.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/chtbl.com/track/28E15G/traffic.megaphone.fm/WSMM8897418965.mp3"
        },
        {
            "title": "Kim takes your questions: Contact tracing, voice recognition, smart plugs and more",
            "datePublished": "Tue, 02 Jun 2020 10:00:00 -0000",
            "description": "In this episode of Komando On Demand, Kim answers listener questions and talks to a few special guests. She gives advice on the best smart plugs, voice recognition software for writing a book, recording webinars automatically and more. Plus, Kim chats with a reporter who took the COVID-19 contact tracer training to see exactly how it works and a staff writer for Wired magazine who gets calls and emails meant for MacKenzie Bezos, Jeff Bezos' billionaire ex-wife.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/chtbl.com/track/28E15G/traffic.megaphone.fm/WSMM6985507910.mp3"
        },
        {
            "title": "T-Mobile exec on managing crisis - What's it like to have Elon Musk's old phone number?",
            "datePublished": "Fri, 29 May 2020 11:00:00 -0000",
            "description": "In March, T-Mobile closed 80% of its stores due to the coronavirus pandemic. How did they manage a huge workforce of more than 110,000 employees? Kim chats with Jon Freier, T-Mobile's Executive Vice President of Consumer Markets, about the company's pivot during the pandemic, how to lead during a crisis and T-Mobile's on-going commitment to the military. Plus, can you guess what kind of calls and texts Elon Musk gets? Kim chats with a woman who knows firsthand.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/chtbl.com/track/28E15G/traffic.megaphone.fm/WSMM4893734761.mp3"
        },
        {
            "title": "Bonus: Full hour of The Kim Komando Show",
            "datePublished": "Mon, 25 May 2020 04:00:00 -0000",
            "description": "This week's exclusive episode of Komando On Demand is a full hour of The Kim Komando national radio show. Listen on your schedule on the Komando Community. Try it free for 30 days with code \"Kim\" at getkim.com. Coming up, widespread COVID-19 exposure notification is one step closer on iOS. Plus, this Memorial Day, learn more about your family members who served in WWII — for free. And meet a ransomware superhero who helps those who've been scammed and a woman who has Elon Musk's old phone number.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/chtbl.com/track/28E15G/traffic.megaphone.fm/WSMM4478983615.mp3"
        },
        {
            "title": "Making thousands a day online with Zoom - Smarter small biz advertising",
            "datePublished": "Fri, 22 May 2020 10:00:00 -0000",
            "description": "Meet a bar worker and promoter named Steven Walsh who went from unemployed thanks to the pandemic to hosting trivia on Zoom and making thousands of dollars a day. Then, learn how small and mid-sized businesses can use data to advertise like the Fortune 500. Kim chats with Robert Brill, CEO of Brill Media. Plus, Kim talks to a caller who wants to get set up teaching a course online.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/chtbl.com/track/28E15G/traffic.megaphone.fm/WSMM4768316609.mp3",
            "snNo": "5"
        },
        {
            "title": "How to make money with email marketing",
            "datePublished": "Tue, 19 May 2020 10:00:00 -0000",
            "description": "You can find success on social media or become a star on YouTube, but at the end of the day, you're reliant on that platform. Your success is tied to it, for better and for worse. But build up an email list and your contacts are yours. Kim chats with PowerInbox CEO Jeff Kupietzky about converting your email list into a living, while keeping your subscribers happy. Learn the best days and times to send email and insider tips to increase your open rates.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/chtbl.com/track/28E15G/traffic.megaphone.fm/WSMM8819100424.mp3"
        },
        {
            "title": "Feeding a remote Alaskan town during the pandemic",
            "datePublished": "Fri, 15 May 2020 10:00:00 -0000",
            "description": "On this episode, Kim brings you the story of a man feeding a remote Alaska town with a Costco card and a ship. Toshua Parker went from a quarter-million dollars in debt to the owner of a successful grocery story that's keeping Gustavus, Alaska stocked during the coronavirus pandemic. Plus, meet Jonathan Bass, Head of Marketing and Communications at Wing, a subsidiary of Alphabet. Wing has built an autonomous fleet of small, lightweight delivery drones that can transport small packages to homes in minutes.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/chtbl.com/track/28E15G/traffic.megaphone.fm/WSMM3962731123.mp3"
        },
        {
            "title": "The season the Phoenix Suns never saw coming",
            "datePublished": "Tue, 12 May 2020 10:00:00 -0000",
            "description": "When pro sports organizations canceled games for the foreseeable future, players packed up and went home. But the Phoenix Suns carried on the season in an unconventional way: Streaming virtual games through NBA 2K20 on Twitch. They got the stream up and running overnight, and millions and millions of viewers tuned in. Kim talks with Suns Chief Marketing and Communications Officer Dean Stoyer about how they pulled it all together.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/chtbl.com/track/28E15G/traffic.megaphone.fm/WSMM1970519965.mp3"
        },
        {
            "title": "Coping with COVID-19 - Helping those on the front lines",
            "datePublished": "Fri, 08 May 2020 10:00:00 -0000",
            "description": "Howard Scott Warshaw is infamous for designing and programming Atari games Raiders of the Lost Ark and E.T. the Extra-Terrestrial, often referred to as the world's worst video game. Warshaw is also known as the Silicon Valley Therapist. He and Kim talk about how to cope with the stress of the pandemic. Plus, Ryan Welch is on a mission to provide personal protective equipment through his nonprofit, Give Kits. The PPE is going to first-responders across the country.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/chtbl.com/track/28E15G/traffic.megaphone.fm/WSMM7192566741.mp3"
        },
        {
            "title": "How businesses are pivoting amid the pandemic",
            "datePublished": "Tue, 05 May 2020 10:00:00 -0000",
            "description": "For nearly 50 years, enthusiasts from all over the world have flocked to the Barrett-Jackson collector car auctions. But the global pandemic hit, and now a crowd of people is off the table. Kim talks to Craig Jackson, Barrett-Jackson Chairman and CEO, about how they can capture that amazing auction energy online.\r\n\r\nPlus, meet a bakery owner who turned his business upside down in two days, transforming his company from an in-person destination to a mail-order baking service.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/chtbl.com/track/28E15G/traffic.megaphone.fm/WSMM1961490140.mp3"
        },
        {
            "title": "Coronavirus: How trends are shaping the future - DIY broadband internet ",
            "datePublished": "Fri, 01 May 2020 03:00:00 -0000",
            "description": "We're staying six feet apart, gas is cheap and the middle seat on airplanes may be empty for a while yet. But what about our businesses and our future? Kim talks with analyst Steph Smith about which trends are worth watching to make sense of the complicated world. Plus, meet Nate Walowitz, regional coordinator and creator of Project THOR. After getting fed up with slow satellite internet options, Colorado residents took matters into their own hands to build their own solution.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/chtbl.com/track/28E15G/traffic.megaphone.fm/WSMM6566941622.mp3"
        },
        {
            "title": "Kim and Dr. Laura: How to stay sane while self-isolating",
            "datePublished": "Tue, 28 Apr 2020 10:00:00 -0000",
            "description": "Kim is joined by fellow radio host and relationship expert Laura Schlessinger. They talk about managing the stress of the coronavirus pandemic, from fear of the future to the anxiety you're feeling to struggling to get through the day. Plus, laptop buying tips on a budget and cybersecurity tips from a white hat hacker.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/chtbl.com/track/28E15G/traffic.megaphone.fm/WSMM3398816460.mp3"
        },
        {
            "title": "Purdue virologist: Here's what's coming - How to cut the cord - Finding WFH jobs",
            "datePublished": "Fri, 24 Apr 2020 10:00:00 -0000",
            "description": "In this episode, Kim talks to a virologist about the spread of COVID-19, the importance of technology in the fight and what it means for the future of healthcare. Plus, the best way to start streaming to lower your cable bill and advice on cutting the cord. And hear the hilarious story of a Zoom class gone wrong.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/chtbl.com/track/28E15G/traffic.megaphone.fm/WSMM1712437775.mp3"
        },
        {
            "title": "Coronavirus: Clever ways criminals are using your fears against you",
            "datePublished": "Tue, 21 Apr 2020 10:00:00 -0000",
            "description": "Misinformation, hoaxes and scams are rampant on the web. People are scared, and cybercriminals are taking advantage — hawking fake test kits, vaccines and financial aid, among other things. What do you need to know to stay safe? Kim talks to Tom Edwards, U.S. Secret Service Special Agent in Charge, and Lori Hodges, Vice President of North America Risk at Visa, about the dangers you're facing online right now and the right steps to take if you've been scammed.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/chtbl.com/track/28E15G/traffic.megaphone.fm/WSMM8049077020.mp3"
        },
        {
            "title": "Protect yourself from COVID-19 scams",
            "datePublished": "Fri, 17 Apr 2020 10:00:00 -0000",
            "description": "Scams, hacks and cyberthreats exploded in March and show no signs of slowing down as the coronavirus spread continues. Kim talks with Etay Maor, Chief Security Officer at IntSights, a company that helps enterprises defend against security threats. They dive into the outlandish scams finding traction and the more believable ones fooling people across the web.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/chtbl.com/track/28E15G/traffic.megaphone.fm/WSMM7729688769.mp3"
        },
        {
            "title": "Bonus: Full hour of The Kim Komando Show",
            "datePublished": "Tue, 14 Apr 2020 03:00:00 -0000",
            "description": "This week's episode is a full hour of The Kim Komando radio show. Try out the Komando Community and get full access to Kim's show. Coming up, one of the latest coronavirus-related scams involves a self-described “survivor” selling his immune blood and saliva on the dark web. Plus, the heartbreaking story of a woman who tried asking Alexa for help dozens of times before dying of COVID-19.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/chtbl.com/track/28E15G/traffic.megaphone.fm/WSMM2624789334.mp3"
        },
        {
            "title": "The trouble facing ISPs - Zoombombing and other WFH dangers",
            "datePublished": "Fri, 10 Apr 2020 10:00:00 -0000",
            "description": "The internet is strained, and ISPs are dealing with more malicious activity than before the coronavirus pandemic. Kim talks with Kevin Hart, CTO for Cox Communications, about how to maximize your bandwidth. Plus, Kim's chat with fellow radio host Joe Pags. They talk all things work from home, including the dangers of Zoombombing.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/chtbl.com/track/28E15G/traffic.megaphone.fm/WSMM3817742613.mp3"
        },
        {
            "title": "Cybersecurity tips from a white hat hacker",
            "datePublished": "Tue, 07 Apr 2020 10:00:00 -0000",
            "description": "Coronavirus scams are spreading at an alarming rate. To make matters worse, the junk email and bogus texts that normally flood our inboxes and phones become a lot harder to weed out when we're desperate for information. Kim talks to IBM social engineer Stephanie Carruthers, aka _sn0ww, about the surge in spam capitalizing on our fears and confusion. Learn about the biggest spam campaigns making the rounds right now and how you can stay safe online.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/chtbl.com/track/28E15G/traffic.megaphone.fm/WSMM9447887052.mp3"
        },
        {
            "title": "Tips for living in isolation from a NASA astronaut",
            "datePublished": "Fri, 03 Apr 2020 10:00:00 -0000",
            "description": "When it comes to being isolated, astronauts are the real pros. In this episode, Kim talks to retired NASA astronaut Scott Kelly, who holds the American record for the longest time spent in space. He’s shares the tactics he used to stayed sane in isolation for a year on the International Space Station and tips for leading a team through crisis.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/chtbl.com/track/28E15G/traffic.megaphone.fm/WSMM6492905033.mp3"
        },
        {
            "title": "Bonus episode: Full hour of The Kim Komando Show",
            "datePublished": "Tue, 31 Mar 2020 03:00:00 -0000",
            "description": "This week's exclusive episode of Komando On Demand is a full hour of The Kim Komando national radio show. Try out the Komando Community and get full access to 36 hours of Kim's show for just a few bucks a month. Medical workers in one state are wearing rings on their fingers packed with tech that could detect illness before symptoms appear. Watch out for false claims about the census and coronavirus. And in Kim's DIY Security tip, five steps you need to take with cyberattacks increasing.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/chtbl.com/track/28E15G/traffic.megaphone.fm/WSMM8079450867.mp3"
        },
        {
            "title": "What it’s like to be an Uber driver during the COVID-19 pandemic",
            "datePublished": "Fri, 27 Mar 2020 10:00:00 -0000",
            "description": "The coronavirus pandemic is ravaging the economy and closing down businesses. In one week alone, a stunning 3.28 million people have filed for unemployment in the United States. Independent contractors and workers in the gig economy are among those hit the hardest. Kim talks to rideshare expert Sergio Avedian, Senior Contributor at TheRideshareGuy.com, about how dramatically decreased demand and more dangerous working conditions are impacting drivers.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/chtbl.com/track/28E15G/traffic.megaphone.fm/WSMM9079831872.mp3"
        },
        {
            "title": "Bonus episode: Full hour of The Kim Komando Show",
            "datePublished": "Tue, 24 Mar 2020 03:00:00 -0000",
            "description": "This week's exclusive episode of Komando On Demand is a full hour of The Kim Komando national radio show. As if you don’t have enough to worry about, now trolls, scammers and other cybercrooks are trying to capitalize on the coronavirus pandemic. Find out how to avoid being taken. Plus, ISPs around the country are pledging to keep your internet service turned on, even if you can’t pay the bill.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/chtbl.com/track/28E15G/traffic.megaphone.fm/WSMM2878625781.mp3"
        },
        {
            "title": "Coronavirus tech insights and how I'm doing my national radio show from home",
            "datePublished": "Fri, 20 Mar 2020 10:00:00 -0000",
            "description": "The world feels like a different place right now. We're working from home, distancing ourselves from others and staying glued to the news as the coronavirus spreads and developments unfold. Kim and Mike dive into the impact technology is having in the fight against the virus, and what we're doing as a nation to stay safe, informed and sane. Plus, learn how the Komando team will pull off filming and broadcasting the national radio show right from Kim's house this weekend.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/chtbl.com/track/28E15G/traffic.megaphone.fm/WSMM7516424763.mp3"
        },
        {
            "title": "Online banking: Can you trust it? ",
            "datePublished": "Tue, 17 Mar 2020 10:00:00 -0000",
            "description": "Skip the lines at the bank and do your financial transactions from the comfort of your own home? No brainer, right? Well, not so fast. There's no security guard standing watch over your online transactions, so you need to look out for yourself. Here’s how.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/chtbl.com/track/28E15G/traffic.megaphone.fm/WSMM3073335639.mp3"
        },
        {
            "title": "81-year-old TikTok star - Gamer who earns $12K a month",
            "datePublished": "Fri, 13 Mar 2020 10:00:00 -0000",
            "description": "Stephen Austin isn't your typical TikTok star. To start, he's 81 years old. But that's a big part of what has made \"Old Man Steve\" such an endearing figure on the video platform. He and Kim chat about how he became the internet's grandpa. Plus, Kim interviews a gamer who makes $12,000 a month streaming through Twitch. All that and more on this episode of Komando On Demand.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/chtbl.com/track/28E15G/traffic.megaphone.fm/WSMM5515089654.mp3"
        },
        {
            "title": "The man behind the 'worst video game in history'",
            "datePublished": "Tue, 10 Mar 2020 10:00:00 -0000",
            "description": "Do you ever wonder who's behind the games you grew up loving ... or hating? In this episode of Komando On Demand, Kim interviews Howard  Scott Warshaw, an American psychotherapist and former Atari game designer. Howard designed and programmed the Atari 2600 games Yars' Revenge, Raiders of the Lost Ark and E.T. the Extra-Terrestrial — considered one of the worst games ever made.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/chtbl.com/track/28E15G/traffic.megaphone.fm/WSMM3281150335.mp3"
        },
        {
            "title": "Shark Tank $400K scam - Smart home 101 - Stop spam calls for good",
            "datePublished": "Fri, 06 Mar 2020 10:00:00 -0000",
            "description": "Kim chats with fellow radio host Joe Pags about a $400K Shark Tank scam that just about anyone could fall for, the alarming rate at which smart speaks accidentally listen in on our conversations and the gross reality of ride share cars. (You'll think twice before you book your next Uber.) Kim has a few simple tools to help you fight unwanted spam calls, no downloads required.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/chtbl.com/track/28E15G/traffic.megaphone.fm/WSMM6109190092.mp3"
        },
        {
            "title": "DNA tests, smart TVs and devices (even sex toys!) privacy exposed and data tracking",
            "datePublished": "Tue, 03 Mar 2020 10:00:00 -0000",
            "description": "You’re being tracked through your tech in ways that will shock you. Kim speaks with top national digital expert and lawyer Steven Teppler about what’s going on and what you can do about it.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/chtbl.com/track/28E15G/traffic.megaphone.fm/WSMM9625792010.mp3"
        },
        {
            "title": "Google's head of ads research - Bringing the DeLorean back to life - Website marketing 101",
            "datePublished": "Fri, 28 Feb 2020 10:00:00 -0000",
            "description": "Ever wonder how online ads work and what determines what you see — and what you click? Kim talks to Google’s Head of Ads Research and Insights, Justin De Graaf, about what drives consumer behavior. Plus, 17-year-old Aidan Jackson shares how technology — and a friend 5,000 miles away — saved his life during a health scare. Meet the CEO of the DeLorean Motor Company, Stephen Wynne. He’s attempting to make the brand he grew up loving a modern success.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/chtbl.com/track/28E15G/traffic.megaphone.fm/WSMM4611055175.mp3"
        },
        {
            "title": "The social network before social networks",
            "datePublished": "Tue, 25 Feb 2020 10:00:00 -0000",
            "description": "Let's go back in time to 1989. The Loma Prieta earthquake struck as the third game of the World Series was set to begin. During this time of panic, when other modes of communication failed, a group of volunteers stepped up: ham radio operators. These brave people became unsung heroes, jumping into action to literally save lives. Find out how they did it and the place ham radio has in our world today.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/chtbl.com/track/28E15G/traffic.megaphone.fm/WSMM6503437312.mp3"
        },
        {
            "title": "World's fastest woman - Delivering for Amazon - Avoid tax scams",
            "datePublished": "Fri, 21 Feb 2020 10:00:00 -0000",
            "description": "Valerie Thompson isn't happy just being fast — she wants to be the fastest. Valerie is an eight-time land speed record club holder, dubbed the world's fastest female motorcycle racer. She talks to Kim about the risks she takes and what keeps her motivated. Plus, Kim chats with Chad, an Amazon Flex driver, about the pros and cons of his line of work. And don't wait until April to file your taxes. There's a reason you should do it right now.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/chtbl.com/track/28E15G/traffic.megaphone.fm/WSMM2584171458.mp3"
        },
        {
            "title": "Life on the road: Downsizing to an RV",
            "datePublished": "Tue, 18 Feb 2020 10:00:00 -0000",
            "description": "Six years ago, Jackie and Hal traded in their house for a home on the open road. On this episode, we're checking in to see what's gone right, what's gone wrong and how tech has played a role in their adventures. Get an inside look at what life is like in an RV — plus tips on how make the adventure profitable.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/chtbl.com/track/28E15G/traffic.megaphone.fm/WSMM6063228827.mp3"
        },
        {
            "title": "Wi-Fi is illegal in this town - Digital magician Zach King - Email spoofing",
            "datePublished": "Fri, 14 Feb 2020 10:00:00 -0000",
            "description": "Green Bank, West Virginia is home to a massive telescope and a rule unheard of in today's world — no Wi-Fi allowed. Kim chats with Chuck Niday, who works in the so-called Quiet Zone. Zach King is a social media darling; he's the second biggest creator on TikTok and he's got 22.7 million followers on Instagram. His fame is well-earned. Zach is a digital magician who creates stunning visual tricks. And Kim helps a caller with an unbelievable story about his long-distance bride.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/chtbl.com/track/28E15G/traffic.megaphone.fm/WSMM8733987302.mp3"
        },
        {
            "title": "Bonus episode: Full hour of The Kim Komando Show",
            "datePublished": "Wed, 12 Feb 2020 03:00:00 -0000",
            "description": "This week's exclusive episode of Komando On Demand is a full hour of The Kim Komando national radio show. Try out the Komando Community — and get full access to 36 hours of Kim's show.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/chtbl.com/track/28E15G/traffic.megaphone.fm/WSMM5077319229.mp3"
        },
        {
            "title": "How to succeed on social media - and the biggest mistakes you're making",
            "datePublished": "Tue, 11 Feb 2020 10:00:00 -0000",
            "description": "Build an audience, get them talking and stand out on a platform packed with people all trying to be heard. Easier said than done, right? If you're a business owner or entrepreneur looking to make a name for yourself on social media, don't miss this episode. Kim chats with business thought leader and top technology influencer Evan Kirstel about what it takes to succeed on social media — and the big mistakes you need to avoid if you want to build your brand.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/chtbl.com/track/28E15G/traffic.megaphone.fm/WSMM7620476524.mp3"
        },
        {
            "title": "FBI warning: Job scams to watch for - Dating apps safety - Coronavirus in your inbox",
            "datePublished": "Fri, 07 Feb 2020 10:00:00 -0000",
            "description": "In this episode of Komando On Demand: Insider Edition, Kim chats with Daniel Linskey, former chief of police of Boston and fellow at The Duff & Phelps Institute, about a dangerous job scam spreading right now. Plus, Congress launches an investigation into dating apps and the dangerous people using them. It's about time. And meet Bob Caniglia, Director of Sales Operations for Blackmagic Designs. The company gives free access to $300,000 movie editing tools so anyone can create movie magic.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/chtbl.com/track/28E15G/traffic.megaphone.fm/WSMM6440358095.mp3"
        },
        {
            "title": "Hospital of the future - The lowdown on 5G - Dangerous TikTok challenges",
            "datePublished": "Tue, 04 Feb 2020 10:00:00 -0000",
            "description": "On this episode of Komando On Demand: Insider Edition, Kim talks with talk radio host Joe Pags about the future of 5G and why Apple is taking its time releasing a 5G-ready phone. Plus, find out how AI is fighting the coronavirus — and how fast fake news about the illness is spreading. And meet Gary Fritz, Vice President and Chief of Applications at New Stanford Hospital, a $2 billion world-class facility in Palo Alto, California being called the hospital of the future.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/chtbl.com/track/28E15G/traffic.megaphone.fm/WSMM4654934144.mp3"
        },
        {
            "title": "Coronavirus fake news - Steve Ballmer - Using tech to fight Australia's wildfires",
            "datePublished": "Fri, 31 Jan 2020 10:00:00 -0000",
            "description": "Coronavirus is dominating headlines, and people are scared. And where there's fear, there's fake news. Learn how to spot misinformation. Plus, Kim chats with former CEO of Microsoft and chairman of the LA Clippers Steve Ballmer about his new site, USAFacts.org. This week's trivia is all about cell phones. Do you know how much the first handheld cell phone cost? All that and more on this episode of Komando On Demand: Insider Edition.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/chtbl.com/track/28E15G/traffic.megaphone.fm/WSMM3645163665.mp3"
        },
        {
            "title": "Future tech: Useful or useless?",
            "datePublished": "Tue, 28 Jan 2020 10:00:00 -0000",
            "description": "Technology is evolving faster than you can say \"artificial intelligence.\" How does all this new tech impact our daily lives? In this episode of Komando On Demand, Kim explores a new world of gadgets — some useful, some useless and some in the middle. ",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/chtbl.com/track/28E15G/traffic.megaphone.fm/WSMM8590503543.mp3"
        },
        {
            "title": "Should Apple unlock terrorists' phones? - Saving treasured voicemails - 57-day search for lost dog",
            "datePublished": "Fri, 24 Jan 2020 10:00:00 -0000",
            "description": "Hear the heartwarming story of a couple who put their lives on hold for 57 days to search for their lost border collie, Katie. And you know ads follow you online but what about in real life? Kim dives into the world of digital tracking with an advertising expert. Plus, a caller looks for a creative solution to remember his mother through old voicemails. All that and more on this episode of Komando On Demand: Insider Edition.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/chtbl.com/track/28E15G/traffic.megaphone.fm/WSMM5706662704.mp3"
        },
        {
            "title": "You're being tracked: How companies watch your every move",
            "datePublished": "Tue, 21 Jan 2020 10:00:00 -0000",
            "description": "You know you're being tracked by surveillance cameras everywhere you go, ads that follow you around the internet and Big Tech companies that have a shocking amount of information about you — but it doesn't stop there. In this episode of Komando On Demand, Kim dives into who is spying on you and how you can hide from them to maintain your privacy. She's joined by Richard Eilert, an expert in geolocation and geofencing, about why your location means big bucks for companies.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/chtbl.com/track/28E15G/traffic.megaphone.fm/WSMM6129300292.mp3"
        },
        {
            "title": "Barrett-Jackson online bidding tech - Tech help scam - iPhone saves lost hiker",
            "datePublished": "Fri, 17 Jan 2020 10:00:00 -0000",
            "description": "Kim talks to Craig Jackson, Chairman and CEO of Barrett-Jackson and a pioneer in online bidding. This year’s Scottsdale, Ariz. auction is the biggest in history. Learn about the technology that powers the world’s greatest collector car auctions. Plus, Kim helps a caller who was scammed trying to fix his computer, and meet a lost hiker who used her iPhone flashlight — and a dose of luck — to get out of a scary situation.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/chtbl.com/track/28E15G/traffic.megaphone.fm/WSMM3716484072.mp3"
        },
        {
            "title": "Dangers of in-game spending, cleaning $250K IMAX screens, CES tech wins",
            "datePublished": "Fri, 10 Jan 2020 10:00:00 -0000",
            "description": "Catch up on the top tech news of the day and meet digital movers and shakers on Komando On Demand: Insider Edition. Consumers spend billions of dollars a year on in-game purchases. Kim talks to a mom who discovered her son was buying much more than she realized through his Xbox. Plus, meet a man responsible for cleaning eight-story IMAX screens worth $250,000. And Kim brings you the shining stars of his year's CES, the annual tech trade show in Last Vegas.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/chtbl.com/track/28E15G/traffic.megaphone.fm/WSMM1094640017.mp3"
        },
        {
            "title": "The secret of success: Building sustainable habits",
            "datePublished": "Tue, 07 Jan 2020 10:00:00 -0000",
            "description": "What's the key to success? Habits! In this episode of Komando On Demand, Kim brings you truly life-changing stories and tips from highly motivated movers and shakers. Meet VU Dream founder and podcaster Mark Metry, as well as CEO and renowned attorney Joseph Harary. They chat with Kim about how they became successful and what they did to get there. By the end of this podcast, you'll be loaded with tools to guide your own transformation.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/chtbl.com/track/28E15G/traffic.megaphone.fm/WSMM8865626576.mp3"
        },
        {
            "title": "Hacker watches child through Ring camera - Check your Wi-Fi speed - The Rideshare Guy",
            "datePublished": "Fri, 03 Jan 2020 10:00:00 -0000",
            "description": "Where do Uber and Lyft drivers go to get their questions answered? The Rideshare Guy. Kim interviews Harry Campbell, an aerospace engineer who left his job to become the go-to expert on all things rideshare. Plus, a young girl terrorized after a hacker accessed a family's Ring camera. Kim talks to her mom. And learn what internet speed you need and how to make sure you're getting what you pay for.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/chtbl.com/track/28E15G/traffic.megaphone.fm/WSMM4654666103.mp3"
        },
        {
            "title": "Fake news tech: How it works and how to spot it",
            "datePublished": "Tue, 31 Dec 2019 10:00:00 -0000",
            "description": "Every time you get online, you're bombarded with doctored images, fake videos, false accusations and outright lies. So how can you determine what's true and what's false? In this episode of Komando on Demand, Kim looks at the latest technology people are using to generate fake news and how to spot it. Kim talks to filmmaker Charles Dutka about how fake videos and images are created as well as Adrienne Gonzales, owner of Go Fraud Me, who combats fake online fundraisers.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/chtbl.com/track/28E15G/traffic.megaphone.fm/WSMM3333150506.mp3"
        },
        {
            "title": "SEO tips to get your website to the top of Google search - How a baker turned her passion into a successful business",
            "datePublished": "Fri, 27 Dec 2019 10:00:00 -0000",
            "description": "Kim Komando talks to Heather Lloyd-Martin, who's been featured in Forbes and Entrepreneur magazine and many others about using Search Engine Optimization to get to the top of Google's search results. How a lady turned her passion for baking into a business that makes over $200K a year. Plus, hot tips to hack-proof your life. ",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/chtbl.com/track/28E15G/traffic.megaphone.fm/WSMM9422112928.mp3"
        },
        {
            "title": "What does your car know about you? Just about everything",
            "datePublished": "Tue, 24 Dec 2019 10:00:00 -0000",
            "description": "Just like our smartphones and computers, today's cars are connected. Car makers are using new technology to learn as much about us as they can — everything from our driving habits to our behaviors on and off the road. What will your new car know about you? And more importantly, what does that mean for your privacy? Kim takes an inside look at our future behind the wheel.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/chtbl.com/track/28E15G/traffic.megaphone.fm/WSMM2297522936.mp3"
        },
        {
            "title": "Dr. Laura: How tech affects our relationships",
            "datePublished": "Fri, 20 Dec 2019 14:53:13 -0000",
            "description": "On this episode of Komando On Demand, Dr. Laura Schlessinger joins Kim to dive into the impact technology and social media have on relationships. Plus, meet Rob Walch, Vice President at podcast hosting company Libsyn. Can your podcast player track you? Find out. And Kim offers three tips for hiding your online activity from nosy advertisers.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/chtbl.com/track/28E15G/traffic.megaphone.fm/WSMM2308656356.mp3"
        },
        {
            "title": "YouTube's fight against child predators",
            "datePublished": "Tue, 17 Dec 2019 10:00:00 -0000",
            "description": "A young woman lies sick on a bed. On the table next to her is a hypodermic needle. Her sister tells her, \"You're hot,\" injects something into her backside and gives her a long, lingering kiss on the lips. Adult film? Nope. It's a cartoon featuring Elsa from \"Frozen.\" \"Elsagate\" is a disturbing movement on YouTube targeting young children. Renowned psychologist Dr. Christine Davidson joins Kim Komando to talk about Elsagate. Learn how to protect children from adult content that's disguised as safe for kids.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/chtbl.com/track/28E15G/traffic.megaphone.fm/WSMM1612625052.mp3"
        },
        {
            "title": "Mom bans kids from tech, Uber safety warning, dad takes over daughter's Instagram",
            "datePublished": "Fri, 13 Dec 2019 10:00:00 -0000",
            "description": "In this episode of Komando On Demand, Kim talks to a mom who banned her kids from using technology for 30 days. You'll never believe the results. Plus, a warning for the students in your life: Put down the smartphone in class. Here's why. And Uber recently released its first-ever safety report. The data might make you rethink ridesharing services.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/chtbl.com/track/28E15G/traffic.megaphone.fm/WSMM8210282718.mp3"
        },
        {
            "title": "Stop the flood of scammers and robocallers",
            "datePublished": "Tue, 10 Dec 2019 10:00:00 -0000",
            "description": "Robocalls are worse than ever, and try as they might, cell carriers and even the federal government are having a hard time stopping the onslaught. Scam calls aren't just annoying — they also pose a very real risk to consumers as it gets harder to identify and avoid malicious automated calls. In this Komando On Demand podcast, you’ll learn how to protect yourself and your family from falling victim to these tricky and downright dangerous phone calls.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/chtbl.com/track/28E15G/traffic.megaphone.fm/WSMM4560291444.mp3"
        },
        {
            "title": "Get your idea made into a Hallmark movie, FBI's smart TV warning, Google Maps tricks",
            "datePublished": "Fri, 06 Dec 2019 10:00:00 -0000",
            "description": "If you’ve ever wondered what it takes to get your idea made into a Hallmark movie, Kim talks to a woman who did just that. How'd she do it? Find out. Plus, a serious warning from the FBI if you have a smart TV, and pro tips on making holiday travel easier using an app you probably already have on your phone: Google Maps. And don't miss this week's tech trivia!",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/chtbl.com/track/28E15G/traffic.megaphone.fm/WSMM1578305195.mp3"
        },
        {
            "title": "5G is coming: Is speed worth the costs?",
            "datePublished": "Tue, 03 Dec 2019 10:00:00 -0000",
            "description": "Super-fast 5G service is spreading across the country. This wireless technology is much more than a just an upgrade. We're talking lightening-fast streaming and potential innovations like driverless cars and smart cities. But will this breakthrough come at a cost to your health, increasing the risk of disease and disorders?",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/chtbl.com/track/28E15G/traffic.megaphone.fm/WSMM5290146125.mp3"
        },
        {
            "title": "The science behind finding deepfakes, robotic chef, tech trivia",
            "datePublished": "Thu, 28 Nov 2019 11:00:00 -0000",
            "description": "On this episode of Komando On Demand: Insider Edition, Kim talks to an expert in deepfake technology, Henry Ajder, head of communications and research analysis at Deeptrace. The company uses manual searching, web scraping tools and data analysis to detect deepfakes. Plus, don't miss this week's trivia. We'll tell you what computer has been the best selling model from the '80s till now. And learn about a robotic chef that can cook 2,000 different meals.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/chtbl.com/track/28E15G/traffic.megaphone.fm/WSMM8439588606.mp3"
        },
        {
            "title": "Dark Web crimes: A look into the internet's darkest places",
            "datePublished": "Wed, 27 Nov 2019 10:00:00 -0000",
            "description": "In this episode of Komando On Demand, Kim dives into the Dark Web, where people can hire hit men, buy poison and hack your computer. Criminals lurk within the dark alleyways of the internet, waiting to take advantage of you and your loved ones. Kim talks to former FBI special agent Lawrence Wolfenden to take you behind the scenes of real Dark Web crimes.\r\n\r\nLearn what went into tracking a father and daughter who sold Xanax disguised as organic fitness pills.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/chtbl.com/track/28E15G/traffic.megaphone.fm/WSMM6397389104.mp3"
        },
        {
            "title": "5 apps to help you find TV shows to binge watch",
            "datePublished": "Sat, 23 Nov 2019 10:00:00 -0000",
            "description": "Streaming services have changed the way we watch TV. Instead of settling in to watch the newest episode of your favorite show as it airs, we now watch on our schedules or even binge watch entire seasons in one go. But this convenience comes with a downside: It's tough to keep track of when your favorite shows air. Kim and co-host Mike have five apps to help manage your binge watching so you don’t miss a thing.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/chtbl.com/track/28E15G/traffic.megaphone.fm/WSMM8552140835.mp3"
        },
        {
            "title": "Black Friday deals, USC video game professor, cryptocurrency author",
            "datePublished": "Thu, 21 Nov 2019 10:00:00 -0000",
            "description": "Shopping season is here, and it kicks off with Black Friday! Deals are here, and Kim talks to a retail pro who breaks down all the top discounts. Meet Michael Zyda, a professor who built the country's No. 1 ranked video game program at USC. Plus, Kim chats with Dan Conway, author of \"Confessions of a Crypto Millionaire,\" about how Bitcoin completely changed his life.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/chtbl.com/track/28E15G/traffic.megaphone.fm/WSMM6498815376.mp3"
        },
        {
            "title": "Bonus episode: One full hour of The Kim Komando Show",
            "datePublished": "Tue, 19 Nov 2019 10:00:00 -0000",
            "description": "This week's exclusive episode of Komando On Demand is a full hour of The Kim Komando national radio show. Enjoy!\r\n\r\nTargeted ads might not surprise you anymore, but you won’t believe what some retailers are doing now when you browse their websites. Plus, adding a second screen to your phone could soon be possible thanks to a new device. And learn the secret way to dig up dirt on someone.\r\n\r\nWant more of the radio show podcast? Head to community.komando.com.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/chtbl.com/track/28E15G/traffic.megaphone.fm/WSMM2460541368.mp3"
        },
        {
            "title": "Founding father of virtual reality, dash cam apps, useful gadgets under $50",
            "datePublished": "Fri, 15 Nov 2019 10:00:00 -0000",
            "description": "In this episode of Komando On Demand: Insider Edition, Kim talks to one of the founding fathers of VR, Jaron Lanier, about his revolutionary idea for how consumers can earn money from our data. Plus, find out if dash cam apps really work or you need a full-fledged camera to do the job. And don't miss this week's trivia. Can you guess the eight-digit password created by President Kennedy to authorize a nuclear launch?",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/chtbl.com/track/28E15G/traffic.megaphone.fm/WSMM8105853060.mp3"
        },
        {
            "title": "An unexpected way to make extra cash on the web",
            "datePublished": "Wed, 13 Nov 2019 01:00:00 -0000",
            "description": "Good website names are in high demand, and people are selling domains for figures that would astound you. In this episode of Komando On Demand, Kim looks at the practice of selling website domain names and social media handles. She talks to Asen Kehayov, an ethical hacker and founder of InForceCyber.com, about how to be safe when buying and selling domains.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/chtbl.com/track/28E15G/traffic.megaphone.fm/WSMM7417744814.mp3"
        },
        {
            "title": "Google search pro tips, Kim's amazing callers, putting a number on health",
            "datePublished": "Fri, 08 Nov 2019 01:00:00 -0000",
            "description": "On this week's episode, hear the amazing story of a man who was saved by his Apple Watch after a scary accident. Plus, researchers say 10,000 steps a day isn't enough. What's optimal to keep you healthy? Kim shares the answer. And get the most out of your next Google search with these pro tips.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/chtbl.com/track/28E15G/traffic.megaphone.fm/WSMM7416601285.mp3"
        },
        {
            "title": "How kids get seduced, enticed and recruited online",
            "datePublished": "Wed, 06 Nov 2019 01:00:00 -0000",
            "description": "Kids run away in search of love only to be held captive by sex traffickers, hate groups and terrorists. Every 40 seconds, a child goes missing in the United States. Learn how innocent-looking apps and recruiters are luring in our kids in this can’t miss episode of Komando On Demand. It might just save a life.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/chtbl.com/track/28E15G/traffic.megaphone.fm/WSMM1342902785.mp3"
        },
        {
            "title": "Pro hacker makes $600K working part-time, stop robocalls, tech trivia",
            "datePublished": "Fri, 01 Nov 2019 01:00:00 -0000",
            "description": "In this week's episode of Komando On Demand Insider Edition: Are you sick of those annoying robocalls? Your carrier has ways to shut them down. Kim talks with a pro hacker who made $600K last year working 5 to 10 hours a week. If you're looking for a job, there's something employers are looking at much harder than your resume. Plus, don't miss this week's tech trivia.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/chtbl.com/track/28E15G/traffic.megaphone.fm/WSMM5758597750.mp3"
        },
        {
            "title": "Travel back in time online with Wayback and Internet Archive founder",
            "datePublished": "Wed, 30 Oct 2019 01:00:00 -0000",
            "description": "Meet Brewster Kahle, founder of the Wayback Machine and Archive.org, a free online digital library that's been archiving web pages since the mid-1990s. After earning a fortune selling technologies to AOL and Amazon, Kahle set out on a mission to create an archive of web content so anyone can access it free and without barriers.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/chtbl.com/track/28E15G/traffic.megaphone.fm/WSMM1996734215.mp3"
        },
        {
            "title": "Holiday movie checklist, brain implant restores sight, gadgets to modernize older cars",
            "datePublished": "Fri, 25 Oct 2019 01:00:00 -0000",
            "description": "The holidays are fast approaching. Get in the spirit with the Hallmark Channel's Christmas movie checklist. Kim talks with a man whose sight was restored thanks to a groundbreaking brain implant. Plus, new cars come packed with high-tech features, but what if you drive an older model? No problem. Check out these 6 gadgets to modernize your ride.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/chtbl.com/track/28E15G/traffic.megaphone.fm/WSMM8604765702.mp3"
        },
        {
            "title": "Virtual reality is changing the world - Are we ready?",
            "datePublished": "Wed, 23 Oct 2019 01:00:00 -0000",
            "description": "Though most commonly used for playing games, there are so many more productive aspects to virtual reality and augmented reality that you may not be aware of. From real estate to education, virtual reality technology is changing the world. In this episode of Komando on Demand, Kim looks at the technology behind virtual and augmented reality and how it's shaping the reality around us.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/chtbl.com/track/28E15G/traffic.megaphone.fm/WSMM3211186683.mp3"
        },
        {
            "title": "Documentary maker shares online harassment stories, using robots to get the perfect photo, parents sue over addictive Fortnite",
            "datePublished": "Fri, 18 Oct 2019 01:00:00 -0000",
            "description": "Hundreds of parents in Canada are preparing to take legal action against the producers of Fortnite. Why? Their kids are addicted. Kim talks to director of \"Netizens,\" a documentary about women and online harassment. She shares three stories from the film. And gone are the days just hoping for the right shot. Photographer and visual engineer Steve Giralt uses top-of-the-line cameras, lights and a $150,000 robot to create picture-perfect images and videos.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/chtbl.com/track/28E15G/traffic.megaphone.fm/WSMM4755638638.mp3"
        },
        {
            "title": "Cybersecurity tips from a retired FBI agent",
            "datePublished": "Wed, 16 Oct 2019 01:00:00 -0000",
            "description": "Whether it's a data leak or a data breach, it seems your private information is getting passed around (and into the wrong hands) every day. In this episode of Komando on Demand, guest host and renowned attorney Steven Teppler talks to retired FBI special agent Lawrence Wolfenden, a cybersecurity and privacy expert, about his experiences with electronic privacy issues as well as what the government can and can't do when it comes to protecting our privacy.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/chtbl.com/track/28E15G/traffic.megaphone.fm/WSMM8010792178.mp3"
        },
        {
            "title": "8 ways you're ruining your PC, trick to faster Wi-Fi, turn your hobbies into extra cash",
            "datePublished": "Fri, 11 Oct 2019 01:00:00 -0000",
            "description": "Struggling with slow Wi-Fi? Here's a way to boost your signal and get the speed you pay for. Learn 8 bad tech habits that are ruining your Windows computer, and Kim chats with a woman who turned a hobby into a side hustle. Plus, reviews are big business online, and it's easy to get fooled by fakes. Learn how to spot those you can trust from the rest.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/chtbl.com/track/28E15G/traffic.megaphone.fm/WSMM5404781156.mp3"
        },
        {
            "title": "How to get a high-tech workspace without spending a dime",
            "datePublished": "Tue, 08 Oct 2019 23:40:51 -0000",
            "description": "Where can you go to gain access to technology, workspace, educational materials, entertainment and even help getting a job? Your local library offers that and so much more, for free. In this episode of Komando on Demand, Kim explores how local libraries are evolving to meet the public's needs and talks to students, teachers and library staff on what the future holds for libraries.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/chtbl.com/track/28E15G/traffic.megaphone.fm/WSMM4798550445.mp3"
        },
        {
            "title": "Tricks of a private investigator, 4 Netflix hacks, free alternatives to Photoshop",
            "datePublished": "Fri, 04 Oct 2019 01:00:00 -0000",
            "description": "Ever wonder how private investigators track down info? Kim talks to PI Rich Robertson about how he uses technology to find people. Netflix feeling a little stale? Get 4 hacks for getting more out of the streaming mainstay. Plus, you want to edit your photos like a pro, but Photoshop is too pricey. Check out these 5 free alternatives instead.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/chtbl.com/track/28E15G/traffic.megaphone.fm/WSMM7842140747.mp3"
        },
        {
            "title": "Keep your eyes on the road: Dangers of distracted driving",
            "datePublished": "Wed, 02 Oct 2019 01:00:00 -0000",
            "description": "Each time you hop into your car, you're taking your life in your hands. Do you realize how distracted other drivers around you are? Seconds are all it takes for things to go horribly wrong. On this episode of Komando On Demand, Kim takes a deeper look at the dangers of distracted driving and the importance you play in making the streets safer for yourself and other drivers.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/chtbl.com/track/28E15G/traffic.megaphone.fm/WSMM4556364478.mp3"
        },
        {
            "title": "Your TV is spying, tech to catch bad neighbors, 8 bad online habits",
            "datePublished": "Fri, 27 Sep 2019 01:00:00 -0000",
            "description": "A new study shows exactly what your TV knows about you ⁠— and it's a lot. Sick of your neighbors not cleaning up after their pets? This company is using DNA to catch lazy dogs owners. Find out 8 habits that leave you exposed online, and learn how to file for a $100 claim from Yahoo if you were impacted in its massive data breach.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/chtbl.com/track/28E15G/traffic.megaphone.fm/WSMM9888490451.mp3"
        },
        {
            "title": "Digital signs your significant other is cheating",
            "datePublished": "Wed, 25 Sep 2019 01:00:00 -0000",
            "description": "Late nights at work, texting more often and other suspicious behaviors from a spouse are telltale signs they might be cheating. Is it an affair or is it something else? In this episode of Komando on Demand, Kim shows you technology to help you find out if your spouse is fooling around. You’ll hear from award-winning author, educator and private investigator Larry Kaye about the ethics of investigating a spouse or significant other.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/chtbl.com/track/28E15G/traffic.megaphone.fm/WSMM1653704004.mp3"
        },
        {
            "title": "Amazon's stupid decision, tips from the Contest Queen, 7 apps for forgetful people",
            "datePublished": "Fri, 20 Sep 2019 01:00:00 -0000",
            "description": "Amazon has a new, but dumb, plan to help Alexa next time you ask a tough question. Feeling forgetful? These apps will help keep you organized, remind you to pay your bills on time and more. Kim talks with the Contest Queen, Carolyn Wilman, who has won more than $250,000 in prizes from contests and sweepstakes. Plus, meet an engineer who makes big money developing Alexa skills.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/chtbl.com/track/28E15G/traffic.megaphone.fm/WSMM3139333899.mp3"
        },
        {
            "title": "Medical dangers: The threats to connected devices",
            "datePublished": "Thu, 19 Sep 2019 01:00:00 -0000",
            "description": "Medical devices keep your body healthy, but the scary reality is they're also becoming a security concern. From pacemakers to hospital equipment, hackers can compromise anything that connects wirelessly. In this episode of Komando on Demand, Kim looks into the myths and realities of medical device hacking and security. Learn about the very real risks and what's being done to make devices and hospitals safer.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/chtbl.com/track/28E15G/traffic.megaphone.fm/WSMM4687616596.mp3"
        },
        {
            "title": "Apple's new iPhone 11, online safety tips from a hacker, 20 ways to make money online",
            "datePublished": "Fri, 13 Sep 2019 01:00:00 -0000",
            "description": "Apple unveiled its new fall product lineup, including the iPhone 11, and Kim answers your top 5 questions. Amazon's relationship with local police forces is growing through the Ring doorbell video network, and it could impact your privacy. Meet a white-hat hacker who shows Kim just how easy it is to fall victim to a phishing scam ⁠— and she's got the pro tips on how to stay safe. Plus, a startup CEO fighting crime in neighborhoods across the country. And 20 ways to make extra cash online, on your schedu",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/chtbl.com/track/28E15G/traffic.megaphone.fm/WSMM9433233462.mp3"
        },
        {
            "title": "Keeping your data safe in a dangerous digital world",
            "datePublished": "Fri, 06 Sep 2019 01:00:00 -0000",
            "description": "There's a new data breach around every corner, and hackers are fighting to get their hands on your personal information. The one way to protect yourself is with a VPN, or virtual private network. Kim talks with Harold Li, Vice President at ExpressVPN, about the importance of having a VPN to keep you protected and secure in this dangerous digital world.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/chtbl.com/track/28E15G/traffic.megaphone.fm/WSMM1210915641.mp3"
        },
        {
            "title": "The clever way hackers can hijack your phone and steal your info",
            "datePublished": "Fri, 30 Aug 2019 01:00:00 -0000",
            "description": "Think about how much of your private info lives inside your phone. And with a clever trick, hackers can access all of it. In this episode of Komando on Demand, Kim explores the serious threat of hijacking smartphones and how cybercriminals can ruin your life. She talks with an ethical hacker about what you can do to safeguard your device.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/chtbl.com/track/28E15G/traffic.megaphone.fm/WSMM3656037564.mp3"
        },
        {
            "title": "Avoid work-from-home scams and make money with legitimate jobs",
            "datePublished": "Fri, 23 Aug 2019 01:00:00 -0000",
            "description": "You see work-from-home ads everywhere, from roadside posters to online pop-up ads. Are they a legitimate way to make money? The answer is complicated. In this episode of Komando on Demand, Kim takes a look at work-at-home scams and horror stories about honest people who just wanted to earn a little extra cash. Listen and learn from their mistakes.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/chtbl.com/track/28E15G/traffic.megaphone.fm/WSMM9120032316.mp3"
        },
        {
            "title": "The Gig Economy: Short-term, temporary ways to make a quick buck",
            "datePublished": "Fri, 16 Aug 2019 16:34:57 -0000",
            "description": "Looking to make an extra buck? In the Gig Economy, earning money isn't just about the 9-to-5 grind. Tech is changing the landscape of earning, for both employers and workers. In this episode of Komando on Demand, Kim takes a look at how people are making a quick buck on sites like Wonolo, Bellhops, Doordash and others — and talks to Randi Himelfarb, a video editor thriving in the Gig Economy.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/chtbl.com/track/28E15G/traffic.megaphone.fm/WSMM9347691562.mp3"
        },
        {
            "title": "Online reputation: What to do when someone tries to destroy yours",
            "datePublished": "Fri, 09 Aug 2019 01:00:00 -0000",
            "description": "What if a complete stranger, or even worse someone you trust, decides to ruin your life? How easy would it be for them to destroy your career, credibility and social life? In this episode, Kim looks at the maliciousness of destroying someone online. Kim talks to a former cyberbully as well as Shannon Wilkinson, Founder and CEO of Reputation Communications, to find solutions for this problem.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/chtbl.com/track/28E15G/traffic.megaphone.fm/WSMM6317798678.mp3"
        },
        {
            "title": "How gamers are earning millions through esports",
            "datePublished": "Fri, 02 Aug 2019 01:00:00 -0000",
            "description": "Gamers are making thousands and even millions of dollars per year, making esports a proven career option, but it's not an easy way to earn a living. Kim dives into what you need to know to succeed as a pro gamer, straight from today’s top players and nerd culture journalist Jessica Roar.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/chtbl.com/track/28E15G/traffic.megaphone.fm/WSMM1627906340.mp3"
        },
        {
            "title": "Hidden cameras are watching: Privacy in the digital age",
            "datePublished": "Fri, 26 Jul 2019 01:00:00 -0000",
            "description": "Hidden cameras are everywhere, and if you're concerned about your privacy on vacation ... you should be. More and more travelers are finding cameras in rentals and hotels — often hidden in unexpected places. Kim shares why spy cameras have become so commonplace, how to spot them, and what to do if you've been recorded without your say.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/chtbl.com/track/28E15G/traffic.megaphone.fm/WSMM1257957071.mp3"
        },
        {
            "title": "Is technology stealing our ability to think critically?",
            "datePublished": "Fri, 19 Jul 2019 01:00:00 -0000",
            "description": "Technology gives us access to more knowledge than ever, but is it also dumbing us down? Think about how often you turn to the internet to answer your questions or solve your problems. Could that dependence on tech inhibit us from thinking critically and making decisions? Kim talks with experts about technology, psychology and the changing definition of intelligence.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/chtbl.com/track/28E15G/traffic.megaphone.fm/WSMM7984006440.mp3"
        },
        {
            "title": "Travel tips: Don't get hacked, scammed or tracked",
            "datePublished": "Fri, 12 Jul 2019 01:00:00 -0000",
            "description": "Whether you're traveling for business or pleasure, you're a prime target for hackers, scammers and identity theft. Learn crucial safety practices to protect your wallet, privacy, bank account and home. In this episode, you'll get useful, actionable tips and tricks to stay safe.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/chtbl.com/track/28E15G/traffic.megaphone.fm/WSMM5039750911.mp3"
        },
        {
            "title": "Say goodbye to security lines with the latest airport tech",
            "datePublished": "Fri, 05 Jul 2019 01:00:00 -0000",
            "description": "Travel can be stressful, and waiting in long lines and struggling through security isn't a great start to any summer getaway. But airports are getting major upgrades to help travelers navigate terminals more efficiently. In this episode of Komando on Demand, Kim looks at how airports are trying to ease the burden on travelers.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/chtbl.com/track/28E15G/traffic.megaphone.fm/WSMM4993542571.mp3"
        },
        {
            "title": "Finding the irreplaceable: Lost photos making their way home",
            "datePublished": "Fri, 28 Jun 2019 01:00:00 -0000",
            "description": "Photos tell the story of who we are, what we see and how we see it. Here are some heartwarming tales of photos lost then found — sometimes years later — thanks to social media. Kim explores how photos shape us and why finding lost pictures can mean so much.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/chtbl.com/track/28E15G/traffic.megaphone.fm/WSMM4044990624.mp3"
        },
        {
            "title": "Internet addiction: How Facebook and Instagram keep you hooked",
            "datePublished": "Fri, 21 Jun 2019 01:00:00 -0000",
            "description": "Internet addiction destroys relationships, families, finances, futures and entire lives. How do addicts get hooked? It starts with carefully crafted techniques websites and apps use to keep you coming back again and again. We dive in to how these patterns work and how to break them once and for all.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/chtbl.com/track/28E15G/traffic.megaphone.fm/WSMM9061695744.mp3"
        },
        {
            "title": "Workplace of the future: Employees get microchipped",
            "datePublished": "Fri, 14 Jun 2019 01:00:00 -0000",
            "description": "Why would any employee want to be microchipped? Would you do it? Some see microchipping as the next logical step in employee security and efficiency. Others see it as an invasion of privacy like the classic novel \"1984\" where Big Brother watches you 24/7. Kim explains the technology behind embedding RFID microchips in our bodies, how some employers in Sweden are already doing it, and how this technology works.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/chtbl.com/track/28E15G/traffic.megaphone.fm/WSMM5466718250.mp3"
        },
        {
            "title": "Why YouTube's problem with child predators is hard to fix  ",
            "datePublished": "Thu, 06 Jun 2019 23:39:09 -0000",
            "description": "There is a disturbing movement on YouTube that targets young children. Renowned psychologist Dr. Christine Davidson joins Kim Komando to talk about Elsagate. Listen to this fascinating conversation and learn how to protect children from adult content that's disguised as safe for kids. Dr. Davidson is the founder of Davidson Learning Center and DrDavidson.com. She specializes in education for autistic children, a population that is especially vulnerable to disturbing online video content.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/chtbl.com/track/28E15G/traffic.megaphone.fm/WSMM9327660759.mp3"
        },
        {
            "title": "Tech stops high-speed chases-Get EDNA out of your car-Grow your social media following",
            "datePublished": "Fri, 31 May 2019 01:00:00 -0000",
            "description": "Will technology finally put a stop to lethal high-speed car chases? Is your car holding onto information that you might not want to share with others? If you want to grow your social media following, Kim has some advice. Plus, in our Digital Life Hack, Kim tackles the tough topic of divorce. Listen as Kim answers callers' questions and more.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/chtbl.com/track/28E15G/traffic.megaphone.fm/WSMM1150339638.mp3"
        },
        {
            "title": "Spying smart speakers -- Ads for anvils -- Using social media to grow a business ",
            "datePublished": "Thu, 23 May 2019 00:55:30 -0000",
            "description": "Are smart speakers spying on you? Is your smartphone targeting your ads based on your calls? Can you grow your business just by using social media? Listen the the answers for these questions and more.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/chtbl.com/track/28E15G/traffic.megaphone.fm/WSMM9566047090.mp3"
        },
        {
            "title": "Getting online overseas -- Funny sign goes viral on social media -- Alternatives to Gmail",
            "datePublished": "Fri, 17 May 2019 22:12:12 -0000",
            "description": "If you travel overseas and you need to get online, would you know what to do? Have you ever seen a road sign that made you laugh out loud? And what’s a better email option than Gmail? Listen in as Kim answers these questions and provides you with information and laughs.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/chtbl.com/track/28E15G/traffic.megaphone.fm/WSMM9203524620.mp3"
        },
        {
            "title": "Ransomware taking more hostages ",
            "datePublished": "Fri, 10 May 2019 01:00:00 -0000",
            "description": "The U.S. government’s Cybersecurity and Infrastructure Security Agency describes ransomware is a type of malware designed to deny access to a computer system or data until a ransom is paid. It typically spreads through phishing emails or by unknowingly visiting an infected website. Experts predict that ransomware attacks will cost businesses nearly $11 billion this year. Parham Eftekhari, executive director of the Institute for Critical Infrastructure Technology, says we can fight ransomware.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/chtbl.com/track/28E15G/traffic.megaphone.fm/WSMM6700754733.mp3"
        },
        {
            "title": "Can your smartphone cause cancer or ADHD?",
            "datePublished": "Fri, 03 May 2019 17:17:07 -0000",
            "description": "How many hours a day do you use your cellphone? How many wireless devices are in your home? Those devices emit radio frequency radiation. Scientists continue to study the effects of prolonged exposure to this type of radiation to see if they can cause cancer or ADHD in adults and children. Get some answers by listening to this podcast.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/chtbl.com/track/28E15G/traffic.megaphone.fm/WSMM9984940132.mp3"
        },
        {
            "title": "Technology helps lost cameras go home",
            "datePublished": "Sat, 27 Apr 2019 10:00:00 -0000",
            "description": "If you've ever lost anything of sentimental value, you'll relate to the stories in this podcast. You'll hear tales of lost cameras and valuable photos that were returned to their owners -- sometimes years later -- and how technology and social media reconnected them. ",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/chtbl.com/track/28E15G/traffic.megaphone.fm/WSMM4090685223.mp3"
        },
        {
            "title": "Who's spying on you?",
            "datePublished": "Sat, 13 Apr 2019 09:00:00 -0000",
            "description": "There was a time when tiny cameras brought to mind images of James Bond. But these cameras are now available to anyone who can afford them. And they are increasingly being used to spy on guests in hotel rooms and rental properties. Lawyer Marc Lamber says laws about the issue are murky. But don't despair. There are ways to protect yourself.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/chtbl.com/track/28E15G/traffic.megaphone.fm/WSMM7242306203.mp3"
        },
        {
            "title": "Ex-director of FBI, CIA takes on a phone scammer",
            "datePublished": "Fri, 12 Apr 2019 01:00:00 -0000",
            "description": "Robocalls and phone scammers are getting worse. Most are merely annoying but some can be terrifying, like the scammer who threatened to kill Lynda and William Webster.  Webster's name may sound familiar: He's the former head of the FBI and CIA. Plus hear some creative and hilarious ways people are getting even with robocalls, and learn tips you can use today.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/chtbl.com/track/28E15G/traffic.megaphone.fm/WSMM3513989445.mp3"
        },
        {
            "title": "New list: Worst companies for data privacy",
            "datePublished": "Wed, 10 Apr 2019 01:00:00 -0000",
            "description": "A Texas-based tech company launched a new system that rates websites that collect your personal data. They've recently published their \"data privacy misleaders board\" -- a list no company wants their website to be on. Who's on it? Osano CEO and co-founder Arlo Gilbert talks about the companies that are the best and worst at collecting and sharing your personal information.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/chtbl.com/track/28E15G/traffic.megaphone.fm/WSMM4910533609.mp3"
        },
        {
            "title": "Social media tracks your every online move",
            "datePublished": "Sat, 06 Apr 2019 10:00:00 -0000",
            "description": "Did you know there’s a link between liking curly fries and your intelligence? According to social media algorithms there is. When you click a link, like a page or friend another person, you’re giving away valuable information. Researchers use data from hundreds of thousands of people looking for subtle patterns to find out details about you and track you. What they do with the results could determine your future.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/chtbl.com/track/28E15G/traffic.megaphone.fm/WSMM7616892556.mp3"
        },
        {
            "title": "How clinical trials can help beat cancer",
            "datePublished": "Fri, 05 Apr 2019 01:00:00 -0000",
            "description": "Clinical trials help doctors test medications on real patients. Successful clinical trials have helped patients beat cancer and added more years of quality life. If you're interested in clinical trials, listen as Dr. David Fogleman of M.D. Anderson Cancer Center explains how clinical trials work.Anderson Cancer Center provides answers.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/chtbl.com/track/28E15G/traffic.megaphone.fm/WSMM8874065637.mp3"
        },
        {
            "title": "Break through the noise and market your business on social media",
            "datePublished": "Wed, 03 Apr 2019 01:00:00 -0000",
            "description": "Whether you work for a Fortune 500 company, a small mom-and-pop shop, or act as a \"solo-preneur,\" you need to market your business online. With so many digital channels, where do you get the most bang for your digital marketing buck? We talk to Jeremy Wood of Hootsuite about using social media to connect with your audience. And Mike Huber of Vertical Measures tells us about using social media to build an \"owned\" audience. Is there some magical formula that works? Listen to this conversation and find out.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/chtbl.com/track/28E15G/traffic.megaphone.fm/WSMM8179085010.mp3"
        },
        {
            "title": "To 'Digital Nomads' the world is their office",
            "datePublished": "Sat, 30 Mar 2019 19:46:45 -0000",
            "description": "Imagine ridding yourself of all but the most essential items to travel and live around the world, while still running a business. Digital devices make such a lifestyle possible. Listen as one American couple talks about the exhilaration of leaving most of their possessions behind to live and work as \"Digital Nomads.\" But, as you'll hear, it's not all fun and games. It takes a lot of work to make it work.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/chtbl.com/track/28E15G/traffic.megaphone.fm/WSMM5237441169.mp3"
        },
        {
            "title": "Apps and safety tips from an online dating pro: ‘Stop with the bathroom selfies’",
            "datePublished": "Fri, 29 Mar 2019 01:00:00 -0000",
            "description": "Online dating expert and ghostwriter Meredith Golden, the founder of SpoonMeetSpoon.com, offers tips to choose the best dating apps that fit your lifestyle. We put our own Mike James in the hot seat, and Meredith helps him improve his online dating profile (Spoiler alert: He’s doing it all wrong). Find out the do’s and don’ts of creating a great dating profile. If you or someone you know is looking for love, you do not want to miss this conversation.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/chtbl.com/track/28E15G/traffic.megaphone.fm/WSMM4826721900.mp3"
        },
        {
            "title": "'AI is like fire' — and it's spreading",
            "datePublished": "Wed, 27 Mar 2019 01:00:00 -0000",
            "description": "Yep, those sci-fi movies and shows like \"Blade Runner\" and \"Westworld\" about robots imbued with enough A.I. to make them seem human are developing at a rapid pace. Kim talks to Ryan Steelberg, president of Veritone, a leading provider of artificial intelligence technology and solutions, about how robots are becoming less fantastical. Ryan describes how one man in Great Britain has his \"companion\" robot sit with this family at mealtimes. You don’t want to miss this conversation.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/chtbl.com/track/28E15G/traffic.megaphone.fm/WSMM6466030636.mp3"
        },
        {
            "title": "DIY DNA: Are the results accurate?",
            "datePublished": "Fri, 22 Mar 2019 01:00:00 -0000",
            "description": "As many as 26 million people may have taken an at-home DNA test. If you're thinking of taking one, you have to prepare yourself for the results. You may discover things about your family tree that you didn't want to know. On the other hand, the results could yield a pleasant surprise. But how accurate are the results? Listen as Kim explores the world of at-home DNA testing with Lindsay Groves, senior product specialist at 23AndMe, and Robert Bennett, a forensic toxicologist and DNA scientist.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/chtbl.com/track/28E15G/traffic.megaphone.fm/WSMM5496577225.mp3"
        },
        {
            "title": "Don't (completely) fear the tax man",
            "datePublished": "Wed, 20 Mar 2019 01:00:00 -0000",
            "description": "Tax season is scary, especially this year with the new codes. Meet accountant Howell Cheek with Sigrist, Cheek, Potter & Huyser who can talk about the philosophy of taxes dating as far back as Plato (but don’t worry, he doesn’t). Kim talks with Howell, who offers easy-to-understand, concise tips about medical and charitable deductions, as well as the increase in the standardized deduction. He also talks about which business-tech deductions have been eliminated and why. Howell breaks it all down for us.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/chtbl.com/track/28E15G/traffic.megaphone.fm/WSMM5023856804.mp3"
        },
        {
            "title": "Cyberwar: How the U.S. is under attack right now",
            "datePublished": "Fri, 15 Mar 2019 01:00:00 -0000",
            "description": "In today’s quickly changing world, war is no longer defined by bullets, bombs, and bloodshed. There isn’t even an enemy you can always identify. It’s called Cyberwar. The United States is under attack right now. No one knows exactly where some of the attacks are coming from. Listen for proof of these attacks and how they could lead to a much bigger war in the near future.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/chtbl.com/track/28E15G/traffic.megaphone.fm/WSMM7388311415.mp3"
        },
        {
            "title": "Are robots taking over pilots' jobs?",
            "datePublished": "Wed, 13 Mar 2019 01:00:00 -0000",
            "description": "Consider this: A robot might be flying your next flight home. Will you want to be on that flight? We talk to Jeremy Straub, Assistant Professor in the Department of Computer Science at North Dakota University, who talks about his findings and what we should expect in the future. Kim also talks to Stephen Lapoint, former instructor and pilot with the United States Air Force and veteran pilot of American Airlines for almost 20 years to get his perspective on robots replacing human pilots. ",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/chtbl.com/track/28E15G/traffic.megaphone.fm/WSMM6805053843.mp3"
        },
        {
            "title": "Is YouTube promoting sex, drugs and violence to your kids?",
            "datePublished": "Fri, 08 Mar 2019 01:00:00 -0000",
            "description": "There is a disturbing movement on YouTube that targets young children. Renowned psychologist Dr. Christine Davidson joins Kim Komando to talk about Elsagate. Listen to this fascinating conversation and learn how to protect children from adult content that's disguised as safe for kids. Dr. Davidson is founder of Davidson Learning Center and DrDavidson.com. She specializes in education for autistic children, a population that is especially vulnerable to disturbing online video content.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/chtbl.com/track/28E15G/traffic.megaphone.fm/WSMM3813530343.mp3"
        },
        {
            "title": "Smart home tips from a guy who did it and lived to tell",
            "datePublished": "Wed, 06 Mar 2019 01:05:00 -0000",
            "description": "You've decided to upgrade your home to a smart home but, where do you start? Should you use an Amazon Alexa, Google Home or Apple Home Pod to connect your devices? Kim and her cohost Andrew Babinski talk about the latest trends in smart home tech, and Andrew shares the trial and error he went through when he started \"smartifying\" his home. They also talk about some pretty weird smart tech like smart diapers, smart toothbrushes, coffee makers, and… Jim Beam? Kim and Andrew break it all down.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/chtbl.com/track/28E15G/traffic.megaphone.fm/WSMM5290421906.mp3"
        },
        {
            "title": "Facebook's fake-news fact-check fail",
            "datePublished": "Fri, 01 Mar 2019 01:00:00 -0000",
            "description": "What’s real? What’s fake? Facebook’s AI algorithms can’t answer these questions, so it hired outside firms to do it. These human “content moderators” decide what’s fake, real, satire, inappropriate and illegal. It’s not working. Hear from Brooke Binkwoski, former Facebook fact-checker, about the real story, and learn how Facebook’s content moderators watch the seedy side of life all day, so you don’t have to. BONUS: Listen for the secret password in this episode for a chance to win an En",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/chtbl.com/track/28E15G/traffic.megaphone.fm/WSMM8344798020.mp3"
        },
        {
            "title": "Digital smell technology could mean sending odors through virtual reality and the internet",
            "datePublished": "Wed, 27 Feb 2019 00:00:00 -0000",
            "description": "What if you could smell any odor during a movie you’re watching? Technology has focused on our sense of sight and sound. But what if you can sense, transmit, and receive smell through the internet? Technology like Smell-O-Vision is making a comeback in applications ranging from virtual reality to movie watching. Listen to what the future of your digital life holds for your nose. Will you love it or hate it?",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/chtbl.com/track/28E15G/traffic.megaphone.fm/WSMM2889798563.mp3"
        },
        {
            "title": "\"Internet of things\" connected cars will invade your privacy",
            "datePublished": "Fri, 22 Feb 2019 01:00:00 -0000",
            "description": "Cars have become part of the \"internet of things.\" They are connected to our devices, the internet as well as big tech companies. Car makers are taking advantage of this new technology to know as much about us as they can. Our cars will be able to track our behaviors, allow advertisers to send us targeted ads, and track our driving habits. What will your new car know about you? And more importantly, what does that mean to your privacy? Kim gives us an inside look at our future behind the wheel.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/chtbl.com/track/28E15G/traffic.megaphone.fm/WSMM7175898005.mp3"
        },
        {
            "title": "3 things that every Apple fan needs to know",
            "datePublished": "Wed, 20 Feb 2019 01:00:00 -0000",
            "description": "Every year we wait in anticipation to hear what new Apple products are coming. We talk to expert Rob Walch with Libsyn about the latest Apple rumor mill. Expect to see new AirPods with rumored health benefits, not to mention that men over 45 will particularly love them, and you won't believe why! You’ll hear about the new MacBook Pro, the 6K display, a service they are calling the \"Netflix of News\" and other new gadgets from Apple. Plus - we give advice on how to become a successful podcaster.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/chtbl.com/track/28E15G/traffic.megaphone.fm/WSMM4452162721.mp3"
        },
        {
            "title": "New radiation treatments give cancer patients a second chance at life",
            "datePublished": "Fri, 15 Feb 2019 01:00:00 -0000",
            "description": "Being diagnosed with cancer is one of the scariest things that can happen to a person. Thankfully, radiation treatments have come a long way. We talk with Dr. Cullen Taniguchi, radiation oncologist with MD Anderson Cancer Center, about the latest advancements in treating cancer with radiation, side effects and success rates. We uncover the unbelievable connection between the body temperature and the ability to heal. Listen to success stories of cancer patients who fought against the odds and recovered.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/chtbl.com/track/28E15G/traffic.megaphone.fm/WSMM3024654616.mp3"
        },
        {
            "title": "Privacy and data protection in the \"internet of things\" age",
            "datePublished": "Wed, 13 Feb 2019 01:00:00 -0000",
            "description": "The \"things\" in the internet of things are getting smarter: We have smartphones, smart light bulbs, smart appliances, smartwatches -- all connected through the internet. That’s cool and convenient, right? There's one big problem: They're designed to be connected, but not to be secure. We talk to Steven Teppler, a renowned privacy and cybersecurity attorney from Mandelbaum Salsburg, about how connected devices put people at risk for not only stolen data, but data we unwittingly share with big tech companie",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/chtbl.com/track/28E15G/traffic.megaphone.fm/WSMM4485669588.mp3"
        },
        {
            "title": "How downsizing brought a couple closer together than ever",
            "datePublished": "Fri, 08 Feb 2019 01:00:00 -0000",
            "description": "After retirement, Hal and Jackie decided to downsize, live in an RV and travel the country. What started out as a fun idea became a new lifestyle and the adventure of a lifetime. Their love grew stronger and they are now inseparable. Listen to their story, their day to day life on the road, and what they learned along the way.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/chtbl.com/track/28E15G/traffic.megaphone.fm/WSMM5469746730.mp3"
        },
        {
            "title": "Dark web crimes: Catching father-daughter drug dealers",
            "datePublished": "Wed, 06 Feb 2019 01:00:00 -0000",
            "description": "We take a peek into the dark web, where people can hire hit men, buy poison and hack your computer. Criminals lurk within the dark alleyways of the internet, trying to take advantage of you and those you love. We talk to former FBI special agent Lawrence Wolfenden and take you behind the scenes of true Dark Web crimes. Learn what went into tracking a father and daughter who sold Xanax disguised as organic fitness pills, and find out how they were caught and uncover the truth behind the Smiley Face Killers.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/chtbl.com/track/28E15G/traffic.megaphone.fm/WSMM2322009378.mp3"
        },
        {
            "title": "Can you get cancer from what you eat?",
            "datePublished": "Thu, 31 Jan 2019 21:59:24 -0000",
            "description": "What’s in your gut? We have been hearing so much about gut bacteria. Recent innovations in DNA research have helped doctors uncover the link between gut health and many diseases, including cancer. Kim talks with Dr. Cullen Taniguchi, a radiation oncologist with MD Anderson Cancer Center about the connection between gut health and cancer. Learn about your microbiome and how you can arm it to fight disease. BONUS: Listen for the secret password in this podcast for your chance to win an Amazon Echo Dot!",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/chtbl.com/track/28E15G/traffic.megaphone.fm/WSMM9067378463.mp3"
        },
        {
            "title": "Best apps to manage what you watch on TV",
            "datePublished": "Wed, 30 Jan 2019 01:00:00 -0000",
            "description": "Streaming services have completely changed the way we watch TV. Long gone are the days when new programs launch in the fall, run for 22 weeks, wrap in the spring and go into reruns over the summer. With networks, premium cable channels and streaming services producing original content, there’s no longer a set schedule. It's hard to keep track of when your favorite shows air. Kim and her co-host Mike James have five apps to help manage your binge watching so you don’t miss a thing.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/chtbl.com/track/28E15G/traffic.megaphone.fm/WSMM4741051288.mp3"
        },
        {
            "title": "Time travel the internet with Wayback and Internet Archive founder",
            "datePublished": "Fri, 25 Jan 2019 01:00:00 -0000",
            "description": "Join Kim as she talks with Brewster Kahle, founder of the Wayback Machine and Archive.org, a free online digital library that has been archiving web pages since the mid-1990s. After earning a fortune by selling technologies to AOL and Amazon, Kahle set out on a mission to create an archive of web content. Hear about his goal to create the world's largest free online public library, and find out how you can contribute your family's history to the archive of the internet.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/chtbl.com/track/28E15G/traffic.megaphone.fm/WSMM6057729248.mp3"
        },
        {
            "title": "Best Google search alternatives",
            "datePublished": "Wed, 23 Jan 2019 01:00:00 -0000",
            "description": "Google has become the go to search site but have you ever googled a word only to be bombarded by targeted ads and links that had nothing to do with your question? In this podcast, we will share with you alternatives to Google that will give you the desired results. Whether you’re looking for movies to stream or fabulous photos from space, and anything in between. These browsers will give you less ads, and in many cases, won’t track you like Google does!",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/chtbl.com/track/28E15G/traffic.megaphone.fm/WSMM3150574691.mp3"
        },
        {
            "title": "Make 30% more in revenue using this secret strategy",
            "datePublished": "Fri, 18 Jan 2019 01:00:00 -0000",
            "description": "We are all familiar with online display ads. They are those ads that jump at you when you are browsing a website. What you may not know, is how these ads end up on a particular page or why you are seeing them. Kim talks to specialist Heath Shaffer, owner of boutique AdOps firm NicheREV, for an insider scoop on everything that goes into the ads that you see, from advertisers who bid for the spot to the details that go into serving the ad on the website, and most of all, how to make money as a publisher.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/chtbl.com/track/28E15G/traffic.megaphone.fm/WSMM5140097547.mp3"
        },
        {
            "title": "Apps that are tracking you and stealing your data",
            "datePublished": "Wed, 16 Jan 2019 01:00:00 -0000",
            "description": "Have you ever had an app ask you to access your phone's location? How about the app that wants access to your smartphone camera and contact list. It has become second nature to share this info with the app, but did you ever stop to think: where does all this data go? Our lives are being tracked and sold to companies. In this podcast you will learn who is tracking you, how they can get to your personal information and most importantly where your data is being sent.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/chtbl.com/track/28E15G/traffic.megaphone.fm/WSMM1456338602.mp3"
        },
        {
            "title": "Morning routines of the super successful",
            "datePublished": "Fri, 11 Jan 2019 01:00:00 -0000",
            "description": "Do you know what the main key ingredient to success is? Habit! Get ready for some truly life-changing stories and tips from highly motivated movers and shakers. You'll learn from their habits how they stay on top of their game. We talk to VU Dream founder and podcaster Mark Metry as well as CEO and renowned attorney Joseph Harary about how they became successful and what they did to get there. By the end of this podcast, you'll be loaded with tools to guide you on your own transformation.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/chtbl.com/track/28E15G/traffic.megaphone.fm/WSMM8567215168.mp3"
        },
        {
            "title": "The rare and amazing events happening in space in 2019",
            "datePublished": "Wed, 09 Jan 2019 01:00:00 -0000",
            "description": "Solar & lunar eclipses, planetary flybys, and other rare events in space are making 2019 the year to look skyward. In this episode of Komando on Demand, Kim looks at all the cool things that are happening in the sky this year that can't be missed.  We talk to renowned astronomer Andrew Fraknoi, professor at the Fromm Institute for Lifelong Learning at San Francisco State University, about what specific events we will see in the sky this year and what's the best way to view them.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/chtbl.com/track/28E15G/traffic.megaphone.fm/WSMM2413610869.mp3"
        },
        {
            "title": "The tech that didn't make it to 2019",
            "datePublished": "Fri, 04 Jan 2019 01:00:00 -0000",
            "description": "2018 was an interesting year for tech. Between anxiety-inducing social network breaches and new forensic DNA databases to buggy mobile devices and killer driverless cars, it seems we've seen it all. But now that we are in 2019, what tech devices are we going to see this year? In this episode of Komando on Demand, Kim looks at the tech that did not make it in 2018 as well as what tech we might be seeing as we enter the new year.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/chtbl.com/track/28E15G/traffic.megaphone.fm/WSMM3716995444.mp3"
        },
        {
            "title": "What you need to know about the 5G revolution",
            "datePublished": "Wed, 02 Jan 2019 01:00:00 -0000",
            "description": "The future may get here faster than we think, as the world races toward 5G wireless technology. 5G will be faster, revolutionary and could even fight terrorism? This is much more than a just an upgrade; it could allow for driverless cars and smart cities. It will be unlike anything the world has seen before. Will this breakthrough come at a cost to your health, increasing the risk of disease and disorders? In this Komando on Demand podcast, Kim looks at why 5G is both astonishing and dangerous.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/chtbl.com/track/28E15G/traffic.megaphone.fm/WSMM3849231861.mp3"
        },
        {
            "title": "How the MP3 player revolutionized the world",
            "datePublished": "Fri, 28 Dec 2018 01:00:00 -0000",
            "description": "Vinyl records, cassettes, and CDs were once the staple for listening to music. Then, the invention of the MP3 player revolutionized the portable music industry and set the stage for the technology we have today. But when and where did the MP3 player get its start? In this episode of Komando on Demand, Kim looks at the history of music technology and how the MP3 player revolutionized how we listen to music, audiobooks, and so much more.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/chtbl.com/track/28E15G/traffic.megaphone.fm/WSMM4775891267.mp3"
        },
        {
            "title": "Can your smartphone really cause cancer or ADHD?",
            "datePublished": "Wed, 26 Dec 2018 01:00:00 -0000",
            "description": "They used to say smoking wasn't harmful to our health. Today, researchers and doctors are warning about radio frequency radiation which comes from our wireless technology, but are we listening? Don’t miss this Komando On Demand podcast as I talk to the researchers behind the film \"Generation Zapped,\" an eye-opening documentary about the health risks caused by RF frequencies such as brain cancer, ADHD, and other medical issues",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/chtbl.com/track/28E15G/traffic.megaphone.fm/WSMM7687315092.mp3"
        },
        {
            "title": "How to avoid work-at-home scams and make money with legitimate jobs",
            "datePublished": "Fri, 21 Dec 2018 01:00:00 -0000",
            "description": "Have you ever wanted to work a side job to make a little extra money from home? Maybe you've dreamed of leaving your current job to work full time from the comfort of your own home. Sounds good, but how do you differentiate between scams and legitimate money-making jobs? In this episode of Komando on Demand, Kim takes a hard look at work-at-home scams as well as work at home success stories. Kim also gives some tips and advice on how to tell whether that job offer is legitimate or a scam.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/chtbl.com/track/28E15G/traffic.megaphone.fm/WSMM2551220616.mp3"
        },
        {
            "title": "The Apple Watch Series 4 can detect A-Fib and save your life",
            "datePublished": "Fri, 14 Dec 2018 01:00:00 -0000",
            "description": "The Apple Watch was built with the intention of being a health and fitness gadget. Most wearable devices can take our pulse and measure our blood pressure. Apple took this to the next level when it introduced a new feature this year. In this episode of Komando on Demand, Kim takes a look at the new Apple Watch Series 4 and its new ability to take an ECG. But how reliable is it?",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/chtbl.com/track/28E15G/traffic.megaphone.fm/WSMM7218146617.mp3"
        },
        {
            "title": "Can meditation apps really help your body, mind and spirit? Here’s the science.",
            "datePublished": "Wed, 12 Dec 2018 01:00:00 -0000",
            "description": "Trouble sleeping? Anxious? Depressed? You’re not alone. What if the relief you needed was right at your fingertips? Mobile meditation apps have been popping up and many are turning to them for relief. But are they really worthwhile and effective? In this Komando On Demand podcast, Kim will share some valuable insight to decide whether these apps are worth checking out - and why.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/chtbl.com/track/28E15G/traffic.megaphone.fm/WSMM9638255754.mp3"
        },
        {
            "title": "Back from the dead - Hollywood spends major cash to resurrect entertainers for movies and concerts",
            "datePublished": "Fri, 07 Dec 2018 01:00:00 -0000",
            "description": "The entertainment industry is spending millions to resurrect dead celebrities using sophisticated digital technology that will ensure that iconic figures like Michael Jackson, Carrie Fisher and Audrey Hepburn live on forever. Could this technology replace real life actors? And what are the moral ramifications of this amazing technology? In this Komando on Demand podcast, Kim speaks with some of the digital wizards who work major movie magic to bring deceased actors and entertainers back to the big screen.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/chtbl.com/track/28E15G/traffic.megaphone.fm/WSMM4926394059.mp3"
        },
        {
            "title": "Is Google making us dumb or making us smarter?",
            "datePublished": "Wed, 05 Dec 2018 01:00:00 -0000",
            "description": "How often do you turn to the internet for answers about health concerns, creating travel plans, where to eat, and directions to get there? If your answer is \"All the time,\" you're not alone. But could our dependence on tech be inhibiting us from thinking critically and making decisions? While the jury is out about whether or not our tech is really dumbing us down, there might be some evidence that we are relying on tech to perform things that used to define us as uniquely human.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/chtbl.com/track/28E15G/traffic.megaphone.fm/WSMM7620406433.mp3"
        },
        {
            "title": "Forensic genealogy - From finding a blood relative to solving a shocking crime",
            "datePublished": "Fri, 30 Nov 2018 01:00:00 -0000",
            "description": "Forensic DNA analysis has been used by law enforcement for years to help solve some of the biggest crimes. But with the rise of DNA analysis and forensic genealogy companies such as 23andMe, Ancestry, and Genomelink, some ethical questions must be answered. In this episode of Komando on Demand, Kim explores how law enforcement uses forensic DNA analysis to solve notorious criminal cases as well as the ethics and privacy issues of DNA data banks.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/chtbl.com/track/28E15G/traffic.megaphone.fm/WSMM1567501455.mp3"
        },
        {
            "title": "Go inside the world of child sex trafficking, abduction, and hate group recruiting",
            "datePublished": "Wed, 28 Nov 2018 01:00:00 -0000",
            "description": "Kids run away in search of love only to be held captive by sex traffickers, hate groups, and terrorists. Every 40 seconds, a child goes missing in the United States. Learn how innocent-looking apps and recruiters are luring our kids in this can’t miss Komando on Demand episode. It might just save a life.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/chtbl.com/track/28E15G/traffic.megaphone.fm/WSMM3152663048.mp3"
        },
        {
            "title": "The technology that will shape our future",
            "datePublished": "Wed, 21 Nov 2018 16:52:21 -0000",
            "description": "How will technology shape our future? There is no doubt that automation will evolve and life will change. Technology will have a profound effect on what’s ahead in the coming years. We can barely keep up with the pace at which it is expanding. So what will our lives be like in the future? In this episode of Komando on Demand, Kim looks at a list of technologies that are shaping our future and how they will impact our daily lives.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/chtbl.com/track/28E15G/traffic.megaphone.fm/WSMM6948358813.mp3"
        },
        {
            "title": "How virtual reality is making us smarter, faster, and more efficient",
            "datePublished": "Tue, 20 Nov 2018 23:00:00 -0000",
            "description": "Though most commonly used for playing games, there are so many more productive aspects to virtual reality and augmented reality that you may not be aware of. From real estate to education, virtual reality technology is changing the world. Are we ready? In this episode of Komando on Demand, Kim looks at the technology behind virtual and augmented reality and how it is shaping the reality around us.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/chtbl.com/track/28E15G/traffic.megaphone.fm/WSMM7512081587.mp3"
        },
        {
            "title": "The best Black Friday and Cyber Monday deals on 4K TVs, computers, smartphones, smart speakers, and more",
            "datePublished": "Fri, 16 Nov 2018 01:00:00 -0000",
            "description": "Shopping on Black Friday and Cyber Monday means getting the best deals on the latest tech like laptops, televisions, tablets, smartphones, and so much more. In this episode of Komando on Demand, Kim shares insider secrets on scoring the best deals you can get your hands on during the biggest shopping days of the year. Kim talks to retail and shopping expert Sarah Hollenbeck from blackfriday.com about some of the best deals from Best Buy, Amazon, Target, Walmart, Kohl's, Macy's, and other retailers.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/chtbl.com/track/28E15G/traffic.megaphone.fm/WSMM6817413612.mp3"
        },
        {
            "title": "Medical device hacking and the vulnerability of connected medical devices ",
            "datePublished": "Wed, 14 Nov 2018 01:00:00 -0000",
            "description": "Hacked medical devices are quickly becoming a top security threat. From pacemakers to hospital equipment, anything that connects wirelessly can be compromised. In this episode of Komando on Demand, Kim looks into the myths and realities of medical device hacking and security. Kim talks to Christian Espinosa, a cybersecurity professor at Maryville University and CEO of Alpine Security, about medical device security and what's being done to make devices and hospitals more secure. ",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/chtbl.com/track/28E15G/traffic.megaphone.fm/WSMM5110090905.mp3"
        },
        {
            "title": "Tired of the TSA lines? Airport tech is the wave of the future",
            "datePublished": "Fri, 09 Nov 2018 01:00:00 -0000",
            "description": "Are you dreading holiday travel this year? From mile-long security lines to taking off shoes and going through humiliating security scanners, holiday travel can be stressful. But, airports are getting major upgrades that will help travelers navigate the terminal more efficiently. In this episode of Komando on Demand, Kim looks at how airports are trying to make things easier on travelers in order to alleviate stress during the holidays. ",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/chtbl.com/track/28E15G/traffic.megaphone.fm/WSMM1155196013.mp3"
        },
        {
            "title": "How video gamers are making millions",
            "datePublished": "Wed, 07 Nov 2018 01:00:00 -0000",
            "description": "Want to make a living playing video games? You can possibly make thousands or even millions, but it’s not easy money. Esports is now a proven career option, but do you have what it takes to get in the game? In this episode of Komando on Demand, Kim looks at everything you need to know about how to succeed at being a professional gamer, straight from today’s top players and nerd culture journalist Jessica Roar.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/chtbl.com/track/28E15G/traffic.megaphone.fm/WSMM2519985916.mp3"
        },
        {
            "title": "Who’s watching you? The threat of hidden cameras in the digital age",
            "datePublished": "Fri, 02 Nov 2018 01:00:00 -0000",
            "description": "In this digital age, hidden surveillance is everywhere and if you've ever felt watched in the past, odds are you probably were. From Airbnb to a house of worship, hidden cameras are everywhere. In this episode of Komando on Demand, Kim looks at how hidden spy cameras have become so prevalent in our society and how technology has enabled these cameras to be placed anywhere. Kim also gives tips and advice on how to protect yourself from hidden cameras.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/chtbl.com/track/28E15G/traffic.megaphone.fm/WSMM8748793677.mp3"
        },
        {
            "title": "Apple iOS 12 and what you need to know about Apple's latest operating system",
            "datePublished": "Mon, 29 Oct 2018 21:39:41 -0000",
            "description": "Whether you are buying a new iPhone XS, XR, or XS Max or you are upgrading the system on your current iPhone, there are a lot of new features to Apple iOS 12. In this episode of Komando on Demand, Kim looks at the iOS 12 operating system's features and enhancements that differentiate it from previous iOS versions. Kim also talks to Rob Walch from the \"Today in iOS\" podcast about some hidden tips and tricks of iOS 12 you might not know about. ",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/chtbl.com/track/28E15G/traffic.megaphone.fm/WSMM8607196811.mp3"
        },
        {
            "title": "How to earn extra cash selling your domain name",
            "datePublished": "Fri, 26 Oct 2018 01:00:00 -0000",
            "description": "You've probably heard of flipping real estate and on the web, a domain name is a piece of digital real estate. Good website names are in high demand and people are selling domains and making big bucks. In this episode of Komando on Demand, Kim looks at the practice of selling website domain names and how people are making good money at doing it. Kim also talks to Asen Kehayov, an ethical hacker and founder of InForceCyber.com, about how to be safe when buying and selling domains.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/chtbl.com/track/28E15G/traffic.megaphone.fm/WSMM6023178628.mp3"
        },
        {
            "title": "Are employees getting microchip implants for convenience and security?",
            "datePublished": "Wed, 24 Oct 2018 02:00:00 -0000",
            "description": "Microchip implants are starting to increase in popularity, especially for employers microchipping their employees. But, is this the next step toward a frightening 1984, Big Brother society that many have warned us about for years? In this episode of Komando on Demand, Kim looks at the technology behind embedding RFID microchips in our bodies, how some employers in Sweden are already starting to microchip their employees as well as how this technology works.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/chtbl.com/track/28E15G/traffic.megaphone.fm/WSMM1511724969.mp3"
        },
        {
            "title": "Cancer:  How DNA detectives are cracking the case against the world’s most perplexing killer",
            "datePublished": "Fri, 19 Oct 2018 01:00:00 -0000",
            "description": "Unexplained cancer outbreaks are happening around the world. But here’s the mystery – why is the epidemic striking certain parts of the world, while others remain untouched? In this episode of Komando on Demand, Kim looks at how, with the latest technology, teams of \"DNA Detectives\" are discovering surprising clues in the fight to cure cancer. Kim talks to Dr. Cullen Taniguchi of the MD Anderson Cancer Center who shares crucial, new information about the progress of the fight against cancer.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/chtbl.com/track/28E15G/traffic.megaphone.fm/WSMM2090392567.mp3"
        },
        {
            "title": "Can the government protect your online privacy?",
            "datePublished": "Wed, 17 Oct 2018 01:00:00 -0000",
            "description": "It's Cyber Security Awareness Month, and whether it's a data leak or a data breach, it seems that your private information is getting passed around every day. In this episode of Komando on Demand, guest host and renowned attorney Steven Teppler talks to retired FBI special agent Lawrence Wolfenden, now a cybersecurity and privacy expert, about his experiences with electronic privacy issues during his career as well as what the government can and can't do when it comes to protecting our privacy.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/chtbl.com/track/28E15G/traffic.megaphone.fm/WSMM8202053194.mp3"
        },
        {
            "title": "Generation Deceived: The tech behind fake news",
            "datePublished": "Fri, 12 Oct 2018 01:00:00 -0000",
            "description": "It seems like every time we fire up the computer, we are bombarded with doctored images, fake videos, false accusations, and outright lies. In this episode of Komando on Demand, Kim looks at the latest technology that people are using to generate fake news and how to spot it. Kim talks to filmmaker Charles Dutka about how fake videos and images are created as well as Adrienne Gonzales, owner of Go Fraud Me, who combats fake online fundraisers.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/chtbl.com/track/28E15G/traffic.megaphone.fm/WSMM8519221089.mp3"
        },
        {
            "title": "How to take advantage of the Gig Economy",
            "datePublished": "Wed, 10 Oct 2018 01:00:00 -0000",
            "description": "Looking for a way to make some extra money but find your time is limited? Many employers don't want to go through the hassle of hiring employees but still need people to meet specific needs. Enter the Gig Economy. In this episode of Komando on Demand, Kim takes a look at how people are making a quick buck on sites like Wonolo, Bellhops, Doordash and others. Kim talks to Randi Himelfarb, a video editor who is thriving in the Gig Economy.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/chtbl.com/track/28E15G/traffic.megaphone.fm/WSMM7307170514.mp3"
        },
        {
            "title": "Why businesses are leaving Facebook in droves",
            "datePublished": "Fri, 05 Oct 2018 01:00:00 -0000",
            "description": "Businesses are leaving Facebook in droves, but not for the reasons you may think. In this episode of Komando on Demand, you'll find out why Kim Komando, along with celebrities like Cher and businesses like Mozilla and Pep Boys are abandoning Facebook. Kim also talks about what you need to know about Facebook’s controversial new posting guidelines for businesses and gain fresh marketing ideas.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/chtbl.com/track/28E15G/traffic.megaphone.fm/WSMM9432054511.mp3"
        },
        {
            "title": "Location technology and GPS systems are tracking your every move",
            "datePublished": "Wed, 03 Oct 2018 01:00:00 -0000",
            "description": "It's a fact that if you own a cellphone, you're being tracked.  But have you ever wondered who is tracking you and how much they can actually see?  In this episode of Komando on Demand, Kim looks at who is spying on us and how, if possible, we can hide from them in order to maintain our data and privacy. Kim also talks to Richard Eilert, an expert in geolocation and geofencing and how your location means big bucks for companies.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/chtbl.com/track/28E15G/traffic.megaphone.fm/WSMM3650993631.mp3"
        },
        {
            "title": "Tech clues to catch a killer - Part 2",
            "datePublished": "Fri, 28 Sep 2018 01:00:00 -0000",
            "description": "You may or may not have heard of Kimberly Proctor, a teenage girl who was brutally murdered by 2 young boys. Following a trail of digital clues like texting, emailing and even a World of Warcraft chat room, police tracked down her killers. In this episode of Komando on Demand, Kim talks to retired FBI agent James Fitzgerald and linguistics professor Tim Grant at how digital forensics can help solve crimes.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/chtbl.com/track/28E15G/traffic.megaphone.fm/WSMM2821155328.mp3"
        },
        {
            "title": "The inside scoop on Amazon Go, the cashierless stores",
            "datePublished": "Wed, 26 Sep 2018 01:00:00 -0000",
            "description": "What if you could go into a store, grab what you want and leave? No lines, no waiting, no… cashiers? In this episode of Komando on Demand, Kim looks at Amazon Go, the future of shopping technology, and how AI and Algorithms are changing the way you shop. It looks like shopping in a brick-and-mortar store is going to rock again.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/chtbl.com/track/28E15G/traffic.megaphone.fm/WSMM2872062734.mp3"
        },
        {
            "title": "Tech clues to catch a killer - Part 1",
            "datePublished": "Fri, 21 Sep 2018 01:00:00 -0000",
            "description": "Gaming expert or mass murderer? In many cases, the two are closely linked. With public shootings on the rise, you need to know the clues in technology that indicate a potentially dangerous person.  In part 1 of this special Komando on Demand, Kim looks at the connection between violent video games and what goes on in the mind of some of these culprits. She also gives some insider tips, case studies and interviews to help you spot trouble before it starts.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/chtbl.com/track/28E15G/traffic.megaphone.fm/WSMM1640463466.mp3"
        },
        {
            "title": "Epidemic on the rise: The dangers of texting and distracted driving",
            "datePublished": "Wed, 19 Sep 2018 01:00:00 -0000",
            "description": "Each time you hop in your car you're taking your life in your hand. Do you realize how distracted other drivers are around you? Seconds are all it takes for things to go horribly wrong. In this episode of Komando on Demand, Kim takes a deeper look at the dangers of distracted driving and the importance you play in making the streets safer for yourself and other drivers.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/chtbl.com/track/28E15G/traffic.megaphone.fm/WSMM7149243182.mp3"
        },
        {
            "title": "Millennials in the workforce  ",
            "datePublished": "Sat, 15 Sep 2018 13:00:00 -0000",
            "description": "With more and more Millennials immersed into the workforce, changes are happening. Their wants and needs are different from previous generations. In this Komando on Demand podcast get an in-depth understanding of what Millenials consider the ideal work environment, and the role that technology is playing in their behavior. Should employers jump on board and embrace some of their ideas?",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/chtbl.com/track/28E15G/traffic.megaphone.fm/WSMM8394339075.mp3"
        },
        {
            "title": "Is your phone safe? Hackers can easily hijack it and steal your information",
            "datePublished": "Fri, 14 Sep 2018 01:00:00 -0000",
            "description": "Your phone is your most prized possession, making it the most vulnerable security risk you own. Did you know that hackers are able to access nearly all your accounts with just your phone number? In this episode of Komando on Demand, Kim explores the serious threat of hijacking smartphones and how cybercriminals can ruin your life. Founder and CEO of InForceCyber.com Asen Kehayov, who is a Certified Ethical Hacker from Bulgaria, advises on what people can do to safeguard their data.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/chtbl.com/track/28E15G/traffic.megaphone.fm/WSMM9513797978.mp3"
        },
        {
            "title": "Technology to bust a cheating spouse",
            "datePublished": "Wed, 12 Sep 2018 01:00:00 -0000",
            "description": "Late nights at work, texting more often and other suspicious behaviors from a spouse are tell tale signs that they might be cheating. Is it an affair or is it something else? In this episode of Komando on Demand, Kim delves into the technology that will help find out if a spouse is fooling around. You’ll hear from award-winning author, educator and private investigator Larry Kaye about the ethics of investigating a spouse or significant other.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/chtbl.com/track/28E15G/traffic.megaphone.fm/WSMM6456199200.mp3"
        },
        {
            "title": "Proton Therapy - Killing cancer using tiny particle technology",
            "datePublished": "Fri, 07 Sep 2018 01:00:00 -0000",
            "description": "Radiation treatment for cancer is very hard on patients. But now, doctors are using a powerful technological treatment that targets just the cancer cells while leaving the patient with minimal side effects. It’s called Proton Therapy. In this heartfelt episode of Komando on Demand, Kim explores this new form of cancer treatment that’s taking the medical world by storm, and talks to Lee Chamblee, the Education Program Coordinator at the University of Texas MD Anderson Proton Therapy Center.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/chtbl.com/track/28E15G/traffic.megaphone.fm/WSMM5651135262.mp3"
        },
        {
            "title": "Best streaming services and how to watch your favorite football games",
            "datePublished": "Wed, 05 Sep 2018 01:00:00 -0000",
            "description": "Video streaming services can help you cut the cord and save a ton of money every month. You can stream content on your schedule as well as choose what you want to watch. In this episode of the Komando on Demand podcast, Kim compares several video streaming services. Whether it's movies, television or watching the big football game that you’re most interested in, there are many streaming services out there that can deliver the content you want without the big price tag.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/chtbl.com/track/28E15G/traffic.megaphone.fm/WSMM3969503074.mp3"
        },
        {
            "title": "How to restore a ruined online reputation from the ground up",
            "datePublished": "Thu, 30 Aug 2018 20:00:00 -0000",
            "description": "What if a complete stranger, or worse yet someone you know and trust, decides to ruin your life? How easy would it be for them to destroy your career, credibility and social life? On this episode of Komando on Demand, Kim looks at the maliciousness of destroying someone online. Kim talks to a former cyberbully as well as Shannon Wilkinson, Founder & CEO of Reputation Communications to find solutions for this problem.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/chtbl.com/track/28E15G/traffic.megaphone.fm/WSMM5576934430.mp3"
        },
        {
            "title": "Education, technology and free perks you never expected to get at your local library",
            "datePublished": "Wed, 29 Aug 2018 01:00:00 -0000",
            "description": "Where can you go to gain access to technology, workspace, educational materials, entertainment, and even help getting a job? Your local library offers that and so much more, for free! In this episode of Komando on Demand, Kim explores how local libraries are evolving to meet the public's needs and talks to students, teachers and library staff on what the future holds for libraries.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/chtbl.com/track/28E15G/traffic.megaphone.fm/WSMM3596499280.mp3"
        },
        {
            "title": "How Facebook and Instagram keep you hooked and clicking",
            "datePublished": "Fri, 24 Aug 2018 01:00:00 -0000",
            "description": "Social media is at the center of everyone's day. We seem to gravitate towards checking our Facebook account or posting that picture on Instagram, reading the news or shopping online. Do you ever stop to think: How are these websites keeping us hooked? In this episode of Komando On Demand, we look at how programmers keep us coming back time and time again. Hear from experts who share insight on what goes on behind the scenes.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/chtbl.com/track/28E15G/traffic.megaphone.fm/WSMM1879805433.mp3"
        },
        {
            "title": "Smart home devices that pamper, cook, clean, and spoil you",
            "datePublished": "Wed, 22 Aug 2018 01:00:00 -0000",
            "description": "Are you a morning person? Well, your day’s about to get a lot more exciting with some brand new technology. In this episode of Komando on Demand, Kim talks to Patrick Sweetman with Voice First Tech about new smart home technology and how it can completely change your daily life. Some of these devices are weird, some are useful and some are a little scary, all controlled with voice command. You won’t want to miss this.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/chtbl.com/track/28E15G/traffic.megaphone.fm/WSMM3516208045.mp3"
        },
        {
            "title": "Virtual personal assistants that will crack you up",
            "datePublished": "Fri, 17 Aug 2018 02:00:00 -0000",
            "description": "In the mood for a good laugh? You won't believe the latest easter eggs, jokes and jabs from Cortana, Siri, Google Home, Apple HomePod and Amazon Alexa. In this episode of Komando on Demand, Kim shows up in rare comedic form in this lighthearted, crack-me-up podcast. It's tech meets humor in this out-of-the-box episode that will tickle your funny bone!",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/chtbl.com/track/28E15G/traffic.megaphone.fm/WSMM3795830855.mp3"
        },
        {
            "title": "Success secrets: How to build your business from the ground up",
            "datePublished": "Wed, 15 Aug 2018 13:00:00 -0000",
            "description": "Success comes in many forms. From humble beginnings to top leader in his industry, this podcast takes you through the story of Dan Granger, CEO of the ad agency Oxford Road. Dan’s company went from a startup to making over 1 million dollars in billing in its first year! In this episode of Komando On Demand we take a look at the company’s trials and tribulations and how Dan overcame insurmountable obstacles and embarked on the journey of a lifetime.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/chtbl.com/track/28E15G/traffic.megaphone.fm/WSMM8842806385.mp3"
        },
        {
            "title": "How to outsmart hackers and scammers when you travel",
            "datePublished": "Thu, 09 Aug 2018 13:30:00 -0000",
            "description": "You go on vacation to escape. But one thing you can’t escape is the danger of being hacked, scammed or tracked - and as a traveler, you’re a prime target! In this episode of Komando on Demand, you'll learn crucial safety practices to safeguard your internet security, whether traveling for business or pleasure. So before you even log on to book a flight, hotel, or car you need to arm yourself.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/chtbl.com/track/28E15G/traffic.megaphone.fm/WSMM9289910132.mp3"
        },
        {
            "title": "How the power grid can go down from a cyberattack",
            "datePublished": "Wed, 08 Aug 2018 17:10:41 -0000",
            "description": "Is this a frightening Hollywood movie plot? A weaponized cyberattack can quickly take down critical utilities and infrastructures like the electrical power grid, leaving millions of people vulnerable to the elements, and the U.S. economy vulnerable to ruin. The aftermath of such a severe attack can take years before we can recover (if ever). In this episode, we explore the vulnerabilities of cyberattacks on our power grid and what's being done to prevent this from happening.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/chtbl.com/track/28E15G/traffic.megaphone.fm/WSMM6512627507.mp3"
        },
        {
            "title": "Hi-tech farms: Is automated technology replacing farmers?",
            "datePublished": "Thu, 02 Aug 2018 23:43:09 -0000",
            "description": "When you think about farms and ranches, what comes to mind? You’ll be surprised to know just how hi-tech they have become. Drones, self-driving tractors and sophisticated imaging are about to revolutionize the way our food is grown. Will technology replace farmers?",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/chtbl.com/track/28E15G/traffic.megaphone.fm/WSMM7250733380.mp3"
        },
        {
            "title": "Critical steps to secure online banking",
            "datePublished": "Wed, 01 Aug 2018 17:32:27 -0000",
            "description": "As convenient as online banking is, it’s important not to get too comfortable. There is no security guard standing watch over your online transactions. Online banking could expose you to hackers and malware that are looking for windows of opportunity to seize your sensitive information. So you need to be your own security guard! Here’s how.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/chtbl.com/track/28E15G/traffic.megaphone.fm/WSMM6398802330.mp3"
        },
        {
            "title": "Smile! Surveillance cameras are always watching you",
            "datePublished": "Fri, 27 Jul 2018 02:30:00 -0000",
            "description": "We don’t notice surveillance cameras watching us anymore. They’re everywhere! But what if your spouse was suddenly able to watch you cross the street without your knowledge. Would you consider that creepy? What if one day artificial intelligence with facial recognition was used to learn everything about you before you even enter a store? It’s only going to get more pervasive.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/chtbl.com/track/28E15G/traffic.megaphone.fm/WSMM3064197336.mp3"
        },
        {
            "title": "The billion dollar podcast: Success secrets from today’s top tech innovators ",
            "datePublished": "Wed, 25 Jul 2018 17:34:27 -0000",
            "description": "What it takes to invent the next breakthrough in technology is an idea, innovation, and the courage to ignore the naysayers. You’ll hear success secrets from today’s top innovators and visionaries and get a sneak peek at what’s brewing in the think tanks of tomorrow. You’ll be introduced to pioneers and entrepreneurs who didn’t get their big break until their 50s and 60s. Listen to my Komando On Demand podcast for inspiration and wisdom from some of history’s greatest minds.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/chtbl.com/track/28E15G/traffic.megaphone.fm/WSMM6945207605.mp3"
        },
        {
            "title": "U.S. to deploy border protection tech used for rhinos in Africa",
            "datePublished": "Thu, 19 Jul 2018 20:30:00 -0000",
            "description": "What do protecting rhinos and our border have in common? Black market and violence. In an effort to stop these criminal activities, advanced technology was created. You’ll learn how rhino poaching was reduced by 96%, and how this advanced technology is helping protect school shootings and border control.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/chtbl.com/track/28E15G/traffic.megaphone.fm/WSMM8623580905.mp3"
        },
        {
            "title": "Are we alone? How technology is used to find alien life",
            "datePublished": "Tue, 17 Jul 2018 23:30:00 -0000",
            "description": "The nation's top scientists believe there is intelligent life outside our solar system. They point to the numbers and pure science. Kim talks to Senior Astronomer Seth Shostak about the high-tech tools scientists are using to prove their theory right. Learn why they're certain they'll be proven right within the next 20 years.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/chtbl.com/track/28E15G/traffic.megaphone.fm/WSMM8791410941.mp3"
        },
        {
            "title": "AI’s human voices sound a little too real for many",
            "datePublished": "Fri, 13 Jul 2018 01:30:00 -0000",
            "description": "Can you tell the difference between computer-generated voices vs. human voices? Voice used to be a human attribute. Not anymore! AI can duplicate virtually any voice, including your own. Join Kim Komando and learn more about this life-changing technology taking over soon in this Komando on Demand podcast.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/chtbl.com/track/28E15G/traffic.megaphone.fm/WSMM6800725437.mp3"
        },
        {
            "title": "10 hot technologies that are now extinct",
            "datePublished": "Thu, 12 Jul 2018 01:07:56 -0000",
            "description": "Much common 20th-century technology has been rendered obsolete. Let's take a look back at the tech we couldn't live without and learn what’s replacing it. Join Kim Komando for a fun trip down memory lane.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/chtbl.com/track/28E15G/traffic.megaphone.fm/WSMM6197338740.mp3"
        },
        {
            "title": "Cyberwar is coming and the Russians are leading the way",
            "datePublished": "Fri, 06 Jul 2018 19:30:00 -0000",
            "description": "Almost 3 years ago Russia dropped a cyber-bomb on Ukraine, hacking energy companies and wiping out power to hundreds of thousands. Government security agents say that was just the beginning. A test of sorts for possibly a much bigger plan. Listen to my free Komando on Demand podcast as I take you through the history of cyber warfare and share things you should be doing now to prepare for a possible cyber attack.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/chtbl.com/track/28E15G/traffic.megaphone.fm/WSMM7823046164.mp3"
        },
        {
            "title": "Bionic hearing and wearable technology are about to save your life ",
            "datePublished": "Tue, 03 Jul 2018 23:30:00 -0000",
            "description": "Implanted or wearable, new technology is making your life easier and healthier. It not only improves your life, it will even save it! In this Komando on Demand you're getting two podcasts in one - I’m exploring the new solutions to battle hearing loss and give you bionic hearing and the new wearable devices that could change your life.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/chtbl.com/track/28E15G/traffic.megaphone.fm/WSMM6305481582.mp3"
        },
        {
            "title": "What is Exactis -- and how did it leak the data of nearly every American",
            "datePublished": "Fri, 29 Jun 2018 18:23:29 -0000",
            "description": "Data broker Exactis tracks about 400 traits on every American. That information is now out in the wild. A hacker can drain your bank account using your email address. Listen to this Komando On Demand Podcast for a deep look into how this data got leaked by the company and what you need to do now.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/chtbl.com/track/28E15G/traffic.megaphone.fm/WSMM1509954981.mp3"
        },
        {
            "title": "Virtual reality is about to change the world like never before",
            "datePublished": "Wed, 27 Jun 2018 19:00:00 -0000",
            "description": "Though most commonly used for playing games, there are so many more productive aspects to virtual reality and augmented reality that you may not be aware of. From real estate to education, virtual reality technology is changing the world. Are we ready?",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/chtbl.com/track/28E15G/traffic.megaphone.fm/WSMM4519534906.mp3"
        },
        {
            "title": "Smell technology is coming to VR and online shopping",
            "datePublished": "Fri, 22 Jun 2018 00:25:26 -0000",
            "description": "Most technology has so far targeted mainly our sense of sight and sound. Soon, we may be able to sense, transmit, and receive smell through the internet. Applications range from virtual reality to online shopping. Listen to what the future of your digital life holds for your nose. It’s fun and exciting!",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/chtbl.com/track/28E15G/traffic.megaphone.fm/WSMM5947870986.mp3"
        },
        {
            "title": " New ways crooks are using ATMs to empty your bank account",
            "datePublished": "Wed, 20 Jun 2018 02:00:00 -0000",
            "description": "Anytime you swipe your credit or debit card, you are putting your money at risk. Hackers and scammers have gotten more sophisticated. In this free Komando on Demand podcast, I will tell you how to spot the skimmers and shimmers.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/chtbl.com/track/28E15G/traffic.megaphone.fm/WSMM5776263127.mp3"
        },
        {
            "title": "The dangers posed by artificial intelligence are real",
            "datePublished": "Fri, 15 Jun 2018 01:30:00 -0000",
            "description": "Will we create a super-intelligent AI and forget to give it a conscience? How far is too far when it comes to AI? Listen to this free Komando on Demand podcast as I explore the real risks that face all of us as the AI world gets bigger and smarter.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/chtbl.com/track/28E15G/traffic.megaphone.fm/WSMM4056216657.mp3"
        },
        {
            "title": "Podcasting insider tricks from a top media buyer’s perspective ",
            "datePublished": "Wed, 13 Jun 2018 23:00:00 -0000",
            "description": "Podcasting is exploding. It’s expected to be a billion-dollar industry within 5 years. In this Komando on Demand podcast, Kim speaks with the head of a top advertising agency about how to get started, how to make money, and how you can be part of this next revolution.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/chtbl.com/track/28E15G/traffic.megaphone.fm/WSMM6455308788.mp3"
        },
        {
            "title": "You won’t believe robocallers' latest schemes! Here are ways you can outsmart them",
            "datePublished": "Thu, 07 Jun 2018 21:30:00 -0000",
            "description": "You’ve heard them – the annoying robotic calls that try to scam you with free vacations or false threats from the IRS. In fact, it is estimated that scammers make 2.5 billion robocalls in one month alone. This poses a very real risk to consumers as it gets harder to identify and avoid malicious automated calls. In this Komando on Demand podcast, you’ll learn how to protect yourself and your family from falling victim to these tricky and downright dangerous phone calls.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/chtbl.com/track/28E15G/traffic.megaphone.fm/WSMM3874400908.mp3"
        },
        {
            "title": "Scary! Hidden cameras are a vacationer's privacy nightmare",
            "datePublished": "Tue, 05 Jun 2018 17:30:00 -0000",
            "description": "Ever get the feeling you’re being watched? More and more vacationers are discovering hidden cameras in their rentals or hotel rooms, and you won’t believe some of the nooks they are found in. As if the thought of being recorded isn't scary enough, the legal action (or lack thereof) in many privacy cases will surely frighten you. In this Komando On Demand podcast, I’ll share my own harrowing experience, how to spot hidden cameras, and what to do if someone’s been recording your every move.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/chtbl.com/track/28E15G/traffic.megaphone.fm/WSMM5263270756.mp3"
        },
        {
            "title": "Is Amazon’s Alexa listening and recording more than you realize?",
            "datePublished": "Fri, 01 Jun 2018 00:31:09 -0000",
            "description": "Is Alexa spying on you? Your personal voice assistant might be a double agent. It works for you by answering questions and making life easier. She’s also working for Amazon collecting information.\r\n\r\nYou can listen to everything Amazon has stored away and delete your past. You might have growing privacy concerns.\r\n\r\nIn this free Komando on Demand podcast, you’ll hear how to listen to everything you have said to Alexa and how to the delete the recordings.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/chtbl.com/track/28E15G/traffic.megaphone.fm/WSMM2058913575.mp3"
        },
        {
            "title": "Russian hacking hits home and the FBI has a mission for you",
            "datePublished": "Fri, 01 Jun 2018 00:00:00 -0000",
            "description": "The FBI is sounding the warning that we are all at risk of Russian hackers. The cyber attack groups are zeroing in on the router in our homes to use against us. But there are steps you can take to prevent yourself from becoming a victim of these organized cyber crooks.  Listen to my Komando On Demand podcast for more on what the hackers are after and how you can stop them. You’ll want to share this important information with your family and friends.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/chtbl.com/track/28E15G/traffic.megaphone.fm/WSMM2365946930.mp3"
        },
        {
            "title": "Terms of service killed your privacy",
            "datePublished": "Thu, 31 May 2018 22:23:25 -0000",
            "description": "Each time you \"click here to agree,\" a piece of your privacy dies. Most of us use smartphones, Facebook, Twitter, Google and dozens of other apps. Each one makes you agree to a contract that you likely didn't read. Do you know what you've given up? Click here to listen to my free Komando on Demand podcast about how our need for convenience is coming at a very high price.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/chtbl.com/track/28E15G/traffic.megaphone.fm/WSMM7110005575.mp3"
        },
        {
            "title": "Connected cars are the future of driving",
            "datePublished": "Thu, 24 May 2018 22:07:01 -0000",
            "description": "As much as we'd like to believe flying cars will be a thing really soon, they won't. It's going to take years before that technology is perfected. Just look at how self-driving cars are moving along. But our cars ARE changing. In the next five years, we can expect them to be connected like never before. What will your new car know about you? Listen to my Komando on Demand podcast for an inside look at your future behind the wheel.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/chtbl.com/track/28E15G/traffic.megaphone.fm/WSMM5070857458.mp3"
        },
        {
            "title": "7 amazing things your smartphone camera can do",
            "datePublished": "Wed, 23 May 2018 18:00:00 -0000",
            "description": "Your smartphone camera can do much more than take a great picture. It can become a scanner, game system, security system, even translator. Click here to listen to my free Komando on Demand podcast about using your camera to the best of its capabilities.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/chtbl.com/track/28E15G/traffic.megaphone.fm/WSMM1356852684.mp3"
        },
        {
            "title": "Seeing is no longer believing - How video manipulation is becoming the next level of fake news",
            "datePublished": "Thu, 17 May 2018 23:55:53 -0000",
            "description": "Technology allows you to literally put words in someone else’s mouth. Video manipulation is advancing to a point where even terror attacks and mass destruction can be falsely created. We are on the cusp of a new era, where fake news will look more real than ever. Click here to listen to my free Komando on Demand podcast about why you can’t believe everything you see and how video manipulation could be a major threat to national security.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/chtbl.com/track/28E15G/traffic.megaphone.fm/WSMM1589834707.mp3"
        },
        {
            "title": "7 things you should never do online",
            "datePublished": "Wed, 16 May 2018 18:23:08 -0000",
            "description": "Most of us use the internet every day. Are you putting much thought into what you are doing? Your online activity can have a dramatic impact on your life and your family’s security.  Click here to listen to my free Komando on Demand podcast for the 7 things you should never do online.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/chtbl.com/track/28E15G/traffic.megaphone.fm/WSMM8995367108.mp3"
        },
        {
            "title": "Crazy tech is coming to us you'll either love or hate",
            "datePublished": "Thu, 10 May 2018 17:00:00 -0000",
            "description": "How will technology shape our future? There is no doubt that automation will evolve and life will change. Technology will have a profound effect on what’s ahead in the coming years.  We can barely keep up with the pace at which it is expanding. So what will our lives be like in the future?\r\n\r\nClick here to listen to my free Komando on Demand podcast for a list of technologies that will mold our fate.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/chtbl.com/track/28E15G/traffic.megaphone.fm/WSMM5543162295.mp3"
        },
        {
            "title": "Politics on Facebook brings out the worst",
            "datePublished": "Wed, 09 May 2018 20:00:00 -0000",
            "description": "Facebook started as a way to connect people, not as a political pundit. Today it seems like everyone is talking politics on their timelines. Do you want to turn your feedback into a place to share life updates, post pictures and just relax?  You’re about to be flooded with political posts as midterm elections approach. But you don’t have to be!\r\n\r\nClick here to listen to my free Komando on Demand podcast for how to silence the political rants on your Facebook feed.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/chtbl.com/track/28E15G/traffic.megaphone.fm/WSMM1008212280.mp3"
        },
        {
            "title": "How scientists at the South Pole live",
            "datePublished": "Fri, 04 May 2018 00:15:28 -0000",
            "description": "Would you live in 6-months of darkness and temperatures more than 100 degrees below zero for your job? In a rare interview, Kim talks with one elite scientist, stationed at the South Pole, about how he copes with life in this desolate environment.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/chtbl.com/track/28E15G/traffic.megaphone.fm/WSMM9553099506.mp3"
        },
        {
            "title": "5 Great ways to make money online.",
            "datePublished": "Wed, 02 May 2018 02:00:00 -0000",
            "description": "Are you looking to get back to work, clear up some debt or find a side job to make extra cash? All you need is an internet connection. It’s quick, it’s easy and you can add flexibility to your busy schedule. This podcast will walk you through the steps so you can get started utilizing your skills to make extra cash.  Listen to my free Komando on Demand podcast for some of the best ways to make money on your own time.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/chtbl.com/track/28E15G/traffic.megaphone.fm/WSMM2392918921.mp3"
        },
        {
            "title": "Is the Chinese government using smartphones to spy on you?",
            "datePublished": "Fri, 27 Apr 2018 00:36:00 -0000",
            "description": "Is it protection or paranoia? The head of the FBI has warned that the Chinese government may be spying on U.S. citizens who use smartphones made by Huawei or ZTE. Both makers deny the surveillance, but the idea of cyber snooping comes with precedence.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/chtbl.com/track/28E15G/traffic.megaphone.fm/WSMM8683840890.mp3"
        },
        {
            "title": "3 ways to search the web without Google tracking you.",
            "datePublished": "Wed, 25 Apr 2018 00:03:10 -0000",
            "description": "Google saves your search history and tracks what you click online. If you need a break from the surveillance, you have options. You can use a search engine that does not mark your every move. Click here to listen to my free Komando on Demand podcast for three ways to hunt the internet that you may find refreshing.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/chtbl.com/track/28E15G/traffic.megaphone.fm/WSMM6823442525.mp3"
        },
        {
            "title": "Can DNA tests predict your intelligence? - Part 2",
            "datePublished": "Thu, 19 Apr 2018 23:16:22 -0000",
            "description": "Is it a smart idea to base a child's education on her or his DNA? What if you knew right at birth whether your child would excel at math, science or music? Would you want to know? Testing DNA for IQ could take the stress off parents and teachers. It might also lead us to an eugenics society. Listen and learn what could be on the horizon.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/chtbl.com/track/28E15G/traffic.megaphone.fm/WSMM1017178644.mp3"
        },
        {
            "title": "Can DNA tests predict your intelligence? - Part 1",
            "datePublished": "Thu, 19 Apr 2018 23:11:20 -0000",
            "description": "Can DNA predetermine your future? Scientists think intelligence can be measured with a simple swab of your saliva. Advanced technology reading the DNA of children and foreshadowing their lives. It sounds like science fiction becoming reality. The new developments could lead to a future most never saw coming. Click here to listen to part one of my free Komando on Demand podcast about whether intelligence, is in your genes.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/chtbl.com/track/28E15G/traffic.megaphone.fm/WSMM4148815739.mp3"
        },
        {
            "title": "5G is coming and it will cost you! What you need to know",
            "datePublished": "Thu, 12 Apr 2018 23:38:38 -0000",
            "description": "The future may get here faster than we think, as the world races toward 5G wireless technology. 5G will be faster, revolutionary and could even fight terrorism? This is much more than a just an upgrade, it could allow for driverless cars and smart cities. It will be unlike anything the world has ever seen before. Will this breakthrough come at a cost to your health, increasing the risk of disease and disorders?",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/chtbl.com/track/28E15G/traffic.megaphone.fm/WSMM8971525022.mp3"
        },
        {
            "title": "Netflix and relax with these 7 handy tips for everyone",
            "datePublished": "Wed, 11 Apr 2018 00:17:38 -0000",
            "description": "Remember the days of going to the store to rent your favorite movie?  Then the disappointment when there were no copies available?  Netflix sure fixed that problem and now is growing into a media giant.  Movies, TV Shows, original programming, all at your fingertips, whenever you want. But there’s more to Netflix than you might know!  Listen to my free Komando on Demand podcast for handy tips to help you get the most out of your video-streaming service.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/chtbl.com/track/28E15G/traffic.megaphone.fm/WSMM9429045639.mp3"
        },
        {
            "title": "Facebook's widening privacy scandal affects you like you never imagined possible.",
            "datePublished": "Thu, 05 Apr 2018 23:20:14 -0000",
            "description": "Facebook's scandal gets worse as more details emerge about how they tracked you like you never knew before. In my podcast, I talk to some of the leading technology and data breach attorneys, John Yanchunis and Steven Teppler, about what's in store for Facebook and also what we can do to protect ourselves in this age of dwindling privacy. It's become clear that your information is the currency of the 21st century. Have we lost trust in Facebook?",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/chtbl.com/track/28E15G/traffic.megaphone.fm/WSMM7024488575.mp3"
        },
        {
            "title": "Cambridge Analytica Facebook manipulated us we helped",
            "datePublished": "Thu, 29 Mar 2018 21:23:32 -0000",
            "description": "Your online privacy is compromised! Cambridge Analytica manipulated you, then harvested your personal data and psychographic profiles through Facebook.  But did you help? Is it too late to protect yourself? Can you get your privacy back?  What are your rights? Does online privacy even exist? The laws are changing, so listen now for my inside scoop from an Internet Security Lawyer and a risk management pro – on this week’s Komando on Demand free podcast.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/chtbl.com/track/28E15G/traffic.megaphone.fm/WSMM4425796519.mp3"
        },
        {
            "title": "The fascinating and dangerous Dark Web",
            "datePublished": "Fri, 23 Mar 2018 18:07:34 -0000",
            "description": "Part 2 of our series on The Dark Web. It’s a fascinating and dangerous place, but as public intrigue grows, so does the number of horrific stories that emerge from this misunderstood corner of the internet. In this Komando on Demand podcast, I’ll explain how this modern technology is enabling modern slavery and I’ll talk to the freedom fighters who bring cyber criminals to justice.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/chtbl.com/track/28E15G/traffic.megaphone.fm/WSMM2728823581.mp3"
        },
        {
            "title": "The Dark Web where crime hackers and government co-exist",
            "datePublished": "Fri, 23 Mar 2018 17:21:33 -0000",
            "description": "There's the internet you probably have never seen. The Dark Web is a hidden network of about 50,000 sites where criminals, hackers, trolls, extremists and governments exist. Listen and learn how it works and what steps people take to access it.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/chtbl.com/track/28E15G/traffic.megaphone.fm/WSMM6938740451.mp3"
        },
        {
            "title": "Cancer-fighting nanorobots seek and destroy tumors along with other breakthroughs to end cancer",
            "datePublished": "Thu, 15 Mar 2018 22:49:05 -0000",
            "description": "With the latest in cancer detection technology, your odds of preventing it go up. The more you know about your own DNA, the better chances you have of ambushing cancer long before it happens. And if it does happen? Nano Robots may soon help.  Cancer detection, prevention and defeat are now partners, and you shouldn’t be afraid to learn about them.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/chtbl.com/track/28E15G/traffic.megaphone.fm/WSMM4323498645.mp3"
        },
        {
            "title": "High tech bullet-proof police protection gear that you can get too.",
            "datePublished": "Thu, 08 Mar 2018 22:32:40 -0000",
            "description": "For every police officer that goes down in the line of fire, hundreds are saved by new technologies in ballistics, body armor, bullet-proof protective gear and trauma prep packs.  Now you can get the very same gear used by Special Elite, Armed Forces and Law Enforcement to protect you and your family. In this free Komando on Demand podcast, I’ll tell you about the cutting edge tools to gear up, prepare smart, and stay ready.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/chtbl.com/track/28E15G/traffic.megaphone.fm/WSMM5071488133.mp3"
        },
        {
            "title": "Cyber-Sniffing  K-9s: Man’s best friend, Cybercrime’s worst enemy ",
            "datePublished": "Thu, 01 Mar 2018 23:08:49 -0000",
            "description": "Dog is man’s best friend, but a Device Detection Dog is a cybercriminal’s worst enemy. If you’re stashing illegal data of any kind, a well-trained K-9 will find it. You can flush it, bury it, put it in your gas tank, swallow it … but you can’t hide electronic evidence from a detection dog. In this free Komando on Demand podcast you’ll hear the latest tactics used to crack down on child pornography and cybercrime.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/chtbl.com/track/28E15G/traffic.megaphone.fm/WSMM1587948736.mp3"
        },
        {
            "title": "Baffled by Bitcoin? Masters of Cryptocurrency explain everything you need to know",
            "datePublished": "Thu, 22 Feb 2018 19:57:59 -0000",
            "description": "In 2009 Bitcoin sold for a handful of change. Today Bitcoin is worth around $11,000, but it’s been at nearly $18,000. So … bite the bullet or bail out? In this podcast, I have critical investment advice including public offerings, security practices & common mistakes – from both masters & critics of cryptocurrency. All that and more from the digital world of Kim Komando.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/chtbl.com/track/28E15G/traffic.megaphone.fm/WSMM8899196701.mp3"
        },
        {
            "title": "Foodies on fire, making money by showcasing their cooking skills online.",
            "datePublished": "Thu, 15 Feb 2018 20:51:06 -0000",
            "description": "Move over cookbooks, now you can find any recipe online and watch everyday people making incredible dishes.  These food vloggers have turned their love of cooking into a money-making business and you can too!  Want to share your recipes and cooking expertise with a worldwide audience?  Listen to my free podcast, sit back and take some notes as these food blogging experts share their advice.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/chtbl.com/track/28E15G/traffic.megaphone.fm/WSMM3457497694.mp3"
        },
        {
            "title": "Hearing your way through the evolution of the internet",
            "datePublished": "Thu, 08 Feb 2018 23:00:00 -0000",
            "description": "Tune your listening skills as you never have before – and actually hear the evolution of technology.  The progression of the internet and computers can be dissected by sounds. Put your hearing skills to the test and take a trip through time as computers evolve.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/chtbl.com/track/28E15G/traffic.megaphone.fm/WSMM1656809267.mp3"
        },
        {
            "title": "Downsized, free and living life on the open road - Part 2",
            "datePublished": "Fri, 02 Feb 2018 03:00:00 -0000",
            "description": "Almost 3 years after trading in their home for an RV and selling everything in exchange for a carefree life on the open road, we’re checking in with one of our favorite couples to see what they have learned, what they’d do differently and if they have any regrets. Plus, life with an RV can be fun and profitable! How owners are capitalizing on adventure.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/chtbl.com/track/28E15G/traffic.megaphone.fm/WSMM8264009540.mp3"
        },
        {
            "title": "Downsizing for the freedom of the open road - Part 1",
            "datePublished": "Wed, 31 Jan 2018 02:00:00 -0000",
            "description": "One couple sells everything they have; including the kitchen sink, to travel the highways and byways of the United States. You'll learn from their mistakes and find out if you have the right stuff to make it without a home base. Listen to my free podcast to hear their story.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/chtbl.com/track/28E15G/traffic.megaphone.fm/WSMM7659762454.mp3"
        },
        {
            "title": "Catch the rarest and most breathtaking Super Blue Blood Eclipsed Moon!",
            "datePublished": "Thu, 25 Jan 2018 17:29:24 -0000",
            "description": "On January 31st, a rare and beautiful astronomical event will take place. The Super Blue Blood Eclipsed Moon will grace our skies.  Not only has it captured the attention of the world’s astronomers and astrophysicists, it has piqued the interest of history buffs and theologians. Here’s the fun part … this particular moon is totally photographical, I’ll have the best advice and talk to astronomer, and educator Andrew Fraknoi along with popular tech videocaster Jeremy Judkins as we share must-have tip",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/chtbl.com/track/28E15G/traffic.megaphone.fm/WSMM6821531751.mp3"
        },
        {
            "title": "Breaking down the Bitcoin – everything you ever wanted to know but were too afraid to ask ",
            "datePublished": "Thu, 11 Jan 2018 18:08:18 -0000",
            "description": "You’ve probably heard about Bitcoin, but like many, are completely confused by the new digital currency.  Bitcoin’s value is soaring, but there are so many questions surrounding this fairly new cryptocurrency.  Listen to me FREE Komando on Demand podcast as I answer the questions you’re too embarrassed to ask and find out the pros and cons of buying and selling Bitcoins.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/chtbl.com/track/28E15G/traffic.megaphone.fm/WSMM4275350267.mp3"
        },
        {
            "title": "Your smart TV is spying on you",
            "datePublished": "Fri, 05 Jan 2018 15:41:21 -0000",
            "description": "Do you have or did you just get a “smart” TV?  Most new models have smart technology, which mean your TV will connect to the Internet.  It also means you’re a target for hackers.  Listen to my Komando On Demand FREE podcast to hear why you should be worried and what you can do about it.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/chtbl.com/track/28E15G/traffic.megaphone.fm/WSMM4247872739.mp3"
        },
        {
            "title": "Billionaire innovators:  What’s the secret to success in creating the next “it” thing in tech? - Part 1",
            "datePublished": "Wed, 27 Dec 2017 09:00:00 -0000",
            "description": "So what does it take to invent the next breakthrough in technology? Our world is constantly being shaped by inventors, entrepreneurs and geniuses who defy the odds and follow their dreams. If you have a great big idea that you are passionate about, this two part podcast series is for you. In part 1 of this Komando On Demand podcast series, you’ll hear success secrets from today’s top innovators and visionaries and get a sneak peek at what’s brewing in the think tanks of tomorrow.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/chtbl.com/track/28E15G/traffic.megaphone.fm/WSMM2410377837.mp3"
        },
        {
            "title": "How technology is wiping out cancer and heart disease",
            "datePublished": "Thu, 14 Dec 2017 09:00:00 -0000",
            "description": "Disease elimination in our lifetime? It’s closer now than ever before. Hear the latest about how tech, medical and science communities are zeroing in on Cancer, Sickle Cell Anemia, Heart Disease and others!",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/chtbl.com/track/28E15G/traffic.megaphone.fm/WSMM2237557090.mp3"
        },
        {
            "title": "Beware of Barbie! And more of the unsuspecting gadgets that are listening to you in your home!",
            "datePublished": "Tue, 12 Dec 2017 18:00:00 -0000",
            "description": "Forget privacy! Even if you think your home is a safe haven, the “Internet of Things” is taking over and listening to your every move. Smartphones, TV’s, barbie dolls and even crockpots are listening and storing your conversations. All of it prime information for anyone who wants it. Listen to my free podcast to hear what types of appliances are gathering information, where it’s going and what you can do about it.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/chtbl.com/track/28E15G/traffic.megaphone.fm/WSMM3441947725.mp3"
        },
        {
            "title": "How Star Wars' The Last Jedi is bringing dead actors and new characters to life",
            "datePublished": "Thu, 07 Dec 2017 16:00:00 -0000",
            "description": "Star Wars’ The Last Jedi takes digital characters to a new innovative level. Learn the secrets directly from the computer engineers and animators who are bringing the characters to life. You’ll never look at Star Wars’ the same way again. ",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/chtbl.com/track/28E15G/traffic.megaphone.fm/WSMM2636078873.mp3"
        },
        {
            "title": "Can your phone cause cancer or ADHD?",
            "datePublished": "Thu, 30 Nov 2017 23:00:00 -0000",
            "description": "They used to say smoking was not harmful to our health. Today, researchers and doctors are warning about radio frequency radiation, but are we listening? Don’t miss this Komando On Demand FREE podcast as I talk to the researchers behind the film “Generation Zapped,” an eye-opening documentary about the health risks caused by RF frequencies.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/chtbl.com/track/28E15G/traffic.megaphone.fm/WSMM4729227704.mp3"
        },
        {
            "title": "Dangers of Making Your House a Smart Home",
            "datePublished": "Tue, 28 Nov 2017 16:00:00 -0000",
            "description": "What new “smart” gadgets will be under your tree this year? Smart TVs, refrigerators and more sure can make our lives easier and more enjoyable. Pretty soon everything in our home will use smart technology. As exciting as it is, there are dangers you need to be aware of. From the archives of Komando on demand, Kim talks about the warning signs as technology takes over!",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/chtbl.com/track/28E15G/traffic.megaphone.fm/WSMM8305861536.mp3"
        },
        {
            "title": "The fascinating and dangerous Dark Web",
            "datePublished": "Fri, 24 Nov 2017 16:00:00 -0000",
            "description": "Part 2 of our series on The Dark Web. It’s a fascinating and dangerous place, but as public intrigue grows, so does the number of horrific stories that emerge from this misunderstood corner of the internet. In this Komando on Demand podcast, I’ll explain how this modern technology is enabling modern slavery and I’ll talk to the freedom fighters who bring cyber criminals to justice",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/chtbl.com/track/28E15G/traffic.megaphone.fm/WSMM1490229787.mp3"
        },
        {
            "title": "How you can save 73% on your grocery bill",
            "datePublished": "Tue, 21 Nov 2017 18:00:00 -0000",
            "description": "Get ready to save. In this Komando On Demand FREE podcast, I talk to a savvy shopper who is forced to get creative with finances after her husband loses his job. How she saves $11,000 on a $15,000 yearly grocery bill. Listen to my Komando On Demand FREE podcast to hear how you can do the same!",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/chtbl.com/track/28E15G/traffic.megaphone.fm/WSMM1024486966.mp3"
        },
        {
            "title": "Take a trip inside the deep dark web",
            "datePublished": "Tue, 21 Nov 2017 16:00:00 -0000",
            "description": "In part one of a two part series on a disturbing place most have only heard about. The Dark Web. We talk to the documentary filmmaker who will surprise you when he says the media has gotten it all wrong. Listen to my Komando On Demand FREE podcast to hear why he says the Dark Web is not what you think.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/chtbl.com/track/28E15G/traffic.megaphone.fm/WSMM6634408067.mp3"
        },
        {
            "title": "Living the hi-tech life!  Are you ready make your home in a city of the future?",
            "datePublished": "Thu, 16 Nov 2017 19:00:00 -0000",
            "description": "Take a walk through the city of the future – the smart city. These connected cities will have features like self-driving cars, internet-connected homes, sustainable power and more. But will the smart city be bright and shiny, full of robots and tech or dark and gloomy. In this Komando on Demand podcast, I will explore the city of the future and talk to the experts who are building the tech that will change the way we live.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/chtbl.com/track/28E15G/traffic.megaphone.fm/WSMM2516093953.mp3"
        },
        {
            "title": "How real is the risk posed by 3-D printed guns?",
            "datePublished": "Thu, 09 Nov 2017 19:00:00 -0000",
            "description": "Cody Wilson is out to disrupt the firearm industry by implementing some of the coolest tech around - 3-D printers. But will his idea of giving anyone with a computer and an internet connection the ability to manufacture a weapon a good idea? For better or worse, technology will undoubtedly play a role in the future of weaponry - and accountability. In this Komando On Demand podcast, I will explore this highly charged topic as I talk to Cody about his Ghost Gun.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/chtbl.com/track/28E15G/traffic.megaphone.fm/WSMM5603180176.mp3"
        },
        {
            "title": "Are meditation and mindfulness apps solid advice or a silly waste of time?",
            "datePublished": "Thu, 02 Nov 2017 17:00:00 -0000",
            "description": "Trouble sleeping? Anxious? Depressed? You’re not alone. What if the relief you needed was right at your fingertips? Mobile meditation apps have been popping up and many are turning to them for relief. But are they really worthwhile and effective? In this Komando On Demand podcast, I will share some valuable insight to decide whether these apps are worth checking out - and why.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/chtbl.com/track/28E15G/traffic.megaphone.fm/WSMM8004632430.mp3"
        },
        {
            "title": "Technology is revolutionizing the fight against Breast Cancer",
            "datePublished": "Thu, 26 Oct 2017 17:00:00 -0000",
            "description": "Everyone from nurses to NFL players wear pink in honor of Breast Cancer Awareness. In this Komando on Demand podcast, I’ll talk to two women who battled this deadly disease and explore the new technologies that are saving women’s lives.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/chtbl.com/track/28E15G/traffic.megaphone.fm/WSMM8084144916.mp3"
        },
        {
            "title": "Hackers are not only targeting your computer, they are targeting your body",
            "datePublished": "Thu, 19 Oct 2017 19:00:00 -0000",
            "description": "Millions of internet-connected medical devices have been sold to Americans over the last few years. Smart medical devices such as insulin pumps, pacemakers, syringes, and defibrillators help save patients’ lives. But many of those devices have little to no digital security, making them tempting targets for hackers. In this Komando on Demand podcast, I’ll explain why hackers are targeting these devices and what tools help provide you and your family members' safety.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/chtbl.com/track/28E15G/traffic.megaphone.fm/WSMM4292144011.mp3"
        },
        {
            "title": "Cyber Security Awareness Month - The online threats you need to know about now",
            "datePublished": "Thu, 12 Oct 2017 21:00:00 -0000",
            "description": "Every October has been set aside as National Cyber Security Awareness Month - a public service campaign to educate people about risks to their online privacy. This year's campaign is especially pressing with the recent cyberattacks on Equifax, the DNC and more. Cyber security awareness is at an all-time high. In this Komando on Demand podcast, I’ll tell you about major online threats that you need to know about, and how to protect your personal information from hackers.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/chtbl.com/track/28E15G/traffic.megaphone.fm/WSMM4354266473.mp3"
        },
        {
            "title": "Emergency medical tech: The latest devices that could save your life",
            "datePublished": "Thu, 05 Oct 2017 21:00:00 -0000",
            "description": "Recent news has been a tragic reminder of how fragile life is – hurricanes and acts of terror taking lives and challenging medical responders. The good news is, better and faster medical technology is emerging, such as devices to stop massive bleeding to trackers for babies and Alzheimer’s patients. In this Komando on Demand podcast, I’ll talk to the experts who are hard at work developing tech to help you avoid the doctor and prepare you for emergencies.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/chtbl.com/track/28E15G/traffic.megaphone.fm/WSMM2195683798.mp3"
        },
        {
            "title": "Modern slavery: Model escapes captors who allegedly try to sell her on the Dark Web",
            "datePublished": "Fri, 29 Sep 2017 23:00:00 -0000",
            "description": "The Dark Web. It’s a fascinating and dangerous place, but as public intrigue grows, so does the number of horrific stories that emerge from this misunderstood corner of the internet. One such story is the traumatic nightmare that British model, Chloe Ayling claims she went through when she was kidnapped and sold online. In this Komando on Demand podcast, I’ll explain how this modern technology is enabling modern slavery and speak with the freedom fighters who bring cyber criminals to justice.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/chtbl.com/track/28E15G/traffic.megaphone.fm/WSMM8782607404.mp3"
        },
        {
            "title": "Equifax: Biggest consumer data breach in history",
            "datePublished": "Fri, 22 Sep 2017 01:00:00 -0000",
            "description": "By now you’ve heard about the massive security hack at the credit reporting firm, Equifax. So, how and WHY did half of all American’s sensitive data fall victim to this breach? In this Komando on Demand podcast, we’ll explore the weakness in Equifax’s security protocols, and find out if the hack could have been avoided. Also, why did two of the firm’s top executives sell their Equifax stock before telling the public? Plus, we’ll tell you what you need to know about protecting your identity.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/chtbl.com/track/28E15G/traffic.megaphone.fm/WSMM4782379422.mp3"
        },
        {
            "title": "You won’t believe robocallers' latest schemes! Here are ways you can outsmart them",
            "datePublished": "Thu, 14 Sep 2017 17:00:00 -0000",
            "description": "You’ve heard them – the annoying robotic calls that try to scam you with free vacations or false threats from the IRS. In fact, it is estimated that scammers make 2.5 billion robocalls in one month alone. This poses a very real risk to consumers as it gets harder to identify and avoid malicious automated calls. In this Komando on Demand podcast, you’ll learn how to protect yourself and your family from falling victim to these tricky and downright dangerous phone calls.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/chtbl.com/track/28E15G/traffic.megaphone.fm/WSMM5704065069.mp3"
        },
        {
            "title": "The robot revolution is here – are you ready?",
            "datePublished": "Thu, 07 Sep 2017 22:00:00 -0000",
            "description": "Robots are among us. They’re in our schools, hospitals, malls, offices and assembly lines. They’re skilled, fast, accurate, and sometimes even friendly. But are these digital beings only here to help or should we watch out for them? In this Komando on Demand podcast, experts in AI creation and robot ethics will tell you all you need to know about Artificial Intelligence and the future of robots in the workforce.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/chtbl.com/track/28E15G/traffic.megaphone.fm/WSMM3665913365.mp3"
        },
        {
            "title": "DO NOT donate to Hurricane Harvey charities until you listen to this podcast",
            "datePublished": "Wed, 30 Aug 2017 23:00:00 -0000",
            "description": "Fake charities and donation scams are on the rise in the aftermath of disasters. Scammers take advantage of public goodwill and steal billions of dollars from people who want to help. In this Komando on Demand podcast, I’ll tell you how to protect yourself and your loved ones from these crooks, while still providing aid to those in need.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/chtbl.com/track/28E15G/traffic.megaphone.fm/WSMM5357143287.mp3"
        },
        {
            "title": "You may think you know what time is. Are you right? ",
            "datePublished": "Wed, 23 Aug 2017 22:00:00 -0000",
            "description": "What time is it? Did you know that people around the globe work day and night trying to define time? In this Komando on Demand podcast, I’ll explore the quirky aspects of a leap-year, and why the experts are arguing about a simple second.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/chtbl.com/track/28E15G/traffic.megaphone.fm/WSMM9435860027.mp3"
        },
        {
            "title": "Is Google making us dumb or making us smarter?",
            "datePublished": "Fri, 18 Aug 2017 00:00:00 -0000",
            "description": "How often do you turn to your device for answers about health concerns, creating travel plans, where to eat, and directions to get there? If your answer is \"All the time\" you're not alone. But could our dependence on tech be inhibiting us from thinking critically and making decisions? While the jury is out about whether or not our tech is really dumbing us down, there might be some evidence that we are relying on tech to perform things that used to define us as uniquely human.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/chtbl.com/track/28E15G/traffic.megaphone.fm/WSMM9728652252.mp3"
        },
        {
            "title": "Solar Eclipse 2017: Expert tips and everything you need to know beyond the dark",
            "datePublished": "Tue, 15 Aug 2017 23:00:00 -0000",
            "description": "Join us for this encore presentation of my Komando on Demand series about the once-in-a-lifetime cosmic event. In this podcast, you’ll hear from experts about cool eclipse facts and viewing tips. Plus, we’ll delve deeper into science, technology and astrophysics, and how, together, they help discover possible alternate realities, hidden matter, mysteries of time and light and possibly habitable planets - all from the study of eclipses!",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/chtbl.com/track/28E15G/traffic.megaphone.fm/WSMM7969159060.mp3"
        },
        {
            "title": "The billion dollar podcast: Success secrets from today’s top tech innovators – Part 2",
            "datePublished": "Thu, 03 Aug 2017 19:00:00 -0000",
            "description": "In part 2 of this Komando On Demand series, you heard that high profile people initially laughed at the idea of the iPhone, which is now wildly successful. Such is the tale of many of our world’s brightest ideas. In this final part of the Billion Dollar Podcast, I will introduce you to pioneers and entrepreneurs who didn’t get their big break until their 50s and 60s. Listen to my free podcast for inspiration and wisdom from some of history’s greatest minds.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/chtbl.com/track/28E15G/traffic.megaphone.fm/WSMM2705785831.mp3"
        },
        {
            "title": "The billion dollar podcast: Success secrets from today’s top tech innovators - Part 1",
            "datePublished": "Fri, 28 Jul 2017 18:00:00 -0000",
            "description": "In part 1 of this Komando On Demand podcast series, you’ll hear success secrets from today’s top innovators and visionaries and get a sneak peek at what’s brewing in the think tanks of tomorrow. Join us next week for more wisdom from today’s tech stars.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/chtbl.com/track/28E15G/traffic.megaphone.fm/WSMM9793252488.mp3"
        },
        {
            "title": "Solar Eclipse 2017: A bright future beyond the dark - Part 2 ",
            "datePublished": "Thu, 13 Jul 2017 23:00:00 -0000",
            "description": "On August 21st, people from around the world will join millions of Americans for an unforgettable experience – The Great American Total Solar Eclipse. In Part 1 of this Komando on Demand series, you heard from experts about cool eclipse facts and viewing tips. In Part 2, we delve deeper into science, technology and astrophysics, and how, together, they help discover possible alternate realities, hidden matter, mysteries of time and light and possibly habitable planets - all from the study of eclipses!",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/chtbl.com/track/28E15G/traffic.megaphone.fm/WSMM1253672471.mp3"
        },
        {
            "title": "Total Eclipse 2017: Expert tips and everything you need to know - Part 1",
            "datePublished": "Fri, 07 Jul 2017 00:00:00 -0000",
            "description": "On August 21st, people from around the world will join millions of Americans for an unforgettable experience: The Great American Total Solar Eclipse. Spectators will see the sun disappear behind the moon revealing streams of light around the moon's silhouette. If you are planning to watch it live, host a viewing party, or simply stream it online, these tips are for you.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/chtbl.com/track/28E15G/traffic.megaphone.fm/WSMM2297894740.mp3"
        },
        {
            "title": "Secret ways to make money on social media",
            "datePublished": "Thu, 29 Jun 2017 18:00:00 -0000",
            "description": "Social media and websites have not only changed the way we promote ourselves and our business, but it's also changed the way we make money. In this podcast we'll tell you about some young people who have used social media to earn more money than their parents, and how social media helped take a fitness nutrition company from making thousands of dollars in its first year to millions in the second year. Plus, get tips on how to use social media to make money on the side or even grow your new business.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/chtbl.com/track/28E15G/traffic.megaphone.fm/WSMM5904616340.mp3"
        },
        {
            "title": "Could eSports outperform football, baseball and basketball?",
            "datePublished": "Thu, 22 Jun 2017 18:00:00 -0000",
            "description": "Could video game competitions become more popular than the Super Bowl? eSports, as they're called, have such a huge following that TV networks have started to bid on the right to broadcast them. In this Komando on Demand podcast, we’re going to meet a competitive gamer and a woman who made a name for herself hosting the most popular competitions in America.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/chtbl.com/track/28E15G/traffic.megaphone.fm/WSMM9721573132.mp3"
        },
        {
            "title": "Finding a sperm donor has become as easy as online shopping",
            "datePublished": "Thu, 15 Jun 2017 18:00:00 -0000",
            "description": "Imagine swiping left or right on your smartphone to choose your child, or scrolling through Facebook & Craigslist for a sperm donor. Today, non-traditional methods are taking over. The process is as easy as pointing & clicking. A day or two later, sperm is delivered to your house. In this Komando on Demand podcast, we speak with experts from a national sperm bank & a company that created an in-home kit to measure sperm count.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/chtbl.com/track/28E15G/traffic.megaphone.fm/WSMM5491496173.mp3"
        },
        {
            "title": "Living the Dream: Money in the Music Stream",
            "datePublished": "Wed, 07 Jun 2017 18:00:00 -0000",
            "description": "Back in the early years of broadcast, musicians and aspiring talk personalities relied solely on sponsorships and big business to put money in the bank. Then, advertisers stepped in. Now, we live in a world where anyone can stream live, and some have figured out how to make money doing it. But can you truly make a living on the air? In this Komando on Demand podcast, you’ll hear from the latest generation of broadcasters who are making money streaming live, right from their home.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/chtbl.com/track/28E15G/traffic.megaphone.fm/WSMM2047322068.mp3"
        },
        {
            "title": "One danger every teen faces in technology",
            "datePublished": "Thu, 01 Jun 2017 18:00:00 -0000",
            "description": "Do you have a teen in your family? This podcast is for you! We will be discussing a serious threat facing our youth in the digital world – teen sexting. This dangerous practice is causing serious legal and social consequences that will negatively impact our kids' future. It is our job as parents to help change this dialogue. But how can you keep your kids from being exposed to obscene material and sharing it with others? We’ll look at all of these issues and more in this Komando on Demand podcast.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/chtbl.com/track/28E15G/traffic.megaphone.fm/WSMM2855235161.mp3"
        },
        {
            "title": " Critical advice every entrepreneur needs to know on being successful ",
            "datePublished": "Thu, 25 May 2017 22:00:00 -0000",
            "description": "We are all in some way entrepreneurs: You're the president of your own career, your own life, your own finances, your own health. David Friend, owner of Carbonite, has been a successful entrepreneur for over 25 years. In this podcast, we interview David, talk about his success, his new venture and his advice on becoming a successful entrepreneur.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/chtbl.com/track/28E15G/traffic.megaphone.fm/WSMM1996331106.mp3"
        },
        {
            "title": "Take an intimate tour of a disturbing place - The Dark Web - Episode 1",
            "datePublished": "Thu, 09 Mar 2017 09:00:00 -0000",
            "description": "The first episode of a two-part series on a world most have only heard about: The Dark Web. We tell the story of an organization that lost its innocence after losing thousands of dollars. Discover how The Dark Web is allowing crime to run rampant.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/chtbl.com/track/28E15G/traffic.megaphone.fm/WSMM1511039757.mp3"
        },
        {
            "title": "Take an intimate tour of a disturbing place -- The Dark Web-Episode 2",
            "datePublished": "Thu, 09 Mar 2017 09:00:00 -0000",
            "description": "The second part in the series on a world most have only heard about: The Dark Web. We talk to the documentary filmmaker who will surprise you when he says the media has gotten it all wrong. Discover how The Dark Web is not what you think.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/chtbl.com/track/28E15G/traffic.megaphone.fm/WSMM5836699271.mp3"
        },
        {
            "title": "How to make money on YouTube",
            "datePublished": "Thu, 28 Apr 2016 20:00:00 -0000",
            "description": "With just a video camera and internet connection you can star in your own show on the Web. The Queen of Useless Robots and Clintus TV's Clintus McGintus, went from scratch to success. Find out how these two YouTube big superstars got to fame and make money!",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/chtbl.com/track/28E15G/traffic.megaphone.fm/WSMM2014818619.mp3"
        }
    ]
}