{
    "artwork": "http://is3.mzstatic.com/image/thumb/Music71/v4/c1/bf/35/c1bf3597-055c-2467-9752-d6530a312a4f/source/100x100bb.jpg",
    "description": "A podcast discussing different behavioral anomalies related to economics, marketing, psychology, public policy, consumer preference and food science.  Hosted by Cornell University graduate students.",
    "feedURL": "https://madhateconomicspodcast.wordpress.com/category/podcast/feed/",
    "podcastURL": "https://madhateconomicspodcast.wordpress.com",
    "publisher": "mad hat pod",
    "title": "Mad Hat Economics",
    "episodes": [
        {
            "title": "45: Consulting with Behavioral Science",
            "datePublished": "Wed, 24 Jun 2020 03:26:47 +0000",
            "description": "We have Raphaelle March, Head of Behavioral Design at Cowry Consulting, joining us to share how behavioral science can provide creative and effective solutions to solve complex problems across industries. She shares some interesting case studies from construction and insurance industry. Hosted by Professor David Just and Afshan Husain",
            "length": "0",
            "sourceUrl": "http://cornell.box.com/shared/static/4jm45asq08viecxs3g5w9p3yvembdok9.mp3",
            "categories": [
                "Podcast"
            ]
        },
        {
            "title": "44: Is Behavioral Science the Answer?",
            "datePublished": "Fri, 12 Jun 2020 16:00:28 +0000",
            "description": "Behavioral Scientist Matt Walleart joins us to talk about his passion for behavioral science, what drew him to the field, and his diverse experience in applying behavioral science. Listen to his take on what he thinks is the future of behavioral science. Hosted by Professor David Just and Afshan Husain ",
            "length": "0",
            "sourceUrl": "http://cornell.box.com/shared/static/jivd8f5qqcxxsnlrkymkd173zedhldb4.mp3",
            "categories": [
                "Podcast"
            ]
        },
        {
            "title": "43: Context Matters: Behavioral Economics and Development",
            "datePublished": "Thu, 14 May 2020 18:30:36 +0000",
            "description": "Anisha Singh, Research Director at Busara Center for Behavioral Economics joins us from Nairobi to share her experience in applying behavioral science in the Global South. Join us in this exciting episode to understand how behavioral science learnings are contextualised across different cultures and economies. Anisha shares great insights about the challenges of running field experiments in developing countries. Hosted by Professor David Just, Afshan Husain and Stuti Agarwal. ",
            "length": "0",
            "sourceUrl": "http://cornell.box.com/shared/static/y2s97yr1s06wfi3055yv4761rk4jtb3h.mp3",
            "categories": [
                "Podcast"
            ]
        },
        {
            "title": "42: Better Outcomes with Behavioral Science",
            "datePublished": "Thu, 16 Apr 2020 16:00:30 +0000",
            "description": "Dr. Jason Riis, founder and president of Behavioralize joins us to talk about his journey applying behavioral science in solving problems in food consumption and healthcare. He is passionate about analysing behavioral biases and shares some fascinating work that Behavioralize is doing in the behavioral consulting space. Hosted by Professor David Just, Afshan Husain and Stuti Agarwal. ",
            "length": "0",
            "sourceUrl": "http://cornell.box.com/shared/static/mgqsrrb526a722pf3k0ykj6xp50lm3p8.mp3",
            "categories": [
                "Podcast"
            ]
        },
        {
            "title": "41: Behavioral Economics in Advertising",
            "datePublished": "Sun, 29 Mar 2020 15:06:25 +0000",
            "description": "We are back! For the first episode of 2020 we have Mr. Daniel Bennett, Director of Behavioral Consulting Unit at Ogilvy UK. He talks to us about his some really interesting applications of behavioral theory in marketing and advertising to solve rather sticky problems. Hosed by Professor David Just and Afshan Husain. ",
            "length": "0",
            "sourceUrl": "http://cornell.box.com/shared/static/32j9k8oos3qp7ngj2ajfmca5x8ogkydj.mp3",
            "categories": [
                "Podcast"
            ]
        },
        {
            "title": "40: Gender Equality",
            "datePublished": "Mon, 06 Aug 2018 17:53:17 +0000",
            "description": "For this episode we’re joined by Octaviano Canuto of the World Bank to talk about how gender equality promotes development.  Hosted by Yudong Rao, Elaine Qiu, and Professor David Just.",
            "length": "8",
            "sourceUrl": "http://cornell.box.com/shared/static/00ewjnnjq3dwd2055d16z8a28vjfntfa.mp3",
            "categories": [
                "Podcast",
                "development",
                "gender",
                "gender equality"
            ]
        },
        {
            "title": "39: Food Waste",
            "datePublished": "Wed, 18 Jul 2018 16:07:57 +0000",
            "description": "In this episode we are joined by Dr. Richard Swannell of WRAP (Waste and Resources Action Programme) to discuss food waste.  We talk about how we can reduce food waste by interpreting labeling and extending the life of a product.  We also talk about the economic benefit of reducing food waste at home and for industries.  Hosted by Yudong Rao, Elaine Qiu, and Professor David Just.",
            "length": "8",
            "sourceUrl": "http://cornell.box.com/shared/static/554zja7k4dx58ouey86ncrfch8gvehhz.mp3",
            "categories": [
                "Podcast",
                "food waste"
            ]
        },
        {
            "title": "38: Women in Leadership",
            "datePublished": "Fri, 25 May 2018 20:00:07 +0000",
            "description": "For this special episode we’re joined by Dean Lynn Perry Wooten, Dean of the Dyson School to talk about the incoming Dyson class and its constitution at the undergraduate and MPS level.  From there we explore the greater makeup of our fields, discus the diversity therein and how to attract a wider array of people to them.  He also talk about the dearth of diversity of CEOs and in C-Suites in general except for under some notable circumstances.  Finally we quiz Dean Wooten about various topics in the context of overrated/underrated (borrowed from Planet Money’s, The Indicator).  Hosted by Elaine Qiu, Yudong Rao, and Professor David Just.",
            "length": "8",
            "sourceUrl": "http://cornell.box.com/shared/static/9k8hgutjldpkl0e9eysgr1kaspw9f5ty.mp3",
            "categories": [
                "Podcast"
            ]
        },
        {
            "title": "37: Adopting Blockchain",
            "datePublished": "Tue, 08 May 2018 18:39:18 +0000",
            "description": "We are joined by Dr. Feng Han, co-founder of Elastos and visiting scholar at Columbia University, to talk about his expertise in blockchain.  We cover how blockchain can be adopted to help to inform consumers about the products they consume and how it can act as reassurance in communication and transactions.  We also talk about how it might be adopted at a larger scale.  Hosted by Yudong Rao, Yin Yu, and Professor David Just.",
            "length": "8",
            "sourceUrl": "http://cornell.box.com/shared/static/2wjvrfz8eyhunqz5g6bp31jcs5pu4var.mp3",
            "categories": [
                "Podcast",
                "Behavioral Economics",
                "Blockchain",
                "consumer",
                "food security",
                "security"
            ]
        },
        {
            "title": "36: Soda Tax",
            "datePublished": "Mon, 16 Apr 2018 14:00:41 +0000",
            "description": "Today we’re joined again by PhD candidate Jakina Debnam to talk about sugar-sweetened beverage (soda) taxes in Berkeley, Philadelphia and elsewhere.  We talk about who these taxes affect the most and the reactions to the taxes from their local populations.  We also talk about how similar taxes may be levied on other goods.  Hosted by Yudong Rao, Elaine Qiu, and Professor David Just.",
            "length": "8",
            "sourceUrl": "http://cornell.box.com/shared/static/fgmng8uhkxg6d0ibzzlpw3pd5cv1o1tn.mp3",
            "categories": [
                "Podcast",
                "behavior",
                "Behavioral Economics",
                "Berkeley",
                "Philadelphia",
                "soda",
                "soda tax",
                "taxes"
            ]
        },
        {
            "title": "35: Responses to Labor Saving Technical Changes",
            "datePublished": "Mon, 09 Apr 2018 17:51:44 +0000",
            "description": "We are joined by Professor Ravi Kanbur to talk about how technology has displaced jobs historically and is actively.  We also talk about ways to account for this in our era with skilled workers, tax and transfer, and policy interventions.  Hosted by Yudong Rao, Elaine Qiu, and Professor David Just.",
            "length": "8",
            "sourceUrl": "http://cornell.box.com/shared/static/oljs7ltcob315cr8pe756nx5xlcuo7f3.mp3",
            "categories": [
                "Podcast"
            ]
        },
        {
            "title": "34: Wage Stagnation",
            "datePublished": "Thu, 22 Mar 2018 20:22:49 +0000",
            "description": "We’re joined by Dr. Ryan Nunn of the Brookings Institute to talk about wage stagnation; what contributes to it, how it has occurred of late, how the dissemination of knowledge about wages at a firm or in a field might affect it and what impact upcoming technologies might have on it. Hosted by Yudong Rao, Elaine Qiu, and Professor David Just.",
            "length": "8",
            "sourceUrl": "http://cornell.box.com/shared/static/nr3gxpsyxzf7eojn4livxrh7ld1vyz9t.mp3",
            "categories": [
                "Podcast"
            ]
        },
        {
            "title": "33: Sweatshops",
            "datePublished": "Wed, 14 Mar 2018 19:03:09 +0000",
            "description": "Today we’re joined by Professor Nancy Chau of Cornell University to talk about her research on sweatshops.  Hosted by Yudong Rao, Elaine Qiu, and Professor David Just.",
            "length": "8",
            "sourceUrl": "http://cornell.box.com/shared/static/u5zpl5u7cazog21zavilo1an9ypwh11b.mp3",
            "categories": [
                "Podcast",
                "behavior",
                "Behavioral Economics",
                "sweatshops"
            ]
        },
        {
            "title": "32: Data Privacy",
            "datePublished": "Mon, 05 Mar 2018 20:28:51 +0000",
            "description": "For this episode we are joined by PhD candidate Joy Wu and Professor Aija Leiponen to discuss data privacy; how it is collected, who possess it, and should we have more power to choose how it’s disclosed.  Hosted by Elaine Qiu, Yudong Rao, and Professor David Just.",
            "length": "8",
            "sourceUrl": "http://cornell.box.com/shared/static/5jhter5jo2j045idsb1mdnsqobhxh21y.mp3",
            "categories": [
                "Podcast",
                "behavior",
                "consumer",
                "data privacy",
                "disclosure",
                "Internat",
                "privacy"
            ]
        },
        {
            "title": "31: Social Capital",
            "datePublished": "Thu, 08 Feb 2018 16:58:28 +0000",
            "description": "Professor Lindon Robison of Michigan State University joins us today to discuss his pioneering research on social capital.  Hosted by Yudong Rao, Elaine Qiu, and Professor David Just.\n\ntwitter.com/MadHatEconomics\nmadhatecon@gmail.com ",
            "length": "8",
            "sourceUrl": "http://cornell.box.com/shared/static/rvmg4q3mywqcro6zjkafkznrmipt2ick.mp3",
            "categories": [
                "Podcast",
                "behavior",
                "Behavioral Economics",
                "consumer",
                "social capital"
            ]
        },
        {
            "title": "30: Machine Learning",
            "datePublished": "Wed, 24 Jan 2018 18:30:26 +0000",
            "description": "",
            "length": "8",
            "sourceUrl": "http://cornell.box.com/shared/static/riwpqt9xdq4fqe3qf6j0y5d4fa98m992.mp3",
            "categories": [
                "Podcast",
                "ai",
                "behavior",
                "car",
                "machine learning"
            ]
        },
        {
            "title": "29: Honey Bees’ Choice",
            "datePublished": "Fri, 01 Dec 2017 21:25:33 +0000",
            "description": "We are joined by Dr. Michael Smith to discuss his research on honey bee behavior, his passion and history of beekeeping and his study that garnered him an Ig Nobel Prize in 2015.  Hosted by Yudong Rao and Professor David Just.",
            "length": "8",
            "sourceUrl": "http://cornell.box.com/shared/static/7k1jeevq1y10zdtbvtxrrl12vdc2lppe.mp3",
            "categories": [
                "Podcast",
                "bees",
                "behavior",
                "choice",
                "honey bees",
                "Ig Nobel"
            ]
        },
        {
            "title": "28: Quinoa Craze",
            "datePublished": "Wed, 22 Nov 2017 17:00:08 +0000",
            "description": "We are joined today by Professor Marc Bellemare of the University of Minnesota to talk about his research on the recent price spike in quinoa due to its rising popularity in many western countries as a 'health food’ and how this rise as a viable export economically impacts those who traditionally grow and consume it.  We also discuss how food staples become staples and why only eating food that indigenous to your region isn’t necessarily a good practice.  Hosted by Ceren Karacasu, Yudong Rao and Professor David Just.",
            "length": "8",
            "sourceUrl": "http://cornell.box.com/shared/static/phcq2hz34jnr09lrz05ahipfc7hz39xz.mp3",
            "categories": [
                "Podcast",
                "behavior",
                "farming",
                "food",
                "quinoa"
            ]
        },
        {
            "title": "27: Farmer’s Preference",
            "datePublished": "Wed, 15 Nov 2017 17:46:26 +0000",
            "description": "We are joined today by Dr. Jaap Sok of Wageningen University to discuss his recent research into farmer’s preference for blue tongue vaccinations.  Hosted by Elaine Qiu, Ceren Karacasu, Yudong Rao and Professor David Just.",
            "length": "8",
            "sourceUrl": "http://cornell.box.com/shared/static/vxj89e8izupcetqj53aq5uyi9sfaj9bv.mp3",
            "categories": [
                "Podcast"
            ]
        },
        {
            "title": "26: Technology for Health Promoting Behavior",
            "datePublished": "Wed, 25 Oct 2017 17:49:00 +0000",
            "description": "We are joined by Professor Dan Connors of University of Colorado Denver to discuss his research on leveraging technology to increase efficiency in the healthcare system specifically in regards to fighting the opioid epidemic in the US.  He also talks with us about using internet of things technology to promote better personal health.  Hosted by Ceren Karacasu, Yudong Rao, Elaine Qiu and David Just.",
            "length": "8",
            "sourceUrl": "http://cornell.box.com/shared/static/lomsvgrha1ncdp5vm6jzpsiptoby6tq4.mp3",
            "categories": [
                "Podcast",
                "behavior",
                "health",
                "health technology"
            ]
        },
        {
            "title": "25: CEO Behavior and Corporate Decisions",
            "datePublished": "Wed, 18 Oct 2017 18:04:59 +0000",
            "description": "Today we are joined by Professor Scott Yonker to talk about his research on CEOs impact on corporate decisions.  We go into many factors about how CEOs personal background and private decision making can steer the habits of a whole corporation.  Hosted by Ceren Karacasu, Yudong Rao, Elaine Qiu and David Just.",
            "length": "8",
            "sourceUrl": "http://cornell.box.com/shared/static/syun6d913vwwflsxj01m9605muqst5fa.mp3",
            "categories": [
                "Podcast",
                "behavior",
                "CEO",
                "Corporate Policy",
                "Corporations"
            ]
        },
        {
            "title": "24: Bitcoin, Bubbles and Bulbs",
            "datePublished": "Fri, 06 Oct 2017 19:11:59 +0000",
            "description": "In this episode we are joined by MBA Student Cruise Chen to talk about bitcoin and some of the rationales as to why people invest in it.  We also talk about economic bubbles and the history of how and why they form.  Hosted by Ceren Karacasu, Yudong Rao and David Just.",
            "length": "8",
            "sourceUrl": "http://cornell.box.com/shared/static/crkcrg48yifnxkbdqkdbuvsduz7z9das.mp3",
            "categories": [
                "Podcast",
                "behavior",
                "bitcoin",
                "cryptocurrency",
                "economic bubbles",
                "tulips"
            ]
        },
        {
            "title": "23: Behavioral Dimensions of Food Security",
            "datePublished": "Fri, 29 Sep 2017 19:26:04 +0000",
            "description": "Welcome back to Mad Hat Economics!  Today we’re joined by Masters Student Prankur Gupta to talk about behavioral dimensions of food security and his work in India on food security and policy.",
            "length": "8",
            "sourceUrl": "http://cornell.box.com/shared/static/21kup4gdjlolxqri99y86a0muv0x4n24.mp3",
            "categories": [
                "Podcast",
                "behavior",
                "Behavioral Economics",
                "developing nations",
                "food policy",
                "food security",
                "India"
            ]
        },
        {
            "title": "22: Behavioral Econ in Developing Nations",
            "datePublished": "Wed, 16 Aug 2017 21:04:47 +0000",
            "description": "Today we’re joined by special guest, creator and former host of Mad Hat Economics, Roberto Figari.  We discuss Roberto’s work in implementing behavioral economics strategies in developmental situations in Africa.",
            "length": "8",
            "sourceUrl": "http://cornell.box.com/shared/static/i3ihum11bqvopmk7x8gbjoavox4a5sy0.mp3",
            "categories": [
                "Podcast",
                "Africa",
                "Behavioral Economics",
                "development",
                "mobile phones",
                "money"
            ]
        },
        {
            "title": "21: Behavioral Econ in Action",
            "datePublished": "Thu, 27 Jul 2017 20:04:32 +0000",
            "description": "In this episode we’re joined by Professor David Pizarro to discuss behavioral economics in action; how it’s utilized and implemented in industry and the landscape of behavioral economics consulting.",
            "length": "8",
            "sourceUrl": "http://cornell.box.com/shared/static/xs5hhqyqwrn59p469fe9x0rbls2jodgy.mp3",
            "categories": [
                "Podcast",
                "behavior"
            ]
        },
        {
            "title": "20: Nudging Tax Compliance",
            "datePublished": "Mon, 10 Jul 2017 18:52:18 +0000",
            "description": "We are joined this week by Professor Bill Schulze and Masters Student Seth Olson to discuss tax compliance.  We examine how to nudge people into paying taxes with injunctive norms  and cover some of Professor Schulze’s previous research on taxes.\nTweet us @MadHatEconomics\nEmail us madhatecon@gmail.com",
            "length": "8",
            "sourceUrl": "http://cornell.box.com/shared/static/mpeask2szgfu4qrwr1j09jmqe0v0o06q.mp3",
            "categories": [
                "Podcast",
                "behavior",
                "nudging",
                "taxes"
            ]
        },
        {
            "title": "19 Queuing Theory",
            "datePublished": "Thu, 01 Jun 2017 19:03:26 +0000",
            "description": "Join us in a discussion about queueing theory with guests Professor Jamol Pender and PhD candidate Sophia Novitzky as we discuss how to navigate common areas of lining up and how you might navigate it for the optimal personal result.   ",
            "length": "8",
            "sourceUrl": "http://cornell.box.com/shared/static/lp629978edvf31wwg0rct4bgx4fy6807.mp3",
            "categories": [
                "Podcast",
                "behavior",
                "driving",
                "lines",
                "queuing"
            ]
        },
        {
            "title": "18: Confirmation Bias in Your (Fake?) News",
            "datePublished": "Fri, 19 May 2017 18:05:15 +0000",
            "description": "Join us in a wide ranging discussion about confirmation bias in the news sources that we choose to follow in our everyday lives.  We cover how in light of the societal shift in the US it has become important to branch out and digest sources that countervail our own opinions and to take a page out of the books of journalists and question the source and how it might spin the presentation of information.",
            "length": "8",
            "sourceUrl": "http://cornell.box.com/shared/static/4xx4m51lneyxzgk0zl00acjtoxf51hfv.mp3",
            "categories": [
                "Podcast",
                "confirmation bias",
                "media",
                "news",
                "reaction"
            ]
        },
        {
            "title": "17: Choice Overload",
            "datePublished": "Thu, 11 May 2017 18:11:07 +0000",
            "description": "Grad students Jackie Stein and Liz Bell and Professor David Just are joined by PhD candidate Anne Byrne to discuss choice overload in our physical and digital shopping environments.\nTweet us @MadHatEconomics\nEmail us madhatecon@gmail.com",
            "length": "8",
            "sourceUrl": "http://cornell.box.com/shared/static/aao6h0xvpyetyi4c4r6gtzn5zvrkccpq.mp3",
            "categories": [
                "Podcast"
            ]
        },
        {
            "title": "16: The Ethics of Nudging",
            "datePublished": "Wed, 03 May 2017 20:58:01 +0000",
            "description": "Join grad students Jackie Stein and Liz Bell and Professor David Just in discussing how your environment can influence your behavior, what nudges can do for you and how much nudging is too much. \nTweet us @MadHatEconomics\nEmail us madhatecon@gmail.com",
            "length": "8",
            "sourceUrl": "http://cornell.box.com/shared/static/99s7k2kx4ozqn8cgotz6jife1wirgpts.mp3",
            "categories": [
                "Podcast",
                "behavior",
                "food",
                "nudging"
            ]
        },
        {
            "title": "15: Retro Foods and Selling Nostalgia",
            "datePublished": "Wed, 19 Apr 2017 17:10:05 +0000",
            "description": "Join grad student Jackie Stein, Professor David Just and special guest Catalina Velez as they discuss retro foods and selling consumers products based on their past experiences and feelings.\nTweet us @MadHatEconomics\nEmail us madhatecon@gmail.com",
            "length": "8",
            "sourceUrl": "http://cornell.box.com/shared/static/6zflt824j9jxnpqkzvglx8s3fels602k.mp3",
            "categories": [
                "Podcast",
                "advertising",
                "behavior",
                "food",
                "nostalgia",
                "reaction",
                "retro"
            ]
        },
        {
            "title": "14: Honor Codes",
            "datePublished": "Thu, 16 Mar 2017 15:08:34 +0000",
            "description": "In this episode grad students Jackie Stein and Liz Bell and Professor David Just discuss honor codes and their application in common tasks.\nTweet us @MadHatEconomics\nEmail us madhatecon@gmail.com",
            "length": "8",
            "sourceUrl": "http://cornell.box.com/shared/static/xvlcgvfm8cxe2geokfiwwmqngds18zs0.mp3",
            "categories": [
                "Podcast",
                "behavior",
                "habits",
                "Honor codes",
                "trust"
            ]
        },
        {
            "title": "13: Eating Habits for You and Your Kids",
            "datePublished": "Wed, 08 Mar 2017 23:00:52 +0000",
            "description": "In this episode, with guest Professor Brian Wansink, we discuss research Professors Wansink and Just have done into eating behavior and what you can in a variety of environments to help your kids and you eat healthier.\nTweet us @MadHatEconomics\nEmail us madhatecon@gmail.com",
            "length": "8",
            "sourceUrl": "http://cornell.box.com/shared/static/xwrilq49w8yzgm73nplga0tg0sm6du9m.mp3",
            "categories": [
                "Podcast",
                "behavior",
                "Child eating",
                "consumption",
                "food",
                "habits"
            ]
        },
        {
            "title": "12: Advertising and Consumer Perception",
            "datePublished": "Tue, 28 Feb 2017 11:00:00 +0000",
            "description": "In this episode, with guest Professor Harry Kaiser, we discuss advertising and consumer perception based around research Professor Kaiser did in relation to Mad Cow Disease and also we also discuss consumer perception of GMO labeling.\nTweet us @MadHatEconomics\nEmail us madhatecon@gmail.com",
            "length": "8",
            "sourceUrl": "http://cornell.box.com/shared/static/pbr4y2rnuvu7vjhv1awel4lj1w0xnbzx.mp3",
            "categories": [
                "Podcast",
                "advertising",
                "consumer perception",
                "Consumers",
                "habits",
                "mad cow"
            ]
        },
        {
            "title": "11: Valentines Day Gifts, a Revisit",
            "datePublished": "Tue, 14 Feb 2017 11:00:03 +0000",
            "description": "In this episode grad students Jackie Stein, Liz Bell and Ceren Karacasu and professor David Just revisit the study done previously about the gift giving habits of people at Valentines Day and what results the expanded pool of participants reveals.\nTweet us @MadHatEconomics\nEmail us madhatecon@gmail.com",
            "length": "8",
            "sourceUrl": "http://cornell.box.com/shared/static/fcgazivnn7kbnhs15gh50m5pb4m8tjp6.mp3",
            "categories": [
                "Podcast",
                "gifs",
                "gifting",
                "habits",
                "holidays",
                "Valentines"
            ]
        },
        {
            "title": "10: Holiday Shopping Strategizing",
            "datePublished": "Fri, 23 Dec 2016 11:00:00 +0000",
            "description": "In this episode grad student Jackie Stein, post-doc Gnel Gabrielyan and professor David Just discuss shopping in the holiday season, black Friday \"deals\" and the makeup of sales this holiday season.\nTweet us @MadHatEconomics\nEmail us madhatecon@gmail.com",
            "length": "8",
            "sourceUrl": "http://cornell.box.com/shared/static/vpz20yxylal1rrj7noo9cs4nlg6446ew.mp3",
            "categories": [
                "Podcast",
                "holidays",
                "shopping strategy"
            ]
        },
        {
            "title": "09: Investing in Your Children",
            "datePublished": "Fri, 16 Dec 2016 11:00:48 +0000",
            "description": "In this episode grad students Jackie Stein, Liz Bell and Ceren Karacasu and Professors David Just and Vickie Bogan discuss how parents invest in their children through 529 plans and other means.\nTweet us @MadHatEconomics\nEmail us madhatecon@gmail.com",
            "length": "8",
            "sourceUrl": "http://cornell.box.com/shared/static/9ko3re8op6sxtfe9vagpig5x14lf3pf4.mp3",
            "categories": [
                "Podcast",
                "children",
                "college",
                "Investing"
            ]
        },
        {
            "title": "08: Economic Paternalism",
            "datePublished": "Fri, 09 Dec 2016 11:00:09 +0000",
            "description": "In this episode grad students Jackie Stein, Liz Bell and Jakina Debnam and Professor David Just discuss economic paternalism in policy and decision making and the consequences of instituting policies.\nTweet us @MadHatEconomics\nEmail us madhatecon@gmail.com",
            "length": "8",
            "sourceUrl": "http://cornell.box.com/shared/static/cj0m6d943qlqpsltyhugwt2hxv7msysl.mp3",
            "categories": [
                "Podcast",
                "behavior",
                "Behavioral Economics",
                "design",
                "Economic paternalism",
                "shopping"
            ]
        },
        {
            "title": "07: Election Shock",
            "datePublished": "Tue, 29 Nov 2016 19:21:32 +0000",
            "description": "In this episode grad students Jackie Stein, Jade Womack and Ceren Karacasu along with Professor David Just discuss the fallout from the 2016 US Presidential election, the reaction to the \"shock\" outcome of the election and why the outcome may've not been so far fetched as pre-election forecasts indicated.\nRecorded 11-11-16\nTweet us @MadHatEconomics\nEmail us madhatecon@gmail.com",
            "length": "8",
            "sourceUrl": "http://cornell.box.com/shared/static/rrg0ny7q8bto4r1c4i1kcvjpbn5inquz.mp3",
            "categories": [
                "Podcast",
                "2016 election",
                "bias",
                "perception",
                "reaction",
                "shock",
                "US politics"
            ]
        },
        {
            "title": "06: Holiday Eating",
            "datePublished": "Wed, 23 Nov 2016 02:28:01 +0000",
            "description": "In this episode grad student Jackie Stein, Prof. David Just and visiting scholars Raquel Diaz and Ben Missbach discuss Thanksgiving and similar holidays that inspire increased eating of high calorie foods across the world and how to possibly adjust to a holiday diet.\nTweet us @MadHatEconomics\nEmail us madhatecon@gmail.com",
            "length": "8",
            "sourceUrl": "http://cornell.box.com/shared/static/q4wbrgi40i16y8enh1qsw1zxglq76yp2.mp3",
            "categories": [
                "Podcast",
                "behavior",
                "Behavioral Economics",
                "eating habits",
                "habits",
                "holidays"
            ]
        },
        {
            "title": "05: Tiny Habits and Behavioral Change",
            "datePublished": "Wed, 23 Nov 2016 02:22:13 +0000",
            "description": "In this first episode of the second season the podcast crew discuss Tiny habits by DR BJ Fogg and how they can be used to change behavior in a manner more conducive to our lifestyles and how they relate back to behavioral economics.\nTweet us @MadHatEconomics\nEmail us madhatecon@gmail.com",
            "length": "8",
            "sourceUrl": "http://cornell.box.com/shared/static/angrqeu7tev96tlnmkam6kwr0qrwh4v4.mp3",
            "categories": [
                "Podcast",
                "behavior",
                "change behavior",
                "tiny habits"
            ]
        },
        {
            "title": "04: Marijuana and Obesity",
            "datePublished": "Wed, 23 Nov 2016 02:07:56 +0000",
            "description": "In this episode Host Roberto Figari is Joined by 'master' PhD candidate Jeff Swigert, Professor David Just and masters student Andrew Lysaught in discussing marijuana legalization and it's relation to obesity in the United States.\nOriginally published April 2016\nTweet us @MadHatEconomics\nEmail us madhatecon@gmail.com",
            "length": "8",
            "sourceUrl": "http://cornell.box.com/shared/static/4q1srgvag7xm7bcl7reuqjy152wmylva.mp3",
            "categories": [
                "Podcast",
                "behavior",
                "Behavioral Economics",
                "habits",
                "Marijuana",
                "obesity"
            ]
        },
        {
            "title": "03: Valentines Day Gifts",
            "datePublished": "Wed, 23 Nov 2016 01:20:17 +0000",
            "description": "In this episode Professor David Just and Food and Brand Lab staffers Adam Brumberg and Katie Baildon discuss valentines day gift giving.\nOriginally published March 2016.\nTweet us @MadHatEconomics\nEmail us madhatecon@gmail.com",
            "length": "8",
            "sourceUrl": "http://cornell.box.com/shared/static/z95adgnixwv510z5zkvqc32z9ff6py9l.mp3",
            "categories": [
                "Podcast",
                "chocolate",
                "gifs",
                "gift cards",
                "gifting",
                "holidays",
                "trends",
                "Valentines"
            ]
        },
        {
            "title": "02: Lotteries",
            "datePublished": "Wed, 23 Nov 2016 01:14:05 +0000",
            "description": "In this episode host Roberto Figari Professor David Just and Food and Brand Lab researcher Gnel Gabrielyan discuss lotteries and who plays them.\nOriginally published March 2016.\nTweet us @MadHatEconomics\nEmail us madhatecon@gmail.com",
            "length": "8",
            "sourceUrl": "http://cornell.box.com/shared/static/3x1bp4ksmi9e8stz5qygmmt97qv7h53s.mp3",
            "categories": [
                "Podcast",
                "lotteries",
                "Maine",
                "taxes"
            ]
        },
        {
            "title": "Episode 01",
            "datePublished": "Wed, 23 Nov 2016 00:59:30 +0000",
            "description": "In this episode Cornell graduate students discuss recent behavioral trends.\nOriginally published March 2016.\nTweet us @MadHatEconomics\nEmail us madhatecon@gmail.com",
            "length": "8",
            "sourceUrl": "http://cornell.box.com/shared/static/deh28zwmopkwr3vs0ia0nhspddaczvbd.mp3",
            "categories": [
                "Podcast",
                "Behavioral Economics"
            ]
        }
    ]
}