{
    "artwork": "http://is2.mzstatic.com/image/thumb/Music71/v4/5c/64/97/5c649735-f3c9-b274-1363-8f8552a231b4/source/100x100bb.jpg",
    "description": "Welcome to Microphone Check, hip-hop culture with Ali Shaheed Muhammad and Frannie Kelley.\n\nTranscripts, portraits and info at https://www.frannieandali.com/",
    "feedURL": "http://feeds.soundcloud.com/users/soundcloud:users:53616694/sounds.rss",
    "podcastURL": "https://www.frannieandali.com/",
    "title": "Microphone Check",
    "episodes": [
        {
            "title": "We're Back — Only On Spotify",
            "datePublished": "Sat, 24 Feb 2018 16:47:38 +0000",
            "description": "Microphone Check — the place where artists can talk about whatever concerns and interests they have, where they feel free to sound off and fan out on Ali Shaheed Muhammad and tell stories they’ve never told in public before — is back. February 27, only on Spotify.",
            "length": "5014338",
            "sourceUrl": "http://feeds.soundcloud.com/stream/404554776-frannieandali-were-back-only-on-spotify.mp3"
        },
        {
            "title": "Ill Camille",
            "datePublished": "Tue, 18 Jul 2017 16:45:21 +0000",
            "description": "Ill Camille was born and raised and still resides in Los Angeles, for the moment, and in March she released an album called Heirloom that we really love. We spoke to her about all her various jobs in the music industry, a path that eventually led her to stepping out in front and telling her own story.\n\nYou can read the transcript of our conversation on our web site, frannieandali.com, where you’ll also find our full archive.",
            "length": "72783948",
            "sourceUrl": "http://feeds.soundcloud.com/stream/333738261-frannieandali-ill-camille.mp3"
        },
        {
            "title": "Z-Ro",
            "datePublished": "Mon, 19 Jun 2017 17:49:31 +0000",
            "description": "We taped this interview before we had any idea Z-Ro would later announce his retirement from music – he's said the album he's releasing on June 30th, No Love Boulevard, will be his last.﻿ It's our loss, especially because you can tell here (back then) that he was excited to release new work, and felt like he was sitting on heat. But he also details his frustrations with the industry in our conversation, so his retirement is not a total surprise. \n\nWe're grateful he spent some time with us when he was still in the game, we're so thankful for the music he gave us while he was, and we wish him the best of luck in all his future pursuits.",
            "length": "60492534",
            "sourceUrl": "http://feeds.soundcloud.com/stream/328859412-frannieandali-z-ro.mp3"
        },
        {
            "title": "kris ex, Part 2",
            "datePublished": "Mon, 12 Jun 2017 01:15:04 +0000",
            "description": "To situate you in this episode, we left off last week when kris asked Ali how it would feel for his work today to be criticized and Ali’s response began with him saying he’s not worried about it because he’s right with himself, brought it back to Kendrick and \"DNA.\" and ended in him saying Fox News is meaningless.",
            "length": "68506976",
            "sourceUrl": "http://feeds.soundcloud.com/stream/327624655-frannieandali-microphone-check-kris-ex-part-2.mp3"
        },
        {
            "title": "Doc McKinney: 'There's Enough Bad Music Out There'",
            "datePublished": "Mon, 24 Oct 2016 16:52:56 +0000",
            "description": "Doc McKinney, the Minneapolis-born, Toronto-living producer and manager who's worked with Lucy Pearl, The Weeknd, Drake, Young Buck, Esthero and thestand4rd spoke with us about brands and music — he had a reluctant hand in the Hamburger Helper mixtape that popped off in the spring — Canadian hip-hop past and present, the ways having kids affected his business and his art, the ideal circumstances for collaboration, Spongebob, Lee Scratch Perry, Janet Jackson, the pitfalls of interviews and J Dilla.",
            "length": "91913033",
            "sourceUrl": "http://feeds.soundcloud.com/stream/289746630-frannieandali-doc-mckinney-theres-enough-bad-music-out-there.mp3"
        },
        {
            "title": "Warren G: 'It's A Cold Game'",
            "datePublished": "Fri, 08 Jul 2016 17:16:52 +0000",
            "description": "Last summer we linked with Warren G for the last interview we tried to do bicoastal. And it's fitting that one of the main instigators of G-funk music was the one who convinced us to move operations to LA. We're airing it now, because despite some disconnect, the insight and the tempo is too good to bury.\n\nWe spoke about \"Deeez Nuuuts\" and payola and the best places to dig. Warren G is smooth as ever in conversation with somebody from the other side of the country who first met him when everything was getting started, Ali Shaheed Muhammad.",
            "length": "71440718",
            "sourceUrl": "http://feeds.soundcloud.com/stream/272766932-frannieandali-warren-g-its-a-cold-game.mp3"
        },
        {
            "title": "Rap Dads, Daughters And Sons: The Father's Day Episode",
            "datePublished": "Fri, 17 Jun 2016 19:16:15 +0000",
            "description": "Our producer, David Luke, father of David Luke III, put together this special edition of Microphone Check, a compliation of times when the musicians we've sat with over the past couple years spoke about fatherhood.\n\nWhen we interviewed these guests — Danny Brown, Solange, Cormega, T.I., Killer Mike and El-P, Big Sean, Terrace Martin and Mr. MFN eXquire — we didn't always directly ask about their fathers; they brought up the idea and the men themselves when we were talking about getting put on, deciding how to structure a career and the ways growing older affects music-making. We're not only talking about biological fathers here. These moments are about the reverberations of father figures, mentors, uncles, teachers.\n\nAnd, of course, some of our guests relate stories about raising kids themselves, the emotional roller coaster of it, and the fiercely kept promise inherent in there.\n\nWe hope that in this episode you can really hear the real life people who create and perform the music we all love.\n\nShout to Frannie's dad, Larry Kelley, and to Ali's dad, resting in peace. Happy first Father's Day to Cedric Shine, our voice on socials and whose beautiful daughter adorns this page! And happy seventh Father's Day to David, who made this for you.",
            "length": "36329299",
            "sourceUrl": "http://feeds.soundcloud.com/stream/269635968-frannieandali-rap-dads-daughters-and-sons-the-fathers-day-episode.mp3"
        },
        {
            "title": "Sophia Chang: 'Don't Ever Be Afraid Of Your Passion'",
            "datePublished": "Mon, 06 Jun 2016 18:19:54 +0000",
            "description": "The music industry veteran, former manager of the RZA, the GZA and ODB, as well as D'Angelo, Raphael Saadiq and A Tribe Called Quest, met up with Microphone Check in LA, where she told us what Wu-Tang taught her and how she thinks of her role: \"I'm a manager. I am in the service industry. The service industry. I'm Midas f****** Muffler.\"",
            "length": "85319296",
            "sourceUrl": "http://feeds.soundcloud.com/stream/267840750-frannieandali-sophia-chang-dont-ever-be-afraid-of-your-passion.mp3"
        },
        {
            "title": "Gizzle: 'I Mean For It To Matter'",
            "datePublished": "Tue, 10 May 2016 14:46:12 +0000",
            "description": "Gizzle is the one behind the curtain. Quiet as it's kept, she's written many of the biggest and best-loved rap and R&B songs of the recent past, in the course of working with everybody from Puffy to Nicki to Teddy Riley to Pharrell, Snoop, Chris Brown, Trey Songz, B2K and, most often, Ty$.\n\n\"Music is a collaborative thing,\" she says. \"Life is a collaborative thing. No one can do anything on the levels of greatness — and that's what we going for — by themselves. It just doesn't work that way.\"",
            "length": "63375198",
            "sourceUrl": "http://feeds.soundcloud.com/stream/263410743-frannieandali-gizzle-x-npr-x-frannie.mp3"
        },
        {
            "title": "OG Maco: 'I Want To Give The World A Fighting Chance'",
            "datePublished": "Wed, 13 Apr 2016 14:15:54 +0000",
            "description": "The Atlanta rapper spoke with us in March, between the first and second of the three tours he's booked this year. We got into perspective, influence and frustration, but the point we kept returning to was agency. \"I don't want anybody to do exactly what I'm doing,\" he said. \"I want people to look at why I'm doing what I'm doing. And if you agree with that, you go do what you do about it.\"",
            "length": "67214144",
            "sourceUrl": "http://feeds.soundcloud.com/stream/258792483-frannieandali-og-maco-i-want-to-give-the-world-a-fighting-chance.mp3"
        },
        {
            "title": "Terrace Martin: 'I Believe You Should Be Yourself'",
            "datePublished": "Fri, 08 Apr 2016 21:37:17 +0000",
            "description": "Terrace Martin takes his job very seriously. Here's just a taste of what he sees as at stake when he goes to work: \"You got the Marines. You got the Army. We are the only people that soothe them. The art community are the only people that soothe the people that violently defend us cause they have to sometime, or sometime they don't, but regardless we are the only community that defends them.\"\n\nThis conversation, our second with Terrace, got heavy, even teary. It was always going to, and we taped only two days after Phife passed. All these words came out of a too-tired-and-sad-to-be-false period of time, which isn't to say that they aren't leavened by Puffy stories and suspect relationship advice.",
            "length": "95771212",
            "sourceUrl": "http://feeds.soundcloud.com/stream/258040116-frannieandali-terrace-martin-i-believe-you-should-be-yourself.mp3"
        },
        {
            "title": "Dean Blunt: 'Every Day Is A Lifetime'",
            "datePublished": "Fri, 01 Apr 2016 21:00:18 +0000",
            "description": "Hip-hop music and culture informs most things, including works of art and creative expression that don't sound anything like an MC over a break beat. Though not everybody would file Dean Blunt's output as music that falls under the purview of Microphone Check, we are far too intrigued by his work to find out he would be in Los Angeles and not ask him to sit with us. Over his career as Dean Blunt, as half of Hype Williams and now with the trio Babyfather, who have just released a new album, BBF Hosted by DJ Escrow, he hasn't seen much use for face time with the music press, so we were happily surprised when he said yes.\n\nDean Blunt's music can be, for listeners, a chance to momentarily exist austerely, outside the expectations of genre labels and references that have become so familiar they're less like inside jokes and more like uniforms. His songs make your brain briefly unbound and unwieldy. So does conversing with him.",
            "length": "54523236",
            "sourceUrl": "http://feeds.soundcloud.com/stream/256813293-frannieandali-dean-blunt-every-day-is-a-lifetime.mp3"
        },
        {
            "title": "Saul Williams: 'Let's Go Further And Further Out'",
            "datePublished": "Thu, 18 Feb 2016 02:40:20 +0000",
            "description": "The artist and thinker, who just released a new album that's only one part of a larger multimedia conception, takes us from the drummers of Burundi to Adam Ant, Octavia Butler to David Bowie, Rakim to Young Thug. We also hit on ageism in rap, artistry for sale and how to work interviews.",
            "length": "77319574",
            "sourceUrl": "http://feeds.soundcloud.com/stream/247621024-frannieandali-saul-williams-lets-go-further-and-further-out.mp3"
        },
        {
            "title": "Mr. MFN eXquire: 'I Evolved As A Man'",
            "datePublished": "Fri, 05 Feb 2016 16:03:38 +0000",
            "description": "Crown Heights came to North Hollywood so we could talk about crossed signals on the highways between artist and industry. We also got into rap performance, being superstitious about writing, being not great about networking and this feeling: \"I felt like I was too smart to do a record and not talk about s*** that's happening now.\"",
            "length": "63098090",
            "sourceUrl": "http://feeds.soundcloud.com/stream/245591325-frannieandali-mr-mfn-exquire-i-evolved-as-a-man.mp3"
        },
        {
            "title": "Freddie Gibbs: 'I'm Not Just Living For Myself'",
            "datePublished": "Tue, 12 Jan 2016 18:06:06 +0000",
            "description": "New father Freddie Gibbs spoke with Microphone Check about his inspirations, including the memoirs of Rick James and George Clinton, his business acumen, what the war in the streets is really about and, of course, Gucci.",
            "length": "71873142",
            "sourceUrl": "http://feeds.soundcloud.com/stream/241630804-frannieandali-freddie-gibbs-im-not-just-living-for-myself.mp3"
        },
        {
            "title": "Pusha T: 'This Is What I Like To Make'",
            "datePublished": "Tue, 22 Dec 2015 15:14:33 +0000",
            "description": "The Virginia Beach denizen spoke to Microphone Check about the reverse troll he laid on Def Jam with Darkest Before Dawn, what it's like to go back and forth with Puffy, the fallacies of textbooks, the perils of ignoring the youth and where he's going with King Push.",
            "length": "72344175",
            "sourceUrl": "http://feeds.soundcloud.com/stream/238667817-frannieandali-pusha-t-this-is-what-i-like-to-make.mp3"
        },
        {
            "title": "Logic: 'Do Something For Yourself'",
            "datePublished": "Thu, 12 Nov 2015 19:39:05 +0000",
            "description": "The rapper, who hails from Maryland but now resides in the Los Angeles area, came through to talk about the road to his second album, The Incredible True Story, fending off critics and the language he uses to to remind himself of his blessings and his possibilities.",
            "length": "52174669",
            "sourceUrl": "http://feeds.soundcloud.com/stream/232785738-frannieandali-logic-do-something-for-yourself.mp3"
        },
        {
            "title": "Mac Miller: 'It's OK To Feel Yourself'",
            "datePublished": "Tue, 29 Sep 2015 23:23:28 +0000",
            "description": "Mac Miller met us in LA, which he had recently left. Ali and Mac have known each other for some time, so this interview was a chance for them to reconnect on the other side of some months of internal turmoil and growth the Pittsburgh rapper had to get over. We spoke about fame, performance and wading through other people's prejudice when you're a rapper who's white.",
            "length": "61768552",
            "sourceUrl": "http://feeds.soundcloud.com/stream/226185034-frannieandali-mac-miller-its-ok-to-feel-yourself.mp3"
        },
        {
            "title": "Masta Ace: 'I'm Still Trying To Prove Myself'",
            "datePublished": "Wed, 02 Sep 2015 18:07:05 +0000",
            "description": "Masta Ace had his first drink at a Cold Chillin' Christmas party. This was after he graduated from the University of Rhode Island. The national popularity of \"Born to Roll\" in the mid-'90s — and an amount of drama related to tensions between the coasts at that time — was a wrench thrown into his career, but he responded with Disposable Arts, an album released in October of 2001 that included features from three different women rapping. He made the album in the year after he was told he has multiple sclerosis. \"I wanted to go out on my own terms. I re-dedicated myself to the craft in a different way, and I made my best music, I feel, after that diagnosis.\" Ace spoke with Microphone Check about commercial radio, coaching high school football and working as a guidance counselor, and why he continues to write and record as a solo artist and as part of eMC, which released The Tonite Show in May.",
            "length": "96732509",
            "sourceUrl": "http://feeds.soundcloud.com/stream/222050795-frannieandali-masta-ace-im-still-trying-to-prove-myselfnpr-x-masta-ace.mp3"
        },
        {
            "title": "Large Professor, Part 2: 'I Really Live Through This Music'",
            "datePublished": "Thu, 20 Aug 2015 20:15:20 +0000",
            "description": "This is the second half of Microphone Check's interview last year with producer and rapper Large Professor. You can listen to and read part one here http://www.npr.org/sections/microphonecheck/2015/07/29/424717271/large-professor-part-1-were-living-in-the-world-of-hip-hop. Part two covers the making of Illmatic, Paul C's role and Ali's favorite Extra P lines.",
            "length": "63546130",
            "sourceUrl": "http://feeds.soundcloud.com/stream/220135266-frannieandali-large-professor-part-2-i-really-live-through-this-music.mp3"
        },
        {
            "title": "Large Professor, Part 1: 'We're Living In The World of Hip-Hop'",
            "datePublished": "Wed, 29 Jul 2015 16:25:34 +0000",
            "description": "Last spring, way back in 2014, we sat down with Large Professor, partly on the occasion of the 20th anniversary of Illmatic but mostly because he's the reason for much of the New York rap we both love so much.",
            "length": "46245130",
            "sourceUrl": "http://feeds.soundcloud.com/stream/216892077-frannieandali-large-professor-were-living-in-the-world-of-hip-hop.mp3"
        },
        {
            "title": "Microphone Check Live: Father",
            "datePublished": "Wed, 01 Jul 2015 18:52:33 +0000",
            "description": "We spoke to Father, the rapper, producer and head of Awful Records, the breeding ground for iLoveMakonnen and Archibald SLIM and Slug Christ and Ethereal and Richposlim, while we were in Atlanta in May. Our onstage conversation was brief — Father was kind of the opener for our interview with Organized Noize — but covered a lot of ground fast.",
            "length": "16248211",
            "sourceUrl": "http://feeds.soundcloud.com/stream/209407086-frannieandali-microphone-check-live-father.mp3"
        },
        {
            "title": "Vince Staples: 'My Job Is To Keep My Sanity'",
            "datePublished": "Wed, 01 Jul 2015 18:51:58 +0000",
            "description": "Vince Staples made his debut album, Summertime '06, so that people who hear it will know how he felt then, as a young teenager in Long Beach, Calif. \"That's when we understood the power we had in fear,\" he says. \"Because it's either they're scared of you or they're better than you. And no one wants to feel like anyone else is better than them. So we established fear.\" Who Vince means by \"they\" changes over the course of this interview, but throughout he acknowledges his complicity in a rigged system while laying the blame for its perpetuation at our own lazy, fearful feet.\n\n\"I saw that all of it was fake, from the streets to music to the government to my own family to my parents to — all of it was not real,\" he says. \"Look where I come from. Everyone's pretending they're not sad.\"",
            "length": "82381881",
            "sourceUrl": "http://feeds.soundcloud.com/stream/212813780-frannieandali-vince-staples-my-job-is-to-keep-my-sanity.mp3"
        },
        {
            "title": "Ali Shaheed Muhammad, Part 2: 'We Still Have The Forgotten People'",
            "datePublished": "Wed, 24 Jun 2015 14:31:20 +0000",
            "description": "This is the second special edition of Microphone Check, the back half of an interview that put one of our hosts in the hot seat. You can listen to and read part one here (https://soundcloud.com/npr-microphone-check/ali-shaheed-muhammad). Part two alternates between light-hearted and heavy, and though it was taped in May, it is painfully relevant in the wake of nine deaths in Charleston and the continuing terrorization of black people.",
            "length": "63122321",
            "sourceUrl": "http://feeds.soundcloud.com/stream/211739716-frannieandali-ali-shaheed-muhammad-part-2-we-still-have-the-forgotten-people.mp3"
        },
        {
            "title": "Microphone Check Live: Organized Noize",
            "datePublished": "Wed, 03 Jun 2015 12:13:59 +0000",
            "description": "On May 18th Microphone Check went to Atlanta to interview the three-man production team behind some of the greatest songs ever: every one on Outkast's Southernplayalisticadillacmuzik, every one on Goodie Mob's Soul Food, TLC's \"Waterfalls,\" En Vogue's \"Don't Let Go,\" deep cuts and big hits everywhere. The people who came out to join the conversation and express their gratitude to Organized Noize included much of the Dungeon Family — Big Boi, Backbone and Mr. DJ got on mic, and Big Rube took Ray Murray's place on stage when Ray had to go celebrate his daughter's graduation from high school — and the whole room felt aligned and together and giddy. Ali said he was geeked, Frannie had the best time. We'll all do it again soon.",
            "length": "103623410",
            "sourceUrl": "http://feeds.soundcloud.com/stream/208549594-frannieandali-microphone-check-live-organized-noize.mp3"
        },
        {
            "title": "Ali Shaheed Muhammad, Part 1: 'I Walk A Different Walk'",
            "datePublished": "Wed, 27 May 2015 20:21:45 +0000",
            "description": "We put our legendary co-host in the hot seat and he spoke on how he evaluates music, how his faith influences his work ethic and how much he cares about getting credit. And that's just the first half.",
            "length": "45988507",
            "sourceUrl": "http://feeds.soundcloud.com/stream/207469651-frannieandali-ali-shaheed-muhammad.mp3"
        },
        {
            "title": "Industry Rules No. 1-4079: A Conversation With Lawyer Julian Petty",
            "datePublished": "Tue, 12 May 2015 17:05:53 +0000",
            "description": "The following should not be construed as legal advice — just good advice. We asked Julian Petty, who represents Ali, Earl Sweatshirt, Vince Staples and the estate of Biggie Smalls — and at one time worked with Michael Jackson, Prince and Stevie Wonder — to come see us at Microphone Check as part of our continued effort to put ever more people on game.\n\n\"People get got most commonly because of time pressure,\" he says. \"They're very excited. This is their dream. And someone just pushes a document in front of them and is like, 'Hey, man. We gotta close this. We gotta knock this out now. We're supposed to be shooting a video next week.' And it's really that pressure, this person thinking, 'My dream is on this piece of paper.'\"",
            "length": "49939054",
            "sourceUrl": "http://feeds.soundcloud.com/stream/205050298-frannieandali-julian-petty.mp3"
        },
        {
            "title": "Iamsu: 'I Heard That Beat Totally Different'",
            "datePublished": "Tue, 05 May 2015 08:24:49 +0000",
            "description": "When we sat down with Iamsu, the Bay Area rapper had just as many questions for Ali as we had for him. The three of us spoke about not putting anybody on a pedestal and what would happen if more people in hip-hop brought their moms to the situation.",
            "length": "66983011",
            "sourceUrl": "http://feeds.soundcloud.com/stream/203965821-frannieandali-iamsu-i-heard-that-beat-totally-different.mp3"
        },
        {
            "title": "Amber London: 'I'ma Show You How It's Done'",
            "datePublished": "Tue, 28 Apr 2015 16:03:48 +0000",
            "description": "Amber London made the trip from Houston to Austin to perform her first official shows at SXSW, which provided the perfect occasion for an interview long in the making. We tried to not get stuck on the topic of life as a female rapper, but London's experiences as, at once, a member of an all-girl posse in search of songs hard enough for them, the only woman in the room (or studio or bus) and a person strangers underestimate, turn out to be fundamental to her style.\n\n\"My stage presence is so aggressive because I like the feeling of being an underdog,\" she says. \"I like that it might be one person that give me that look like, 'What is she about to do?' That's who I'm speaking to when I get on stage. I like to prove people like — girls — no matter what I look like, it's all about the music, and I'ma show you how to really rap. I'ma show you how it's done.\"",
            "length": "46838222",
            "sourceUrl": "http://feeds.soundcloud.com/stream/202736496-frannieandali-amber-london.mp3"
        },
        {
            "title": "OverDoz: 'It Just Showed Us How Much Power We Had'",
            "datePublished": "Tue, 21 Apr 2015 20:38:28 +0000",
            "description": "If you thought OverDoz was all about weed and women then you’re mistaken. Sure, the four-man crew comprised of Creamie, Kent, Joon, and P likes to party but -- as evidenced by the video for “Rich White Friends” and this interview -- the group’s members have a lot more on their minds than just ass and grass. \nPrepping their major label debut on RCA Records and boasting collaborations with marquee artists like Pharrell Williams and A$AP Ferg, the OverDoz boys are on the verge of becoming one of rap’s hottest new acts. But with all of that attention comes more scrutiny and, according to Joon, responsibility: “There’s kids listening to us that’s going to try to do everything I do.” The father of a three-year-old son himself, Joon realizes just how impressionable young people can be. “Even if I tell them not to do it they’re [still] gonna try to do it! It’s like: ‘Damn, what am I really gonna tell these kids to do?’” \nAt SXSW 2015 OverDoz took a break from all the stage-diving and schmoozing to talk to Microphone Check about their newfound influence and a wide range of topics that included everything from losing sneakers to Booker T. Washington. \n",
            "length": "46042002",
            "sourceUrl": "http://feeds.soundcloud.com/stream/201623850-frannieandali-overdoz.mp3"
        },
        {
            "title": "Hank Shocklee: 'We Had Something to Prove'",
            "datePublished": "Thu, 16 Apr 2015 19:24:33 +0000",
            "description": "People often refer to the multi-layered, cacophonous style of Public Enemy's production team the Bomb Squad as a \"wall of noise\"— similar to Phil Spector's 'Wall of Sound\" — but to let Squad member Hank Shocklee tell it, their sample-heavy approach was less like Spector's and more akin to a particular collage-based visual artist's:\n\n\"I had a ridiculous record collection. And I wanted to prove that it was the records that inspired me. Because ... I understand scales and musical arrangements and that stuff but I didn't have — I was not a player. I'm not going to pick up a bass or a guitar or keys and I'm going to, you know, put some virtuoso stuff down. That's not going to happen. But what I do have is a turntable and records. And so I just want to create this collage, almost like a Romare Bearden kind of a painting.\"\n\n\"Shocklee – alongside his brother Keith, P.E. front man Chuck D and Eric \"Vietnam\" Sadler – was an architect of Public Enemy's distinct, attention-grabbing sound, and helped sampling evolve into an art form unto itself. Racking up production credits for a diverse list of collaborators that ranged from Ice Cube to Bell Biv Devoe the Bomb Squad was an inspiration to a generation of influential musicians like Microphone Check's own Ali Shaheed Muhammad. At SXSW 2015 in Austin, Texas Microphone Check spoke with Hank Shocklee about hip-hop's underappreciated technical ingenuity and why pop music doesn't appeal to him.",
            "length": "64472768",
            "sourceUrl": "http://feeds.soundcloud.com/stream/200883575-frannieandali-hank-shocklee.mp3"
        },
        {
            "title": "Heems: 'If Someone's Got To Do It, It Should Be Me'",
            "datePublished": "Mon, 13 Apr 2015 01:06:25 +0000",
            "description": "The Queens rapper spoke with Microphone Check about Partition, assimilation and how the Patriot Act is used. We also talked about what success does to -- and sometimes for -- your family:\n\n\"J. Cole's got a record out where's he talking about running around New York and doing his rapper thing meanwhile at home his mom's getting foreclosed on the crib. Drake dropped a song, 'You & The 6,' where he's talking about, you know, \"Thank god Toronto and my mom raised me otherwise I wouldn't be prepared to handle this world.\" Action Bronson dropped a joint 'Actin Crazy' like, 'Ma, still your little baby. Why you think I'm out here acting crazy?'\n\nAnd a lot of these songs they're feeling guilty about running around the world. They're talking about coming home to their parents. They're talking about being glad that their moms raised them that way or that everything they're doing — you know, 'It might not seem apparent to you, Mom, but the reason I'm out here acting crazy is for you.' And I feel like I could relate to that. That's basically my favorite genre of rap right now, is like, I'm-sorry-Mom rap. Or, like, 'Don't look at the price tag, Mom.'\"",
            "length": "70760110",
            "sourceUrl": "http://feeds.soundcloud.com/stream/200534261-frannieandali-heems-if-someones-got-to-do-it-it-should-be-me.mp3"
        },
        {
            "title": "Malcolm Spellman: \"The Real, You Just Can't Beat It\"",
            "datePublished": "Mon, 06 Apr 2015 02:38:50 +0000",
            "description": "While Microphone Check was at SXSW right after the season one finale of Empire, we spoke to Malcolm Spellman, who's one of the writers and now also a producer on the show. We talked about the show's effect on the hip-hop culture market, what it demonstrates about ongoing changes in Hollywood and the ways its storyline is particularly American.\n\n\"At the core of this country, this story is appealing, including the criminality at the base of it,\" says Spellman. \"Because on a macro level, some rough-ass people came here, served the natives, and built up their s---. And they felt righteous in doing it because they had to do what they had to do. It was problems back home, you know what I'm saying?\"",
            "length": "45430968",
            "sourceUrl": "http://feeds.soundcloud.com/stream/199444677-frannieandali-malcolm-spellman-the-real-you-just-cant-beat-it.mp3"
        },
        {
            "title": "Jean Grae: 'It's Not Just For Me. It's For You Guys.'",
            "datePublished": "Mon, 30 Mar 2015 06:03:35 +0000",
            "description": "Jean Grae is a rapper, a singer, a writer, a comedian and an actress. She doesn't run out of ideas. Her most recent album is called That's Not How You Do That: An Instructional Album For Adults. She spoke to Microphone Check about her campaign to help people be better, Michael McDonald and why she's moving to Los Angeles. ",
            "length": "70615915",
            "sourceUrl": "http://feeds.soundcloud.com/stream/198185916-frannieandali-jean-grae-final.mp3"
        },
        {
            "title": "Earl Sweatshirt: 'I'm Grown'",
            "datePublished": "Tue, 24 Mar 2015 08:01:39 +0000",
            "description": "The 21-year-old spoke with Microphone Check in Austin, Texas, during SXSW a couple days before the release of his second major label album. He says he feels like I Don't Like S---, I Don't Go Outside is really his first album, though. \"This is the first thing that I've said that I fully stand behind, like the good and the bad of it,\" he says. \"I've never been this transparent with myself or with music. I've never been behind myself this much.\"",
            "length": "57390438",
            "sourceUrl": "http://feeds.soundcloud.com/stream/197414945-frannieandali-earl-sweatshirt-im-grown.mp3"
        },
        {
            "title": "ASAP Ferg: 'I Want This Moment To Last Forever'",
            "datePublished": "Wed, 18 Mar 2015 02:41:29 +0000",
            "description": "Microphone Check sat down with ASAP Ferg in February, just before he released the video for \"Doe-Active,\" a song off his November mixtape, Ferg Forever. The pillar of New York's ASAP Mob spoke about his aesthetic choices, the way he imagines our far off future and what he's learned from Missy Elliott.",
            "length": "65540220",
            "sourceUrl": "http://feeds.soundcloud.com/stream/196419904-frannieandali-asap-ferg-i-want-this-moment-to-last-forever.mp3"
        },
        {
            "title": "Leila Steinberg: 'With Earl, It's A Journey'",
            "datePublished": "Mon, 09 Mar 2015 19:59:52 +0000",
            "description": "When Leila Steinberg was 25 years old, she met a 17-year-old named Tupac. She became involved in his career in a managerial role, which she had stepped away from by about 1993. The next time Steinberg agreed to a management relationship with a musician was almost 20 years later. At the request of Earl Sweatshirt's mother, she began working with him while he was still in Samoa. And then she went and got him, brought him home. We spoke to Leila about her relationships with both rappers, and the work she's done apart from them.",
            "length": "56785247",
            "sourceUrl": "http://feeds.soundcloud.com/stream/195051165-frannieandali-leila-steinberg-with-earl-its-a-journey.mp3"
        },
        {
            "title": "Big Sean: 'I Stuck With My Gut'",
            "datePublished": "Mon, 02 Mar 2015 22:28:11 +0000",
            "description": "The week Big Sean released his third studio album he stopped by NPR's Los Angeles bureau for a talk with Microphone Check. The Detroit rapper recorded Dark Sky Paradise almost entirely at his own house, in a studio he spent all his money building. \"I made a promise to myself,\" he says. \"I would never ever not follow my heart again. That way if I rise or fall, sink or swim, it's by my own choice and my own decisions.\"",
            "length": "74441496",
            "sourceUrl": "http://feeds.soundcloud.com/stream/193909875-frannieandali-big-sean-i-stuck-with-my-gut.mp3"
        },
        {
            "title": "Microphone Check Live: 'The Spook Who Sat By The Door' Screening",
            "datePublished": "Sat, 28 Feb 2015 01:21:33 +0000",
            "description": "This week, in honor of Black History Month, we went down to NPR's headquarters in Washington, D.C., to screen Sam Greenlee's 1973 film The Spook Who Sat by the Door and host a conversation about its resonance.\n\nIn case you're not familiar with the cult classic, the main character is Dan Freeman, who's trained by the CIA to be its first black agent. After he masters the agency's tactics, he goes home to the southside of Chicago on a mission to train street gangs to be \"Freedom Fighters.\" When a young man is shot dead by the police, Freeman's trainees spring into action. What happens in the end is open to interpretation, as you'll hear at the start of this recording of our panel discussion.\n\nThe members of our panel are Dr. Greg Carr, Chair of the Afro-American Studies Department at Howard University, Jamilah Lemieux, Senior Editor at Ebony Magazine, and K. Nyerere Ture, Professor of Anthropology at Morgan State University.\n\nThe panel and the audience discussed the film's themes of resistance and intra-racial tension as well as the erasure of the Black Arts movement from mainstream discussion of black history. \"The villain of the film,\" said Dr. Carr, \"is the idea of the nation-state.\"\n\nSpecial thanks: Erin McIntyre, Dennis Herndon, Keith Woods, Darlene Barkley, Justin Lucas, Brittany Brown, Neil Tevault, Bobby Carter, Eleanor Kagan, Morgan McCloy, Joe Hagen and Anya Grundmann.",
            "length": "57358673",
            "sourceUrl": "http://feeds.soundcloud.com/stream/193440569-frannieandali-microphone-check-live-the-spook-who-sat-by-the-door-screening.mp3"
        },
        {
            "title": "Terrace Martin: 'Everything Got A Little Bit Of Funk In It'",
            "datePublished": "Wed, 11 Feb 2015 17:33:58 +0000",
            "description": "Last year you heard Terrace Martin's work on YG's album, Ninth Wonder's compilation, Big K.R.I.T.'s Cadillactica and, just this week, a new song by Kendrick Lamar, called \"The Blacker The Berry.\" In the space of less than six months in 2014, the LA-based producer and multi-instrumentalist also put out a full solo album, 3ChordFold Pulse, and a Christmas project called Times.\n\nWhen Martin spoke to Microphone Check he teased us about that Kendrick album, professed his love for A Tribe Called Quest and told us why he makes \"relationship songs.\"\n\n\"I grew up on Crenshaw and Slauson and I grew up in the crack era and the gangbanging was really heavy in South Central,\" he says. \"I never want, like, using my platform to talk about the same story and what's going — that s--- gives me anxiety, thinking about that era or that time. You know what I mean? Even with times going on now, it's like, the best thing I could do is really not comment and just keep on feeding the world good music. That's what I'm here for. Like the Titanic, when them motherf---ers went down with the ship, trying to make everybody else cool, that's all I'ma do.\"",
            "length": "44447077",
            "sourceUrl": "http://feeds.soundcloud.com/stream/190619799-frannieandali-terrace-martin-everything-got-a-little-bit-of-funk-in-it.mp3"
        },
        {
            "title": "DJ Quik: 'Flamboyant? Every Now And Then'",
            "datePublished": "Wed, 28 Jan 2015 23:08:50 +0000",
            "description": "After 24 years in the music business, the producer and rapper from Compton, Calif., knows what's going on. He told Microphone Check studio secrets, a Rick James story, and all about the funk.\r\n\r\n\"You gotta get funky to make records that give people the frown face when they hear it,\" he says. \"You know, George Clinton-style. That's what George and them used to do. George and them didn't bathe. So I started doing that. ... It's a different attitude when you go in the studio all fastidious and clean. You don't want to get down. Like, 'Hey. Look at my watch. My shoes are white. I'm not gon' party.' You know what I mean? 'I ain't finna write no song. I'm finna take some pictures of me.' You know, that's them days. But we was in there getting stinky. And it got on the music.\"",
            "length": "91487962",
            "sourceUrl": "http://feeds.soundcloud.com/stream/188379862-frannieandali-dj-quik-x-npr.mp3"
        },
        {
            "title": "AraabMuzik: 'I Have So Much Music, It Doesn't Make Sense'",
            "datePublished": "Wed, 14 Jan 2015 01:43:51 +0000",
            "description": "The Rhode Island-born producer and DJ — the MVP of the MPC — tells Microphone Check hosts Ali Shaheed Muhammad and Frannie Kelley the story of the father/son talk he once had with Cam'ron, delineates EDM and hip-hop (one is more like private school than the other) and calls out the whole music industry for being flaky.",
            "length": "55870281",
            "sourceUrl": "http://feeds.soundcloud.com/stream/185938659-frannieandali-arab-final.mp3"
        },
        {
            "title": "Black Milk: 'It's Not Really A Cakewalk'",
            "datePublished": "Wed, 07 Jan 2015 21:45:48 +0000",
            "description": "Back in October, Detroit's Black Milk released his sixth solo album, called If There's A Hell Below. He came to New York and spoke with Ali Shaheed Muhammad and Frannie Kelley about trying to impress J Dilla, transforming his music for live shows and always improving. \"Each song, I want it to have a purpose,\" he says. \"I feel like I'm making some of the best music. I know it's certain details that I'm looking at, that I know I've grown in, that most people won't even hear.\"",
            "length": "78825423",
            "sourceUrl": "http://feeds.soundcloud.com/stream/184959350-frannieandali-black-milk-x-npr.mp3"
        },
        {
            "title": "J. Cole: 'It Ain't Enough Of Us Trying'",
            "datePublished": "Fri, 12 Dec 2014 05:21:30 +0000",
            "description": "The day after his third album, 2014 Forest Hills Drive, was released, J. Cole spoke to Microphone Check hosts Ali Shaheed Muhammad and Frannie Kelley. It was the morning before he performed \"Be Free,\" the song he made about Michael Brown, on Letterman. Cole said he was nervous about it, but apparently not so worried that he would change his clothes. He wore the same hoodie for this interview that he did on TV. The conversation –- Mic Check's second with Cole — reveals a person newly comfortable with himself, his abilities and what needs to be done.",
            "length": "69362870",
            "sourceUrl": "http://feeds.soundcloud.com/stream/181138210-frannieandali-j-cole-it-aint-enough-of-us-trying.mp3"
        },
        {
            "title": "Rick Ross: 'It Was Just So Powerful To Me'",
            "datePublished": "Wed, 10 Dec 2014 22:27:12 +0000",
            "description": "On the day before Thanksgiving, Microphone Check hosts Ali Shaheed Muhammad and Frannie Kelley sat down in Los Angeles with Rick Ross. First things first, they talked about food, but quickly got into the Miami musician's early rap fandom, the importance of imagery in his work and what his mentors taught him about running a team.",
            "length": "60538080",
            "sourceUrl": "http://feeds.soundcloud.com/stream/180931020-frannieandali-rick-ross-it-was-just-so-powerful-to-me.mp3"
        },
        {
            "title": "Run The Jewels: 'I'm Taking This Life'",
            "datePublished": "Tue, 11 Nov 2014 01:21:13 +0000",
            "description": "Killer Mike and El-P, underground kings from Atlanta and New York respectively, met four years ago, made an album together, and then joined forces under the name Run the Jewels, something far beyond the sum of its parts. \"We're a group comprised of two dudes who met at crossroads, who had come out of crossroads deciding to go out and hunt and kill,\" says El-P, who produces as well as raps. \"When we met, we had both individually decided we were going to go for ours. Like, no more playing around.\"\r\n\r\nMicrophone Check co-host Ali Shaheed Muhammad was moving on the only morning Jaime and Mike had time to sit down in New York City after they dropped their second album, Run the Jewels 2, so this interview was done by Frannie Kelley solo.",
            "length": "66491911",
            "sourceUrl": "http://feeds.soundcloud.com/stream/176322301-frannieandali-run-the-jewels-im-taking-this-life.mp3"
        },
        {
            "title": "Dante Ross: 'We Wanted Our Own Universe'",
            "datePublished": "Tue, 04 Nov 2014 21:13:03 +0000",
            "description": "Dante Ross, A&R man extraordinaire, keeper of stories about everyone from ODB to De La Soul to Cypress Hill, the Beastie Boys, Queen Latifah and Pete Rock, sat down with Microphone Check to remember the old days and stare down the present.",
            "length": "68534056",
            "sourceUrl": "http://feeds.soundcloud.com/stream/175368032-frannieandali-dante-ross-we-wanted-our-own-universe.mp3"
        },
        {
            "title": "T.I.: 'We Make Music That Come From The Heart'",
            "datePublished": "Mon, 20 Oct 2014 23:29:13 +0000",
            "description": "\"I want to be here because the people put me here,\" says the Atlanta rapper, actor and businessman. T.I. spoke to Microphone Check about being mentored by Andrew Young, taking Biggie to Atlanta and Outkast to NYC, using songwriting to talk to himself, as well as everybody else, and the death of his protege, Doe B.",
            "length": "78779070",
            "sourceUrl": "http://feeds.soundcloud.com/stream/173077933-frannieandali-ti-we-make-music-that-come-from-the-heart.mp3"
        },
        {
            "title": "Killer Mike, Greg Street And DJ Drama On OutKast And Atlanta",
            "datePublished": "Fri, 03 Oct 2014 18:01:07 +0000",
            "description": "While Frannie Kelley was in Atlanta reporting about OutKast weekend, she spoke to Killer Mike in the waxing room at his barber shop, V103 DJ Greg Street in a gold Impala parked behind the gas station at the West End Mall and to DJ Drama while they were both at the airport -- though he was at LAX and she was at Hartsfield. Less than 20 seconds of each of those interviews made it into the radio report, but here is way more: Killer Mike on flip-flops and socks, Greg Street on the OutKast brand and Drama on the days when New York stores thought Southern mixtapes wouldn't sell.\r\n\r\nAnd here's the story that aired on All Things Considered: http://www.npr.org/blogs/therecord/2014/10/03/353516382/outkast-and-atlanta-until-they-close-the-curtain. ",
            "length": "19344018",
            "sourceUrl": "http://feeds.soundcloud.com/stream/170498498-frannieandali-killer-mike-greg-street-and-dj-drama-on-outkast-and-atlanta.mp3"
        },
        {
            "title": "Andre 3000: 'You Can Do Anything From Atlanta'",
            "datePublished": "Thu, 25 Sep 2014 22:35:47 +0000",
            "description": "Andre 3000 — née André Benjamin, sometimes Three Stacks and always one half of the mighty OutKast — sat down with Microphone Check hosts Ali Shaheed Muhammad and Frannie Kelley before a screening of the just-released Jimi Hendrix biopic in which he stars. He spoke about his current work with the Queen of Soul, how and why OutKast and the Dungeon Family 20 years ago put the city of Atlanta on their backs and what young musicians now can learn from his group's early days. ",
            "length": "28558350",
            "sourceUrl": "http://feeds.soundcloud.com/stream/169383715-frannieandali-andre-3000-you-can-do-anything-from-atlanta.mp3"
        },
        {
            "title": "Microphone Check Live: The Stories Of The Notorious B.I.G.",
            "datePublished": "Thu, 18 Sep 2014 20:03:17 +0000",
            "description": "On Sunday, Sept. 14, 20 years and one day after Biggie Small's debut album Ready to Die was released, Microphone Check gathered four of the musician's friends in Brooklyn to recall the man they knew. We called the event If You Don't Know, Now You Know: The Stories Of Notorious B.I.G.\n\nHubert Sam went to elementary school with Chris Wallace and was his very first DJ. Donald Harrison, Jr., was a world-touring jazz musician when Hubert and Chris started going over to his house to talk about jazz and the industry. Matty C, whose job gave him access to all the latest hip-hop before anyone else, used to get hit up by Big for new tapes as he got off the subway. And dream hampton took Biggie with her to classes at NYU's film school.\n\nThe story-telling happened at BRIC House on Fulton Street, just blocks from where the young man who would become the Notorious B.I.G. went to school, bagged groceries, hustled and freestyled. You can download the conversation above, or watch videos of the panel here: http://www.npr.org/blogs/microphonecheck/2014/09/18/349607102/microphone-check-live-the-stories-of-the-notorious-b-i-g.",
            "length": "113022056",
            "sourceUrl": "http://feeds.soundcloud.com/stream/168336460-frannieandali-microphone-check-live-the-stories-of-the-notorious-big.mp3"
        },
        {
            "title": "Joell Oritz: 'I Refuse To Compromise Me'",
            "datePublished": "Thu, 18 Sep 2014 18:18:05 +0000",
            "description": "The Brooklyn rapper spoke to Microphone Check about the music business, the old neighborhood, staying in the studio, the appeal of supergroups, the kids and a theoretical campaign to be Mayor of New York City.",
            "length": "82781872",
            "sourceUrl": "http://feeds.soundcloud.com/stream/168321690-frannieandali-joell-oritz-i-refuse-to-compromise-me.mp3"
        },
        {
            "title": "The Underachievers: 'We're Still Young'",
            "datePublished": "Tue, 19 Aug 2014 15:56:38 +0000",
            "description": "A rap duo from New York City is being talked about as a continuation of the golden era of hip-hop — a time in the late '80s and early '90s when groups made songs that noted police brutality, elevated conversation and filled dance floors. Issa and AK are at a stage in their careers — three full length projects in — where they believe they've gained enough skill and experience to be able to make music that does what they want it to do: spark change, infuse the culture, help them see the world.\n\nThey sat with Microphone Check cohosts Ali Shaheed Muhammad and Frannie Kelley this spring and received some grown man admonishment and one tip regarding a video location while telling stories about Australian fans and all their strategic moves.",
            "length": "63348028",
            "sourceUrl": "http://feeds.soundcloud.com/stream/163832731-frannieandali-the-underachievers-were-still-young.mp3"
        },
        {
            "title": "Cormega: 'I Just Want To Be A Soldier For My Culture'",
            "datePublished": "Thu, 31 Jul 2014 20:41:26 +0000",
            "description": "20 years ago, Nas mentioned his friend Cormega on a song called \"One Love,\" which was composed as a letter to someone in prison: \"Night time is more trife than ever / What up with Cormega? Did you see him? Are y'all together? / If so then hold the fort down, represent to the fullest / Say what's up to Herb, Ice and Bullet.\" Those four bars inked Cormega's street credibility and forever tied him, for better and worse, to the crown prince of hip-hop. He spoke to Microphone Check cohosts Ali Shaheed Muhammad and Frannie Kelley about the career and life he's made beyond them.",
            "length": "74286013",
            "sourceUrl": "http://feeds.soundcloud.com/stream/161153914-frannieandali-cormega-i-just-want-to-be-a-soldier-for-my-culture.mp3"
        },
        {
            "title": "YG: 'I Gave Y'All What I Seen'",
            "datePublished": "Thu, 24 Jul 2014 23:05:34 +0000",
            "description": "The Los Angeles rapper spoke to Microphone Check co-hosts Ali Shaheed Muhammad and Frannie Kelley about his early days playing house parties all over the county, DJ Mustard's start, his friendship with ScHoolboy Q and how his mother yelling at him ended up on his debut album.",
            "length": "56823680",
            "sourceUrl": "http://feeds.soundcloud.com/stream/160161346-frannieandali-yg-i-gave-yall-what-i-seen.mp3"
        },
        {
            "title": "Pete Rock: 'Real Could Be Another Word For Original'",
            "datePublished": "Tue, 01 Jul 2014 17:57:09 +0000",
            "description": "The renowned producer attributes his creativity to another legend: \"I was musically charged, man. I had some adrenaline going on then. I'm serious, ever since I — I think after I met James Brown as a kid. I was seven years old,\" says Pete Rock. \"I wasn't the same since.\"\n\nThe man who made \"T.R.O.Y.\" and \"The World Is Yours\" spoke with Microphone Check hosts Ali Shaheed Muhammad and Frannie Kelley about shaking the hand of the Godfather of Soul and attending his funeral, crawling through a dog door to practice on Heavy D's equipment, the effects of 9/11 on music and J Dilla. \"I'm like, 'Yo, this guy's gonna have me out of a job.'\"",
            "length": "80986745",
            "sourceUrl": "http://feeds.soundcloud.com/stream/156863241-frannieandali-pete-rock-real-could-be-another-word-for-original.mp3"
        },
        {
            "title": "Ab-Soul: 'It's A Lot'",
            "datePublished": "Fri, 20 Jun 2014 18:11:33 +0000",
            "description": "Ab-Soul, the most philosophical member of the by now vaunted Top Dawg Entertainment, met Microphone Check hosts Ali Shaheed Muhammad and Frannie Kelley in Los Angeles two weeks before the release of his latest album, called These Days ... After only one listen to the album, the three of them had a conversation about Ab's high expectations of his audience and what he's trying to make for them.\n\n\"I've learned the bulk of what I know from hip-hop music. You understand what I'm saying? Like I learned — from listening to hip-hop music, I learned about things that I would soon learn about as an adult, from listening to it as a child,\" he says. \"That's what I got from hip-hop, and so I just want to give that right back.\"",
            "length": "62727777",
            "sourceUrl": "http://feeds.soundcloud.com/stream/155263917-frannieandali-ab-soul-its-a-lot.mp3"
        },
        {
            "title": "Mannie Fresh Live: 'Real Talk'",
            "datePublished": "Thu, 29 May 2014 16:36:07 +0000",
            "description": "Mannie Fresh, the legendary New Orleans producer and DJ, was our guest for the first live episode of Microphone Check. We taped at NPR's headquarters in Washington, D.C. at the end of May, and the conversation was predictably warm, sharp and funny. Mannie regaled the crowd with stories about Cash Money Records, the making of Juvenile's 400 Degreez, Lil Wayne's career, Mantronix and his dad. And he played us a new song from what he's working on now: an album with Brooklyn rapper Mos Def.\r\n\r\nWhat we didn't anticipate happened after we said our thank yous, when Mannie stood up, walked over to the decks and unleashed a spontaneous set of bounce remixes of everything from Hall & Oates to Earth Wind and Fire. \r\n\r\nYou can watch video of the evening here: http://www.npr.org/event/music/316698148/mannie-fresh-live-real-talk.",
            "length": "173687744",
            "sourceUrl": "http://feeds.soundcloud.com/stream/151860695-frannieandali-mannie-fresh-live-real-talk.mp3"
        },
        {
            "title": "Mannie Fresh DJ Set: 'We Bounced Everything'",
            "datePublished": "Thu, 29 May 2014 16:24:52 +0000",
            "description": "In the middle of our live interview with Mannie Fresh at NPR's headquarters in D.C. (http://www.npr.org/event/music/316698148/mannie-fresh-live-real-talk), Ali asked Mannie how he approaches DJing — does he play what he wants to hear? Or does he feed the crowd? \"When I want you to understand something, I remix it,\" Mannie said. \"If it's Earth Wind and Fire, and you not getting it, I'ma make you get it.\"\r\n\r\nLaughing, and speaking for everyone in the room, Ali then asked if he could get a couple of those Mannie Fresh special remixes. \"I got you!\" said Mannie, and no one in the crowd let him forget it. After we had finished our conversation, and said our thank yous, he walked over to the decks. For the next 20 mins he put New Orleans behind songs by Kenny Chesney, Hall & Oates and Trouble Funk — leading off with his remix of \"September,\" which somehow makes the warm embrace of Earth Wind and Fire's song even more cushy, homey and right on time.\r\n\r\nSet List:\r\n\r\n\"September,\" Earth Wind and Fire\r\n\r\n\"Beat It,\" Michael Jackson\r\n\r\n\"Showtime at the Apollo Theme\"\r\n\r\n\"Boogie Down Bronx,\" Man Parrish\r\n\r\n\"California Love,\" Tupac feat. Dr. Dre\r\n\r\n\"Let's Wait Awhile,\" Janet Jackson\r\n\r\n\"(Lay Your Head On My) Pillow,\" Tony Toni Tone\r\n\r\n\"Somewhere With You,\" Kenny Chesney\r\n\r\n\"One More Night,\" Maroon 5\r\n\r\n\"Funky Soul Makossa,\" Nairobi\r\n\r\n\"Billie Jean,\" Michael Jackson\r\n\r\n\"Back That Ass Up,\" Juvenile feat. Mannie Fresh and Lil Wayne\r\n\r\n\"I Can't Go For That,\" Hall & Oates\r\n\r\n\"Good Life,\" Kanye West feat. T-Pain\r\n\r\n\"Friends,\" Whodini\r\n\r\n\"Trying Girls Out,\" The Persuaders (used by Kanye West for \"Girls, Girls, Girls (Part 2),\" Jay Z)\r\n\r\n\"That's How Long,\" The Chi-Lites (used by Just Blaze for \"December 4th,\" Jay Z)\r\n\r\n\"A Dream,\" DeBarge (used by Daz for \"I Ain't Mad At Cha,\" Tupac)\r\n\r\n\"Ain't No Love in the Heart of the City,\" Bobby \"Blue\" Bland (used by Kanye West for \"Heart of the City (Ain't No Love),\" Jay Z)\r\n\r\n\"Sunrise,\" The Originals (used by Kanye West for \"Guess Who's Back,\" Scarface feat. Jay Z, Beanie Sigel and Kanye West)\r\n\r\n\"Start This Off Right Tonight (Remix),\" Trouble Funk",
            "length": "23251904",
            "sourceUrl": "http://feeds.soundcloud.com/stream/151859015-frannieandali-mannie-fresh-dj-set-we-bounced-everything.mp3"
        },
        {
            "title": "Inside The XXL Freshmen Issue",
            "datePublished": "Sat, 10 May 2014 21:29:54 +0000",
            "description": "Since 2008 XXL Magazine has put out an annual issue highlighting new acts that the editors predict will go on to impact hip-hop — the music and the industry. In the beginning, the 10 musicians chosen for the cover of that issue were called the Leaders of the New School. Over the years the people who land what's now called the Freshmen cover — as well as the people who didn't, not to mention the people who turned it down — have become the topic of conversation all over the place, including in song.\n\nThe debates and turf wars that the Freshmen issue manifests — What are the effects of music journalism's current turbulent epoch on the prospects of musicians themselves? What is the role of the New York City-based music business in a now worldwide culture and industry? What does it take to make it? — are felt and grappled with by the people who make the issue at every step of their process.\n\nFor their perspective, Microphone Check co-hosts Ali Shaheed Muhammad and Frannie Kelley sat down with Vanessa Satten, the editor in chief of XXL who's been with the magazine since 1998, and senior editor Dan Rys, who's been there 11 months, making this his first Freshmen cover.",
            "length": "50503127",
            "sourceUrl": "http://feeds.soundcloud.com/stream/148901362-frannieandali-inside-the-xxl-freshmen-issue.mp3"
        },
        {
            "title": "Freddie Gibbs: 'I Think I'm The Best Rapper'",
            "datePublished": "Wed, 07 May 2014 19:27:17 +0000",
            "description": "Freddie Gibbs moved away from his hometown of Gary, Indiana, more than 10 years ago. He went to L.A., where he became friends with Madlib, the producer revered for his work in The Lootpack, as a solo artist under the name Quasimoto, for that time Blue Note Records let him do whatever he wanted in their vault and the albums he's made collaboratively, with heavyweights J Dilla, MF Doom, Percee P and Talib Kweli.\r\n\r\nGibbs and Microphone Check cohost Ali Shaheed Muhammad are quite certain that Piñata, the album Madlib has made with Gibbs, is the most gangster project Madlib has ever worked on. He couldn't join us in the studio, but Gibbs sat down to talk about what he calls his \"homiefied\" album.",
            "length": "67041070",
            "sourceUrl": "http://feeds.soundcloud.com/stream/148399069-frannieandali-freddie-gibbs-i-think-im-the-best-rapper.mp3"
        },
        {
            "title": "Future: 'You Gotta Step Outside That Box To Reach The People'",
            "datePublished": "Tue, 29 Apr 2014 06:56:14 +0000",
            "description": "The rise of the rapper, singer and songwriter given the name Future when he was a teenager being fostered by the legendary Dungeon Family looks meteoric from the outside. In reality, the musician has reinvented himself a couple times, pored over his predecessors' work and, he says, recorded more than 10 albums worth of songs.\n\nHe spoke to Microphone Check about working with Andre 3000, the politics of features and the studio life.",
            "length": "58003747",
            "sourceUrl": "http://feeds.soundcloud.com/stream/147012985-frannieandali-future-you-gotta-step-outside.mp3"
        },
        {
            "title": "Nas: 'I'm Still Charged' 20 Years After 'Illmatic'",
            "datePublished": "Wed, 23 Apr 2014 04:35:41 +0000",
            "description": "On April 19, 1994, Columbia Records released the debut album of a 20-year-old from Queensbridge Houses in New York City. It was deft, wise, deadly serious and matched the babyface with unparalleled promise to beats made by the era's preeminent producers.\r\n\r\nTwo decades after Illmatic, Nas sat down with Microphone Check for a conversation that moved from his love for Ali Shaheed Muhammad's group, A Tribe Called Quest, to music journalism (\"If you're Sade, it doesn't matter. She does what she does. But for all of us, journalism is a huge deal.\") hearing himself on the radio for the first time and his audience:\r\n\r\n\"My surroundings. The hip-hop community also,\" says Nas. \"So that meant I made it for other rappers, I made it for other MCs, I made it for other hip-hop groups. I made it for artists, singers, people in the arts — that's who I made it for. But it comes from the street, so my surroundings wrote that album. I made it for them.\"",
            "length": "107582066",
            "sourceUrl": "http://feeds.soundcloud.com/stream/146037140-frannieandali-nas-im-still-charged-20-years-after-illmatic.mp3"
        },
        {
            "title": "E-40: 'I'm On The West Coast, Eating'",
            "datePublished": "Wed, 09 Apr 2014 21:13:08 +0000",
            "description": "E-40, from Northern California, is widely known for creating slang, flouting the rules and knowing everybody from everywhere. 40 spoke with Microphone Check hosts Ali Shaheed Muhammad and Frannie Kelley about Lil Jon, T-Pain, Tupac and Too Short. They started their conversation talking business and in particular, the model that 40 provided New Orleans' own Master P when No Limit Records was just a twinkle in his eye.",
            "length": "91851545",
            "sourceUrl": "http://feeds.soundcloud.com/stream/143932155-frannieandali-e-40-im-on-the-west-coast.mp3"
        },
        {
            "title": "ScHoolboy Q: 'I Call Myself All-American'",
            "datePublished": "Wed, 26 Feb 2014 16:57:30 +0000",
            "description": "The Los Angeles rapper has lived a lot of life in his 27 years. \"I call myself All-American,\" he says. \"I done been an athlete, a gang member, drug dealer. I done been a kid that was kind of living on the fortunate side when my mama was starting to do good, and I was hustling just to hustle because, dude, my homies was doing it, you get what I'm saying? But then I ended up actually really needing to hustle. And out of all that s--- I done did, I had a job — worked a job for two years. I worked at the railroad. Go to jail, get a strike. All this s--- happened before I was even 21.\" And then he started rapping.\n\nScHoolboy Q has released two mixtapes and, just this week, his major label debut — but he says he's got two more albums all planned out. As a part of Top Dawg Entertainment, the company that gave rise to critical phenom Kendrick Lamar, ScHoolboy Q has played the role of the hard-boiled cut up. With Oxymoron, he says he wanted to make \"a gangster rap L.A. dark album from a good student's point of view.\" When we sat down with him, the night before he performed brand new songs from the album, he spoke thoughtfully about addiction (his own and his uncle's), why he used to think rappers were fake and how he grew up.",
            "length": "56930274",
            "sourceUrl": "http://feeds.soundcloud.com/stream/136872113-frannieandali-schoolboy-q-i-call-myself-all.mp3"
        },
        {
            "title": "Solange Knowles On Nas, Juvenile And Dance Moves",
            "datePublished": "Wed, 12 Feb 2014 02:21:43 +0000",
            "description": "This week, NPR Music is launching an R&B channel called \"I'll Take You There,\" hosted by Jason King, a professor, writer and musician. It's a lot like the 24/7 stream of hip-hop that Ali and I host. So for this episode of Microphone Check, we're adding some R&B to the mix and talking to Solange Knowles.\r\n\r\nWe start our conversation in hip-hop: Solange tells us about getting suspended in middle school over a Nas poster in her locker, compares her singing style to Silkk the Shocker's flow, and says she still can't believe she got Bun B and Mannie Fresh to dance in the video for her song \"Lovers in the Parking Lot.\"\r\n\r\nThis fall, Solange started a label called Saint Records — what she calls a \"passion project\" that will primarily house R&B artists. We talk about her hopes for the label, the relevance of gospel to R&B, recent journalism around the genre and, of course, Lucy Pearl. You can get all of NPR's coverage of R&B on Twitter @NPRandB.",
            "length": "62834310",
            "sourceUrl": "http://feeds.soundcloud.com/stream/134341910-frannieandali-solange-knowles-on-nas.mp3"
        },
        {
            "title": "'Putting The Pill In The Pudding': An Interview With Danny Brown",
            "datePublished": "Wed, 29 Jan 2014 00:52:03 +0000",
            "description": "Four or five years ago Microphone Check co-host Ali Shaheed Muhammad told Danny Brown that he's the hip-hop Richard Pryor. \"And I got it, too: making things funny that don't supposed to be funny,\" says Brown. \"It's like putting the pill in the pudding.\"\n\nSince then Brown has released three albums under his own name (with October's Old being the most recent), fully infiltrated the festival circuit, and become both a regular fixture on critics Best Of lists and a character in GrandTheft Auto V. He spoke to Muhammad and co-host Frannie Kelley about his grandmothers, reading bad reviews and what he would do with $100,000.",
            "length": "39479587",
            "sourceUrl": "http://feeds.soundcloud.com/stream/131910691-frannieandali-putting-the-pill-in-the.mp3"
        },
        {
            "title": "Starlito And Don Trip: Writers First, Rappers Second",
            "datePublished": "Wed, 15 Jan 2014 00:25:21 +0000",
            "description": "Back in 2011 two rappers from Tennessee, Starlito and Don Trip, made a mixtape called Step Brothers. They were rhyming over original production and had sprinkled clips from the Will Ferrell and John C. Reilly movie of the same name throughout the tape. Step Brothers outperformed everything the two of them had released previously and everything they did on their own after it, until this fall, when they released an album called Step Brothers 2.\r\n\r\nWhile in New York on business, Don Trip and Starlito spoke to Microphone Check co-hosts Ali Shaheed Muhammad and Frannie Kelley about where they come from, their definition of trap music and relationships, both working and romantic.",
            "length": "56642245",
            "sourceUrl": "http://feeds.soundcloud.com/stream/129559510-frannieandali-starlito-and-don-trip-writers.mp3"
        },
        {
            "title": "What We Talked About When We Talked About Hip-Hop In 2013",
            "datePublished": "Fri, 06 Dec 2013 21:36:52 +0000",
            "description": "We all listen to music differently. What we hear is shaded by our history, our knowledge, our equipment, our mood, our taste. But every year there are moments when everybody who lives and breathes hip-hop is talking about the same thing.\r\n\r\nIn June, when Jay's Samsung/Magna Carta Holy Grail ad aired during game 5 of the NBA finals. A Thursday in April when Pusha T's \"Numbers on the Boards\" dropped. A Friday night in May, when Kanye's face appeared on buildings all over the country. The middle of September, when Drake's Nothing Was the Same leaked. The evening in August when Funkmaster Flex dropped — with his bomb sound — Kendrick Lamar's verse on Big Sean's \"Control.\"\r\n\r\nFor this episode of Microphone Check co-hosts Ali Shaheed Muhammad and Frannie Kelley are joined by their social media manager, Cedric Shine. All three of them experienced those disruptions differently — and their opinions of both their meaning and the quality of the music at their root are not unanimous. Their conversation ranges from Ali's inside track on Magna Carta to Troy Ave, ASAP Ferg, music journalism's involvement in Kanye's year and how the quality of life in New York City is affecting the music being made there.",
            "length": "112556288",
            "sourceUrl": "http://feeds.soundcloud.com/stream/123582761-frannieandali-what-we-talked-about-when-we.mp3"
        },
        {
            "title": "Bun B On Janis Joplin, UGK's Label Struggles And His Voice",
            "datePublished": "Mon, 25 Nov 2013 18:13:23 +0000",
            "description": "This month Bun B, one half of the Underground Kingz, of Port Arthur, Texas, released his fourth solo project and celebrated the 21st anniversary of his group's first album, Too Hard To Swallow. The road Bun has walked over those years hasn't always been smooth. In 2007 his partner Pimp C died, and, in their early days, the duo's musical and critical success wasn't hitting their wallets.\n\n\"I had literally the No. 1 record in the city and was delivering soul food dinners because we were making absolutely no money from the record company,\" says Bun about the period between 1992 and 1995. \"We went to the radio station, asked them could we go on the air, and told the public we were broke. Our record company had us in a crazy contract, management had us in a crazy contract, so if they see us and we don't look a certain way, don't think it's a misuse of funds on our part. We're not getting it. If you're paying the record company for this music, the money's not getting to us.\"\n\nBun B also spoke with Microphone Check hosts Ali Shaheed Muhammad and Frannie Kelley about Lil Boosie, Ed O.G. and the real meaning of trill.",
            "length": "73340550",
            "sourceUrl": "http://feeds.soundcloud.com/stream/121846165-frannieandali-bun-b-on-janis-joplin-ugks.mp3"
        },
        {
            "title": "Earl Sweatshirt On RZA Day, His Purpose And Paul McCartney",
            "datePublished": "Wed, 20 Nov 2013 16:22:36 +0000",
            "description": "The rapper and producer Earl Sweatshirt put out his first major label album, called Doris, this summer. Earl came up with the free-wheeling, button-pushing rap group Odd Future, then disappeared, sent by his mother to boarding school in Samoa. His friends mourned his absence loudly and when he came home in the winter of 2012, no one was sure he'd be able to deliver on his earlier promise.\r\n\r\nEarl produced almost half the songs on Doris, which features many of his friends, including the rapper Vince Staples. Vince joined Earl in a conversation with Microphone Check hosts Ali Shaheed Muhammad and Frannie Kelley. They spoke about the music business, how to tell if a song is any good and an encounter with Sir Paul McCartney that happened right before they sat down.",
            "length": "55298506",
            "sourceUrl": "http://feeds.soundcloud.com/stream/121056724-frannieandali-earl-sweatshirt-on-rza-day-his.mp3"
        },
        {
            "title": "Eight Million Stories: Hip-Hop In 1993",
            "datePublished": "Mon, 11 Nov 2013 19:55:07 +0000",
            "description": "All year Morning Edition and NPR Music have been running radio pieces about rap albums released 20 years ago, in 1993. For a special episode of Microphone Check we invited a group of people who were working in hip-hop back then to meet us at the Ace Hotel in New York City and tell stories about that productive and creative year. \r\n\r\nOur guests were:\r\n\r\nFaith Newman — A&R at Def Jam and then Columbia, who signed Nas.\r\n\r\nRalph McDaniels — host of Video Music Box, music video director and producer.\r\n\r\nPrince Paul — producer for De La Soul and the Gravediggaz, member of Handsome Boy Modeling School and solo musician.\r\n\r\nMike Dean — engineer and producer at Rap-A-Lot Records.\r\n\r\nStretch Armstrong — DJ for WKCR's Stretch & Bobbito radio show.",
            "length": "49212119",
            "sourceUrl": "http://feeds.soundcloud.com/stream/119652515-frannieandali-microphone-check-presents-8.mp3"
        },
        {
            "title": "Microphone Check: Pusha T Part 2",
            "datePublished": "Wed, 16 Oct 2013 17:52:03 +0000",
            "description": "In the second part of an interview with Pusha T, Microphone Check co-host Ali Shaheed Muhammad is dragged into a public battle over which A Tribe Called Quest album is better — Low End Theory or Midnight Marauders. Pusha details his frustrations with the music industry in general, and one fashion company in particular, and says his dream for hip-hop is for legacy acts to tour like The Eagles. \"I don't think I will ever put any other music before it, so I need to see it all the way through. I need to see it in all of its splendor,\" he says. When co-host Frannie Kelley tries to end their conversation on a high note, Pusha recalls the making of the last song on his new album, a song that comes from a hard truth: \"I don't necessarily want to hear rap anymore that doesn't give me — if we're talking about the streets — we can't just glorify it. We have to tell the whole story.\"",
            "length": "54815764",
            "sourceUrl": "http://feeds.soundcloud.com/stream/115635589-frannieandali-microphone-check-pusha-t-part.mp3"
        },
        {
            "title": "Microphone Check: Pusha T Part 1",
            "datePublished": "Fri, 11 Oct 2013 16:21:40 +0000",
            "description": "This week rapper Pusha T released his first solo album after years of writing and performing as a duo, with his brother Malice in the Clipse. But he's not all on his own. Pusha is part of Kanye West's conglomerate — the two of them made Yeezus and My Name Is My Name simultaneously — and still works closely with Pharrell, who he's known since they were in high school in Virginia Beach.\r\n\r\nIn the first part of an interview with Microphone Check hosts Ali Shaheed Muhammad and Frannie Kelley, Pusha decries the current state of hip-hop, saying he looked to rap made between 1994 and 1999 for inspiration while making My Name Is My Name: \"Hip-hop to me right now is really easy listening. It's very easy listening, like there's nothing abrasive about it. There's no album that I put in my car that makes me roll down the windows — all the windows — and ride past the club line three times before I get out the car. The Purple Tape made me do that.\"",
            "length": "52822098",
            "sourceUrl": "http://feeds.soundcloud.com/stream/114883405-frannieandali-pusha-t-with-microphone-check.mp3"
        },
        {
            "title": "Microphone Check: Marley Marl",
            "datePublished": "Thu, 12 Sep 2013 16:19:42 +0000",
            "description": "Marley Marl is one of the most important people in hip-hop history. He's the one who figured out how to sample — how to get pieces of songs off vinyl records and into a drum machine. More than 30 years later, and 25 years after his first album, 1988's In Control Vol. 1, he sat down with Microphone Check hosts Ali Shaheed Muhammad and Frannie Kelley to tell stories about the moment he realized what his discovery meant, why the New York City Housing Authority should get a co-producer credit on some of his records and how he and LL Cool J got inspired to make Mama Said Knock You Out.\r\n \r\nThe seminal producer also tells stories about Mr. Magic, Pete Rock, Big Daddy Kane and Biz Markie.",
            "length": "41044844",
            "sourceUrl": "http://feeds.soundcloud.com/stream/110063419-frannieandali-microphone-check-marley-marl.mp3"
        }
    ]
}