{
    "artwork": "http://is1.mzstatic.com/image/thumb/Music71/v4/85/a0/15/85a01580-ca97-0c03-41bd-2dcf62585de6/source/100x100bb.jpg",
    "description": "Mocking the Draft",
    "feedURL": "http://www.blogtalkradio.com/mockingthedraft/podcast",
    "podcastURL": "http://www.blogtalkradio.com/mockingthedraft",
    "title": "Mocking the Draft",
    "episodes": [
        {
            "title": "Mocking the Draft recaps the 2017 NFL Draft",
            "datePublished": "Tue, 09 May 2017 14:30:00 GMT",
            "description": "The Mocking the Draft podcast is back for a 2017 NFL Draft recap. Dan Kadar of SB Nationa and Matthew Fairburn of Syracuse.com break down some of the surprises of the draft as well as which teams had the best and worst drafts. \r\n",
            "length": "49410476",
            "sourceUrl": "https://www.blogtalkradio.com/mockingthedraft/2017/05/09/mocking-the-draft-recaps-the-2017-nfl-draft.mp3",
            "categories": [
                {
                    "_": "Sports",
                    "$": {
                        "domain": "http://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "NFL Mock Draft 2017: How far will Deshaun Watson fall? Our final mock!",
            "datePublished": "Thu, 27 Apr 2017 01:00:00 GMT",
            "description": "With the NFL Draft less than 24 hours away, the Mocking the Draft team colloborates for its first and final 2017 NFL Mock Draft. Dan Kadar of SB Nationa and Matthew Fairburn of the Syracuse Post-Standard go pick-by-pick through the first round, sprinkling in some surprises along the way. How many quarterback go in round one? How far will Deshaun Watson fall? All that and more in this epsidoe. \r\n",
            "length": "75222382",
            "sourceUrl": "https://www.blogtalkradio.com/mockingthedraft/2017/04/27/nfl-mock-draft-2017-how-far-will-deshaun-watson-fall-our-final-mock.mp3",
            "categories": [
                {
                    "_": "Sports",
                    "$": {
                        "domain": "http://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "Taking your 2017 NFL Draft questions on Dalvin Cook, Patrick Mahomes and more",
            "datePublished": "Wed, 19 Apr 2017 13:00:00 GMT",
            "description": "Dan Kadar and Matthew Fairburn bring back the Mocking the Draft podcast to preview the 2017 NFL Draft. On the second part of the return epsode, the two took questions from listeners, which led to discussions on Dalvin Cook, Patrick Mahomes, Tyus Bowser and much more. \r\n",
            "length": "46728064",
            "sourceUrl": "https://www.blogtalkradio.com/mockingthedraft/2017/04/19/taking-your-2017-nfl-draft-questions-on-dalvin-cook-patrick-mahomes-and-more.mp3",
            "categories": [
                {
                    "_": "Sports",
                    "$": {
                        "domain": "http://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "2017 NFL Draft: Mocking the Draft returns to talk QBs and the top 10 picks",
            "datePublished": "Wed, 19 Apr 2017 07:30:00 GMT",
            "description": "Dan Kadar of SB Nation and Matthew Fairburn of The Syracuse Post-Standard return as hosts of the Mocking the Draft podcast to preview the 2017 NFL Draft with a look at the quarterback class. Would the Browns really consider Trubisky with the first pick? How should these quarterbacks be ranked? What other teams will be in the market for quarterbacks?\r\n",
            "length": "37876107",
            "sourceUrl": "https://www.blogtalkradio.com/mockingthedraft/2017/04/19/2017-nfl-draft-mocking-the-draft-returns-to-talk-qbs-and-the-top-10-picks.mp3",
            "categories": [
                {
                    "_": "Sports",
                    "$": {
                        "domain": "http://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "Answering your 2016 NFL Draft questions",
            "datePublished": "Wed, 27 Apr 2016 00:00:00 GMT",
            "description": "NFL Draft week is here. On this week's Mocking the Draft podcast, hosts Matthew Fairburn of the Syracuse Media Group and Dan Kadar of SB Nation answer listener questions.\r\n\r\nAnd that's it. They're making this show all about the listerns and what you want to know before commissioner Roger Goodell announces the first pick is announced on Thursday night.\r\n\r\nWhether it's a team need question, where a player might get drafted or something completely random, they'll answer as many questions as possible.\r\n",
            "length": "59705514",
            "sourceUrl": "https://www.blogtalkradio.com/mockingthedraft/2016/04/27/answering-your-2016-nfl-draft-questions.mp3",
            "categories": [
                {
                    "_": "Sports",
                    "$": {
                        "domain": "http://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "Fallout from another blockbuster 2016 NFL Draft trade and a mock draft",
            "datePublished": "Thu, 21 Apr 2016 00:00:00 GMT",
            "description": "We have another trade. Following a blockbuster trade between the Tennessee Titans and Los Angeles Rams for the No.1 pick in the draft, the No. 2 pick has now been moved. The Cleveland Browns and Philadelphia Eagles pulled off a blockbuster of their own with the Eagles moving up to the second pick in the 2016 NFL Draft in exchange for the eighth pick and much more.\r\n\r\nOn this week's Mocking the Draft podcast, hosts Matthew Fairburn of the Syracuse Media Group and Dan Kadar of SB Nation analyze the pick and figure out who won and who lost.\r\n\r\nThey'lll also work their way through a new mock draft and answer a few reader questions.\r\n",
            "length": "72354631",
            "sourceUrl": "https://www.blogtalkradio.com/mockingthedraft/2016/04/21/fallout-from-another-blockbuster-2016-nfl-draft-trade-and-a-mock-draft.mp3",
            "categories": [
                {
                    "_": "Sports",
                    "$": {
                        "domain": "http://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "The fallout of the No. 1 pick in the 2016 NFL Draft getting traded",
            "datePublished": "Thu, 14 Apr 2016 22:30:00 GMT",
            "description": "We have a trade. The 2016 NFL Draft was rocked this week when the Tennessee Titans traded the first overall pick to the Los Angeles Rams. \r\n\r\nOn this week's Mocking the Draft podcast, hosts Matthew Fairburn of Syracuse Media Group and Dan Kadar of SB Nation analyze the trade. Speculation has gone back and forth about who the Rams will take with the first pick, but maybe it should be obvious. \r\n\r\nBy trading the first pick the Titans reaped a massive haul of picks, including two first-round picks, two second-round picks, and two third-round picks all spread over this year's draft and next year's draft. Why would Tennessee give up the top pick? We discuss that and figure out some names that fit in Music City.\r\n\r\nThe trade also has numerous ripple effects on the draft. What does Cleveland do at No. 2? How far could Laremy Tunsil drop after being the expectant top pick? Those questions and a few from listeners will be answered on this week's MtD podcast.\r\n",
            "length": "0",
            "sourceUrl": "https://www.blogtalkradio.com/mockingthedraft/2016/04/14/the-fallout-of-the-no-1-pick-in-the-2016-nfl-draft-getting-traded.mp3",
            "categories": [
                {
                    "_": "Sports",
                    "$": {
                        "domain": "http://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "Paxton Lynch's pro day, the number of 1st round QBs and our favorite prospects",
            "datePublished": "Thu, 07 Apr 2016 00:00:00 GMT",
            "description": "On this week's Mocking the Draft podcast, hosts Matthew Fairburn of the Syracuse Media Group and Dan Kadar of SB Nation talk quarterbacks. Paxton Lynch of Memphis was the final big-name signal caller to hold his pro day this week. Does having a pro day this late in the schedule hurt Lynch's draft stock?\r\n\r\nFairburn and Kadar also try and figure out how many quarterbacks wil get picked in the first round, and which one they'd take fifth. The expectation is that Lynch, Jared Goff of Cal, Carson Wentz of North Dakota State and Connor Cook of Michigan State will be the first four quarterbacks picked. But after that, it's wide open. Could the fifth be Cardale Jones of Ohio State or someone like Jacoby Brissett of North Carolina State? The guys make their picks for the fifth QB. \r\n\r\nThey'll also annoint their favorite prospects in this year's draft. Maybe not necessarily the top players, but the ones they personally like the most. They'll also answer a few reader questions to close the show.\r\n",
            "length": "0",
            "sourceUrl": "https://www.blogtalkradio.com/mockingthedraft/2016/04/07/paxton-lynchs-pro-day-the-number-of-1st-round-qbs-and-our-favorite-prospects.mp3",
            "categories": [
                {
                    "_": "Sports",
                    "$": {
                        "domain": "http://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "How free agency has changed the 2016 NFL Draft",
            "datePublished": "Fri, 18 Mar 2016 00:00:00 GMT",
            "description": "On this week's Mocking the Draft, we take a look at how free agency has changed the 2016 NFL Draft. Hosts Matthew Fairburn of the Syracuse Media Group and Dan Kadar of SB Nation debate the biggest veteran moves and how the draft's outlook seems to change by the day. Among the biggest moves was quarterback Brock Osweiler signing with the Houston Texans.  What does that mean for Houston's plans in the first round, and does it mean Osweiler's former team the Denver Broncos should draft a quarterback early?\r\n\r\nOne of the other big chips out there is San Francisco 49ers quarterback Colin Kaepernick. It's expected he'll be on a new team next season, but does that mean whichever team lands him should pass on a quarterback?\r\n\r\nWe also look at some of the notable pro days that have happened, including a reportedly stellar showing by Penn State's Christian Hackenbenberg. We also answer a few listener questions to close the show\r\n",
            "length": "71833519",
            "sourceUrl": "https://www.blogtalkradio.com/mockingthedraft/2016/03/18/how-free-agency-has-changed-the-2016-nfl-draft.mp3",
            "categories": [
                {
                    "_": "Sports",
                    "$": {
                        "domain": "http://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "2016 NFL mock draft edition",
            "datePublished": "Wed, 09 Mar 2016 01:00:00 GMT",
            "description": "On this week's show, hosts Matthew Fairburn and Dan Kadar navigate the minefield that is NFL free agency to deliver a tag team mock draft. \r\n\r\nFairburn, who covers the Buffalo Bills for the Syracuse Media Group, is handling the odd picks starting with the Tennessee Titans at No. 1 overall. Does he go the expected route and give the Titans Ole Miss left tackle Laremy Tunsil or does he present a curveball? Kadar, SB Nation's NFL Draft editor, handles the even picks. Which quarterback will he give the Cleveland Browns at No. 2?\r\n\r\nTune into this week's episode to hear the entire mock draft, and more.\r\n",
            "length": "71165202",
            "sourceUrl": "https://www.blogtalkradio.com/mockingthedraft/2016/03/09/2016-nfl-mock-draft-edition.mp3",
            "categories": [
                {
                    "_": "Sports",
                    "$": {
                        "domain": "http://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "Breaking down the Scouting Combine and what it means for the 2016 NFL Draft",
            "datePublished": "Thu, 03 Mar 2016 01:00:00 GMT",
            "description": " The NFL Scouting Combine is over, but what impact will it have on the draft? In this week's episode of the Mocking the Draft podcast, hosts Matthew Fairburn and Dan Kadar look back at the week of events at Lucas Oil Stadium. What repercussions do the workouts and interviews have on the NFL's offseason? They'll take a look at some of the key storylines and answer a few listener questions. \r\n\r\n\r\n\tThe 2016 NFL Draft is less than two months away. Get ready for it with the MtD podcast.\r\n",
            "length": "63796581",
            "sourceUrl": "https://www.blogtalkradio.com/mockingthedraft/2016/03/03/breaking-down-the-scouting-combine-and-what-it-means-for-the-2016-nfl-draft.mp3",
            "categories": [
                {
                    "_": "Football",
                    "$": {
                        "domain": "http://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "2016 NFL Draft quarterback talk and more",
            "datePublished": "Wed, 17 Feb 2016 01:00:00 GMT",
            "description": "The Mocking the Draft podcast is back by popular demand! Hosts Matthew Fairburn and Dan Kadar are back to break down the 2016 NFL Draft. In this week's episode they tackle this year's quarterback class. What are some of the best fits for the incoming rookie class? Is there really a franchise quarterback amongst the group? We also look ahead to next week's NFL Scouting Combine in Indianapolis and handle a few reader questions.\r\n",
            "length": "59227870",
            "sourceUrl": "https://www.blogtalkradio.com/mockingthedraft/2016/02/17/2016-nfl-draft-quarterback-talk-and-more.mp3",
            "categories": [
                {
                    "_": "Sports",
                    "$": {
                        "domain": "http://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "Recapping the 2015 NFL Draft",
            "datePublished": "Thu, 07 May 2015 02:00:00 GMT",
            "description": "The 2015 NFL Draft is over and Matthew Fairburn of Syracuse.com and Dan Kadar of SB Nation take a look back. We'll talk the best and worst of the draft. Which teams did the best? Which teams made some questionable picks? Following a year of buildup, they'll go over that and much more.\r\n",
            "length": "72305812",
            "sourceUrl": "https://www.blogtalkradio.com/mockingthedraft/2015/05/07/recapping-the-2015-nfl-draft.mp3",
            "categories": [
                {
                    "_": "Sports",
                    "$": {
                        "domain": "http://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "Previewing the 2015 NFL Draft",
            "datePublished": "Wed, 29 Apr 2015 02:00:00 GMT",
            "description": "It's draft week, and Matthew Fairburn of Syracuse.com and Dan Kadar of SB Nation are back with the Mocking the Draft podcast. We've done all our mock drafts and we've gone through the hot takes, so what's left to talk about regarding the 2015 NFL Draft?\r\n\r\nThis week we'll go over the latest news and rumors surrounding the draft. What does Shane Ray's recent drug bust mean for his draft stock? What will the action be like at pick No. 2 with the Tennessee Titans? Are they taking Oregon quarterback Marcus Mariota? Will we see a number of trades again this year? We'll talk those things and much more on the MtD podcast.\r\n",
            "length": "71650870",
            "sourceUrl": "https://www.blogtalkradio.com/mockingthedraft/2015/04/29/previewing-the-2015-nfl-draft.mp3",
            "categories": [
                {
                    "_": "Sports",
                    "$": {
                        "domain": "http://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "2015 NFL mock draft 2.0 on the MtD podcast",
            "datePublished": "Thu, 23 Apr 2015 02:00:00 GMT",
            "description": "Matthew Fairburn of Syracus.com and Dan Kadar of SB Nation are back with the Mocking the Draft podcast. This week they're doing another mock draft. For this mock, the guys are doing a full first round and finding picks for the Bills and Seahawks in the second round. Will Jameis Winston go first overall? Probably. But where will Oregon's Marcus Mariota land? Listen in as Kadar takes the odd picks and Fairburn handles the evens.\r\n\r\nWe'll also talk about smoke screen. It's being laid pretty heavy this time of year, so how do reporters try and dig through the smoke to find the truth?\r\n",
            "length": "76908797",
            "sourceUrl": "https://www.blogtalkradio.com/mockingthedraft/2015/04/23/2015-nfl-mock-draft-20-on-the-mtd-podcast.mp3",
            "categories": [
                {
                    "_": "Sports",
                    "$": {
                        "domain": "http://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "Talking the 2015 NFL Draft's hottest takes",
            "datePublished": "Thu, 16 Apr 2015 02:00:00 GMT",
            "description": "Matthew Fairburn of Syracuse.com and Dan Kadar of SB Nation are back with episode No. 56 of the Mocking the Draft podcast. We're just two weeks away from the start of the 2015 NFL Draft, and the takes are getting strong. And ridiculous. And cringeworthy. This week they'll go over some of the wackiest things being said about this year's top prospects.\r\n\r\nThey also answer a few reader questions and much more.\r\n",
            "length": "67212980",
            "sourceUrl": "https://www.blogtalkradio.com/mockingthedraft/2015/04/16/talking-the-2015-nfl-drafts-hottest-takes.mp3",
            "categories": [
                {
                    "_": "Sports",
                    "$": {
                        "domain": "http://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "Answering your NFL Draft questions",
            "datePublished": "Wed, 08 Apr 2015 02:00:00 GMT",
            "description": "The 2015 NFL Draft is almost here! This week, Matthew Fairburn from Syracuse.com and Dan Kadar from SB Nation are back to answer your questions on the Mocking the Draft podcast.\r\n\r\nThis week we'll take a look at the Tennessee Titans and the No. 2 pick in the draft, a possilble surprise for the Atlanta Falcons with the No. 8 pick and options for the Carolina Panthers in the first round.\r\n\r\nWe'll look at those issues and many more on episode 55 of the MtD podcast.\r\n",
            "length": "61635314",
            "sourceUrl": "https://www.blogtalkradio.com/mockingthedraft/2015/04/08/answering-your-nfl-draft-questions.mp3",
            "categories": [
                {
                    "_": "Sports",
                    "$": {
                        "domain": "http://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "Using the NFL Draft to fix two teams and debating Winston and Mariota",
            "datePublished": "Thu, 26 Mar 2015 02:00:00 GMT",
            "description": "On this week’s episode of the Mocking the Draft podcast, Matthew Fairburn of Syracuse.com and Dan Kadar of SB Nation are fixing two teams. That’s right. They’ll take a look at two NFL teams and figure out their perfect NFL Draft.\r\n\r\nThey'll also debate the merits of Jameis Winston and Marcus Mariota, the two best quarterbacks in the 2015 NFL Draft. Why? Becuase this is a draft show and they're contractually obligated to do so (not really). Which is better? Are Winston's off-field issues too big of a concern? Are Mariota's on-field issues a bigger deal?\r\n\r\nThey'll talk that and much more on the latest episode of the MtD podcast.\r\n",
            "length": "64253829",
            "sourceUrl": "https://www.blogtalkradio.com/mockingthedraft/2015/03/26/using-the-nfl-draft-to-fix-two-teams-and-debating-winston-and-mariota.mp3",
            "categories": [
                {
                    "_": "Sports",
                    "$": {
                        "domain": "http://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "Taking a look at pro days, NFL free agency and analyzing edge rushers",
            "datePublished": "Thu, 19 Mar 2015 02:00:00 GMT",
            "description": "Matthew Fairburn of Syracuse.com and Dan Kadar of SB Nation are back with the Mocking the Draft podcast. This week they take a look at some of the more significant pro days that have taken place and what it means for the NFL Draft. They'll also go over more free agency moves in the NFL and talk about what they mean for the draft.\r\n\r\nThis week's show will also feature a discussion of the best edge pass rushers in the draft. Who is the best? Is it Randy Gregory of Nebraska, Dante Fowler of Florida or Vic Beasley of Clemson? Is there a good sleeper at the position to be found later in the draft?\r\n\r\nThey'll also go over a few news items as they relate to the draft and more on this week's episode of the Mocking the Draft podcast.\r\n",
            "length": "66634524",
            "sourceUrl": "https://www.blogtalkradio.com/mockingthedraft/2015/03/19/taking-a-look-at-pro-days-nfl-free-agency-and-analyzing-edge-rushers.mp3",
            "categories": [
                {
                    "_": "Sports",
                    "$": {
                        "domain": "http://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "NFL free agency and its effect on the draft and mock draft comments",
            "datePublished": "Thu, 12 Mar 2015 02:00:00 GMT",
            "description": "Matthew Fairburn of Syracuse.com and Dan Kadar of SB Nation are back with the Mocking the Draft podcast. This week they take a look at NFL free agency and will break down which moves have the biggest effect on the upcoming draft. Was it the Lions signing Ndamukong Suh? The Jets getting Darrelle Revis back? Philadelphia making a bunch of weird moves? Every free agent move has a ripple effect.\r\n\r\nThey'll also look at some of the comments left on last week's mock draft and hopefully not break down in tears. They may even touch on the upcoming veteran's combine and much more in the MtD podcast.\r\n",
            "length": "58849617",
            "sourceUrl": "https://www.blogtalkradio.com/mockingthedraft/2015/03/12/nfl-free-agency-and-its-effect-on-the-draft-and-mock-draft-comments.mp3",
            "categories": [
                {
                    "_": "Sports",
                    "$": {
                        "domain": "http://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "Building a mock draft: Should Jameis Winston or Marcus Mariota go No. 1?",
            "datePublished": "Thu, 05 Mar 2015 03:00:00 GMT",
            "description": "On this week's episode of the Mocking the Draft podcast, Matthew Fairburn of Syracuse.com and Dan Kadar from SB Nation put together their first joint mock draft of the year. In this year's mock, Fairburn is handling the odd picks while Kadar takes care of the evens. What will Fairburn do with the Buccaneers at No. 1?\r\n\r\nThey'll also go over the blockbuster trade between the Eagles and Bills that sent running back LeSean McCoy to Buffalo and Kiko Alonso to Philadelphia. How will that change how those two teams run their draft? Listen to the latest episode to the MtD podcast to find out.\r\n",
            "length": "67171602",
            "sourceUrl": "https://www.blogtalkradio.com/mockingthedraft/2015/03/05/building-a-mock-draft-should-jameis-winston-or-marcus-mariota-go-no-1.mp3",
            "categories": [
                {
                    "_": "Sports",
                    "$": {
                        "domain": "http://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "Looking back at the NFL Scouting Combine",
            "datePublished": "Fri, 27 Feb 2015 03:00:00 GMT",
            "description": "Fresh off a week in Indianapolis at the NFL Scouting Combine, Matthew Fairburn of Syracuse.com and Dan Kadar of SB Nation look ahead to the draft. What is the biggest storyline coming out of Indianapolis and which players helped their draft stock? They'll look at that and more on episode 41 of the podcast.\r\n",
            "length": "59561819",
            "sourceUrl": "https://www.blogtalkradio.com/mockingthedraft/2015/02/27/looking-back-at-the-nfl-scouting-combine.mp3",
            "categories": [
                {
                    "_": "Sports",
                    "$": {
                        "domain": "http://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "Episode 40: Mock draft talk and previewing the 2015 NFL Scouting Combine",
            "datePublished": "Thu, 12 Feb 2015 02:00:00 GMT",
            "description": "Matthew Faiburn of Syracuse.com and Dan Kadar of SB Nation are back to talk NFL Draft in episode 40 of the Mocking the Draft podcast. On this week's show we look ahead to next week's NFL Scouting Combine in Indianapolis. What are the key storylines? Why does the combine even matter? To participate or not participate? \r\n\r\nThey'll also go over their most recent mock drafts and pick out some of the more intersting choices and some of the more difficult fits. \r\n",
            "length": "69123889",
            "sourceUrl": "https://www.blogtalkradio.com/mockingthedraft/2015/02/12/episode-40-mock-draft-talk-and-previewing-the-2015-nfl-scouting-combine.mp3",
            "categories": [
                {
                    "_": "Sports",
                    "$": {
                        "domain": "http://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "NFL Draft variety show: RB value, Super Bowl fallout and much more",
            "datePublished": "Fri, 06 Feb 2015 02:00:00 GMT",
            "description": "Matthew Fairburn of Syracuse.com and Dan Kadar of SB Nation are back with episode No. 39 of the Mocking the Draft podcast. On this week's show they'll take a quick look at the Super Bowl – don't worry, no talk about deflated footballs, #LeftShark or those terrible commercials. They'll take a look at some of the running back prospects in the 2015 NFL Draft and discuss the true value of a running back. They'll also review the potential loss of draft picks for the Atlanta Falcons, Cleveland Browns and New England Patriots. OK, maybe that means a little bit of deflated football talk.\r\n",
            "length": "56845920",
            "sourceUrl": "https://www.blogtalkradio.com/mockingthedraft/2015/02/06/nfl-draft-variety-show-rb-value-super-bowl-fallout-and-much-more.mp3",
            "categories": [
                {
                    "_": "Sports",
                    "$": {
                        "domain": "http://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "Breaking down the Senior Bowl and previewing the Super Bowl",
            "datePublished": "Thu, 29 Jan 2015 02:00:00 GMT",
            "description": "Matthew Fairburn of Syracuse.com and Dan Kadar of SB Nation are back for episode 38 of the Mocking the Draft podcast. This week they'll look back at week of Senior Bowl practices. Which players stood out? Which players didn't? They'll also look ahead to Super Bowl XLIX between the Seattle Seahawks and New England Patriots. They'll talk about that and more on episode 38 of the Mocking the Draft podcast.\r\n",
            "length": "60593760",
            "sourceUrl": "https://www.blogtalkradio.com/mockingthedraft/2015/01/29/breaking-down-the-senior-bowl-and-previewing-the-super-bowl.mp3",
            "categories": [
                {
                    "_": "Sports",
                    "$": {
                        "domain": "http://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "Previewing the 2015 Senior Bowl and much, much more (we're back)",
            "datePublished": "Thu, 15 Jan 2015 02:00:00 GMT",
            "description": "Matthew Fairburn and Dan Kadar are back to talk NFL Draft. After a long layoff we return to begin a look ahead to the 2015 NFL Draft starting with a preview of next week's Senior Bowl and look back at the national title game against Ohio State and Oregon. We'll talk about wide receiver prospect Dorial Green-Beckham and much more on episode 46 of the Mocking the Draft podcast.\r\n",
            "length": "74032402",
            "sourceUrl": "https://www.blogtalkradio.com/mockingthedraft/2015/01/15/previewing-the-2015-senior-bowl-and-much-much-more-were-back.mp3",
            "categories": [
                {
                    "_": "Sports",
                    "$": {
                        "domain": "http://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "Wrapping up the 2014 NFL Draft",
            "datePublished": "Thu, 15 May 2014 01:00:00 GMT",
            "description": "On Episode 45 of the Mocking the Draft podcast, hosts Dan Kadar and Matthew Fairburn took a look back at the 2014 NFL Draft. Which teams had the best drafts? Who could have done better? Who was the biggest steal of the draft? We also took questions from listeners and took a quick look at the 2015 NFL Draft.\r\n",
            "length": "18626528",
            "sourceUrl": "https://www.blogtalkradio.com/mockingthedraft/2014/05/15/wrapping-up-the-2014-nfl-draft.mp3",
            "categories": [
                {
                    "_": "Sports",
                    "$": {
                        "domain": "http://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "The 2014 NFL Draft has arrived",
            "datePublished": "Thu, 08 May 2014 01:00:00 GMT",
            "description": "This is it. Episode 44 of the Mocking the Draft podcast will be our final show before the 2014 NFL Draft. Hosts Dan Kadar and Matthew Fairburn take a look back at the draft process, offer up some final predcitions for the 2014 NFL Draft and take questions from listeners. Johnny Manziel, Jadeveon Clowney and Teddy Bridgewater are likely to steal the headlines on Thursday night, but the entire 2014 NFL Draft should be one of the most exciting drafts in years. \r\n",
            "length": "20240480",
            "sourceUrl": "https://www.blogtalkradio.com/mockingthedraft/2014/05/08/the-2014-nfl-draft-has-arrived.mp3",
            "categories": [
                {
                    "_": "Sports",
                    "$": {
                        "domain": "http://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "Talking 2014 NFL Draft with Dane Brugler of CBS",
            "datePublished": "Thu, 01 May 2014 01:00:00 GMT",
            "description": "The Mocking the Draft podcast added a guest host for the second to last episode before the 2014 NFL Draft. Dane Brugler of CBS joins Dan Kadar and Matthew Fairburn of SB Nation to cross check notes leading up to the NFL Draft. They compare rankings, talk sleepers, and of course, talk a little bit about Teddy Bridgewater, who has become a polarizing prospect in this draft class. \r\n",
            "length": "26803136",
            "sourceUrl": "https://www.blogtalkradio.com/mockingthedraft/2014/05/01/talking-2014-nfl-draft-with-dane-brugler-of-cbs.mp3",
            "categories": [
                {
                    "_": "Sports",
                    "$": {
                        "domain": "http://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "Which players will be in New York for the 2014 NFL Draft?",
            "datePublished": "Thu, 24 Apr 2014 01:00:00 GMT",
            "description": "It's time to start making those draft plans. In just over two weeks, the Houston Texans will be on the clock with the first pick in the 2014 NFL Draft. On Tuesday, the NFL released a list of a record-high 30 players who will attend the draft at Radio City Music Hall. On Episode 42 of the Mocking the Draft podcast, made guesses at which players will be waiting the longest to hear their names called. We also talked about Teddy Bridgewater, Jadeveon Clowney and some late-round sleepers to keep an eye on. As always, we took your questions as well. \r\n",
            "length": "26044832",
            "sourceUrl": "https://www.blogtalkradio.com/mockingthedraft/2014/04/24/which-players-will-be-in-new-york-for-the-2014-nfl-draft.mp3",
            "categories": [
                {
                    "_": "Sports",
                    "$": {
                        "domain": "http://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "2014 NFL Mock Draft: Attempting to come to a consensus",
            "datePublished": "Thu, 17 Apr 2014 01:00:00 GMT",
            "description": "On Episode 41 of the Mocking the Draft podcast, we decided to do another live 2014 NFL Mock Draft. We went through the entire first round alternating picks. Will Teddy Bridgewater and Johnny Manziel fall? Which players are becoming locks for the top 10? Will the Texans draft Jadeveon Clowney with the first pick? We'll sort through all of that and more on the show this week.\r\n",
            "length": "26959520",
            "sourceUrl": "https://www.blogtalkradio.com/mockingthedraft/2014/04/17/2014-nfl-mock-draft-attempting-to-come-to-a-consensus.mp3",
            "categories": [
                {
                    "_": "Sports",
                    "$": {
                        "domain": "http://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "Zach Mettenberger, Tom Savage and the absurdity of the 2014 NFL Draft",
            "datePublished": "Thu, 10 Apr 2014 01:00:00 GMT",
            "description": "It's Epsisode 40 of the Mocking the Draft podcast, and this week there will be more quarterback talk. This time, the focus is on Zach Mettenberger, who throws for scouts on Wednesday, and Tom Savage, who has created a ton of buzz lately. How weird is this quarterback class and this draft in general? Are we any closer to narrowing down first-round projections? We answer this questions and questions from readers on the show.\r\n",
            "length": "23166560",
            "sourceUrl": "https://www.blogtalkradio.com/mockingthedraft/2014/04/10/zach-mettenberger-tom-savage-and-the-absurdity-of-the-2014-nfl-draft.mp3",
            "categories": [
                {
                    "_": "Sports",
                    "$": {
                        "domain": "http://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "Wrapping up the big pro days with Jadeveon Clowney and Johnny Manziel",
            "datePublished": "Thu, 03 Apr 2014 00:30:00 GMT",
            "description": "On Episode 39 of the Mocking the Draft podcast, Dan Kadar and Matthew Fairburn discuss two of the last big pro days, Johnny Manziel and Jadeveon Clowney. They then take a look at what other pro days left are worth paying attention to. To wrap up the show, they take questions from listeners and discuss some news and rumors from around the NFL Draft world. \r\n",
            "length": "21782432",
            "sourceUrl": "https://www.blogtalkradio.com/mockingthedraft/2014/04/03/wrapping-up-the-big-pro-days-with-jadeveon-clowney-and-johnny-manziel.mp3",
            "categories": [
                {
                    "_": "Sports",
                    "$": {
                        "domain": "http://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "2014 NFL Draft news and pro day roundup",
            "datePublished": "Thu, 27 Mar 2014 00:30:00 GMT",
            "description": "On Episode 38 of the Mocking the Draft podcast, hosts Dan Kadar and Matthew Fairburn dive into pro days a bit more and discuss some of the biggest NFL Draft news of the week. They also take questions from listeners.\r\n",
            "length": "20715680",
            "sourceUrl": "https://www.blogtalkradio.com/mockingthedraft/2014/03/27/2014-nfl-draft-news-and-pro-day-roundup.mp3",
            "categories": [
                {
                    "_": "Sports",
                    "$": {
                        "domain": "http://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "Pro day roundup and 2014 NFL Mock Draft scenarios",
            "datePublished": "Thu, 20 Mar 2014 00:30:00 GMT",
            "description": "On Episode 37 of the Mocking the Draft podcast, Dan Kadar and Matthew Fairburn take a look at the news from around the pro day circuit, where things are starting to heat up. Teddy Bridgewater and Blake Bortles both had their pro days this week, and several other schools joined in as well. Later in the epsiode, the two reviewed some of the latest mock draft scenarios in the top 10 and took some questions from listeners. \r\n",
            "length": "23189600",
            "sourceUrl": "https://www.blogtalkradio.com/mockingthedraft/2014/03/20/pro-day-roundup-and-2014-nfl-mock-draft-scenarios.mp3",
            "categories": [
                {
                    "_": "Sports",
                    "$": {
                        "domain": "http://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "2014 NFL Draft rankings: Revealing the defensive positions",
            "datePublished": "Thu, 13 Mar 2014 00:30:00 GMT",
            "description": "On Episode 36 of the Mocking the Draft podcast, Dan Kadar and Matthew Fairburn reveal an update to their 2014 NFL Draft defensive position rankings. They also touched on some of the NFL Draft and free agency news while taking questions from listeners. \r\n",
            "length": "26715584",
            "sourceUrl": "https://www.blogtalkradio.com/mockingthedraft/2014/03/13/2014-nfl-draft-rankings-revealing-the-defensive-positions.mp3",
            "categories": [
                {
                    "_": "Sports",
                    "$": {
                        "domain": "http://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "2014 NFL Draft rankings: A new look at the big board",
            "datePublished": "Thu, 06 Mar 2014 01:30:00 GMT",
            "description": "On Episode 35 of the Mocking the Draft podcast, Dan Kadar and Matthew Fairburn take a look at the 2014 NFL Draft rankings and make their first adjustments since the Senior Bowl and NFL Scouting Combine. Who's moving up and who's moving down? They also take questions from listeners and touch on some of the news of the week.\r\n",
            "length": "23381120",
            "sourceUrl": "https://www.blogtalkradio.com/mockingthedraft/2014/03/06/2014-nfl-draft-rankings-a-new-look-at-the-big-board.mp3",
            "categories": [
                {
                    "_": "Sports",
                    "$": {
                        "domain": "http://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "2014 NFL Combine: Recapping the week in Indianapolis",
            "datePublished": "Thu, 27 Feb 2014 01:30:00 GMT",
            "description": "On Episode 34 of the Mocking the Draft podcast, Dan Kadar and Matthew Fairburn breakdown the 2014 NFL Scouting Combine after a week in Indianapolis. They take a look at who impressed on and off the field while taking questions from listeners. \r\n",
            "length": "19300736",
            "sourceUrl": "https://www.blogtalkradio.com/mockingthedraft/2014/02/27/2014-nfl-combine-recapping-the-week-in-indianapolis.mp3",
            "categories": [
                {
                    "_": "Sports",
                    "$": {
                        "domain": "http://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "2014 NFL Scouting Combine: Day one recap, weekend preview",
            "datePublished": "Fri, 21 Feb 2014 00:30:00 GMT",
            "description": "On Episode 33 of the Mocking the Draft podcast, Dan Kadar and Matthew Fairburn broadcast live from the 2014 NFL Scouting Combine in Indianapolis. They break down day one of interviews and take a look at what to expect throughout the weekend.\r\n",
            "length": "449408",
            "sourceUrl": "https://www.blogtalkradio.com/mockingthedraft/2014/02/21/2014-nfl-scouting-combine-day-one-recap-weekend-preview.mp3",
            "categories": [
                {
                    "_": "Sports",
                    "$": {
                        "domain": "http://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "Discussing Michael Sam and doing a live 2014 NFL Mock Draft",
            "datePublished": "Thu, 13 Feb 2014 01:30:00 GMT",
            "description": "On Episode 32 of the Mocking the Draft podcast, Matthew Fairburn and Dan Kadar spend some time discussing Missouri defensive end Michael Sam and his decision to announce publicly that he is gay. They also do a live 2014 NFL Mock Draft, alternating picks as they go. \r\n",
            "length": "26594048",
            "sourceUrl": "https://www.blogtalkradio.com/mockingthedraft/2014/02/13/discussing-michael-sam-and-doing-a-live-2014-nfl-mock-draft.mp3",
            "categories": [
                {
                    "_": "Sports",
                    "$": {
                        "domain": "http://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "2014 NFL Scouting combine invites, snubs",
            "datePublished": "Fri, 07 Feb 2014 01:30:00 GMT",
            "description": "On Episode 31 of the Mocking the Draft podcast, hosts Dan Kadar and Matthew Fairburn take a look at the 2014 NFL Scouting Combine invites that have been revealed and see which players should have been invited. The most notable omission from the list is Wyoming junior quarterback Brett Smith. They also talk a bit about National Signing Day and how it's similar and different from the NFL Draft. As always, they end the show by taking questions.\r\n",
            "length": "21874016",
            "sourceUrl": "https://www.blogtalkradio.com/mockingthedraft/2014/02/07/2014-nfl-scouting-combine-invites-snubs.mp3",
            "categories": [
                {
                    "_": "Sports",
                    "$": {
                        "domain": "http://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "Senior Bowl recap, 2014 NFL Mock Draft and Super Bowl preview",
            "datePublished": "Thu, 30 Jan 2014 01:30:00 GMT",
            "description": "On Episode 30 of the Mocking the Draft podcast, Dan Kadar and Matthew Fairburn share some final thoughts on the 2014 Senior Bowl. Dee Ford and Aaron Donald were the stars, but who else stood out? They also touch on this week's mock draft, preview the Super Bowl and take questions from listeners.\r\n",
            "length": "24939776",
            "sourceUrl": "https://www.blogtalkradio.com/mockingthedraft/2014/01/30/senior-bowl-recap-2014-nfl-mock-draft-and-super-bowl-preview.mp3",
            "categories": [
                {
                    "_": "Sports",
                    "$": {
                        "domain": "http://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "2014 Senior Bowl: Who's standing out in practice?",
            "datePublished": "Thu, 23 Jan 2014 01:30:00 GMT",
            "description": "For Episode 29 of the Mocking the Draft podcast, host Dan Kadar is live in Mobile, Ala. for the 2014 Senior Bowl. He and Matthew Fairburn break down the week of practice and how it could affect rankings moving forward. They also take questions from listeners.\r\n",
            "length": "19176320",
            "sourceUrl": "https://www.blogtalkradio.com/mockingthedraft/2014/01/23/2014-senior-bowl-whos-standing-out-in-practice.mp3",
            "categories": [
                {
                    "_": "Sports",
                    "$": {
                        "domain": "http://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "2014 Senior Bowl preview: Which NFL Draft prospects have the most to prove?",
            "datePublished": "Thu, 16 Jan 2014 01:30:00 GMT",
            "description": "On Episode 28 of the Mocking the Draft podcast, hosts Dan Kadar and Matthew Fairburn preview the 2014 Senior Bowl and which prospects have the most to prove. They also discuss AJ McCarron's decision to skip the Senior Bowl and take a look at the quarterbacks who could take his place. As always, they finish the show with questions from listeners. \r\n",
            "length": "22860128",
            "sourceUrl": "https://www.blogtalkradio.com/mockingthedraft/2014/01/16/2014-senior-bowl-preview-which-nfl-draft-prospects-have-the-most-to-prove.mp3",
            "categories": [
                {
                    "_": "Sports",
                    "$": {
                        "domain": "http://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "College Football Bowl Game breakdown, Rookie of the Year picks and Mock Drafts",
            "datePublished": "Thu, 09 Jan 2014 01:30:00 GMT",
            "description": "After a week off for the holiday, Mocking the Draft's podcast returns to break down the college football bowl games, make final picks for rookie of the year and look at some mock draft scenarios. Hosts Dan Kadar and Matthew Fairburn also take questions from listeners.\r\n",
            "length": "22632608",
            "sourceUrl": "https://www.blogtalkradio.com/mockingthedraft/2014/01/09/college-football-bowl-game-breakdown-rookie-of-the-year-picks-and-mock-drafts.mp3",
            "categories": [
                {
                    "_": "Sports",
                    "$": {
                        "domain": "http://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "2013-2014 College Football Bowl Preview",
            "datePublished": "Fri, 27 Dec 2013 01:30:00 GMT",
            "description": "Mocking the Draft's podcast returns for Episode 26, in which hosts Dan Kadar and Matthew Fairburn take an in-depth look at the upcoming week of bowl games and examine which prospects have the most to gain. They also hit on the news items of the week and take questions from readers. \r\n",
            "length": "20436896",
            "sourceUrl": "https://www.blogtalkradio.com/mockingthedraft/2013/12/27/2013-2014-college-football-bowl-preview.mp3",
            "categories": [
                {
                    "_": "Sports",
                    "$": {
                        "domain": "http://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "2014 NFL Mock Draft: Teddy Bridgewater, Johnny Manziel and the toughest picks",
            "datePublished": "Thu, 19 Dec 2013 01:30:00 GMT",
            "description": "On Episode 25 of the Mocking the Draft podcast, hosts Dan Kadar and Matthew Fairburn discuss their latest mock draft projections and what the toughest picks to figure out are. They also break down some of the latest news in the NFL Draft world and take questions. \r\n",
            "length": "19470368",
            "sourceUrl": "https://www.blogtalkradio.com/mockingthedraft/2013/12/19/2014-nfl-mock-draft-teddy-bridgewater-johnny-manziel-and-the-toughest-picks.mp3",
            "categories": [
                {
                    "_": "Sports",
                    "$": {
                        "domain": "http://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "Which college football bowl games have the best NFL Draft match-ups?",
            "datePublished": "Thu, 12 Dec 2013 01:30:00 GMT",
            "description": "With the college football bowl schedule released, it's time to breakdown the best NFL Draft match-ups that fans should be circling on their calendars. On Episode 24 of the Mocking the Draft podcast, hosts Dan Kadar and Matthew Fairburn take a look at the best bowl games and how they could affect the NFL Draft. They also answer a few NFL Draft questions.\r\n",
            "length": "18458048",
            "sourceUrl": "https://www.blogtalkradio.com/mockingthedraft/2013/12/12/which-college-football-bowl-games-have-the-best-nfl-draft-match-ups.mp3",
            "categories": [
                {
                    "_": "Sports",
                    "$": {
                        "domain": "http://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "2014 NFL Mock Draft and 2014 Senior Bowl discussion",
            "datePublished": "Thu, 05 Dec 2013 01:30:00 GMT",
            "description": "After technical difficulties on Episode 22, the Mocking the Draft podcast returns for Episode 23. Dan Kadar and Matthew Fairburn take a look at those prospects who have accepted invitations to play in the 2014 Senior Bowl and discuss Dan's latest mock draft. \r\n",
            "length": "21231776",
            "sourceUrl": "https://www.blogtalkradio.com/mockingthedraft/2013/12/05/2014-nfl-mock-draft-and-2014-senior-bowl-discussion.mp3",
            "categories": [
                {
                    "_": "Sports",
                    "$": {
                        "domain": "http://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "2014 Senior Bowl news and Thanksgiving talk",
            "datePublished": "Thu, 28 Nov 2013 01:30:00 GMT",
            "description": "On Episode 22 of the Mocking the Draft podcast, hosts Dan Kadar and Matthew Fairburn discuss the continually growing 2014 Senior Bowl Roster and which players could still make the list. They also discuss various Thanksgiving topics and take some 2014 NFL Draft questions.\r\n",
            "length": "9504704",
            "sourceUrl": "https://www.blogtalkradio.com/mockingthedraft/2013/11/28/2014-senior-bowl-news-and-thanksgiving-talk.mp3",
            "categories": [
                {
                    "_": "Sports",
                    "$": {
                        "domain": "http://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "Reviewing 2014 NFL Mock Draft, 2014 NFL Draft Big Board",
            "datePublished": "Thu, 21 Nov 2013 01:30:00 GMT",
            "description": "On Episode 21 of the Mocking the Draft Podcast, SB Nation's NFL Draft podcast, hosts Matthew Fairburn and Dan Kadar discuss the recent 2014 NFL Mock Draft and new NFL Draft rankings, which went up on the site this week. Teddy Bridgewater and Jadeveon Clowney are still battling for the top spot on the Big Board, and the Mock Draft did not come without some tough picks. Kadar and Fairburn discuss all of those topics and more in addition to taking questions.\r\n",
            "length": "20250560",
            "sourceUrl": "https://www.blogtalkradio.com/mockingthedraft/2013/11/21/reviewing-2014-nfl-mock-draft-2014-nfl-draft-big-board.mp3",
            "categories": [
                {
                    "_": "Sports",
                    "$": {
                        "domain": "http://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "2014 NFL Draft rankings: Who's rising and who's falling?",
            "datePublished": "Thu, 14 Nov 2013 01:30:00 GMT",
            "description": "With almost a full season of college games in the books, NFL Draft rankings are starting to take form. On Episode 20 of Mocking the Draft, SB Nation's NFL Draft podcast, hosts Dan Kadar and Matthew Fairburn discuss what could be changing in their next rankings update for the 2014 NFL Draft. Who's rising and who's falling? They also take questions from listeners.",
            "length": "23105504",
            "sourceUrl": "https://www.blogtalkradio.com/mockingthedraft/2013/11/14/2014-nfl-draft-rankings-whos-rising-and-whos-falling.mp3",
            "categories": [
                {
                    "_": "Sports",
                    "$": {
                        "domain": "http://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "2014 NFL Mock Draft: Teddy Bridgewater and the top 10 picks",
            "datePublished": "Thu, 07 Nov 2013 01:30:00 GMT",
            "description": " The 2014 NFL Draft order is starting to take form, which means it's time for Mocking the Draft's first on-air mock draft of the season. Dan Kadar and Matthew Fairburn run through the first 10 picks of the draft order and take questions on Episode 19 of the podcast.\r\n",
            "length": "26643008",
            "sourceUrl": "https://www.blogtalkradio.com/mockingthedraft/2013/11/07/2014-nfl-mock-draft-teddy-bridgewater-and-the-top-10-picks.mp3",
            "categories": [
                {
                    "_": "Sports",
                    "$": {
                        "domain": "http://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "Ra'shede Hageman, Jadeveon Clowney and other NFL Draft talk",
            "datePublished": "Thu, 31 Oct 2013 00:30:00 GMT",
            "description": " It's easy to start looking ahead to the NFL for some fans. Eight weeks into the season, a handful of teams have already slipped out of contention and have their eyes on next season. In the meantime, prospects are beginning to separate themselves from the pack in college football. Two such players are Jadeveon Clowney and Ra'shede Hageman. On Episode 18 of the Mocking the Draft podcast, Dan Kadar and Matthew Fairburn discuss those two as well as sharing some thoughts on Todd McShay's recent conference call and looking ahead to Week 10 of college football. ",
            "length": "16618592",
            "sourceUrl": "https://www.blogtalkradio.com/mockingthedraft/2013/10/31/rashede-hageman-jadeveon-clowney-and-other-nfl-draft-talk.mp3",
            "categories": [
                {
                    "_": "Sports",
                    "$": {
                        "domain": "http://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "Derek Carr generating 2014 NFL Draft buzz",
            "datePublished": "Thu, 24 Oct 2013 00:30:00 GMT",
            "description": " On Episode 17 of the Mocking the Draft podcast, hosts Dan Kadar and Matthew Fairburn discuss some NFL Draft prospects that have helped and hurt their cause in the first half of the season. Fresno State quarterback Derek Carr may be the biggest riser in the process, while Clemson quarterback Tajh Boyd struggled against Florida State. Meanwhile, Kadar and Fairburn preview the week ahead in college football and take NFL Draft questions from listeners.\r\n",
            "length": "17896448",
            "sourceUrl": "https://www.blogtalkradio.com/mockingthedraft/2013/10/24/derek-carr-mike-evans-generating-nfl-draft-buzz.mp3",
            "categories": [
                {
                    "_": "Sports",
                    "$": {
                        "domain": "http://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "Marcus Mariota hype train rolling at full speed",
            "datePublished": "Thu, 17 Oct 2013 00:30:00 GMT",
            "description": "On Episode 16 of Mocking the Draft, SB Nation's NFL Draft podcast, hosts Dan Kadar and Matthew Fairburn breakdown the week that was in college football with a focus on Marcus Mariota and Missouri's surprising win over Georgia. As always, they preview the upcoming schedule for college football and answer some NFL Draft questions.",
            "length": "10823456",
            "sourceUrl": "https://www.blogtalkradio.com/mockingthedraft/2013/10/17/marcus-mariota-hype-train-rolling-at-full-speed.mp3",
            "categories": [
                {
                    "_": "Sports",
                    "$": {
                        "domain": "http://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "Discussing Jadeveon Clowney and projecting 2014 Senior Bowl",
            "datePublished": "Thu, 10 Oct 2013 00:30:00 GMT",
            "description": "On Episode 15 of Mocking the Draft, SB Nation's NFL Draft podcast, hosts Dan Kadar and Matthew Fairburn discuss the ongoing saga between Jadeveon Clowney and South Carolina. Has his draft stock been affected at all? After spending some time on Clowney, the two shift their focus to the 2014 Senior Bowl and take a guess at projecting the roster for this year's game. As always, they take some questions and preview the upcoming week of college football.",
            "length": "16186433",
            "sourceUrl": "https://www.blogtalkradio.com/mockingthedraft/2013/10/10/discussing-jadeveon-clowney-and-projecting-2014-senior-bowl.mp3",
            "categories": [
                {
                    "_": "Sports",
                    "$": {
                        "domain": "http://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "Melvin Gordon climbing 2014 NFL Draft rankings",
            "datePublished": "Thu, 03 Oct 2013 00:30:00 GMT",
            "description": "On Epsiode 14 of Mocking the Draft, SB Nation's NFL Draft podcast, hosts Dan Kadar and Matthew Fairburn unveil their updated position rankings for the 2014 NFL Draft. They also discuss the Eugene Monroe trade and how it will affect the 2014 NFL Draft. We also took some NFL Draft questions from the listeners.",
            "length": "14257133",
            "sourceUrl": "https://www.blogtalkradio.com/mockingthedraft/2013/10/03/melvin-gordon-climbing-2014-nfl-draft-rankings.mp3",
            "categories": [
                {
                    "_": "Sports",
                    "$": {
                        "domain": "http://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "What to make of Mike Glennon starting for the Buccaneers",
            "datePublished": "Thu, 26 Sep 2013 00:30:00 GMT",
            "description": "The Tampa Bay Buccaneers have benched Josh Freeman and will start rookie Mike Glennon at quarterback. On Episode 13 of Mocking the Draft, we break down the decision and what to expect from Glennon. We also give a preview of what looks like a bounce back week on the college football schedule and take some questions.",
            "length": "15507458",
            "sourceUrl": "https://www.blogtalkradio.com/mockingthedraft/2013/09/26/what-to-make-of-mike-glennon-starting-for-the-buccaneers.mp3",
            "categories": [
                {
                    "_": "Sports",
                    "$": {
                        "domain": "http://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "Johnny Manziel, Marcus Mariota improving NFL Draft stock",
            "datePublished": "Thu, 19 Sep 2013 00:30:00 GMT",
            "description": "Week 3 of college football is in the books, and there are plenty of marquee matchups to discuss. On Episode 12 of Mocking the Draft, SB Nation's NFL Draft podcast, Dan Kadar and Matthew Fairburn discuss the week that was in college football, focusing on two redshirt sophomore quarterbacks, Johnny Manziel and Marcus Mariota. They also break down the rest of the college football action and look ahead to a less exciting slate of games. As always they look to answer your NFL Draft questions as well.",
            "length": "13612013",
            "sourceUrl": "https://www.blogtalkradio.com/mockingthedraft/2013/09/19/johnny-manziel-marcus-mariota-improving-nfl-draft-stock.mp3",
            "categories": [
                {
                    "_": "Sports",
                    "$": {
                        "domain": "http://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "2014 NFL Draft stock report",
            "datePublished": "Thu, 12 Sep 2013 00:30:00 GMT",
            "description": "Episode 11 of Mocking the Draft, SB Nation's NFL Draft podcast focuses on Week 1 of the NFL season and how the rookies fared. After discussing Geno Smith, Tavon Austin and other rookies, Dan Kadar and Matthew Fairburn turn their attention to college football. Who is rising and who is falling though two weeks of the season? They also take some NFL Draft questions to finish out the show.",
            "length": "16414221",
            "sourceUrl": "https://www.blogtalkradio.com/mockingthedraft/2013/09/12/2014-nfl-draft-stock-report.mp3",
            "categories": [
                {
                    "_": "Sports",
                    "$": {
                        "domain": "http://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "2013 NFL season preview",
            "datePublished": "Thu, 05 Sep 2013 00:30:00 GMT",
            "description": "The Mocking the Draft podcast has reached Episode 10. On this milestone episode, Dan Kadar and Matthew Fairburn are joined by Ryan Van Bibber, SB Nation's NFL editor. The three discuss the upcoming NFL season, including some predictions for the Super Bowl and rookie of the year. Kadar and Fairburn will also reflect on the week that was in college football and take some NFL Draft questions.",
            "length": "15429091",
            "sourceUrl": "https://www.blogtalkradio.com/mockingthedraft/2013/09/05/2013-nfl-season-preview.mp3",
            "categories": [
                {
                    "_": "Sports",
                    "$": {
                        "domain": "http://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "Interview with former scout John Middlekauff",
            "datePublished": "Thu, 29 Aug 2013 00:30:00 GMT",
            "description": "To switch things up a bit, Dan Kadar and Matthew Fairburn are joined by former Philadelphia Eagles scout John Middlekauff on Episode 9 of Mocking the Draft, SB Nation's NFL Draft podcast. They talk to Middlekauff about the life of a scout. Kadar and Fairburn also offer a preview of the first week of college football and field some questions.",
            "length": "19419556",
            "sourceUrl": "https://www.blogtalkradio.com/mockingthedraft/2013/08/29/interview-with-former-scout-john-middlekauff.mp3",
            "categories": [
                {
                    "_": "Sports",
                    "$": {
                        "domain": "http://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "2014 NFL Draft rankings and big board updated",
            "datePublished": "Thu, 22 Aug 2013 00:30:00 GMT",
            "description": "After a summer of work, Dan Kadar and Matthew Fairburn of the Mocking the Draft podcast are set to unveil their preseason 2014 NFL Draft rankings. Over 300 players are ranked in total, and Episode 8 of the podcast breaks it all down. Where does Johnny Manziel fall? Who is the top player not named Jadeveon Clowney? They answer all that and more, and as always, Kadar and Fairburn take your NFL Draft questions.",
            "length": "19963321",
            "sourceUrl": "https://www.blogtalkradio.com/mockingthedraft/2013/08/22/2014-nfl-draft-rankings-and-big-board-updated.mp3",
            "categories": [
                {
                    "_": "Sports",
                    "$": {
                        "domain": "http://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "2013 Fantasy Football: Rookies and Dynasty ",
            "datePublished": "Thu, 15 Aug 2013 00:30:00 GMT",
            "description": "For weeks, listeners have been clamoring for the Mocking the Draft podcast to talk fantasy football. Well, the time has come. On Episode 7 of the show, Dan Kadar and Matthew Fairburn are joined by David Fucillo of SB Nation Fantasy and Niners Nation. They discuss rookies in fantasy football and dynasty leagues. They also touch on some second-year players that could breakout in year two. After the fantasy talk, Kadar and Fairburn broke down the best NFL Draft prospects from the ACC and Big 12.",
            "length": "15554061",
            "sourceUrl": "https://www.blogtalkradio.com/mockingthedraft/2013/08/15/2013-fantasy-football-rookies-and-dynasty.mp3",
            "categories": [
                {
                    "_": "Sports",
                    "$": {
                        "domain": "http://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "College Football Fall Camp roundup",
            "datePublished": "Thu, 08 Aug 2013 00:30:00 GMT",
            "description": "On Episode 6 of SB Nation's NFL Draft podcast, Mocking the Draft, Dan Kadar and Matthew Fairburn take a look inside college football fall camp across the country with an eye on potential breakthrough prospects. As always, they takes your NFL Draft questions as well.",
            "length": "15237456",
            "sourceUrl": "https://www.blogtalkradio.com/mockingthedraft/2013/08/08/college-football-fall-camp-roundup.mp3",
            "categories": [
                {
                    "_": "Sports",
                    "$": {
                        "domain": "http://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "NFL Training camp has arrived",
            "datePublished": "Thu, 01 Aug 2013 00:30:00 GMT",
            "description": "Mocking the Draft, SB Nation's NFL Draft Podcast, returns for Episode 5. Hosts Dan Kadar and Matthew Fairburn discuss the opening of NFL Training camps leaguewide. Plenty of rookies and second-year players will be battling for positions. Kadar and Fairburn talk about the players they'll be watching. As always, they also take your NFL Draft questions.",
            "length": "13736774",
            "sourceUrl": "https://www.blogtalkradio.com/mockingthedraft/2013/08/01/nfl-training-camp-has-arrived.mp3",
            "categories": [
                {
                    "_": "Sports",
                    "$": {
                        "domain": "http://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "Discussing Jadeveon Clowney and the 2014 pass rushers",
            "datePublished": "Thu, 25 Jul 2013 14:00:00 GMT",
            "description": "The NFL has become a passing league, putting an increased importance on getting after the quarterback. The 2014 NFL Draft features a few talented pass rushers, the most notable being South Carolina's Jadeveon Clowney. On the Episode Four of the Mocking the Draft podcast, Dan Kadar and Matthew Fairburn discuss the pass rushers, touch on the latest NFL Draft news, and take your questions.",
            "length": "12721969",
            "sourceUrl": "https://www.blogtalkradio.com/mockingthedraft/2013/07/25/discussing-jadeveon-clowney-and-the-2014-pass-rushers.mp3",
            "categories": [
                {
                    "_": "Sports",
                    "$": {
                        "domain": "http://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "Talking Johnny Manziel and taking your NFL Draft questions",
            "datePublished": "Fri, 19 Jul 2013 00:30:00 GMT",
            "description": "Johnny Manziel made news this week for leaving the Manning Passing Academy early due to \"dehyrdration.\" Mocking the Draft hosts Dan Kadar and Matthew Fairburn discuss Johnny Football's latest indiscretion and what it means for his NFL Draft stock. They also take a look at which quarterbacks helped themselves at the Manning Passing Academy. To finish the show, they switch gears and examine the crop of wide receivers eligible for the 2014 NFL Draft, while taking more of your questions. ",
            "length": "18444666",
            "sourceUrl": "https://www.blogtalkradio.com/mockingthedraft/2013/07/19/talking-johnny-manziel-and-taking-your-nfl-draft-questions.mp3",
            "categories": [
                {
                    "_": "Sports",
                    "$": {
                        "domain": "http://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "MTD: Supplemental draft, combine eligibility and OL talk",
            "datePublished": "Thu, 11 Jul 2013 00:30:00 GMT",
            "description": "On the second episode of Mocking the Draft, Dan Kadar and Matthew Fairburn discuss the upcoming Supplemental draft with a focus on two wide receivers. With the NFL Scouting Combine possibly undergoing a rule change, Kadar and Fairburn weigh in on the issue. They also break down the top offensive linemen in the 2014 NFL Draft and take some more draft questions.",
            "length": "17591403",
            "sourceUrl": "https://www.blogtalkradio.com/mockingthedraft/2013/07/11/mocking-the-draft-discussing-2014s-offensive-line-crop.mp3",
            "categories": [
                {
                    "_": "Sports",
                    "$": {
                        "domain": "http://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "Mocking the Draft: Welcome to SB Nation's NFL Draft podcast",
            "datePublished": "Thu, 04 Jul 2013 00:30:00 GMT",
            "description": "On the first episode of SB Nation's NFL Draft podcast, Mocking the Draft hosts Dan Kadar and Matthew Fairburn take a look back at the 2011 quarterback class and examine which teams could be in the market for a quarterback at the end of the season. They also provide a quick look ahead to the 2014 NFL Draft and field some questions.",
            "length": "15661685",
            "sourceUrl": "https://www.blogtalkradio.com/mockingthedraft/2013/07/04/mocking-the-draft-welcome-to-sb-nations-nfl-draft-podcast.mp3",
            "categories": [
                {
                    "_": "Sports",
                    "$": {
                        "domain": "http://www.blogtalkradio.com/"
                    }
                }
            ]
        }
    ]
}