{
    "artwork": "http://is3.mzstatic.com/image/thumb/Music6/v4/f0/1d/51/f01d514e-a703-1c8a-1526-71e21a42b1be/source/100x100bb.jpg",
    "description": "Moving at the Speed of Creativity podcasts focus on education, twenty-first century literacy, blended learning, technology integration, and educational leadership.",
    "feedURL": "http://feeds.feedburner.com/speedofcreativity/podcasts",
    "podcastURL": "http://www.speedofcreativity.org/podcasts/feed.xml",
    "publisher": "podcast@speedofcreativity.org (Wesley A. Fryer)",
    "title": "Moving at the Speed of Creativity Podcasts",
    "episodes": [
        {
            "title": "Podcast474: Brainstorming \"Fact or Fiction? Apollo Moon Landings\" Workshop and Lesson",
            "datePublished": "Thu, 09 Jul 2020 01:16:40 +0000",
            "description": "Our conversations about media literacy, conspiracies, culture wars, and the Apollo Moon landings continue! The current generation of youth has been exposed to more conspiracy theories about the Apollo Moon landings and many other topics than any previous generation. What are we going to do about this as educators and parents? This is a serious media literacy challenge, and the project connected to this audio recording provides some answers to this question. This podcast is a recording of a livestreamed conversation between Brian Turnbaugh (@wegotwits) and Wesley Fryer (@wfryer) on July 6, 2020, discussing a proposed workshop at the virtual version of the Summer Institute on Digital Literacy (digiuri.com) coming to a screen near you July 19-24, 2020. This is the part two of these shared conversations. Please refer to the shownotes of our podcast on speedofcreativity.org for links to part 1 of this conversation, our Google Doc with our developing resources, and more. The proposed title of this workshop and lesson is now something like, \"Fact or Fiction? Apollo Moon Landings,\" although this final title is still up for grabs. Wes has been invited to share a keynote based on these ideas at the upcoming virtual \"Mountain Moot\" July 16, 2020. (Register FREE to attend on mountainmoot.com) This project continues to be a \"work in progress\" and is being refined / expanded. We welcome your feedback. All project resources are available on medialiteracy.wesfryer.com/concw. Please use the hashtag #ConCW to share related resources! Thanks to our livestream viewers who shared great ideas and asked good questions in our StreamYard.com powered chat room during this broadcast.",
            "length": "20448164",
            "sourceUrl": "http://feedproxy.google.com/~r/speedofcreativity/podcasts/~5/VVUte-R4JLY/2020-07-08-speedofcreativity.mp3",
            "epNo": "474"
        },
        {
            "title": "Podcast473: Brainstorming About \"Conspiracies and Culture Wars\" with Brian Turnbaugh and Wesley Fryer",
            "datePublished": "Sun, 21 Jun 2020 17:34:58 +0000",
            "description": "This podcast is a recording of a conversation between Brian Turnbaugh (@wegotwits) and Wesley Fryer (@wfryer) discussing a proposed workshop at the virtual version of the Summer Institute on Digital Literacy, coming to a screen near you July 19-24, 2020. The proposed title is, \"Conspiracies and Culture Wars,\" and the Google Doc of resources we have been building together is linked in the shownotes for this podcast and from medialiteracy.wesfryer.com. This conversation took place on June 5, 2020, and was livestreamed to both YouTube Live and Facebook Live. Wes has also submitted this session as a proposal for the upcoming virtual \"Mountain Moot\" July 15-18, 2020. Check out the podcast shownotes for links to referenced resources. This project is very much a \"work in progress\" and will be refined and expanded in the days and weeks to come! We welcome your feedback.",
            "length": "18383215",
            "sourceUrl": "http://feedproxy.google.com/~r/speedofcreativity/podcasts/~5/I2-RUseDqQw/2020-07-20-speedofcreativity.mp3",
            "epNo": "473"
        },
        {
            "title": "Podcast472: Remote Learning in Oklahoma #OklaEd",
            "datePublished": "Sun, 26 Apr 2020 18:49:43 +0000",
            "description": "This podcast is a recording of a webinar panel discussion by Oklahoma educators Telannia Norfar, Delilah Rodriguez, Rhonda Schroeder and Wesley Fryer on Saturday, April 25, 2020. Our topic of conversation was \"Remote Learning in Oklahoma,\" as we are now about a month into \"learning at home\" because of the neo-coronavirus / COVID-19 global pandemic. The questions we discussed included, What is your current role and situation with 'remote learning' in Oklahoma? What is your technology situation like in terms of student devices, teacher devices, and utilized platforms? What are discovering that should be changed about school as a result of this situation? What are some success stories about remote learning at your school / for you? How do you think we can help teachers and schools prepare for ongoing remote learning in the event we don't return face-to-face to school in August, or we do but have to go back to remote learning in the fall? Check out the shownotes for links to Twitter IDs for each of our panelists, as well as other referenced resources and links from the conversation.",
            "length": "17319734",
            "sourceUrl": "http://feedproxy.google.com/~r/speedofcreativity/podcasts/~5/6DLRxfUfsbI/2020-04-25-speedofcreativity.mp3",
            "epNo": "472"
        },
        {
            "title": "Podcast471: Let’s Talk About Social Identity and FOMO",
            "datePublished": "Tue, 03 Mar 2020 02:39:33 +0000",
            "description": "This podcast is a recording of a digital citizenship presentation for high school students shared by Dr. Wesley Fryer at Casady School in Oklahoma City on February 27, 2020. The goal of this talk was to encourage students to think more deeply and critically about their own identities, how those identities are shaped, and specifically how much power and influence we give other people and social media specifically when it comes to our perceptions of who we are and who we want to be. The Common Sense Media video, \"Teen Voices: Who Are You on Social Media?\" was shared during this presentation, and the audio from that video is included in this podcast. Please check the podcast shownotes for the link to the original video, as well as other wonderful resources from Common Sense on Digital Citizenship including a robust (and free) curriculum on digital citizenship for teachers and students differentiated by grade level. Also check out more resources we've shared on our school's digital citizenship website, DigCit.us.",
            "length": "5661298",
            "sourceUrl": "http://feedproxy.google.com/~r/speedofcreativity/podcasts/~5/aYIQdiexfhQ/2020-03-02-speedofcreativity.mp3",
            "epNo": "471"
        },
        {
            "title": "Podcast470: Sharing and Learning About the 2020 U.S. Census - Statistics in Schools",
            "datePublished": "Wed, 19 Feb 2020 01:57:52 +0000",
            "description": "Welcome to Episode 470 of the Moving at the Speed of Creativity podcast from February 18, 2020, a show by Dr. Wesley Fryer (@wfryer) focusing on digital creativity, media literacy, digital literacy, digital citizenship, instructional technology integration and engaged learning both inside and outside the classroom. This episode features a special interview with the U.S. Census \"Statistics in Schools\" Manager Victoria Glazer and Teacher Ambassador Emily McMillen, discussing the 2020 Census in the United States and the variety of FREE resources provided for PK-12 teachers to use with students. Disbursement of millions of dollars for our communities from the U.S. Federal Government depends on the Census! All of us as teachers and members of our communities can help both educate students and families about the importance of participating in the census, but also provide real-world, multi-disciplinary learning opportunities using existing census data via the resources shared on the \"Statistics in Schools\" website. Visit census.gov/schools for more information, and also refer to the podcast shownotes for more direct links.",
            "length": "7029843",
            "sourceUrl": "http://feedproxy.google.com/~r/speedofcreativity/podcasts/~5/L1foPiYYYPU/2020-02-18-speedofcreativity.mp3",
            "epNo": "470"
        },
        {
            "title": "Podcast469: Reflections on Immersion Day January 2020",
            "datePublished": "Mon, 20 Jan 2020 21:48:43 +0000",
            "description": "Welcome to Episode 469 of the Moving at the Speed of Creativity podcast from January 18, 2020, a show by Dr. Wesley Fryer (@wfryer) focusing on digital creativity, media literacy, digital literacy, digital citizenship, instructional technology integration and engaged learning both inside and outside the classroom. This episode features a conversation with 3rd grade teacher Shelly Fryer (@sfryer) about the second \"Immersion Day\" at Casady School in Oklahoma City. Immersion Days are half-days for students which focus on a special theme or topic. On January 17, 2020, the theme for the Casady Lower School students (in grades 1 - 4) focused on Inventions, coinciding with Kid Invention Day (KID). A wealth of fantastic resources about the design process and STEM / engineering for young students are available on nationalinventioncurriculum.org as well as other websites. Check out the podcast shownotes for links. Casady 3rd and 4th graders were able to videoconference LIVE to start the day with Payton Robertson in Florida. Peyton is now a senior in high school, and has been an inventor since elementary school with over six patents to his name. He met President Obama in the Oval Office to share one of his inventions after winning a national contest, was a guest on the Ellen DeGeneres Show, and will be continuing his career and learning journey as an inventor next year as he starts college at Stanford University. In the afternoon, 3rd graders talked with Dr. James W. Long, a local guest speaker physician and engineer who co-created a magnetic heart pump, featured in the new Amplify Science curriculum the students are using this year. One of the parents of Shelly's students is a heart surgeon, and invited him to join in the third grade Kids Invention Day learning! In the podcast, Wes also shares some reflections on the \"Animate Your Curiosity\" lessons which he co-led for middle school students yesterday, using Scratch to create basic animations. Students watched and discussed several animation focused videos (including \"Animator vs. Animation\" from 2009 which has over 42 million views on YouTube) to find inspiration for their own animation and coding projects. If you haven't checked out \"The Science Behind Pixar\" (sciencebehindpixar.org) in person or online yet definitely do! Also check out other resources on the \"Animation Inspiration\" website Wes created for this week's Middle Division Immersion Day. Follow Shelly Fryer on Twitter @sfryer and Wesley Fryer on @wfryer. Wes' Digital Literacy and Media Literacy Curriculum for Middle School Computer Classes is available free on mdtech.casady.org.",
            "length": "9417885",
            "sourceUrl": "http://feedproxy.google.com/~r/speedofcreativity/podcasts/~5/P4opYHm0N8I/2020-01-18-speedofcreativity.mp3",
            "epNo": "469"
        },
        {
            "title": "Podcast468: Reflections on Blended Learning Techniques with Google Sites, Slides and Social Media",
            "datePublished": "Thu, 28 Nov 2019 01:25:25 +0000",
            "description": "Welcome to Episode 468 of the Moving at the Speed of Creativity podcast, a show by Dr. Wesley Fryer (@wfryer) focusing on digital creativity, media literacy, digital literacy, digital citizenship, instructional technology integration and engaged learning both inside and outside the classroom. This episode includes a reflection by Wes about some of the techniques he is using in fall 2019 teaching Digital and Media Literacy for 5th and 6th graders at Casady School in Oklahoma City, as well as the adult Sunday School class, \"Curiosity and Questions: Jesus and Science\" at First Presbyterian Church in Edmond, Oklahoma. These techniques include using Google Sites to share lesson slides, videos, resources and links publicly (mdtech.casady.org and followjesus.wesfryer.com) each week. Refer to the podcast shownotes for referenced links. Feedback on this podcast episode is welcome!",
            "length": "11543951",
            "sourceUrl": "http://feedproxy.google.com/~r/speedofcreativity/podcasts/~5/PlqR38lIIQI/2019-11-27-speedofcreativity.mp3",
            "epNo": "468"
        },
        {
            "title": "Podcast467: Reflections on a Gap Year Before College",
            "datePublished": "Sun, 25 Aug 2019 20:10:04 +0000",
            "description": "Welcome to Episode 467 of the Moving at the Speed of Creativity podcast, a show by Dr. Wesley Fryer (@wfryer) focusing on digital creativity, media literacy, digital literacy, digital citizenship, instructional technology integration and engaged learning both inside and outside the classroom. This episode features interviews with both Shelly Fryer and Sarah Fryer, about Sarah's \"gap year\" in 2018-19 following high school graduation. Sarah graduated in 2018 from Classen School of Advanced Studies in Oklahoma City Public Schools, and majored in drama at ClassenSAS. Rather than head directly to college, Sarah took a gap year to work, take dance classes, get more involved in the music ministry of our church, and get a better idea of what she wants to study and do after high school. In the first part of this podcast, Wesley and Shelly reflect on the gap year experience for Sarah, how it came about, what happened, and what lessons were learned. In the second part, recorded earlier, Sarah reflects on her gap year. In both segments, Shelly and Sarah offer advice to other students as well as parents who might be considering a gap year, and encouragement to consider whether or not a gap year is the right choice and \"the best fit\" for you or your child. Check out the podcast shownotes to referenced resources, including some other blog posts relating to parenting, high school, and helping kids make decisions about college and life. Contact links for Shelly and Wesley Fryer are also included in the shownotes. Feedback on this podcast episode is welcome!",
            "length": "10314374",
            "sourceUrl": "http://feedproxy.google.com/~r/speedofcreativity/podcasts/~5/CIUe9yUmOqk/2019-08-25-speedofcreativity.mp3",
            "epNo": "467"
        },
        {
            "title": "Podcast466: Reflections on Summer 2019 TechyKids Robotics Camp in Oklahoma City",
            "datePublished": "Mon, 12 Aug 2019 04:54:29 +0000",
            "description": "Welcome to Episode 466 of the Moving at the Speed of Creativity podcast, a show by Dr. Wesley Fryer (@wfryer) focusing on digital creativity, media literacy, digital literacy, digital citizenship, instructional technology integration and engaged learning both inside and outside the classroom. This episode features an interview with Michaela Freeland (@_mfreeland) and Shelly Fryer (@sfryer) about the two summer robotics camps they co-led using Thymio robots and outstanding curriculum provided by TechyKids. TechyKids (www.techykids.com) was founded by Sharon Marzouk (@sharonmarzouk) and focuses on inspiring students through a \"blend of robotics, creativity, technology, and invention.\" In this 35 minute interview, Michaela and Shelly share their experiences and learning from leading two robotics camps with 32 and 28 student participants, respectively, and discuss many of the camp highlights as well as lessons learned by students, older student mentors, teachers and parents. Students engaged in daily reflections during these summer camps, and both recorded and shared with their parents their learning using the platform Seesaw (@Seesaw). Casady School in Oklahoma City hosted both of these camps, which were part of the summer \"Casady by the Lake\" enrichment program open to all students in and around Oklahoma City. Check out the podcast shownotes for links to TechyKids as well as other resources mentioned by Michaela and Shelly in this interview. If you are inspired to offer a robotics and invention camp in your local area after listening to this podcast, or have questions, please reach out to Michaela or Shelly and let them know!",
            "length": "8756220",
            "sourceUrl": "http://feedproxy.google.com/~r/speedofcreativity/podcasts/~5/aN-KPb0tFzg/2019-08-11-speedofcreativity.mp3",
            "epNo": "466"
        },
        {
            "title": "Podcast465: Reflections on The 2019 Summer Institute on Digital Literacy",
            "datePublished": "Sun, 21 Jul 2019 04:02:35 +0000",
            "description": "Welcome to Episode 465 of the Moving at the Speed of Creativity podcast, a show by Dr. Wesley Fryer (@wfryer) focusing on digital creativity, media literacy, digital literacy, digital citizenship, instructional technology integration and engaged learning both inside and outside the classroom. This episode features a reflection by Wes following the 2019 Summer Institute on Digital Literacy. Wes reflects on ten different \"ingredients\" which made this a powerful and transformative professional development experience, as well as five different lessons and ideas he's taking into his 5th and 6th grade Digital Literacy classes this upcoming school year. Check the podcast shownotes for a full list of referenced websites and resources mentioned in this episode. This podcast also includes an interview from the conference with Brian Turnbaugh (@wegotwits) discussing the weaponization of social media and recommended resources for learning more about the ways Russia continues to work to subvert the electoral process in the United States. Remember to also subscribe to \"The EdTech Situation Room\" (@edtechSR), the weekly webshow and podcast Wes co-hosts with Jason Neiffer each week on Wednesday evenings. Also remember to subscribe to Wes' (almost) weekly newsletter in which he shares a helpful technology tip, tool, text, and tutorial. Sign up on www.speedofcreativity.org/email-updates.",
            "length": "11716597",
            "sourceUrl": "http://feedproxy.google.com/~r/speedofcreativity/podcasts/~5/TCOh9SVge6U/2019-07-20-speedofcreativity.mp3",
            "epNo": "465"
        },
        {
            "title": "Podcast464: Reflections on Media Literacy & ATLIS 2019",
            "datePublished": "Tue, 16 Apr 2019 21:22:01 +0000",
            "description": "Welcome to Episode 464 of the Moving at the Speed of Creativity podcast, a show by Dr. Wesley Fryer (@wfryer) focusing on digital creativity, media literacy, digital literacy, digital citizenship, instructional technology integration and engaged learning both inside and outside the classroom. This episode features a reflection by Wes from the ATLIS 2019 Conference in Dallas, Texas, primarily on Media Literacy and his 3 hour workshop, \"Filtering the Exoflood: Strategies for Media and Information Literacy.\" All resources from the workshop are available on wfryer.me/exoflood. Refer to the podcast shownotes for links to the other websites and links referenced in this podcast. Remember to also subscribe to \"The EdTech Situation Room\" (@edtechSR), the weekly webshow and podcast Wes co-hosts with Jason Neiffer each week on Wednesday evenings. Also remember to subscribe to Wes' (almost) weekly newsletter in which he shares a helpful technology tip, tool, text, and tutorial. Sign up on www.speedofcreativity.org/email-updates.",
            "length": "7206674",
            "sourceUrl": "http://feedproxy.google.com/~r/speedofcreativity/podcasts/~5/0iz_9u92i3w/2019-04-16-speedofcreativity.mp3",
            "epNo": "464"
        },
        {
            "title": "Podcast463: Reflections on The Florida Project Movie",
            "datePublished": "Fri, 04 Jan 2019 17:39:59 +0000",
            "description": "Welcome to Episode 463 of the Moving at the Speed of Creativity podcast, a show by Dr. Wesley Fryer (@wfryer) focusing on digital creativity, media literacy, digital literacy, digital citizenship, instructional technology integration and engaged learning both inside and outside the classroom. This episode features an interview with Shelly Fryer (@sfryer) about the 2017 movie, \"The Florida Project\" (@floridaproject). The IMDB description of the movie is, \"Set over one summer, the film follows precocious six-year-old Moonee as she courts mischief and adventure with her ragtag playmates and bonds with her rebellious but caring mother, all while living in the shadows of Walt Disney World.\" The Florida Project raises a host of important issues facing every community, including poverty, homelessness, social services, education and schools, non-profit and church outreach programs, and more. As a lifelong educator with extensive experiences working with families in poverty through church ministry, as well as educational and social services for homeless children and families in Oklahoma City, Shelly Fryer has unique and important perspectives on the issues and needs highlighted in \"The Florida Project.\" Check out the podcast shownotes for links to referenced books, resources, organizations and websites mentioned in the show. Please reach out to Shelly or Wes with feedback and additional resources or ideas this movie or this podcast interview encourages you to share.",
            "length": "10296114",
            "sourceUrl": "http://feedproxy.google.com/~r/speedofcreativity/podcasts/~5/l6YlhkrslyA/2019-01-04-speedofcreativity.mp3",
            "epNo": "463"
        },
        {
            "title": "Podcast462: Inspired by Tricia Fuglestad and Make Media Camp Lessons Learned",
            "datePublished": "Sun, 15 Jul 2018 04:35:35 +0000",
            "description": "Welcome to Episode 462 of Moving at the Speed of Creativity podcasts, a now-wildly irregular podcast by Dr. Wesley Fryer (@wfryer) focusing on digital creativity, media literacy, digital literacy and instructional technology. This episode includes two segments. The first is an interview with Megan Thompson (@seeingnewshapes), our elementary art teacher at Casady School in Oklahoma City. This past spring, Megan had an opportunity to travel to the Chicago area and spend part of a day with Tricia Fuglestad (@fuglefun). Tricia is an amazing elementary art teacher and utilizes a wide variety of technologies in her classroom to encourage creativity and empower student expression. Shelly Fryer (@sfryer) and Wes interviewed Megan about her experiences, observations and takeaways from her time with Tricia in early June, 2018. The second segment of this podcast is a conversation between Shelly and Wes about their two recent Make Media Camp workshops (@MakeMediaCamp) with teachers in Kansas City and Oklahoma City. They highlight a variety of lessons learned and changes they've made to this one day media experience which introduces teachers to six different media projects and classroom activities: narrated images, photo collages, class radio shows / podcasts, paper-slide videos, Goose Chase mobile media scavenger hunts, and multimedia eBooks. Learn more about Make Media Camps on www.MakeMediaCamp.com, and access all workshop curricula from these workshops on the Archives link under Resources. Check out the shownotes for this podcast for links to additionally referenced resources.",
            "length": "17910887",
            "sourceUrl": "http://feedproxy.google.com/~r/speedofcreativity/podcasts/~5/PTWnsUW2STs/2018-07-14-speedofcreativity.mp3",
            "epNo": "462"
        },
        {
            "title": "Podcast461: Instructional Coaching, Middle School French Class and Explain Everything for iPad",
            "datePublished": "Mon, 14 May 2018 00:15:15 +0000",
            "description": "Welcome to episode 461 of Moving at the Speed of Creativity by Wesley Fryer, from March 18, 2018. This podcast features an introductory overview about instructional coaching and technology integration coaching specifically, drawing on the author's experiences in this role with teachers since the late 1990s. In addition to defining instructional coaching, keys to successful instructional coaching experiences for mentor teachers as well as coaches are highlighted, as well as \"lessons learned.\"  The second part of the podcast features an interview with middle school French teacher Blake Pardue, who has been connecting his students to \"pen pal\" classrooms of French speaking students in Europe and in Africa for several years. The past two years, Blake's students have used the iPad app \"Explain Everything\" to create media-rich introductions of themselves and practice their French skills with their pen pals. This interview was a reflection with Blake Pardue and Wes Fryer about this year's iteration of the Explain Everything project, which utilized the new \"cloud based\" and collaborative version. They discuss project procedures and lessons learned. Refer to the podcast shownotes for links to referenced apps and resources from the show.",
            "length": "11525093",
            "sourceUrl": "http://feedproxy.google.com/~r/speedofcreativity/podcasts/~5/K3fLq52xiw4/2018-05-13-speedofcreativity.mp3",
            "epNo": "461"
        },
        {
            "title": "Podcast460: UCO and OCCC Concurrent Classes, GitHub in CompSci, and Elementary Coding Lessons",
            "datePublished": "Tue, 13 Mar 2018 03:47:57 +0000",
            "description": "Welcome to episode 460 of Moving at the Speed of Creativity by Wesley Fryer, from March 13, 2018. This podcast features a series of three recent interviews, and opens with a recommendation to try the newly updated Anchor.fm website and Anchor mobile app for podcast creation and publishing. The first interview is with high school senior Sarah Fryer, who shares her experiences and lessons learned taking concurrent classes from the University of Central Oklahoma (UCO) and the Oklahoma City Community College (OCCC) as a student in Oklahoma City Public Schools (OKCPS). Sarah took two classes from UCO in fall 2017, including one online course and one face-to-face course at the UCO campus in downtown Oklahoma City. This spring Sarah is taking two concurrent classes from OCCC, again one online and another face-to-face. The second interview is with Eric Ebert (@biggestmeow), the high school computer science teacher at Casady School. Eric shares a little about the growth of the computer science program at Casady, and how he has been using GitHub and GitHub classroom to help his students manage their coding projects. Eric also shared how he's used audio podcasts created with Garageband and SoundCloud to encourage student reflection during and at the conclusion of coding projects. The third interview is with Shelly Fryer (@sfryer), a 3rd grade teacher at Casady School who has been integrating coding into her language arts lessons and Maker Studio time using the iPad app PBSkids Scratch Junior. Shelly taught an after-school class for 3rd and 4th graders in fall 2017 on coding with PBSkids Scratch Junior, teaching students how to create animations, tell stories, and create simple games. In spring 2018, Shelly has taught the same after-school class on PBSkids Scratch Junior for first and second graders. She has also co-led an after-school coding class using Scratch software for third and fourth graders. She shares stories and lessons learned from these coding classes, and also highlights her recent experiences at a Code.org workshop in San Antonio as one of three coding Ambassadors from Oklahoma. Please refer to the podcast shownotes for links to referenced resources and student projects from this podcast. Share your feedback as a comment on this podcast episode on speedofcreativity.org, or by reaching out on Twitter to Wes Fryer @wfryer.",
            "length": "19950577",
            "sourceUrl": "http://feedproxy.google.com/~r/speedofcreativity/podcasts/~5/V7CeD8g69Ok/2018-03-12-speedofcreativity.mp3",
            "epNo": "460"
        },
        {
            "title": "Podcast459: Highlights from OETC 2018",
            "datePublished": "Sun, 18 Feb 2018 21:59:16 +0000",
            "description": "This podcast features three different recordings from the 2018 Ohio Educational Technology Conference, which was held in Columbus, Ohio, February 12-14, 2018. The first is an interview with high school students who have learned how to create interactive games using Scratch software. They also have created DIY game controllers using the MakeyMakey and supplies like tin foil, cardboard, alligator clips, play dough, and bananas. The second interview is with high school senior Arthur Bodenschatz, who is part of the broadcast journalism team in North Canton City Schools, Ohio. Arthur and his classmates use an amazing “mobile storyteller” converted RV to conduct professional quality interviews at events like the Ohio educational technology conference. The third interview is Arthur's interview of me at OETC, in which he asked me about my reasons for becoming a teacher and technology director, the pace of technological change in our society, and a few other topics. Two of these three recordings are also available as videos on YouTube and Vimeo, which are linked in the podcast shownotes. In addition to these three recordings, a few reflections on some additional highlights of OETC 2018 are included. These focus on Eric Curts' (@ericcurts) 3 hour workshop \"Write Right with Google Tools: Improving Writing in all Subjects,\" Todd Beard's (@teacherbeard) session on Minecraft for Education, and Apple Education's workshop on updates to iOS 11. Please refer to the podcast shownotes for links to referenced resources, as well as a raft of Wes' tweets from OETC 2018 sharing additional tips and links from sessions. (Since Storify is going offline and doesn't support the creation of new Twitter archives, this blog post will hopefully serve that function to archive these learning takeaways.",
            "length": "8267937",
            "sourceUrl": "http://feedproxy.google.com/~r/speedofcreativity/podcasts/~5/ApoEz9E62QM/2018-02-18-speedofcreativity.mp3",
            "epNo": "459"
        },
        {
            "title": "Podcast458: Reflections and Lessons Learned from STEAM Studio Fall 2017",
            "datePublished": "Sun, 03 Dec 2017 14:35:36 +0000",
            "description": "Podcast458: Reflections and Lessons Learned from STEAM Studio Fall 2017",
            "length": "8481340",
            "sourceUrl": "http://feedproxy.google.com/~r/speedofcreativity/podcasts/~5/AfYj3IgQEb0/2017-12-03-speedofcreativity.mp3",
            "epNo": "458"
        },
        {
            "title": "Podcast457: Inspiring Creativity and Curiosity with Media",
            "datePublished": "Thu, 23 Nov 2017 18:16:24 +0000",
            "description": "This podcast features an almost-complete recording of Dr. Wesley Fryer's keynote, \"Inspiring Creativity and Curiosity with Media,\" on November 18, 2017, in Cairo, Egypt at the second annual EduForum Conference. The keynote description was: \"As automation and the disruptive march of technology continues into virtually every aspect of our lives, it is vital we cultivate both creativity and curiosity in our students. Many jobs and vocations of the future will require teamwork, collaboration, project management, and independent work skills historically lacking in traditional academic classes focusing on isolated, individual performance. In this engaging and challenging session, Dr. Wesley Fryer will present the case for why learners today need to be CREATORS as well as consumers of multimedia, and collaborate regularly in school to acquire the workforce skills of today and tomorrow. By highlighting practical examples as well as available apps and web tools, Dr. Fryer will provide attendees with specific strategies and lesson activities they can apply in their classrooms to more effectively utilize multimedia and encourage students to create multimedia which supports learning goals.\" Please share feedback on the ideas in this podcast with a comment on this podcast on speedofcreativity.org, or by reaching out to Wes on Twitter @wfryer. Also be sure to subscribe to The EdTech Situation Room on http://edtechSR.com and follow on Twitter @edtechSR for updates.",
            "length": "11665018",
            "sourceUrl": "http://feedproxy.google.com/~r/speedofcreativity/podcasts/~5/3DrHL7Mt72E/2017-11-23-speedofcreativity.mp3",
            "epNo": "457"
        },
        {
            "title": "Podcast456: Teaching and Learning in an AI First World",
            "datePublished": "Sun, 05 Nov 2017 05:24:54 +0000",
            "description": "This podcast features a recording of Dr. Wesley Fryer's breakout session at G Camp OKC on November 4, 2017, titled \"Teaching and Learning in an AI First World.\" Referenced slides are available on http://wfryer.me/aifirst and include all referenced videos, including those mentioned but not shown during the presentation. Please refer to the podcast shownotes for a complete list of referenced articles and videos from the presentation. If you have feedback, please contact Wes via Twitter @wfryer or leave a comment below.",
            "length": "12352543",
            "sourceUrl": "http://feedproxy.google.com/~r/speedofcreativity/podcasts/~5/xOejkj697J0/2017-11-04-speedofcreativity.mp3",
            "epNo": "456"
        },
        {
            "title": "Podcast455: EdTech Struggles and Aspirations",
            "datePublished": "Fri, 22 Sep 2017 05:22:49 +0000",
            "description": "This podcast is a reflection by Dr. Wesley Fryer on some of the educational technology related challenges as well as aspirations he currently has as a school director of technology, technology integration coach, and after-school \"STEAM Studio\" co-teacher. These challenges include cultivating a school learning culture supportive of creativity, innovation, whimsy, and cross-curricular connections. They also include helping students transition into and succeed within a comparatively open-ended and less structured after-school learning environment, where they are invited to create, play, and express themselves while developing both digital literacy as well as artistic skills. Last of all, the challenges and aspirations include more \"geeky\" topics like planning for school infrastructure fiber optic line upgrades, managing bandwidth on a network with increasing numbers of IP-based surveillance cameras, learning about traffic and packet analysis tools, and firewall access reporting. Refer to the podcast shownotes for links to many of the referenced resources from this podcast including Dr. Mitch Resnik's new book, \"Lifelong Kindergarten: Cultivating Creativity through Projects, Passion, Peers, and Play\" and the upcoming (October 2017) free online class \"Learning Creative Learning\" by the MIT Lifelong Kindergarten Group.",
            "length": "11745710",
            "sourceUrl": "http://feedproxy.google.com/~r/speedofcreativity/podcasts/~5/Wp94LFgsw7k/2017-09-21-speedofcreativity.mp3",
            "epNo": "455"
        },
        {
            "title": "Podcast454: Inspiring Student Creativity with Media #KVATE2017",
            "datePublished": "Wed, 26 Jul 2017 05:21:15 +0000",
            "description": "This podcast features a recording of Dr. Wesley Fryer's opening keynote address at the 2017 KVATE (Kaw Valley Academy of Technology and Education) Conference on July 24, 2017, in St. Marys, Kansas. The title of the keynote was, \"Inspiring Student Creativity with Media.\" In addition to highlighting examples of \"WOW work\" by students (borrowing a wonderful term from Seesaw professional development coordinator Angela Gadtke @MrsGadtke) the keynote also included a \"digital magic trick\" demo using the new iOS app by Microsoft, \"Seeing AI.\" Google Slides shared during this keynote, including links to all referenced student examples and other resources, are available in the podcast shownotes or directly using the shortened web link http://wfryer.me/kvate2017. Check out the podcast shownotes for additional KVATE resources and links. If you listen to this podcast, please provide feedback to Wes either with a comment on this post or by sending a Twitter reply to @wfryer. Thanks for listening to Moving at the Speed of Creativity podcasts! Please subscribe using PocketCasts or in your own favorite podcatcher application.",
            "length": "11175314",
            "sourceUrl": "http://feedproxy.google.com/~r/speedofcreativity/podcasts/~5/TY-mAJC_z68/2017-07-25-speedofcreativity.mp3",
            "epNo": "454"
        },
        {
            "title": "Podcast453: Reflections on ISTE 2017 and iPad Media Camp - Jackson, Wyoming",
            "datePublished": "Sun, 02 Jul 2017 04:48:09 +0000",
            "description": "In this podcast from July 1, 2017, Shelly and Wesley Fryer reflect on takeaways and important learning points from the 2017 ISTE (International Society for Technology in Education) Conference in San Antonio, Texas. They also reflect on what went well and what was learned at the iPad Media Camp they co-facilitated in Jackson, Wyoming, for 45 area educators. Check out the podcast shownotes on speedofcreativity.org for links to referenced resources and apps mentioned during the podcast. If you have feedback, reach out on Twitter to Shelly @sfryer and Wes @wfryer. Contact information for Wes and Shelly is also provided on their respective websites: www.shellyfryer.com and www.wesfryer.com.",
            "length": "11448133",
            "sourceUrl": "http://feedproxy.google.com/~r/speedofcreativity/podcasts/~5/8C0zQJosrB8/2017-07-01-speedofcreativity.mp3",
            "epNo": "453"
        },
        {
            "title": "Podcast452: Classroom Wireless Projection Options, Coding, Toy Hacking, CyberSecurity & More from ATLIS 2017",
            "datePublished": "Fri, 28 Apr 2017 18:47:45 +0000",
            "description": "This podcast features an extended reflection by Dr. Wesley Fryer on the multitude of educational technology learning nuggets he gleaned from sessions shared at the ATLIS 2017 Conference in Burbank, California, April 23-26, 2017. All of Wes' shared notes from keynotes, workshops and sessions at ATLIS 2017 are available in a shared Google Drive folder linked from wfryer.me/atlis17. Refer to the podcast shownotes for specific websites, resources, videos, tweets, and other referenced links from this podcast. Some of the topics addressed in this reflection include classroom wireless projection options (for multiple platforms: AirPlay, Windows Surface/Windows10, and Chrome), resources to support student coding, toy hacking, Raspberry Pi, creating accessible (sub-titled) videos with the automated speech-to-text features in Apple's new \"Clips\" app, and cybersecurity. Within the realm of cybersecurity, topics included 2 step verification, phishing, local tests to measure teacher's awareness of and savvy to phishing, spear fishing, GAFE / GSuite data backup options, the need for school network segmentation, and more. If you find any of the ideas from this podcast insightful or helpful, please reach out by sharing a comment on the podcast post on speedofcreativity.org, or by reaching out on Twitter or Mastodon to Wes (@wfryer or mastodon.cloud/@wfryer).",
            "length": "12610593",
            "sourceUrl": "http://feedproxy.google.com/~r/speedofcreativity/podcasts/~5/XH6XJaSmhAA/2017-04-28-speedofcreativity.mp3",
            "epNo": "452"
        },
        {
            "title": "Podcast451: SeeSaw, Enriched Assessment, Creating and Making with iPads",
            "datePublished": "Sat, 11 Mar 2017 03:30:05 +0000",
            "description": "This podcast features an interview with Shelly Fryer, discussing the use of SeeSaw to create student portfolios, strategies for enriched assessment using iPads, and her recent experiences leading professional development workshops for Oklahoma A+ Schools. She also discusses her recent experiences at EdCampOKC, a regional \"unconference\" for area educators, her students' recent eBook projects which culminated their Black History research unit, and reflected on STEM/STEAM lessons her her classroom Maker Studio. Shelly has been an elementary teacher and early childhood educator since 1985, and has been teaching 3rd and 4th grade students for the past four years in a 1:1 iPad classroom.  Links to other referenced resources are included in the podcast shownotes. If you listen to and enjoy this podcast, please let Shelly and Wes know by sending a Twitter reply to @sfryer and @wfryer. Also consider subscribing to the \"EdTech Situation Room\" podcast (www.edtechSR.com) and the \"Fuel for Educational Change Agents\" podcast (audio.speedofcreativity.org). Your feedback and suggestions are welcome!",
            "length": "11913162",
            "sourceUrl": "http://feedproxy.google.com/~r/speedofcreativity/podcasts/~5/x6cdkgemktU/2017-03-09-speedofcreativity.mp3",
            "epNo": "451"
        },
        {
            "title": "Podcast450: Great Classroom iPad Projects and Activities (Nov 2016)",
            "datePublished": "Sat, 03 Dec 2016 15:13:48 +0000",
            "description": "This podcast features a recording of Wesley Fryer's breakout session, \"Great Classroom iPad Projects and Activities\" at the 2016 Interactive Learning Institute (ILI) on November 30, 2016, in Norman, Oklahoma. ILI is sponsored by the K20 Center at the University of Oklahoma, and is an annual event focused on sharing best practices for technology integration in K12 classrooms. Grant recipients for OETT (the Oklahoma Education Technology Trust) administered by the K20 Center are among the participants in the conference, but it is open to educators at all levels from any school. The official session description for this presentation was:\n\nExplore over 20 \"media project recipes\" which can be used as-is or modified as needed to help facilitate student iPad media projects\n\nAccess the iPad project matrix highlighted in this presentation by visiting www.ipadmediacamp.com/matrix and more student iPad media project examples by visiting ShowWithMedia.com. Slides for this presentation as well as links to other referenced resources are included in the podcast shownotes. If you listen to and enjoy this podcast, please let Wes know by sending a Twitter reply to @wfryer. Also consider subscribing to the \"EdTech Situation Room\" podcast (www.edtechSR.com) and the \"Fuel for Educational Change Agents\" podcast (audio.speedofcreativity.org). Your feedback and suggestions are welcome!",
            "length": "14990687",
            "sourceUrl": "http://feedproxy.google.com/~r/speedofcreativity/podcasts/~5/H-jMUG5_2wI/2016-12-03-speedofcreativity.mp3",
            "epNo": "450"
        },
        {
            "title": "Podcast449: Innovating with Google Tools - Digital Citizenship in the Security State",
            "datePublished": "Mon, 21 Nov 2016 05:54:40 +0000",
            "description": "Welcome to the November 20, 2016, podcast episode of \"Moving at the Speed of Creativity\" with Wesley Fryer. This episode includes two recent presentation recordings by Wes from the last two weeks. The first was the opening keynote at the November 12, 2016, Google Summit in Maize, Kansas, titled \"Innovating with Google Tools.\" The second is an audio recording of Wes' TEDx presentation on Saturday, November 19, 2016, at Waller Middle School in Enid, Oklahoma. Wes was one of three adult presenters in this #TEDxYouth event, which is one of only 19 similar events in the United States in 2016. The title of Wes' presentation was, \"Digital Citizenship in the Surveillance State.\" Check the podcast shownotes for links to the presentation slides from both of these sessions, as well as recent podcasts with and by Wes from the past week referenced in the introduction. If you listen to and enjoy this episode, please reach out to Wes with a comment or via a Twitter reply to @wfryer. Thanks for listening to \"Moving at the Speed of Creativity!\"",
            "length": "12126456",
            "sourceUrl": "http://feedproxy.google.com/~r/speedofcreativity/podcasts/~5/y1vWK98IAqM/2016-11-20-speedofcreativity.mp3",
            "epNo": "449"
        },
        {
            "title": "Podcast448: Artificial Reality, Free Online Learning Channels & STEAM Studio",
            "datePublished": "Sun, 06 Nov 2016 15:15:04 +0000",
            "description": "Welcome to the November 5, 2016, podcast episode of \"Moving at the Speed of Creativity\" with Wesley Fryer, which explores topics relating to artificial reality, free online learning channels and a STEAM Studio reflection. Wes discusses Steven Levy's recent article for Backchannel, \"The Google Assistant Needs You,\" and our current \"transition era\" as artificial intelligence (AI) technologies mature and become normalized in our lives. He also discusses Elon Musk's recent announcement about camouflaged solar roof panels, and a recent video interview with Musk in which he discussed his reasons for starting the OpenAI (@openai) initiative. Musk's concerns about mature AI technologies are not limited to a RoboCop-style malicious AI future, but also include the danger of AI technologies being tightly controlled by a small number of entities. To guard against the dangers latent in that future scenario, Musk wants more groups, individuals and nations to have access to powerful AI algorithms and capabilities through the open source movement. In part two of the podcast, Wes discussed some of his favorite podcast channels and websites which provide fantastic opportunities for free, online learning. This begins with the K12 Online Conference (@k12online) which launched its 2016-17 mini-conference series on October 21st with a 3 part keynote and live panel discussion on YouTube Live with Julie Lindsay (@julielindsay). This first strand of the conference this year focuses on global collaboration. Strand two will focus on \"Learning Spaces\" and starts November 14th with a keynote by David Jakes (@djakes). Favorite tech podcasts mentioned by Wes in this episode include Clockwise by RelayFM (@clockwisepod), The Committed (@CommittedShow), and Note to Self (@notetoself). Wes also mentioned his weekly podcast and live webshow (on most Wednesday nights) The EdTech Situation Room (@edtechSR). The third part of this podcast features a recorded reflection by elementary art teacher Megan Thompson (@seeingnewshapes) and Wes discussing the \"STEAM Studio\" after-school enrichment class the co-taught this past semester together. They discuss things that went well, things they would change, and success stories from this STEAM (Science, Technology, Engineering, Art and Math) collaboration. If you listen to and enjoy this episode, please reach out to Wes with a comment or via a Twitter reply to @wfryer. Thanks for listening to \"Moving at the Speed of Creativity!\"",
            "length": "14201251",
            "sourceUrl": "http://feedproxy.google.com/~r/speedofcreativity/podcasts/~5/lAeQ_YuBhws/2016-11-05-speedofcreativity.mp3",
            "epNo": "448"
        },
        {
            "title": "Podcast447: Reflections on Screenagers Movie - Growing up in the digital age",
            "datePublished": "Thu, 22 Sep 2016 03:18:58 +0000",
            "description": "This 20 minute podcast features reflections by Sarah Fryer, Rachel Fryer, and Wesley Fryer after watching a screening of the film, \"Screenagers: Growing up in the digital age.\" http://www.screenagersmovie.com This 70 minute movie was shown on September 21, 2016, to an audience of parents, students, and educators at Christ the King School in Oklahoma City. The film raises important issues relating to healthy living, Internet safety, identity, and digital citizenship. It highlights the importance of parents setting boundaries for screen use and access with kids, and the importance of being intentional with our choices when it comes to smartphones and other screens. In this podcast recorded after watching Screenagers together, Sarah, Rachel and Wes offer their takeaways from the film and some of the highlights which stood out as important and valid points. Check the podcast shownotes for links to the Screenagers website and other digital citizenship resources. Follow the film on Twitter @ScreenagerMovie. Many thanks to Christ the King School in Oklahoma City for hosting this event and promoting good conversations about these issues among parents, kids and teachers!",
            "length": "4614879",
            "sourceUrl": "http://feedproxy.google.com/~r/speedofcreativity/podcasts/~5/swYYukveR5c/2016-09-21-speedofcreativity.mp3",
            "epNo": "447"
        },
        {
            "title": "Podcast446: Reflections on a PBS Scratch Jr Coding Camp for Kids",
            "datePublished": "Sat, 17 Sep 2016 22:27:35 +0000",
            "description": "Coding is an important literacy skill we need to introduce to everyone in the 21st century! This podcast features reflections by Shelly Fryer (@sfryer) and Wesley Fryer (@wfryer) following a PBS Scratch Jr. Coding Camp for Kids in Edmond, Oklahoma, on September 17, 2016. It also includes some recorded audio from Shelly's lessons during the workshop for 3rd, 4th and 5th graders. The coding camp was sponsored by The Div (@thedivorg), a local 501c3 nonprofit \"dedicated helping the next generation thrive through access to technology education.\" According to its official website, \"ScratchJr is an introductory programming language that enables young children (ages 5-7) to create their own interactive stories and games. Children snap together graphical programming blocks to make characters move, jump, dance, and sing. Children can modify characters in the paint editor, add their own voices and sounds, even insert photos of themselves -- then use the programming blocks to make their characters come to life.\nScratchJr was inspired by the popular Scratch programming language (http://scratch.mit.edu), used by millions of young people (ages 8 and up) around the world. In creating ScratchJr, we redesigned the interface and programming language to make them developmentally appropriate for younger children, carefully designing features to match young children's cognitive, personal, social, and emotional development. ScratchJr is available as a free app for both iPad and Android tablets. For more information about ScratchJr, see http://scratchjr.org.\" PBS Scratch Jr. was introduced in December 2015 and is an official version of the original app but includes familiar and favorite characters from PBS Kids. Check out our podcast shownotes for referenced links to all the videos and resources used in this Kids Coding Camp and mentioned in our podcast.",
            "length": "16334550",
            "sourceUrl": "http://feedproxy.google.com/~r/speedofcreativity/podcasts/~5/gc-8EevWUss/2016-09-17-speedofcreativity.mp3",
            "epNo": "446"
        },
        {
            "title": "Podcast445: Voices from iPadPaloozaOU + the iPad Media Activities & Project Matrix",
            "datePublished": "Sun, 28 Aug 2016 22:21:40 +0000",
            "description": "This podcast features a series of recordings from the first iPadPaloozaOU conference held in Norman, Oklahoma, on August 26 and 27, 2016. The first segment is a series of audio reflections shared by participants in Shelly Fryer's Friday breakout session, \"The Room 108 Radio Show.\" Just like Shelly has her students share in her classroom radio show, iPadPaloozaOU participants shared their first names and answered the question of the day, \"What have you learned at iPadPaloozaOU and are taking back to your classroom?\" The second segment is Shelly Fryer's five minute closing keynote, shared on Saturday. Five different Oklahoma educators shared a short talk about a subject they are passionate about during the combined keynote. Shelly talked about homelessness in Oklahoma, her school, Positive Tomorrows, and the importance of loving and building relationships with the students in our classrooms. Shelly shared 1 correction via Twitter following her keynote: 1 in 21 Oklahoma students are homeless today, according to recent studies. Check out the podcast shownotes for a link to a recent NewsOK.com article citing this statistic. Finally, the third podcast segment is a recording of Dr. Wesley Fryer's breakout session, \"iPad Media Activities and Project Matrix.\" The description of the session was: \"Come learn the specific steps teachers and students can use to create over 20 different iPad media projects as well as whole-class, interactive iPad writing activities. The iPad Media Activity and Project Matrix (www.ipadmediacamp.com/matrix) is used in iPad Media Camp workshops to help teachers learn to integrate effective use of iPads into the curriculum. The matrix includes whole-class response activities (interactive digital writing), single-app projects (using a learning journal like SeeSaw), 2 app projects (create + share) and Multi-app projects (app-smash projects).\" The matrix is available as a series of linked Google Draw documents on http://www.ipadmediacamp.com/matrix. Check the podcast shownotes for additional referenced links and resources from these presentations. Many thanks to Anne Beck and her organizer team for making the first iPadPaloozaOU a smashing success!",
            "length": "17981853",
            "sourceUrl": "http://feedproxy.google.com/~r/speedofcreativity/podcasts/~5/FouATu45deM/2016-08-28-speedofcreativity.mp3",
            "epNo": "445"
        },
        {
            "title": "Podcast444: Reflections on iPad Media Camp (July 2016)",
            "datePublished": "Sat, 23 Jul 2016 15:11:44 +0000",
            "description": "Welcome to a recorded podcast from the road with Wesley and Shelly Fryer, reflecting on the past week of iPad Media Camp workshops in Stilwell and Tulsa Oklahoma in July 2016. This is the fourth summer of iPad Media Camp workshops, which are multi-day, hands-on experiences for educators focused on using iPads to create and share media projects. For summer 2016, the curriculum for iPad Media Camps (wiki.ipadmediacamp.com) includes an \"iPad Media Activity and Project Matrix\" (www.ipadmediacamp.com/matrix). In this podcast reflection, Shelly and Wes discuss aspects of the workshops which went well and were different this year, including the use of the matrix to introduce teachers to whole-class, digital, interactive writing activities, \"single-app\" student projects using the SeeSaw Learning Journal, two-app projects, and more complex app smashing projects. During both iPad Media Camp workshops this week, Shelly taught other teachers how to create classroom radio shows (podcasts) using the free iOS app Opinion. Shelly facilitated a workshop participant podcast using the Opinion app after lunch in Tulsa on the first day of the workshop, and that 5 minute audio reflection is included in this podcast. Other portions of this episode were recorded using the free iOS app \"Voice Record Pro.\" Shelly was able to \"air drop\" the M4A audio audio file from the Opinion app to Wes' iPhone, where he opened it in Voice Record Pro. All portions of the podcast were combined in the Voice Record Pro app and then saved as a video to the iOS Camera Roll. Wes uploaded the video to YouTube from the middle of rural Kansas (just south of Buffalo on US 75) thanks to available LTE cellular data coverage.  The next day, Wes added some post-production audio bumpers to the podcast using Audacity on a Mac laptop, normalized the final FLAC format exported audio file using Auphonic.com, and published it to Amazon S3. Check the podcast shownotes for more links to iPad Media Camp curriculum and resources. If you listen to the podcast and find it useful, please reach out to Shelly (@sfryer) or Wes (@wfryer) on Twitter to let them know!",
            "length": "11849437",
            "sourceUrl": "http://feedproxy.google.com/~r/speedofcreativity/podcasts/~5/zNiuyFp-QAQ/2016-07-23-speedofcreativity.mp3",
            "epNo": "444"
        },
        {
            "title": "Podcast443: Preparing for the 2016 iPadPalooza and ISTE Conferences",
            "datePublished": "Sun, 19 Jun 2016 04:33:36 +0000",
            "description": "This podcast includes a practice mini-keynote as well a preparatory conversation between Shelly Fryer (@sfryer) and Wesley Fryer (@wfryer) in advance of the 2016 iPadPalooza Conference (in Austin, Texas) as well as ISTE Conference (in Denver, Colorado) in upcoming weeks. Shelly and Wes discuss several new ideas related to \"The Digital Sharing Project\" and the \"Inside Outside Sharing\" book they are currently working on. These included a proposed lesson cycle for the classroom (Make, Create and Share) and a possible digital badge workflow for ShowWithMedia.com media products in Shelly's classroom and in upcoming iPad Media Camp workshops in July. They also shared some \"Geeks of the Week\" in this episode. Wes' was the magnetized OKRA iPhone car holder, and Shelly's was the Netflix series, \"Reign.\" Please share your thoughts and feedback via Twitter by replying to @sfryer or @wfryer, or by leaving a comment below. Refer to the podcast shownotes for links to all referenced links and resources from the show.",
            "length": "10765784",
            "sourceUrl": "http://feedproxy.google.com/~r/speedofcreativity/podcasts/~5/oSyLK_vtg0c/2016-07-18-speedofcreativity.mp3",
            "epNo": "443"
        },
        {
            "title": "Podcast442: Classroom Passion Projects, Maker Studio & Digital Citizenship with Shelly Fryer",
            "datePublished": "Mon, 30 May 2016 16:06:52 +0000",
            "description": "This Speed of Creativity podcast features an extended interview with 3rd and 4th grade teacher Shelly Fryer, who shares about her students' classroom passion projects, learning in \"Maker Studio,\" and learning about digital citizenship via the class chat feature of the iPad app News-O-Matic. Shelly has been teaching for over twenty years, and this was her third year to teach at Positive Tomorrows School in Oklahoma City. Positive Tomorrows is a special K-5 school which exclusively serves homeless children and their families. Shelly class has had \"1:1 iPads\" for the past 2.5 years, and she continues to find multiple ways to integrate iPad use meaningfully into her curriculum through engaging student activities. As Shelly explains in the interview, PT truly is \"the school she loves\" for so many reasons. The curricular autonomy which she enjoys as a teacher empowers her to differentiate her curriculum to the learning needs and interests of her students, and bring a variety of STEM and Maker Education (MakerEd) learning activities to students as well. Shelly explains in the interview why this year's classroom \"passion projects\" were likely the best student projects she's ever facilitated as a classroom teacher. From learning to sew a dress, to how to code on an iPad, to learning how to dance, to learning how to play the guitar, her students each selected a topic of interest and then explored that topic for several weeks. Each student shared a culminating presentation with other members of the class, after becoming the local \"expert\" on their topic of inquiry. In the second part of the interview, Shelly shares how the \"Create, Make and Learn\" MakerED Institute in Burlington, Vermont, in the summer of 2013 was pivotal in her journey as a Maker and elementary teacher integrating STEM activities into classroom learning. Shelly tells the story of how her students enthusiastically embraced the opportunity to create, make, collaborate and share in her Maker Studio in the closing weeks of the school year. She also describes how she worked to build a kind, respectful, and collaborative classroom culture in which students could safely thrive as learners and problem solvers. Last of all in the interview, Shelly shares how she and her students used the \"class chat\" feature of the iPad app to have important conversations about digital citizenship, internet safety, and digital ethics. If you listen to this podcast, please share feedback with Shelly by reaching out to her on Twitter (@sfryer). Visit her classroom website at http://classroom.shellyfryer.com and her professional blog on http://www.shellyfryer.com. Check out the podcast shownotes for links to resources and tools Shelly mentioned in the interview, including her presentation for Global Maker Day on May 17, 2016, \"iPads in Maker Studio.\"",
            "length": "18391802",
            "sourceUrl": "http://feedproxy.google.com/~r/speedofcreativity/podcasts/~5/v4gRw3YusSY/2016-05-30-speedofcreativity.mp3",
            "epNo": "442"
        },
        {
            "title": "Podcast441: iPads in Maker Studio by Shelly Fryer (May 2016)",
            "datePublished": "Tue, 17 May 2016 16:59:22 +0000",
            "description": "This podcast is a recording of Shelly Fryer's presentation \"iPads in Maker Studio\" via a Google Hangout for the 2016 Global Maker Day Conference. The session description was: \"Learn how our third and fourth grade students use their iPads in our maker studio to document their learning and share both inside and outside our classroom. See how apps for photo collages, green screen videos, making ebooks, coding apps, and Lego Stopmotion are essential digital tools in our classroom maker studio for creating and sharing.\" Access the slides and referenced resources from this presentation on Shelly's website: http://classroom.shellyfryer.com/workshops/ipads-maker-studio. Connect with her on Twitter @sfryer. Refer to the podcast shownotes for additional links and resources about this presentation as well as Global Maker Day!",
            "length": "12661787",
            "sourceUrl": "http://feedproxy.google.com/~r/speedofcreativity/podcasts/~5/vuvWAkPfo8Y/2016-05-15-speedofcreativity.mp3",
            "epNo": "441"
        },
        {
            "title": "Podcast 440: WordPress Security & 2 Factor Authentication",
            "datePublished": "Tue, 01 Mar 2016 05:26:00 +0000",
            "description": "This podcast is a recording of a presentation by Dr. Wesley Fryer on February 29, 2016, titled, \"WordPress Security & 2 Factor Authentication\" at the WordPressOKC meetup at Oklahoma Christian University in Edmond, Oklahoma. Check the podcast shownotes for links to referenced resources, including the Google Presentation shared during the session. Link to those slides with the shortened URL http://wfryer.me/2factor.",
            "length": "13574192",
            "sourceUrl": "http://feedproxy.google.com/~r/speedofcreativity/podcasts/~5/IfyB1WV1e6Y/2016-02-29-speedofcreativity.mp3",
            "epNo": "440"
        },
        {
            "title": "Podcast 439: Best Day of Classroom Blogging Ever with Shelly Fryer",
            "datePublished": "Sat, 30 Jan 2016 18:22:21 +0000",
            "description": "This podcast features an interview with 3rd and 4th grade teacher Shelly Fryer on January 29, 2016, in Oklahoma City. Shelly teaches in a 1:1 iPad classroom at Positive Tomorrows, a special school for homeless children which also serves their families in multiple ways. Shelly has been using blogging websites with her students for three years, to teach students about digital citizenship through interactive writing. The day of this interview was her current students' first day to experience blogging on an updated KidBlog website, however, and Shelly not only focused on writing with students but also on images and the digital citizenship conversations which relate to these activities online. Shelly's students have been doing a lot of \"inside sharing\" using the SeeSaw iPad app and website this year, and while she has shared some of the students' posts with a wider audience using Twitter, this was the first focused day of learning when students discussed and prepared for \"outside sharing.\" Check out the podcast shownotes for links to referenced apps and websites in this interview, along with links to others we gave shout-outs to. Interactive writing can be so powerful, as well as constructively exciting for student learning inside and outside the classroom! Please click on Shelly's classroom KidBlog website on http://classroom.shellyfryer.com and leave some comments for her students. Also please let us know you listened to this podcast by sharing a reply on Twitter to @sfryer and/or @wfryer or by leaving a comment on the blog post you'll find on http://www.speedofcreativity.org.",
            "length": "11076307",
            "sourceUrl": "http://feedproxy.google.com/~r/speedofcreativity/podcasts/~5/DwG3gIB9c6Y/2016-01-29-speedofcreativity.mp3",
            "epNo": "439"
        },
        {
            "title": "Podcast 438: Reflections on iCamp KSU 2016 by Shelly and Wesley Fryer",
            "datePublished": "Tue, 19 Jan 2016 05:56:57 +0000",
            "description": "This podcast recording is a reflection by Shelly and Wesley Fryer about iCamp KSU 2016, a full day, hands-on workshop on integrating iPads in the classroom as tools for media creation by students to \"show what they know with media.\" iCamp KSU was held at the Kansas State University Alumni Center in Manhattan, Kansas, and hosted by the Kansas State College of Education. It was organized by Cyndi Danner-Kuhn, a pre-service teacher educator at Kansas State. In addition to Shelly and Wes' reflections, this podcast includes five of the participant reflections shared as Adobe Voice videos. Direct links to these video reflections are included in the podcast shownotes, along with other referenced resources from the podcast. Access the complete agenda and resource list from the workshop on http://wfryer.me/icamp06. The podcast also includes the whole-class radio show created during the workshop using the free Opinion app for iOS.",
            "length": "10075562",
            "sourceUrl": "http://feedproxy.google.com/~r/speedofcreativity/podcasts/~5/zResXgCDBh8/2016-01-18-speedofcreativity.mp3",
            "epNo": "438"
        },
        {
            "title": "Podcast 437: The 2015 EdTech Year in Review",
            "datePublished": "Fri, 01 Jan 2016 04:56:54 +0000",
            "description": "This podcast is a recorded Google Hangout On Air from December 31, 2015, of a panel discussion with Jason Neiffer (@techsavvyteach), Eric Langhorst (@elanghorst), Nikki D Robertson (@nikkidrobertson), and Wesley Fryer (@wfryer). The title of this roundtable discussion was \"The 2015 EdTech Year in Review,\" and focused on some of the most important developments and news items regarding educational technology in 2015. Our topics included the Hour of Code, BreakoutEDU and Gameification, Student Privacy and the EFF Complaint about Google, Google Cardboard / Virtual Reality, \"go-to\" apps teachers can use to go deeper, and best new technology hardware from 2015. Check out our podcast shownotes for all referenced resources and links, including our Google Doc planning document which includes even more we didn't have time to talk about in the show. Happy New Year everyone!",
            "length": "39186562",
            "sourceUrl": "http://feedproxy.google.com/~r/speedofcreativity/podcasts/~5/ZzOhMJf6Nu0/2015-12-31-speedofcreativity.mp3",
            "epNo": "437"
        },
        {
            "title": "Podcast 436: The Technology Director Speaks",
            "datePublished": "Sat, 05 Dec 2015 05:38:10 +0000",
            "description": "11 topics in 67 minutes! In this podcast recording, Dr. Wesley Fryer shares some updates about his new position this year as a school technology director, previews \"iPad Media Camp in a box\" for summer 2016, shares his current favorite podcasts and audiobooks, discusses lessons learned about fiber optic cabling, and lessons learned from seven videoconferences (five of which were international) in fall 2015. In addition, Wes shares about current \"Classroom Projection Options\" and \"AirPlay Mirroring Guidelines,\" discusses an upcoming VOIP phone transition at his school, and highlights lessons learned from firewall shopping and comparisons this semester. Finally, he discusses some of the issues which have come up recently as his 11 year old (Rachel) has become an aspiring YouTube Minecrafter, forthcoming updates to his mailing list, and answers a question about searchable Google Docs. Check out the podcast shownotes for an exhaustive list of referenced resources from this podcast.",
            "length": "16332382",
            "sourceUrl": "http://feedproxy.google.com/~r/speedofcreativity/podcasts/~5/IeIN-2uvJWk/2015-12-04-speedofcreativity.mp3",
            "epNo": "436"
        },
        {
            "title": "Podcast 435: Reflections on Miami Device 2015 by Shelly and Wesley Fryer",
            "datePublished": "Sun, 15 Nov 2015 17:40:30 +0000",
            "description": "This podcast is a recorded reflection on the 2015 Miami Device Conference by Shelly and Wesley Fryer. The second Miami Device Conference was held at Saint Stephen's Episcopal Day School  in Coconut Grove, Florida on November 12-13, 2015. In this audio podcast, Shelly and Wes reflect on many of the keynotes and breakout sessions from the conference, as well as other takeaways from this epic learning event! Check out the podcast shownotes for links to referenced resources.",
            "length": "13889386",
            "sourceUrl": "http://feedproxy.google.com/~r/speedofcreativity/podcasts/~5/AsmFSVypyaw/2015-11-15-speedofcreativity.mp3",
            "epNo": "435"
        },
        {
            "title": "Podcast 434: Discovering Useful New Ideas as a Connected Educator (October 2015)",
            "datePublished": "Sun, 25 Oct 2015 04:43:45 +0000",
            "description": "This podcast primarily features a recording from the October 22, 2015, OACTE, OEQA, OATE Fall Conference in Edmond, Oklahoma, held at the University of Central Oklahoma. The recorded session was my breakout presentation titled, \"Discovering Useful New Ideas as a Connected Educator: Tips for Using Flipboard, Pocket, Twitter and Nuzzel.\" Check out the podcast shownotes for links to my presentation slides (shared as a Google Presentation) and other referenced links and videos. Access that website using the shortened URL wfryer.me/ideas. The introduction of this podcast includes some reflections on the 2015 Write Well, Sell Well Conference in Oklahoma City, on October 22-23, 2015. Referenced websites from the introduction are also included in the podcast shownotes. The session description for \"Discovering Useful New Ideas as a Connected Educator\" was: If “chance favors the connected mind,” as Steven Johnson maintains, what are some of the best strategies educators can use to discover new ideas useful for teaching and learning? Learn how to use the free apps Flipboard and Nuzzle, Twitter lists, and other strategies to more effectively discover, save and share ideas useful professionally and personally. Learn why it is important to customize your personal or classroom Twitter account to show others your particular educational focus and interests. Learn to use Twitter hashtags to connect locally and globally to learn and grow as a professional educator.",
            "length": "16650590",
            "sourceUrl": "http://feedproxy.google.com/~r/speedofcreativity/podcasts/~5/GlAJX9Dxs1Y/2015-10-23-speedofcreativity.mp3",
            "epNo": "434"
        },
        {
            "title": "Podcast433: Sharing Student Work Online (October 2015)",
            "datePublished": "Thu, 08 Oct 2015 03:11:37 +0000",
            "description": "This podcast is a recording of Dr. Wesley Fryer's presentation \"Sharing Student Work Online\" on October 7, 2015, at the Oklahoma Technology Association (OTA) / Encyclo-Media Conference in Oklahoma City. The session description was: When students at school use media to “show what they know and can do,” they need safe, adult-moderated, online spaces to share their digital work with others and receive thoughtful feedback. Learn how to to use free websites like KidBlog and Blogger, along with apps like Easy Blogger Jr., to share student work online and moderate feedback. Discuss how to help students “compose quality comments” for others. Explore workflows to safely use a classroom YouTube channel to publish and share student work, also with moderated feedback. See examples of school and classroom permission forms for publishing student work. Get practical ideas for “normalizing” the regular, open publication of student work at your school for moderated feedback from peers, parents, and others around the world. Check the podcast shownotes for links to session slides (shared as a Google Presentation) as well as other referenced resources.",
            "length": "12916317",
            "sourceUrl": "http://feedproxy.google.com/~r/speedofcreativity/podcasts/~5/027x6UtiOGs/2015-10-07-speedofcreativity.mp3",
            "epNo": "433"
        },
        {
            "title": "Podcast432: Dan Straughan Shares About the Oklahoma City Homeless Alliance",
            "datePublished": "Sun, 27 Sep 2015 02:24:54 +0000",
            "description": "This podcast is a presentation by Dan Straughan, executive director of the Oklahoma City Homeless Alliance, shared on Friday, September 25, 2015, at the Friday Morning Mens Group of First Presbyterian Church of Edmond, Oklahoma. For several months, our men's group has been reading and studying the wonderful book, \"Same Kind of Different As Me: A Modern-Day Slave, an International Art Dealer, and the Unlikely Woman Who Bound Them Together\"  by Ron Hall and Denver Moore. This is an amazing and powerful book, relating the transformational story of how God worked in the lives of a homeless man (Denver) and Ron Hall to give second chances and teach unforgettable life lessons about love, caring, and the value of all human beings. With interest in local homeless issues raised by this book, Dan Straughan was invited to present at our men's group meeting. The OKC Homeless Alliance is \"a nonprofit organization dedicated to improving the system of care for the homeless in Oklahoma City through collaboration with government, faith-based and nonprofit service providers. The ultimate goal of the Homeless Alliance is to rally our community to end long-term homelessness in Oklahoma City by both preventing homelessness and increasing the supply of affordable and permanent supportive housing to move those who are currently homeless back into housing.\" This 45 minute presentation by Dan provides an important window into the ways outreach ministries and social service groups are seeking to help meet the needs of homeless individuals and families in Oklahoma City. Check the podcast shownotes for links to referenced organizations and other resources including the book, \"Same Kind of Different As Me.\" Read this powerful book, and get involved in assisting organizations in your community reaching out to the homeless.",
            "length": "12314378",
            "sourceUrl": "http://feedproxy.google.com/~r/speedofcreativity/podcasts/~5/byECfEWV6-0/2015-09-25-speedofcreativity.mp3",
            "epNo": "432"
        },
        {
            "title": "Podcast431: Encouraging Digital Sharing by Early Majority Teachers",
            "datePublished": "Mon, 21 Sep 2015 00:36:58 +0000",
            "description": "This podcast from the road by Wesley Fryer focuses primarily on ideas about encouraging \"early majority\" teachers (using Everett Rogers'  Technology Adoption Curve terminology) to digitally share ideas, lessons, and student work. This includes planning for the November 2016 Digital Sharing Conference, to be held in Oklahoma City and hosted by Casady School. Reflections on conversations with Ben Wilkoff yesterday in Denver, Colorado, about digital sharing by teachers are also included. This podcast was entirely produced on an iPhone using the iRig Recorder, Dropbox, and Bossjock iOS apps. Check the podcast shownotes for extensive links to referenced apps, videos, and other resources in this episode.",
            "length": "19843719",
            "sourceUrl": "http://feedproxy.google.com/~r/speedofcreativity/podcasts/~5/pgR1wGDKJlM/2015-09-20-speedofcreativity.mp3",
            "epNo": "431"
        },
        {
            "title": "Podcast430: Minecraft Summer Camp with Connected Camps",
            "datePublished": "Mon, 14 Sep 2015 03:25:36 +0000",
            "description": "This podcast is an interview with 12 year old Rachel, who participated in the July 2015 Minecraft Summer Camp sponsored by Connected Camps of California. Rachel shares some stories about things that happened in Minecraft Camp and what she enjoyed about the camp. Check out the podcast shownotes for links to the official Connected Camps Minecraft Camp website and Twitter channel, as well as Rachel's Minecraft channel on YouTube and a couple screenshots of her Minecraft builds from camp. Connected Camps is continuing to offer after-school Coding Camps during the school year, so check them out! Connect Camps rocks!",
            "length": "4600318",
            "sourceUrl": "http://feedproxy.google.com/~r/speedofcreativity/podcasts/~5/QUwepuRfgaA/2015-09-13-speedofcreativity.mp3",
            "epNo": "430"
        },
        {
            "title": "Podcast429: Creating to Learn - Videoconference Keynote to Bangalore, India",
            "datePublished": "Mon, 03 Aug 2015 05:28:11 +0000",
            "description": "This podcast is an audio recording of Dr. Wesley Fryer's closing keynote address at the School of Tomorrow Conference in Bangalore, India, on August 1, 2015. This presentation was shared via videoconference from Dr. Fryer's home in Oklahoma City, Oklahoma, so there was a time difference of 10 hours and 30 minutes between the sites. Over 400 Indian educators and educational stakeholders attended the conference and this closing session. The School of Tomorrow Conference was sponsored by the XSEED Foundation for Life. Their Twitter profile (@XSEEDEducation) explains they are \"On a mission to transform elementary education globally from rote to learning. About children who can think, solve, create, speak-up, and are unafraid.\" The recorded audio from the keynote has been slightly edited to remove silent portions when questions were asked by audience members, but that audio was not recorded locally. In addition, the original audio from the three video clips shared by Dr. Fryer have been amplified and inserted into this podcast. Check the shownotes for a link to the Google Presentation slides Dr. Fryer used in the keynote, a YouTube playlist of shared videos, and additional referenced resources.",
            "length": "12263028",
            "sourceUrl": "http://feedproxy.google.com/~r/speedofcreativity/podcasts/~5/MqlGTivfhgA/2015-08-02-speedofcreativity.mp3",
            "epNo": "429"
        },
        {
            "title": "Podcast428: Student News Media Project Ideas",
            "datePublished": "Sat, 11 Jul 2015 19:52:27 +0000",
            "description": "This podcast was created on July 11, 2015, in a Storychasers workshop in Oklahoma City focusing on Student News Clubs and Classes at school. Wes, Rebecca, Kristi, Jolene, and Sarah created a \"podcast show lineup\" following the example provided by Bob Sprankle in his video from 2005, \"Room 208 Vodcast.\" They discussed the Lakeview Elementary Storychasers project from a few years ago in Yukon, Oklahoma, experiences with Tablet PCs in the classroom, and project ideas for using Storychasers and radio shows with students in the classroom. Check our podcast shownotes for links to referenced websites from our workshop and this radio show.",
            "length": "1964357",
            "sourceUrl": "http://feedproxy.google.com/~r/speedofcreativity/podcasts/~5/nJiv7aaQ8AU/2015-07-11-speedofcreativity.mp3",
            "epNo": "428"
        },
        {
            "title": "Podcast427: Battlecode Coding Competition at MIT with Jonah Casebeer",
            "datePublished": "Sat, 04 Jul 2015 18:29:45 +0000",
            "description": "This podcast features an interview with Jonah Casebeer, a 17 year old family friend and rising senior at Thomas Jefferson High School for Science and Technology (TJ) in Alexandria, Virginia. Jonah and three of his classmates entered the annual \"Battlecode\" Artificial Intelligence Programming Competition at MIT along with about 400 other teams in the fall of 2014. Their team was selected among 16 finalists to fly to MIT for the live, final competition, which was livestreamed on Twitch.TV. They were the only team comprised of high school students in the 2015 competition. All the other teams (ranging from 1 to 4 members) included undergraduate and graduate students, along with adults out of college. According to the Battlecode.org website, \"The 6.370 Battlecode programming competition (also 6.147) is a unique challenge that combines battle strategy, software engineering and artificial intelligence. In short, the objective is to write the best player program for the computer game Battlecode. Battlecode, developed for 6.370, is a real-time strategy game. Two teams of robots roam the screen managing resources and attacking each other with different kinds of weapons. However, in Battlecode each robot functions autonomously; under the hood it runs a Java virtual machine loaded up with its team's player program. Robots in the game communicate by radio and must work together to accomplish their goals. Teams of one to four students enter 6.370 and are given the Battlecode software and a specification of the game rules in early January. Each team develops a player program, which will be run by each of their robots during Battlecode matches. Contestants often use artificial intelligence, pathfinding, distributed algorithms, and/or network communications to write their player. At the final tournaments, the autonomous players are pitted against each other in a dramatic head-to-head tournament. The final rounds of the MIT tournament are played out in front of a live audience, with the top teams receiving cash prizes. The total prize pool is over $50,000.\" In this podcast interview, Jonah tells about his experiences in the 2015 Battlecode competition as well as about the preparatory courses he took at TJ which prepared him and his teammates for this extremely fun and challenging activity. Check out the podcast shownotes for links to referenced sites, videos and resources. In the 3.5 hour video of the 2015 Battlecode Tournament, Jonah's team \"Puzzle\" takes the stage at 26:05.",
            "length": "3748706",
            "sourceUrl": "http://feedproxy.google.com/~r/speedofcreativity/podcasts/~5/5Dce30rJlME/2015-07-04-speedofcreativity.mp3",
            "epNo": "427"
        },
        {
            "title": "Podcast426: Civil War History at Harpers Ferry",
            "datePublished": "Thu, 02 Jul 2015 03:26:31 +0000",
            "description": "This podcast features an audio recording of a presentation by U.S. Park Ranger Creighton Waters on July 1, 2015, at the Harpers Ferry National Historical Park. Creighton mainly tells the story of the brief capture of Harpers Ferry in 1862 by Confederate forces led by General Thomas Jonathan \"Stonewall\" Jackson. 12,419 Federal troops surrendered to Jackson, which made this the largest surrender of US forces in history until the Battle of Bataan in World War II. Check out the podcast shownotes for links to photos of Harpers Ferry on July 1st as well as other historical links pertaining to the area.",
            "length": "13546875",
            "sourceUrl": "http://feedproxy.google.com/~r/speedofcreativity/podcasts/~5/RCWn4ehUfPE/2015-07-01-speedofcreativity.mp3",
            "epNo": "426"
        },
        {
            "title": "Podcast425: Reflections on the 2015 Mobile Learning Experience",
            "datePublished": "Sun, 21 Jun 2015 05:13:16 +0000",
            "description": "This podcast is a recorded reflection by Shelly and Wesley Fryer (@sfryer and @wfryer) on the June 2015 Mobile Learning Experience. Mobile Learning (@mobile2015) is a fantastic, annual conference in Tucson, Arizona, organized by the Arizona K-12 Center and Tony Vincent. This podcast also includes an interview with Ryan Read (@Ryan7Read) about his successful Kickstarter campaign to fund illustrations for his first graphic novel, working with a high school age illustrator he found via Fiverr.com. Check the podcast shownotes for referenced links and resources.",
            "length": "11076226",
            "sourceUrl": "http://feedproxy.google.com/~r/speedofcreativity/podcasts/~5/1wYZjJv_BiY/2015-06-20-speedofcreativity.mp3",
            "epNo": "425"
        }
    ]
}