{
    "artwork": "http://is1.mzstatic.com/image/thumb/Music71/v4/d7/3b/e4/d73be493-fe1e-4b1c-ae29-ed6ac6ceae12/source/100x100bb.jpg",
    "description": "Navy SEAL Motivational Speaker David Rutherford ignites audiences to embrace fear, forge self-confidence and Live the Team Life with his motivational philosophy called Froglogic Concepts.",
    "feedURL": "http://www.blogtalkradio.com/navysealradio/podcast",
    "podcastURL": "http://www.blogtalkradio.com/navysealradio",
    "title": "Navy SEAL Radio with David Rutherford",
    "episodes": [
        {
            "title": "Embrace your Financial Investment Fears at TD Ameritrade National LINC Conf.",
            "datePublished": "Fri, 03 Feb 2017 01:30:00 GMT",
            "description": "Top Podcast host, David Rutherford and SVP and Head of RIA and Bank Trust sales at Pioneer Investments, Paul Marino discuss the power of fear in the investment world. Join these two experts as they go through David's Froglogic motivational training program on Embracing Fear and how it can be applied to financial investing. \r\n",
            "length": "28462680",
            "sourceUrl": "https://www.blogtalkradio.com/navysealradio/2017/02/03/embrace-your-financial-investment-fears-at-td-ameritrade-national-linc-conf.mp3",
            "categories": [
                {
                    "_": "Finance",
                    "$": {
                        "domain": "http://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "Pioneer Investments - Introduction to Insurance Linked Securities (ILS)",
            "datePublished": "Thu, 02 Feb 2017 18:00:00 GMT",
            "description": "David Rutherford, Navy SEAL, Motivational Speaker, Author & Coach, Paul Marino, Head of Sales RIAT & Bank Trust for Pioneer Investments & Joe Morgart, Client Portfolio Manager at Pioneer Investments \r\n\r\nTopics: Joe and Paul will discuss what Insurance-Linked Securities are and how Pioneer incorporates them into their portfolios.\r\n",
            "length": "28180942",
            "sourceUrl": "https://www.blogtalkradio.com/navysealradio/2017/02/02/pioneer-investments--introduction-to-insurance-linked-securities-ils.mp3",
            "categories": [
                {
                    "_": "Finance",
                    "$": {
                        "domain": "http://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "Schwab IMPACT Series - Harvard BS Dean Luis M. Viceira - Embracing Alternatives",
            "datePublished": "Tue, 25 Oct 2016 23:00:00 GMT",
            "description": "Welcome to the Schwab IMPACT Conference series hosted by Navy SEAL Motivational Speaker, Author, Radio Host and Coach David Rutherford. This live Podcast series is brought to you by Pioneer Investments. The 3rd episode of the series David and Paul Marino, SVP Head of Sales RIA and Bank Trust with Pioneer welcome Senior Asscoate Dean of the Harvard Business School, Luis M. Viceira to the show. Pioneer Investments partnered with WealthManagement.com to conduct a survey of financial professionals to find out how they evaluate and use alternative investments. The 1,100 survey respondents, combined with other research conducted by WealthManagement.com, offers insight into advisors’ views on alternative strategies, and which types of clients they think could benefit from them. Date: Tuesday, October 25, 2016\r\nBooth #: 1527\r\n\r\nLuis M. Viceira\r\n\r\nSenior Associate Dean, HBS  \r\n\r\nPaul Marino, SVP\r\n\r\nHead of Sales RIA & \r\n\r\nBank Trust\r\n\r\nPioneer Investments\r\n",
            "length": "30324237",
            "sourceUrl": "https://www.blogtalkradio.com/navysealradio/2016/10/25/schwab-impact-series--harvard-bs-dean-luis-m-viceira--embracing-alternatives.mp3",
            "categories": [
                {
                    "_": "Finance",
                    "$": {
                        "domain": "http://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "Schwab IMPACT Series - Pioneer Team - SVP Paul Marino, SVP Henry Orvin",
            "datePublished": "Tue, 25 Oct 2016 22:30:00 GMT",
            "description": "Welcome to the Schwab IMPACT Conference series hosted by Navy SEAL Motivational Speaker, Author, Radio Host and Coach David Rutherford. This live Podcast series is brought to you by Pioneer Investments. In the second LIVE show David invites SVP Paul Marino to join him so they can have discussion around heritage, product innovation, a changing and challenging regulatory environment and Pioneer’s commitment to clients and advisors. Paul is head of sales RIA & Bank Trust for Pioneer Investments. David and Paul also welcome SVP Henry Orvin head of business development at Pioneer and James Vigue Portfolio Consultant to the show as well. Date: Tuesday, October 25, 2016 Booth #: 1527\r\n",
            "length": "29722827",
            "sourceUrl": "https://www.blogtalkradio.com/navysealradio/2016/10/25/schwab-impact-series--pioneer-team--svp-paul-marino-svp-henry-orvin.mp3",
            "categories": [
                {
                    "_": "Finance",
                    "$": {
                        "domain": "http://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "Schwab IMPACT Series - SEAL , Author, Coach David Rutherford - Embrace Your Fear",
            "datePublished": "Tue, 25 Oct 2016 18:00:00 GMT",
            "description": "Welcome to the Schwab IMPACT Conference series hosted by Navy SEAL Motivational Speaker, Author, Radio Host and Coach David Rutherford. This live Podcast series is brought to you by Pioneer Investments. In his first show David will discuss the first concept in his motivational training program titled Froglogic Concepts. David Has been exploring and researching the human condition for the past 25 years as a Navy SEAL Medic/Instructor, International Security Consultant for Blackwater, a Security Protection Specialist in high threat environments for the US Government, as well as a top motivational speaker, author and coach for the past 10 years. David will discuss his powerful training platform that teaches people to Embrace Fear in the most extreme situations imaginable. David introduces five concepts called “missions” to help you and your team embrace fear and use it to enhance your ability to succeed in any environment. Date: Tuesday, October 25, 2016\r\nBooth #: 1527\r\n",
            "length": "28343980",
            "sourceUrl": "https://www.blogtalkradio.com/navysealradio/2016/10/25/schwab-impact-series--seal-author-coach-david-rutherford--embrace-your-fear.mp3",
            "categories": [
                {
                    "_": "Finance",
                    "$": {
                        "domain": "http://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "Vets Helping Vets #2 - Titan FC and The Veterans Sailing Association",
            "datePublished": "Sat, 19 Dec 2015 14:30:00 GMT",
            "description": "In this action packed episode of #NavySEALRadio, David Rutherford explores the powerful impact veterans have helping other veterans.  Our Country is facing massive challenges becuase of the tremendous stress placed on our active duty military personnel and our new veterans after 15 years of combat operations in two theaters. David digs into how the continuation of service can help save lives and make dreams become realities. He welcomes special guest and Marine Lex McMahon from Titan FC to describe how his organization supports vets and their struggle. David also welcomes Navy SEALs Joe Masterangelo and John Beltran from the Veteran's . Don’t miss this incredibly informative show. HOOYAH Saturday September 13th, 2014 at 900 am EST. \r\n\r\nTop Motivational Speaker and Navy SEAL, David Rutherford ignites audiences with his high energy, no nonsense approach to motivating people to succeed in any environment imaginable. As a top Behavioral Training Specialist and Author, David motives people from all walks of life with his motivational philosophy called Froglogic. Derived from 20 years of personal exploration into the human condition David combines his incredible journey with 70 plus years of Navy SEAL operational, training and elite lifestyle performance successes. His masterful ability to inspire enables individuals and teams to forge their Self-Confidence and commit to living a TEAM LIFE.\r\n",
            "length": "57747040",
            "sourceUrl": "https://www.blogtalkradio.com/navysealradio/2015/12/19/vets-helping-vets-2--titan-fc-and-the-veterans-sailing-association.mp3",
            "categories": [
                {
                    "_": "Self Help",
                    "$": {
                        "domain": "http://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "Thanksgiving Special - What are you really thankful for and why?",
            "datePublished": "Sat, 28 Nov 2015 14:30:00 GMT",
            "description": "Get fired up with top motivational speaker David Rutherford as he inspires his audience in this week’s powerful episode on Navy SEAL Radio. David dives the true depths of how being thankful in your daily life can transform your perspective leading to positive results. It's easy to be thankful on a holiday or when something serious happens in life but how do we weave a thankful mindset into our operational mindset. David explains his process and introduces four Froglogic Concepts to get you started. Don’t miss this awesome show. Saturday at 0930 EST. \r\n\r\nTop Navy SEAL Motivational Speaker, Author and Performance Coach, David Rutherford ignites audiences with his high energy, no nonsense approach to motivating people to succeed in any environment imaginable. As a top Behavioral Training Specialist David motives people from all walks of life with his motivational philosophy called Froglogic - A Navy SEAL Motivational Training Program. Derived from 20 years of personal exploration into the human condition David combines his incredible journey with 70 plus years of Navy SEAL operations, training and elite lifestyle performance successes. His masterful ability to inspire enables individuals and teams to Forge Self-Confidence, Live the Team Life, Embrace Fear and Live with Purpose. HOOYAH \r\n",
            "length": "56546661",
            "sourceUrl": "https://www.blogtalkradio.com/navysealradio/2015/11/28/thanksgiving-special--what-are-you-really-thankful-for-and-why.mp3",
            "categories": [
                {
                    "_": "Motivation",
                    "$": {
                        "domain": "http://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "The Internal Battlefield - Learning to Stay In the Fight",
            "datePublished": "Sat, 07 Nov 2015 14:30:00 GMT",
            "description": "We all battle our internal enemies because most often we're our own worst foe. Why does this happen? Because you're simply not adequately prepared for the combat of life. Tune in to this incredible episode of Navy SEAL Radio, as top motivational speaker, author and coach, David Rutherford shares his inspiring message with his listeners. David will share his personal strggle of battling the enemy within and then reveal his profound insight on how he came back to join the fight with purpose. You don't want to miss this show. HOOYAH\r\n\r\nTop Navy SEAL Motivational Speaker, Author and Performance Coach, David Rutherford ignites audiences with his high energy, no nonsense approach to motivating people to succeed in any environment imaginable. As a top Behavioral Training Specialist David motives people from all walks of life with his motivational philosophy called Froglogic - A Navy SEAL Motivational Training Program. Derived from 20 years of personal exploration into the human condition David combines his incredible journey with 70 plus years of Navy SEAL operations, training and elite lifestyle performance successes. His masterful ability to inspire enables individuals and teams to Forge Self-Confidence, Live the Team Life, Embrace Fear and Live with Purpose. HOOYAH \r\n",
            "length": "56850936",
            "sourceUrl": "https://www.blogtalkradio.com/navysealradio/2015/11/07/the-internal-battlefield--learning-to-stay-in-the-fight.mp3",
            "categories": [
                {
                    "_": "Self Help",
                    "$": {
                        "domain": "http://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "Navy SEAL Training - No Pain, No Gain",
            "datePublished": "Sat, 03 Oct 2015 13:30:00 GMT",
            "description": "Are you ready to feel the pain? Why not? In this high impact episode of Navy SEAL Radio, host David Rutherford explores the power of pain as it relates to enhancing performance and acheiving success. David dives into the harsh world of Special Operations training and how it generates the worlds most elite performers. David relives his own incredible pain and inspires his audience to get off their butts to experience their own level of pain. He delives four Froglogic Concepts to help guide the listener into the right program for them. Don't miss this epic show so you too can begin to live for the pain. HOOYAH\r\n\r\nTop Navy SEAL Motivational Speaker, Author and Performance Coach, David Rutherford ignites audiences with his high energy, no nonsense approach to motivating people to succeed in any environment imaginable. As a top Behavioral Training Specialist David motives people from all walks of life with his motivational philosophy called Froglogic - A Navy SEAL Motivational Training Program. Derived from 20 years of personal exploration into the human condition David combines his incredible journey with 70 plus years of Navy SEAL operations, training and elite lifestyle performance successes. His masterful ability to inspire enables individuals and teams to Forge Self-Confidence, Live the Team Life, Embrace Fear and Live with Purpose. HOOYAH \r\n",
            "length": "57167331",
            "sourceUrl": "https://www.blogtalkradio.com/navysealradio/2015/10/03/navy-seal-training--no-pain-no-gain.mp3",
            "categories": [
                {
                    "_": "Motivation",
                    "$": {
                        "domain": "http://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "Navy SEAL Training - The Essence of Endurance with Special Guest Nik Hawks",
            "datePublished": "Sat, 05 Sep 2015 13:30:00 GMT",
            "description": "In this pivitol episode of Navy SEAL Radio, top motivational speaker and coach, David Rutherford explains where the essence of endurance comes from and how to maintain it. David delivers a heavy dose of truth to listeners regarding what true endurance is all about. He discusses his days a Navy SEAL Medic and as an Instructor. He also outlines a clear way to begin getting your endurance on the right track. David will have special guest Nik Hawks, Leadville 100 ultra mathathoner, and awesome small businessman and owner of the number one desert company in the paleo space called Paleo Treats. Don't miss David and Nik's as they explain what it takes to endure in the most extreme environments in the world. Wake up to the high energy wake up call on Saturday at 0930 EST. HOOYAH\r\n\r\nTop Navy SEAL Motivational Speaker, Author and Performance Coach, David Rutherford ignites audiences with his high energy, no nonsense approach to motivating people to succeed in any environment imaginable. As a top Behavioral Training Specialist David motives people from all walks of life with his motivational philosophy called Froglogic - A Navy SEAL Motivational Training Program. Derived from 20 years of personal exploration into the human condition David combines his incredible journey with 70 plus years of Navy SEAL operations, training and elite lifestyle performance successes. His masterful ability to inspire enables individuals and teams to Forge Self-Confidence, Live the Team Life, Embrace Fear and Live with Purpose. HOOYAH \r\n",
            "length": "57546002",
            "sourceUrl": "https://www.blogtalkradio.com/navysealradio/2015/09/05/navy-seal-training--the-essence-of-endurance-with-special-guest-nik-hawks.mp3",
            "categories": [
                {
                    "_": "Motivation",
                    "$": {
                        "domain": "http://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "Limitations - The Lies Outside Us and The Truth Within",
            "datePublished": "Sat, 01 Aug 2015 13:30:00 GMT",
            "description": "Get fired up with top motivational speaker and Behavioral Training Specialist David Rutherford as he insires his audience in this week’s powerful episode on Navy SEAL Radio. David explores limitations and how destructive they can be in our lives. He digs into the lies and truths behind limits and what you can do to destroy your perception of self-imposed limits. David dives into his experiences in the SEAL Teams in order to help listeners understand their true potential. David will also outline a detailed plan of attack using his motivational training program, Froglogic to help you begin tearning down the limits in your life. Don’t miss this awesome show. Saturday at 0930 EST. \r\n\r\nTop Navy SEAL Motivational Speaker, Author and Performance Coach, David Rutherford ignites audiences with his high energy, no nonsense approach to motivating people to succeed in any environment imaginable. As a top Behavioral Training Specialist David motives people from all walks of life with his motivational philosophy called Froglogic - A Navy SEAL Motivational Training Program. Derived from 20 years of personal exploration into the human condition David combines his incredible journey with 70 plus years of Navy SEAL operations, training and elite lifestyle performance successes. His masterful ability to inspire enables individuals and teams to Forge Self-Confidence, Live the Team Life, Embrace Fear and Live with Purpose. HOOYAH \r\n",
            "length": "56638194",
            "sourceUrl": "https://www.blogtalkradio.com/navysealradio/2015/08/01/limitations--the-lies-outside-us-and-the-truth-within.mp3",
            "categories": [
                {
                    "_": "Motivation",
                    "$": {
                        "domain": "http://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "4th of July Special - What Does America Stand For?",
            "datePublished": "Sat, 04 Jul 2015 13:30:00 GMT",
            "description": "In this patriotic episode of Navy SEAL Radio, David Rutherford will ignite your patriotic attitude about America. David highlights the very things that have gotten our great Nation to where we are today. He also outlines some very specific Froglogic concepts to help you enhance your beliefs in what we stand for and how to keep the American Dream alive and kicking Catch this awesome show LIVE Saturday monring the 4th of July, 2015. HOOYAH\r\n\r\nTop Navy SEAL Motivational Speaker, Author and Performance Coach, David Rutherford ignites audiences with his high energy, no nonsense approach to motivating people to succeed in any environment imaginable. As a top Behavioral Training Specialist David motives people from all walks of life with his motivational philosophy called Froglogic - A Navy SEAL Motivational Training Program. Derived from 20 years of personal exploration into the human condition David combines his incredible journey with 70 plus years of Navy SEAL operations, training and elite lifestyle performance successes. His masterful ability to inspire enables individuals and teams to Forge Self-Confidence, Live the Team Life, Embrace Fear and Live with Purpose. HOOYAH \r\n",
            "length": "57100875",
            "sourceUrl": "https://www.blogtalkradio.com/navysealradio/2015/07/04/4th-of-july-special--what-does-america-stand-for.mp3",
            "categories": [
                {
                    "_": "Motivation",
                    "$": {
                        "domain": "http://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "Father's Day Special - \"Become a Man\" with SEAL Author, Derrick Van Orden",
            "datePublished": "Sat, 20 Jun 2015 13:30:00 GMT",
            "description": "In this Father's Day special episode top motivational speaker and host, David Rutherford introduces his audience to the finer points of becoming a man. David explores most shortfalls that get men into trouble and delivers his Froglogic concepts to help end this disastrous behavior. In the second half of the show he welcomes teammate and author Derrick Van Orden to help explain how their experience as Navy SEALs set them up for success as a man. Derrick is a 26 year combat veteran of the Teams and recently released his first book titled \"Book of Man, a Navy SEALs guide to the lost art of Manhood\". Listen in to this awesome show and discover how to live like a Man. Tune in LIVE Saturday at 0930 EST.HOOYAH\r\n",
            "length": "57652999",
            "sourceUrl": "https://www.blogtalkradio.com/navysealradio/2015/06/20/fathers-day-special--become-a-man-with-seal-author-derrick-van-orden.mp3",
            "categories": [
                {
                    "_": "Motivation",
                    "$": {
                        "domain": "http://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "Memorial Day Tribute - Why I was willing to die for my Teammates and America.",
            "datePublished": "Sat, 23 May 2015 13:30:00 GMT",
            "description": "In this heartfelt episode of Navy SEAL Radio, Navy SEAL David Rutherford explores the magnitude of sacrifice American men and women have made of this great nation. David digs into his reasons for serving and his willingness to die for the country in order to protect our way of life. He also outlines some very specific Froglogic concepts to help you better appreciate how to honor the memories of all those who've paid the ultimate sacrifice and died for America. Don't miss this incredibly Memorial Day special show. HOOYAH Tune in live this Saturday at 0930 EST. \r\n\r\nTop Navy SEAL Motivational Speaker, Author and Performance Coach, David Rutherford ignites audiences with his high energy, no nonsense approach to motivating people to succeed in any environment imaginable. As a top Behavioral Training Specialist David motives people from all walks of life with his motivational philosophy called Froglogic - A Navy SEAL Motivational Training Program. Derived from 20 years of personal exploration into the human condition David combines his incredible journey with 70 plus years of Navy SEAL operations, training and elite lifestyle performance successes. His masterful ability to inspire enables individuals and teams to Forge Self-Confidence, Live the Team Life, Embrace Fear and Live with Purpose. HOOYAH \r\n",
            "length": "56679990",
            "sourceUrl": "https://www.blogtalkradio.com/navysealradio/2015/05/23/memorial-day-tribute--why-were-willing-to-die-for-america.mp3",
            "categories": [
                {
                    "_": "Motivation",
                    "$": {
                        "domain": "http://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "Your Accountable Life",
            "datePublished": "Sat, 02 May 2015 13:30:00 GMT",
            "description": "In this uplifting episode of Navy SEAL Radio, host David Rutherford powerfully describes the power of accountability. David ask several key questions that everyone need to ask themselves on a regular basis. As a top behavioral training specialist he outlines four Froglogic Concepts to help you begin living an acountable life. Don't miss this amazing hour of live radio. HOOYAH\r\n\r\nTop Navy SEAL Motivational Speaker, Author and Performance Coach, David Rutherford ignites audiences with his high energy, no nonsense approach to motivating people to succeed in any environment imaginable. As a top Behavioral Training Specialist David motives people from all walks of life with his motivational philosophy called Froglogic - A Navy SEAL Motivational Training Program. Derived from 20 years of personal exploration into the human condition David combines his incredible journey with 70 plus years of Navy SEAL operations, training and elite lifestyle performance successes. His masterful ability to inspire enables individuals and teams to Forge Self-Confidence, Live the Team Life, Embrace Fear and Live with Purpose. HOOYAH \r\n",
            "length": "57312363",
            "sourceUrl": "https://www.blogtalkradio.com/navysealradio/2015/05/02/your-accountable-life.mp3",
            "categories": [
                {
                    "_": "Motivation",
                    "$": {
                        "domain": "http://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "The Easter Mission",
            "datePublished": "Sat, 04 Apr 2015 12:30:00 GMT",
            "description": "In this Easter episode of Navy SEAL Radio, host David Rutherford defines the critical lessons we can learn from the meaning of Easter and how these lessons can give us a mission to follow in life. David brings light to the dark space of negativity and gives his audience the tools to embrace their fears and endure lifes hardship by finding something to believe in. Don't miss this powerful show, tune in Saturday April 4th at 0830 am EST. HOOYAH\r\n\r\nTop Navy SEAL Motivational Speaker, Author and Performance Coach, David Rutherford ignites audiences with his high energy, no nonsense approach to motivating people to succeed in any environment imaginable. As a top Behavioral Training Specialist David motives people from all walks of life with his motivational philosophy called Froglogic - A Navy SEAL Motivational Training Program. Derived from 20 years of personal exploration into the human condition David combines his incredible journey with 70 plus years of Navy SEAL operations, training and elite lifestyle performance successes. His masterful ability to inspire enables individuals and teams to forge their Self-Confidence, Live the Team Life, Embrace their Fears and Live with Purpose. HOOYAH \r\n",
            "length": "53989169",
            "sourceUrl": "https://www.blogtalkradio.com/navysealradio/2015/04/04/the-easter-mission.mp3",
            "categories": [
                {
                    "_": "Religion",
                    "$": {
                        "domain": "http://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "Vets Helping Vets - Mobile Aerofest  - Interview with Lex McMahon",
            "datePublished": "Sat, 14 Mar 2015 13:30:00 GMT",
            "description": "In this uplifting episode of Navy SEAL Radio, top motivational speaker David Rutherford highlights one of the greatest Veterans festivals in America, the Mobile Aerofestival. David takes a deep look into the incredible coalition of forces that have come together to support veterans and their transition into civilian life. He explores why the need for this type of festival exist and then interviews one of the events founders, Lex McMahon. Lex, a former Marine himself, who served in Somalia has become a very successful promoter and manager in the MMA fight world. Listen to these two vets get super fired up about why they have to help other vets. Temper Fi, HOOYAH \r\n\r\nTop Motivational Speaker and Navy SEAL, David Rutherford ignites audiences with his high energy, no nonsense approach to motivating people to succeed in any environment imaginable. As a top Behavioral Training Specialist and Author, David motives people from all walks of life with his motivational philosophy called Froglogic. Derived from 20 years of personal exploration into the human condition David combines his incredible journey with 70 plus years of Navy SEAL operational, training and elite lifestyle performance successes. His masterful ability to inspire enables individuals and teams to Froge Self-Confidence, Embrace Fear,  Live The TEAM LIFE and Live With Purpose.\r\n",
            "length": "57629594",
            "sourceUrl": "https://www.blogtalkradio.com/navysealradio/2015/03/14/vets-helping-vets--mobile-aerofest--interview-with-lex-mcmahon.mp3",
            "categories": [
                {
                    "_": "Motivation",
                    "$": {
                        "domain": "http://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "What is Vintage Hard?",
            "datePublished": "Sat, 28 Feb 2015 14:30:00 GMT",
            "description": "In this Hard Core episode of Navy SEAL Radio, top motivational speaker and performance coach David Rutherford pounds out the meaning of being Vintage Hard. David explores American History and looks at the incredible people, places and things that helped forge the unbreakable American Spirit. From the Revolutionary War to Vietnam, Americans have been crushing themselves in their epic commitment to supporting Freedom and Democracy around the world. Tune into this epic show and discover how to start living a Vintage Hard lifestyle. HOOYAH\r\n\r\nTop Motivational Speaker and Navy SEAL, David Rutherford ignites audiences with his high energy, no nonsense approach to motivating people to succeed in any environment imaginable. As a top Behavioral Training Specialist and Author, David motives people from all walks of life with his motivational philosophy called Froglogic. Derived from 20 years of personal exploration into the human condition David combines his incredible journey with 70 plus years of Navy SEAL operational, training and elite lifestyle performance successes. His masterful ability to inspire enables individuals and teams to Froge Self-Confidence, Embrace Fear,  Live The TEAM LIFE and Live With Purpose.\r\n",
            "length": "58631442",
            "sourceUrl": "https://www.blogtalkradio.com/navysealradio/2015/02/28/what-is-vintage-hard.mp3",
            "categories": [
                {
                    "_": "Motivation",
                    "$": {
                        "domain": "http://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "The Definition of Sacrifice",
            "datePublished": "Sat, 14 Feb 2015 14:30:00 GMT",
            "description": "Get fired up with top motivational speaker and Behavioral Training Specialist David Rutherford as he ignites his audience in this week’s powerful episode on Navy SEAL Radio. David lays out the true definition of Sacrifice. He explains why learning to sacrifice will help you succeed in every environment imaginable. David dives into his experiences in the SEAL Teams in order to help listeners understand their true potential. David will also outline a detailed plan of attack using his motivational training program, Froglogic to help you begin making the right sacrifices today. Don’t miss this awesome show. Saturday at 0930 EST. \r\n\r\nTop Navy SEAL Motivational Speaker, Author and Performance Coach, David Rutherford ignites audiences with his high energy, no nonsense approach to motivating people to succeed in any environment imaginable. As a top Behavioral Training Specialist David motives people from all walks of life with his motivational philosophy called Froglogic - A Navy SEAL Motivational Training Program. Derived from 20 years of personal exploration into the human condition David combines his incredible journey with 70 plus years of Navy SEAL operations, training and elite lifestyle performance successes. His masterful ability to inspire enables individuals and teams to Forge Self-Confidence, Live the Team Life, Embrace Fear and Live with Purpose. HOOYAH \r\n",
            "length": "57712768",
            "sourceUrl": "https://www.blogtalkradio.com/navysealradio/2015/02/14/the-definition-of-sacrifice.mp3",
            "categories": [
                {
                    "_": "Motivation",
                    "$": {
                        "domain": "http://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "American Sniper - Part 2 - Movie Review & Interview with Author Scott McEwen",
            "datePublished": "Sun, 18 Jan 2015 16:00:00 GMT",
            "description": "In the second part of a two part series on Navy SEAL Radio, Navy SEAL author David Rutherford reviews the blockbuster new movie American Sniper, the true story of America's greatest sniper, Chris Kyle. In this episode David welcomes best selling author of the book American Sniper Scott McEwen. Scott was close friends with Chris and helps all American's realize the power of The Legend. Listen to the amazing insight of how the story cames about why it's so important in US history. Don't miss this show! HOOYAH #NavySEALRadio Saturday’s at 930 am EST. \r\n\r\nTop Motivational Speaker and Navy SEAL, David Rutherford ignites audiences with his high energy, no nonsense approach to motivating people to succeed in any environment imaginable. As a top Behavioral Training Specialist and Author, David motives people from all walks of life with his motivational philosophy called Froglogic. Derived from 20 years of personal exploration into the human condition David combines his incredible journey with 70 plus years of Navy SEAL operational, training and elite lifestyle performance successes. His masterful ability to inspire enables individuals and teams to Forge Self-Confidence, Live The Team Life, Embrace Fear and Live With Purpose. \r\n",
            "length": "57511729",
            "sourceUrl": "https://www.blogtalkradio.com/navysealradio/2015/01/18/american-sniper--part-2--movie-review-interview-with-author-scott-mcewen.mp3",
            "categories": [
                {
                    "_": "Entertainment",
                    "$": {
                        "domain": "http://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "American Sniper -  Movie Review and Interview with Navy SEAL, Kevin Lacz - Part",
            "datePublished": "Sat, 17 Jan 2015 14:30:00 GMT",
            "description": "In this powerful episode of Navy SEAL Radio, behavioral training expert David Rutherford reviews the blockbuster new movie American Sniper, the true story of America's greatest sniper, Chris Kyle. He will review the movie and take a hard look at how serving one's country can play a devastating role in the lives of the Veteran and their families. He also welcomes, Navy SEAL and co-star in the new Clint Eastwood and Bradley Cooper Movie American Sniper, Kevin Lacz. Kevin is a decorated veteran who has numerous combat deployments to Iraq. He will share is expert insight on the truth about fear. Fear is a part of us all, you don’t want to miss this episode. HOOYAH #NavySEALRadio Saturday’s at 930 am EST. \r\n\r\nTop Motivational Speaker and Navy SEAL, David Rutherford ignites audiences with his high energy, no nonsense approach to motivating people to succeed in any environment imaginable. As a top Behavioral Training Specialist and Author, David motives people from all walks of life with his motivational philosophy called Froglogic. Derived from 20 years of personal exploration into the human condition David combines his incredible journey with 70 plus years of Navy SEAL operational, training and elite lifestyle performance successes. His masterful ability to inspire enables individuals and teams to Forge Self-Confidence, Live The Team Life, Embrace Fear and Live With Purpose. \r\n",
            "length": "57419778",
            "sourceUrl": "https://www.blogtalkradio.com/navysealradio/2015/01/17/american-sniper--movie-review-and-interview-with-navy-seal-kevin-lacz--part.mp3",
            "categories": [
                {
                    "_": "Movies",
                    "$": {
                        "domain": "http://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "The Ultimate New Year's Resolution Show! With Navy SEAL David Rutherford",
            "datePublished": "Sat, 03 Jan 2015 14:30:00 GMT",
            "description": "Are you ready to start your NEW YEAR off with BANG? Then don’t miss this epic episode of Navy SEAL Radio with top motivational speaker and performance coach David Rutherford. David will ignite your New Year’s resolution like never before. He outlines the absolute guide to staying true to your goals and teaches his listeners the Froglogic Concepts in order to make their dreams come true. Let David help you create the ultimate New Year’s resolution. Tune in Saturday January 3rd 2015 at 0930 EST. HOOYAH\r\n\r\nTop Navy SEAL Motivational Speaker, Author and Performance Coach, David Rutherford ignites audiences with his high energy, no nonsense approach to motivating people to succeed in any environment imaginable. As a top Behavioral Training Specialist David motives people from all walks of life with his motivational philosophy called Froglogic - A Navy SEAL Motivational Training Program. Derived from 20 years of personal exploration into the human condition David combines his incredible journey with 70 plus years of Navy SEAL operations, training and elite lifestyle performance successes. His masterful ability to inspire enables individuals and teams to forge their Self-Confidence, Live the Team Life, Embrace their Fears and Live with Purpose. HOOYAH \r\n",
            "length": "57360010",
            "sourceUrl": "https://www.blogtalkradio.com/navysealradio/2015/01/03/the-ultimate-new-years-resolution-show-with-navy-seal-david-rutherford.mp3",
            "categories": [
                {
                    "_": "Self Help",
                    "$": {
                        "domain": "http://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "The Real Meaning of Christmas is.....",
            "datePublished": "Sat, 20 Dec 2014 14:30:00 GMT",
            "description": "During this holiday season ask yourself what the true meaning of Christmas is all about. In this uplifting episode of Navy SEAL Radio, motivational speaker David Rutherford explores the negative stresses of the holiday season and helps listeners to discover the true meaning of Christmas. Using his Froglogic motivational training and years of behavioral research David opens the doors to the power of serving others. This show will motivate your whole family. HO HO HOOYAH. Saturday morning at 0930 EST. \r\n\r\nTop Navy SEAL Motivational Speaker, Author and Performance Coach, David Rutherford ignites audiences with his high energy, no nonsense approach to motivating people to succeed in any environment imaginable. As a top Behavioral Training Specialist David motives people from all walks of life with his motivational philosophy called Froglogic - A Navy SEAL Motivational Training Program. Derived from 20 years of personal exploration into the human condition David combines his incredible journey with 70 plus years of Navy SEAL operations, training and elite lifestyle performance successes. His masterful ability to inspire enables individuals and teams to forge their Self-Confidence, Live the Team Life, Embrace their Fears and Live with Purpose. HOOYAH \r\n",
            "length": "57445692",
            "sourceUrl": "https://www.blogtalkradio.com/navysealradio/2014/12/20/the-real-meaning-of-christmas-is.mp3",
            "categories": [
                {
                    "_": "Self Help",
                    "$": {
                        "domain": "http://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "Rising From The Ashes - Battling Back From Adversity",
            "datePublished": "Sat, 06 Dec 2014 14:30:00 GMT",
            "description": "Get fired up with top motivational speaker and Behavioral Training Specialist David Rutherford as he ignites his audience in this week’s powerful episode on Navy SEAL Radio. David helps individuals and teams rise from the ashes by helping realize the power of overcoming adversity. He tells incredibly moving stories about his unique journey and what it took to get back in the fight. David will also outline a detailed plan of attack using his motivational training program, Froglogic to help you begin rising from the ashes. Don’t miss this motivating show. Every Saturday at 0930 EST. \r\n\r\nTop Navy SEAL Motivational Speaker, Author and Performance Coach, David Rutherford ignites audiences with his high energy, no nonsense approach to motivating people to succeed in any environment imaginable. As a top Behavioral Training Specialist David motives people from all walks of life with his motivational philosophy called Froglogic - A Navy SEAL Motivational Training Program. Derived from 20 years of personal exploration into the human condition David combines his incredible journey with 70 plus years of Navy SEAL operations, training and elite lifestyle performance successes. His masterful ability to inspire enables individuals and teams to Forge Self-Confidence, Live the Team Life, Embrace Fear and Live with Purpose. HOOYAH \r\n",
            "length": "57319886",
            "sourceUrl": "https://www.blogtalkradio.com/navysealradio/2014/12/06/rising-from-the-ashes--battling-back-from-adversity.mp3",
            "categories": [
                {
                    "_": "Self Help",
                    "$": {
                        "domain": "http://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "The Negative Insurgency - Waging War Against Negativity",
            "datePublished": "Sat, 22 Nov 2014 14:30:00 GMT",
            "description": "In this powerful episode of Navy SEAL Radio, top motivational speaker and host David Rutherford attacks the greatest problem of our time, the Negative Insurgency. The perpetual state of negativity has woven itself into every fabric of our society. We are under attack from this epidemic. It’s in the media, it’s in our schools, its in our dialogue, it’s in our own minds. The Negative Insurgency is on the move and David is going to teach you how to defeat it in your life. He lays out the prefect Froglogic plan for you to use the power of positivity to confront this enemy head on. Don’t miss this high energy, totally motivating show this Saturday at 0930 EST. \r\n\r\nTop Navy SEAL Motivational Speaker, Author and Performance Coach, David Rutherford ignites audiences with his high energy, no nonsense approach to motivating people to succeed in any environment imaginable. As a top Behavioral Training Specialist David motives people from all walks of life with his motivational philosophy called Froglogic - A Navy SEAL Motivational Training Program. Derived from 20 years of personal exploration into the human condition David combines his incredible journey with 70 plus years of Navy SEAL operations, training and elite lifestyle performance successes. His masterful ability to inspire enables individuals and teams to forge their Self-Confidence, Live the Team Life, Embrace their Fears and Live with Purpose. HOOYAH \r\n",
            "length": "57416434",
            "sourceUrl": "https://www.blogtalkradio.com/navysealradio/2014/11/22/the-negative-insurgency--waging-war-against-negativity.mp3",
            "categories": [
                {
                    "_": "Motivation",
                    "$": {
                        "domain": "http://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "The Jericho Mile - The endless march away from apathy towards empathy.",
            "datePublished": "Sat, 01 Nov 2014 13:30:00 GMT",
            "description": "In this authentic and inspiring episode, top Behavioral Training Expert and life coach David Rutherford describes what it means to walk The Jericho Mile. David's incredibly unique life experience has taught him the very real truth behind the devestating effects of living with apathy and lacking drive. In this high energy hour of radio he shares his \"Real World\" views on this critical subject matter. David also outlines four Froglogic concepts to help get listeners on the right path towards walking The Jericho Mile.  David includes lessons learned from the Navy SEAL Teams, as a Combat Medic, International Training Expert, Author for kids and adults and as one of the top motivational speakers in America  to help explain the power and rewards of learning to walk The Mile. Don’t miss this highly motivational and inspiring show. Saturday at 930 am EST. HOOYAH\r\n\r\nTop Navy SEAL Motivational Speaker, Author and Performance Coach, David Rutherford ignites audiences with his high energy, no nonsense approach to motivating people to succeed in any environment imaginable. As a top Behavioral Training Specialist David motives people from all walks of life with his motivational philosophy called Froglogic - A Navy SEAL Motivational Training Program. Derived from 20 years of personal exploration into the human condition David combines his incredible journey with 70 plus years of Navy SEAL operations, training and elite lifestyle performance successes. His masterful ability to inspire enables individuals and teams to forge their Self-Confidence, Live the Team Life, Embrace their Fears and Live with Purpose. HOOYAH \r\n",
            "length": "56792839",
            "sourceUrl": "https://www.blogtalkradio.com/navysealradio/2014/11/01/the-jericho-mile--the-endless-march-away-from-apathy-towards-empathy.mp3",
            "categories": [
                {
                    "_": "Self Help",
                    "$": {
                        "domain": "http://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "Forging Self-Confidence - Mission 4: Earn Respect",
            "datePublished": "Sat, 18 Oct 2014 13:30:00 GMT",
            "description": "In this episode David introduces his audience to the four steps they can use to learn how to Earn Respect every day of their lives. We all seek the respect of our family, friedns and peers, but do you really know how to acheive this goal? He will be recruiting you, his new teammates for your help defining this critical concept behind human success. Change your way of thinking by enlisting David to become your new motivational swim buddy. HOOYAH!\r\n\r\nTop Motivational Speaker and Navy SEAL, David Rutherford ignites audiences with his high energy, no nonsense approach to motivating people to succeed in any environment imaginable. As a top Behavioral Training Specialist and Author, David motives people from all walks of life with his motivational philosophy called Froglogic. Derived from 20 years of personal exploration into the human condition David combines his incredible journey with 70 plus years of Navy SEAL operational, training and elite lifestyle performance successes. His masterful ability to inspire enables individuals and teams to forge their Self-Confidence and commit to living a TEAM LIFE.\r\n\r\n \r\n",
            "length": "62254730",
            "sourceUrl": "https://www.blogtalkradio.com/navysealradio/2014/10/18/forging-self-confidence--mission-4-earn-respect.mp3",
            "categories": [
                {
                    "_": "Motivation",
                    "$": {
                        "domain": "http://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "Becoming a Warrior Poet - What it takes and why it's important.",
            "datePublished": "Sat, 11 Oct 2014 13:30:00 GMT",
            "description": "In this inspiring episode, top Behavioral Training Expert and elite performance coach David Rutherford describes what it takes to live life as a true Warrior Poet. He describes his incredible life experience and outlines four Froglogic concepts to help get listeners on the right path to success.  David includes the tested and proven experiences of the Navy SEAL Teams to help explain the benefits of living life through the eyes of both warrior and artist. Don’t miss this highly motivational and inspiring show. Saturday at 930 am EST. HOOYAH\r\n\r\nTop Navy SEAL Motivational Speaker, Author and Performance Coach, David Rutherford ignites audiences with his high energy, no nonsense approach to motivating people to succeed in any environment imaginable. As a top Behavioral Training Specialist David motives people from all walks of life with his motivational philosophy called Froglogic - A Navy SEAL Motivational Training Program. Derived from 20 years of personal exploration into the human condition David combines his incredible journey with 70 plus years of Navy SEAL operations, training and elite lifestyle performance successes. His masterful ability to inspire enables individuals and teams to forge their Self-Confidence, Live the Team Life, Embrace their Fears and Live with Purpose. HOOYAH \r\n",
            "length": "57510057",
            "sourceUrl": "https://www.blogtalkradio.com/navysealradio/2014/10/11/becoming-a-warrior-poet--what-it-takes-and-why-its-important.mp3",
            "categories": [
                {
                    "_": "Motivation",
                    "$": {
                        "domain": "http://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "Vets Helping Vets - Serket Racing working with Navy SEAL Museum",
            "datePublished": "Sat, 13 Sep 2014 13:30:00 GMT",
            "description": "In this action packed episode of #NavySEALRadio, David Rutherford explores the powerful impact veterans helping other veterans has on the massive problems facing our Vets today. David digs into why the continuation of service can help save lives and make dreams become realities. He welcomes special guest Marine Race Car driver Mark Llano from Serket Racing along with Navy SEAL Hector Delgado from the UDT/SEAL Museum to discuss the necessity and function behind working together. Don’t miss this incredibly informative show. HOOYAH Saturday September 13th, 2014 at 900 am EST. \r\n\r\nTop Motivational Speaker and Navy SEAL, David Rutherford ignites audiences with his high energy, no nonsense approach to motivating people to succeed in any environment imaginable. As a top Behavioral Training Specialist and Author, David motives people from all walks of life with his motivational philosophy called Froglogic. Derived from 20 years of personal exploration into the human condition David combines his incredible journey with 70 plus years of Navy SEAL operational, training and elite lifestyle performance successes. His masterful ability to inspire enables individuals and teams to forge their Self-Confidence and commit to living a TEAM LIFE.\r\n",
            "length": "14403872",
            "sourceUrl": "https://www.blogtalkradio.com/navysealradio/2014/09/13/vets-helping-vets--serket-racing-working-with-navy-seal-museum.mp3",
            "categories": [
                {
                    "_": "Entrepreneur",
                    "$": {
                        "domain": "http://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "TBI - Traumatic Brain Injury - Exploring HBOT, Hyperbaric Oxygen Therapy",
            "datePublished": "Sat, 06 Sep 2014 13:30:00 GMT",
            "description": "In this powerful episode behavioral training specialist and coach David Rutherford explores the devastating effects of TBI Traumatic Brain Injury and how it’s affected veterans across America. David explores the physiology and psychology behind dealing with this debilitating injury. He takes a closer look at Hyperbaric Oxygen Therapy or HBOT, a controversial way of treating this problem. David welcomes renowned physical therapist and Vietnam Vet Ray Cralle to the show to discuss the science  and successes behind HBOT. Also on the show is Veterans activist and Gold Star Mother, Debbie Lee. Don’t miss this informative and touching show on Navy SEAL Radio. Saturday the 6th of September at 930 am EST.  \r\n\r\nTop Motivational Speaker and Navy SEAL, David Rutherford ignites audiences with his high energy, no nonsense approach to motivating people to succeed in any environment imaginable. As a top Behavioral Training Specialist and Author, David motives people from all walks of life with his motivational philosophy called Froglogic. Derived from 20 years of personal exploration into the human condition David combines his incredible journey with 70 plus years of Navy SEAL operational, training and elite lifestyle performance successes. His masterful ability to inspire enables individuals and teams to forge their Self-Confidence and commit to living a TEAM LIFE.\r\n",
            "length": "14407040",
            "sourceUrl": "https://www.blogtalkradio.com/navysealradio/2014/09/06/tbi--traumatic-brain-injury--exploring-hbot-hyperbaric-oxygen-therapy.mp3",
            "categories": [
                {
                    "_": "Health",
                    "$": {
                        "domain": "http://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "Veteran Entrepreneur Series - Evan Hafer and Twistrate - Crowdsoucing for Vets",
            "datePublished": "Sat, 30 Aug 2014 13:30:00 GMT",
            "description": "In this informative and inspiring episode, top Behavioral Training Expert and entrepreneur David Rutherford discusses entrepreneurship and the positive impact veterans can have on the American workplace. David describes his exciting journey towards discovering his true passion in life and turning it into a successful business. David also welcomes successful veteran entrepreneur and Green Beret, Evan Hafer. Together they discuss Evan’s fantastic new venture, Twistrate, a crowdsource for the tactical world. Don’t miss this highly educational and motivational show. Saturday at 930 am EST. HOOYAH\r\n\r\nTop Motivational Speaker and Navy SEAL, David Rutherford ignites audiences with his high energy, no nonsense approach to motivating people to succeed in any environment imaginable. As a top Behavioral Training Specialist and Author, David motives people from all walks of life with his motivational philosophy called Froglogic. Derived from 20 years of personal exploration into the human condition David combines his incredible journey with 70 plus years of Navy SEAL operational, training and elite lifestyle performance successes. His masterful ability to inspire enables individuals and teams to forge their Self-Confidence and commit to living a TEAM LIFE.\r\n",
            "length": "13934720",
            "sourceUrl": "https://www.blogtalkradio.com/navysealradio/2014/08/30/veteran-entrepreneur-series--evan-hafer-and-twistrate--crowdsoucing-for-vets.mp3",
            "categories": [
                {
                    "_": "Entrepreneur",
                    "$": {
                        "domain": "http://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "Embrace Fear - Mission 5 - Live with Courage - With \"Fearless\" Author Eric Blehm",
            "datePublished": "Sat, 09 Aug 2014 13:30:00 GMT",
            "description": "In this heart felt episode of Navy SEAL Radio, behavioral training expert David Rutherford releases the 6th show in a 6 part series on learning to embrace your fears. As a Navy SEAL Medic, top motivational speaker and behavioral training expert David has experienced Fear on every level. He introduces his listeners to the hidden truths about fear and how to harness fear in order to succeed in every physical, mental and spiritual environment imaginable. David clearly describes how to alter your way of thinking and introduces the four steps of Mission 5: Live With Courage.  This week's special guest, New York Times best selling writer of the the book \"Fearless, The Adam Brown Story, Eric Blehm. Eric is responsible for wrtting one of the best Navy SEAL Books ever written. He will share his blessed insight on SEAL Team 6 Operator Adam Brown. Listen how this amazing Christian, Father, Husband, Son and Teammate helped everyone in his life learn to embrace their fears. Fear is a part of us all, you don’t want to miss this episode. HOOYAH #NavySEALRadio Saturday’s at 930 am EST. \r\n\r\nTop Motivational Speaker and Navy SEAL, David Rutherford ignites audiences with his high energy, no nonsense approach to motivating people to succeed in any environment imaginable. As a top Behavioral Training Specialist and Author, David motives people from all walks of life with his motivational philosophy called Froglogic. Derived from 20 years of personal exploration into the human condition David combines his incredible journey with 70 plus years of Navy SEAL operational, training and elite lifestyle performance successes. His masterful ability to inspire enables individuals and teams to forge their Self-Confidence and commit to living a TEAM LIFE.\r\n",
            "length": "14434112",
            "sourceUrl": "https://www.blogtalkradio.com/navysealradio/2014/08/09/embrace-fear--mission-5--live-with-courage--with-fearless-author-eric-blehm.mp3",
            "categories": [
                {
                    "_": "Motivation",
                    "$": {
                        "domain": "http://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "Embrace Your Fears - Mission 4: Test Yourself with Navy SEAL, Crossfit Box Owner",
            "datePublished": "Sat, 02 Aug 2014 13:30:00 GMT",
            "description": "In this epic episode of Navy SEAL Radio, behavioral training expert David Rutherford releases the 5th show in a 6 part series on learning to embrace your fears. As a top motivational speaker and behavioral training expert David has experienced Fear on every level. He introduces his listeners to the hidden truths about Fear and how to harness fear in order to succeed in life. David clearly describes how to alter your way of thinking and introduces the four steps of Mission 4: Test Yourself.  This week's special guest, fromer Navy SEAL, and owner of the legendary Crossfit Bellevue Box, Dan Cerrillo. Dan is a hard nosed combat veteran who knows training. He will share is expert insight on human performance and how testing yourself is the only way to understand what your truly afraid of. Fear is a part of us all, you don’t want to miss this episode. HOOYAH #NavySEALRadio Saturday’s at 930 am EST. \r\n\r\nTop Motivational Speaker and Navy SEAL, David Rutherford ignites audiences with his high energy, no nonsense approach to motivating people to succeed in any environment imaginable. As a top Behavioral Training Specialist and Author, David motives people from all walks of life with his motivational philosophy called Froglogic. Derived from 20 years of personal exploration into the human condition David combines his incredible journey with 70 plus years of Navy SEAL operational, training and elite lifestyle performance successes. His masterful ability to inspire enables individuals and teams to forge their Self-Confidence and commit to living a TEAM LIFE.\r\n",
            "length": "14424032",
            "sourceUrl": "https://www.blogtalkradio.com/navysealradio/2014/08/02/embrace-your-fears--mission-4-test-yourself-with-navy-seal-crossfit-box-owner.mp3",
            "categories": [
                {
                    "_": "Motivation",
                    "$": {
                        "domain": "http://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "Embrace Your Fears - Mission 3: Retrain Your Brain with SEAL Performance Coach",
            "datePublished": "Sat, 26 Jul 2014 13:30:00 GMT",
            "description": "In this powerful episode of Navy SEAL Radio, behavioral training expert David Rutherford offers the fourth show in a 6 part series on learning to embrace your fears. As a top motivational speaker and behavioral training expert David has experienced Fear on every level. He introduces his listeners to the hidden truths about Fear and how to harness it in order to succeed in life. David outlines clearly describes how to alter your way of thinking and introduces the four steps of Mission 3: Retrain Your Brain  This weeks special guest, fromer SEAL Team member, exercise physiologist for 2XU & Founder of Virginia High Performance in Virginia Beach, Jeff Nichols. Jeff is a highly decorated veteran who has double digit combat deployments to every major hot spot in the world. He will share is expert insight on human performance and how to retrain your brain, body and soul. Fear is a part of us all, you don’t want to miss this episode. HOOYAH #NavySEALRadio Saturday’s at 930 am EST. \r\n\r\nTop Motivational Speaker and Navy SEAL, David Rutherford ignites audiences with his high energy, no nonsense approach to motivating people to succeed in any environment imaginable. As a top Behavioral Training Specialist and Author, David motives people from all walks of life with his motivational philosophy called Froglogic. Derived from 20 years of personal exploration into the human condition David combines his incredible journey with 70 plus years of Navy SEAL operational, training and elite lifestyle performance successes. His masterful ability to inspire enables individuals and teams to forge their Self-Confidence and commit to living a TEAM LIFE.\r\n",
            "length": "14365280",
            "sourceUrl": "https://www.blogtalkradio.com/navysealradio/2014/07/26/embrace-your-fears--mission-3-retrain-your-brain-with-seal-performance-coach.mp3",
            "categories": [
                {
                    "_": "Motivation",
                    "$": {
                        "domain": "http://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "Embrace Fear Training - Mission 2: Accept Your Reality",
            "datePublished": "Sat, 19 Jul 2014 13:30:00 GMT",
            "description": "In this insightful episode of Navy SEAL Radio, behavioral training expert David Rutherford launches his third show in a 6 part series on learning to embrace your fears. As a Navy SEAL Medic and Instructor David has experienced Fear on every level and now for the first time, he introduces his listeners to the hidden truths about Fear and how to accept the reality of fear in your life. He also welcomes an incredible guest, Green Beret and highly successful business executive, Brad Christian to help explain how accepting the reality of fear can help you to defeat the negative insurgency of life. Fear is a part of us all, you don’t want to miss this episode. HOOYAH #NavySEALRadio Saturday’s at 930 am EST. \r\n\r\nTop Motivational Speaker and Navy SEAL, David Rutherford ignites audiences with his high energy, no nonsense approach to motivating people to succeed in any environment imaginable. As a top Behavioral Training Specialist and Author, David motives people from all walks of life with his motivational philosophy called Froglogic. Derived from 20 years of personal exploration into the human condition David combines his incredible journey with 70 plus years of Navy SEAL operational, training and elite lifestyle performance successes. His masterful ability to inspire enables individuals and teams to forge their Self-Confidence and commit to living a TEAM LIFE.\r\n",
            "length": "14400128",
            "sourceUrl": "https://www.blogtalkradio.com/navysealradio/2014/07/19/embrace-fear-training--mission-2-accept-your-reality.mp3",
            "categories": [
                {
                    "_": "Self Help",
                    "$": {
                        "domain": "http://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "Embrace Fear Training - Mission 1: Search For The Truth",
            "datePublished": "Sat, 12 Jul 2014 13:30:00 GMT",
            "description": "In this powerful episode of Navy SEAL Radio, behavioral training expert David Rutherford offers the second show in a 6 part series on learning to embrace your fears. As a Navy SEAL Medic and Instructor David has experienced Fear on every level and now for the first time, he introduces his listeners to the hidden truths about Fear and how to harness it to succeed in every aspect of your life. David outlines how to search for the truth of our fear and then how to harness that truth to enhance your ability to succeed.  He welcomes guest comentator, Navy SEAL and future co-star in the Bradley Cooper Movie American Sniper, Kevin Lacz. Kevin is a decorated veteran who has numerous combat deployments to Iraq. He will share is expert insight on the truth about fear. Fear is a part of us all, you don’t want to miss this episode. HOOYAH #NavySEALRadio Saturday’s at 930 am EST. \r\n\r\nTop Motivational Speaker and Navy SEAL, David Rutherford ignites audiences with his high energy, no nonsense approach to motivating people to succeed in any environment imaginable. As a top Behavioral Training Specialist and Author, David motives people from all walks of life with his motivational philosophy called Froglogic. Derived from 20 years of personal exploration into the human condition David combines his incredible journey with 70 plus years of Navy SEAL operational, training and elite lifestyle performance successes. His masterful ability to inspire enables individuals and teams to forge their Self-Confidence and commit to living a TEAM LIFE.\r\n",
            "length": "14439008",
            "sourceUrl": "https://www.blogtalkradio.com/navysealradio/2014/07/12/embrace-fear-training--mission-1-search-for-the-truth.mp3",
            "categories": [
                {
                    "_": "Self Help",
                    "$": {
                        "domain": "http://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "Navy SEAL Training - Embrace Your Fears",
            "datePublished": "Sat, 05 Jul 2014 13:30:00 GMT",
            "description": "In this powerful episode of Navy SEAL Radio, behavioral training expert David Rutherford launches a 6 part series on learning to embrace your fears. As a Navy SEAL Medic and Instructor David has experienced Fear on every level and now for the first time, he introduces his listeners to the hidden truths about Fear and how to harness it to succeed in every aspect of your life. He also welcomes an incredible guest, Navy SEAL and MMA fighter, Jeremiah Patrick to help explain how the most elite fighters on the planet embrace fear to defeat the negative insurgency of life. Fear is a part of us all, you don’t want to miss this episode. HOOYAH #NavySEALRadio Saturday’s at 930 am EST. \r\n\r\nTop Motivational Speaker and Navy SEAL, David Rutherford ignites audiences with his high energy, no nonsense approach to motivating people to succeed in any environment imaginable. As a top Behavioral Training Specialist and Author, David motives people from all walks of life with his motivational philosophy called Froglogic. Derived from 20 years of personal exploration into the human condition David combines his incredible journey with 70 plus years of Navy SEAL operational, training and elite lifestyle performance successes. His masterful ability to inspire enables individuals and teams to forge their Self-Confidence and commit to living a TEAM LIFE.\r\n",
            "length": "14405600",
            "sourceUrl": "https://www.blogtalkradio.com/navysealradio/2014/07/05/navy-seal-training--embrace-your-fears.mp3",
            "categories": [
                {
                    "_": "Motivation",
                    "$": {
                        "domain": "http://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "Froglogic - Motivational Tools To Fight The Negative Insurgency In Your Life",
            "datePublished": "Sat, 28 Jun 2014 13:30:00 GMT",
            "description": "In this inspiring episode, top Behavioral Training Expert and elite performance coach David Rutherford outlines his motivational philosophy called Froglogic. David takes his listeners along on his incredible journey exploring the human condition for the past 20 years. He also includes the tested and proven experiences of the Navy SEAL Teams, to which he was a part of for 8 years. Learn how to embrace your fears, forge your self-confidence, live with purpose and finally to live the Team Life. Don’t miss this highly motivational show. Saturday at 930 am EST. HOOYAH\r\n\r\nTop Motivational Speaker and Navy SEAL, David Rutherford ignites audiences with his high energy, no nonsense approach to motivating people to succeed in any environment imaginable. As a top Behavioral Training Specialist and Author, David motives people from all walks of life with his motivational philosophy called Froglogic. Derived from 20 years of personal exploration into the human condition David combines his incredible journey with 70 plus years of Navy SEAL operational, training and elite lifestyle performance successes. His masterful ability to inspire enables individuals and teams to forge their Self-Confidence and commit to living a TEAM LIFE.\r\n",
            "length": "14409344",
            "sourceUrl": "https://www.blogtalkradio.com/navysealradio/2014/06/28/froglogic--motivational-tools-to-fight-the-negative-insurgency-in-your-life.mp3",
            "categories": [
                {
                    "_": "Motivation",
                    "$": {
                        "domain": "http://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "Navy SEAL Training - How To Become A Great Teammate",
            "datePublished": "Sat, 14 Jun 2014 13:30:00 GMT",
            "description": "In this enlightening episode of Navy SEAL Radio, behavioral training specialist David Rutherford teaches his listeners how to turn their self-interest around and commit to becoming a great teammate. David explores Navy SEAL training and taps into his Froglogic motivational program to help guide individuals and teams on the finer points of living a team oriented lifestyle and how it helps to achieve total mission success. His high energy, super positive approach to learning will help you transform you life immediately. Tune in Saturday June 14, 2014. HOOYAH\r\n\r\nTop Motivational Speaker and Navy SEAL, David Rutherford ignites audiences with his high energy, no nonsense approach to motivating people to succeed in any environment imaginable. As a top Behavioral Training Specialist and Author, David motives people from all walks of life with his motivational philosophy called Froglogic. Derived from 20 years of personal exploration into the human condition David combines his incredible journey with 70 plus years of Navy SEAL operational, training and elite lifestyle performance successes. His masterful ability to inspire enables individuals and teams to forge their Self-Confidence and commit to living a TEAM LIFE.\r\n\r\n \r\n",
            "length": "14387168",
            "sourceUrl": "https://www.blogtalkradio.com/navysealradio/2014/06/14/navy-seal-training--how-to-become-a-great-teammate.mp3",
            "categories": [
                {
                    "_": "Self Help",
                    "$": {
                        "domain": "http://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "The Bergdahl Debacle - Interviews with Navy SEALs Dan O'Shea and Thom Shea",
            "datePublished": "Sat, 07 Jun 2014 13:30:00 GMT",
            "description": "In this riveting episode, Navy SEAL and behavioral training specialist takes a hard look at the release of Bowe Bergdahl in exchange for 5 senior ranking Taliban comanders. David explores Bowe’s background, the timeline of his capture and subsequent missions to rescue him that followed. He will also explore the deal that lead to 5 senior Taliban fighters being released from Guantanamo Bay for Bowe’s release. Two situational experts will be guest for this weeks show. Navy SEALs and primetime news contributors, Dan O'Shea and Thom Shea offer thier incredible insight to the whole story. Tune into this controversial episode this Saturday at 930 am Eastern Standard Time. David will also be taking calls and questions from his audience. Don’t miss this one. HOOYAH.\r\n\r\nTop Motivational Speaker and Navy SEAL, David Rutherford ignites audiences with his high energy, no nonsense approach to motivating people to succeed in any environment imaginable. As a top Behavioral Training Specialist and Author, David motives people from all walks of life with his motivational philosophy called Froglogic. Derived from 20 years of personal exploration into the human condition David combines his incredible journey with 70 plus years of Navy SEAL operational, training and elite lifestyle performance successes. His masterful ability to inspire enables individuals and teams to forge their Self-Confidence and commit to living a TEAM LIFE. \r\n",
            "length": "14256704",
            "sourceUrl": "https://www.blogtalkradio.com/navysealradio/2014/06/07/the-bergdahl-debacle--interviews-with-navy-seals-dan-oshea-and-thom-shea.mp3",
            "categories": [
                {
                    "_": "Politics",
                    "$": {
                        "domain": "http://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "Navy SEAL Non Profit - Heroes and Horses",
            "datePublished": "Sat, 31 May 2014 13:30:00 GMT",
            "description": "In this touching episode Behavioral Training Specialist David Rutherford takes a look at the Navy SEAL owned and operated non-profit, Heroes and Horses. David first explores the nations huge problem of struggling veterans and how the Government and the VA system is letting them down. Next he outlines the incredible program H&H has put together for Vets. David finishes this amazing show with a half hour interview with the companies founder and owners. You won’t want to miss this show. www.heroesandhorses.com #navysealradio #davidrutherford \r\n\r\nTop Motivational Speaker and Navy SEAL, David Rutherford ignites audiences with his high energy, no nonsense approach to motivating people to succeed in any environment imaginable. As a top Behavioral Training Specialist and Author, David motives people from all walks of life with his motivational philosophy called Froglogic. Derived from 20 years of personal exploration into the human condition David combines his incredible journey with 70 plus years of Navy SEAL operational, training and elite lifestyle performance successes. His masterful ability to inspire enables individuals and teams to forge their Self-Confidence and commit to living a TEAM LIFE.\r\n\r\nIn this episode David introduces his audience to his definition of \"Motivation\" as it relates to his experiences in the SEAL Teams and in his personal life. He will be recruiting you, his new teammates for your help defining this critical concept behind human success. Change your way of thinking by enlisting David to become your new motivational swim buddy. HOOYAH!\r\n",
            "length": "14457440",
            "sourceUrl": "https://www.blogtalkradio.com/navysealradio/2014/05/31/navy-seal-non-profit--heroes-and-horses.mp3",
            "categories": [
                {
                    "_": "Military",
                    "$": {
                        "domain": "http://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "Elite Training - The Wrong Way and The Right Way",
            "datePublished": "Sat, 03 May 2014 13:30:00 GMT",
            "description": "In this awesome episode on Navy SEAL Radio, performance coach David Rutherford explains the reasons why Special Operations training has produced some of the most elite human beings on the planet. He explores 70 years of Navy SEAL training concepts and shares his unique insights from his own Froglogic Training Philosophy. David welcomes a couple of training experts from the special operations world to the show and further describes the differences between training the right way and the wrong way. HOOYAH\r\n\r\nTop Motivational Speaker and Navy SEAL, David Rutherford ignites audiences with his high energy, no nonsense approach to motivating people to succeed in any environment imaginable. As a top Behavioral Training Specialist and Author, David motives people from all walks of life with his motivational philosophy called Froglogic. Derived from 20 years of personal exploration into the human condition David combines his incredible journey with 70 plus years of Navy SEAL operational, training and elite lifestyle performance successes. His masterful ability to inspire enables individuals and teams to forge their Self-Confidence and commit to living a TEAM LIFE.\r\n\r\n \r\n",
            "length": "14437568",
            "sourceUrl": "https://www.blogtalkradio.com/navysealradio/2014/05/03/elite-training--the-wrong-way-and-the-right-way.mp3",
            "categories": [
                {
                    "_": "Self Help",
                    "$": {
                        "domain": "http://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "Outward Bound Veterans Program - A Navy SEAL's Insight",
            "datePublished": "Sat, 19 Apr 2014 13:30:00 GMT",
            "description": "In this informative episode, Navy SEAL and behavioral training specialist David Rutherford explains Outward Bound and the positive effect it’s veterans programs are having around the country. David gives historical background on one’s the nations longest running and successful outdoor developmental programs. As a two-time participant, once a kid and most recently on a veterans course, he shares his unique insight to the power of Outward Bound. David also welcomes several members of the North Carolina Outward Bound School to the program. Outward Bound offers tremendous physical, mental and spiritual rewards to all those who experience the numerous types of courses. Don’t miss this show. \r\n\r\nTop Motivational Speaker and Navy SEAL, David Rutherford ignites audiences with his high energy, no nonsense approach to motivating people to succeed in any environment imaginable. As a top Behavioral Training Specialist and Author, David motives people from all walks of life with his motivational philosophy called Froglogic. Derived from 20 years of personal exploration into the human condition David combines his incredible journey with 70 plus years of Navy SEAL operational, training and elite lifestyle performance successes. His masterful ability to inspire enables individuals and teams to forge their Self-Confidence and commit to living a TEAM LIFE.\r\n\r\n \r\n",
            "length": "14394080",
            "sourceUrl": "https://www.blogtalkradio.com/navysealradio/2014/04/19/outward-bound-veterans-program--a-navy-seals-insight.mp3",
            "categories": [
                {
                    "_": "Lifestyle",
                    "$": {
                        "domain": "http://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "Navy SEAL Training - Why we need to take risk",
            "datePublished": "Sat, 12 Apr 2014 13:30:00 GMT",
            "description": "In this episode David explains the critical imporatnce to taking risks in your life. He will describe how Navy SEALs train themselves to take tactically sound, calculated risk every single day. There is no greater risk than putting your life on the line for your teammates. Catch this show and learn how to embrcae your fears to take the risk you've alwasy wanted to take. Change your way of thinking by enlisting David to become your new motivational swim buddy. HOOYAH! \r\n\r\nTop Motivational Speaker and Navy SEAL, David Rutherford ignites audiences with his high energy, no nonsense approach to motivating people to succeed in any environment imaginable. As a top Behavioral Training Specialist and Author, David motives people from all walks of life with his motivational philosophy called Froglogic. Derived from 20 years of personal exploration into the human condition David combines his incredible journey with 70 plus years of Navy SEAL operational, training and elite lifestyle performance successes. His masterful ability to inspire enables individuals and teams to forge their Self-Confidence and commit to living a TEAM LIFE.\r\n\r\n \r\n",
            "length": "14426048",
            "sourceUrl": "https://www.blogtalkradio.com/navysealradio/2014/04/12/navy-seal-training--why-we-need-to-take-risk.mp3",
            "categories": [
                {
                    "_": "Self Help",
                    "$": {
                        "domain": "http://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "Fighting Childhood Obesity - The SEAL Team Way",
            "datePublished": "Sat, 05 Apr 2014 13:30:00 GMT",
            "description": "In this controversial episode of Navy SEAL Radio, behavioral training specialist David Rutherford exposes the truth behind the national epidemic of childhood obesity. David clarifies the main reasons why our children are suffering and then outlines how to get our kids back on track. If you’re a parent, educator, or young person dealing with the tragic problem you don’t want to miss David’s powerful show.    \r\n\r\nTop Motivational Speaker and Navy SEAL, David Rutherford ignites audiences with his high energy, no nonsense approach to motivating people to succeed in any environment imaginable. As a top Behavioral Training Specialist and Author, David motives people from all walks of life with his motivational philosophy called Froglogic. Derived from 20 years of personal exploration into the human condition David combines his incredible journey with 70 plus years of Navy SEAL operational, training and elite lifestyle performance successes. His masterful ability to inspire enables individuals and teams to forge their Self-Confidence and commit to living a TEAM LIFE. \r\n\r\n \r\n",
            "length": "14282624",
            "sourceUrl": "https://www.blogtalkradio.com/navysealradio/2014/04/05/fighting-childhood-obesity--the-seal-team-way.mp3",
            "categories": [
                {
                    "_": "Family",
                    "$": {
                        "domain": "http://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "SEAL  Perseverance - Interview with SEAL,  Cancer survivor Justin Legg",
            "datePublished": "Sat, 29 Mar 2014 13:30:00 GMT",
            "description": "In this inspiring episode of Navy SEAL Radio, David Rutherford explains Perseverance and how it plays a critical role in our lives. As a behavioral training expert David outlines how you can develop your perseverance by understanding how Navy SEALs forge theirs. He also give clear examples from his Froglogic motivational philosophy to help you begin honing your skills. David also welcomes teammate Justin Legg and his incredible sotry as a leukemia survivor, bone marrow transplant and double lung transplant recipient, to the show. Justin will explain his remarkable story and how his perseverance has taken him through the hardest military training in the world and surviving incredible odds. Don’t miss this show. Saturday at 930 am EST. HOOYAH \r\n\r\nTop Motivational Speaker and Navy SEAL, David Rutherford ignites audiences with his high energy, no nonsense approach to motivating people to succeed in any environment imaginable. As a top Behavioral Training Specialist and Author, David motives people from all walks of life with his motivational philosophy called Froglogic. Derived from 20 years of personal exploration into the human condition David combines his incredible journey with 70 plus years of Navy SEAL operational, training and elite lifestyle performance successes. His masterful ability to inspire enables individuals and teams to forge their Self-Confidence and commit to living a TEAM LIFE.\r\n\r\n \r\n",
            "length": "14379104",
            "sourceUrl": "https://www.blogtalkradio.com/navysealradio/2014/03/29/seal-perseverance--interview-with-seal-cancer-survivor-justin-legg.mp3",
            "categories": [
                {
                    "_": "Military",
                    "$": {
                        "domain": "http://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "SEAL Team - The Bond of the Brotherhood",
            "datePublished": "Sat, 22 Mar 2014 13:30:00 GMT",
            "description": "In this episode David explains why the SEAL Teams are such a close nit unit. He outlines the transformation that take place during training and while conducting the most dangerous operations around the world. If you're interested in why Navy SEALs are willing to die for one another this is the show for you. Don't miss it. OOUUTT\r\n\r\nTop Motivational Speaker and Navy SEAL, David Rutherford ignites audiences with his high energy, no nonsense approach to motivating people to succeed in any environment imaginable. As a top Behavioral Training Specialist and Author, David motives people from all walks of life with his motivational philosophy called Froglogic. Derived from 20 years of personal exploration into the human condition David combines his incredible journey with 70 plus years of Navy SEAL operational, training and elite lifestyle performance successes. His masterful ability to inspire enables individuals and teams to forge their Self-Confidence and commit to living a TEAM LIFE. \r\n\r\n \r\n",
            "length": "14397536",
            "sourceUrl": "https://www.blogtalkradio.com/navysealradio/2014/03/22/seal-team--the-bond-of-the-brotherhood.mp3",
            "categories": [
                {
                    "_": "Military",
                    "$": {
                        "domain": "http://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "Living Your Dream - Luck vs. Hard Work",
            "datePublished": "Sat, 15 Mar 2014 13:30:00 GMT",
            "description": "In this totally motivating St. Patricks Day episode, Navy SEAL David Rutherford answers the age-old question about whether it’s better to be lucky or driven to work hard. David explores his incredible life experience and how he’s been able to live out several dreams. He will outline how you can begin to achieve your dreams by understanding the difference between hard work and luck. Don’t miss this show. \r\n\r\nTop Motivational Speaker and Navy SEAL, David Rutherford ignites audiences with his high energy, no nonsense approach to motivating people to succeed in any environment imaginable. As a top Behavioral Training Specialist and Author, David motives people from all walks of life with his motivational philosophy called Froglogic. Derived from 20 years of personal exploration into the human condition David combines his incredible journey with 70 plus years of Navy SEAL operational, training and elite lifestyle performance successes. His masterful ability to inspire enables individuals and teams to forge their Self-Confidence and commit to living a TEAM LIFE. \r\n\r\n \r\n",
            "length": "14392640",
            "sourceUrl": "https://www.blogtalkradio.com/navysealradio/2014/03/15/living-your-dream--luck-vs-hard-work.mp3",
            "categories": [
                {
                    "_": "Self Help",
                    "$": {
                        "domain": "http://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "Firefighters & The Brotherhood - Fighting Fire With Fire.",
            "datePublished": "Sat, 08 Mar 2014 14:30:00 GMT",
            "description": "I this inspiring episode Navy SEAL Radio host David Rutherford explores the courageousness of firefighters and their commitment to serving the greater good.  David interviews two firefighters who explain their passion and commitment that drives them to run into burning buildings and put their lives on the line for you. He also outlines how you can begin to develop your personal burning desire to follow your dreams while serving the greater good. Don’t miss this show. HOOYAH\r\n\r\nTop Motivational Speaker and Navy SEAL, David Rutherford ignites audiences with his high energy, no nonsense approach to motivating people to succeed in any environment imaginable. As a top Behavioral Training Specialist and Author, David motives people from all walks of life with his motivational philosophy called Froglogic. Derived from 20 years of personal exploration into the human condition David combines his incredible journey with 70 plus years of Navy SEAL operational, training and elite lifestyle performance successes. His masterful ability to inspire enables individuals and teams to forge their Self-Confidence and commit to living a TEAM LIFE. \r\n\r\n \r\n",
            "length": "14368160",
            "sourceUrl": "https://www.blogtalkradio.com/navysealradio/2014/03/08/firefighters-the-brotherhood--fighting-fire-with-fire.mp3",
            "categories": [
                {
                    "_": "Religion",
                    "$": {
                        "domain": "http://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "The Next Person You Meet, Will Change Your Life Forever",
            "datePublished": "Sat, 01 Mar 2014 14:30:00 GMT",
            "description": "In this highly motivational episode, Behavioral Training Specialist David Rutherford will ignite your desire to start living life to the fullest. David describes his incredible journey in life and how his drive to continuously meet amazing people shaped his ability to achieve all of his dreams. David describes how generating new relationships forces us all to constantly develop and tests our own limited perceptions of the world. David outlines some Froglogic concepts in order to get your life on track. Call in and ask David to help you. \r\n\r\nTop Motivational Speaker and Navy SEAL, David Rutherford ignites audiences with his high energy, no nonsense approach to motivating people to succeed in any environment imaginable. As a top Behavioral Training Specialist and Author, David motives people from all walks of life with his motivational philosophy called Froglogic. Derived from 20 years of personal exploration into the human condition David combines his incredible journey with 70 plus years of Navy SEAL operational, training and elite lifestyle performance successes. His masterful ability to inspire enables individuals and teams to forge their Self-Confidence and commit to living a TEAM LIFE. \r\n\r\n \r\n",
            "length": "14363264",
            "sourceUrl": "https://www.blogtalkradio.com/navysealradio/2014/03/01/the-next-person-you-meet-will-change-your-life-forever.mp3",
            "categories": [
                {
                    "_": "Motivation",
                    "$": {
                        "domain": "http://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "The Lone Survivor Foundation - Interview with Marcus Luttrell.",
            "datePublished": "Sat, 22 Feb 2014 14:30:00 GMT",
            "description": "In this episode David interviews Marcus Lattrell about the Lone Survivor Foundation and the powerful impact it’s having on veteran’s and their families. David talks to some of the committed members of the LSF team who commit their lives to helping others. Don’t miss this great show on a charity that truly makes a difference. HOOYAH\r\n\r\nFrom the Site: http://lonesurvivorfoundation.org/about-us/\r\n\r\n“The intent was to bring the wounded service members into the same type of environment that healed Marcus. A place of solitude and beauty, where there was a close-knit and understanding support system. A place where the service members and their families could heal together as they all worked through the consequences of war. The Foundation is dedicated to honoring and remembering American service members by providing unique educational, rehabilitation, recovery, and wellness opportunities to U.S. Armed Forces members and their families. - See more at: http://lonesurvivorfoundation.org/about-us/#sthash.3B6XSygd.dpuf”\r\n\r\nTop Motivational Speaker and Navy SEAL, David Rutherford ignites audiences with his high energy, no nonsense approach to motivating people to succeed in any environment imaginable. As a top Behavioral Training Specialist and Author, David motives people from all walks of life with his motivational philosophy called Froglogic. Derived from 20 years of personal exploration into the human condition David combines his incredible journey with 70 plus years of Navy SEAL operational, training and elite lifestyle performance successes. His masterful ability to inspire enables individuals and teams to forge their Self-Confidence and commit to living a TEAM LIFE.\r\n\r\n \r\n",
            "length": "14360384",
            "sourceUrl": "https://www.blogtalkradio.com/navysealradio/2014/02/22/the-lone-survivor-foundation--interview-with-marcus-luttrell.mp3",
            "categories": [
                {
                    "_": "Self Help",
                    "$": {
                        "domain": "http://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "Navy SEAL Training - Preparing for the BIG Game",
            "datePublished": "Sat, 01 Feb 2014 14:30:00 GMT",
            "description": "In this Super Bowl Episode, Navy SEAL and behavioral training specialist David Rutherford outlines a clear strategy for getting you ready for the biggest game of your life. David calls from his experience as a SEAL and international training specialist to help you develop the necessary skills needed to embrace your fears and win big. Don't miss this super show on Navy SEAL Radio. HOOYAH\r\n\r\nTop Motivational Speaker and Navy SEAL, David Rutherford ignites audiences with his high energy, no nonsense approach to motivating people to succeed in any environment imaginable. As a top Behavioral Training Specialist and Author, David motives people from all walks of life with his motivational philosophy called Froglogic. Derived from 20 years of personal exploration into the human condition David combines his incredible journey with 70 plus years of Navy SEAL operational, training and elite lifestyle performance successes. His masterful ability to inspire enables individuals and teams to forge their Self-Confidence and commit to living a TEAM LIFE.\r\n\r\n \r\n",
            "length": "14421728",
            "sourceUrl": "https://www.blogtalkradio.com/navysealradio/2014/02/01/navy-seal-training--preparing-for-the-big-game.mp3",
            "categories": [
                {
                    "_": "Sports",
                    "$": {
                        "domain": "http://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "Self-Confidence - Mission 1: Have A Positive Attitude",
            "datePublished": "Sat, 25 Jan 2014 14:30:00 GMT",
            "description": "Top Motivational Speaker and Navy SEAL, David Rutherford ignites audiences with his high energy, no nonsense approach to motivating people to succeed in any environment imaginable. As a top Behavioral Training Specialist and Author, David motives people from all walks of life with his motivational philosophy called Froglogic. Derived from 20 years of personal exploration into the human condition David combines his incredible journey with 70 plus years of Navy SEAL operational, training and elite lifestyle performance successes. His masterful ability to inspire enables individuals and teams to forge their Self-Confidence and commit to living a TEAM LIFE. \r\n\r\nIn this episode David introduces his audience to Froglogic Self-Confidence Mission 1: Have a Positive Attitude. David describes in detail how to forge a Positive Attitude. He will be recruiting you, his new teammates for your help defining this critical concept behind human success. Change your way of thinking by enlisting David to become your new motivational swim buddy. For more infor please visit his website at www.teamfroglogic.com  HOOYAH!\r\n",
            "length": "14402432",
            "sourceUrl": "https://www.blogtalkradio.com/navysealradio/2014/01/25/self-confidence--mission-1-have-a-positive-attitude.mp3",
            "categories": [
                {
                    "_": "Motivation",
                    "$": {
                        "domain": "http://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "The Fear of Failure",
            "datePublished": "Sat, 18 Jan 2014 14:30:00 GMT",
            "description": "In this insightful episode, top motivational speaker David Rutherford explains how to embrace the fear of failure and begin to use failure as a tool for success. David describes his experiences from his time in the SEAL Teams to highlight to incredible benefits that result from failing on a regular basis in life. He also outlines 4 useful tips to from his Froglogic Philosophy to help you learn to embrace your fear of failing. Don't miss David's high energy, motivational radio show. HOOYAH\r\n\r\nTop Motivational Speaker and Navy SEAL, David Rutherford ignites audiences with his high energy, no nonsense approach to motivating people to succeed in any environment imaginable. As a top Behavioral Training Specialist and Author, David motives people from all walks of life with his motivational philosophy called Froglogic. Derived from 20 years of personal exploration into the human condition David combines his incredible journey with 70 plus years of Navy SEAL operational, training and elite lifestyle performance successes. His masterful ability to inspire enables individuals and teams to forge their Self-Confidence and commit to living a TEAM LIFE. \r\n\r\n \r\n",
            "length": "14414240",
            "sourceUrl": "https://www.blogtalkradio.com/navysealradio/2014/01/18/the-fear-of-failure.mp3",
            "categories": [
                {
                    "_": "Self Help",
                    "$": {
                        "domain": "http://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "SEAL Motivation - Achieving Your Dreams",
            "datePublished": "Sat, 11 Jan 2014 14:30:00 GMT",
            "description": "In this incredibly inspiring episode, David talk’s about his life and how he’s been able to achieve dream after dream. In this show he outlines Why dreams are important for a healthy life and how Navy SEALs achieve their dreams. Finally David will describe his motivational philosophy called Froglogic, and give you four easy to use, common sense ways to kick start your quest of realizing your dreams. Call in LIVE or ask David via the net questions that will help you discover your purpose in life. HOOYAH\r\n\r\nTop Motivational Speaker and Navy SEAL, David Rutherford ignites audiences with his high energy, no nonsense approach to motivating people to succeed in any environment imaginable. As a top Behavioral Training Specialist and Author, David motives people from all walks of life with his motivational philosophy called Froglogic. Derived from 20 years of personal exploration into the human condition David combines his incredible journey with 70 plus years of Navy SEAL operational, training and elite lifestyle performance successes. His masterful ability to inspire enables individuals and teams to Embrace Fear,  Forge Self-Confidence and Live The TEAM LIFE. \r\n\r\n \r\n",
            "length": "14402720",
            "sourceUrl": "https://www.blogtalkradio.com/navysealradio/2014/01/11/seal-motivation--achieving-your-dreams.mp3",
            "categories": [
                {
                    "_": "Self Help",
                    "$": {
                        "domain": "http://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "Navy SEAL Training - Forging Self-Confidence",
            "datePublished": "Sat, 04 Jan 2014 14:30:00 GMT",
            "description": "In this amazing 2014 New Year's special episode, behavioral training specialist and Navy SEAL David Rutherford describes his incredible journey to realize dream after dream in his life. He shares his unique motivational insights with his audience and helps them begin to realize their dreams. Don't miss this life changing, inspiring show and get your year started right. Saturday morning at 0930 EST. \r\n\r\nTop Motivational Speaker and Navy SEAL, David Rutherford ignites audiences with his high energy, no nonsense approach to motivating people to succeed in any environment imaginable. As a top Behavioral Training Specialist and Author, David motives people from all walks of life with his motivational philosophy called Froglogic. Derived from 20 years of personal exploration into the human condition David combines his incredible journey with 70 plus years of Navy SEAL operational, training and elite lifestyle performance successes. His masterful ability to inspire enables individuals and teams to forge their Self-Confidence and commit to living a TEAM LIFE. \r\n\r\n \r\n",
            "length": "9109280",
            "sourceUrl": "https://www.blogtalkradio.com/navysealradio/2014/01/04/navy-seal-training--forging-self-confidence.mp3",
            "categories": [
                {
                    "_": "Self Help",
                    "$": {
                        "domain": "http://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "Navy SEAL Motivation Defined",
            "datePublished": "Sat, 28 Dec 2013 14:30:00 GMT",
            "description": "Top Motivational Speaker and Navy SEAL, David Rutherford ignites audiences with his high energy, no nonsense approach to motivating people to succeed in any environment imaginable. As a top Behavioral Training Specialist and Author, David motives people from all walks of life with his motivational philosophy called Froglogic. Derived from 20 years of personal exploration into the human condition David combines his incredible journey with 70 plus years of Navy SEAL operational, training and elite lifestyle performance successes. His masterful ability to inspire enables individuals and teams to forge their Self-Confidence and commit to living a TEAM LIFE. \r\nIn this episode David introduces his audience to his definition of \"Motivation\" as it relates to his experiences in the SEAL Teams and in his personal life. He will be recruiting you, his new teammates for your help defining this critical concept behind human success. Change your way of thinking by enlisting David to become your new motivational swim buddy. HOOYAH!\r\n",
            "length": "14104064",
            "sourceUrl": "https://www.blogtalkradio.com/navysealradio/2013/12/28/navy-seal-motivation-defined.mp3",
            "categories": [
                {
                    "_": "Motivation",
                    "$": {
                        "domain": "http://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "The Strength and Honor of Faith",
            "datePublished": "Sat, 21 Dec 2013 14:30:00 GMT",
            "description": "In this feel good, holiday episode Navy SEAL David Rutherford describes how the human condition can be fortified by developing the strength and honor of faith. David describes his own personal journey living without faith and the difficulties associated with that mindset. He also explains how has used and uses his faith to help millions of people around the world. Tis' the season, don't miss this powerful show.\r\n\r\nTop Motivational Speaker and Navy SEAL, David Rutherford ignites audiences with his high energy, no nonsense approach to motivating people to succeed in any environment imaginable. As a top Behavioral Training Specialist and Author, David motives people from all walks of life with his motivational philosophy called Froglogic. Derived from 20 years of personal exploration into the human condition David combines his incredible journey with 70 plus years of Navy SEAL operational, training and elite lifestyle performance successes. His masterful ability to inspire enables individuals and teams to forge their Self-Confidence and commit to living a TEAM LIFE. \r\n\r\n \r\n",
            "length": "14283776",
            "sourceUrl": "https://www.blogtalkradio.com/navysealradio/2013/12/21/the-strength-and-honor-of-faith.mp3",
            "categories": [
                {
                    "_": "Religion",
                    "$": {
                        "domain": "http://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "Navy SEAL Motivation Defined",
            "datePublished": "Sat, 14 Dec 2013 14:30:00 GMT",
            "description": "In this episode David explains why the SEAL Teams are such a close nit unit. He outlines the transformation that take place during training and while conducting the most dangerous operations around the world. If you're interested in why Navy SEALs are willing to die for one another this is the show for you. Don't miss it. OOUUTT\r\n\r\nTop Motivational Speaker and Navy SEAL, David Rutherford ignites audiences with his high energy, no nonsense approach to motivating people to succeed in any environment imaginable. As a top Behavioral Training Specialist and Author, David motives people from all walks of life with his motivational philosophy called Froglogic. Derived from 20 years of personal exploration into the human condition David combines his incredible journey with 70 plus years of Navy SEAL operational, training and elite lifestyle performance successes. His masterful ability to inspire enables individuals and teams to forge their Self-Confidence and commit to living a TEAM LIFE. \r\n",
            "length": "14396672",
            "sourceUrl": "https://www.blogtalkradio.com/navysealradio/2013/12/14/navy-seal-motivation-defined.mp3",
            "categories": [
                {
                    "_": "Motivation",
                    "$": {
                        "domain": "http://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "Navy SEAL Mindset - To Protect and Serve",
            "datePublished": "Sat, 07 Dec 2013 14:30:00 GMT",
            "description": "In this insightful episode, Navy SEAL Motivational Speaker David Rutherford explains how having the instrinsic need to protect and serve the greater good can enhance your ability to succeed. David welcomes to the show former Navy SEALs who now serve the the greater good as Police Officers. They will discuss how the #sheepdogmentaility benefits American Society and themselves. Don't miss this powerful show. HOOYAH \r\n\r\nTop Motivational Speaker and Navy SEAL, David Rutherford ignites audiences with his high energy, no nonsense approach to motivating people to succeed in any environment imaginable. As a top Behavioral Training Specialist and Author, David motives people from all walks of life with his motivational philosophy called Froglogic. Derived from 20 years of personal exploration into the human condition David combines his incredible journey with 70 plus years of Navy SEAL operational, training and elite lifestyle performance successes. His masterful ability to inspire enables individuals and teams to forge their Self-Confidence and commit to living a TEAM LIFE. \r\n\r\n \r\n",
            "length": "13945088",
            "sourceUrl": "https://www.blogtalkradio.com/navysealradio/2013/12/07/navy-seal-mindset--to-protect-and-serve.mp3",
            "categories": [
                {
                    "_": "Self Help",
                    "$": {
                        "domain": "http://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "Giving Thanks",
            "datePublished": "Sat, 30 Nov 2013 14:30:00 GMT",
            "description": "In this Thanksgiving episode, Navy SEAL motivational speaker David Rutherford outlines the critical imporatnce of why giving thanks makes you a better person. David gives his powerful insight on how living a outwardly thankful life can result in building a better Team Life. Tune in and learn how to make a huge difference in living your life to the fullest by simply being thanful for what you have. HOOYAH\r\n\r\nTop Motivational Speaker and Navy SEAL, David Rutherford ignites audiences with his high energy, no nonsense approach to motivating people to succeed in any environment imaginable. As a top Behavioral Training Specialist and Author, David motives people from all walks of life with his motivational philosophy called Froglogic. Derived from 20 years of personal exploration into the human condition David combines his incredible journey with 70 plus years of Navy SEAL operational, training and elite lifestyle performance successes. His masterful ability to inspire enables individuals and teams to forge their Self-Confidence and commit to living a TEAM LIFE. \r\n\r\n \r\n",
            "length": "12750176",
            "sourceUrl": "https://www.blogtalkradio.com/navysealradio/2013/11/30/giving-thanks.mp3",
            "categories": [
                {
                    "_": "Self Help",
                    "$": {
                        "domain": "http://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "Navy SEAL Motivation Defined - Self-Confidence",
            "datePublished": "Sat, 23 Nov 2013 14:30:00 GMT",
            "description": "Top Motivational Speaker and Navy SEAL, David Rutherford ignites audiences with his high energy, no nonsense approach to motivating people to succeed in any environment imaginable. As a top Behavioral Training Specialist and Author, David motives people from all walks of life with his motivational philosophy called Froglogic. Derived from 20 years of personal exploration into the human condition David combines his incredible journey with 70 plus years of Navy SEAL operational, training and elite lifestyle performance successes. His masterful ability to inspire enables individuals and teams to forge their Self-Confidence and commit to living a TEAM LIFE. \r\nIn this episode David introduces his audience to his definition of \"Motivation\" as it relates to his experiences in the SEAL Teams and in his personal life. He will be recruiting you, his new teammates for your help defining this critical concept behind human success. Change your way of thinking by enlisting David to become your new motivational swim buddy. HOOYAH!\r\n",
            "length": "13886624",
            "sourceUrl": "https://www.blogtalkradio.com/navysealradio/2013/11/23/navy-seal-motivation-defined--self-confidence.mp3",
            "categories": [
                {
                    "_": "Motivation",
                    "$": {
                        "domain": "http://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "Trim the Fat - Get rid of unnecessary obstacles in your life",
            "datePublished": "Sat, 16 Nov 2013 14:30:00 GMT",
            "description": "In this high energy episode, Navy SEAL David Rutherford helps people get rid of unnecessary obstacles in their lives. He outlines how individuals and teams can create a clear plan to erase excuses, focus training, and commit to living the Team Life. Don't miss it. HOOYAH\r\n\r\nTop Motivational Speaker and Navy SEAL, David Rutherford ignites audiences with his high energy, no nonsense approach to motivating people to succeed in any environment imaginable. As a top Behavioral Training Specialist and Author, David motives people from all walks of life with his motivational philosophy called Froglogic. Derived from 20 years of personal exploration into the human condition David combines his incredible journey with 70 plus years of Navy SEAL operational, training and elite lifestyle performance successes. His masterful ability to inspire enables individuals and teams to forge their Self-Confidence and commit to living a TEAM LIFE.\r\n\r\n \r\n",
            "length": "14386880",
            "sourceUrl": "https://www.blogtalkradio.com/navysealradio/2013/11/16/trim-the-fat--get-rid-of-unnecessary-obstacles-in-your-life.mp3",
            "categories": [
                {
                    "_": "Self Help",
                    "$": {
                        "domain": "http://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "Navy SEAL Training - KISS \"Keep it Simple Stupid\"",
            "datePublished": "Sat, 09 Nov 2013 14:30:00 GMT",
            "description": "In this action packed episode Navy SEAL David Rutherford helps his audience trim the fat of life. Taking on one of the SEAL Teams greatest mottos, he explains how simplifying life can lead to greater operational successes. Listen to David's powerful motivational message and begin getting your life squared away. HOOYAH\r\n\r\nTop Motivational Speaker and Navy SEAL, David Rutherford ignites audiences with his high energy, no nonsense approach to motivating people to succeed in any environment imaginable. As a top Behavioral Training Specialist and Author, David motives people from all walks of life with his motivational philosophy called Froglogic. Derived from 20 years of personal exploration into the human condition David combines his incredible journey with 70 plus years of Navy SEAL operational, training and elite lifestyle performance successes. His masterful ability to inspire enables individuals and teams to forge their Self-Confidence and commit to living a TEAM LIFE. \r\n\r\n \r\n",
            "length": "14390624",
            "sourceUrl": "https://www.blogtalkradio.com/navysealradio/2013/11/09/navy-seal-training--kiss-keep-it-simple-stupid.mp3",
            "categories": [
                {
                    "_": "Self Help",
                    "$": {
                        "domain": "http://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "PTSD #2 - Positive Scarring",
            "datePublished": "Sat, 02 Nov 2013 13:30:00 GMT",
            "description": " In this incredibly powerful episode on PTSD, Navy SEAL David Rutherford outlines some tested ways to positively deal with this huge life challenge. David welcomes PTSD expert, Wally Graves and other guest to the show to describe their incredible journey of helping and dealing with PTSD. Don't miss it. \r\nTop Motivational Speaker and Navy SEAL, David Rutherford ignites audiences with his high energy, no nonsense approach to motivating people to succeed in any environment imaginable. As a top Behavioral Training Specialist and Author, David motives people from all walks of life with his motivational philosophy called Froglogic. Derived from 20 years of personal exploration into the human condition David combines his incredible journey with 70 plus years of Navy SEAL operational, training and elite lifestyle performance successes. His masterful ability to inspire enables individuals and teams to forge their Self-Confidence and commit to living a TEAM LIFE. \r\n  \r\n",
            "length": "14373056",
            "sourceUrl": "https://www.blogtalkradio.com/navysealradio/2013/11/02/ptsd-2--positive-scarring.mp3",
            "categories": [
                {
                    "_": "Motivation",
                    "$": {
                        "domain": "http://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "PTSD Show #1 - Negative Scarring",
            "datePublished": "Sat, 26 Oct 2013 13:30:00 GMT",
            "description": " In this powerful episode, David digs deep into PTSD and the brutal challenges afflicting our Veterans and many in Society. David exposes the truth behind why people struggle getting \"Real World\" help in the midst of their crisis. He also outlines how suffering individual's and groups can benefit from using Froglogic and a Navy SEAL Mindset to help embrace \"Negative Scarring\". Don't miss his powerful, uplifting message on one of America's biggest problems. \r\nTop Motivational Speaker and Navy SEAL, David Rutherford ignites audiences with his high energy, no nonsense approach to motivating people to succeed in any environment imaginable. As a top Behavioral Training Specialist and Author, David motives people from all walks of life with his motivational philosophy called Froglogic. Derived from 20 years of personal exploration into the human condition David combines his incredible journey with 70 plus years of Navy SEAL operational, training and elite lifestyle performance successes. His masterful ability to inspire enables individuals and teams to forge their Self-Confidence and commit to living a TEAM LIFE.\r\n",
            "length": "14334752",
            "sourceUrl": "https://www.blogtalkradio.com/navysealradio/2013/10/26/ptsd-show-1--negative-scaring.mp3",
            "categories": [
                {
                    "_": "Motivation",
                    "$": {
                        "domain": "http://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "Navy SEAL Motivation Defined",
            "datePublished": "Sat, 19 Oct 2013 13:30:00 GMT",
            "description": "Top Motivational Speaker and Navy SEAL, David Rutherford ignites audiences with his high energy, no nonsense approach to motivating people to succeed in any environment imaginable. As a top Behavioral Training Specialist and Author, David motives people from all walks of life with his motivational philosophy called Froglogic. Derived from 20 years of personal exploration into the human condition David combines his incredible journey with 70 plus years of Navy SEAL operational, training and elite lifestyle performance successes. His masterful ability to inspire enables individuals and teams to forge their Self-Confidence and commit to living a TEAM LIFE. \r\nIn this episode David introduces his audience to his definition of \"Motivation\" as it relates to his experiences in the SEAL Teams and in his personal life. He will be recruiting you, his new teammates for your help defining this critical concept behind human success. Change your way of thinking by enlisting David to become your new motivational swim buddy. HOOYAH!\r\n",
            "length": "14427776",
            "sourceUrl": "https://www.blogtalkradio.com/navysealradio/2013/10/19/navy-seal-motivation-defined.mp3",
            "categories": [
                {
                    "_": "Motivation",
                    "$": {
                        "domain": "http://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "Defining Yourself on the Battle Field of Life",
            "datePublished": "Sat, 12 Oct 2013 13:30:00 GMT",
            "description": " In this powerful episode David helps to map out the modern day battle field of life. He explains how to defeat the ever present negative insurgency with great training, a positive attitude and by living  the Team Life. Don't miss this incredibly uplifting show and begin preparing for total mission success. HOOYAH\r\n Top Motivational Speaker and Navy SEAL, David Rutherford ignites audiences with his high energy, no nonsense approach to motivating people to succeed in any environment imaginable. As a top Behavioral Training Specialist and Author, David motives people from all walks of life with his motivational philosophy called Froglogic. Derived from 20 years of personal exploration into the human condition David combines his incredible journey with 70 plus years of Navy SEAL operational, training and elite lifestyle performance successes. His masterful ability to inspire enables individuals and teams to forge their Self-Confidence and commit to living a TEAM LIFE.\r\n  \r\n",
            "length": "14405509",
            "sourceUrl": "https://www.blogtalkradio.com/navysealradio/2013/10/12/defining-yourself-on-the-battle-field-of-life.mp3",
            "categories": [
                {
                    "_": "Motivation",
                    "$": {
                        "domain": "http://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "Froglogic Redefined",
            "datePublished": "Sat, 05 Oct 2013 13:30:00 GMT",
            "description": "Top Motivational Speaker and Navy SEAL, David Rutherford ignites audiences with his high energy, no nonsense approach to motivating people to succeed in any environment imaginable. As a top Behavioral Training Specialist and Author, David motives people from all walks of life with his motivational philosophy called Froglogic. Derived from 20 years of personal exploration into the human condition David combines his incredible journey with 70 plus years of Navy SEAL operational, training and elite lifestyle performance successes. His masterful ability to inspire enables individuals and teams to forge their Self-Confidence and commit to living a TEAM LIFE. \r\nIn this episode David introduces his audience to his definition of \"Motivation\" as it relates to his experiences in the SEAL Teams and in his personal life. He will be recruiting you, his new teammates for your help defining this critical concept behind human success. Change your way of thinking by enlisting David to become your new motivational swim buddy. HOOYAH!\r\n",
            "length": "14399448",
            "sourceUrl": "https://www.blogtalkradio.com/navysealradio/2013/10/05/navy-seal-motivation-defined.mp3",
            "categories": [
                {
                    "_": "Motivation",
                    "$": {
                        "domain": "http://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "Team Life Mission 4: Leadership ",
            "datePublished": "Sat, 28 Sep 2013 13:30:00 GMT",
            "description": " In this final episode of David's Team Life series stand by for an incredible look into the power of great leadership. David uses Medal of Honor winner Lt. Mike Murphy to define how Navy SEALs explain what leading men on the battlefield is all about. He also breaks down why becoming a great leader in your life will enable you to live the Team Life. Get fired up and listen to David's Froglogic Concepts to change your life today. HOOYAH\r\nTop Motivational Speaker and Navy SEAL, David Rutherford ignites audiences with his high energy, no nonsense approach to motivating people to succeed in any environment imaginable. As a top Behavioral Training Specialist and Author, David motives people from all walks of life with his motivational philosophy called Froglogic. Derived from 20 years of personal exploration into the human condition David combines his incredible journey with 70 plus years of Navy SEAL operational, training and elite lifestyle performance successes. His masterful ability to inspire enables individuals and teams to forge their Self-Confidence and commit to living a TEAM LIFE. \r\n  \r\n",
            "length": "14401120",
            "sourceUrl": "https://www.blogtalkradio.com/navysealradio/2013/09/28/team-life-mission-4-leadership.mp3",
            "categories": [
                {
                    "_": "Motivation",
                    "$": {
                        "domain": "http://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "Team Life Mission 3: Communication ",
            "datePublished": "Sat, 21 Sep 2013 13:30:00 GMT",
            "description": " In this episode Navy SEAL David Rutherford gets listeners' attention with his high energy approach to broadcasting. In this show David covers Mission 3: Communication from his Team Life series. He explains how great communication is the key behind winning life's battles on all fronts. David takes excerpts from his motivational talk called Team Life to explain how SEALs use every part of their being to communicate effectively and get the mission done. He also shares Medal of Honor winner Tommy Norris' story to demonstrate the power of staying calm and communicating. Listen up and learn from the best. HOOYAH\r\nTop Motivational Speaker and Navy SEAL, David Rutherford ignites audiences with his high energy, no nonsense approach to motivating people to succeed in any environment imaginable. As a top Behavioral Training Specialist and Author, David motives people from all walks of life with his motivational philosophy called Froglogic. Derived from 20 years of personal exploration into the human condition David combines his incredible journey with 70 plus years of Navy SEAL operational, training and elite lifestyle performance successes. His masterful ability to inspire enables individuals and teams to forge their Self-Confidence and commit to living a TEAM LIFE. \r\n  \r\n",
            "length": "14415540",
            "sourceUrl": "https://www.blogtalkradio.com/navysealradio/2013/09/21/team-life-mission-3-communication.mp3",
            "categories": [
                {
                    "_": "Motivation",
                    "$": {
                        "domain": "http://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "Team Life - Mission 2: Training",
            "datePublished": "Sat, 14 Sep 2013 13:30:00 GMT",
            "description": " In this exicting and informative episode David continues explaining how to Live the Team Life. In \"Mission 2: Training\" he shares the critical importance of focused training as it relates to personal and professional success. David outlines Navy SEAL training and how the world's most elite operators are forged. Using Medal Of Honor winner Mike Thornton as the standard listen and redefine your defintion of training. HOOYAH \r\n Top Motivational Speaker and Navy SEAL, David Rutherford ignites audiences with his high energy, no nonsense approach to motivating people to succeed in any environment imaginable. As a top Behavioral Training Specialist and Author, David motives people from all walks of life with his motivational philosophy called Froglogic. Derived from 20 years of personal exploration into the human condition David combines his incredible journey with 70 plus years of Navy SEAL operational, training and elite lifestyle performance successes. His masterful ability to inspire enables individuals and teams to forge their Self-Confidence and commit to living a TEAM LIFE.\r\n  \r\n",
            "length": "14409688",
            "sourceUrl": "https://www.blogtalkradio.com/navysealradio/2013/09/14/team-life--mission-2-training-1.mp3",
            "categories": [
                {
                    "_": "Motivation",
                    "$": {
                        "domain": "http://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "Team Life - Mission 1: Commitment",
            "datePublished": "Sat, 07 Sep 2013 13:30:00 GMT",
            "description": " In this follow up show to his previous Team Life training program, Navy SEAL David Rutherford explains Mission 1: Commitment. This highest commitment known in the SEAL Team is dying for your brothers. David will discuss this level of commitment and how it can be acheived in your life. By retelling the remarkable story of Medal of Honor winner, Mike Monsoor David will help you set a new standard of comittment toward living the Team Life. David also welcomes wounded Navy SEAL, Jason Redman owner of Wounded Wear on board to discuss his incredible experiences as a Navy SEAL. HOOYAH\r\nTop Motivational Speaker and Navy SEAL, David Rutherford ignites audiences with his high energy, no nonsense approach to motivating people to succeed in any environment imaginable. As a top Behavioral Training Specialist and Author, David motives people from all walks of life with his motivational philosophy called Froglogic. Derived from 20 years of personal exploration into the human condition David combines his incredible journey with 70 plus years of Navy SEAL operational, training and elite lifestyle performance successes. His masterful ability to inspire enables individuals and teams to forge their Self-Confidence and commit to living a TEAM LIFE. \r\n  \r\n",
            "length": "14416167",
            "sourceUrl": "https://www.blogtalkradio.com/navysealradio/2013/09/07/team-life--mission-1-commitment.mp3",
            "categories": [
                {
                    "_": "Motivation",
                    "$": {
                        "domain": "http://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "Navy SEAL Training - Team Life",
            "datePublished": "Sat, 31 Aug 2013 13:30:00 GMT",
            "description": " In this high energy radio show, Navy SEAL David Rutherford explains  what it means to live the Team Life. David's motivational philosophy called Froglogic, calls  for individuals and groups to be holy committed to living a team oriented lifestyle. He outlines the 4 Missions a personal needs to accept in order to live the Team Life. HOOYAH\r\nTop Motivational Speaker and Navy SEAL, David Rutherford ignites audiences with his high energy, no nonsense approach to motivating people to succeed in any environment imaginable. As a top Behavioral Training Specialist and Author, David motives people from all walks of life with his motivational philosophy called Froglogic. Derived from 20 years of personal exploration into the human condition David combines his incredible journey with 70 plus years of Navy SEAL operational, training and elite lifestyle performance successes. His masterful ability to inspire enables individuals and teams to forge their Self-Confidence and commit to living a TEAM LIFE. \r\n  \r\n",
            "length": "14455664",
            "sourceUrl": "https://www.blogtalkradio.com/navysealradio/2013/08/31/navy-seal-training--team-life.mp3",
            "categories": [
                {
                    "_": "Motivation",
                    "$": {
                        "domain": "http://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "SEAL Team Ops - Battle Plan: Patience",
            "datePublished": "Sat, 24 Aug 2013 13:30:00 GMT",
            "description": " In this show, life coach David Rutherford shares with his audience the importance of a patient mindset when conducting life's operations. He exposes listeners to the incredibly difficult training regiment of the SEAL Teams. He explains how to apply his Froglogic concept into your life in order to embrace the long term reality of embracing your fears, forging your self-confidence, and living the Team Life. HOOYAH\r\nTop Motivational Speaker and Navy SEAL, David Rutherford ignites audiences with his high energy, no nonsense approach to motivating people to succeed in any environment imaginable. As a top Behavioral Training Specialist and Author, David motives people from all walks of life with his motivational philosophy called Froglogic. Derived from 20 years of personal exploration into the human condition David combines his incredible journey with 70 plus years of Navy SEAL operational, training and elite lifestyle performance successes. His masterful ability to inspire enables individuals and teams to forge their Self-Confidence and commit to living a TEAM LIFE. \r\n  \r\n",
            "length": "14387328",
            "sourceUrl": "https://www.blogtalkradio.com/navysealradio/2013/08/24/seal-team-ops--battle-plan-patience.mp3",
            "categories": [
                {
                    "_": "Motivation",
                    "$": {
                        "domain": "http://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "Navy SEAL Training - Direct Action",
            "datePublished": "Sat, 17 Aug 2013 13:30:00 GMT",
            "description": " In this action packed show, Navy SEAL David Rutherford explains the power of Direct Action Missions in combat and in life. He describes how Navy SEALs utilize their incredible committment towards each other to acheive mission success in the most extreme environments on the planet. Plus, he will help you understand how to apply this same mindset to acheiving your biggest goals in your life. Tune in and learn how to conduct your own Direct Action Missions now. HOOYAH\r\nTop Motivational Speaker and Navy SEAL, David Rutherford ignites audiences with his high energy, no nonsense approach to motivating people to succeed in any environment imaginable. As a top Behavioral Training Specialist and Author, David motives people from all walks of life with his motivational philosophy called Froglogic. Derived from 20 years of personal exploration into the human condition David combines his incredible journey with 70 plus years of Navy SEAL operational, training and elite lifestyle performance successes. His masterful ability to inspire enables individuals and teams to forge their Self-Confidence and commit to living a TEAM LIFE. \r\n  \r\n",
            "length": "14008865",
            "sourceUrl": "https://www.blogtalkradio.com/navysealradio/2013/08/17/navy-seal-training--direct-action.mp3",
            "categories": [
                {
                    "_": "Motivation",
                    "$": {
                        "domain": "http://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "SEAL Team Operations - Holding Positive Ground",
            "datePublished": "Sat, 10 Aug 2013 13:30:00 GMT",
            "description": " In this action packed show, Navy SEAL and Behavior Specialist David Rutherford explains the how to gain and hold, positive ground during the Combat of Life. He breaks why it's important in your life and how Navy SEALs stay positive in the most extreme envrionments imaginable. Tune in and learn how stand your ground and be positive doing it. HOOYAH\r\nTop Motivational Speaker and Navy SEAL, David Rutherford ignites audiences with his high energy, no nonsense approach to motivating people to succeed in any environment imaginable. As a top Behavioral Training Specialist and Author, David motives people from all walks of life with his motivational philosophy called Froglogic. Derived from 20 years of personal exploration into the human condition David combines his incredible journey with 70 plus years of Navy SEAL operational, training and elite lifestyle performance successes. His masterful ability to inspire enables individuals and teams to forge their Self-Confidence and commit to living a TEAM LIFE. \r\n  \r\n",
            "length": "14424526",
            "sourceUrl": "https://www.blogtalkradio.com/navysealradio/2013/08/10/seal-team-operations--holding-positive-ground-1.mp3",
            "categories": [
                {
                    "_": "Self Help",
                    "$": {
                        "domain": "http://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "Navy SEAL Training - Performing Basics to Perfection",
            "datePublished": "Sat, 03 Aug 2013 13:30:00 GMT",
            "description": " In his high engery show, Navy SEAL David Rutherford explains the absolute necessity for teams to learnign how to preform the basics to perfection. Execution is critical to all success and Navy SEALs train using this mindset. Learn how they do it and how to employ this concept into your teams operationional schedule. Call in, tweet or Facebook him to ask David any questions or just share a great story. HOOYAH. \r\nTop Motivational Speaker and Navy SEAL, David Rutherford ignites audiences with his high energy, no nonsense approach to motivating people to succeed in any environment imaginable. As a top Behavioral Training Specialist and Author, David motives people from all walks of life with his motivational philosophy called Froglogic. Derived from 20 years of personal exploration into the human condition David combines his incredible journey with 70 plus years of Navy SEAL operational, training and elite lifestyle performance successes. His masterful ability to inspire enables individuals and teams to forge their Self-Confidence and commit to living a TEAM LIFE. \r\n  \r\n",
            "length": "14420137",
            "sourceUrl": "https://www.blogtalkradio.com/navysealradio/2013/08/03/navy-seal-training--preforming-basics-to-perfection.mp3",
            "categories": [
                {
                    "_": "Motivation",
                    "$": {
                        "domain": "http://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "Navy SEAL Training - Taking Risk",
            "datePublished": "Sat, 27 Jul 2013 13:30:00 GMT",
            "description": " In this episode David explains the critical imporatnce to taking risks in your life. He will describe how Navy SEALs train themselves to take tactically sound, calculated risk every single day. There is no greater risk than putting your life on the line for your teammates. Catch this show and learn how to embrcae your fears to take the risk you've alwasy wanted to take. Change your way of thinking by enlisting David to become your new motivational swim buddy. HOOYAH!\r\nTop Motivational Speaker and Navy SEAL, David Rutherford ignites audiences with his high energy, no nonsense approach to motivating people to succeed in any environment imaginable. As a top Behavioral Training Specialist and Author, David motives people from all walks of life with his motivational philosophy called Froglogic. Derived from 20 years of personal exploration into the human condition David combines his incredible journey with 70 plus years of Navy SEAL operational, training and elite lifestyle performance successes. His masterful ability to inspire enables individuals and teams to forge their Self-Confidence and commit to living a TEAM LIFE. \r\n  \r\n",
            "length": "14424526",
            "sourceUrl": "https://www.blogtalkradio.com/navysealradio/2013/07/27/navy-seal-training--taking-risk.mp3",
            "categories": [
                {
                    "_": "Self Help",
                    "$": {
                        "domain": "http://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "SEAL Team - The Bond of the Brotherhood",
            "datePublished": "Sat, 20 Jul 2013 13:30:00 GMT",
            "description": " In this episode David explains why the SEAL Teams are such a close nit unit. He outlines the transformation that take place during training and while conducting the most dangerous operations around the world. If you're interested in why Navy SEALs are willing to die for one another this is the show for you. Don't miss it. OOUUTT\r\n Top Motivational Speaker and Navy SEAL, David Rutherford ignites audiences with his high energy, no nonsense approach to motivating people to succeed in any environment imaginable. As a top Behavioral Training Specialist and Author, David motives people from all walks of life with his motivational philosophy called Froglogic. Derived from 20 years of personal exploration into the human condition David combines his incredible journey with 70 plus years of Navy SEAL operational, training and elite lifestyle performance successes. His masterful ability to inspire enables individuals and teams to forge their Self-Confidence and commit to living a TEAM LIFE.\r\n  \r\n",
            "length": "14410942",
            "sourceUrl": "https://www.blogtalkradio.com/navysealradio/2013/07/20/seal-team--the-bond-of-the-brotherhood-1.mp3",
            "categories": [
                {
                    "_": "Motivation",
                    "$": {
                        "domain": "http://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "Navy SEAL Fitness",
            "datePublished": "Sat, 13 Jul 2013 13:30:00 GMT",
            "description": " In this episode David explains why Navy SEALs are considered some of the most fit warrior atheltes on the planet. How Navy SEAL Training Workouts, combine fintess, function and the operational mindset to acheive mind blowing success. He will help you explore new ideas to getting yourself into serious physcial, mental and spirtual shape. Allow David to introdcue you to the Froglogic Concept. Change your way of thinking by enlisting David to become your new motivational swim buddy. HOOYAH!\r\nTop Motivational Speaker and Navy SEAL, David Rutherford ignites audiences with his high energy, no nonsense approach to motivating people to succeed in any environment imaginable. As a top Behavioral Training Specialist and Author, David motives people from all walks of life with his motivational philosophy called Froglogic. Derived from 20 years of personal exploration into the human condition David combines his incredible journey with 70 plus years of Navy SEAL operational, training and elite lifestyle performance successes. His masterful ability to inspire enables individuals and teams to forge their Self-Confidence and commit to living a TEAM LIFE. \r\n  \r\n",
            "length": "14422436",
            "sourceUrl": "https://www.blogtalkradio.com/navysealradio/2013/07/13/navy-seal-fitness.mp3",
            "categories": [
                {
                    "_": "Motivation",
                    "$": {
                        "domain": "http://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "SEAL Training: The Psychology of Building an Elite Team",
            "datePublished": "Fri, 05 Jul 2013 13:30:00 GMT",
            "description": " In this episode David explains the ideas and concepts behind the SEAL Team Training doctrine. He lays out  the theory, then details the process used to forge the world's most elite warrior poets. Tune in to discover kinetic ways to destroy your limitations. Change your way of thinking by enlisting David to become your new motivational swim buddy, HOOYAH\r\nTop Motivational Speaker and Navy SEAL, David Rutherford ignites audiences with his high energy, no nonsense approach to motivating people to succeed in any environment imaginable. As a top Behavioral Training Specialist and Author, David motives people from all walks of life with his motivational philosophy called Froglogic. Derived from 20 years of personal exploration into the human condition David combines his incredible journey with 70 plus years of Navy SEAL operational, training and elite lifestyle performance successes. His masterful ability to inspire enables individuals and teams to forge their Self-Confidence and commit to living a TEAM LIFE. \r\n  \r\n",
            "length": "14414495",
            "sourceUrl": "https://www.blogtalkradio.com/navysealradio/2013/07/05/navy-seal-trainingthe-psychology-of-building-an-elite-team.mp3",
            "categories": [
                {
                    "_": "Motivation",
                    "$": {
                        "domain": "http://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "Navy SEAL Training - Failure = Success",
            "datePublished": "Sat, 29 Jun 2013 13:30:00 GMT",
            "description": "Top Motivational Speaker and Navy SEAL, David Rutherford ignites audiences with his high energy, no nonsense approach to motivating people to succeed in any environment imaginable. As a top Behavioral Training Specialist and Author, David motives people from all walks of life with his motivational philosophy called Froglogic. Derived from 20 years of personal exploration into the human condition David combines his incredible journey with 70 plus years of Navy SEAL operational, training and elite lifestyle performance successes. His masterful ability to inspire enables individuals and teams to forge their Self-Confidence and commit to living a TEAM LIFE. \r\nIn this episode David introduces his audience to his definition of \"Motivation\" as it relates to his experiences in the SEAL Teams and in his personal life. He will be recruiting you, his new teammates for your help defining this critical concept behind human success. Change your way of thinking by enlisting David to become your new motivational swim buddy. HOOYAH!\r\n",
            "length": "14421182",
            "sourceUrl": "https://www.blogtalkradio.com/navysealradio/2013/06/29/navy-seal-training--failure-success.mp3",
            "categories": [
                {
                    "_": "Motivation",
                    "$": {
                        "domain": "http://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "Navy SEAL Perseverance ",
            "datePublished": "Sat, 22 Jun 2013 13:30:00 GMT",
            "description": " In this episode David explains where the legendary Navy SEAL Perserverence comes from and how they use it to acheive total missions success in every environment imaginable. David will discuss SEAT Training,  SEAL Operations, and the personal drive that helps SEALs live like true Warrior Poets. Call in to find out how you can learn to embrace your fears, forge your self-confidence and life the Team Life too. HOOYAH\r\nTop Motivational Speaker and Navy SEAL, David Rutherford ignites audiences with his high energy, no nonsense approach to motivating people to succeed in any environment imaginable. As a top Behavioral Training Specialist and Author, David motives people from all walks of life with his motivational philosophy called Froglogic. Derived from 20 years of personal exploration into the human condition David combines his incredible journey with 70 plus years of Navy SEAL operational, training and elite lifestyle performance successes. His masterful ability to inspire enables individuals and teams to forge their Self-Confidence and commit to living a TEAM LIFE. \r\n  \r\n",
            "length": "14403210",
            "sourceUrl": "https://www.blogtalkradio.com/navysealradio/2013/06/22/navy-seal-perseverance.mp3",
            "categories": [
                {
                    "_": "Motivation",
                    "$": {
                        "domain": "http://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "Navy SEAL Training - Mission 8: Have Fun",
            "datePublished": "Sat, 15 Jun 2013 13:30:00 GMT",
            "description": "Top Motivational Speaker and Navy SEAL, David Rutherford ignites audiences with his high energy, no nonsense approach to motivating people to succeed in any environment imaginable. As a top Behavioral Training Specialist and Author, David motives people from all walks of life with his motivational philosophy called Froglogic. Derived from 20 years of personal exploration into the human condition David combines his incredible journey with 70 plus years of Navy SEAL operational, training and elite lifestyle performance successes. His masterful ability to inspire enables individuals and teams to forge their Self-Confidence and commit to living a TEAM LIFE. \r\nIn this episode David explains Mission 8: Have Fun from his self-help book \"Navy SEAL Training - Self-Confidence\". He outlines four steps to help get you and your team understand the importance of having fun while acheving your dreams. Don't miss David's \"Real World\" insight on this awesome topic. Please call and share you stories or questions with David and get your life sqaured away. HOOYAH. OOUUTT\r\n",
            "length": "14424735",
            "sourceUrl": "https://www.blogtalkradio.com/navysealradio/2013/06/15/navy-seal-training--mission-8-have-fun.mp3",
            "categories": [
                {
                    "_": "Motivation",
                    "$": {
                        "domain": "http://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "Navy SEAL Training - Misson 7: Mentoring ",
            "datePublished": "Sat, 01 Jun 2013 13:30:00 GMT",
            "description": "Top Motivational Speaker and Navy SEAL, David Rutherford ignites audiences with his high energy, no nonsense approach to motivating people to succeed in any environment imaginable. As a top Behavioral Training Specialist and Author, David motives people from all walks of life with his motivational philosophy called Froglogic. Derived from 20 years of personal exploration into the human condition David combines his incredible journey with 70 plus years of Navy SEAL operational, training and elite lifestyle performance successes. His masterful ability to inspire enables individuals and teams to forge their Self-Confidence and commit to living a TEAM LIFE. \r\n In this episode David describes Mission 7: Menotring from his Book \"Navy SEAL Training - Self-Confidence\". He outlines four steps to help you and your team embrace the importance of being mentored and mentoring others to forge self-confidnce. Don't miss David's \"Real World\" insight on this critical topic of life. Please call in and ask him any questions you might have on this topic or anything related to the SEAL Teams and the Team Life. HOOYAH! \r\n",
            "length": "14354727",
            "sourceUrl": "https://www.blogtalkradio.com/navysealradio/2013/06/01/navy-seal-training--misson-7-mentoring-1.mp3",
            "categories": [
                {
                    "_": "Motivation",
                    "$": {
                        "domain": "http://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "Navy SEAL Training - Mission 6: Integrity",
            "datePublished": "Sat, 25 May 2013 13:30:00 GMT",
            "description": " In this episode David introduces his audience to the four steps listeners can use to Live With Integrity every day of their lives. Trying to be honorable in such a negative world is extrmely tough. David breaks down the importance of living with integirty in your life according his personal insight and through the eyes is a Navy SEAL? Please feel free to call in and ask David questions about living with integrity or any other matter regarding your personal or professional motivation. Change your way of thinking by enlisting David to become your new motivational swim buddy. HOOYAH\r\nTop Motivational Speaker and Navy SEAL, David Rutherford ignites audiences with his high energy, no nonsense approach to motivating people to succeed in any environment imaginable. As a top Behavioral Training Specialist and Author, David motives people from all walks of life with his motivational philosophy called Froglogic. Derived from 20 years of personal exploration into the human condition David combines his incredible journey with 70 plus years of Navy SEAL operational, training and elite lifestyle performance successes. His masterful ability to inspire enables individuals and teams to forge their Self-Confidence and commit to living a TEAM LIFE.\r\n",
            "length": "14410315",
            "sourceUrl": "https://www.blogtalkradio.com/navysealradio/2013/05/25/navy-seal-training--mission-6-integrity.mp3",
            "categories": [
                {
                    "_": "Motivation",
                    "$": {
                        "domain": "http://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "Navy SEAL Training - Mission 5: Set Goals",
            "datePublished": "Sat, 18 May 2013 13:30:00 GMT",
            "description": "Top Motivational Speaker and Navy SEAL, David Rutherford ignites audiences with his high energy, no nonsense approach to motivating people to succeed in any environment imaginable. As a top Behavioral Training Specialist and Author, David motives people from all walks of life with his motivational philosophy called Froglogic. Derived from 20 years of personal exploration into the human condition David combines his incredible journey with 70 plus years of Navy SEAL operational, training and elite lifestyle performance successes. His masterful ability to inspire enables individuals and teams to forge their Self-Confidence and commit to living a TEAM LIFE. \r\nIn this episode David introduces his audience to his definition of \"Motivation\" as it relates to his experiences in the SEAL Teams and in his personal life. He will be recruiting you, his new teammates for your help defining this critical concept behind human success. Change your way of thinking by enlisting David to become your new motivational swim buddy. HOOYAH!\r\n",
            "length": "14419092",
            "sourceUrl": "https://www.blogtalkradio.com/navysealradio/2013/05/18/navy-seal-training--mission-5-set-goals.mp3",
            "categories": [
                {
                    "_": "Motivation",
                    "$": {
                        "domain": "http://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "Navy SEAL Training - Mission 4 - Earn Respect",
            "datePublished": "Sat, 11 May 2013 13:30:00 GMT",
            "description": "Top Motivational Speaker and Navy SEAL, David Rutherford ignites audiences with his high energy, no nonsense approach to motivating people to succeed in any environment imaginable. As a top Behavioral Training Specialist and Author, David motives people from all walks of life with his motivational philosophy called Froglogic. Derived from 20 years of personal exploration into the human condition David combines his incredible journey with 70 plus years of Navy SEAL operational, training and elite lifestyle performance successes. His masterful ability to inspire enables individuals and teams to forge their Self-Confidence and commit to living a TEAM LIFE. \r\nIn this episode David introduces his audience to the four steps they can use to learn how to Earn Respect every day of their lives. We all seek the respect of our family, friedns and peers, but do you really know how to acheive this goal? He will be recruiting you, his new teammates for your help defining this critical concept behind human success. Change your way of thinking by enlisting David to become your new motivational swim buddy. HOOYAH!\r\n",
            "length": "14401329",
            "sourceUrl": "https://www.blogtalkradio.com/navysealradio/2013/05/11/navy-seal-training--mission-4--earn-respect.mp3",
            "categories": [
                {
                    "_": "Motivation",
                    "$": {
                        "domain": "http://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "Navy SEAL Training Mission 3: Motivate Yourself & Others",
            "datePublished": "Sat, 04 May 2013 13:30:00 GMT",
            "description": "Top Motivational Speaker and Navy SEAL, David Rutherford ignites audiences with his high energy, no nonsense approach to motivating people to succeed in any environment imaginable. As a top Behavioral Training Specialist and Author, David motives people from all walks of life with his motivational philosophy called Froglogic. Derived from 20 years of personal exploration into the human condition David combines his incredible journey with 70 plus years of Navy SEAL operational, training and elite lifestyle performance successes. His masterful ability to inspire enables individuals and teams to forge their Self-Confidence and commit to living a TEAM LIFE. \r\n In this episode David introduces his audience to Mission 3 in his adult field manual titled \"Navy SEAL Training - Self-Confidence\". In Mission 3: Motivate Yourself and Others, David explains the four steps to help get you motivated and reshape your life in order to forge your self-confidnece.  Become a part of Team Froglogic, call in to the show and share your ideas with David or ask him a question concerning your life. Change your way of thinking by enlisting David to become your new motivational swim buddy. HOOYAH!\r\n",
            "length": "14413032",
            "sourceUrl": "https://www.blogtalkradio.com/navysealradio/2013/05/04/navy-seal-training-mission-3-motivate-yourself-others.mp3",
            "categories": [
                {
                    "_": "Motivation",
                    "$": {
                        "domain": "http://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "Navy SEAL Training Mission 2 - PT & Live Healthy",
            "datePublished": "Sat, 27 Apr 2013 13:30:00 GMT",
            "description": "Top Motivational Speaker and Navy SEAL, David Rutherford ignites audiences with his high energy, no nonsense approach to motivating people to succeed in any environment imaginable. As a top Behavioral Training Specialist and Author, David motives people from all walks of life with his motivational philosophy called Froglogic. Derived from 20 years of personal exploration into the human condition David combines his incredible journey with 70 plus years of Navy SEAL operational, training and elite lifestyle performance successes. His masterful ability to inspire enables individuals and teams to forge their Self-Confidence and commit to living a TEAM LIFE. \r\nIn this episode David introduces his audience to Mission 2 in his adult field manual titled \"Navy SEAL Training - Self-Confidence\". In Mission 2, PT & Live Healthy David explains the four steps to help you reshape your life in order to forge your self-confidnece.  Become a part of Team Froglogic and call in to share your ideas with David or ask him a question concerning your life. Change your way of thinking by enlisting David to become your new motivational swim buddy. HOOYAH!\r\n",
            "length": "14407808",
            "sourceUrl": "https://www.blogtalkradio.com/navysealradio/2013/04/27/navy-seal-training-mission-2--pt-live-healthy.mp3",
            "categories": [
                {
                    "_": "Motivation",
                    "$": {
                        "domain": "http://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "Self-Confidence Mission 1 - Have a Positive Attitude",
            "datePublished": "Sat, 20 Apr 2013 13:30:00 GMT",
            "description": "Top Motivational Speaker and Navy SEAL, David Rutherford ignites audiences with his high energy, no nonsense approach to motivating people to succeed in any environment imaginable. As a top Behavioral Training Specialist and Author, David motives people from all walks of life with his motivational philosophy called Froglogic. Derived from 20 years of personal exploration into the human condition David combines his incredible journey with 70 plus years of Navy SEAL operational, training and elite lifestyle performance successes. His masterful ability to inspire enables individuals and teams to forge their Self-Confidence and commit to living a TEAM LIFE. \r\nIn this episode David introduces his audience to Froglogic Self-Confidence Mission 1: Have a Positive Attitude. David describes in detail how to forge a Positive Attitude. He will be recruiting you, his new teammates for your help defining this critical concept behind human success. Change your way of thinking by enlisting David to become your new motivational swim buddy. For more infor please visit his website at www.teamfroglogic.com  HOOYAH!\r\n",
            "length": "14406972",
            "sourceUrl": "https://www.blogtalkradio.com/navysealradio/2013/04/20/self-confidence-mission-1--have-a-positive-attitude.mp3",
            "categories": [
                {
                    "_": "Motivation",
                    "$": {
                        "domain": "http://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "Navy SEAL Training - Self-Confidence",
            "datePublished": "Sat, 13 Apr 2013 13:30:00 GMT",
            "description": "Top Motivational Speaker and Navy SEAL, David Rutherford ignites audiences with his high energy, no nonsense approach to motivating people to succeed in any environment imaginable. As a top Behavioral Training Specialist and Author, David motives people from all walks of life with his motivational philosophy called Froglogic. Derived from 20 years of personal exploration into the human condition David combines his incredible journey with 70 plus years of Navy SEAL operational, training and elite lifestyle performance successes. His masterful ability to inspire enables individuals and teams to forge their Self-Confidence and commit to living a TEAM LIFE. \r\nIn this episode David breaks down the Froglogic Concept by explaining the why it's critical for a person to forge their personal and professional Self-Confidnence. He introduces his audience to 8 Missions he describes in his adult book, \"Navy SEAL Training - Self-Confidence.\" These missions are the same concepts David used to become an operational Navy SEAL. He will be recruiting you, his new teammates for your help defining Self-Confidence and how you forge yours daily. Change your way of thinking by enlisting David to become your new motivational swim buddy. HOOYAH!\r\n",
            "length": "14411778",
            "sourceUrl": "https://www.blogtalkradio.com/navysealradio/2013/04/13/navy-seal-training--self-confidence-1.mp3",
            "categories": [
                {
                    "_": "Motivation",
                    "$": {
                        "domain": "http://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "What is Froglogic? Think Like a Navy SEAL Frogman",
            "datePublished": "Sat, 06 Apr 2013 13:30:00 GMT",
            "description": "Top Motivational Speaker and Navy SEAL, David Rutherford ignites audiences with his high energy, no nonsense approach to motivating people to succeed in any environment imaginable. As a top Behavioral Training Specialist and Author, David motives people from all walks of life with his motivational philosophy called Froglogic. Derived from 20 years of personal exploration into the human condition David combines his incredible journey with 70 plus years of Navy SEAL operational, training and elite lifestyle performance successes. His masterful ability to inspire enables individuals and teams to forge their Self-Confidence and commit to living a TEAM LIFE. \r\nIn this episode David introduces his audience to the Froglogic Concepts. Listen to David explain his motivational philosophy which combines 20 years of personal discovery with 70 years of Navy SEAL sacrifce and experiecne. He will give his insight on the very truth behind what it takes for the human condition to succeed in any environement. David needs your help, his new teammates to help to share your amazing experiecnes in acheiving personal and professional success. Change your way of thinking by enlisting David to become your new motivational swim buddy. HOOYAH!\r\n",
            "length": "14386910",
            "sourceUrl": "https://www.blogtalkradio.com/navysealradio/2013/04/06/what-is-froglogic-think-like-a-navy-seal-frogman.mp3",
            "categories": [
                {
                    "_": "Motivation",
                    "$": {
                        "domain": "http://www.blogtalkradio.com/"
                    }
                }
            ]
        },
        {
            "title": "Navy SEAL Motivation Defined",
            "datePublished": "Sat, 30 Mar 2013 13:30:00 GMT",
            "description": "Top Motivational Speaker and Navy SEAL, David Rutherford ignites audiences with his high energy, no nonsense approach to motivating people to succeed in any environment imaginable. As a top Behavioral Training Specialist and Author, David motives people from all walks of life with his motivational philosophy called Froglogic. Derived from 20 years of personal exploration into the human condition David combines his incredible journey with 70 plus years of Navy SEAL operational, training and elite lifestyle performance successes. His masterful ability to inspire enables individuals and teams to forge their Self-Confidence and commit to living a TEAM LIFE. \r\nIn this episode David introduces his audience to his definition of \"Motivation\" as it relates to his experiences in the SEAL Teams and in his personal life. He will be recruiting you, his new teammates for your help defining this critical concept behind human success. Change your way of thinking by enlisting David to become your new motivational swim buddy. HOOYAH!\r\n",
            "length": "14285763",
            "sourceUrl": "https://www.blogtalkradio.com/navysealradio/2013/03/30/navy-seal-motivation-defined.mp3",
            "categories": [
                {
                    "_": "Motivation",
                    "$": {
                        "domain": "http://www.blogtalkradio.com/"
                    }
                }
            ]
        }
    ]
}