{
    "artwork": "http://is5.mzstatic.com/image/thumb/Music62/v4/ef/e9/38/efe9389d-4435-2122-2c19-4de0b215ea99/source/100x100bb.jpg",
    "description": "Can you imagine becoming a single mother by choice, not by accident? I’ve been chronicling my own journey for six years to tell this story, about making choices and taking action to live the life you want. If you’re a parent, want to be a parent, or just love good storytelling, this podcast is for you.",
    "feedURL": "https://rss.art19.com/not-by-accident",
    "podcastURL": "https://art19.com/shows/not-by-accident",
    "title": "Not By Accident",
    "episodes": [
        {
            "title": "Ep 34: Springtime",
            "datePublished": "Thu, 27 Sep 2018 07:21:35 -0000",
            "description": "\n        <p>We have a great start to 2018. Fireworks on New Year’s Eve. You and me, and thousands of Canberrans by the lake on a perfect summer’s evening. Life is in control. I have a grant to write a book, Wondery wants the podcast to continue, advertisers are keen, listeners seem keen. I thought I was just about done, but all this has me feeling optimistic.&nbsp;</p><p>You’re reaching new levels of autonomy, independence, with thoughts, interests and a whole world opening up that has nothing to do with me. You challenge me, you question me, sometimes you know things I don’t know. You have a point of view. You always did in a way, but somehow this is new.&nbsp;&nbsp;</p><p>Childcare and preschool have prepared you (and me) for Kindergarten. You’re ready. For now, school is exactly where you want to be.</p><p>I’m at crossroads again. I’ve been heading for it for a while. I need to make a change. I need to finish writing the book.&nbsp;</p><p>I’ve said most of what I wanted to say in our podcast. I’ve spent almost three years making 34 episodes, it’s almost 16 hours. Our lives as stories, for me, for our family, for all people who chose to listen, but most of all for you. It’s yours Astrid, forever, with all my love.&nbsp;</p><p>You’re an autonomous person now. It’s time to let you be the custodian of your own story.&nbsp;</p><p>This is the end of season two. It is time to stop. I predict one or two stray episodes in the future when there’s something worth saying, but more or less, this is it. There won’t be a season three.</p><p>If this was fiction, we’d have a big ending. Something life-changing. But this isn’t fiction. This isn’t the future. This is real life. This is now.</p><p>Instead I’ll end with something I can control. This occasion deserves a party!</p><p><br></p><p>This production is made by me, Sophie Harper, in partnership with Wondery. We’re supported by generous listeners. Story editing by Michelle Webster.</p><p>Thank you family and friends for letting me share your stories and for all your support.&nbsp;</p><p>Music from freemusicarchive.org - CC NC License: <em>Charge Into 2015</em>, <em>The Time To Run</em> and<em>The Stars Are Out (Interlude)</em> by Dexter Britain, <em>Tam8+ei4 </em>by LJ Kruzer and<em> Spellbound </em>by Broke For Free.&nbsp;</p><p>Ad music from freemusicarchive.org - CC Commercial License:&nbsp;<em>Drop of Water in the Ocean </em>by Broke For Free.</p><p>&nbsp;</p><p>Go to&nbsp;<a href=\"http://www.notbyaccident.net/\" target=\"_blank\">www.notbyaccident.net</a> to find out more about the series, to get in touch and join the e-newsletter to hear what we’re up to.</p><p>I will miss all you listeners. Some have become real world friends, and many more feel like friends to me. I have been so deeply touched my your emails, reviews, voice messages and by your donations. I truely will treasure your words for the rest of my life. I think we both will. And you can know we’re both here, figuring things out, adapting our priorities, sometimes struggling, sometimes succeeding, just living life. Don’t worry, we’re still here in real life.&nbsp;</p><p>If&nbsp;you’d like to send a one-off donation, go to <a href=\"http://www.paypal.me/notbyaccident\" target=\"_blank\">www.paypal.me/notbyaccident</a>.&nbsp;</p><p>Thank you so much you amazing people who have supported us on Patreon!&nbsp;</p><p>Julie Greb, Margaret P. Jones, Trish Perlen, Angela Kim, Emma Burbank, Ellie McHale, Russell Kerrison, Julie Greenhalgh, Rebecca Reid, Kasey Tomkins, Dianne Firth, Anne Staude, Sarah E. Leslie, Adam Coulson, Melanie Ann, Lea Durie, Laura Getson, Bill, Sue Giugni, Maia Bittner, Elizabeth Adcock, Megan O’Brien, Katie Wolgamot, Hannah Lownsbrough, Lilit Asiryan, Laura Madge, Laura Cherry, Bethany White, Paul S Mitchell, Mariele Thadani, Pip Muir, Cynthia Madia and more.</p><p>Sponsored by Hello Fresh: US listeners, For a total of $60 off, that’s $20 off your first 3 boxes, visit <a href=\"http://hellofresh.com/accident60\" target=\"_blank\">hellofresh.com/accident60</a> and enter&nbsp;accident60.</p><p>Thank you so much for listening.</p>\n      ",
            "length": "38479830",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/rss.art19.com/episodes/b056d5c4-5348-49b0-ae6c-63ba53a6b635.mp3",
            "epNo": "34"
        },
        {
            "title": "Ep 33: Enough",
            "datePublished": "Fri, 24 Aug 2018 13:27:02 -0000",
            "description": "\n        <p>I never thought it was ideal being a two person family. There’s not somebody obvious for you to turn to when I let you down. It’s a lot of pressure, for both of us, forever I suppose. If I keep being single as I age and you grow up, I’m afraid you’ll feel responsible for me. That you have to put off things in your own life to be here for me. I want you to do what you want to do, to live in another city, or country, to make choices for you, to have an interesting life. I don’t want you to be burdened or worried or responsible for me. But because I’m an older mother, a geriatric mother, a single mother, and because you’re my only child, I’m afraid you will.&nbsp;</p><p>I thought maybe I’d have another baby. I thought I’d reserve some samples from your donor so you’d be full biological siblings. I intended to reserve some. It never even occurred to me to freeze my eggs to buy more time. Life was more expensive. I never had money to spare. It was always in the back of my mind, the reservation. I could have prioritised it. I’m sure I could have. But I didn’t.</p><p>Sometimes decisions are taken out of your hands. You apply for something and others make the decision on whether you can have it. You aspire to something, work towards it, but lack of money or time, or health, or privilege, or luck keep it out of reach. Sometimes you just don’t quite make a decision, and realise one day that you no longer have a choice.&nbsp;</p><p><br></p><p><br></p><p>This production is made by Sophie and Astrid Harper, in partnership with Wondery. We’re supported by generous listeners. Story editing by Michelle Webster.</p><p>Thank you family and friends for letting me share your stories. Extra thanks for letting me record, Adelin, Caroline, Lauren, and of course Astrid.</p><p>&nbsp;Music from freemusicarchive.org - CC NC License: <em>One And </em>and<em> Spellbound </em>by Broke For Free.&nbsp;</p><p>By permission from the artist: <em>You, You’ll be Waiting</em> by Baby Blue.&nbsp;</p><p>Ad music from freemusicarchive.org - CC Commercial License:&nbsp;<em>Drop of Water in the Ocean </em>by Broke For Free.</p><p><br></p><p>Thank you so much you amazing people who support us on Patreon!&nbsp;</p><p>Julie Greb, Margaret P. Jones, Trish Perlen, Angela Kim, Emma Burbank, Ellie McHale, Russell Kerrison, Julie Greenhalgh, Rebecca Reid, Kasey Tomkins, Dianne Firth, Anne Staude, Sarah E. Leslie, Adam Coulson, Melanie Ann, Lea Durie, Laura Getson, Bill, Sue Giugni, Maia Bittner, Elizabeth Adcock, Megan O’Brien, Katie Wolgamot, Hannah Lownsbrough, Lilit Asiryan, Laura Madge, Laura Cherry, Bethany White, Paul S Mitchell, Mariele Thadani, Pip Muir, Cynthia Madia and more.</p><p>If&nbsp;you’d like to send a one-off donation, go to <a href=\"http://www.paypal.me/notbyaccident\" target=\"_blank\">www.paypal.me/notbyaccident</a>.&nbsp;</p><p>&nbsp;</p><p>Go to&nbsp;<a href=\"http://www.notbyaccident.net/\" target=\"_blank\">www.notbyaccident.net</a> to find out more about the series, join the e-newsletter or to get in touch.</p><p><br></p><p>Sponsored by Hello Fresh: US listeners, For a total of $60 off, that’s $20 off your first 3 boxes, visit <a href=\"http://hellofresh.com/accident60\" target=\"_blank\">hellofresh.com/accident60</a> and enter&nbsp;accident60.</p><p><br></p><p>We’ll be back with the next instalment, the end of season two, in about 4 weeks.</p><p><br></p>\n      ",
            "length": "19432594",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/rss.art19.com/episodes/d52a375a-f9d7-424d-9d0e-06bb0ef5e4ca.mp3",
            "epNo": "33"
        },
        {
            "title": "Ep 32: And the World is!",
            "datePublished": "Fri, 27 Jul 2018 07:48:46 -0000",
            "description": "\n        <p>We’re watching Mimi’s bridal waltz, lit by the sunset’s golden glow in a retro-opulent ballroom, filled with love. I have a huge lump in my throat. I can’t quite believe we’re here, for this moment, for Michael and Antonia, young lovers who lost touch for years, then found each other again, and somehow found themselves. They seem as filled with joy as it’s possible to be. And I am too, as I look around the table at our closest friends from Denmark who we left a year ago, reunited, as if geography is nothing and the bonds of friendship are everything. I glance out at golden Manhattan across the East River, as I squeeze you on my lap, my little companion, and my depletion is filled up. By this city, this adventure, these people, this wedding, by all this love and by you.</p><p>There have been obstacles getting here. I needed help with the money. And travel with a kid is hard. I haven’t been able to control everything. Sleep is a battle, with jet lag and adrenalin pushing us further and further out of sync. But amongst logistical headaches, so many moments have been magical, since we left Canberra on last week’s pre-dawn flight. </p><p><br></p><p>This production is made by Sophie and Astrid Harper, in partnership with Wondery. We’re supported by generous listeners. Dear patreon supporters, I can’t tell you how much I appreciate the ongoing support. Story editing by Michelle Webster.</p><p>Thanks to Michael and Antonia, Steen, Ana, Jim, Anne and the boys, to my biggest nephew Sebastian, and especially to you Astrid, for letting me share your stories.&nbsp;</p><p>Music from the wedding (invoking Fair Use) <em>That’s Amore </em>by Dean Martin, <em>New York New York </em>by Frank Sinatra, <em>Ave Maria </em>by<em> </em>Bach/Gounod, <em>Get Ready</em> by The Temptations, <em>You Send Me </em>by Sam Cooke, <em>Unchained Melody</em> by The Righteous Brothers and <em>Girls Just Wanna Have Fun </em>by Cyndi Lauper.&nbsp;</p><p>Ad music from freemusicarchive.org - CC Commercial License:&nbsp;</p><p><em>Drop of Water in the Ocean </em>by Broke For Free.</p><p><br></p><p><strong>Sponsored by Hello Fresh: </strong>US listeners, for $30 off your first week of HelloFresh, visit&nbsp;<a href=\"http://hellofresh.com/\" target=\"_blank\"><strong>hellofresh.com</strong></a><strong>/accident30 </strong>and enter code&nbsp;<strong><em>ACCIDENT30</em></strong></p><p>&nbsp;</p><p>Thank you kind people supporting us on Patreon! Margaret P. Jones, Trish Perlen, Angela Kim, Emma Burbank, Ellie McHale, Russell Kerrison, Julie Greenhalgh, Rebecca Reid, Kasey Tomkins, Dianne Firth, Anne Staude, Sarah E. Leslie, Adam Coulson, Melanie Ann, Lea Durie, Laura Getson, Bill, Sue Giugni, Maia Bittner, Elizabeth Adcock, Megan O’Brien, Katie Wolgamot, Hannah Lownsbrough, Lilit Asiryan, Laura Madge, Laura Cherry, Bethany White, Paul S Mitchell, Mariele Thadani, Pip Muir and more.</p><p>If&nbsp;<em>you’d </em>like to chip in a couple of dollars towards each new episode, go to&nbsp;<a href=\"http://patreon.com/notbyaccident\" target=\"_blank\"><strong>patreon.com/notbyaccident</strong></a>.&nbsp;</p><p>&nbsp;</p><p>Go to&nbsp;<a href=\"http://www.notbyaccident.net/\" target=\"_blank\">www.notbyaccident.net</a> to find out more about the series, join the e-newsletter or to get in touch.</p><p>&nbsp;</p><p>We’ll be back with the next instalment in about 4 weeks.</p>\n      ",
            "length": "28351007",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/rss.art19.com/episodes/d8b02724-46ac-4684-8637-ce61e00ed4fe.mp3",
            "epNo": "32"
        },
        {
            "title": "Ep 31: Taking Off",
            "datePublished": "Mon, 18 Jun 2018 11:40:26 -0000",
            "description": "\n        <p>It's May 2016. The podcast is taking off. Astrid's new cousin is due next month! And I can't decide if we should ignore the fact that we are broke and somehow find a way to go to New York for Mimi's wedding, for a reunion with our friends from Denmark one year on, while Astrid still remembers them.</p><p>Time has turned in on itself. These events of mid 2016 might feel familiar, though context has changed. The series has become a mobius strip.</p><p>&nbsp;</p><p>This production is made by Sophie and Astrid Harper, in partnership with Wondery. We’re supported by generous listeners. Story editing by Michelle Webster.</p><p>&nbsp;</p><p>Thanks to my family and friends for being part of the story, and especially to Astrid.&nbsp;</p><p>&nbsp;</p><p>Music from freemusicarchive.org - CC NC License:</p><p><em>Weathered Home 3:Bird Split Sky </em>by Candlegravity,&nbsp;<em>Sound Merchant</em> by simon_mathewson and&nbsp;<em>Readers! Do You Read?&nbsp;</em>by Chris Zabriskie.&nbsp;</p><p>&nbsp;</p><p>Ad music from freemusicarchive.org - CC Commercial License:&nbsp;</p><p><em>Drop of Water in the Ocean </em>by Broke For Free.</p><p><br></p><p><strong>Sponsors&nbsp;</strong></p><p><strong>care/of:</strong> US listeners, for&nbsp;25% off your first month of personalized care/of vitamins, visit<strong> takecareof.com </strong>and enter code<strong> ACCIDENT.</strong></p><p><strong>Hello Fresh: </strong>US listeners, for $30 off your first week of HelloFresh, visit&nbsp;<a href=\"http://hellofresh.com/\" target=\"_blank\"><strong>hellofresh.com</strong></a><strong>/accident30 </strong>and enter code&nbsp;<strong><em>ACCIDENT30</em></strong></p><p>&nbsp;</p><p>Thank you kind people supporting us on Patreon! Margaret P. Jones, Trish Perlen, Angela Kim, Emma Burbank, Ellie McHale, Russell Kerrison, Julie Greenhalgh, Rebecca Reid, Kasey Tomkins, Dianne Firth, Anne Staude, Sarah E. Leslie, Adam Coulson, Melanie Ann, Lea Durie, Laura Getson, Bill, Sue Giugni, Maia Bittner, Elizabeth Adcock, Megan O’Brien, Katie Wolgamot, Hannah Lownsbrough, Lilit Asiryan, Laura Madge, Laura Cherry, Bethany White, Paul S Mitchell and Mariele Thadani and more.</p><p>If&nbsp;<em>you’d </em>like to chip in a couple of dollars towards each new episode, go to&nbsp;<a href=\"http://patreon.com/notbyaccident\" target=\"_blank\"><strong>patreon.com/notbyaccident</strong></a>.&nbsp;</p><p>&nbsp;</p><p>Go to&nbsp;<a href=\"http://www.notbyaccident.net/\" target=\"_blank\">www.notbyaccident.net</a> to find out more about the series, join the e-newsletter or to get in touch.</p><p>&nbsp;</p><p>We’ll be back with the next instalment in about 4 weeks.</p>\n      ",
            "length": "24601913",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/rss.art19.com/episodes/ae6c6be2-b167-4f51-93bc-6c1b9a99fcdd.mp3",
            "epNo": "31"
        },
        {
            "title": "Ep 30: Going Public",
            "datePublished": "Fri, 18 May 2018 14:32:12 -0000",
            "description": "\n        <p>I get to work on too many ideas. I’m going to work for myself. That’s decided. I register as a business, open a bank account, brainstorm plans, buy three web domains. There are a lot of things I want to do. I’ll be a freelancer, teaching, video production, maybe other things, but not too much. I can’t be swamped because there’s more. I’ll start an online documentary school. I’ll write some books. I know what I want to write. I’m itching to start. And I have three podcast ideas. Cooking with my mum, documentary filmmaker conversations, and our story. I want to do them all!</p><p>I have to pick a place to start and our podcast is the one closest to my heart. I try to turn down the volume on all my screaming ideas and to concentrate. Since 2011 I’ve recorded clips from my life, from our lives, with the hope that one day I could use them to tell the story of becoming a single mother by choice. I’ve been writing little passages in my head for years. I have 300 audio clips, about 200 hours. I listen, I trim, I take notes, I double the speed. Days pass like this. It’s going to take forever. Sometimes it feels voyeuristic. Peering into a past life. One I’d partially forgotten, as if it’s someone else’s.&nbsp;</p><p>I pick a date. I announce the series. Now I can’t back out. This is happening.&nbsp;</p><p>&nbsp;&nbsp;</p><p>This production is made by Sophie and Astrid Harper, in partnership with Wondery. We’re supported by generous listeners. Story editing by Michelle Webster.</p><p>Thanks to my family and friends for being part of the story, and especially to Astrid.&nbsp;</p><p>Music from freemusicarchive.org - CC NC License:</p><p><em>Charge Into 2015 </em>by Dexter Britain,&nbsp;<em>Eutrophic </em>by Mystery Mammal and&nbsp;<em>Ennui </em>by Lee Rosevere.&nbsp;</p><p>Ad music from freemusicarchive.org - CC Commercial License:&nbsp;</p><p><em>Drop of Water in the Ocean </em>by Broke For Free.</p><p><strong>Hello Fresh: </strong>US listeners, for $30 off your first week of HelloFresh, visit&nbsp;<a href=\"http://hellofresh.com/accident30\" target=\"_blank\"><strong>hellofresh.com/accident30</strong></a><strong> </strong>and enter code&nbsp;<strong><em>ACCIDENT30</em></strong></p><p>Thank you kind people supporting us on Patreon! Margaret P. Jones, Trish Perlen, Angela Kim, Emma Burbank, Ellie McHale, Russell Kerrison, Julie Greenhalgh, Rebecca Reid, Kasey Tomkins, Dianne Firth, Anne Staude, Sarah E. Leslie, Adam Coulson, Melanie Ann, Lea Durie, Laura Getson, Bill, Sue Giugni, Maia Bittner, Elizabeth Adcock, Megan O’Brien, Katie Wolgamot, Lilit Asiryan, Laura Madge, Laura Cherry, Bethany White, Paul S Mitchell and Mariele Thadani and more.</p><p>If&nbsp;<em>you’d</em>like to chip in a couple of dollars towards each new episode, go to&nbsp;<a href=\"http://patreon.com/notbyaccident\" target=\"_blank\"><strong>patreon.com/notbyaccident</strong></a>.</p><p>Go to&nbsp;<a href=\"http://www.notbyaccident.net/\" target=\"_blank\">www.notbyaccident.net</a> to find out more about the series, join the e-newsletter or to get in touch.</p><p>We’ll be back with the next instalment in about 4 weeks.</p>\n      ",
            "length": "21074755",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/rss.art19.com/episodes/e0de5531-cf71-4a5d-872f-7948b2ce398c.mp3",
            "epNo": "30"
        },
        {
            "title": "Ep 29: For Kids",
            "datePublished": "Wed, 18 Apr 2018 09:56:28 -0000",
            "description": "\n        <p>A special episode of&nbsp;<em>Not By Accident</em>&nbsp;for kids!&nbsp;</p><p>It's a child- appropriate recap of Astrid's story, at her request and with her involvement.&nbsp;</p><p>The first part is about when she was little. The second part is about life now that she's big.</p><p>&nbsp;</p><p>This production is made by Astrid Harper and Sophie Harper, in partnership with Wondery. We’re supported by generous listeners.&nbsp;</p><p>&nbsp;</p><p>Music from freemusicarchive.org - CC NC License:</p><p><em>The Time to Run (Finale) </em>by Dexter Britain,&nbsp;<em>Readers! Do You Read?</em>And&nbsp;<em>Divider</em>by Chris Zabriskie and&nbsp;<em>Something Elated&nbsp;</em>by Broke for Free.&nbsp;</p><p>Ad music from freemusicarchive.org - CC Commercial License:&nbsp;</p><p><em>Drop of Water in the Ocean</em>by Broke For Free.</p><p>&nbsp;</p><p><strong>Hello Fresh:</strong>For $30 off your first week of HelloFresh, visit&nbsp;<a href=\"http://hellofresh.com/\" target=\"_blank\"><strong>hellofresh.com</strong></a>and enter code&nbsp;<strong><em>ACCIDENT30</em></strong></p><p>&nbsp;</p><p>Thank you kind people supporting us on Patreon! Margaret P. Jones, Emma Burbank, Ellie McHale, Russell Kerrison, Julie Greenhalgh, Rebecca Reid, Kasey Tomkins, Dianne Firth, Anne Staude, Sarah E. Leslie, Adam Coulson, Melanie Ann, Lea Durie, Laura Getson, Bill, Sue Giugni, Maia Bittner, Elizabeth Adcock, Megan O’Brien, Katie Wolgamot, Lilit Asiryan, Laura Madge, Laura Cherry, Bethany White, Paul S Mitchell and Mariele Thadani and more.</p><p>If&nbsp;<em>you’d</em>like to chip in a couple of dollars towards each new episode, go to&nbsp;<a href=\"http://patreon.com/notbyaccident\" target=\"_blank\"><strong>patreon.com/notbyaccident</strong></a>.</p><p>&nbsp;</p><p>Go to&nbsp;<a href=\"http://www.notbyaccident.net/\" target=\"_blank\">www.notbyaccident.net</a> to find out more about the series, join the e-newsletter or to get in touch.</p><p>&nbsp;</p>\n      ",
            "length": "24482795",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/rss.art19.com/episodes/23a612ff-8420-47fe-8da3-9f541f658424.mp3",
            "epNo": "29"
        },
        {
            "title": "Ep 28: Consolidation",
            "datePublished": "Wed, 21 Mar 2018 05:16:38 -0000",
            "description": "\n        <p>We’re trying to create a home, but I have things to sort out. The detritus of my life is in storage units and suburban garages. The belongings I packed away as one life stage ended and a new one began; they’re spread around. It makes me feel uneasy. Summer is upon us, our Danish shipment has settled into our new apartment, and I feel ready at last to consolidate. Ready to re-contextualise myself, in my own life story. As you try to contextualize yourself, and our little family that looks different to the ones you see around you. And find your place in our wider family. </p><p>I have a storage container in Sydney. I moved to Denmark with two boxes and two suitcases. Shipping the rest didn’t make sense. As years passed, with the monthly direct debits adding up, I wished I wasn’t so sentimental. I wished I’d let go from the start! I try not to think about the money, I’ve come this far. I spend another thousand dollars having it brought to Canberra in a truck, the big pieces, the small pieces. &nbsp;</p><p>It’s a time capsule of my Sydney life. These are the things I spent years collecting, that made <em>me</em> feel like <em>me</em>. I’m back in Surry Hills, in my street, in my tiny terrace house that I loved so much. The memories flood back and it all feels so strange. </p><p>Once it’s assimilated, there’s more to take care of. My parents broke up when I was 15. It’s not a particularly unusual story. It was a shock. It took time to get over. The family home went up for sale. I packed up my bedroom, my childhood, and put it away. It all went off to my Dad’s new garage. We rediscover treasures, shed what we don’t need or want, we consolidate. I pack some new boxes: For Astrid age 5, For Astrid age 6, For Astrid age 7. For when you’re ready. </p><p>A childhood of memories, in boxes, for the next generation. </p><p>&nbsp;</p><p>This production is made by me, Sophie Harper, in partnership with Wondery. I’m supported by generous listeners. Story editing by Michelle Webster.</p><p>Thanks to my family, my friends and my daughter for being part of the story. </p><p><br></p><p>Music from freemusicarchive.org - CC NC License:</p><p><em>Starling</em> by Lee Rosevere, <em>Think On It</em> by Ian Sutherland and <em>Spellbound </em>by Broke for Free. </p><p>Ad music from freemusicarchive.org - CC Commercial License: </p><p><em>Drop of Water in the Ocean</em> by Broke For Free.</p><p><br></p><p>Sponsors:</p><p>RXBar Kids: Go to <a href=\"http://rxbar.com/accident\" target=\"_blank\"><strong>rxbar.com/accident</strong></a> &amp; enter code <strong><em>accident</em></strong> at checkout&nbsp;for 25% off your first order</p><p>Hello Fresh: For $30 off your first week of HelloFresh, visit <a href=\"http://hellofresh.com/\" target=\"_blank\"><strong>hellofresh.com</strong></a> and enter code <strong><em>ACCIDENT30</em></strong></p><p>&nbsp;</p><p>Thank you kind people supporting me on Patreon! Margaret P. Jones, Emma Burbank, Ellie McHale, Russell Kerrison, Julie Greenhalgh, Rebecca Reid, Kasey Tomkins, Dianne Firth, Anne Staude, Sarah E. Leslie, Adam Coulson, Melanie Ann, Lea Durie, Laura Getson, Bill, Sue Giugni, Maia Bittner, Elizabeth Adcock, Laura Madge, Laura Cherry, Bethany White, Paul S Mitchell and Mariele Thadani and more.</p><p>If <em>you’d</em> like to chip in a couple of dollars towards each new episode, go to <a href=\"http://patreon.com/notbyaccident\" target=\"_blank\"><strong>patreon.com/notbyaccident</strong></a>. </p><p>&nbsp;</p><p>Go to <a href=\"http://www.notbyaccident.net/\" target=\"_blank\">www.notbyaccident.net</a> to find out more about the series, join the e-newsletter or to get in touch.</p><p>&nbsp;</p><p>Astrid has asked for something special as a belated 5th birthday present: a podcast episode that’s not boring, for adults. Her story, made for her, with her, for now. So in four weeks, we’ll be back with something a bit different. A special episode of Not By Accident, for kids. </p><p>&nbsp;</p>\n      ",
            "length": "19976359",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/rss.art19.com/episodes/3da6a972-34f9-4b60-a44b-08e13a4a4fff.mp3",
            "epNo": "28"
        },
        {
            "title": "Ep 27: Flying Fish",
            "datePublished": "Tue, 20 Feb 2018 08:53:41 -0000",
            "description": "\n        <p>It’s August 2015. We’ve just moved back to Australia from Denmark and it’s strange. You’re ultra-sensitive, fearful, clingy, easily brought to tears. I probably am too. It’s been like this for months with all the change and uncertainty. I’ve hardly told anyone we’re coming. Only the family. I don’t know what’s next for us, I don’t feel particularly proud of myself, being newly unemployed, and I’m so full of questions and big emotions that I don’t feel like socializing. I just need quiet. We surround ourselves with our family, your cousins who you can’t get enough of, your grandparents, your aunts and uncles, to help us find our feet. But I feel a sense of urgency. I need to find a new home, new childcare, new work, new routines, so you feel secure again, as quickly as possible.</p><p>&nbsp;</p><p>This production is made by me, Sophie Harper, in partnership with Wondery. I’m supported by generous listeners and by my family, my friends and my daughter. Story Editing by Michelle Webster.</p><p>&nbsp;</p><p>Music from freemusicarchive.org - CC NC License:</p><p><em>They Wait</em> by Lee Rosevere and <em>Too Far Away</em> by Ian Sutherland.</p><p>Ad music from freemusicarchive.org - CC Commercial License:</p><p><em>Drop of Water in the Ocean</em> by Broke For Free.</p><p>&nbsp;</p><p>Sponsored by Hello Fresh.</p><p>US listeners, for $30 off your first week of HelloFresh, visit <a href=\"http://hellofresh.com\" target=\"_blank\"><strong>hellofresh.com</strong></a> and enter code <strong><em>ACCIDENT30</em></strong></p><p>&nbsp;</p><p>Thank you kind people supporting me on Patreon! Margaret P. Jones, Ellie McHale, Russell Kerrison, Julie Greenhalgh, Rebecca Reid, Kasey Tomkins, Dianne Firth, Anne Staude, Sarah E. Leslie, Adam Coulson, Melanie Ann, Lea Durie, Laura Getson, Bill, Sue Giugni, Maia Bittner, Elizabeth Adcock, Laura Madge, Laura Cherry, Bethany White, Paul S Mitchell and Mariele Thadani and more.</p><p>If <em>you’d</em> like to chip in a couple of dollars towards each new episode, go to <a href=\"http://patreon.com/notbyaccident\" target=\"_blank\"><strong>patreon.com/notbyaccident</strong></a>.</p><p>&nbsp;</p><p>Go to <a href=\"http://www.notbyaccident.net/\" target=\"_blank\">www.notbyaccident.net</a> to find out more about the series, join the e-newsletter or to get in touch.</p><p>&nbsp;</p><p>We’ll be back with the next instalment in 4 weeks.</p>\n      ",
            "length": "25401887",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/rss.art19.com/episodes/014e61f2-a1d7-4654-ab09-a56fabfe1156.mp3",
            "epNo": "27"
        },
        {
            "title": "Ep 26: Equality",
            "datePublished": "Mon, 22 Jan 2018 08:46:24 -0000",
            "description": "\n        <p>It’s September 2017. I’ve been feeling recently that it’s important for you understand more of who I am. You see me as a mother, a daughter, an aunt, a friend, a podcaster, a writer. But I’m also a lesbian. You’ve always known, I’ve always told you that if I fall in love one day it will be with a woman. That you won’t ever have a Dad, but maybe one day, if things work out that way, you’ll have two mums. But it’s been abstract for you until now. You’ve only ever had a single mother. I haven't been on a date in your lifetime. It’s become abstract for me too. I miss that part of my identity sometimes, being involved in that community, but I’ve been so caught up with motherhood and work and establishing life in our new home that I’ve put it aside. For later.</p><p>But maybe later is now. The decade long fight for marriage equality in Australia has finally come to a head. The government, hampered by their own factions, has decided to ask the people once and for all: “Should the law be changed to allow same-sex couples to marry? Yes/No.” A one question postal survey, for all voting age Australians. Just tick a box and send it back. There’s no putting it aside now.</p><p><br></p><p>This production is made by me, Sophie Harper, in partnership with Wondery. I’m supported by generous listeners and by my family, my friends and my daughter.</p><p><br></p><p>Music from <a href=\"http://freemusicarchive.org\" target=\"_blank\">freemusicarchive.org</a> - CC NC License:</p><p><em>Passages</em> by Kai Engel and <em>Sunsets and Shitty </em>Cars by Ian Sutherland.</p><p>Incidental music by Chic, Sister Sledge, John Paul Young and Bette Midler. Clips from 7.30 and Insiders, ABC TV Australia. (invoking Fair Use)</p><p>Ad music from freemusicarchive.org - CC Commercial License:</p><p><em>Drop of Water in the Ocean</em> by Broke For Free.</p><p>&nbsp;</p><p>Sponsors:</p><p>RXBar Kids: Go to <a href=\"http://rxbar.com/accident\" target=\"_blank\">rxbar.com/accident</a> &amp; enter code <strong><em>accident</em></strong> at checkout&nbsp;for 25% off your first order</p><p>Hello Fresh: For $30 off your first week of HelloFresh, visit <a href=\"http://hellofresh.com\" target=\"_blank\">hellofresh.com</a> and enter code <strong><em>ACCIDENT30</em></strong></p><p>&nbsp;</p><p>Thank you kind people supporting me on Patreon! Margaret P. Jones, Ellie McHale, Russell Kerrison, Julie Greenhalgh, Rebecca Reid, Kasey Tomkins, Dianne Firth, Anne Staude, Sarah E. Leslie, Adam Coulson, Melanie Ann, Lea Durie, Laura Getson, Bill, Sue Giugni, Maia Bittner, Elizabeth Adcock, Laura Cherry, Bethany White, Paul S Mitchell and Mariele Thadani and more.</p><p>If <em>you’d</em> like to chip in a couple of dollars towards each new episode, go to <a href=\"http://patreon.com/notbyaccident\" target=\"_blank\">patreon.com/notbyaccident</a>.</p><p>&nbsp;</p><p>Go to <a href=\"http://www.notbyaccident.net/\" target=\"_blank\">www.notbyaccident.net</a> to find out more about the series, join the e-newsletter or to get in touch.</p><p>&nbsp;</p><p>We’ll be back with the next instalment in 4 weeks.</p><p>From our family to yours, Happy New Year!</p>\n      ",
            "length": "24095764",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/rss.art19.com/episodes/987914a9-1509-464e-939d-21b9ac960c55.mp3",
            "epNo": "26"
        },
        {
            "title": "Ep 25: Farvel",
            "datePublished": "Fri, 24 Nov 2017 12:50:08 -0000",
            "description": "\n        <p>It’s Spring, 2015. Half your life ago. My six years teaching at the European Film College begin the limp to an anti-climactic end. I try to stay focused. But my main focus is you. The upheaval I’m causing. The reasons for doing it. You’re two and a half. I’m taking you home to our family, our culture, but I’m taking you away from the life, the home, the language, the community that make up your world.</p><p>Once work wraps up we have some quiet weeks left to pack up our lives. I take you to Trine’s each day, to childcare, and I pack boxes, I write job applications, and I sort out the car with Steen’s help, servicing, detailing and re-registering it, ready for sale.</p><p>The removalists come while you’re at Trine’s and take all our things away. I tell you they’ve gone to MorMor’s house, that’s what you call Granny, and that we’re going there too. You seem to cope with that. The shipping will take three months if all goes well. You’ll have outgrown half your clothes by then! You’ll miss your bike, your toys, the stereo. We’re left with the school’s basic furniture, two suitcases filled with summer clothes for here and winter clothes for home, a trainset Jim dropped over to ease your toy separation, and a big echoey apartment.</p><p>You’ve been with Trine five days a week for most of your life. She might be the person you’re closest to after me. This is your last day. I leave my recorder with her. I want to hear you speaking Danish. At this point your Danish is probably better than mine and I know you’ll lose it when we leave. She opens a window into the life you have without me.</p><p>I’ve made the decision to leave based on what you’ll gain, but I’m painfully aware of everything you’re losing.</p><p>Farvel Danmark. Tusind tak for alt.</p><p><br></p><p>This production is made by me, Sophie Harper, in partnership with Wondery. I’m supported by generous listeners. Story editing by Michelle Webster.</p><p>Thanks to my family, my friends and my daughter for being part of the story.</p><p><br></p><p>Music from freemusicarchive.org - CC NC License:</p><p><em>Memory </em>by<em> </em>Creo, <em>Last Night in London</em> by Daniel Birch and <em>Completely Lost</em> by Lee Rosevere.</p><p>Incidental music by Justine Clarke and Bjork (invoking Fair Use).</p><p>Ad music from freemusicarchive.org - CC Commercial License:</p><p><em>Drop of Water in the Ocean</em> by Broke For Free.</p><p><br></p><p>I have some news. I’ve been awarded a grant to write a book! A literary memoir of our story. My plan, for now, is to release one new episode a month as I divide my time between the book and the podcast. Thanks for sticking with me.</p><p><br></p><p>Thanks especially to the kind people supporting me on Patreon: Margaret P. Jones, Ellie McHale, Russell Kerrison, Julie Greenhalgh, Rebecca Reid, Kasey Tomkins, Dianne Firth, Anne Staude, Adam Coulson, Melanie Ann, Lea Durie, Laura Getson, Bill, Sue Giugni, Maia Bittner, Elizabeth Adcock, Laura Cherry, Bethany White, Paul S Mitchell and Mariele Thadani and more.</p><p>If <em>you’d</em> like to chip in a couple of dollars towards each new episode, go to <a href=\"http://patreon.com/notbyaccident\" target=\"_blank\">patreon.com/notbyaccident</a>.</p><p>Go to <a href=\"http://www.notbyaccident.net/\" target=\"_blank\">www.notbyaccident.net</a> to find out more about the series, join the e-newsletter or to get in touch.</p><p>We’ll be back with the next installment in about 4 weeks.</p>\n      ",
            "length": "24745273",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/rss.art19.com/episodes/96f02ee0-b706-4def-9e37-40c4ca86b714.mp3",
            "epNo": "25"
        },
        {
            "title": "Ep 24: Health",
            "datePublished": "Fri, 06 Oct 2017 09:02:58 -0000",
            "description": "\n        <p>I get the feared call from pre-school on the last day of term. You’ve hit your head, badly. </p><p>I keep a close watch on you for signs of concussion and thankfully, there are none. I feel shattered from the worry and the shock. I give up on work and pamper you for the rest of the day. </p><p>The hardest thing is when you’re hurt or sick. Or when I’m sick. Or worst of all, we’re both sick. That’s when it’s hardest to be a single parent. The worry that I might miss the signs of something serious. Of seeing you suffer. Running out of supplies when we can’t just dash to the shops for more food or more medicine. When I have to miss work and I can’t think of an alternative. </p><p>It’s 2015, in Denmark. You’re two. I’ve told Nadia the Principal that this is my last year, we’ll be going home to Australia in the Summer. I want to go out on a high, the way I felt when I left for maternity leave. </p><p>You got sick on Friday. It’s flu or something. I will you to be well by Monday. I’m worried about work. But Monday comes and you’re not. I have a toddler with a fever who needs my care and a room full of students waiting for me. There’s nobody to step in for either role. </p><p>I miss a whole week. After the course a student write on their evaluation form “It was a terrible course. I don’t understand why she couldn’t just get someone else to look after her sick kid.” No, you wouldn’t understand. It’s not something you can understand. Until it’s you.</p><p>When I was nine, I got sick like that, and the disease progressed but I didn’t get better. For weeks, then months I didn’t get better. Tests began. I was tested for everything. Invasive tests, horrible tests, with no conclusions. I’ve always thought of this as my story, but now that I’m a mother I know it’s just as much hers. </p><p>It took a year to get a diagnosis. Myalgic Encephalomyalitis, Chronic Fatigue Syndrome. I was an active young kid, sport was the thing I did best, I swam for the school, played netball, softball, cricket, distance running, it was where I found my self-worth. And then I was bedridden, for a year. The diagnosis was a relief, I wasn’t dying, but it was a burden and a curse.</p><p><br></p><p>This production is made by me, Sophie Harper, in partnership with Wondery. </p><p>Thanks to my family, my friends and my daughter for being part of the story. </p><p>I’m supported by generous listeners. Story editing by Michelle Webster.</p><p><br></p><p>Music from freemusicarchive.org - CC NC License:</p><p><em>Transpire </em>by<em> </em>Dexter Britain, <em>Dolphin</em> and <em>Snow Monkeys</em> by Candlegravity.</p><p><em>&nbsp;Someone to Watch Over Me</em> by Blossom Dearie (invoking Fair Use). </p><p>Ad music from freemusicarchive.org - CC Commercial License: </p><p><em>Drop of Water in the Ocean</em> by Broke For Free.</p><p><br></p><p>I’m now on Patreon. If you’d like join the kind people who are already supporting me to produce each new episode, go to patreon.com/notbyaccident. </p><p>Thanks so much to Margaret P. Jones, Russell Kerrison, Julie Greenhalgh, Rebecca Reid, Kasey Tomkins, Dianne Firth, Anne Staude, Adam Coulson, Melanie Ann, Lea Durie, Laura Getson, Bill, Sue Giugni, Maia Bittner, Elizabeth Adcock, Jessica Kindynis, Laura Cherry, Bethany White, Paul S Mitchell and Mariele Thadani for your support.</p><p><br></p><p>To everyone who’s written to share your stories and to support me in continuing, thank you. I’m very behind with my replies, but want you to know each message means so much. </p><p><br></p><p>Go to <a href=\"http://www.notbyaccident.net/\" target=\"_blank\">www.notbyaccident.net</a> to find out more about the series, join the e-newsletter or to get in touch.</p><p><br></p><p>We’ll be back with the next installment in about 3 weeks.</p>\n      ",
            "length": "36769959",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/rss.art19.com/episodes/d37c3053-0059-476c-a019-76026b0b8b59.mp3",
            "epNo": "24"
        },
        {
            "title": "Ep 23: Community",
            "datePublished": "Thu, 31 Aug 2017 12:57:36 -0000",
            "description": "\n        <p>The school year is away like a fast-moving train. In the past I’d have lost myself in the momentum. Not so much this year though. This year I have you to force me to go home, to switch off, to be still, to be present. But the school is about 50 metres from our home. We’re both fixtures. You ride your little bike through vast rooms, all over the building and bash away on the student’s drum kit. It’s an extension of home for us, for all the students, and for all the teachers. That’s how I can be engaged and still be with you. I can’t imagine there’s another film school like it. I can’t imagine there’s a better place to grow up. If only our family were closer.</p><p>My Dad has finished the work that was delayed by his cancer treatment. He’s well and he’s free. The first thing he does is book a ticket. You should know this Astrid. Grandpa travelled from Australia to Denmark, all that way, at the first opportunity, just to see you. </p><p>This production is made by me, Sophie Harper, in partnership with Wondery. Story editing by Michelle Webster. I’m supported by generous listeners. </p><p>Thanks to my family, my friends and my daughter for being part of the story. </p><p>Music from freemusicarchive.org - CC NC License:</p><p><em>You Were in my Dreams </em>and <em>Always </em>by<em> </em>Candlegravity<em>, Transpire </em>by Dexter Britain and <em>Something Galactic </em>by Broke For Free.</p><p>Ad music from freemusicarchive.org - CC Commercial License: </p><p><em>Drop of Water in the Ocean</em> by Broke For Free.</p><p><br></p><p>I’m now on Patreon. If you’d like join the kind people who are already supporting me to produce each new episode, go to <a href=\"http://patreon.com/notbyaccident\" target=\"_blank\">patreon.com/notbyaccident</a>. </p><p>Thanks so much to Margaret P. Jones, Rebecca Reid, Kasey Tomkins, Dianne Firth, Anne Staude, Bill, Sue Giugni, Maia Bittner, Elizabeth Adcock, Jessica Kindynis, Laura Cherry, Bethany White, Paul S Mitchell and Mariele Thadani for your support.</p><p><br></p><p>To everyone who’s written to share your stories and to support me in continuing, thank you. I’m very behind with my replies, but want you to know each message means so much. </p><p>Go to <a href=\"http://www.notbyaccident.net/\" target=\"_blank\">www.notbyaccident.net</a> to find out more about the series, join the e-newsletter or to get in touch.</p><p>We’ll be back with the next installment in about 2 weeks.</p>\n      ",
            "length": "29035624",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/rss.art19.com/episodes/05aa88d2-b4d2-4090-a147-003b423d2caa.mp3"
        },
        {
            "title": "Ep 22: Lessons From Zorba",
            "datePublished": "Mon, 31 Jul 2017 17:00:43 -0000",
            "description": "\n        <p>The Principal, my boss, has a job offer and decides to take it. The question of leadership opens up. While the Board search for a new Head, somebody will act. Most likely not me, though I’m Vice Principal. We’re living through the worst sleepless nights of the ear infection. I can barely get it together to brush my teeth, let alone to take real responsibility. I want to dig deep, to be as capable and strong as before, to prove something for the sake of all women. But for now I am weak.</p><p>Your eardrum bursts. No more crying in pain through the night. Within days I’m stronger, better, more capable. I’m aware of the options being explored, of others being considered to lead until a new Principal is in place. But all of a sudden, I suppose thanks to who I was at work before motherhood, they decide it’s me! Thank god I’ve slept.</p><p>I sit in the Principal’s office and feel like I’m in a dream. A bit like a kid wearing their parent’s clothes, a tiny bit of imposter syndrome. But mostly I feel taller, lighter, completely capable and utterly relieved to find motherhood hasn’t erased that. I can still do my job. I can step up. Because of the summer pace, I can stay on top of it and shift to part time for some weeks to spend time with you. For this moment, it almost seems I can have it all.</p><p>We need a little summer break too. Time is short, work looms. I book four nights in Crete. A perfect holiday, for just you and me.</p><p><br></p><p>This production is made by me, Sophie Harper, in partnership with Wondery. Edited by Michelle Webster. I’m supported by generous listeners.</p><p><br></p><p>Thanks to my family, my friends and my daughter for being part of the story.</p><p><br></p><p>Music from freemusicarchive.org - CC NC License:</p><p><em>Libertad </em>by<em> </em>Iriate and Pesoa and <em>Other Sources</em> by Candlegravity.</p><p><em>&nbsp;</em></p><p><em>Zorba the Greek</em> by Mikis Theodorakis (invoking Fair Use).</p><p><br></p><p>Ad music from freemusicarchive.org - CC Commercial License:</p><p><em>Drop of Water in the Ocean</em> by Broke For Free.</p><p><br></p><p>I’m now on Patreon. If you’d like join the kind people who are already supporting me to produce each new episode, go to patreon.com/notbyaccident.</p><p>Thanks so much to Margaret P. Jones, Kasey Tomkins, Dianne Firth, Anne Staude, Laura Cherry, Bethany White, Paul S Mitchell and Mariele Thadani for your support.</p><p><br></p><p>To everyone who’s written to share your stories and to support me in continuing, thank you. I’m very behind with my replies, but want you to know each message means so much.</p><p><br></p><p>Go to <a href=\"http://www.notbyaccident.net/\" target=\"_blank\">www.notbyaccident.net</a> to find out more about the series, join the e-newsletter or to get in touch.</p><p><br></p><p>We’ll be back with the next installment in about 2 weeks.</p><p><br></p>\n      ",
            "length": "21810782",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/rss.art19.com/episodes/d509243f-fce7-47d2-845e-5869cb4c3795.mp3"
        },
        {
            "title": "Ep 21: My Brother's Wedding",
            "datePublished": "Fri, 14 Jul 2017 15:04:09 -0000",
            "description": "\n        <p>Nick called to tell me the news just before New Year’s, only weeks after we got back to Denmark. He proposed, and she said yes. I’m happy for them, of course, really happy. Nick has found the person he wants to share the rest of his life with! Selfishly I’m filled with dread at the thought of the trip, so I hope it will be a long engagement. </p><p>I try to suppress the niggling feelings that weddings bring up in me. The flashing neon sign I feel lighting up over my head at times like this. “Single! Single!” The fact that even if I wasn’t, I couldn’t get married in my home country. People like me, lesbians and gays, are still denied that right. But even if I could, I can’t quite picture it for me. Motherhood has pushed that part of my identity so far away that I can’t even really imagine it. &nbsp;</p><p>One Saturday morning, Nick calls, not for a chat. He hesitates, reluctant to say it out loud. Still coming to terms with the news himself. Nozomi is pregnant! My little brother is going to be a Dad. He tells me they want to get married first. They want the wedding to be about the two of them. Nick fears once there’s a baby, they’ll be so consumed that they might not get around to it. They decide on a July wedding. Just a few months from now. It’s the right decision for them, and this is about them. </p><p>I’m overwhelmed at the thought of the trip I agonize over the pros and cons. I’m sure we will go. We can’t not go. </p><p>But then there’s another issue. One I greatly underestimated. An issue with the authorities and you.</p><p><br></p><p>This production is made by me, Sophie Harper, in partnership with Wondery. I’m supported by generous listeners. Editorial input from Michelle Webster.</p><p><br></p><p>Music from freemusicarchive.org - CC NC License:</p><p><em>Weathered Home 3:Bird Split Sky </em>and <em>Aalborg Pulse</em> by Candlegravity.</p><p><em>Unison</em> by Bjork used invoking the Fair Use Doctrine. </p><p>Ad music from freemusicarchive.org - CC Commercial License: </p><p><em>Drop of Water in the Ocean</em> by Broke For Free.</p><p><br></p><p>Thanks to my family, my friends and my daughter for letting me share your stories. </p><p><br></p><p>I’m now on Patreon! If you’d like to support the series with a small donation to each new episode, you can do it here: https://www.patreon.com/notbyaccident</p><p>Thanks so much to Margaret P. Jones, Kasey Tomkins, Dianne Firth and Anne Staude who have jumped on already!</p><p><br></p><p>To everyone who’s written to share your stories and to support me in continuing, thank you. I’m very behind with my replies, but want you to know each message means so much. </p><p><br></p><p>Go to <a href=\"http://www.notbyaccident.net/\" target=\"_blank\">www.notbyaccident.net</a> to find out more about the series, join the e-newsletter or to get in touch.</p><p><br></p><p>We’ll be back with the next installment in about 2 weeks.</p>\n      ",
            "length": "17301838",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/rss.art19.com/episodes/c1149927-a30e-49e2-b95d-7599cc579303.mp3"
        },
        {
            "title": "Season Two Teaser",
            "datePublished": "Fri, 30 Jun 2017 05:53:36 -0000",
            "description": "\n        <p>When I reflect on my childhood, I think of things I had that you don’t: two parents, a brother, a sister, a big house and garden, a dog, private schooling, beach and ski holidays, no money worries… and I wonder. I wonder if I’m making the right choices.</p><p>In season two, we’ll make our way through four years, from one to five, across continents, cultures, careers, seasons, struggles, successes. We’re moving forward, in ten episodes, drawing from the past, cherishing the present, heading toward an optimistic future.</p><p>Here’s the crux of it Astrid. Your childhood is my priority and for you to thrive, I need to thrive too. So, let’s find our way there, together.</p><p><br></p><p>Episode 21 will be out in two weeks, with new episodes every two weeks or so, dependent on, you know, life. Thanks for listening. It’s good to be back.</p><p>This production is made by me, Sophie Harper, in partnership with Wondery, and with the support of generous listeners.</p><p>Music from freemusicarchive.org - CC NC License:</p><p><em>My Luck </em>by Broke For Free.</p><p>Ad music from freemusicarchive.org - CC Commercial License:</p><p><em>Drop of Water in the Ocean</em> by Broke For Free.</p><p><br></p><p>I’m now on Patreon! If you’d like to support the series with a small donation to each new episode, you can do it here: <a href=\"https://www.patreon.com/notbyaccident\" target=\"_blank\">https://www.patreon.com/notbyaccident</a> </p><p>&nbsp;</p><p>Go to <a href=\"http://www.notbyaccident.net/\" target=\"_blank\">www.notbyaccident.net</a> to find out more about the series or to get in touch.</p><p><br></p><p>Thanks for listening. It’s good to be back.</p>\n      ",
            "length": "5421766",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/rss.art19.com/episodes/7c820a44-39f7-4a60-8258-10bdbbdd0f78.mp3"
        },
        {
            "title": "Ep 20: The Tunnel",
            "datePublished": "Sun, 05 Mar 2017 20:59:08 -0000",
            "description": "\n        Sometimes the grind of life can get you down. That’s where I am as we reach spring 2014. The birds are singing again, the walks between childcare and home become a lovely opportunity to be together. Each day a little brighter than the last. But I’m tired. Always tired. I struggle to find my role again in the shifting landscape at work, and the role of work in the shifting landscape of my life. I have a dull ache in a tooth. Later. I’ll deal with it later. \n\nThree years. It’s taken me three years to deal with that tooth. I put it off until I couldn’t anymore. It was stupid to leave it, but I have been lucky, again. \n\nWith the pain in my head came nights of insomnia, a racing heart and anxiety. It was about more than the tooth. It was about the money, the podcast, the moths, the feeling that life was beating me. \n\nWe moved back home last month to a moth infestation. I don’t know what’s wrong with me that I can’t just rise above it, sort it out. It won’t go away by itself! Just like the tooth. \n\nThen, as it is since you came along, in the middle of my little crisis, an oasis. You turn four! \n\nDuring the celebrations, I take my dad aside. Enough of living in denial. \n\nIt’s a year since I started making this podcast. 20 episodes. I haven’t wanted to let anyone down so I haven’t allowed myself to take a real break, and making this podcast, all alone, is hard.  It’s hard work, and it’s emotionally hard. \nIt’s time to rest, take stock, get life under control, live a little, make some money, try to be a better than usual mother, daughter, sister, friend. I’ll read, watch and listen to other people’s stories, and slowly make my way back to ours. With all my heart, passion, energy and focus, the way I started a year ago. Sometimes the grind of life can get you down, and sometimes that means adjusting course. \n\n\nThis production is made by me, Sophie Harper, in partnership with Wondery. I’m supported by generous listeners and the Australian Cultural Fund. \n\nThanks to my colleagues, my family, my friends and my daughter for your support, in life and with this podcast. \n\nMusic from freemusicarchive.org - CC NC License:\nProtect Me and Global Culture Collision by Candlegravity; Cylinder Six by Chris Zabriskie.\n\nAd music from freemusicarchive.org - CC Commercial License: \nDrop of Water in the Ocean by Broke For Free.\n\nUS listeners, support the series and eat well!  Hello Fresh is my first sponsor. Sign up at www.hellofresh.com and use the promo code 'noaccident35' to get $35 off your first delivery. Everybody wins!\n\nCare.com are our new sponsors! To save 30% off a Premium membership—and receive a $15 credit that you can use toward paying your caregiver, visit care.com/noaccident when you subscribe.\n\nWe’d like to know more about you, so please help us by filling up a quick survey at wondery.com/survey. It should take less than 5 minutes, and it really helps. Thanks!\n\n\n      ",
            "length": "18220930",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/rss.art19.com/episodes/66b1cb00-3fd8-4340-82ff-77e4e04e8d2d.mp3"
        },
        {
            "title": "Ep 19: Turning One",
            "datePublished": "Tue, 14 Feb 2017 08:47:31 -0000",
            "description": "\n        Episode 19: Turning One\n\nThe shock of being back at work is becoming routine. Even the pre-sunrise race to childcare. I feel sorry for myself, and can't quite believe I made life choices that led us to this, as I force your pram through snow drifts, scarf guarding my face from the elements; you wrapped up like a bundle, bewildered, squinting to protect your eyes from the snow that whips across the landscape. It's ridiculously hard. Comically hard. \n\nI start to look at people with cars the same way I looked at people with jobs as an unemployed graduate: Do you even know how good your life is?! I fantasize about buying one. I've started saving. I fantasize about giving up and going home. Did I really choose this over Australian weather and our family?\n\nSpare moments start to fill with thoughts of your upcoming birthday. Your very first birthday. Packages arrive. I'm happier than if they were for me. The night before, I get a late night burst of pleasure rearranging the furniture and making a birthday display for you to wake up to. Imagining your delight makes me as delighted as anything can. Surpassed only by witnessing it.\n\nThis production is made by me, Sophie Harper, in partnership with Wondery. I'm supported by generous listeners and the Australian Cultural Fund. \n\nThanks to my colleagues, my family, my friends and my daughter for being part of the story. \n\nMusic from freemusicarchive.org - CC NC License:\nMell's Parade and High School Snaps by Broke For Free; Weathered Home 3: Bird Split Sky and Fieldtrip by Candlegravity.\n\nAd music from freemusicarchive.org - CC Commercial License: \nDrop of Water in the Ocean by Broke For Free.\n\nUS listeners, support the series and eat well!  Hello Fresh is my first sponsor. Sign up at www.hellofresh.com and use the promo code 'noaccident35' to get $35 off your first delivery. Everybody wins!\n\nCare.com are our new sponsors! To save 30% off a Premium membership—and receive a $15 credit that you can use toward paying your caregiver, visit care.com/noaccident when you subscribe.\n\n\nGo to www.notbyaccident.net to find out more about the series or to get in touch.\n\nWe're having a survey blitz this month. Could you take 5 minutes to respond at wondery.com/survey? It helps. \nSo do the iTunes reviews. Thank you kind listeners for the recent ones. I read them all and a nice review in the morning totally makes my day.\n\nWe'll be back in two weeks.\n\n      ",
            "length": "20055771",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/rss.art19.com/episodes/a175f566-8320-47a3-be02-80571f98bee3.mp3"
        },
        {
            "title": "Ep 18: First Day Back",
            "datePublished": "Fri, 27 Jan 2017 10:58:55 -0000",
            "description": "\n        I still don't know if I can do this. I start work tomorrow, after a whole year off, with sleep deprivation still affecting my memory and my ability to cope, with my emotions always close to the surface. I don't know if I can be the mother I want to be and do my job well enough that I'm not letting everybody down. I do know it's going to be really hard. \n\nI hadn't understood before you arrived how painful it would feel to be away from you. I hadn't understood that I couldn't leave you with just anybody. That you'd be a defenseless baby, just starting to crawl, when I went back to work after a generous year of maternity leave. I wish we had a few more months. Suddenly I have to be away from you for 8 hours a day, starting today, after having spent only hours away from you in your whole life until now. It physically hurts. \nI know I'm spoilt, I'm privileged. Thank you Denmark, I am forever grateful for the generous paid leave. I was only just starting to feel ready to leave the house at the point most women have to go back to work! It's been the best and most rewarding year of my life and I don't want it to end. \n\nTo top it off, on Monday, it's my birthday. I'm 40. \n\nThis production is made by me, Sophie Harper, in partnership with Wondery. I'm supported by generous listeners and the Australian Cultural Fund. \n\nMusic from freemusicarchive.org - CC NC License:\n'Simple Hop' and 'Caught in the Beat' by Broke For Free; 'Out of the Skies, Under the Earth' by Chris Zabriskie; 'Don’t Say Goodbye' by Candlegravity.\n\nAd music from freemusicarchive.org - CC Commercial License: \n'Drop of Water in the Ocean' by Broke For Free.\n\nThanks to my family, my friends and my daughter for your willingness to be part of the story. To Tally Abacissis who’s podcast series 'First Day Back' inspired more than the title of this episode. Finally, thanks, Michael for the coffee, and thank you, Jenny for the cake. \n\nUS listeners, support the series and eat well.  Hello Fresh Has signed on to support me for 2017! Sign up at www.hellofresh.com and use the promo code 'noaccident35' to get $35 off your first delivery. Everybody wins!\n\nGo to www.notbyaccident.net to find out more about the series or to get in touch.\n\n\nI’ll be back, at work, in two weeks.\n\n      ",
            "length": "16713769",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/rss.art19.com/episodes/0fcff8eb-d51c-4747-8c4d-8be8907b01e5.mp3"
        },
        {
            "title": "Ep 17: Tomorrow Morning",
            "datePublished": "Sat, 24 Dec 2016 15:09:40 -0000",
            "description": "\n        I’ve been thinking a lot about the expectation of an exchange: you help me move house, I’ll buy you pizza and beer; you babysit, I’ll do the same for you another day. I had thought it rare that people do things for others without expecting anything in return. I’ve been wrong. People have done things for me, particularly since I became a parent, when I couldn’t offer anything back but friendship and gratitude. \n\nActs of kindness and generosity have come without judgement, even though I’m judging myself, feeling I should be able to do it all. They come not as an offer I can refuse, but as a statement of how it’s going to be. There is kindness and generosity and community all around, if you slow down enough to let it in. \n\nSummer has well and truly arrived, and I’ve barely stopped to look forward to the holidays. Weekdays have had the usual rhythm of childcare drop-offs, quiet days working alone, and happy reunions in the afternoons. \n\n\nI’ve been so grateful for this bunch of people who care about you and me and our family, who join me in a laugh or a winge, who let it pass if I struggle to make conversation when my mind is making its way back from somewhere else. Often these are the only adults I talk to all day and they’ve made this a much happier year for me too. \n\nJenny and Grandpa are hosting Christmas this year. It’s going to be huge. \nA proper hot sunny suburban modern blended family Australian Christmas. \n\nThis production is made by me, Sophie Harper, in partnership with Wondery. I’m supported by generous listeners and the Australian Cultural Fund. \n\nThanks to my family, my friends, our childcare centre and my daughter for being part of this podcast. \n\nMusic from freemusicarchive.org - CC NC License:\nSidewalk Chalk by Broke For Free; Ink and Lifted by Dexter Britain.\n\nAd music from freemusicarchive.org - CC Commercial License: \nDrop of Water in the Ocean by Broke For Free.\n\nUS listeners, support the series and eat well.  Hello Fresh Has signed on to support me for 2017! Sign up at www.hellofresh.com and use the promo code 'noaccident35' to get $35 off your first delivery. Everybody wins!\n\nGo to www.notbyaccident.net to find out more about the series or to get in touch.\n\nWe’ll be back late in January after the summer break, ready for a new year.\n\nFrom all of us to all of you, happy holidays!\n\n      ",
            "length": "15726550",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/rss.art19.com/episodes/e6b5b34e-4bd9-4df0-8054-dff673487a7e.mp3"
        },
        {
            "title": "Ep 16: The Emails",
            "datePublished": "Wed, 14 Dec 2016 08:02:55 -0000",
            "description": "\n        Crossing the world from Australia to Thailand to Denmark, ending my maternity leave, ending 2013. A sense of loss, a sense of anticipation and anxiety, a reminder of and reliance on great friendships, and a wonderful holiday. The emails tell the story, starting with this one:\n\n> Sent: Monday, 2 December 2013 1:17 AM\n> To: Diana; David; Charlotte; nicholas; Jennifer; Rebecca \n> Subject: Hi from Bangkok\n> \n> We have made it and everything went more smoothly than I'd dared to hope. No\n> blowouts, no tears (oh maybe a few from me), no squeals, a bassinet, happy neighboring passengers, successfully distracting toy\n> collection and even a decent nap. \n> \n> We're both exhausted and sensibly Astrid has gone to bed. I will follow\n> soon.\n> \n> Thanks all for your help and support this week. We couldn't have managed\n> without you. \n> \n> Love Soph \n\n\nThis production is made by me, Sophie Harper, in partnership with Wondery. I’m supported by generous listeners and the Australian Cultural Fund. \n\nThanks to my family, my friends, and my daughter for allowing me to talk about your lives. \n\nThank you for the reviews, messages, and donations! I’m very very behind with my replies, but hearing from you means so much!\n\nMusic from freemusicarchive.org - CC NC License:\nLove Breaks, Deliberate Acts of Kindness and We’re Not That Different by Candlegravity; Pattern 4 by Cyan341.\n\nAd music from freemusicarchive.org - CC Commercial License: \nDrop of Water in the Ocean by Broke For Free.\n\nUS listeners, support the series and eat well.  Hello Fresh Has signed on to support me for 2017! Sign up at www.hellofresh.com and use the promo code 'noaccident35' to get $35 off your first delivery. Everybody wins!\n\nGo to www.notbyaccident.net to find out more about the series or to get in touch.\n\nI’ll be back for Christmas, in about two weeks.\n\n      ",
            "length": "31256241",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/rss.art19.com/episodes/adcd2366-2d58-4956-9d5f-b8262084e37b.mp3"
        },
        {
            "title": "Ep 15: Counting Down",
            "datePublished": "Thu, 24 Nov 2016 10:34:56 -0000",
            "description": "\n        Happy 4th birthday Alex! \nWe have a party in Granny's garden to celebrate. An opportunity to try out my new recording gear. Your donations have gone to good use, thank you. \nI've caught up with myself. Here's Alex's first birthday! \nYou sit together at the party in a paddling pool full of coloured balls, and you play. He seems so grown up, able to crawl around to whatever takes his interest. You're not mobile yet, but you can sit! It's a whole new perspective on the world. \nI can't believe I'm taking you away from all of this before your first birthday. \nThe countdown is on. I've stolen moments while you sleep to apply for your passport, for your residency permit, for childcare in Denmark, I've booked our flights, started packing and organized our farewell tour. My stomach churns more with each passing day as I prepare for us to leave behind this peaceful life to begin our new one. But things are falling into place, and you remind me to stop and breathe and to be happy.\n \nThis production is made by me, Sophie Harper, in partnership with Wondery. I'm supported by generous listeners and the Australian Cultural Fund. \nThanks to my family, my friends, and my daughter for allowing me to record and for all your support. Special thanks to Emmett, Max and Caroline, and to Alexandra, Will and Caroline.\nThank you for the reviews, messages, and donations! Please consider writing an iTunes review. They really do help the series find more listeners.\nWondery would like to know more about you, so it would be great if you could fill in a quick survey at wondery.com/survey\nMusic from freemusicarchive.org - CC NC License:\nLate Mornings by Dexter Britain, Starting Over and Afghan by Candlegravity; Something Elated by Broke For Free.\nAd music from freemusicarchive.org - CC Commercial License: \nDrop of Water in the Ocean by Broke For Free.\n\nUS listeners, support the series and eat well.  Hello Fresh Has signed on to support me for 2017! Sign up at www.hellofresh.com and use the promo code 'noaccident35' to get $35 off your first delivery. Everybody wins!\n\nGo to www.notbyaccident.net to find out more about the series or to get in touch.\n\n\nI'll be back, to get off this plane, in about two weeks.\n\n      ",
            "length": "21915271",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/rss.art19.com/episodes/8bc5aa65-bad3-4618-b867-087acb2da0ad.mp3"
        },
        {
            "title": "Ep 14: Long Days, Short Months",
            "datePublished": "Tue, 08 Nov 2016 15:43:35 -0000",
            "description": "\n        We’re staying at Granny’s this week. She fell and fractured her kneecap. Considering everything she’s done for me during my life, and at the start of yours, taking us in, feeding me, caring for you when I reached my limit, when I got that 24 hour vomiting bug and couldn’t stand up... What would we have done without her? This feels like the least we can do. \n\nWe’re sleeping in the room you call ‘our bedroom’, falling into some old routines. I struggle to put things in the right places when I unpack the dishwasher, you play in the garden, I throw you in the lovely big bath after a messy accident, I enjoy the solitude as I hang out small clothes to dry in the sun, podcasts playing in my ears. I sit in the chair where I spent so many hours breastfeeding and chat to Granny with you curled up on my lap. I wish I could recapture the same sense of calm I felt in that year.  The year where I allowed myself to let go of expectations and responsibilities beyond our small family, and slow my life to a pace where every detail, every sound, smell, smile, touch was magnified by the lack of static.\n\nYou’re six weeks old. We have daily routines set by your changing rhythms. Sleep, nappy changes, feeding, tummy time. A bath for you, a shower for me, with you in sight, laundry. Lots of laundry. Tiny clothes pegged out with you strapped to my chest. Coffee in the sun, you bare bottomed to help the nappy rash. Back inside, I’m making my way through my mother’s CD collection. You lie on your back and move your body to the music. \nFor this year, I resolve to have low expectations of myself other than caring for you, to rest when I can, to do simple things for me. This is so different to the chaotic work life I’ve left behind in Denmark. I don’t let myself think too much about whether we’ll go back. I’m sure it will become clear with time.\n\n\nThis production is made by me, Sophie Harper, in partnership with Wondery. I’m supported by generous listeners and the Australian Cultural Fund. \n\nThanks to my family, my friends, my daughter for allowing me to record and for all your support.\nThank you for the reviews, messages, and donations! iTunes reviews help the series find more listeners, so I’d be very grateful if you feel inclined to leave a review.\n\nMusic from freemusicarchive.org - CC NC License:\nTomie’s Bubbles, Starting Over and Goodmorning by Candlegravity; Blown Out by Broke For Free.\n\nAd music from freemusicarchive.org - CC Commercial License: \nDrop of Water in the Ocean by Broke For Free.\n\nUS listeners, support the series and eat well.  Hello Fresh Has signed on to support me for 2017! Sign up at www.hellofresh.com and use the promo code 'noaccident35' to get $35 off your first delivery. Everybody wins!\n\nGo to www.notbyaccident.net to find out more about the series or to get in touch.\n\nI’ll be back in about two weeks to start getting ready for another big change.\n\nGet well soon Granny.\n\n      ",
            "length": "27045302",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/rss.art19.com/episodes/68a9f8de-973f-4e7c-8392-cbb929d7c67d.mp3"
        },
        {
            "title": "Ep 13: The Irresponsible Option",
            "datePublished": "Tue, 18 Oct 2016 23:01:03 -0000",
            "description": "\n        As my health improves and I feel more secure with my baby care skills, we begin to venture out. We meet my sister Charlotte, who looks so relaxed and confident out here in public. I can't even imagine feeling that way again, but I try to let it rub off on me. We sit and I breastfeed to settle you. Thankfully, you attach easily, barely allowing a glimpse, restoring my modesty with your little head, looking like you're sleeping in my arms. I can block out the world and find my centre again. \n  \nCharlotte is in her last weeks of maternity leave. The thought of being away from you actually hurts and I'm grateful that I won’t have to face this for a long time. I haven't decided if I'll return to Denmark when my year is up . I don’t know what will be best for us. The decisions I'll have to make will be both practical and emotional. \n\nYou already know we did go back. When you were 10 months old, the two of us moved back to Denmark, to full time work for me and full time childcare for you. In my mind it is an 18 month commitment. I don't want you to be away from your family for any longer than this. When things are good it’s workable, but if you get sick I have no options. I have to stay home and then my students have no teacher. Even when we are both well, I can't put in the hours I did before. I feel I'm not being the teacher or the mother I want to be. I'm always letting somebody down. I don't want to live like this. \n\nAs we left Denmark a year ago, I could see three paths: to find another ambitious job in Australia, to study again, or to stop searching for outside options and commit. To put paid work and institutional security on hold for creative work. This is the financially irresponsible option. For me, the bravest and riskiest option. It's also the one that allows flexibility so I can be available for you when you needed me, guilt free. This is what I want to try, but I have to fight hard against my instinct to seek security, structure, and the validation that comes with working for a great institution.  \n\nI start the podcast. The pressure of responsibility has a way of keeping me focused. I'm getting traction. We are on TV, we're on the radio, in print, at home and abroad. It's not always good, but mostly people receive what I'm doing in the spirit in which I'm doing it. There are no geographical boundaries, which is exactly what I'd hoped. People are listening, it's resonating, they're donating money to help me continue. Audio makers reach out, and I'm welcomed in. \n\nA network, Wondery! I’m not alone anymore. I'm part of something bigger!  And with that, sponsorship! An income! It's modest, but it's an income! I'll be able to service my car, go to the dentist, buy new pants to replace the ones that suddenly only reach the top of your socks. Throw out my maternity bras! I'm on the way to making a living again, but this time working for me. \n\nThis production is made by me, Sophie Harper, in partnership with Wondery! I'm supported by generous listeners and the Australian Cultural Fund. \nMusic by Dexter Britain, Broke for Free, Chris Zabriskie and Versus Shade Collapse.\nThanks to my family, my friends, my daughter, and to Dan Lizette, Lea Thau, Jon Cohen, Michelle Webster, Cathy Gray, Kate Montague, Koren Helbig, Hernan Lopez, and to listeners and friends who believe in what I'm doing and have encouraged and supported me to keep doing it.\nThank you for the iTunes reviews and for the messages, and donations! I feel very blessed.\nI'll be back in two weeks to tell you about the gentle and happy routines of early motherhood.\n\nGranny's (Diana Lampe's) poppy seed cake recipe for Astrid: http://www.goodfood.com.au/recipes/pearfect-20130408-2hgtd\n\nClips: \nABC Double J with Myf Warhurst and Ian Walker \nThe Podcast Digest (episode 95) with Dan Lizette\nSRSLY podcast, New Statesman #43 with Caroline Crampton and Anna Leszkiewicz\nStrangers with Lea Thau (Not By Accident episode)\nSBS TV The Feed: Sperm Tourism \n\nMusic by permission from the artist: I'm Going to Die by Versus Shade Collapse.\nMusic from freemusicarchive.org - CC NC License:\nCandlepower by Chris Zabriskie; Happy Together by Dexter Britain; A Year and The Great by Broke For Free.\nAd music from freemusicarchive.org - CC Commercial License: \nDrop of Water in the Ocean by Broke For Free.\n\nUS listeners, support the series and eat well.  Hello Fresh Has signed on to support me for 2017! Sign up at www.hellofresh.com and use the promo code 'noaccident35' to get $35 off your first delivery. Everybody wins!\n\nGo to www.notbyaccident.net to find out more about the series or to get in touch.\n\n      ",
            "length": "28054674",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/rss.art19.com/episodes/b11cf42a-abc8-44d9-b825-d2afe7578195.mp3"
        },
        {
            "title": "Ep 12: Father's Day",
            "datePublished": "Sat, 24 Sep 2016 16:28:06 -0000",
            "description": "\n        You're six days old. I apprehensively pack my things and prepare to be discharged. It’s been a surprisingly idyllic little sanctuary, this hospital room. I'm not sure I'm ready to leave yet, but we have to start our real life together sooner or later. And we won't be alone, not yet. My mother is busy all day everyday, from this day, for months, cooking and feeding me, making cups of tea for visitors, fielding phone calls, rocking you to sleep when I've run out of steam. I honestly don't know how I could do this without her.  And to be clear, the food isn't average. She's an amazing cook and a food writer, and right now she's cooking as if our lives depend on it, which, in a way, I guess they do. All the strength I have is for you and I can only offer it because my mum is looking after me.  My nipples are sore, but it's not terrible. Some days I have to brace myself as you latch on to endure the first few seconds of pain, but after that it's ok. I'd had so many fears about breastfeeding, whether we'd be able to do it, whether there's be a problem, whether I'd have enough milk for you. Once again I'm one of the lucky ones. I've read you books about unconventional families all your life. We even have a book about a single woman having a baby with donor sperm. I want you to know your story and for it to be normal, so you don't experience the shock of discovery. It's difficult though when pretty well all the children you know have a mum and a dad, including our cousins. You first asked me why you don't have a dad before you were three. I was flustered and did my best, but didn’t feel I'd done well. It didn't take long for you to ask again, and I did a little better. Now I've had 5 or 6 goes, and I never come away feeling I've really got this under control. It's hard, and it will keep being hard.  It was father's day here in Australia this month. This was our biggest test so far. I was grateful for the sensitivity of the wonderful women at your childcare. The kids made cards and yours meant so much to you that it came to bed with us every night that week.  When the day came, you had the afternoon with Grandpa all to yourself. And he had you all to himself too.    Not By Accident is made by me, Sophie Harper, supported by 152 generous donors through the Australian Cultural Fund.  Thanks to my family, my friends and my daughter for allowing me to record, and for the practical and moral support. Please subscribe, rate and review to help the series find more listeners. Go to notbyaccident.net to sign up to my occasional email newsletter, tweet at me @byaccidentnot and if you know anyone who might like to listen, please share! Music by permission from the artist: Sofia by Versus Shade Collapse. Music from freemusicarchive.org - CC NC License: Opus 4 by Dexter Britain; Red Danube by Lee Rosevere; Note Drop by Broke For Free.\nUS listeners, support the series and eat well.  Hello Fresh Has signed on to support me for 2017! Sign up at www.hellofresh.com and use the promo code 'noaccident35' to get $35 off your first delivery. Everybody wins!\n\nGo to www.notbyaccident.net to find out more about the series or to get in touch.\n\n      ",
            "length": "25610031",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/rss.art19.com/episodes/b596cbb1-bce2-49c1-a6a0-2007835b5eca.mp3"
        },
        {
            "title": "Ep 11: First Hours, First Days",
            "datePublished": "Mon, 12 Sep 2016 05:55:13 -0000",
            "description": "\n        With you suckling at my chest and our family here to celebrate your birth, I feel elated, and sure it must be over. But it isn't quite over yet. The family are ushered out for the doctors to begin stitching me up. I’m on my back, feet in stirrups, trying to think more about you than about the four or five people examining the damage. Your tiny fingers are so long and thin, with soft fingernails that curl over at the ends. Your hair is fair and curly, but darker than mine. Or is it the dry blood and amniotic fluid that make it look that way? Your little nose is upturned, like my sister's. It’s the one feature I recognize from the scans. Your eyes are big and blue, the shape of mine and my fathers. It’s late by the time I'm helped into a wheelchair and moved to the ward, you in my arms. We study each other's faces, stare into each other's eyes.  We're wheeled down to a ward that is almost deserted, and I have to let go of these midwives and the wonderful care and attention they've given me. We're on our own. I suddenly realise it was a big mistake not to ask someone to stay with me tonight. I imagine how distressing it must be to no longer hear my heartbeat as you lie alone in the world for the first time. You are never taken from my side, and I love being with you, but I miss you being inside me, almost a part of me. I miss my pregnant belly. I study you, awake and asleep, getting to know all the parts of your face and your body. I recognize the way you move, curl up, stretch out, from how you moved inside me. I look for the things that I recognize from me, and the things I don’t recognize, that must come from him.   I have no colour in my face. Even my hands and arms have the pallor of a corpse. I'm not getting much stronger. The doctors don’t think I lost enough blood to be in the state I'm in, but decide to test me, and find that I have. They give me a blood transfusion and within hours I start to feel stronger. I haven’t decided on a name yet. I've got it down to three, and thought I'd know once you were born, but my head is so foggy that I'm just not sure! I try to ignore opinions and pressures and after the transfusion, I have clarity. Astrid. Your name is Astrid. It takes weeks to feel natural, but we settle into it. Astrid is definitely who you are.   Not By Accident is made by me, Sophie Harper, supported by 152 generous donors through the Australian Cultural Fund.  Thanks to my family, my friends and my daughter for allowing me to record, and for the practical and moral support. Please subscribe, rate and review to help the series find more listeners. Go to notbyaccident.net to sign up to my occasional email newsletter, tweet at me @byaccidentnot and if you know anyone who might like to listen, please share! Music by permission from the artist: Hooked by Versus Shade Collapse. Music from freemusicarchive.org - CC NC License: Oxygen Garden by Chris Zabriskie; Sleepless Nights by Dexter Britain; Spellbound by Broke For Free.\n\nUS listeners, support the series and eat well.  Hello Fresh Has signed on to support me for 2017! Sign up at www.hellofresh.com and use the promo code 'noaccident35' to get $35 off your first delivery. Everybody wins!\n\nGo to www.notbyaccident.net to find out more about the series or to get in touch.\n\n      ",
            "length": "22468649",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/rss.art19.com/episodes/c48e8a3d-d22f-471e-8019-9b655cf86245.mp3"
        },
        {
            "title": "Ep 10: Birth",
            "datePublished": "Fri, 26 Aug 2016 01:30:55 -0000",
            "description": "\n        It's going to get messy, so if that’s a problem for you, you might want to skip this episode, or you can fairly safely listen to the first 9 and the last 4 minutes. I'm 6 days overdue. I can't imagine it's possible to be any bigger! I'm so uncomfortable and it's so hot! But I need to get out. I go to the little suburban supermarket near home, and think of my mother. Her waters broke with my brother in this very supermarket 34 years ago. I shop quickly, before history has a chance to repeat! I have an acupuncture appointment in the afternoon, and the acupuncturist can barely contain her excitement as she does her best induce labor. I have another appointment booked for the next day, but she doesn’t think I’ll be there. I go home, rest and drink raspberry leaf tea. It's supposed to help too. Labor might begin at any moment. Then again, it could be another week. I go to bed, trying to put it all out of my mind. For me, it had been a bit of a dark week, waiting and not knowing when our life together will start. I wake up during the night and feel a sudden gush. It's my waters, they've broken. There's meconium in them. I know this means it's urgent.  We race to hospital. Labor happens in a blur, with moments of hyper-sharp focus. You are born!    Not By Accident is made by me, Sophie Harper, supported by 152 generous donors through the Australian Cultural Fund.  Thanks to my family, my friends and my daughter for allowing me to record, and for the practical and moral support. Please subscribe, rate and review to help the series find more listeners. Go to notbyaccident.net to sign up to my occasional email newsletter, tweet at me @byaccidentnot and if you know anyone who might like to listen, please share! Music from freemusicarchive.org - CC NC License: Zandzeepsodemineraalwatersteenstralen by Duncan Avoid; Land on the Golden Gate by Chris Zabriskie; Rewound by Chris Zabriskie; Seven by Dexter Britain.\nUS listeners, support the series and eat well.  Hello Fresh Has signed on to support me for 2017! Sign up at www.hellofresh.com and use the promo code 'noaccident35' to get $35 off your first delivery. Everybody wins!\n\nGo to www.notbyaccident.net to find out more about the series or to get in touch.\n\n      ",
            "length": "31686739",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/rss.art19.com/episodes/2d0a8485-b821-44e5-bcfd-96d372a43411.mp3"
        },
        {
            "title": "Ep 9: This Strange Period",
            "datePublished": "Thu, 11 Aug 2016 11:48:46 -0000",
            "description": "\n        My brother's baby is due this week. I'm feeling jumpy every time the phone rings. I sit down with my sister Charlotte for a not-so-quiet talk about birth, and the end of my pregnancy. I'd thought once I was home, I could start to focus on getting everything ready for your birth, but as it turns out, this period is not to be all about you and me. During this strange period, three of us are in hospital within weeks of each other.  Charlotte's gall stones are a horrible thing to have to deal with, but it is our father who becomes the real worry as 2013 begins. He is suddenly very ill. I go to meet my midwife, the first of several visits.  My mother comes with me for the first appointment. I'd decided I'd like her to be at the birth, and she agreed. She comes with me to the first birth class too. Walking into the room full of couples is strangely intimidating.  I turn 39. Cass and I have a joint birthday party. It makes me feel like I still have a bit of a life. But there is a dark shadow over everything as my Dad's surgery looms.  I'm not as agile as I tried to convince myself I am. The intense heat is hard to cope with. I look at my legs one afternoon and they've swollen so much they're unrecognizable! It scares me. I decide it's time to go home, slow down and settle into the air-conditioned comfort of my mother's house for the final weeks. You can come now Astrid, I’m ready!   Not By Accident is made by me, Sophie Harper, supported by 152 generous donors through the Australian Cultural Fund.  Thanks to my family, my friends and my daughter for allowing me to record, and for the practical and moral support. Please subscribe, rate and review to help the series find more listeners. Go to notbyaccident.net to sign up to my occasional email newsletter, tweet at me @byaccidentnot and if you know anyone who might like to listen, please share! Music from freemusicarchive.org - CC NC License: Divider by Chris Zabriskie; That Kid In Fourth Grade Who Really Liked The Denver Broncos by Chris Zabriskie; Undercover Vampire Policeman by Chris Zabriskie; Shooting Star by Dexter Britain.\n\nUS listeners, support the series and eat well.  Hello Fresh Has signed on to support me for 2017! Sign up at www.hellofresh.com and use the promo code 'noaccident35' to get $35 off your first delivery. Everybody wins!\n\nGo to www.notbyaccident.net to find out more about the series or to get in touch.\n\n      ",
            "length": "29761201",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/rss.art19.com/episodes/d618d5ed-a431-49a9-bf23-6f1e99ad1f71.mp3"
        },
        {
            "title": "Ep 8: Leaving and Arriving",
            "datePublished": "Sat, 16 Jul 2016 08:48:00 -0000",
            "description": "\n        After my maternity leave, in 2014, we did move back to Denmark, just for 18 months. I did make it work, mostly, as a single mother with a demanding job, thanks to my incredible friends and colleagues. It was painful when we left them, your second family, but so worth it for you to know your grandparents, aunt and uncle, and your little cousins. There are three of them now. Nick met Nozomi soon after you were born, little Ibuki followed, and any day now, I mean I’m literally expecting the call, a fifth baby cousin will arrive!  But I'm jumping ahead. It’s December 2012, Denmark. I'm 7 months pregnant. As I eat my nightly 3am pancakes, I research basinets, baby baths, change tables and car capsules.  Work is busy and I'm not so light on my feet now. The documentary project, my other baby, is underway and I’m trying to manage logistics and offer some guidance to the students before they head off to shoot. Working with these courageous students, over years, seeing them make compelling films, has given me the courage and the drive to make this series. Students of the EFC, I owe you a debt of gratitude. I would not be doing this if it weren’t for everything you taught me. On the last day of school, in the morning, we have a staff Christmas event with gifts for everyone. I haven't anticipated that this is also a farewell for me. I'm given presents for my baby, and a speech, by the Principal, that is so moving, that I cannot speak to reply. It's hard to say goodbye. I don’t know if I'm coming back and so much of my heart is here. As I board the final flight to Sydney, I am thinking more and more of home, of the new life I'm about to start, and I'm feeling excited now.  I'm reunited with my family and meet my baby nephew Alexander for the first time. It's a year since I was last home. Life can change so much in a year. Another family Christmas, but this time with a two nephews, and you, so close.   Not By Accident is made by me, Sophie Harper. Thank you to my friends, my family, my former students and colleagues and my daughter for allowing me to record, for your endless support and for believing in me. It means the world.   Also a big thank you to the generous and talented Liz Tran of Blue Sky Designs, who has built me a beautiful new website, somehow, miraculously, while juggling a baby and a toddler. Hooray for Lea Thau and Strangers podcast! Not By Accident was featured on the latest episode. If you don’t already subscribe to Strangers, do it now. You won't be sorry. Please subscribe, rate and review to help the series find more listeners. Go to notbyaccident.net to sign up to my occasional email newsletter, tweet at me @byaccidentnot and if you know anyone who might like to listen, please share! Music from freemusicarchive.org - CC NC License: Say Goodbye by Adrianna Krikl; Fuck It by Broke For Free; Readers! Do You Read? by Chris Zabriskie; Level 3 by ZhangJW.\n\nUS listeners, support the series and eat well.  Hello Fresh Has signed on to support me for 2017! Sign up at www.hellofresh.com and use the promo code 'noaccident35' to get $35 off your first delivery. Everybody wins!\n\nGo to www.notbyaccident.net to find out more about the series or to get in touch.\n\n      ",
            "length": "28457586",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/rss.art19.com/episodes/b5fa4b34-7e19-4b69-bfaa-425f8d1d1731.mp3"
        },
        {
            "title": "Ep 7: Dinosaurs and Pancakes",
            "datePublished": "Sat, 02 Jul 2016 12:08:26 -0000",
            "description": "\n        It's September 2012. There is a nervous excitement in the building and everybody feels it, from the chefs, to the finance department, and certainly us teachers. 115 students arrive on this Monday afternoon from around the world, about 25 different countries, to start their new life at the European Film College. Most will live on campus like me. They will work harder than probably ever in their lives, make many ambitious films, take creative and personal risks, challenge their preconceptions, find out who they are outside of their own culture, away from their family and friends, as individuals. The 9 months that they are here will feel like a lifetime, but it will go incredibly quickly. Time warps, much like it does in the first year of parenthood.  I know it feels like this because I did it too, 13 years earlier. It was the first day of the best and most creatively fulfilling year of my life, up until the day you were born. I feel incredibly privileged to be on the other side now, to be a part of the team that is invested in giving these students an experience like mine. It is a great responsibility, and one I have put above all else for the past three years. There is an emotional rhythm to the year, almost a narrative arc, and I understand it well now so I hate to be leaving the story before the end. If there was a way to see it through I would, but there really isn't. I will be the best teacher I can be until Christmas time and then hand everything over.  I don't have time to think much about the future. All my energy goes to surviving the present. But there is great joy in the everyday. 20 weeks, time for the second scan. I'm so nervous and excited to see you again, to hear your heart beat again. It's November. Charlotte and I check in regularly as her due date approaches. I long to go home. In only a month, I will. And soon after that, you will arrive too.   Not By Accident is made by me, Sophie Harper. Thanks to my family, my friends and my daughter for allowing me to record, and for the practical and moral support. And to all of you who have left amazing reviews and sent messages, you have brought me to tears multiple times. I am inspired. Please keep them coming! Go to notbyaccident.net to sign up to my occasional email newsletter, tweet at me @byaccidentnot and if you know anyone who might like to listen, please share! Music from freemusicarchive.org - CC NC License: Cylinder One by Chris Zabriskie; CGI Snake by Chris Zabriskie; There’s Probably No Time by Chris Zabriskie; Kqaer by quobe; New Years Eve instrumental 03-12a by Silence is Sexy.\n\nUS listeners, support the series and eat well.  Hello Fresh Has signed on to support me for 2017! Sign up at www.hellofresh.com and use the promo code 'noaccident35' to get $35 off your first delivery. Everybody wins!\n\nGo to www.notbyaccident.net to find out more about the series or to get in touch.\n\n      ",
            "length": "31827173",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/rss.art19.com/episodes/94cb43b1-83a4-4264-98db-5c6e0c676e85.mp3"
        },
        {
            "title": "Ep 6: Seventeen Calls",
            "datePublished": "Fri, 17 Jun 2016 10:19:12 -0000",
            "description": "\n        It’s the end of August in 2012. You have reached a milestone. 13 weeks. The second trimester. For me, it’s a turning point. On Thursday, the day before my first scan, the first time I’ll see you, I put on a baggy shirt and go to meet with my boss, my friend. She is energized after the summer break and excited about the year ahead. Her plans involve me. Of course they do. We’re a team. I realise I have to tell her immediately, not after the scan as I’d intended. I have to destroy her plans, her enthusiasm. I am shaking. I feel like my heart will stop. On Friday I go for the scan. I see you for the first time. Now I don’t have to imagine, I can see! You have all your arms and legs. I am relieved for you, I want you to have as few obstacles in life as possible. I spend the weekend on the phone. 17 calls, 9 hours. I know because I recorded myself and am re-living it making this episode. I’ve categorized my conversations into themes and can see where my preoccupations lie. One third work, one third our unknown future, and the final third divided again: love, lost and longed for, my changing body, and you, my baby, inside me. I feel sad to see how much anxiety over work and the future dominate. We went to Sydney this weekend, to see friends and meet new babies. On the train up, with these conversations fresh in my head, the trip became poignant. I am truly grateful to you, my friends, my family, and my daughter, who accept me when I obsess, when I wallow, when I dominate, and when I’m withdrawn. Who allow me to record, and support me completely. Who share in my sorrows and in my great joys. Who let me share in yours.   Not By Accident is made by me, Sophie Harper. Story input from Rebecca Mostyn. Please subscribe, rate and review to help the series find more listeners. Go to notbyaccident.net to sign up to my occasional email newsletter, tweet at me @byaccidentnot and if you know anyone who might like to listen, please share! Music from freemusicarchive.org - CC NC License: It’s Always Too Late To Start Over by Chris Zabriskie; The Fresh Monday by Dexter Britain; Undercover Vampire Policeman by Chris Zabriskie; Wonder Cycle by Chris Zabriskie; The Time To Run (Finale) by Dexter Britain; Chantiers Navals 412 by LJ Kruger.\n\nUS listeners, support the series and eat well.  Hello Fresh Has signed on to support me for 2017! Sign up at www.hellofresh.com and use the promo code 'noaccident35' to get $35 off your first delivery. Everybody wins!\n\nGo to www.notbyaccident.net to find out more about the series or to get in touch.\n\n      ",
            "length": "31471908",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/rss.art19.com/episodes/0dd389d9-192a-4806-8b5f-5bbdc8631e3d.mp3"
        },
        {
            "title": "Ep 5: Travels Through the First Trimester",
            "datePublished": "Fri, 27 May 2016 04:47:52 -0000",
            "description": "\n        My body has seriously never looked better naked. Everything is soft, plump and trim in all the right places. My breasts are growing. I curse the fact that nobody but me will see, but feel fortunate I don't have to negotiate a physical relationship. They hurt so much they wake me up at night! I also have to get up to pee every few hours. I am so tired. I dread brushing my teeth because of the morning sickness. Foods taste different. I can't get enough of pink grapefruit and nectarines. I am put off by the smell of beer. I never thought that could happen. I am vague and forgetful - pregnancy brain I suppose - and happy that holidays have begun so work won't suffer. My body won't let me push through exhaustion. I plan to swim and go to the gym, but instead I nap. Often. I stare for hours at the embryo images on my pregnancy tracker app, but make a deal with myself never to jump ahead. I want to know exactly what you're up to and not wish it away. Knowing you're growing in there is the most surreal and profound experience I've ever had. Summer holidays have begun and nobody is left here but me. I shouldn't be alone. I need to travel to avoid that.  I pack my wheely suitcase and load my kindle with essential holiday reading: What to Expect when you're Expecting; Choosing Single Motherhood; Single by Chance, Mothers by Choice; The Complete Single Mother; Knock Yourself Up; Sperm Donor = Dad; and of course: My Miserable Lonely Lesbian Pregnancy. I have great friends scattered around Europe, I piece together a plan of who to visit and when, culminating in a week in Iceland with my brother. I take off. It is utterly surreal to be an insignificant figure in these astounding places, and at the same time to be so focused inwards. To be so aware of you there inside me. The captivating wonder of each feels somehow symmetrical and profound. I can see I need to pave two paths while I figure out which one to take. So many things to try to understand, to arrange. Two possible new lives, one in Denmark and one in Australia. Two cultures, two systems, two midwives, two hospital bookings, two childcare places, one baby. So many choices still to make.  In the next episode: summertime is over baby. 13 weeks, the second trimester.   Not By Accident is made by me, Sophie Harper. Thanks to my family, my friends and my daughter for allowing me to record, and for the practical and moral support. Story input from Michelle Webster, Cathy Gray and Diana Lampe. Please subscribe, rate and review to help the series find more listeners. Go to notbyaccident.net to sign up to my occasional email newsletter, tweet at me @byaccidentnot and if you know anyone who might like to listen, please share! Music from freemusicarchive.org - CC NC License: Everybody’s Got Problems That Aren’t Mine by Chris Zabriskie; Rain Begins to Fall (Instrumental) by Silence Is Sexy; Blindness Rats by Khonner; Something Elated by Broke For Free; Murmur by Broke For Free; The Stars Are Out by Dexter Britain. Music by permission from the artist: You, You’ll be Waiting by Baby Blue.\n\nUS listeners, support the series and eat well.  Hello Fresh Has signed on to support me for 2017! Sign up at www.hellofresh.com and use the promo code 'noaccident35' to get $35 off your first delivery. Everybody wins!\n\nGo to www.notbyaccident.net to find out more about the series or to get in touch.\n\n      ",
            "length": "25765929",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/rss.art19.com/episodes/3a9c4fad-501a-4961-a125-a9762e7a030c.mp3"
        },
        {
            "title": "Ep 4: My Love Life",
            "datePublished": "Thu, 12 May 2016 13:26:46 -0000",
            "description": "\n        I had morning sickness and was trying hard to look after myself, now about 5 weeks pregnant, but it was a struggle with the lack of structure in my life over the summer, and all this travel.  Today though, back to work, just for a week. I was feeling guilty and conflicted about work. This was really the first time in my life that I wasn’t putting work ahead of everything else and it made me very uneasy. I was lonely and felt very isolated. It wasn’t a choice I’d made, to go through life alone.  After I came out at 30, I ventured out into the Sydney lesbian scene. I felt like a 30 year old teenager. It was exciting and terrifying. I started internet dating. I had some fun. I got my heart broken a couple of times. I fell in love with a woman called Lucy and we had a relationship that was intense, exciting and before long, tumultuous. The fact that I wanted a baby at some point added extra strain. She moved with me to Denmark and things unraveled.  I found myself living alone in a beautiful big, empty apartment, broken hearted again, in rural Denmark with no friends nearby and almost no lesbians in sight. I had my dream job but my personal life was empty and I kept wondering why I was doing this to myself in the last years of my youth. I gave everything I had to my work, which I loved.  So much was unknown, and unknowable. It was the first time I really wondered if I could do this. But now I have a long vacation in Europe which I’m determined to enjoy. Six years have passed since Lucy and I broke up, but we’ll always care about each other from a distance, and now it’s clear that the love carries through to the next generation.   Not By Accident is made by me, Sophie Harper. Thanks to my family, my friends and my daughter for allowing me to record, and for the practical and moral support. Please subscribe, rate and review to help the series find more listeners. Go to notbyaccident.net to sign up to my occasional email newsletter, tweet at me @byaccidentnot and if you know anyone who might like to listen, please share! Music from freemusicarchive.org - CC NC License: Like Swimming by Broke For Free; I Don’t See The Branches, I See The Leaves by Chris Zabriskie; Safe In Glass Houses by Dexter Britain; Going Under by Dexter Britain; Level 2 by Total Reboot.\n\nUS listeners, support the series and eat well.  Hello Fresh Has signed on to support me for 2017! Sign up at www.hellofresh.com and use the promo code 'noaccident35' to get $35 off your first delivery. Everybody wins!\n\nGo to www.notbyaccident.net to find out more about the series or to get in touch.\n\n      ",
            "length": "24862720",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/rss.art19.com/episodes/ee976ca4-1edc-4ab9-a711-4963592e5182.mp3"
        },
        {
            "title": "Ep 3: Donor Deliberations",
            "datePublished": "Thu, 28 Apr 2016 07:51:30 -0000",
            "description": "\n        One day, soon after I left school, my mother told me that she wanted me to have a baby one day and she didn’t care how I did it, even if I did it alone, as long as I did it. I was a bit taken aback. Of course I’d have a baby one day. I’d always known I would.  I imagined I’d do it the way school girls imagine they’ll do it: I’d fall in love with a man, he’d fall in love with me, and the family would naturally follow. It took me another decade to come out. I got cancer and faced my own mortality. My mum almost died too. Things came sharply into focus and I realized as we both went into remission, this was no way to live the rest of my precious life. Very soon after, I made a weekend trip to come out to my parents. A huge weight lifted. It seems crazy that it took so much for me to be comfortable being who I am, but for some reason it did. The thing I felt saddest about letting go of was the idea of creating a baby, biologically, with a person I was in love with and for us to be a family. Eventually I decided the end the best option was a sperm bank. After thinking about it for 8 years, it was an easy decision to make. The clinic gave me a list. Checking out their profiles was a lot like internet dating, but of course they didn’t have to choose me back.  I wanted some input. My mother obliged. It would be my decision, but I was happy not to make it all on my own.    Not By Accident is made by me, Sophie Harper. Thanks to my family, my friends and my daughter for allowing me to record, and for the practical and moral support. Please subscribe, rate and review to help the series find more listeners. Go to notbyaccident.net to sign up to my occasional email newsletter, tweet at me @byaccidentnot and if you know anyone who might like to listen, please share! Music from freemusicarchive.org - CC NC License: Murmur by Broke For Free; One And by Broke For Free; Our Ego (Feat. Different Visitor) by Broke For Free; Pattern 4 (Version 10) by Cyan341; Seeing The Future by Dexter Britain.\n\nUS listeners, support the series and eat well.  Hello Fresh Has signed on to support me for 2017! Sign up at www.hellofresh.com and use the promo code 'noaccident35' to get $35 off your first delivery. Everybody wins!\n\nGo to www.notbyaccident.net to find out more about the series or to get in touch.\n\n      ",
            "length": "24081554",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/rss.art19.com/episodes/ddbde780-1b09-436f-bc9f-5f1abc8c7068.mp3"
        },
        {
            "title": "Ep 2: Your Grandparents",
            "datePublished": "Thu, 14 Apr 2016 01:30:05 -0000",
            "description": "\n        In 2012 I went home to Australia for Christmas. I had three weeks off from my job teaching documentary filmmaking in Denmark, just enough time to make the trip worthwhile. I wanted to ground myself after a recent break-up and as I came to terms with the fact that really was I was going to try to have a baby on my own, and soon, before it was too late. A couple of weeks after I returned to Denmark to work, I turned 38. I called a clinic and made an appointment to come and talk to them about choosing a donor and getting pregnant. This courage didn’t come from nowhere. I want to take you back to start unravelling some of the events that led to this point. As I approached 30, my mother underwent devastating treatment for advanced lymphatic cancer. She had two years of chemo and nobody thought she would survive. I had a mole on my arm that I’d been worried about for a long time, but a few doctors had told me it was nothing. It wasn’t. It was cancer. Stage two melanoma. My mother had her stem cell transplant days after I had my surgery. I don’t think there’s been a worse week in my family, ever. Then things turned around. My surgery biopsy results came back clear! Her transplant worked! It took some time to build her strength, but she went into remission! Now she has 4 grandchildren who adore her, who we’d had to accept she’d never get to meet. My father and step-mother came to Europe for a holiday just two weeks after my insemination. I hadn’t told them I’d done it yet so wasn’t totally sure how they’d react to this news. They were the first people I spoke the words to with certainty: ‘I did the test again. I’m definitely pregnant!’   Not By Accident is made by me, Sophie Harper. Thanks to my family, my friends and my daughter for allowing me to record, and for the practical and moral support. Please subscribe, rate and review to help the series find more listeners. Go to notbyaccident.net to sign up to my occasional email newsletter, tweet at me @byaccidentnot and if you know anyone who might like to listen, please share! Clips from ABC TV profile of Diana Lampe on Stateline Canberra by journalist Catherine Garrett. Music from freemusicarchive.org - CC NC License: Wednesday by Adrianna Krikl; Disconnect by Adrianna Krikl; Less Than Three by Adrianna Krikl; Tam814 by LJ Kruzer; Tamz by LJ Kruzer; The Stars Are Out by Dexter Britain.\n\nUS listeners, support the series and eat well.  Hello Fresh Has signed on to support me for 2017! Sign up at www.hellofresh.com and use the promo code 'noaccident35' to get $35 off your first delivery. Everybody wins!\n\nGo to www.notbyaccident.net to find out more about the series or to get in touch.\n\n      ",
            "length": "20201221",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/rss.art19.com/episodes/2d8881ad-a125-4564-a581-01e743576c8a.mp3"
        },
        {
            "title": "Ep 1: Insemination Story",
            "datePublished": "Wed, 30 Mar 2016 07:23:39 -0000",
            "description": "\n        One morning in May my ovulation test showed as positive, and it was time to stop thinking about it and actually do it! I was living and working in Denmark when I reached the age of 38, the cut-off I’d settled on to try to have a baby alone before it was too late. I had decided on a donor and the sample was on stand-by. I was incredibly fortunate as Denmark has a thriving fertility tourism industry and maternity benefits that made it possible for me to even consider doing what I was about to try and do.  Life just happens and we can’t always control the circumstances or events, we just have to deal with what comes our way. Now and then we can make a big choice, and take action and set life on a new course. We don't have to just accept things as they are. We can make life more what we want it to be.   Not By Accident is made by me, Sophie Harper. Thanks to my family, my friends and my daughter for allowing me to record, and for the practical and moral support. Please subscribe, rate and review to help the series find more listeners. Go to notbyaccident.net to sign up to my occasional email newsletter, tweet at me @byaccidentnot and if you know anyone who might like to listen, please share! Music from freemusicarchive.org - CC NC License: Charge into 2015 by Dexter Britain; What Does Anybody Know About Anything by Chris Zabriskie; The Time to Run (Finale) by Dexter Britain; The Stars Are Out (Interlude) by Dexter Britain; Tam8+ei4 by LJ Kruger.\n\nUS listeners, support the series and eat well.  Hello Fresh Has signed on to support me for 2017! Sign up at www.hellofresh.com and use the promo code 'noaccident35' to get $35 off your first delivery. Everybody wins!\n\nGo to www.notbyaccident.net to find out more about the series or to get in touch.\n\n      ",
            "length": "15671797",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/rss.art19.com/episodes/190b8fd7-ae2a-49e9-bbaf-ece86d6c54bf.mp3"
        },
        {
            "title": "Ep 0 - Not By Accident Teaser",
            "datePublished": "Tue, 22 Mar 2016 01:00:00 -0000",
            "description": "\n        This is the teaser for Not By Accident, an audio documentary series about choosing to become a single mother and coping with being one, made by me, Sophie Harper. Subscribe, rate, review wherever you listen to podcasts. Go to notbyaccident.net to sign up to my occasional email newsletter, and if you know anyone who might like to listen, please share! Music by permission from the artist: We’re Walking Through by Baby Blue.\n      ",
            "length": "1660551",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/rss.art19.com/episodes/bd6fc0f0-2761-43ae-bdc1-1addce54f8b3.mp3"
        }
    ]
}