{
    "artwork": "http://is1.mzstatic.com/image/thumb/Music6/v4/fe/01/60/fe016044-60f7-38b6-2f0b-80a1573c21ac/source/100x100bb.jpg",
    "description": "Called \"one of the last bastions of serious journalism on TV,\" PBS's weekly news show NOW engages viewers with documentary segments and insightful interviews that probe today's most important issues, including media policy, corporate accountability, civil liberties, the environment, money in politics, and foreign affairs. In an era when commercial journalism risks overwhelming democratic values, NOW continues to stand apart as the \"one program going against the grain.\"",
    "feedURL": "http://feeds.feedburner.com/NOWonPBS",
    "podcastURL": "http://www.pbs.org/now/rss/media/redir/now/index.html",
    "publisher": "now@thirteen.org (NOW on PBS)",
    "title": "NOW on PBS",
    "episodes": [
        {
            "title": "The Best of NOW: Issues and Insight",
            "datePublished": "Fri, 30 Apr 2010 16:00:00 EST",
            "description": "NOW on PBS goes off the air with not just a look back at our most memorable moments, but a mission to leverage these eight years of investigation and insight into lasting inspiration. In the special, NOW examines economic hardships and innovative solutions, the human faces behind the health care fight and other political battles, environmental crises both here and around the world, and more 21st century issues that defined and changed us. NOW on PBS dedicates this last show, as it has every show, to the issues that matter. Because -- now, more than ever -- they still do.<img src=\"http://feeds.feedburner.com/~r/NOWonPBS/~4/XEUUJ-84Res\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "8220682",
            "sourceUrl": "http://feedproxy.google.com/~r/NOWonPBS/~5/P3GEq5M44Fk/NOW-618.mp3",
            "categories": [
                "Politics"
            ]
        },
        {
            "title": "The Best of NOW: The Wars",
            "datePublished": "Fri, 23 Apr 2010 16:00:00 EST",
            "description": "NOW on PBS has been covering the wars in Iraq and Afghanistan for as long as we've been on the air. In that time, we've recognized that there's much to these conflicts than be covered by short segments and passionate punditry. In fact, our body of work -- which includes being embedded with U.S. soldiers in Afghanistan, meeting soldiers' families in Texas, taking fire in Iraq's Anbar Province, and seeing how we treat wounded veterans back home -- shines a new light on human costs of war, and the price we pay going forward. In NOW on PBS' second-to-last show ever -- we take a look back at Iraq and Afghanistan to hopefully reveal insight about the dangerous and tricky road ahead, and how our leaders and soldiers should be traveling it.<img src=\"http://feeds.feedburner.com/~r/NOWonPBS/~4/fUWD2_6XO3s\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "8220682",
            "sourceUrl": "http://feedproxy.google.com/~r/NOWonPBS/~5/ZmsG8Z1afr0/NOW-617.mp3",
            "categories": [
                "Politics"
            ]
        },
        {
            "title": "The Best of NOW: In-Depth Investigations",
            "datePublished": "Fri, 16 Apr 2010 16:00:00 EST",
            "description": "The NOW broadcast series is ending -- the show will go off the air in just three weeks. NOW looks back on eight years of in-depth investigative reporting to examine what's been uncovered and accomplished, as well as what still needs to be done to preserve and enhance our democracy. Is true investigative journalism disappearing just when we need it most? Compare past to present through our NOW on PBS lens, and decide for yourselves.<img src=\"http://feeds.feedburner.com/~r/NOWonPBS/~4/TrMTGupFj-8\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "8220682",
            "sourceUrl": "http://feedproxy.google.com/~r/NOWonPBS/~5/Bu4v6OCUAD8/NOW-616.mp3",
            "categories": [
                "Politics"
            ]
        },
        {
            "title": "A Town Revitalized?",
            "datePublished": "Fri, 09 Apr 2010 16:00:00 EST",
            "description": "The national economic disaster hit the city of Braddock Pennsylvania like a wrecking ball. But Braddock Mayor John Fetterman -- dubbed \"America's Coolest Mayor\" by The New York Times -- is taking very unconventional approaches to reinventing the town and re-inspiring its residents. Home to the nation's first A&P supermarket and Andrew Carnegie's first steel mill, Braddock is being revitalized with new youth and art programs, renovations of abandoned real estate, and bold plans to attract artists and green industries.\r\n\r\nNOW sits down with Mayor Fetterman to learn how the 6'8\" 370-pound political novice is trying to turn his town around, and if other devastated communities can and should follow his large footsteps.<img src=\"http://feeds.feedburner.com/~r/NOWonPBS/~4/lDjl--SyqcM\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "8220682",
            "sourceUrl": "http://feedproxy.google.com/~r/NOWonPBS/~5/ZI9CpmdLYbk/NOW-615.mp3",
            "categories": [
                "Politics"
            ]
        },
        {
            "title": "Maximum Capacity",
            "datePublished": "Fri, 02 Apr 2010 16:00:00 EST",
            "description": "The number of inmates in American prisons is outpacing the system's ability to hold them all. In one startling example, California prisons hold well over 50,000 more inmates than they're designed for, even though the state has built a dozen new prisons in the last 15 years. One of the biggest reasons is rampant recidivism.\r\n\r\nNOW goes inside an Illinois prison that may have the answer to California's problems. With its innovative plan to keep released inmates from coming back, the Sheridan Correctional Center is trying to redefine \"tough on crime\" by being the largest fully dedicated drug prison in the country. The approach involves aggressive counseling, job training, and following the convicts after they get out. Can their novel approach keep convicts out of jail for good?<img src=\"http://feeds.feedburner.com/~r/NOWonPBS/~4/5RGTOHIOjj4\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "8220682",
            "sourceUrl": "http://feedproxy.google.com/~r/NOWonPBS/~5/1S7-KixIrMQ/NOW-322.mp3",
            "categories": [
                "Politics"
            ]
        },
        {
            "title": "\"Gasland\"",
            "datePublished": "Fri, 26 Mar 2010 16:00:00 EST",
            "description": "In the debate over energy resources, natural gas is often considered a \"lesser-of-evils\". While it does release some greenhouse gases, natural gas burns cleaner than coal and oil, and is in plentiful supply -- parts of the U.S. sit above some of the largest natural gas reserves on Earth. But a new boom in natural gas drilling, a process called \"fracking\", raises concerns about health and environmental risks. \r\n\r\nNOW talks with filmmaker Josh Fox about \"Gasland\", his Sundance award-winning documentary on the surprising consequences of natural gas drilling. Fox's film -- inspired when the gas company came to his hometown -- alleges chronic illness, animal-killing toxic waste, disastrous explosions, and regulatory missteps.<img src=\"http://feeds.feedburner.com/~r/NOWonPBS/~4/z6vLGM62Ols\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "8220682",
            "sourceUrl": "http://feedproxy.google.com/~r/NOWonPBS/~5/7GoPRGPFLek/NOW-613.mp3",
            "categories": [
                "Politics"
            ]
        },
        {
            "title": "Soap Opera for Social Change",
            "datePublished": "Fri, 19 Mar 2010 16:00:00 EST",
            "description": "There are places in the world where the success of a soap opera is measured not just in TV ratings, but in human lives. NOW travels to Kenya, where ambitious producers and actors hope one such TV show, \"The Team\", can help foster peace amongst the country's 42 official tribes.<br/><br/>\r\n\r\nDuring presidential elections two years ago, tribalism-influenced protests in Kenya left almost 1,500 dead and nearly 300,000 displaced. Tensions continue today over issues including extreme poverty and widespread corruption.<br/><br/>\r\n\r\nIn \"The Team\", soccer players from different tribes work together to overcome historic rivalries and form a common bond. The hope is that commonalities portrayed in fiction can inspire harmony in the real world. Early reaction to the show's inaugural season is promising.<br/><br/>\r\n\r\n\"I was very surprised to see how Kenyans want change, how they want to live in peace and the way the responded to us,\" Milly Mugadi, one of the show's stars, noted during a local screening. \"There were people from different tribes talking about peace and how to reconcile with each other... they opened up their hearts.\"<br/><br/>\r\n\r\nJohn Marks, whose organization Common Ground produces versions of \"The Team\" in 12 different countries, is cautiously hopeful. \"You don't watch one of our television shows and drop your submachine gun,\" explains Marks, who says he was inspired by the influence of \"All in the Family\" on American culture. \"But you can change the environment so it becomes more and more difficult to be in violent conflict.\"<br/><br/>\r\n\r\nCan this soap opera for social change really make a difference in stopping violence?<img src=\"http://feeds.feedburner.com/~r/NOWonPBS/~4/mu7gGjpsAvg\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "8220682",
            "sourceUrl": "http://feedproxy.google.com/~r/NOWonPBS/~5/SY1XNTHm-lg/NOW-601.mp3",
            "categories": [
                "Politics"
            ]
        },
        {
            "title": "On Thin Ice",
            "datePublished": "Fri, 17 Apr 2009 16:00:00 EST",
            "description": "Two men on a remarkable journey high in the Himalayas investigate threats to global water and food supply.<br/><br/>Seventy-five percent of the world's fresh water is stored in glaciers, but scientists predict climate change will cause some of the world's largest glaciers to completely melt by 2030. What effect will this have on our daily lives, especially our water and food supply? With global warming falling low on a national list of American concerns, it's time to take a deeper look at what could be a global calamity in the making.<br/><br/>In a special one-hour NOW on PBS, David Brancaccio and environmentalist Conrad Anker -- one of the world's leading high altitude climbers -- adventure to the Gangotri Glacier in the Himalayan Mountains, the source of the Ganges River, to witness the great melt and its dire consequences first-hand. The two also visit Montana's Glacier National Park to see the striking effects of global warming closer to home and learn how melting glaciers across the world can have a direct impact on food prices in the U.S.<br/><br/>Along the way, Brancaccio and Anker talk to both scientists and swamis, bathe in the River Ganges, view a water shortage calamity in India, and see with their own eyes and cameras the tangible costs of climate change.<br/><br/>\"We can't take climate change and put it on the back burner,\" warns Anker. \"If we don't address climate change, we won't be around as humans.\"<img src=\"http://feeds.feedburner.com/~r/NOWonPBS/~4/w0jgzfcQGyo\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "0",
            "sourceUrl": "http://feedproxy.google.com/~r/NOWonPBS/~5/3Rnd5EC6Cts/NOW-516.mp3",
            "categories": [
                "Politics"
            ]
        },
        {
            "title": "Food, Inc.",
            "datePublished": "Fri, 05 Mar 2009 16:00:00 EST",
            "description": "Americans have a longstanding love affair with food -- the modern supermarket has, on average, 47,000 products. But do we really know what goes into making the products we so eagerly consume? David Brancaccio talks with filmmaker Robert Kenner, the director of Food, Inc., which takes a hard look at the secretive and surprising journey food takes on the way from processing plants to our dinner tables. The two discuss why contemporary food processing secrets are so closely guarded, their impact on our health, and another surprising fact: how consumers are actually empowered to make a difference.<img src=\"http://feeds.feedburner.com/~r/NOWonPBS/~4/cToehOQVhTs\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "8220682",
            "sourceUrl": "http://feedproxy.google.com/~r/NOWonPBS/~5/M_pqA-K0hQw/NOW-523.mp3",
            "categories": [
                "Politics"
            ]
        },
        {
            "title": "Hunting Wolves, Saving Wolves",
            "datePublished": "Fri, 26 Feb 2010 16:00:00 EST",
            "description": "In 1995 and 1996, 66 gray wolves were relocated from Canada to Yellowstone National Park and central Idaho to help recover a wolf population that had been exterminated in the northern Rockies. The gray wolf relocation is considered one of the most successful wildlife recovery projects ever attempted under the Endangered Species Act; today there are more than 1,600 wolves in the region. But a debate has erupted between conservationists and ranchers over the question: how many wolves are too many? \r\n\r\nLast year, the Obama Administration entered the fray by removing federal protection for some of these wolves, paving the way for controversial state-regulated wolf hunts. The move has wolf advocates fuming, with more than a dozen conservation groups suing the Interior Department to restore federal protections. NOW reports on this war over wolves and implications for the area.<img src=\"http://feeds.feedburner.com/~r/NOWonPBS/~4/Mwm4notcuTg\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "8169482",
            "sourceUrl": "http://feedproxy.google.com/~r/NOWonPBS/~5/42CwLv5wz1o/NOW-609.mp3",
            "categories": [
                "Politics"
            ]
        },
        {
            "title": "Angry Voters",
            "datePublished": "Fri, 19 Feb 2010 16:00:00 EST",
            "description": "From the raucous tea party rallies to the painful sacrifices families are making behind closed doors, voter angst and anger are sweeping the country like a storm. Directly in its path: the 2010 midterm elections. NOW examines the strong impact this groundswell has already had on electoral politics, and what we can expect in November. Our investigation uncovers what motivates people who've come together under the tea party banner, and how a larger dissatisfaction among voters spells trouble for incumbents in both parties, some of whom have decided to avert the storm by leaving Congress altogether.<img src=\"http://feeds.feedburner.com/~r/NOWonPBS/~4/dsUnapnHOn0\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "8169482",
            "sourceUrl": "http://feedproxy.google.com/~r/NOWonPBS/~5/Wyrk6zBtwb4/NOW-608.mp3",
            "categories": [
                "Politics"
            ]
        },
        {
            "title": "Caring About Congo",
            "datePublished": "Fri, 12 Feb 2010 16:00:00 EST",
            "description": "Even with the recent outpouring of support for earthquake victims in Haiti, Americans' attention span for global crises is usually very short. But is there a way to keep American audiences from tuning out important global issues of violence, poverty, and catastrophe far beyond their backyards? NOW talks with filmmaker Eric Metzgar about \"Reporter,\" his documentary about the international reporting trips of New York Times columnist Nicholas Kristof. In the film, Metzgar provides fascinating insight into how Kristof breaks through and gets us to think deeply about people and issues half a world away.<img src=\"http://feeds.feedburner.com/~r/NOWonPBS/~4/utvD2MY6bjM\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "8169482",
            "sourceUrl": "http://feedproxy.google.com/~r/NOWonPBS/~5/xEzariyWcmE/NOW-607.mp3",
            "categories": [
                "Politics"
            ]
        },
        {
            "title": "Democrats and the New Politics of Abortion",
            "datePublished": "Fri, 05 Feb 2010 16:00:00 EST",
            "description": "To gain their historic control of Congress, Democrats fielded moderate candidates who didn't always follow the party line, especially when it came to abortion. Now that the Democratic Party has the legislative upper hand, are they willing to negotiate away reproductive rights for other political gains? NOW goes to Allentown, Pennsylvania to ask: Are abortion rights now in jeopardy at the very hands of the party that has historically protected them? Among those interviewed are pro-life Democratic U.S. Representative Bart Stupak and former DNC Chairman Howard Dean.\r\n\r\n\"If there was a bill on the floor to reverse Roe vs Wade, and says 'life begins at conception,' I would vote for it.\" Congressman Stupak tells NOW.\r\n\r\nJen Boulanger, director of the often-protested Allentown Women's Center, says, \"I would expect more from the Democratic Party, to stick to their ideals, not just throw us to the curb.\"\r\n\r\nHas the Democratic Party traded principles for power?<img src=\"http://feeds.feedburner.com/~r/NOWonPBS/~4/JG5imggiTww\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "8169482",
            "sourceUrl": "http://feedproxy.google.com/~r/NOWonPBS/~5/k37q4oRu-kI/NOW-606.mp3",
            "categories": [
                "Politics"
            ]
        },
        {
            "title": "Saving Haiti's Mothers",
            "datePublished": "Fri, 29 Jan 2010 16:00:00 EST",
            "description": "Haiti's catastrophic earthquake, in addition to leaving lives and institutions in ruin, also exacerbated a much more common and lethal emergency in Haiti: Dying during childbirth. Challenges in transportation, education, and quality health care contribute to Haiti having the highest maternal mortality rate in the Western Hemisphere, a national crisis even before the earthquake struck. \r\n\r\nWhile great strides are being made with global health issues like HIV/AIDS, maternal mortality figures worldwide have seen virtually no improvement in 20 years. Worldwide, over 500,000 women die each year during pregnancy.\r\n\r\nA NOW team that had been working in Haiti during the earthquake reports on this deadly but correctable trend. They meet members of the Haitian Health Foundation (HHF), which operates a network of health agents in more than 100 villages, engaging in pre-natal visits, education, and emergency ambulance runs for pregnant women. \r\n\r\nThe United Nations Population Fund, which trains midwives to share life-saving birth techniques, says that with proper funding, public support, and wider application of simple but scarce innovations, such deaths could be reduced by nearly 70%.\r\n\r\nAs humanitarian attention on Haiti slowly fades, the issue of maternity mortality remains as imperative as ever. But with an estimated 63,000 women in Haiti currently pregnant -- and a main midwife training school devastated by the earthquake -- the mission of keeping mothers alive has never been more daunting.<img src=\"http://feeds.feedburner.com/~r/NOWonPBS/~4/sj9ETty1LBg\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "8169482",
            "sourceUrl": "http://feedproxy.google.com/~r/NOWonPBS/~5/fUl-AsaR8FI/NOW-605.mp3",
            "categories": [
                "Politics"
            ]
        },
        {
            "title": "Who's Helping Our Wounded Vets?",
            "datePublished": "Fri, 22 Jan 2010 16:00:00 EST",
            "description": "The Pentagon estimates that as many as one in five American soldiers are coming home from war zones with traumatic brain injuries, many of which require round-the-clock attention. But lost in the reports of these returning soldiers are the stories of family members who often sacrifice everything to care for them. NOW reveals how little has been done to help these family caregivers, and reports on dedicated efforts to support them.<img src=\"http://feeds.feedburner.com/~r/NOWonPBS/~4/TJUM2TD-0tM\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "8169482",
            "sourceUrl": "http://feedproxy.google.com/~r/NOWonPBS/~5/RBsVjvM-3S8/NOW-547.mp3",
            "categories": [
                "Politics"
            ]
        },
        {
            "title": "Saving American Journalism",
            "datePublished": "Fri, 15 Jan 2010 16:00:00 EST",
            "description": "Is good journalism going extinct? Fractured audiences and tight budgets have downsized or sunk many of the fourth estate's major battleships, including this very program. NOW's David Brancaccio talks to professor Bob McChesney and journalist John Nichols about the perils of a shrinking news media landscape, and their bold proposal to save noncommercial journalism with government subsidies. Their new book is \"The Death and Life of American Journalism: The Media Revolution that Will Begin the World Again.\"<br/><br/>\r\n\r\nShould public journalism get the next government bailout?<img src=\"http://feeds.feedburner.com/~r/NOWonPBS/~4/n2CVWJDlj7A\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "8220682",
            "sourceUrl": "http://feedproxy.google.com/~r/NOWonPBS/~5/VqumnWqkQQY/NOW-603.mp3",
            "categories": [
                "Politics"
            ]
        },
        {
            "title": "Targeting the Taliban",
            "datePublished": "Fri, 08 Jan 2010 16:00:00 EST",
            "description": "President Obama is sending as many as 30,000 more troops to combat Taliban and al Qaeda forces in Afghanistan this year, but are we missing the true target? NOW reports directly from Pakistan's dangerous and pivotal border with Afghanistan, where Pentagon war planners acknowledge many of the enemy fighters and their leaders are based. The U.S. has been relying on Pakistan to act against Taliban militants there, but the Pakistani army's commitment is in question.<img src=\"http://feeds.feedburner.com/~r/NOWonPBS/~4/TI0U84N7iFQ\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "8220682",
            "sourceUrl": "http://feedproxy.google.com/~r/NOWonPBS/~5/RSoJo3rvZAw/NOW-602.mp3",
            "categories": [
                "Politics"
            ]
        },
        {
            "title": "Student Loan Sinkhole?",
            "datePublished": "Fri, 25 Dec 2009 16:00:00 EST",
            "description": "According to the Department of Education, the average amount of an undergraduate student loan in this country is now more than $22,000. And sudden changes in lenders' terms and rates can quickly turn a personal debt into a financial sinkhole, grounding the dreams of many college graduates even before they've started. NOW follows the story of a single mother in Baltimore trying to dig herself out of a $70,000 student loan debt. While issues of personal responsibility are debated, there's no question the high price of higher education is creating an ocean of student loan debt for people who can least afford it -- and yet another frustrating complication for America's economic recovery.<img src=\"http://feeds.feedburner.com/~r/NOWonPBS/~4/EbVOraPxZ4Y\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "8220682",
            "sourceUrl": "http://feedproxy.google.com/~r/NOWonPBS/~5/GvmX2n4CZjo/NOW-525.mp3",
            "categories": [
                "Politics"
            ]
        },
        {
            "title": "Africa: House Calls and Health Care",
            "datePublished": "Fri, 18 Dec 2009 16:00:00 EST",
            "description": "In rural Rwanda, the simple and time-tested idea of medical house calls is not only improving the health of the community, but stimulating its economy as well. NOW travels to the village of Rwinkwavu to meet the Rwandan doctors, nurses and villagers who are teaming up with Boston-based Partners in Health and the Rwandan government to deliver medicine and medical counseling door-to-door. Would such an innovation work in America?<br/><br/>\r\n\r\nIn the capital of Kigali, NOW's David Brancaccio sits down with Rwandan President Paul Kagame to talk about international aid and Kagame's ultimate vision for a healthy, financially-independent Rwanda.<img src=\"http://feeds.feedburner.com/~r/NOWonPBS/~4/e8scq5VQLMc\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "8220682",
            "sourceUrl": "http://feedproxy.google.com/~r/NOWonPBS/~5/ZAQzaW1_ZYI/NOW-537.mp3",
            "categories": [
                "Politics"
            ]
        },
        {
            "title": "The Marines Are Landing",
            "datePublished": "Fri, 11 December 2009 16:00:00 EST",
            "description": "Over the next four years, approximately 30,000 Marines and their families will move to the small island of Guam, nearly tripling its presence there.<br/><br/>\r\n\r\nIt's part of a larger agreement that the U.S. signed with Japan to realign American forces in the Pacific, but how will this multi-billion dollar move impact the lives and lifestyle of Guam's nearly 200,000 residents?<br/><br/>\r\n\r\nThis week, NOW on PBS travels to the U.S. territory of Guam to find out whether their environment and infrastructure can support such a large and quick infusion of people, and why the buildup is vital to our national security.<img src=\"http://feeds.feedburner.com/~r/NOWonPBS/~4/gE74k7eWrNU\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "8169482",
            "sourceUrl": "http://feedproxy.google.com/~r/NOWonPBS/~5/KpsYxrGJSGA/NOW-550.mp3",
            "categories": [
                "Politics"
            ]
        },
        {
            "title": "PBS Special Report: Health Care Reform",
            "datePublished": "Fri, 04 Dec 2009 16:00:00 EST",
            "description": "With health care reform now the most pressing and talked-about domestic issue in America, the hallmark PBS programs NOW ON PBS, TAVIS SMILEY and NIGHTLY BUSINESS REPORT are collaborating to provide a single timely and much-needed in-depth look at health care reform in America and the latest government proposals to address the issue.<br/><br/>\r\n\r\nThe program will include late-breaking news and analysis on the health care debate and also feature cultural, political and economic insight from each program:<br/><br/>\r\n\r\nNOW ON PBS will examine how reform may change the way we live, especially for boomers who have their own coverage, but are also responsible for aging parents and grown children.<br/><br/>\r\n\r\nNIGHTLY BUSINESS REPORT will investigate the costs and controversies of employer-provided health care and new coverage requirements many companies are adopting as a means of controlling health care.<br/><br/> \r\n\r\nTAVIS will examine the causes and effects of childhood obesity, particularly within communities of color, and explore ways to address this health care crisis.<br/><br/>\r\n\r\nAn examination of one of the most far-reaching and controversial initiatives in decades, from the most trusted journalists in America. A PBS Special Report: Health Care Reform.<br/><br/><img src=\"http://feeds.feedburner.com/~r/NOWonPBS/~4/7MIkzSbVOfk\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "8220682",
            "sourceUrl": "http://feedproxy.google.com/~r/NOWonPBS/~5/1SkvihlCMFI/NOW-539.mp3",
            "categories": [
                "Politics"
            ]
        },
        {
            "title": "Climate Crisis",
            "datePublished": "Fri, 27 November 2009 16:00:00 EST",
            "description": "The Maldives, a nation of roughly 1200 low-lying islands in the Indian Ocean, could be underwater by the end of this century if climate change causes ocean levels to rise. On the eve of the big climate summit in Copenhagen, the country's president, Mohamed Nasheed, is warning of a massive exodus from the Maldives if drastic global action is not taken. NOW talks with President Nasheed about the climate crisis and why he compares it to genocide.<img src=\"http://feeds.feedburner.com/~r/NOWonPBS/~4/npUL_e-Et8I\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "8169482",
            "sourceUrl": "http://feedproxy.google.com/~r/NOWonPBS/~5/5uZsFxdNrNE/NOW-548.mp3",
            "categories": [
                "Politics"
            ]
        },
        {
            "title": "Elizabeth Warren on the Economy",
            "datePublished": "Fri, 12 November 2009 16:00:00 EST",
            "description": "What exactly is going on with the economy? Stocks are up and big bonuses are back, but while they're throwing parties on Wall Street, there's pain on Main Street. One out of every six workers is unemployed or underemployed, according to government statistics -- the highest figure since the Great Depression.<br/><br/>\r\n\r\nNOW gets answers and insight from Harvard professor Elizabeth Warren, who's been heading up the congressional panel overseeing how the bailout money is being spent. NOW Senior Correspondent Maria Hinojosa talks with Warren about how we got to this point, and where we go from here.<br/><br/>\r\n\r\nWhat will it take to put both bankers and American businesses on the same road to recovery?<img src=\"http://feeds.feedburner.com/~r/NOWonPBS/~4/nGXfr4fJt58\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "8169482",
            "sourceUrl": "http://feedproxy.google.com/~r/NOWonPBS/~5/iGa1pUPmN1c/NOW-546.mp3",
            "categories": [
                "Politics"
            ]
        },
        {
            "title": "Interview: David Sirota",
            "datePublished": "Fri, 06 November 2009 16:00:00 EST",
            "description": "Only one year after a historic election rerouted the course of America's political culture, do the 2009 election results show momentum swinging in the opposite direction? NOW's David Brancaccio talks to political author and columnist David Sirota about populist anger, the Obama administration's successes and failures, and how this week's election results foreshadow the state of politics in 2010.<img src=\"http://feeds.feedburner.com/~r/NOWonPBS/~4/cpv2OaNArKs\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "8169482",
            "sourceUrl": "http://feedproxy.google.com/~r/NOWonPBS/~5/diOsrq1SlZA/NOW-545.mp3",
            "categories": [
                "Politics"
            ]
        },
        {
            "title": "Electric Car Dreams",
            "datePublished": "Fri, 30 Oct 2009 16:00:00 EST",
            "description": "Home to a worldwide summit on climate change in early December, Denmark is setting a global example in creating clean power, storing it, and using it responsibly. Their reliance on wind power to produce electricity without contributing to global warming is well known, but now they're looking to drive the point home with electric cars. To do this, they've partnered with social entrepreneur Shai Agassi and his company Better Place.<br/><br/>\r\n\r\nNOW investigates how the Danish government and Better Place are working together to put electric cars into the hands of as many Danish families as possible. The idea is still having trouble getting out of the garage here in America, but Denmark could be an inspiration.<br/><br/>\r\n\r\nWill so much green enthusiasm bring about a \"Copenhagen Protocol\"? This show is part of a series on social entrepreneurs at work that we call \"Enterprising Ideas.\"<img src=\"http://feeds.feedburner.com/~r/NOWonPBS/~4/j-5GtauAdfA\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "8169482",
            "sourceUrl": "http://feedproxy.google.com/~r/NOWonPBS/~5/JdbptCodIto/NOW-544.mp3",
            "categories": [
                "Politics"
            ]
        },
        {
            "title": "Water World",
            "datePublished": "Fri, 23 Oct 2009 16:00:00 EST",
            "description": "Is climate change turning coastal countries into water worlds? NOW travels to Bangladesh to examine some innovative solutions being implemented in a country where entire communities are inundated by water, battered by cyclones, and flooded from their homes.<br/><br/>\r\n\r\nImagine you lived in a world of water. Your home is two-feet under. You wade through it, cook on it, and sleep above it. This is the reality for hundreds of thousands of people around the world, coastal populations on the front lines of climate change.<br/><br/>\r\n\r\nOnly weeks before world leaders meet in Copenhagen to discuss climate change, NOW senior correspondent Maria Hinojosa travels to Bangladesh to examine some innovative solutions -- from floating schools to rice that can \"hold its breath\" underwater -- being implemented in a country where entire communities are inundated by water, battered by cyclones, and flooded from their homes.<br/><br/>\r\n\r\nThe Denmark conference can't come soon enough. Scientists project global seas will flood 20 percent of Bangladesh by 2030, stranding some 35 million climate refugees. Some are proposing that industrial nations who contribute to global warming should open their doors to displaced Bangladeshis.<br/><br/>\r\n\r\nIs a coastal catastrophe approaching, and what should we be doing about it?<img src=\"http://feeds.feedburner.com/~r/NOWonPBS/~4/AAnbwDMJ7As\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "8169482",
            "sourceUrl": "http://feedproxy.google.com/~r/NOWonPBS/~5/G2doxozfEeE/NOW-543.mp3",
            "categories": [
                "Politics"
            ]
        },
        {
            "title": "Nurses Needed",
            "datePublished": "Fri, 16 Oct 2009 16:00:00 EST",
            "description": "By the year 2020, a nationwide shortage of up to 500,000 trained nurses could mean that hundreds of thousands of patients will receive less attention and substandard treatment. Just as alarming, fewer nurses are choosing to teach the next generation of professionals, resulting in tens of thousands of applicants being turned away from the nation's nursing schools. NOW on PBS takes a hard look at the strains this crisis is placing on the entire medical system, as well as innovative efforts to reverse the trend.<img src=\"http://feeds.feedburner.com/~r/NOWonPBS/~4/7eIHVkWoqU4\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "8169482",
            "sourceUrl": "http://feedproxy.google.com/~r/NOWonPBS/~5/qG1b2XlJV1s/NOW-442.mp3",
            "categories": [
                "Politics"
            ]
        },
        {
            "title": "Life Panel? Death Panel?",
            "datePublished": "Fri, 09 Oct 2009 11:00:00 EST",
            "description": "How did private discussions between seniors and their doctors about end of life choices for the very ill or dying become a flash point in the national health care debate? NOW travels to Wisconsin to sit in on some of these sessions and see how health care reform could profoundly affect the lives of American seniors.<br/><br/>\r\n\r\nThe not-for-profit Gundersen Lutheran Hospital has two decades of experience in this area. Their \"Respecting Choices\" initiative has become one of the most comprehensive end of life planning programs in the country. Two families grappling with the most difficult and complex life and death issues gave NOW on PBS extraordinary access to their discussions and their decisions.<img src=\"http://feeds.feedburner.com/~r/NOWonPBS/~4/XDI5LfynD64\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "8312842",
            "sourceUrl": "http://feedproxy.google.com/~r/NOWonPBS/~5/8BqY2Zwgl-M/NOW-541.mp3",
            "categories": [
                "Politics"
            ]
        },
        {
            "title": "Afghanistan: The Forgotten War",
            "datePublished": "Fri, 02 Oct 2009 11:00:00 EST",
            "description": "America thought it had won the war in Afghanistan six years ago, but a recent escalation in violence and instability -- including the death of nine U.S. soldiers this past weekend -- has given rise to the question: Have we allowed the Taliban to come back? NOW Correspondent Bill Gentile reports from Afghanistan's southern Helmand Province, where he was embedded for nearly three weeks in May and June with the 24th Marine Expeditionary Unit (24th MEU). The 24th MEU are among 60,000 foreign troops on the ground in Afghanistan -- more than half of them American. They face an ominous challenge as the Taliban attempts a return to power, in some cases merging with other insurgent groups, and potentially providing safe haven for Al-Qaeda and other anti-American terrorists. Reporting from the front lines, NOW provides a soldier's-eye look into what some consider America's \"forgotten war.\" Are we still winning it?<img src=\"http://feeds.feedburner.com/~r/NOWonPBS/~4/1t9ZtfOBewc\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "8312842",
            "sourceUrl": "http://feedproxy.google.com/~r/NOWonPBS/~5/iPOtt40xUZE/NOW-428.mp3",
            "categories": [
                "Politics"
            ]
        },
        {
            "title": "Surrogacy: Wombs for Rent?",
            "datePublished": "Fri, 18 Sep 2009 16:00:00 EST",
            "description": "Commercial surrogacy -- when women are paid to carry and deliver babies for people who cannot conceive them biologically -- is banned in almost every developed country in the world except the United States, making it a land of opportunity for parents around the world. In June, celebrity parents Matthew Broderick and Sarah Jessica Parker announced publicly they had twins delivered via surrogate. But surrogacy services and their oversight vary from state to state, creating a strong potential for deceit and fraud.<br/><br/>\r\n\r\nNOW's Senior Correspondent Maria Hinojosa follows the surrogate pregnancy of a single mother over the course of several months. When she was 14 weeks pregnant, the surrogate agency that brokered the deal between her and the future parents vanished, leaving the woman stranded without health insurance and nowhere to turn. NOW investigates how shady surrogacy services and a lack of regulation in the U.S. may be defrauding hopeful couples and victimizing mothers trying to help them.<img src=\"http://feeds.feedburner.com/~r/NOWonPBS/~4/VaFVW2xGjXM\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "8220682",
            "sourceUrl": "http://feedproxy.google.com/~r/NOWonPBS/~5/EU1jbfENOnc/NOW-538.mp3",
            "categories": [
                "Politics"
            ]
        },
        {
            "title": "After Guantanamo",
            "datePublished": "Fri, 04 Sep 2009 16:00:00 EST",
            "description": "Is Obama tossing out the Constitution with his new anti-terror plan? NOW investigates the controversial tactic of \"preventative detention,\" a government plan that may detain suspects indefinitely without trial or even formal charges.<br/><br/>\r\n\r\nClosing Guantanamo Bay's prison will do little to close the debate on what we should do with alleged terrorists. NOW, as part of a  collaboration with the nonprofit investigative unit ProPublica, investigates the controversial tactic of \"preventative detention,\" a government plan that may detain suspects indefinitely without trial or even formal charges. Implementing such a plan may have far-reaching consequences on not just our fight against terrorism, but the integrity of the U.S. Constitution and the cause of human rights.<br/><br/>\r\n\r\nEven with President Obama in office and Gitmo's days numbered, we're still asking: What price will we pay for peace on the ground and peace of mind?<img src=\"http://feeds.feedburner.com/~r/NOWonPBS/~4/NQserzKqNDE\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "8220682",
            "sourceUrl": "http://feedproxy.google.com/~r/NOWonPBS/~5/4dNOdfDSri4/NOW-536.mp3",
            "categories": [
                "Politics"
            ]
        },
        {
            "title": "Keep on Trucking?",
            "datePublished": "Fri, 28 Aug 2009 16:00:00 EST",
            "description": "The majority of American goods are transported by trucks, even though freight trains are greener and more fuel-efficient. Where should America be placing its bets for moving our economy and what would you personally sacrifice for it? Correspondent Miles O'Brien looks at the contemporary needs, challenges, and solutions for transporting vital cargo across America, and how those decisions affect the way you live, work, and travel.<img src=\"http://feeds.feedburner.com/~r/NOWonPBS/~4/oiq3V0FItW4\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "8220682",
            "sourceUrl": "http://feedproxy.google.com/~r/NOWonPBS/~5/wd35mFrj-KE/NOW-535.mp3",
            "categories": [
                "Politics"
            ]
        },
        {
            "title": "Justice Delayed",
            "datePublished": "Fri, 21 Aug 2009 16:00:00 EST",
            "description": "A terrible statistic: one in six women will be a victim of rape or attempted rape in her lifetime. But an even more shocking reality: A backlog in processing rape kits -- crucial evidence in arresting violent predators -- is delaying and sometimes denying justice for tens of thousands of American women. NOW travels to Los Angeles County to investigate why it has the largest known rape kit backlog in the country -- over 12,000 kits are sitting untested in police storage facilities. An internal audit found that more than 50 of these cases have exceeded the 10-year statute of limitations on rape.<br/><br/>\r\n\r\n\"The evidence that we're talking about represents human lives,\" Los Angeles Controller Laura Chick tells NOW. \"Those are lives stacked up on the shelves waiting for justice.\"<br/><br/>\r\n\r\nNOW talks with courageous rape survivors and law enforcement experts for insight and answers in this disturbing but important report. Are these women being victimized twice?<img src=\"http://feeds.feedburner.com/~r/NOWonPBS/~4/sw9BOclQ4Ac\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "0",
            "sourceUrl": "http://feedproxy.google.com/~r/NOWonPBS/~5/PA45fgpAMq8/NOW-517.mp3",
            "categories": [
                "Politics"
            ]
        },
        {
            "title": "Gambling With Health Care",
            "datePublished": "Fri, 14 Aug 2009 16:00:00 EST",
            "description": "Losing your job is a blow not just to your income, but also to your health insurance. Many can't afford high COBRA premiums, much less private insurance. And the sputtering economy is making a bad situation tragic. NOW travels to Nevada, where a huge budget deficit, spiking unemployment, and cuts in Medicaid and other public services are forcing people to gamble with their own lives. Recently, the only public hospital in Las Vegas had to shut its doors to cancer patients and pregnant women. Should the government be helping out?  NOW shares the human stories behind the distressing numbers, and investigates possible solutions and  responses with insight from Dr. Howard Dean, former Vermont governor and chairman of the Democratic National Committee.<img src=\"http://feeds.feedburner.com/~r/NOWonPBS/~4/sCDIZmKWOXI\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "8220682",
            "sourceUrl": "http://feedproxy.google.com/~r/NOWonPBS/~5/kFkHTA_3fPQ/NOW-512.mp3",
            "categories": [
                "Politics"
            ]
        },
        {
            "title": "Wall Street Reform and You",
            "datePublished": "Fri, 24 Jul 2009 16:00:00 EST",
            "description": "The Obama Administration recently released its proposal for financial regulatory reform, but before change comes to Wall Street, a reform plan has to get through Congress with its teeth intact. David Brancaccio sits with Zanny Minton Beddoes, economics editor for The Economist magazine, to review the proposal and its ramifications for America. Beddoes encourages streamlining the regulatory system, leaving fewer but more efficient overseers. But where powerful interests are at stake, nothing is a sure bet.<img src=\"http://feeds.feedburner.com/~r/NOWonPBS/~4/FLwTeQ7c1Mc\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "8220682",
            "sourceUrl": "http://feedproxy.google.com/~r/NOWonPBS/~5/SRMt0aRHkGw/NOW-530.mp3",
            "categories": [
                "Politics"
            ]
        },
        {
            "title": "Inside Israel's Army",
            "datePublished": "Fri, 17 Jul 2009 16:00:00 EST",
            "description": "As President Obama begins a new push for peace in the Middle East, NOW travels to Israel to see how a lifetime of war shapes the psyche of a nation where almost every able-bodied man and woman must serve in the military. NOW goes inside Israel's defense forces -- where few have gone before -- to speak with reservists about the impact of constant war on both their lives and their world view.<img src=\"http://feeds.feedburner.com/~r/NOWonPBS/~4/w55sfr3BSqc\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "8220682",
            "sourceUrl": "http://feedproxy.google.com/~r/NOWonPBS/~5/SucD_AOWkDQ/NOW-529.mp3",
            "categories": [
                "Politics"
            ]
        },
        {
            "title": "Peace and Prosperity in the West Bank?",
            "datePublished": "Fri, 10 Jul 2009 16:00:00 EST",
            "description": "Once one of the most dangerous and violent cities in the West Bank, Jenin was the scene of frequent battles between the Israeli military and Palestinian fighters, and was the hometown of more than two dozen suicide bombers. Today, however, there's been a huge turnaround. Jenin is now the center of an international effort to build a safe and economically prosperous Palestinian state from the ground up. On Jenin's streets today, there's a brand new professional security force loyal to the Palestinian authority and funded in part by the United States. But can the modest success in Jenin be replicated throughout the West Bank, or will the effort collapse under the intense political pressure from all sides?<br/><br/>\r\n\r\nNOW talks with former British Prime Minister Tony Blair, the international community's envoy to the region and an architect of the plan. We also speak with a former commander of the infamous Al-Aqsa Martyr's Brigade about his decision to stop using violent tactics, and to residents of Jenin about their daily struggles and their hopes for the future.<br/><br/><img src=\"http://feeds.feedburner.com/~r/NOWonPBS/~4/nggKWCoaz5o\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "8220682",
            "sourceUrl": "http://feedproxy.google.com/~r/NOWonPBS/~5/zwmUKVaWg_E/NOW-528.mp3",
            "categories": [
                "Politics"
            ]
        },
        {
            "title": "Obama's Border Fence & Ocean Tipping Point?",
            "datePublished": "Fri, 03 Jul 2009 16:00:00 EST",
            "description": "While the're putting the finishing touches on the controversial fence along the southern border between the U.S. and Mexico, the outrage is far from over.  The multi-billion dollar plan to build some 700 miles of fencing has been billed as the way to stem the flow of undocumented immigrants and provide security from potential terrorism. NOW senior correspondent Maria Hinojosa travels to Texas to meet border families who fear losing their property, their safety, and their way of life. Many question if the fence can keep people from sneaking in at all. An even greater worry may be the virtual fence the Obama administration is planning for the remaining 1,300 miles of border, at an estimated cost of nearly $7 billion. The problem? The new technology to complete the virtual fence has not been proven to work in the field.<br/><br/>\r\n\r\nAlso this week, global warming is front and center in Washington with the passage of the climate bill in the House. We look below the surface at a growing body of evidence that suggests climate change is affecting the chemistry of the seas, which could have potentially catastrophic results on the way we live. NOW travels deep into our oceans with a scientist from the Woods Hole Oceanographic Institution and help from other researchers for a first hand look at this stunning sea change, and what we can do about it.<img src=\"http://feeds.feedburner.com/~r/NOWonPBS/~4/qtDC4Xol89k\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "8220682",
            "sourceUrl": "http://feedproxy.google.com/~r/NOWonPBS/~5/1qit6W1IaO0/NOW-527.mp3",
            "categories": [
                "Politics"
            ]
        },
        {
            "title": "Homes for the Homeless?",
            "datePublished": "Fri, 26 Jun 2009 16:00:00 EST",
            "description": "American streets are littered with foreclosed houses, but one daring advocate says they shouldn't go to waste. He encourages and facilitates homeless \"squatting.\" It's an idea that addresses two issues at once -- homelessness and foreclosed homes -- and it's also completely illegal. NOW travels to Miami to meet with Max Rameau, a long-time advocate for the homeless. Rameau's organization, Take Back the Land, identifies empty homes that are still livable, and tries to find responsible families willing to take the enormous legal risks of moving in.<br/><br/>\r\n\r\nRameau, who considers his mission an act of civil disobedience, says it's immoral to keep homes vacant while there are human beings living on the street. But while these vocal squatters have morality in their hearts, they don't have the law on their side.<br/><br/>\r\n\r\nWith the faltering economy separating so many people from their homes, what's society's responsibility to those short on shelter?<img src=\"http://feeds.feedburner.com/~r/NOWonPBS/~4/_6LQj4bj7WA\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "8220682",
            "sourceUrl": "http://feedproxy.google.com/~r/NOWonPBS/~5/AgDe3XORud8/NOW-526.mp3",
            "categories": [
                "Politics"
            ]
        },
        {
            "title": "Are Some Anti-Abortion Attacks Domestic Terrorism?",
            "datePublished": "Fri, 12 Jun 2009 16:00:00 EST",
            "description": "Should violence against medical doctors who perform abortions be viewed and prosecuted as domestic terrorism? NOW sits down with two of the remaining handful of doctors who publicly acknowledge performing late abortions.<br/><br/>\r\n\r\nThe murder of Dr. George Tiller has reignited the abortion debate, and raised the question: should violence against medical doctors who perform abortions be viewed and prosecuted as domestic terrorism? NOW Senior Correspondent Maria Hinojosa sits down with two of the remaining handful of doctors who publicly acknowledge performing late abortions, including Leroy Carhart, a fellow doctor in Tiller's Wichita, Kansas clinic.<br/><br/>\r\n\r\nCarhart discusses his vow to carry on Tiller's mission and what it's like for him and his family to live as \"targets\". The show also investigates claims that law enforcement dropped the ball when it came to stopping Tiller's alleged murderer, Scott Roeder.<br/><br/>\r\n\r\nHinojosa travels to Colorado as well to talk with Dr. Warren Hern, another late abortion provider who says he's been living \"under siege\" for decades. Dr. Hern works behind four layers of bulletproof windows and is now under round-the-clock federal protection.<br/><br/>\r\n\r\nNOW goes into the eye of the abortion rights storm to see how Tiller's killing and its ramifications are impacting doctors, free speech, and a civilized society.<img src=\"http://feeds.feedburner.com/~r/NOWonPBS/~4/3ExwmpDGhnk\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "8220682",
            "sourceUrl": "http://feedproxy.google.com/~r/NOWonPBS/~5/iPRwu9Y0Zbw/NOW-524.mp3",
            "categories": [
                "Politics"
            ]
        },
        {
            "title": "Green Jobs: Hope or Hype?",
            "datePublished": "Fri, 29 May 2009 16:00:00 EST",
            "description": "What will jobs of the future look like? Many studying that question are seeing green -- green jobs. And with President Obama promising to create 5 million \"green-collar\" jobs over the next 10 years, some are predicting these new career paths in energy efficiency and clean power will transform the American economy. NOW on PBS talks with environmental activist Van Jones, founder of \"Green For All,\" a group dedicated to bringing green jobs to disadvantaged Americans. In March, Jones was appointed Special Advisor on Green Jobs at the President's Council for Environmental Quality. Now that he has the President's ear, will Jones be creating a new career frontier for America?<img src=\"http://feeds.feedburner.com/~r/NOWonPBS/~4/CNKy1fMaVZs\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "8220682",
            "sourceUrl": "http://feedproxy.google.com/~r/NOWonPBS/~5/Rpul33xS0o0/NOW-522.mp3",
            "categories": [
                "Politics"
            ]
        },
        {
            "title": "Rehab for Terrorists?",
            "datePublished": "Fri, 22 May 2009 16:00:00 EST",
            "description": "NOW on PBS partners with best-selling author and journalist Robert Lacey to investigate the surprising success of Saudi Arabia's approach to dealing with terrorists and extremists -- without torture or water-boarding. Given extraordinary access to the Saudi Arabian Interior Ministry and its practices, Lacey visits terrorist rehabilitation camps that use \"soft policing\" tactics to be nice to the bad guys. <br/><br/>\r\n\r\nIn the program we see the Saudis providing a private jumbo jet to bring inmates home from Guantanamo Bay, giving them a hero's welcome, then sending them to a converted holiday resort for re-education. Then, the men are set free.<br/><br/>\r\n\r\nIs this rehab program working, and can we trust the Saudis to protect themselves -- and us -- against Islamic extremism in the future? Watch this NOW on PBS report for a perspective on terrorism you've never seen before.<img src=\"http://feeds.feedburner.com/~r/NOWonPBS/~4/-QyRTBDS3ns\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "8220682",
            "sourceUrl": "http://feedproxy.google.com/~r/NOWonPBS/~5/606jsRNfckw/NOW-521.mp3",
            "categories": [
                "Politics"
            ]
        },
        {
            "title": "Can the U.N. Keep the Peace?",
            "datePublished": "Fri, 15 May 2009 16:00:00 EST",
            "description": "A record 115,000 U.N. peacekeepers are now deployed in 20 countries, and their mission is more vital than ever. But critics and insiders alike are openly worried that the current peacekeeping model is overstretched -- and at risk of failure. NOW travels to the Democratic Republic of the Congo to witness today's largest and most expensive peacekeeping operation. There, 17,000 U.N. troops are tasked with protecting millions of people over a rugged and dangerous territory the size of the Eastern United States. But the effort is struggling -- last November, local rebels massacred civilians less than a mile from one of the U.N. bases.<br/><br/><br/><br/>\r\n\r\nHow can U.N. peacekeeping be improved so that it fulfills its promise of protection to the world?<img src=\"http://feeds.feedburner.com/~r/NOWonPBS/~4/xZK2UMklz4Q\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "8220682",
            "sourceUrl": "http://feedproxy.google.com/~r/NOWonPBS/~5/bQxkB8-y5KI/NOW-520.mp3",
            "categories": [
                "Politics"
            ]
        },
        {
            "title": "Swine Flu Pandemic",
            "datePublished": "Fri, 08 May 2009 16:00:00 EST",
            "description": "How do we fight both the swine flu pandemic and our fear of it? NOW's David Brancaccio sits down with one of the most prominent figures in world health to find out. Dr. Larry Brilliant is an epidemiologist, former chief philanthropist at Google.org, and was a central figure in the World Health Organization's successful small pox eradication program. The two discuss how high tech tools are making it easier for scientists to detect global outbreaks, the critical importance of early detection and early response, and how the current pandemic has yet to show its real hand.<br/><br/>\r\n\r\n\"Anyone who tells you that they know that this is a mild pandemic, and the WHO has overreacted, they don't know. Anyone who tells you that the WHO and CDC have underestimated it, they don't know,\" Brilliant tells NOW. \"We're all going to find out at the same time... we're all in it together.\"<br/><br/><img src=\"http://feeds.feedburner.com/~r/NOWonPBS/~4/Ik18BWOMHsU\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "8220682",
            "sourceUrl": "http://feedproxy.google.com/~r/NOWonPBS/~5/K8bX5KlScck/NOW-519.mp3",
            "categories": [
                "Politics"
            ]
        },
        {
            "title": "A Radical Fix for Schools?",
            "datePublished": "Fri, 01 May 2009 16:00:00 EST",
            "description": "How is Secretary of Education Arne Duncan going to spend $100 billion in stimulus money -- almost twice the education budget -- to fix our nation's schools? During his seven years running Chicago's public schools, Duncan went head to head with the teacher's union and skeptical parents by closing down low-performing schools, getting rid of all the teachers, principals, even the janitors, and reopening them with new staffs as \"turnaround schools.\" It's a drastic step, but the results have been promising.<br/><br/>\r\n\r\nNOW travels to Chicago to investigate the collateral damage of a top-to-bottom school makeover, and to get a glimpse of what the future of education might look like for the rest of the country.<br/><br/>\r\n\r\n\"We have to be willing to experience a little bit of pain and discomfort, but our children desperately need it and deserve it,\" Secretary Duncan tells NOW. \"Just as we have to do it, unions have to change, principals have to change, teachers have to change, parents have to step up... business as usual is not going to get us there.\"<br/><br/>\r\n\r\nDo we need to gut our public schools in order to save them?<img src=\"http://feeds.feedburner.com/~r/NOWonPBS/~4/eyUWYzIvap0\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "8220682",
            "sourceUrl": "http://feedproxy.google.com/~r/NOWonPBS/~5/1q0VxPPej1Q/NOW-518.mp3",
            "categories": [
                "Politics"
            ]
        },
        {
            "title": "Can Coal be Earth-Friendly?",
            "datePublished": "Fri, 10 Apr 2009 16:00:00 EST",
            "description": "Americans are addicted to coal -- it powers half of all our electricity, and is both plentiful and cheap. In fact, some call America the \"Saudi Arabia of Coal.\" But are we paying too high an environmental price for all this cheap energy?<br/><br/>With carbon emissions caps high on the Obama Administration's agenda, coal is in the crosshairs of the energy debate. NOW Senior Correspondent Maria Hinojosa travels to Wyoming to take a hard look at the coal industry and its case that it can produce \"clean coal\" -- coal that can be burned without releasing carbon into the atmosphere. President Obama has been outspoken in his support for \"clean coal technology,\" but some say the whole concept is not much more than a public relations campaign.<br/><br/>As part of the report, Hinojosa talks with Wyoming Governor Dave Freudenthal and Jeff Goodell, the author of \"Big Coal,\" who says that carbon dioxide emissions generated from coal contribute to global warming.<br/><br/>Can America's cheapest and most plentiful energy resource be produced without burning the environment?<img src=\"http://feeds.feedburner.com/~r/NOWonPBS/~4/FU6VO72PUek\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "8220682",
            "sourceUrl": "http://feedproxy.google.com/~r/NOWonPBS/~5/lzBTs69mn90/NOW-515.mp3",
            "categories": [
                "Politics"
            ]
        },
        {
            "title": "Coming Home? and Paradise Lost, Revisited",
            "datePublished": "Fri, 04 Apr 2009 16:00:00 EST",
            "description": "Thousands of U.S. troops are getting discharged out of the army. Many suffer from post traumatic stress disorders and brain injuries, and aren't getting the care they need. The Army claims these discharged soldiers have pre-existing mental illnesses or are guilty of misconduct. But health advocates say these are wrongful discharges, a way for the army to get rid of \"problem\" soldiers quickly, without giving them the treatment to which they're entitled.<br/><br/>NOW covered this issue last summer, and this week we revisit the army's controversial position and follow up with affected soldiers we met. As a result of the media attention from our report and others, the Department of Defense revised its criteria for diagnosing pre-existing conditions and, now, fewer soldiers are receiving the diagnosis, making more of them eligible for care.<br/><br/>Also on the show, we update how the distant Pacific nation of Kiribati is dealing with the reality that both their land and culture could disappear from the Earth due to global warming. Kiribati President Anote Tong is now considering purchasing land abroad to save his people. He says his pleas for international support have largely fallen on deaf ears. Experts predict millions of people will become climate change refugees in the years to come.<img src=\"http://feeds.feedburner.com/~r/NOWonPBS/~4/ZosYkF9Ye70\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "8220682",
            "sourceUrl": "http://feedproxy.google.com/~r/NOWonPBS/~5/WGX-KwIWNMo/NOW-514.mp3",
            "categories": [
                "Politics"
            ]
        },
        {
            "title": "The People's Sheriff",
            "datePublished": "Fri, 27 Mar 2009 16:00:00 EST",
            "description": "One of the most controversial figures in the illegal immigration debate is Joe Arpaio, the longtime sheriff of Arizona's Maricopa County, whose aggressive hard line on local crime has received national attention. But has Sheriff Arpaio, who's made the most of federally-granted authority to enforce immigration laws, crossed the line when it comes to serving and protecting his community? Some critics have accused him of racial profiling. This week, NOW's colleagues at \"Expose\" and local reporters from the East Valley Tribune reveal what Sheriff Arpaio was -- and wasn't -- doing in the name of law enforcement. In a special bonus interview, NOW Senior Correspondent Maria Hinojosa sits down with Joe Arpaio for an intense discussion about the issues and criticism swirling around him.<img src=\"http://feeds.feedburner.com/~r/NOWonPBS/~4/3tlGncQHwuw\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "8220682",
            "sourceUrl": "http://feedproxy.google.com/~r/NOWonPBS/~5/z-UmZEqyMKA/NOW-513.mp3",
            "categories": [
                "Politics"
            ]
        },
        {
            "title": "Previewing the Superpower Summit",
            "datePublished": "Fri, 13 Mar 2009 16:00:00 EST",
            "description": "On March 13, financial ministers and central bankers of the world's economic superpowers will meet in London to lay the groundwork for next month's crucial meeting of their country's leaders, known as the G20. Will their work revolutionize the global economy and lift us out of this economic hole, or will politics get in the way? David Brancaccio interviews Kenneth Rogoff, Harvard economics professor and former chief economist of the International Monetary Fund, about how high we should raise our hopes and what's at stake for America and the world.<img src=\"http://feeds.feedburner.com/~r/NOWonPBS/~4/0z8HTX9LwDc\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "8220682",
            "sourceUrl": "http://feedproxy.google.com/~r/NOWonPBS/~5/iM3aY5oIWw8/NOW-511.mp3",
            "categories": [
                "Politics"
            ]
        },
        {
            "title": "Who Killed Sister Dorothy?",
            "datePublished": "Fri, 06 Mar 2009 16:00:00 EST",
            "description": "How could a struggle over land lead to the brutal murder of an American nun? David Brancaccio interviews award-winning filmmaker Daniel Junge on his latest film \"They Killed Sister Dorothy.\" The documentary focuses on Sister Dorothy Stang, a Catholic nun from Dayton, Ohio, who in 2005 was killed on a muddy road in the Brazilian Amazon she worked tirelessly to save. But it's also the story of peasant farmers hoping to preserve their way of life in the face of powerful industry interests. Who will dare stand up in the battle between the haves and the have nots, and will our world's ecosystem pay the biggest price? \"Peasant people... don't have a chance to share in the riches that the planet can offer because some people are taking off so much of the pleasures of this world, and there's only so much to go around,\" Sister Dorothy said before her death.<img src=\"http://feeds.feedburner.com/~r/NOWonPBS/~4/9FkpuUpJpn8\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "8220682",
            "sourceUrl": "http://feedproxy.google.com/~r/NOWonPBS/~5/13H5U-rllWU/NOW-510.mp3",
            "categories": [
                "Politics"
            ]
        },
        {
            "title": "Retirement at Risk?",
            "datePublished": "Fri, 27 Feb 2009 16:00:00 EST",
            "description": "In this struggling economy, boomers are rightfully worried about the funds they were counting on to carry them through the rest of their lives. Will they be able to afford their own retirement? NOW turns to two experts for help and insight: Amy Domini, a pioneer in the field of socially responsible investing; and journalist Dan Gross, who covers the economy for Slate and Newsweek.<img src=\"http://feeds.feedburner.com/~r/NOWonPBS/~4/b3yd4uyUMG8\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "8220682",
            "sourceUrl": "http://feedproxy.google.com/~r/NOWonPBS/~5/O1urTOayNlU/NOW-509.mp3",
            "categories": [
                "Politics"
            ]
        },
        {
            "title": "Is Your Daughter Safe at Work?",
            "datePublished": "Fri, 20 Feb 2009 16:00:00 EST",
            "description": "A shocking statistic -- teenagers are in more danger from sexual predators at their part time jobs than through the Internet. It's a vastly underreported phenomenon, but some brave young women are stepping up publicly to tell their stories. NOW collaborates with the Schuster Institute for Investigative Journalism at Brandeis University to bring you an unprecedented broadcast investigation of teen sexual harassment in the workplace. In the program, abused teenagers share their own stories with senior correspondent Maria Hinojosa. We track their legal journeys to justice, and how the issue impacts hundreds of thousands of teenagers across the country -- many of whom don't know how to report workplace abuse, or to even recognize when their bosses cross the line.<img src=\"http://feeds.feedburner.com/~r/NOWonPBS/~4/slDI_oUiR1E\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "8220682",
            "sourceUrl": "http://feedproxy.google.com/~r/NOWonPBS/~5/1pVxjpbFxKk/NOW-508.mp3",
            "categories": [
                "Politics"
            ]
        },
        {
            "title": "Stimulus Roadblock?",
            "datePublished": "Fri, 13 Feb 2009 16:00:00 EST",
            "description": "President Obama's stimulus money is nearly out the door and on its way to the states, but will it be spent in the way it is intended? One alarming example: Mass transit. Cities and states, strapped for money, are cutting back on mass transit even as it becomes more popular with Americans. Meanwhile, President Obama is calling for increased mass transit as a necessary step toward energy independence. Will the government's investment dramatically revitalize our national travel infrastructure, or will states spend the money according to 'business as usual'? NOW travels to North Carolina to see what the future holds for mass transit in these troubling financial times. Our investigation is part of a PBS-wide series on the country's infrastructure called \"Blueprint America.\"<img src=\"http://feeds.feedburner.com/~r/NOWonPBS/~4/TV6ANE1seuY\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "8220682",
            "sourceUrl": "http://feedproxy.google.com/~r/NOWonPBS/~5/keQ54KVheNQ/NOW-507.mp3",
            "categories": [
                "Politics"
            ]
        },
        {
            "title": "Help for the Homeowners?",
            "datePublished": "Fri, 06 Feb 2009 16:00:00 EST",
            "description": "Across the country, cities are in crisis because of the fallout from the mortgage mess--property taxes are way down, and abandoned homes are bringing down property values, inviting crime, and draining government coffers. Neighborhoods are being destroyed. Yet the federal bailout money is not going directly to desperate communities and homeowners, but to local and national banks. NOW investigates the innovative way some cities are fighting back. The city of Memphis, Tennessee is suing major national lenders and banks for deceptive and discriminatory lending practices in an effort to recoup the cost of the financial mess. Other cities using this legal tactic include Baltimore, Cleveland, Buffalo, Birmingham, and San Diego. With desperation climbing alongside debt, can the strategy help these blighted parts of America?<img src=\"http://feeds.feedburner.com/~r/NOWonPBS/~4/ORJrS3E_vG0\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "8220682",
            "sourceUrl": "http://feedproxy.google.com/~r/NOWonPBS/~5/H_VMH_kHuk4/NOW-506.mp3",
            "categories": [
                "Politics"
            ]
        },
        {
            "title": "Billions in Bogus Bonuses?",
            "datePublished": "Fri, 30 Jan 2009 16:00:00 EST",
            "description": "With this week's swearing-in of Treasury Secretary Tim Geithner, President Obama's economic team is finally ready to tackle the massive challenge before them. One big question: how much control will they wield over America's banks, the first recipients of the federal bailout? David Brancaccio sits down with financial reporter Bethany McLean -- who broke the Enron story -- to look at options on the table for stabilizing the country's financial system. If banks are nationalized, it will have an enormous impact on depositors, shareholders and taxpayers. Everyone agrees that our banks need federal money to avoid even more calamity, but how much is too much, and who's watching how they spend it?<img src=\"http://feeds.feedburner.com/~r/NOWonPBS/~4/hO7I-eRkhmI\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "8185866",
            "sourceUrl": "http://feedproxy.google.com/~r/NOWonPBS/~5/nzYSA6OjDag/NOW-505.mp3",
            "categories": [
                "Politics"
            ]
        },
        {
            "title": "Over Fifty, Overdrawn",
            "datePublished": "Fri, 23 Jan 2009 16:00:00 EST",
            "description": "The economic crisis is affecting people in all income and social brackets, but America's baby boomers and seniors don't have the option to wait it out. The housing meltdown, market crash, and rising costs of everything from food to medicine have taken the luster out of seniors' \"golden years\" or worse, put them into deep debt. Some are reluctantly exiting retirement to look for jobs, while others are falling prey to predatory lending companies. NOW travels to South Carolina, a state where many retirees and winter refugees are being forced to rewrite the last chapter in their lives, to see how they are coping and what options are left.<img src=\"http://feeds.feedburner.com/~r/NOWonPBS/~4/vJ-wA28Ulr8\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "8212490",
            "sourceUrl": "http://feedproxy.google.com/~r/NOWonPBS/~5/g5_AbBIYJcU/NOW-504.mp3",
            "categories": [
                "Politics"
            ]
        },
        {
            "title": "Power Struggle",
            "datePublished": "Fri, 16 Jan 2009 16:00:00 EST",
            "description": "As America looks to dramatically increase its use of renewable energy, an inconvenient reality stands in the way: the need to upgrade the country's antiquated electricity grid. Part of that overhaul involves the construction of gigantic and expensive long-distance transmission lines to carry clean energy from remote sites to population centers. NOW travels to California, which has the most ambitious clean energy plan in the nation. But the state's efforts face stiff opposition from property owners and conservationists who prefer renewable energy from \"local sources,\" such as photovoltaic rooftop solar panels. Complicating the matter are claims that the transmission lines are not actually carrying renewable energy at all, but represent a thinly-disguised strategy to stick to old energy practices.<img src=\"http://feeds.feedburner.com/~r/NOWonPBS/~4/xD_j2XxVOhM\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "0",
            "sourceUrl": "http://feedproxy.google.com/~r/NOWonPBS/~5/jlh1DRCDOIc/NOW-503.mp3",
            "categories": [
                "Politics"
            ]
        },
        {
            "title": "Sea Change",
            "datePublished": "Fri, 09 Jan 2009 16:00:00 EST",
            "description": "A rise in sea levels isn't the only impact global warming is having on the world's oceans. A growing body of evidence suggests that climate change is also affecting ocean currents and the chemistry of the seas, with potentially catastrophic results on the way we live. NOW travels deep into our oceans with scientists from the Woods Hole Oceanographic Institution and help from other researchers for a first hand look at this stunning sea change, and what we can do about it.<img src=\"http://feeds.feedburner.com/~r/NOWonPBS/~4/xDXUz2iRqDE\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "0",
            "sourceUrl": "http://feedproxy.google.com/~r/NOWonPBS/~5/pIbivj-KprI/NOW-502.mp3",
            "categories": [
                "Politics"
            ]
        },
        {
            "title": "Credit Crunch",
            "datePublished": "Fri, 02 Jan 2009 16:00:00 EST",
            "description": "With the economy in a downward spiral, more and more people are taking advantage of credit card offers to make ends meet, but are the credit card companies really taking advantage of their customers? NOW meets with families struggling to pay off the credit card debt they've accumulated -- a debt made even larger thanks to questionable industry practices like doubling and tripling interest rates without warning, increasing fees and penalties, and shrinking credit limits. We take a hard look at the small print in credit card offers, and at Congressional legislation aiming to regulate the industry. Are you getting the credit you deserve?<img src=\"http://feeds.feedburner.com/~r/NOWonPBS/~4/almGIMEFwFM\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "0",
            "sourceUrl": "http://feedproxy.google.com/~r/NOWonPBS/~5/Yl0vQGiU3Wk/NOW-501.mp3",
            "categories": [
                "Politics"
            ]
        },
        {
            "title": "Credit and Credibility",
            "datePublished": "Fri, 26 Dec 2008 16:00:00 EST",
            "description": "What role did the credit rating agencies play in the current economic crisis? A former managing director at Standard & Poor's speaks out on U.S. television for the first time about how he was pressured to compromise standards in a push for profits. Frank Raiter reveals what was really going on behind closed doors at the credit rating agencies the public relies on to evaluate the safety of their investments. \"During this period, profit was primary; analytics were secondary,\" Raiter tells NOW Senior Correspondent Maria Hinojosa. Who was watching the watchers? Surprising new revelations in the economic debacle.<img src=\"http://feeds.feedburner.com/~r/NOWonPBS/~4/WkaoGmtk5Bo\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "8237066",
            "sourceUrl": "http://feedproxy.google.com/~r/NOWonPBS/~5/9a9xeMdeiYk/NOW-446.mp3",
            "categories": [
                "Politics"
            ]
        },
        {
            "title": "Daughters for Sale",
            "datePublished": "Fri, 19 Dec 2008 18:00:00 EST",
            "description": "Unable to make ends meet, many families in western Nepal have been forced to sell their daughters, some as young as six, to work far from home as bonded servants in private homes. With living conditions entirely at the discretion of their employers, these girls seldom attend school and are sometimes forced into prostitution. NOW travels to Nepal during the Maghe Sankranti holiday, when labor contractors come to the villages of the area to \"buy\" the children. There, we meet the Nepalese Youth Opportunity Foundation, which is trying to break the cycle of poverty and pain with an Enterprising Idea. They're providing desperate families with an incentive to keep their daughters: a piglet or a goat that can ultimately be sold for a sum equivalent to that of their child's labor. The organization says it has brought thousands of girls home to live with their families, but many cultural and political challenges still stand in their way.<img src=\"http://feeds.feedburner.com/~r/NOWonPBS/~4/a_pGjImCRF4\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "11667466",
            "sourceUrl": "http://feedproxy.google.com/~r/NOWonPBS/~5/And_rC9mVx0/NOW-414.mp3",
            "categories": [
                "Politics"
            ]
        },
        {
            "title": "Paradise Lost",
            "datePublished": "Fri, 12 Dec 2008 16:00:00 EST",
            "description": "Just this week, a top UN official predicted that by the middle of this century, the world should expect six million people a year to be displaced by increasingly severe storms and floods caused by climate change. But for many island nations in the South Pacific, climate change is already more than just a theory -- it is a pressing, menacing reality. These small, low-lying islands are frighteningly vulnerable to rising temperatures and sea levels that could cause flooding and contaminate their fresh water wells. Within 50 years, some of them could be under water. NOW travels to the nation of Kiribati to see up close how these changes affect residents' daily lives and how they are dealing with the reality that both their land and culture could disappear from the Earth. We also travel to New Zealand to visit an I-Kiribati community that has already left its home, and to the Pacific Island Forum in Niue to see how the rest of the region is coping with the here-and-now crisis of climate change.<img src=\"http://feeds.feedburner.com/~r/NOWonPBS/~4/A6afQSwaFhA\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "0",
            "sourceUrl": "http://feedproxy.google.com/~r/NOWonPBS/~5/uYzjsCsviW8/NOW-449.mp3",
            "categories": [
                "Politics"
            ]
        },
        {
            "title": "Our Pakistan Problem & The Right Approach to Iran?",
            "datePublished": "Fri, 5 Dec 2008 16:00:00 EST",
            "description": "Iran and Pakistan are likely to be the sites of foreign policy flashpoints under the Obama Administration, but do we understand each country well enough to take the best approach? David Brancaccio sits down with author and journalist Tariq Ali, who grew up in Pakistan; and Tehran-born author Hooman Majd for unique insight into our thorny diplomatic, cultural, and political relations with each country. Obama will undoubtedly be put to the test, but how should he respond?<img src=\"http://feeds.feedburner.com/~r/NOWonPBS/~4/t88fT5DjYlA\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "0",
            "sourceUrl": "http://feedproxy.google.com/~r/NOWonPBS/~5/XZETQcHiqmo/NOW-448.mp3",
            "categories": [
                "Politics"
            ]
        },
        {
            "title": "Obama's Challenge",
            "datePublished": "Wed, 26 Nov 2008 16:00:00 EST",
            "description": "Robert Kuttner, author of the new book \"Obama's Challenge,\" talks to NOW on PBS about the enormous obstacles to -- and potential solutions for -- getting America's economy back on track. As President-elect Barack Obama unveils his top economic team, Kuttner offers his advice on how America's next leader should stimulate a recovery, including a $600 billion government spending package. \"We need the government big time to prevent this from becoming the Great Depression II,\" Kuttner tells NOW's David Brancaccio.<img src=\"http://feeds.feedburner.com/~r/NOWonPBS/~4/SkzvTSKF6-Q\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "7217162",
            "sourceUrl": "http://feedproxy.google.com/~r/NOWonPBS/~5/srywYuyGQiE/NOW-447.mp3",
            "categories": [
                "Politics"
            ]
        },
        {
            "title": "Credit and Credibility",
            "datePublished": "Fri, 21 Nov 2008 16:00:00 EST",
            "description": "What role did the credit rating agencies play in the current economic crisis? A former managing director at Standard & Poor's speaks out on U.S. television for the first time about how he was pressured to compromise standards in a push for profits. Frank Raiter reveals what was really going on behind closed doors at the credit rating agencies the public relies on to evaluate the safety of their investments. \"During this period, profit was primary; analytics were secondary,\" Raiter tells NOW Senior Correspondent Maria Hinojosa. Who was watching the watchers? Surprising new revelations in the economic debacle.<img src=\"http://feeds.feedburner.com/~r/NOWonPBS/~4/WkaoGmtk5Bo\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "8587274",
            "sourceUrl": "http://feedproxy.google.com/~r/NOWonPBS/~5/9a9xeMdeiYk/NOW-446.mp3",
            "categories": [
                "Politics"
            ]
        },
        {
            "title": "Green Collar Jobs",
            "datePublished": "Fri, 14 Nov 2008 16:00:00 EST",
            "description": "Can something as common as building materials represent an opportunity to create jobs, help the needy, and save the planet? NOW looks at two \"green\" projects keeping furniture, paint, cabinets, and other building supplies out of landfills and getting them into the hands of those who need them most. Will they be devastated by the economic meltdown, or do they signal a possible way out? Based in the Bronx, New York, Greenworker Co-operatives aims to set up worker-owned green businesses. The first of these is Rebuilders' Source, a store that sells recycled and donated building materials at affordable prices -- items that would otherwise have ended up in a landfill. \"My vision now is a completely green South Bronx,\" says Bronx-born entrepreneur Omar Freilla, the founder of Greenworker Co-operatives, \"with businesses throughout the area that are owned and run by people living in the area together.\" On the other side of the country, in Southern California, Materials Matter matches donations of furniture and high quality building materials with individuals, organizations, and homeless shelters that use the materials to literally rebuild lives. But the faltering economy has had an impact. \"We have to decide whether the value of that donation will be worth the cost of transportation,\" says Materials Matter co-founder Alison Riback on her blog. \"[The economic downturn] put a huge dent in our 'always say yes to a donation' philosophy.\"<img src=\"http://feeds.feedburner.com/~r/NOWonPBS/~4/m-TpTF-5qps\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "8024074",
            "sourceUrl": "http://feedproxy.google.com/~r/NOWonPBS/~5/xNv80dYHUAE/NOW-445.mp3",
            "categories": [
                "Politics"
            ]
        },
        {
            "title": "How Will He Lead?",
            "datePublished": "Fri, 07 Nov 2008 16:00:00 EST",
            "description": "With the campaign and the election finally behind him, Barack Obama is now focusing on governing, but in which direction will he take the country? Charles Ogletree is in a unique position to know. The Harvard professor was an adviser to the university's Black Law Students Association when Obama was a member, and Ogletree has been a trusted advisor to the president-elect ever since. David Brancaccio sits down with Ogletree, who some say is being considered for a top Justice Department position, to get early insight on what we might expect from an Obama Administration.<img src=\"http://feeds.feedburner.com/~r/NOWonPBS/~4/n0LJG6PIx-Q\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "8241162",
            "sourceUrl": "http://feedproxy.google.com/~r/NOWonPBS/~5/7HjXTvaGyaw/NOW-444.mp3",
            "categories": [
                "Politics"
            ]
        },
        {
            "title": "What Women Voters Want",
            "datePublished": "Fri, 31 Oct 2008 16:00:00 EST",
            "description": "There are roughly eight million more female voters than male, and more women than men say they are still undecided. Senator Hillary Clinton and Governor Sarah Palin have undoubtedly changed the debate for many women voters, but the question is: how will they ultimately respond in the booth? This week, NOW on PBS travels to the swing state of Colorado to get insight from a diverse group of women. These pro-choice, pro-gun women don't fit into neat categories, but they do respond to issues built around working moms: pay equity, family leave, and child care. On the show, NOW also interviews former vice presidential Candidate Geraldine Ferraro for her take on the role of women in this election. Will the women's vote decide the election?<img src=\"http://feeds.feedburner.com/~r/NOWonPBS/~4/JqPtsHPMfmQ\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "8169482",
            "sourceUrl": "http://feedproxy.google.com/~r/NOWonPBS/~5/p--c-G528i0/NOW-443.mp3",
            "categories": [
                "Politics"
            ]
        },
        {
            "title": "Virginia's Vote & A Better Bailout?",
            "datePublished": "Fri, 17 Oct 2008 16:00:00 EST",
            "description": "The state of Virginia has not voted for a Democratic President since 1964, but this year its 13 electoral votes are up for grabs as late polls show the race too close to call. NOW on PBS goes behind the national polls and punditry and into living rooms of real Virginia voters to learn how they'll be making their decisions. Military families, retirees, and blue-collar workers of all political stripes share their concerns about faith, the war, and making ends meet in troubling economic times. \r\n\r\nAlso on the show, an update on the economic crisis. As the government expands its protective reach into the private sector, now including banks, how will this ease the financial burden on private citizens? NOW checks in with the AFL-CIO's Damon Silvers, who has been closely involved in Congressional negotiations for the financial rescue plan, for answers and insight.<img src=\"http://feeds.feedburner.com/~r/NOWonPBS/~4/fp3_BdioyeM\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "8105994",
            "sourceUrl": "http://feedproxy.google.com/~r/NOWonPBS/~5/n2QR0ahLg0g/NOW-441.mp3",
            "categories": [
                "Politics"
            ]
        },
        {
            "title": "Driven to Despair",
            "datePublished": "Fri, 10 Oct 2008 16:00:00 EST",
            "description": "With gas prices spiking and home values crumbling, the American dream of commuting to work from the fringes of suburbia has become an American nightmare. Many are facing a hard choice: Paying for gas or paying the mortgage. How did it come to this? It's not just about America's financial crisis; it's also about big problems with our national infrastructure. Overstressed highways and too few public transportation options are wreaking havoc on people's lives and hitting the brakes on our already-stretched economy. NOW on PBS takes a close-up look at our inadequate transportation network and visits some people paying a high price -- in both dollars and quality of life -- just to get to work. Do we have the means to modernize both our infrastructure and our lifestyles? \r\n\r\nThis is the first installment in \"Blueprint America,\" a year-long, PBS-wide series focusing on the nation's infrastructure. \"Blueprint America\" is an initiative of Thirteen/WNET.<img src=\"http://feeds.feedburner.com/~r/NOWonPBS/~4/Ycfnatz-Sws\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "8105994",
            "sourceUrl": "http://feedproxy.google.com/~r/NOWonPBS/~5/_DVAh4UlNV4/NOW-440.mp3",
            "categories": [
                "Politics"
            ]
        },
        {
            "title": "New Voters in the New West",
            "datePublished": "Fri, 03 Oct 2008 16:00:00 EST",
            "description": "This election year, the most crucial battleground states may fall far west of the Mississippi. Strategists say New Mexico, Nevada, and Colorado are pivotal to Senator McCain's success, so how are these voters being courted? NOW on PBS travels to New Mexico to see how both campaigns are hoping to attract -- and secure -- first time voters on college campuses, as well as voters in New Mexico's large Hispanic population. It's clearly anyone's game -- this southwestern state was won by fewer than 400 votes in 2000, and 6,000 votes in 2004. \r\n\r\nNOW sits down with New Mexico Governor Bill Richardson, a supporter of Barack Obama and former 2008 presidential contender himself, who affirms the political importance of the \"New West.\" \"Had Kerry won those states [in 2004],\" Richardson tells Maria Hinojosa, \"even having lost Ohio, he'd be President.\" Will the New West play a key role in determining the fate of the country?<img src=\"http://feeds.feedburner.com/~r/NOWonPBS/~4/dCENzgEYY1E\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "8069130",
            "sourceUrl": "http://feedproxy.google.com/~r/NOWonPBS/~5/puPW7kvzR_o/NOW-439.mp3",
            "categories": [
                "Politics"
            ]
        },
        {
            "title": "Behind the Bailout",
            "datePublished": "Fri, 26 Sep 2008 16:00:00 EST",
            "description": "The government's historic proposal to bail out the U.S. banking system is raising as many questions as it is offering solutions. Some in Congress are warning against reacting too quickly; others want conditions that protect homeowners, increase oversight, and limit the compensation of corporate executives. But the number one question on the minds of Americans: How will this affect me? NOW on PBS goes inside the round-the-clock efforts in Washington to craft a bailout plan of historic dimensions. \r\n\r\nNOW's cameras follow AFL-CIO Associate General Counsel Damon Silvers as he works to get help for working Americans in addition to bailing out financial firms in distress. Silvers, an architect of the major provisions Congressional Democrats are pushing for in the bill, provides key insight on the stake ordinary working Americans have in the fate of this proposal, and on what comes next.<img src=\"http://feeds.feedburner.com/~r/NOWonPBS/~4/ivIYdG-Ijxc\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "8288266",
            "sourceUrl": "http://feedproxy.google.com/~r/NOWonPBS/~5/zXp2KkKuyTk/NOW-438.mp3",
            "categories": [
                "Politics"
            ]
        },
        {
            "title": "Women, Power and Politics",
            "datePublished": "Fri, 19 Sep 2008 16:00:00 EST",
            "description": "Given the hoopla surrounding Sarah Palin and Hillary Clinton's historical political ascendance, why does the U.S. rank so low among countries for percentage of women holding national office? In a one-hour special, NOW's Maria Hinojosa talks to women leaders around the world and here in the United States for an intimate look at the high-stakes risks, triumphs, and setbacks for women leaders of today and tomorrow.\r\n\r\nAmong these women are President Michelle Bachelet of Chile, the first woman leader in Latin America who did not have a husband precede her as President, and former New Hampshire Governor Jeanne Shaheen, now in a tight race for a seat in the U.S. Senate.\r\n\r\nWe also travel to Rwanda, where, 14 years after a horrific massacre left nearly one million people dead, women make up nearly half of parliament; and to Manhattan, where ambitious high school girls are competing in a high-stakes debate tournament.\r\n\r\n\"Women, Power and Politics,\" is also about the personal journey of mother and award-winning journalist Maria Hinojosa as she strives to answer the question: \"What does to mean to be a woman in power?\"<img src=\"http://feeds.feedburner.com/~r/NOWonPBS/~4/4_NrYdZIj9M\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "7845898",
            "sourceUrl": "http://feedproxy.google.com/~r/NOWonPBS/~5/EsERGQxYoE0/NOW-437.mp3",
            "categories": [
                "Politics"
            ]
        },
        {
            "title": "Obama in Danger? & Is the Evangelical Vote in Play?",
            "datePublished": "Fri, 12 Sep 2008 16:00:00 EST",
            "description": "The Republican Party has long used wedge issues like abortion, gun control, and gay rights to its advantage in rallying conservative voters, but a shifting agenda amongst political evangelicals and new thinking about Democratic Party tactics might be changing the game. David Brancaccio discusses these issues and their implications with Bishop Harry Jackson and Author Drew Westen. Bishop Jackson, an influential voice among the nation's 100 million evangelicals, has shown a willingness to open his mind to opposing views, especially on climate control. Westen, author of \"The Political Brain,\" talks about how appealing to voters' emotions reaps bigger electoral rewards than hammering home policy proposals.<img src=\"http://feeds.feedburner.com/~r/NOWonPBS/~4/n5H97s3Sc_8\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "7845898",
            "sourceUrl": "http://feedproxy.google.com/~r/NOWonPBS/~5/6v-sc43W8Xo/NOW-436.mp3",
            "categories": [
                "Politics"
            ]
        },
        {
            "title": "2008: A Republican Reinvention?",
            "datePublished": "Fri, 05 Sep 2008 16:00:00 EST",
            "description": "John McCain chose Sarah Palin as his running mate in part to appease his party's strongly conservative base. With the Republican right wing weighing so much influence even in the waning days of the Bush presidency, where does that leave prominent moderate Republicans? Is there room for them in the GOP? David Brancaccio sits down with former New Jersey Governor and EPA Administrator Christine Todd Whitman to discuss the political tolerance of the modern Republican Party, and her perspective on the current race.<img src=\"http://feeds.feedburner.com/~r/NOWonPBS/~4/fXAAx2vJbV8\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "8495114",
            "sourceUrl": "http://feedproxy.google.com/~r/NOWonPBS/~5/XEyRXmf3f4Q/NOW-435.mp3",
            "categories": [
                "Politics"
            ]
        },
        {
            "title": "Attacking Affirmative Action",
            "datePublished": "Fri, 29 Aug 2008 11:00:00 EST",
            "description": "With Barack Obama officially nominated as the Democrats' Presidential nominee, is it time to re-think affirmative action? NOW on PBS looks at some state ballot measures that would eliminate race or gender considerations in public hiring, contracting and education programs. The controversial initiatives are being spearheaded by Ward Connerly, a long-time affirmative action opponent who some are accusing of ballot fraud. NOW also posed the question to leading thinkers at the Democratic National Convention in Denver. \"I think that in some quarters, many parts of the country, a white male is really disadvantaged,\" Connerly, who considers himself multi-racial, tells NOW. \"Because we have developed this notion of women and minorities being so disadvantaged and we have to help them, that we have, in many cases, twisted the thing so that it's no longer a case of equal opportunity. It's a case of putting a fist on the scale.\"<img src=\"http://feeds.feedburner.com/~r/NOWonPBS/~4/x9622k-12-c\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "8495114",
            "sourceUrl": "http://feedproxy.google.com/~r/NOWonPBS/~5/lCHPpCnQ4yQ/NOW-434.mp3",
            "categories": [
                "Politics"
            ]
        },
        {
            "title": "Health Care Solutions",
            "datePublished": "Fri, 22 Aug 2008 11:00:00 EST",
            "description": "Can the quality of healthcare in developing nations be transformed by the same principle that makes fast food such a success here? NOW travels to Kenya to continue ongoing coverage of an enterprising idea: franchising not burger and donut shops, but health services and drugs in rural Africa. American businessmen have been teaming with African entrepreneurs to spread for-profit clinics around the country in the hopes of providing quality, affordable medical care to even Kenya's poorest people. In this show, NOW chronicles how the Kenyan facilities weathered recent violent unrest, as well as the program's expansion into Rwanda. Also on the show, a massive program to dispense medicine for people with HIV/AIDS in poor countries is changing lives and restoring hope. A small team of photographers is capturing those amazing transformations on film, hoping their compelling images will bring attention to the importance of drug access in the developing world.<img src=\"http://feeds.feedburner.com/~r/NOWonPBS/~4/UuwagvMa-IY\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "8347658",
            "sourceUrl": "http://feedproxy.google.com/~r/NOWonPBS/~5/mmRBwyCcZts/NOW-433.mp3",
            "categories": [
                "Politics"
            ]
        },
        {
            "title": "The Border Fence",
            "datePublished": "Fri, 15 Aug 2008 11:00:00 EST",
            "description": "In 2006, Congress authorized the Secure Fence Act, a multi-billion dollar plan to build hundreds of miles of fencing along the southern border of the United States to stem the flow of undocumented immigrants and provide security from potential terrorism. But what was built to fight illegal immigration has turned into a nightmare for many Americans living along the U.S.-Mexico border. Turns out the fence -- which will cover less than half of the actual border -- inexplicably cuts through the middle of some properties, while leaving others untouched. Many question if it can keep people from sneaking in at all. NOW senior correspondent Maria Hinojosa travels to Texas to meet border families who fear losing their property, their safety, and their way of life. We also follow an investigative reporter who questions whether certain landowners are getting preferential treatment.<img src=\"http://feeds.feedburner.com/~r/NOWonPBS/~4/2oR7GTCd0Ek\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "8357898",
            "sourceUrl": "http://feedproxy.google.com/~r/NOWonPBS/~5/Vd8OmtrgUMg/NOW-432.mp3",
            "categories": [
                "Politics"
            ]
        },
        {
            "title": "Dinner With the President",
            "datePublished": "Fri, 08 Aug 2008 11:00:00 EST",
            "description": "When Pakistani filmmaker Sabiha Sumar chose to make a film about democracy in her country, she didn't just request a traditional interview with President Musharraf: she insisted on a formal dinner. To her surprise, the man who ran Pakistan for nearly eight years agreed, and Sumar spent the evening grilling Musharraf about the state of affairs in their sharply polarized culture. Sumar's documentary \"My Dinner with the President,\" intercuts the dinner discourse with candid interviews with a wide range Pakistanis, from religious fundamentalists to partiers on a Pakistani beach. On Friday, August 8 at 8:30 pm (check local listings), NOW's David Brancaccio talks with Sumar about the film, about our cultural and political relationship with Pakistan, and about Musharraf's desire to democratize his nation while functioning as its dictator.<img src=\"http://feeds.feedburner.com/~r/NOWonPBS/~4/XUh77Gt54dA\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "8757258",
            "sourceUrl": "http://feedproxy.google.com/~r/NOWonPBS/~5/xGaLBagzems/NOW-431.mp3",
            "categories": [
                "Politics"
            ]
        },
        {
            "title": "Alaska: The Senator and the Oil Man",
            "datePublished": "Fri, 01 Aug 2008 16:00:00 EST",
            "description": "On Tuesday, Alaska Senator Ted Stevens was indicted for failing to disclose gifts he received from VECO Corporation, an Alaska-based oil services company. But his indictment is only the latest news -- and perhaps the tip of the iceberg -- in an ongoing political scandal that's rocking the state. NOW goes behind the breaking headlines to shine a bright light on the scandalous connection between VECO and Alaska's old-boy political network. Three state legislators have already been convicted in Federal court for accepting bribes from VECO, and the FBI has video and audio evidence that reveal VECO executives shockingly handing out cash to those legislators in exchange for promises to roll back a tax on the oil industry. And more lawmakers -- including Senator Stevens' own son, former Alaska State Senate President Ben Stevens -- are being eyed in the growing scandal.<img src=\"http://feeds.feedburner.com/~r/NOWonPBS/~4/Q4ipNcI5DfA\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "8714250",
            "sourceUrl": "http://feedproxy.google.com/~r/NOWonPBS/~5/opfncz7WKCc/NOW-430.mp3",
            "categories": [
                "Politics"
            ]
        },
        {
            "title": "John Edwards' War on Poverty",
            "datePublished": "Fri, 25 July 2008 11:00:00 EST",
            "description": "Even though he's no longer running for president, John Edwards is still a man with a mission: to cut poverty in the United States by 50 percent in 10 years. The current economic crisis has him and his followers more committed than ever, but will their efforts gain enough momentum to make a difference? NOW's David Brancaccio talks with Edwards about how he plans to achieve this ambitious goal and what role it may and should have on the upcoming presidential election. Will the issue of poverty in America finally be addressed with more than just lip service?<img src=\"http://feeds.feedburner.com/~r/NOWonPBS/~4/vRE8ClUP5gg\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "8747018",
            "sourceUrl": "http://feedproxy.google.com/~r/NOWonPBS/~5/OoGVur-5Bzk/NOW-429.mp3",
            "categories": [
                "Politics"
            ]
        },
        {
            "title": "Jobs for Jordan",
            "datePublished": "Fri, 11 July 2008 11:00:00 EST",
            "description": "NOW travels to Jordan to explore the implications of -- and possible solutions to -- having millions of young people out of work in the Middle East. Staggering unemployment rates among the region's massive youth population is fueling anger, frustration and resentment. To combat the problem, Jordan's Queen Rania has made job creation a top priority. \"To me the Middle East is about young people. And if we fail to create opportunities for them then you're going to see a lot of frustrated hope,\" she tells NOW. Another initiative comes from an unlikely source: a Brooklyn, New York businessman who has set up programs across the region to give young people the real world skills they desperately need to gain employment. Both have their work cut out for them: nearly 70 million jobs are needed in the Middle East by the year 2020, according to the World Bank. Can these training programs help stem the tide or are they just a drop in the bucket?<img src=\"http://feeds.feedburner.com/~r/NOWonPBS/~4/Q_dSlEcgavE\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "8210442",
            "sourceUrl": "http://feedproxy.google.com/~r/NOWonPBS/~5/Hw-sKUoPuqA/NOW-427.mp3",
            "categories": [
                "Politics"
            ]
        },
        {
            "title": "Subprime Solution?",
            "datePublished": "Fri, 27 June 2008 11:00:00 EST",
            "description": "After the subprime mortgage debacle, have we learned that quick-turnaround mortgages to customers with low credit scores are always too good to be true? One enterprising entrepreneur says NO, and he has some success to back it up. NOW on PBS takes a look at the non profit organization \"Just Price Solutions\" and the man behind it, Brian Cosgrove. Cosgrove created a new mortgage model that, in his view, marries the speed and efficiency of the subprime model to safe lending practices including homeownership counseling and fixed rate mortgages. Cosgrove says the new system helps prevent foreclosures and safely protects individuals from predatory subprime lenders, but not everyone agrees. Some feel home ownership is oversold in America and that this mortgage enterprise is still risky business. Can Just Price Solutions place and keep people in affordable homes, or is this another cautionary tale in the making?<img src=\"http://feeds.feedburner.com/~r/NOWonPBS/~4/ytxYnV2x7LE\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "8286218",
            "sourceUrl": "http://feedproxy.google.com/~r/NOWonPBS/~5/Jf6E5jEiIK8/NOW-426.mp3",
            "categories": [
                "Politics"
            ]
        },
        {
            "title": "India Rising",
            "datePublished": "Fri, 20 June 2008 11:00:00 EST",
            "description": "The global middle class is expected to swell by more than 1 billion people over the next decade, with the biggest increases in China and India. While millions are being lifted out of poverty as a result, the booming middle class is also consuming more global resources. As a result, prices for everything from steel to gasoline to food are soaring. NOW reports from Pune, India, where college graduates are getting tech jobs, traditional families are flocking to the new mall, and professionals are hoping their new-found economic might will make their country an even bigger global player. But can America's middle-class -- and the rest of the world -- afford this unprecedented shift in the global economy? The world is buying like never before, but who's paying the price?<img src=\"http://feeds.feedburner.com/~r/NOWonPBS/~4/IfNF3E-mPjI\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "8286218",
            "sourceUrl": "http://feedproxy.google.com/~r/NOWonPBS/~5/I2dvGn3zDRE/NOW-425.mp3",
            "categories": [
                "Politics"
            ]
        },
        {
            "title": "Fighting the Army",
            "datePublished": "Fri, 13 June 2008 18:00:00 EST",
            "description": "Thousands of U.S. troops are getting discharged out of the Army. Many suffer from post traumatic stress disorders and brain injuries and aren't getting the care they need. The Army claims these discharged soldiers have pre-existing mental illnesses or are guilty of misconduct. But advocates say these are wrongful discharges, a way for the army to get rid of \"problem\" soldiers quickly, without giving them the treatment to which they're entitled. NOW travels to Texas' Fort Hood to meet traumatized soldiers fighting a new battle, this one with the army they served. NOW also interviews the army's top psychiatrist, Col. Elspeth Ritchie.<img src=\"http://feeds.feedburner.com/~r/NOWonPBS/~4/VBYygXndNzg\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "8769546",
            "sourceUrl": "http://feedproxy.google.com/~r/NOWonPBS/~5/BZY0WmYv9aU/NOW-424.mp3",
            "categories": [
                "Politics"
            ]
        },
        {
            "title": "Dialogue with Dictators?",
            "datePublished": "Fri, 6 June 2008 18:00:00 EST",
            "description": "NOW talks with the former head of U.S. Central Command, Admiral William J. Fallon, who resigned in March after a year of duty. Fallon had sharp disagreements with the Bush Administration's Middle East policy toward Iranian President Ahmadinejad. The former commander of all U.S. military forces in the Middle East and Central Asia, Fallon was portrayed in Esquire magazine as the man in the military preventing the administration from going to war with Iran. Also, we talk with political columnist and \"The Uprising\" author David Sirota about the populist movement spreading through the country. Can organizations that operate at the grassroots level create real political change?<img src=\"http://feeds.feedburner.com/~r/NOWonPBS/~4/Q1e6SRa7CTQ\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "7770122",
            "sourceUrl": "http://feedproxy.google.com/~r/NOWonPBS/~5/SQtUfRm6bXI/NOW-423.mp3",
            "categories": [
                "Politics"
            ]
        }
    ]
}