{
    "artwork": "http://is1.mzstatic.com/image/thumb/Music71/v4/c2/f8/8e/c2f88eac-d523-1d4b-3616-1c9e007f70a1/source/100x100bb.jpg",
    "description": "Every week, Jeffery Saddoris and Bill Wadman take on the art, science, and philosophy of photography and explore how they play out behind the camera in the process of making images. Insider insights for the novice, shop talk for the professional, and opinionated discussion for the interested observer of the field's trends and legacy. Hosted by Bill Wadman & Jeffery Saddoris.",
    "feedURL": "http://feeds.5by5.tv/otp",
    "podcastURL": "http://5by5.tv/otp",
    "publisher": "Bill Wadman & Jeffery Saddoris",
    "title": "On Taking Pictures",
    "episodes": [
        {
            "title": "326: Special Episode - Apple Announcement Oct 2018",
            "datePublished": "Tue, 30 Oct 2018 16:00:00 GMT",
            "description": "They said it would never happen – that we were through, done for, washed up. Turns out,  all it took was a new Mac Mini, Macbook Air, and an iPad Pro for us to dust off the mics and smash that record button. Is it a one off? Will there be more? Time will tell...\n",
            "length": "27004913",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2018/otp-326.mp3"
        },
        {
            "title": "325: Closing The Loop",
            "datePublished": "Tue, 17 Jul 2018 19:15:00 GMT",
            "description": "This week, we close the loop on 325 episodes of talking about photography, creativity, and sometimes just the ups and downs of life in general. It has been such a privilege to be a small part of your lives for the past six years. Speaking for myself, I am a better person for having done this show, though I would imagine Bill feels the same. This show has—in no uncertain terms—changed my life and whether you have listened to one episode or all of them, thank you for making time in your lives for us each and every week. I don’t think either one of us know what’s next, but I do know that we would love to keep the conversations going. Thank you again for six amazing years.\n",
            "length": "114989376",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2018/otp-325.mp3"
        },
        {
            "title": "324: Another Stick in the Spokes",
            "datePublished": "Tue, 10 Jul 2018 17:45:00 GMT",
            "description": "With only one more episode of OTP left, this week we actually start with a discussion around photography—specifically, focusing on the tools (either hardware or software) you need or will actually use in your creative workflow. Sometimes we get caught up in looking at all of what a camera or piece of software does or is capable of doing without looking at what we actually need it to do. Also, a continuation of last week’s discussion where we talk about Don McCullin’s view that at least some of his professional life was wasted documenting the human suffering associated with war. Alfred Stanley Johnson is our Photographer of the Week.\n",
            "length": "78562235",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2018/otp-324.mp3"
        },
        {
            "title": "323: There’s No Control Group in Life",
            "datePublished": "Tue, 03 Jul 2018 16:15:00 GMT",
            "description": "This week, a discussion around knowing (or thinking we know) when it’s time to change directions, whether in a body of work, a relationship, where to live, etc. Also, what happens when the dream you wanted isn’t the reality you get? Plus, according to a federal judge, photos on the internet are fair use...yes, even yours. Don McCullin is our Photographer of the Week.\n",
            "length": "78868353",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2018/otp-323.mp3"
        },
        {
            "title": "322: Waiting For The Supersaturation Point",
            "datePublished": "Wed, 27 Jun 2018 17:30:00 GMT",
            "description": "This week, a pre-show discussion spills over into the show as we dive into the idea of myth and reputation and wrestle with the evolving definition of success. Also, episode 324 will be the last episode of OTP. We are grateful for the time that we’ve spent with you and with each other—logging well over 600 hours talking about photography and creativity—but we both feel like it’s time to explore some other areas. We’ll do one more regular show and then the final episode will be a Q&amp;A, so send us your questions! Girma Berta is our Photographer of the Week.\n",
            "length": "62639873",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2018/otp-322.mp3"
        },
        {
            "title": "321: And There It Hangs",
            "datePublished": "Tue, 19 Jun 2018 18:00:00 GMT",
            "description": "This week, sometimes hardware fails or at least doesn’t perform the way you think or hope it should We start the show with a couple stories about dealing with what happens next. Also, at what point to upgrades no longer make sense. Plus, a fascinating body of work from a very unexpected source. Kenji Toma is our Photographer of the Week.\n",
            "length": "77521853",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2018/otp-321.mp3"
        },
        {
            "title": "320: Put This Robe On And Come With Me",
            "datePublished": "Tue, 12 Jun 2018 17:00:00 GMT",
            "description": "This week, we go a little off the reservation talking about connecting to a process but not to  outcome of what was ultimately produced. We cite examples from photography, cinema and music. Also, a discussion around the first time we felt like we were part of a tribe and how we sometimes are still able to tap into how that felt. Vivian Cherry is our Photographer of the Week.\n",
            "length": "71879273",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2018/otp-320.mp3"
        },
        {
            "title": "319: Who Buys The Ink?",
            "datePublished": "Tue, 05 Jun 2018 00:00:00 GMT",
            "description": "This week, if everyone is chasing the same aesthetic, how do you know when what you make is good? Also, where do you take your work if you feel you’ve peaked? Plus, is the old stuff really better than what’s new? Or is it just that it’s more familiar? Jim Reed is our Photographer of the Week.\n",
            "length": "67631710",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2018/otp-319.mp3"
        },
        {
            "title": "318: You Have To Go Further Back To Go Forward",
            "datePublished": "Tue, 29 May 2018 21:45:00 GMT",
            "description": "This week, we’re talking about finding that type of photography that clicks with you, regardless of how broad or how niche it may be. One of the wonderful things about photography is that it’s both an art and a science and there’s room to deep dive one without necessarily losing the other. Also, self-printing seems to be a common source of confusion and anxiety - between finding the “right” printer, to then finding out that the ink will cost your more than the device itself, to having to test multiple paper types to see what works best on a given photograph. But is giving up control worth making the decision to outsource it? Francesco Cito and Gianni Berengo-Gardin are our Photographers of the Week.\n",
            "length": "64941652",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2018/otp-318.mp3"
        },
        {
            "title": "317: You’re Gonna Need A Bigger SIM",
            "datePublished": "Wed, 23 May 2018 17:15:00 GMT",
            "description": "This week, what happens when you decide to get off of the hamster wheel of social media and rely on your own website? Are you leaving money on the table or controlling your brand? Also, getting out of your comfort zone via the great American road trip. Plus, finding meaning in what you do beyond just what you make and share. Vanessa Winship is our Photographer of the Week.\n",
            "length": "67837071",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2018/otp-317.mp3"
        },
        {
            "title": "316: Nice Sallah There",
            "datePublished": "Tue, 15 May 2018 17:30:00 GMT",
            "description": "This week, a pre-show discussion about Tom Petty and crafting the perfect pop song leads into our sense memories around specific film stocks. It sounds strange, but there’s a throughline there if you give it a chance. Also, is Instagram just one big performance art piece? Plus, a listener question prompts a discussion around objective vs subjective challenges and moving the needle. Jojakim Cortis and Adrian Sonderegger are our Photographers of the Week.\n",
            "length": "66628004",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2018/otp-316.mp3"
        },
        {
            "title": "315: A New Branch On The Tree",
            "datePublished": "Wed, 09 May 2018 10:00:00 GMT",
            "description": "This week, we talk about refining the scope of personal projects so that they can be more productive and less of just a time suck—sometimes, you just need to tweak the brief. Also, what happens when a portrait is not a portrait but is still manages to capture the essence of a person? Plus, does your love for photography wax and wane, or is it constant? Jim Krantz is our Photographer of the Week.\n",
            "length": "47738663",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2018/otp-315.mp3"
        },
        {
            "title": "314: It’s Either Silence Or A Heart",
            "datePublished": "Tue, 01 May 2018 19:30:00 GMT",
            "description": "This week, we discuss the potential value of critiques in a social media landscape where the conversation around the work is often not a conversation at all. Also, a terrific NYT article begins a conversation around a veteran using photography as therapy and as a way to document the lives of other service men and women. Plus, we tackle a few #askOTP questions. Hideki Fujii is our Photographer of the Week.\n",
            "length": "67139107",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2018/otp-314.mp3"
        },
        {
            "title": "313: No One Wants To Be In A Cover Band Forever",
            "datePublished": "Wed, 25 Apr 2018 13:30:00 GMT",
            "description": "This week, we’re circling back to an earlier discussion around style and whether you choose your style (and maybe even overall aesthetic) or your style chooses you. Also, do you recognize the point at which emulating or being inspired by your artistic heroes became something more unique? Plus, planned obsolescence, photography in video games and do we really need a digital 8x10 camera? Ara Güler is our Photographer of the Week.\n",
            "length": "54248813",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2018/otp-313.mp3"
        },
        {
            "title": "312: I’m Put Off By Such Comfort",
            "datePublished": "Wed, 18 Apr 2018 17:30:00 GMT",
            "description": "This week marks the end of year six of OTP and we’re talking about style - specifically questions around whether or not our particular style of making (photographic, design, painting or otherwise) is “baked” into how we see. If we stray too far from what we “know” does it simply look like we’re trying to emulate someone else? Also, a listener asks what (if any) obligation does one creative have to another? Mary Ellen Mark is our Photographer of the Week. Thank you for being here, for listening each week and for being so generous with your time and attention. We appreciate it. See you in year seven!\n",
            "length": "61247913",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2018/otp-312.mp3"
        },
        {
            "title": "311: Poseidon Giveth and Poseidon Taketh Away",
            "datePublished": "Wed, 11 Apr 2018 22:00:00 GMT",
            "description": "This week, a look inside four Instagram photographers who reveal the “contact sheets” behind some of their images. Turns out it can take quite a few shots to get that perfect selfie or lifestyle pic. Also, the start of a broader discussion around social media and the number of “subs” or follows as the real barrier on entry into making a living as a photographer. Also, trouble on the high seas costs one of us a lens. O. Winston Link is our Photographer of the Week.\n",
            "length": "69425813",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2018/otp-311.mp3"
        },
        {
            "title": "310: Let Me Just Finish This Donut",
            "datePublished": "Tue, 03 Apr 2018 16:30:00 GMT",
            "description": "This week, do individuals make the collective better? Do we have a responsibility to use whatever talents or gifts we may have (artistic or otherwise), or is it okay to simply walk away and do something else? Also, a recurring question from a listener around overcoming self-doubt, who asks, “does it ever go away?” Spoiler: no, but it’s often an interesting discussion. William Ukoh is our Photographer of the Week.\n",
            "length": "69117127",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2018/otp-310.mp3"
        },
        {
            "title": "309: Giant Bags of Stuff in the Car",
            "datePublished": "Tue, 27 Mar 2018 19:00:00 GMT",
            "description": "This week, we talk a little about the upcoming relaunch of Ektachrome and wonder whether Kodak will be able to make a boutique film commercially successful. Also, some insight into exhibiting your work from three successful curators, courtesy of the British Journal of Photography. Plus some terrific questions from YOU, the listeners, that we do our best to answer. Miranda Penn Turin is our Photographer of the Week.\n",
            "length": "66727251",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2018/otp-309.mp3"
        },
        {
            "title": "308: Sixth Gen VHS Tape from a Prog Rock Convention",
            "datePublished": "Tue, 20 Mar 2018 18:00:00 GMT",
            "description": "This week, a conversation with Joel Meyerowitz inspires a discussion around legacy and whether art of a specific time has a shelf life of relevancy, aesthetic or otherwise. Also, what’s more valuable as a photographer, being a generalist or focusing (no pun) on one subject, area, or technique? Plus a few words about enthusiasm with 600+ hours in the rear view. Jacko Vassilev is our Photographer of the Week.\n",
            "length": "61079462",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2018/otp-308.mp3"
        },
        {
            "title": "307: We’re All in the Optometrist's Office",
            "datePublished": "Wed, 14 Mar 2018 20:30:00 GMT",
            "description": "This week, a question from a listener around making photos “that have more meaning and heart” inspires a discussion around narrative and determining what we as makers are trying to say with our work versus what we want—or need—an audience to take away from it. We also touch on editing (not post processing) as a skill that often gets minimized or even overlooked in the picture making process. Plus, sometimes, you need to prepare for anything, including the valet wrecking your car 15 minutes before a shoot. Evelyn Bencicova is out Photographer of the Week.\n",
            "length": "60909521",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2018/otp-307.mp3"
        },
        {
            "title": "306: The Venn Diagram of You and Me",
            "datePublished": "Tue, 06 Mar 2018 18:15:00 GMT",
            "description": "This week, we’re talking about context and meaning in the work we create using Sally Mann’s new show at the National Gallery as background. Within the discussion, we address changing creative directions, the relationship between process and outcome and, despite repetition how sometimes taking a dramatic creative leap comes down to timing. Also, advice on creativity, courtesy of famed portrait and landscape photographer Nadav Kander. Elsa Dorfman is our Photographer of the Week.\n",
            "length": "61684402",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2018/otp-306.mp3"
        },
        {
            "title": "305: I Really Like The Deep Dives, Ted",
            "datePublished": "Tue, 27 Feb 2018 18:15:00 GMT",
            "description": "This week, we’re talking about planning purchases — specifically, how do you determine what gear you want, versus what you need? Also, a recent gallery show inspires a discussion around editioning work and the value (or potential caveat) of arbitrary editions in a digital world. Plus, a new social media platform is gaining ground, but is it the new Instagram? Finally, a bit of gear talk musing over the latest offerings from Fuji and Sony. Isabel Magowan is our Photographer of the Week.\n",
            "length": "60027754",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2018/otp-305.mp3"
        },
        {
            "title": "304: No Filters Named After Places",
            "datePublished": "Tue, 20 Feb 2018 20:30:00 GMT",
            "description": "This week, we’re wrestling with the concepts of “good” vs “different” and whether one is better than the other, both as an end product and as a prime mover. What’s more important to you, good or different? Also, a couple interesting items around copyright and how others can or can’t share your images. Plus, preserving Disney cels and documentaries about William Eggleston and Ansel Adams. Thomas Struth is our Photographer of the Week.\n",
            "length": "79420096",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2018/otp-304.mp3"
        },
        {
            "title": "303: Who The Hell Goes To Picasso’s House?",
            "datePublished": "Tue, 13 Feb 2018 18:30:00 GMT",
            "description": "This week, making art because you have to and how context can elevate humble materials to something extraordinary. Also, connecting to the past through the tangential experiences of the present. Plus, why is serious subject matter taken more...seriously as important work? Donna Ferrato is our Photographer of the Week.\n",
            "length": "61735486",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2018/otp-303.mp3"
        },
        {
            "title": "302: The Audience Holds You Accountable",
            "datePublished": "Tue, 06 Feb 2018 19:30:00 GMT",
            "description": "This week, we start with a question we missed on last week’s Q&amp;A show around balancing available light and flash using speedlights. Also, a discussion around accepting not only who, but also where you are on your creative curve. Plus, what do you look for from a podcast? Eugene Richards is our Photographer of the Week.\n",
            "length": "68638393",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2018/otp-302.mp3"
        },
        {
            "title": "301: It’s Like Amway With A Camera",
            "datePublished": "Tue, 30 Jan 2018 19:15:00 GMT",
            "description": "This week, questions and answers from YOU, the listeners. Topics range from the business side of photography — including social media and marketing — to how to approach subjects who may not “get” your vision on the shoot. We’re also talking about how art can sometimes be overwhelming to look at and even a few technical questions around gear. A couple questions were too big to answer here and we’ll tackle them on the next show. Hugh Kretschmer is our Photographer of the Week.\n",
            "length": "82354253",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2018/otp-301.mp3"
        },
        {
            "title": "300: When The Spirit Moves Me",
            "datePublished": "Tue, 23 Jan 2018 19:30:00 GMT",
            "description": "This week, we start with a discussion around the often finicky nature of inkjet printing—between random clogs and the cost of ink and paper, is it better to just job it out? Also, a talk around taking risks, inspired by an interview with Gail Bichler, Design Director of the New York Times Magazine who says that if your work is “consistently pretty good, but you don’t have anything great,” you may not be taking enough creative risks. TWO Photographers of the Week this week: FC Gundlach and Bert Hardy.\n",
            "length": "70098915",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2018/otp-300.mp3"
        },
        {
            "title": "299: Another Word For Failure",
            "datePublished": "Tue, 16 Jan 2018 20:45:00 GMT",
            "description": "This week, we’re discussing “iterative ideation” — process whereby you course correct more often as a project develops — as a means of failing forward. Along the way, we wonder if “failure” is really the most productive way of thinking about our creative missteps. Also, we talk about some of the struggles of balancing our personal and professional lives on social media. Plus, 11 minutes for 3 setups with an icon. Emmet Gowin is our Photographer of the Week.\n",
            "length": "73287684",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2018/otp-299.mp3"
        },
        {
            "title": "298: Jeffery Drifting",
            "datePublished": "Tue, 09 Jan 2018 19:30:00 GMT",
            "description": "This week, we’re talking about the importance of mentors and how changing our focus can sometimes lead to incredible exchanges that would not have happened otherwise. Also, a discussion around workflow and the potential of using more of a mobile-first approach to post-processing images. Plus, are camera manufacturers simply releasing slighting different versions of the same cameras and trying to pass them off as new? Karl Baden is our Photographer of the Week.\n",
            "length": "41862689",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2018/otp-298.mp3"
        },
        {
            "title": "297: Dog On A Motorcycle",
            "datePublished": "Tue, 02 Jan 2018 16:45:00 GMT",
            "description": "Happy New Year! This week, we’re talking about various ways to approach 365 (or any long term) projects, inspired by some questions from a listener. Topics include: approach, overall goals and how to mark your progress when single pieces may take longer than a day to complete. If you’re starting a new project this year, we would love to check it out. We also discuss an article on Kotaku highlighting some incredible shots from video games. With so many “real” photographic principles being applied to modern gaming, do screenshots count as photography? Also, we’re going to try ending each month with a Q&amp;A/Crit Wall show. If you have questions, or would like us to discuss a photo or two,  email us at podcast at ontakingpictures.com\n",
            "length": "44136860",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2018/otp-297.mp3"
        },
        {
            "title": "296: Christmas Q&A 2017",
            "datePublished": "Tue, 26 Dec 2017 20:45:00 GMT",
            "description": "Questions, questions. Whose got the questions? Turns out, it’s YOU, the listeners! This week, we tackle conundrums about favorite museums, sources of inspiration, archiving strategies, finding the theme of your work, and a whole lot more. Brett Weston is our Photographer of the Week.\n",
            "length": "41231771",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2017/otp-296.mp3"
        },
        {
            "title": "295: This Is Where I Was Right Here",
            "datePublished": "Tue, 19 Dec 2017 17:30:00 GMT",
            "description": "This week, we geek out a little over the new non-upgradeable iMacPro and talk about hardware and workflow. We also discuss how deadlines can affect how we define (or redefine) good. Affinity teases a new piece of software for publishers and we discuss the new Annie Leibovitz Masterclass, which leaves us asking “What do you expect from online training?”. Lori Nix and Kathleen Gerber are our Photographers of the Week\n",
            "length": "49688156",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2017/otp-295.mp3"
        },
        {
            "title": "294: The Tide Went Out On My Skillset",
            "datePublished": "Tue, 12 Dec 2017 17:00:00 GMT",
            "description": "This week, we’re talking about the question of “what comes next?” and how adapting your skills to something completely unexpected may be the difference between moving forward or being left behind. Also, getting out of our own ways and realizing that you can’t get anywhere without taking that first step. Plus, would you show up for a “professional” job with a bag full of point and shoots? Peter Lindbergh is our Photographer of the Week.\n",
            "length": "49259708",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2017/otp-294.mp3"
        },
        {
            "title": "293: Trying To Hug A Cloud",
            "datePublished": "Thu, 07 Dec 2017 21:00:00 GMT",
            "description": "This week, Jeffery is back from Paris and is wrestling with whether seeing so much art is inspiring or depressing. Is there a point where experiencing the creativity of others is actually counterproductive? Also, we’ve said it many times...back up your photos. Southern California is on fire and photos still top the list of what people take first. Plus, a few gift picks for both the photographers and the non-photographers on your lists. Billy &amp; Hells are our Photographers of the Week.\n",
            "length": "80959377",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2017/otp-293.mp3"
        },
        {
            "title": "292: When You Cry Authenticity Wolf ",
            "datePublished": "Tue, 28 Nov 2017 16:45:00 GMT",
            "description": "This week, we discuss walking the line between creativity and productivity. How do you approach getting your creative work done? Are you a planner, or do you fly by the seat of your pants and go where the muse leads? Also, what would prompt you to walk away from social media if you had more than a half-million followers? Plus, we weigh in on a couple listener emails. Vitas Luckus is our Photographer of the Week.\n",
            "length": "79224647",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2017/otp-292.mp3"
        },
        {
            "title": "291: It’s All About The Torque",
            "datePublished": "Tue, 21 Nov 2017 13:00:00 GMT",
            "description": "This week, we discuss a recent article talking about “capitalist realism,” an idea that suggests that the work of Annie Leibovitz and Gregory Crewdson are two sides of the same coin in terms of the worlds they represent. Also, we weigh in on a photographer who decided to make an editorial decision on a photograph that didn’t go well. Plus, Fuji is being sued by Polaroid over Instax. Robert ParkeHarrison is our Photographer of the Week.\n",
            "length": "62397657",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2017/otp-291.mp3"
        },
        {
            "title": "290: That’s The Recipe For Me",
            "datePublished": "Tue, 14 Nov 2017 17:30:00 GMT",
            "description": "This week, with the actual hardware making so many drastic changes and computational photography gaining more interest and capability, we discuss the potential future of photography, beginning with the question “what is a photograph?” Does that definition change depending on  your entry point into the medium? Also, a reprint of a collaboration between Richard Avedon and James Baldwin inspires a discussion around how and why we critique art. Plus, is augmented reality the future or simply tomorrow’s 3d? Be sure to check the show notes for an article we will be discussing next week. Pierpaolo Ferrari is our Photographer of the Week.\n",
            "length": "69747571",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2017/otp-290.mp3"
        },
        {
            "title": "289: Brother Love Tut",
            "datePublished": "Tue, 07 Nov 2017 18:15:00 GMT",
            "description": "This week, they say imitation is the sincerest form of flattery. If you could recreate any single photograph, which one would it be and why? Does everything in a museum really “deserve” to be there or was Sturgeon right and 90% of everything is just crap? Plus, with modern cameras so dependent on software, should camera makers turn to the open source community? Virginia Thoren is our Photographer of the Week. Connect with us! Leave a message at: (347) 687-9411 or email us at: podcast@ontakingpictures.com\n",
            "length": "70619898",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2017/otp-289.mp3"
        },
        {
            "title": "288: An Iterative Process Like Everything Else",
            "datePublished": "Tue, 31 Oct 2017 17:15:00 GMT",
            "description": "This week, happy Halloween!  What constitutes a cultural experience for you? A museum? A gallery? Going bowling? Also, what motivates you to look at art? Plus, we talk about managing expectations of creative endeavors when they are just outside of your comfort zone. Four-time Pulitzer Prize winner Carol Guzy is our Photographer of the Week.\n",
            "length": "77304971",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2017/otp-288.mp3"
        },
        {
            "title": "287: If It Sounds Good Now, It’ll Sound Good Later",
            "datePublished": "Tue, 24 Oct 2017 16:30:00 GMT",
            "description": "This week, when do great cameras (or any other tools for that matter) cease to be great? Many of us chase the latest and greatest, but even the older version was great once. Also, some thoughts on photos as objects, courtesy of Wim Wenders and his collection of thousands of Polaroids. Plus, managing expectations about what we put out into the world. Taryn Simon is our Photographer of the Week. As a teaser for next week, what defines a “cultural experience” for you?\n",
            "length": "73696387",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2017/otp-287.mp3"
        },
        {
            "title": "286: You Don’t Need To Make New Friends",
            "datePublished": "Fri, 20 Oct 2017 15:45:00 GMT",
            "description": "This week, the amount of new post-production tools (including the newly announced Lightroom CC) inspires a discussion around workflow and the potential need for evolution in how we catalog and process our photographs. While some photographers (ourselves included) tend to prefer the “old” ways of doing things, tools seem to be making a shift, both in capability and in target audience. Also, we begin a look at whether or not you even need a website anymore. There doesn’t seem to be a definitive answer either way and, in the end, it really depends on what you want to get out of your work. Eugene Richards is our Photographer of the Week.\n",
            "length": "79500878",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2017/otp-286.mp3"
        },
        {
            "title": "285: The Composition Within the Chaos",
            "datePublished": "Tue, 10 Oct 2017 16:15:00 GMT",
            "description": "This week, how do you approach a new project or body of work? Is the making more important than the potential juice? Or is potential monetization always a component? Also, a discussion around creating work vs. seeing work, using photojournalism as an example. Plus, a spoiler-free discussion of the making of Blade Runner 2049 from the perspective of practical vs CG environments. Lynn Gilbert is our Photographer of the Week.\n",
            "length": "63693494",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2017/otp-285.mp3"
        },
        {
            "title": "284: Time Is Your Only Currency",
            "datePublished": "Tue, 03 Oct 2017 17:45:00 GMT",
            "description": "This week, have improvements to the gear side of photography affected the overall craft of making pictures? Or are we now able to simply pick and choose the pieces of the craft that matter most to us? Also, a listener asks about what motivates us to make, the love of doing it, money, or something else? Larry Burrows is our Photographer of the Week.\n",
            "length": "68630631",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2017/otp-284.mp3"
        },
        {
            "title": "283: Somewhere To Get A Cleat In",
            "datePublished": "Wed, 27 Sep 2017 00:30:00 GMT",
            "description": "This week, we’re addressing some of your feedback from email and the Google+ group, including the impact that mobile photography has had on how we take and share pictures. Also, we talk about the iterative nature of creativity and how sometimes starting over on a project can be a good thing. Maris Svarbova is our Photographer of the Week.\n",
            "length": "70951246",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2017/otp-283.mp3"
        },
        {
            "title": "282: All Of This Shenanigans Over A Camera",
            "datePublished": "Tue, 19 Sep 2017 19:00:00 GMT",
            "description": "This week, does having tools at the ready make you more likely to actually create? Or is preparing to create a necessary part of your process? Sometimes creativity shows up messy, if it comes at all. Also, is the perception/representation around women in photography changing, both in front of and behind the camera? Depends on where you look. According to Getty, yes. But, based on something that recently happened with Nikon, maybe not so much. Ronan McKenzie is our Photographer of the Week.\n",
            "length": "71036206",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2017/otp-282.mp3"
        },
        {
            "title": "281: Hidden Under Hair and Self-Doubt",
            "datePublished": "Tue, 12 Sep 2017 19:45:00 GMT",
            "description": "This week, we’re attempting to answer some of your questions that range from our desert island photo choices to whether or not ego affects how we take pictures. There are also questions on how to recognize when a project is done and whether or not it’s possible to change your photographic style. As usual, we got some questions that really stumped us, and some that we’re going to have to come back around to after thinking about them a bit. Pete Turner is our Photographer of the week.\n",
            "length": "89196110",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2017/otp-281.mp3"
        },
        {
            "title": "280: Tacking Left And Right Into The Wind ",
            "datePublished": "Tue, 05 Sep 2017 17:15:00 GMT",
            "description": "This week, can creatives have concrete long term goals or is the nature of making such that clarity beyond a certain point is elusive by design? Then again, if you can’t define a specific goal or end point, how do you know whether you are getting closer or moving further away from where you want (or need) to be? Ruth Orkin is our Photographer of the Week.\n",
            "length": "63196060",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2017/otp-280.mp3"
        },
        {
            "title": "279: Letting It Go For A Better Offer",
            "datePublished": "Tue, 29 Aug 2017 16:15:00 GMT",
            "description": "This week, does progress take the place of craft, or can things simultaneously move on while still staying the same? Or is the romance and nostalgia of “the way things used to be” just a manufactured memory? Also, how intentional are you about the colors in your photography? The colors you choose (and choose to leave out) can have a dramatic emotional effect on how your work is received. Plus, Sarah Oliphant has been at the forefront of backdrops for decades. Peter Hurley visits her studio to see what all the fuss is about. William Wegman is our Photographer of the Week.\n",
            "length": "75185595",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2017/otp-279.mp3"
        },
        {
            "title": "278: One and A Quarter Step Forward",
            "datePublished": "Mon, 21 Aug 2017 15:15:00 GMT",
            "description": "This week, how do you know when you’re making good work? There are so many factors that contribute to the success of a project that worrying about a subjective definition of good ends up getting lost. Is just doing the work — any work — more important than whether or not you call it good? Marvin Newman is our Photographer of the Week.\n",
            "length": "62301061",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2017/otp-278.mp3"
        },
        {
            "title": "277: We Both Work Great In Planned Chaos",
            "datePublished": "Tue, 15 Aug 2017 16:45:00 GMT",
            "description": "This week, we’re discussing order vs chaos and how each of us feels most productive. We also talk about how some forms of chaos can actually act as a motivator to help you focus and get more done. Plus, a follow up on last week’s discussion around purpose. John Vachon is our Photographer of the Week.\n",
            "length": "72453713",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2017/otp-277.mp3"
        },
        {
            "title": "276: Gas Money and a New Alternator",
            "datePublished": "Wed, 09 Aug 2017 02:00:00 GMT",
            "description": "This week, what is the purpose of your work? What does it mean to live with purpose? Is purpose a necessary component to making good work? Also, the web is filled with reviews of everything you can imagine, but how do you know the unbiased ones from the affiliates and who do you trust? Gus Peterson is our Photographer of the Week.\n",
            "length": "62731141",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2017/otp-276.mp3"
        },
        {
            "title": "275: The Good, Fast, and Cheap of Photography",
            "datePublished": "Tue, 01 Aug 2017 17:15:00 GMT",
            "description": "This week, we discuss the work of photographer Chris Killip, whose photographs of Northern England from the 1970s and 1980s manage to embody the spirit of the people as well as the landscape. Who are some of your favorite photographers who perfectly capture the feel or the energy of a particular time and place? We also talk about David Hockney, from the perspective of his ability to constantly explore and embrace new processes and techniques. Plus, the pros and cons of cropping. Olive Cotton is our Photographer of the Week.\n",
            "length": "62361257",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2017/otp-275.mp3"
        },
        {
            "title": "274: The Unatographer",
            "datePublished": "Tue, 25 Jul 2017 16:30:00 GMT",
            "description": "We begin this week with a little tech talk around monitors. Is 4K the way to go, or is an ultrawide 1080 the better play? In the end it’s just pixels, but most photographers want as many as they can get. We also talk about elevating photography into an art form, exemplified by the career of John Szarkowski, an iconic photo curator who recently passed away. Plus, what makes a portrait? Robert Freeman is our Photographer of the Week.\n",
            "length": "64712853",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2017/otp-274.mp3"
        },
        {
            "title": "273: Kenneth Is Funded With Advice",
            "datePublished": "Tue, 18 Jul 2017 17:00:00 GMT",
            "description": "This week, a listener asks for advice on how to fund a print project, which leads us on a discussion around potential solutions as well as options for compromise on what the end product looks like — something anyone who has made anything will likely be able to relate to. Also, a few stories that re-open the discussion around copyright and what a slippery slope it can be to navigate on both sides of the equation. Plus, “fake” is the new “it” word — fake news, fake photos, fake fame — but what happens when we really do lose our ability to tell fact from fiction? Martin Munkácsi is our Photographer of the Week.\n",
            "length": "67769847",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2017/otp-273.mp3"
        },
        {
            "title": "272: If I Stand Still, That’s When the Cobwebs Grow",
            "datePublished": "Tue, 11 Jul 2017 16:15:00 GMT",
            "description": "This week, we discuss the possibilities of stepping outside our comfort zones. Sometimes, the beginning of a project seems too far out of reach — maybe even more than we can handle — but we find that the sweet spot in the Venn diagram between challenge and uncertainty is exactly what we need to take the work somewhere it couldn’t have gotten to any other way. Also, where have all the Renaissance men gone? William Christenberry is our Photographer of the Week.\n",
            "length": "73137473",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2017/otp-272.mp3"
        },
        {
            "title": "271: Hanging Out With The Other Kids Drinking Cristal",
            "datePublished": "Wed, 05 Jul 2017 17:00:00 GMT",
            "description": "This week, for all of the “improvements” in the creative tools we use — specifically around software — have they really gotten noticeably better? Faster, yes. But are we more productive and is the work we produce better because of the tools or is it something else? Also, nepotism might get you in the door, but it doesn’t keep you in the game. Plus, should an artist be allowed to destroy his or her work from beyond the grave? Jason Lee is our Photographer of the Week.\n",
            "length": "64185030",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2017/otp-271.mp3"
        },
        {
            "title": "270: The Luster Dulls Over Time",
            "datePublished": "Tue, 27 Jun 2017 14:00:00 GMT",
            "description": "This week, we’re talking about inherited meaning, specifically related to last week’s discussion around using tintype to capture older blues musicians and how that process seemed to “fit” the subject matter. Does the process give the photographs more meaning? Is the fact that they are actual tintypes “better” than if a similar effect had been achieved with a preset or a filter? Also, a terrific story about a husband and wife, their Hasselblad, and the Moon. Lilian Day Thorpe is our Photographer of the Week.\n",
            "length": "55222291",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2017/otp-270.mp3"
        },
        {
            "title": "269: Breadcrumbs To Find Your Way Home",
            "datePublished": "Wed, 21 Jun 2017 18:30:00 GMT",
            "description": "This week, a discussion around long term projects, inspired by the work and career of Ed Gold, a photographer who often spends years on a single body of work. Also, art and politics have had a long shared history, but has the current political climate allowed art to cross the line? Plus, choosing the right medium for the job and advice on printing your images. Khadia Saye is our Photographer of the Week.\n",
            "length": "39963235",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2017/otp-269.mp3"
        },
        {
            "title": "268: The Similarities Are Too Similar",
            "datePublished": "Tue, 13 Jun 2017 21:00:00 GMT",
            "description": "This week, we discuss what happens when the results of a project just don’t seem to match the effort we put into making it. Is “giving your best shot” really good enough? Also, a follow up on a previous discussion on how certain places seem to enable or at least play a part in what we make in them. Wolfgang Suschitzky is our Photographer of the Week.\n",
            "length": "46551421",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2017/otp-268.mp3"
        },
        {
            "title": "267: What’s Left For Humans To Do?",
            "datePublished": "Tue, 06 Jun 2017 17:00:00 GMT",
            "description": "This week, what happens when machines learn enough to not only sort pictures, but make them? Is creativity just an algorithm after all? Also, a discussion around self-publishing using a cookbook as an example as well as a reader who’s life was changed by it. Michael Wolf is our Photographer of the Week.\n",
            "length": "73244646",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2017/otp-267.mp3"
        },
        {
            "title": "266: Dance Monkey, Dance",
            "datePublished": "Tue, 30 May 2017 16:00:00 GMT",
            "description": "This week, we begin with a talk about the idea of obsolescence, from the perspective of tools and hardware that for seemingly arbitrary reasons are no longer able to be used. Also, a discussion around being on (or off) a roll creatively and how sometimes you can’t see the crest from the dip. Plus, does Instagram have a secret hashtag #blacklist? Ty Cole is our Photographer of the Week.\n",
            "length": "61688531",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2017/otp-266.mp3"
        },
        {
            "title": "265: Neuronic Connections",
            "datePublished": "Tue, 23 May 2017 17:15:00 GMT",
            "description": "This week, a brief discussion around depression after the tragic loss of Chris Cornell leads us into a discussion of Basquiat and the recent sale that put him at the top of the heap of American artists (at least in terms of dollars paid for a single piece). Also, do your tools or creative spaces imbue you with superpowers? Should we expect them to? Plus, Greg Heisler of light and color. Photojournalist Stanley Greene is our Photographer of the Week.\n",
            "length": "59391115",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2017/otp-265.mp3"
        },
        {
            "title": "264: Advice Needs To Be Calibrated",
            "datePublished": "Tue, 16 May 2017 18:45:00 GMT",
            "description": "This week, a discussion around music producers leads to wondering if the same producer-artist relationship to be productive for photographers. Would bringing in an outside - yet trusted - set of eyes help newer, better work emerge? Also, where does criticism come into play? Do you post wanting unsolicited feedback or do you look for honest critique from only a select few. Plus, a couple listener emails on whether writing about photography (or art) helps or is even necessary and help in choosing full frame or crop sensor. Chema Madoz is our photographer of the week.\n",
            "length": "68435029",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2017/otp-264.mp3"
        },
        {
            "title": "263: If There’s A Listicle About It It’s Too Late ",
            "datePublished": "Tue, 09 May 2017 16:30:00 GMT",
            "description": "This week, we discuss the value of surrounding yourself with different types of creative people and how happy accidents can end up sending you in a new direction. Also, stop trying to be different — find your tennis ball and just get to work. Plus, a terrific story about a group of young people embracing documentary photography. Norman Parkinson is our Photographer of the Week.\n",
            "length": "77623218",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2017/otp-263.mp3"
        },
        {
            "title": "262: No Whips Were Harmed In The Making of These Photographs",
            "datePublished": "Tue, 02 May 2017 17:00:00 GMT",
            "description": "This week, how do you know when you’ve found your voice and aren’t simply emulating someone else? Also, have cameras become less like creative tools and more like computers that take pictures? Plus, a major museum clashes with Instagram over what is and isn’t art. Louise Lawler is our Photographer of the Week.\n",
            "length": "66012877",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2017/otp-262.mp3"
        },
        {
            "title": "261: Healing Salve On The Open Wound Of Doubt",
            "datePublished": "Tue, 25 Apr 2017 16:45:00 GMT",
            "description": "Welcome to OTP year six! This week, are better and better cameras taking the craft out of photography, or does not having to worry about the technical free us to concentrate on the artistic? Is there more long term value in keeping your kit simple? Also, a listener question has us discussing how to figure out what comes next after a large or long-term project. Plus, sometimes we lose sight of our own creative worth and need to recalibrate. Diane Tuft is our Photographer of the Week.\n",
            "length": "68996777",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2017/otp-261.mp3"
        },
        {
            "title": "260: A Friendship Built On Skype",
            "datePublished": "Tue, 18 Apr 2017 17:00:00 GMT",
            "description": "This week, we’re doing our best to answer your photo questions, which range from the technical to the obscure, from dream camera setup to whether or not you need an agent (spoiler: it depends). This episode marks the end of five years of OTP and we couldn’t be more grateful. Thank you for continuing to take an hour and a half or so out of your week to join us. We love doing the show and are looking forward to year six. Claire Rosen is our Photographer of the Week.\n",
            "length": "67291491",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2017/otp-260.mp3"
        },
        {
            "title": "259: Chasing Expertise, and Amy",
            "datePublished": "Tue, 11 Apr 2017 18:00:00 GMT",
            "description": "This week, tutorials, gear reviews, benchmarks and ratings. If everyone is an Expert, who do you trust? Ultimately, you need to use the tools and advice that works for you, regardless of what They say. Also, we geek out a little over video cards and the importance of being able to upgrade your rig. Plus, our Photographer of the Week, Joel-Peter Witkin, inspires a discussion that wonderfully illustrates the power of a photograph.\n",
            "length": "63103225",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2017/otp-259.mp3"
        },
        {
            "title": "258: The Hottest Bell Pepper I’ve Ever Seen",
            "datePublished": "Tue, 04 Apr 2017 16:30:00 GMT",
            "description": "This week, what’s the most iconic nude photo you’ve ever seen? Now, think about what makes it iconic. The human form is a blank canvas, but depending on how it’s lit, posed or seen by the artist, the resulting representation can be either beautiful or disturbing, art or porn. What’s takes it one way or the other? Also, we talk about when “official” portraits are just bad portraits. Plus, would you pay to use social media if it meant keeping your private information private? Suzanne Moxhay is our Photographer of the Week.\n",
            "length": "62265399",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2017/otp-258.mp3"
        },
        {
            "title": "257: Turn the Hat Around",
            "datePublished": "Tue, 28 Mar 2017 16:15:00 GMT",
            "description": "This week, a followup to our depression discussion from a couple episodes ago and a letter from a listener. Despite how it sometimes feels, you’re not alone. It’s dark sometimes - really dark - but it’s not empty. We, along with countless listeners, have been there. Call us, email us, post in the group or talk to a family member or a friend. Make things. Share work. Every day, every picture is a chance to change course, either a little or a lot. Also, an offline phone call inspired a discussion around conventional wisdom pertaining to gear and equipment. Nick Veasey is our photographer of the week.\n",
            "length": "56098745",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2017/otp-257.mp3"
        },
        {
            "title": "256: Mash Potatoes In the Shape of the Hollywood Bowl",
            "datePublished": "Wed, 22 Mar 2017 00:15:00 GMT",
            "description": "This week, prompted by a listener email, we talk about taking “those” photos that have been taken a million times before and why you should or shouldn't take your version. Also, a discussion around being open to the process and giving yourself permission to play, regardless of whether or not all the pieces are in place. Paul Outerbridge is our Photographer of the Week.\n",
            "length": "49525948",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2017/otp-256.mp3"
        },
        {
            "title": "255: If It Says VIP, It’s Not VIP",
            "datePublished": "Tue, 14 Mar 2017 15:30:00 GMT",
            "description": "This week, we discuss the paralyzing power of depression via a story of a Chinese photographer called Ren Hang, who recently took his own life. Also, a quick roundup of some of our current favorite photo apps. Plus, we tease a couple articles to discuss next week around the creative process of artists like Beck, Tom Waits and Kendrick Lamar as well as the value of immersion via Chrissie Hynde. Laurent Nivalle is our Photographer of the Week.\n",
            "length": "60737408",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2017/otp-255.mp3"
        },
        {
            "title": "254: Bob Ross on Mute",
            "datePublished": "Tue, 07 Mar 2017 20:30:00 GMT",
            "description": "This week, we’re starting out with a discussion around craft, inspired in part by the terrific Netflix series, Abstract. Also, we talk about two extremes of making work - at one end, we cite John Free and his 10 year photo essay project talking to people in the train yards in Los Angeles. On the other end, is the recent pop-up display of images and contact sheets from Robert Frank’s The Americans which, at the request of the photographer, were taken down and destroyed. Is one of these things a more valid expression of art than the other, or are they each a potentially necessary part of the creative process? Plus, with our five year anniversary coming up, we’re asking if you have any ideas on how you’d like to see us mark the occasion. If so, email us at podcast@ontakingpictures.com. Aaron Siskind is our Photographer of the Week.\n",
            "length": "70615196",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2017/otp-254.mp3"
        },
        {
            "title": "253: Imagineers Are Never Gonna Do South Park",
            "datePublished": "Tue, 28 Feb 2017 17:00:00 GMT",
            "description": "This week, we respond to a couple listener emails — one involves questions around valuing work and the other is a followup to last week’s discussion around barriers. Also, what do you expect when you post your work online? Are you looking for constructive criticism, likes or is it just a vehicle for sharing what you make? Magnum photographer Eli Reed is our Photographer of the Week.\n",
            "length": "69568261",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2017/otp-253.mp3"
        },
        {
            "title": "252: That’s Not What Cameras And Books Were Made For",
            "datePublished": "Tue, 21 Feb 2017 19:00:00 GMT",
            "description": "This week, an email from a listener sparks a discussion about shipping - specifically around our own expectations over what comes next. This leads us into a broader discussion around self image, privilege and fears - both real and imagined. Also, is an MFA in photography a good idea? Plus, we got lots of terrific phone calls from you and want more. Keep them coming! Herbert Randall is our Photographer of the Week.\n",
            "length": "70372745",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2017/otp-252.mp3"
        },
        {
            "title": "251: I’m Just Gonna Shut Up And Sit Here",
            "datePublished": "Tue, 14 Feb 2017 21:15:00 GMT",
            "description": "This week, we’re talking about film gear and answering some listener questions about our favorite film cameras. Also, a discussion around the challenges of becoming derivative of your own work, especially when you’ve done it for decades. We use Billy Joel and Mark Seliger as examples. Plus, despite low earnings, camera makers are still developing some pretty incredible tech. Lorna Simpson is our Photographer of the Week.\n",
            "length": "60360019",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2017/otp-251.mp3"
        },
        {
            "title": "250: Like the Whos in Whoville",
            "datePublished": "Tue, 07 Feb 2017 17:00:00 GMT",
            "description": "This week, have the tools taken the mystery out of photography? When you no longer think about technical requirements to make photographs, have we gone too far or is that the point? Also, a couple terrific submissions from listeners — including one that has us marvelling at photos from an earlier time in America. Plus, is there value in keeping meticulous records of your life? We’re celebrating Black History Month by spotlighting African American Photographers of the Week, beginning with Addison Scurlock.\n",
            "length": "56302952",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2017/otp-250.mp3"
        },
        {
            "title": "249: Ancillary Collaboration",
            "datePublished": "Tue, 31 Jan 2017 17:45:00 GMT",
            "description": "This week, we discuss the seemingly innate skills and abilities of our fathers and grandfathers and how somewhere along the way, that “folk wisdom” was either lost or perhaps no longer needed. Were the skills handed down to them, or simply a byproduct of the time and place in which they lived? Have we evolved? Also, we mention a few terrific documentaries about art and design that are currently available for streaming. Chuck Stewart is our Photographer of the Week.\n",
            "length": "60164891",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2017/otp-249.mp3"
        },
        {
            "title": "248: Albatross Is On The Move",
            "datePublished": "Tue, 24 Jan 2017 17:30:00 GMT",
            "description": "This week, a discussion around the historic worldwide Women’s March on Washington has us wondering “are we so used to things ‘being Photoshopped’ that we ignore actual photographic evidence?” Also, Jeffery gets a faux secret service detail. Plus, getting “the shot” in three minutes — what do you do if you didn’t get it? Has Fuji gotten the feel right with the new X100F and XT-20? Rusty Fox is our Photographer of the Week.\n",
            "length": "63410180",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2017/otp-248.mp3"
        },
        {
            "title": "247: Keep the Nihilist in the Closet",
            "datePublished": "Tue, 17 Jan 2017 17:00:00 GMT",
            "description": "This week, we discuss the connection between purpose and happiness. Are they connected? Does one precede the other? What happens to our work when we no longer feel any purpose in engaging in it? Does it merely become practice? If so, to what end? Also, a reflection on the life of Gene Cernan and men like him, who dared to leave their home behind “just to see if they could do it.” Luigi Ghirri is our Photographer of the week.\n",
            "length": "63161361",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2017/otp-247.mp3"
        },
        {
            "title": "246: If I Start This, Then I’ll Have To Finish It",
            "datePublished": "Tue, 10 Jan 2017 16:30:00 GMT",
            "description": "Sometimes, you need to take stock of the path you’re on to make sure you get where you’re trying to go. Other times, you may need to change the destination entirely. This week, we’re talking about looking at where we are and what to do if it’s just a little off. We’re also talking about new projects and how sometimes just rolling up your sleeves and doing the work is all that matters. Jerry Schatzberg is our Photographer of the Week.\n",
            "length": "54154929",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2017/otp-246.mp3"
        },
        {
            "title": "245: A Higher Form of Noise",
            "datePublished": "Tue, 03 Jan 2017 16:30:00 GMT",
            "description": "We’re starting out the new year discussing transformation — specifically, the transformation that seems to be an essential component to making art with a capital ‘A.’ To help with the discussion, we’re using a terrific Netflix documentary series that traces the foundations and evolution of Hip Hop that brilliantly exemplifies transformation at work. Through interviews and archival footage, we see the origin story that took hip hop from back alleys and front rooms in the Bronx to stadiums all over the world. Kurt William Kamka is our Photographer of the Week.\n",
            "length": "48485647",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2017/otp-245.mp3"
        },
        {
            "title": "244: That’s the Arrow That Got Through",
            "datePublished": "Mon, 26 Dec 2016 22:30:00 GMT",
            "description": "This week, trying to reconcile the highs and lows of the past year and how for some of us, when an artist dies, a little piece of our history or even the personal identity that we have associated with the person (or their body of work) dies as well. It’s as if our potential, whether realized or not is inexorably tied to their energy. Also, a little about what’s next for each of us in 2017. Rodney Smith is our Photographer of the Week. Happy New Year everyone.\n",
            "length": "56455123",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2016/otp-244.mp3"
        },
        {
            "title": "243: Can You Make the Logo Bigger?",
            "datePublished": "Tue, 20 Dec 2016 18:45:00 GMT",
            "description": "This week, we’re starting off with a little about gear, specifically the new Microsoft Surface Studio and the uncertain future of desktop Macs. From there it’s on to David Hockney and a somewhat relativistic view of the “good” of art and whether or not one piece of art is really any better than another. Also, are bigger prints always better? Plus, we take a trip to the Crit Wall. Lori Vrba is our Photographer of the Week.\n",
            "length": "66861863",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2016/otp-243.mp3"
        },
        {
            "title": "242: Lack of Stasis",
            "datePublished": "Tue, 13 Dec 2016 18:15:00 GMT",
            "description": "This week, we discuss TIME’s Person of the Year cover and portfolio, made by Nadav Kandar. Specifically, we unpack questions raised by the potentially subversive nature of the work and whether or not an artist has a responsibility to art before personal belief. As part of the discussion, we also reference a collection of Dorothea Lange’s previously censored photographs of FDR’s Japanese concentration camps. Jack Davison is our Photographer of the Week.\n",
            "length": "58985598",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2016/otp-242.mp3"
        },
        {
            "title": "241: The Final Ten Percent Takes Ninety Percent of the Time",
            "datePublished": "Tue, 06 Dec 2016 17:15:00 GMT",
            "description": "This week, details about the OTP Gift Exchange and some of our book suggestions. Also, how would what you make and release into the world — your art — be different if there were negative consequences to showing it? Plus, is it worth it to print all of your photos? Danny Clinch is our Photographer of the Week.\n",
            "length": "71993721",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2016/otp-241.mp3"
        },
        {
            "title": "240: The Reins Are Fear",
            "datePublished": "Tue, 29 Nov 2016 18:00:00 GMT",
            "description": "This week, making decisions. Sometimes moving through fear means letting go of the reigns — emotionally, creatively, maybe even geographically. But once you do, how much control do you actually have to change course? Are you at the whim of inertia, or do small moves open up new territories, whether you want them to or not? Plus, is monetization after the fact different or better than having it as a goal from the beginning? Frederick Sommer is our Photographer of the Week.\n",
            "length": "74034648",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2016/otp-240.mp3"
        },
        {
            "title": "239: True to the Show",
            "datePublished": "Tue, 22 Nov 2016 15:30:00 GMT",
            "description": "This week, what would you do as an artist without the right to express yourself freely? Do you censor your work or do you use your voice and push harder to make your point of view known? Also, what would you give up creatively in order to immerse yourself in something new? Plus, a couple entries from the Crit Wall. Ruth Gruber is our Photographer of the Week.\n",
            "length": "60807992",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2016/otp-239.mp3"
        },
        {
            "title": "238: There Will Always Be A Minority Report",
            "datePublished": "Tue, 15 Nov 2016 18:00:00 GMT",
            "description": "This week, we discuss the recent election not from a political perspective, but rather from the standpoint of making art and how to translate the reactionary energy into something good. Also, what are some differences between good and great street photography? Are there objective markers or is it merely great by degrees? Vicki Dasilva is our Photographer of the Week.\n",
            "length": "69127951",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2016/otp-238.mp3"
        },
        {
            "title": "237: The Flow of the Slinky",
            "datePublished": "Tue, 08 Nov 2016 17:15:00 GMT",
            "description": "This week, with the proliferation of low cost gear and the barrier of entry so low, have the mechanics of making become too easy? Also, is there such a thing as “objectively good” and if so, how do you know it when you see it? Plus, has photo software reached the tipping point in terms of features? Jerome Liebling is our Photographer of the Week.\n",
            "length": "58317928",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2016/otp-237.mp3"
        },
        {
            "title": "236: The Next Switchback on the Plateau",
            "datePublished": "Tue, 01 Nov 2016 16:15:00 GMT",
            "description": "This week, we’re talking about the ups and downs we go to when we just can’t seem to connect with what we make. How do you keep moving forward when it feels like your wheels are just spinning in the mud. It’s not the feeling of being stuck because energy is still being expended — there’s just the feeling of not moving. Plus, does innovation happen by committee or does there need to be a single vision that the committee then supports? Shin Nogouchi is our Photographer of the Week.\n",
            "length": "69359911",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2016/otp-236.mp3"
        },
        {
            "title": "235: Layering It Up Like a Cake",
            "datePublished": "Wed, 26 Oct 2016 19:00:00 GMT",
            "description": "This week, how do you know — or can you know — when a piece of work will be more than what you thought it would be going into it? Can you predict greatness or is it only available in hindsight? At what point do you call the game if you’re not going to win? Also, a discussion around how appreciating art can often be affected by the room or the way it’s displayed, using the newly reopened East Wing of the National Gallery of Art in DC as an example. Plus, Erin Margaret Allison Rambo is our Photographer of the Week.\n",
            "length": "61072257",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2016/otp-235.mp3"
        },
        {
            "title": "234: Measure Twice, Cut Once",
            "datePublished": "Mon, 17 Oct 2016 19:30:00 GMT",
            "description": "This week, Bob Dylan wins the Nobel Prize for literature and it inspires a discussion around boundaries as they pertain to art and creative pursuits. Does Dylan winning this re-define what qualifies as literature? How does this discussion pertain to photography? Is portraiture more valid than street photography? Is shooting wildlife somehow “better” than shooting weddings? Also, how much does creative efficiency figure into your own creative process? Are you looking for the shortest line between to points or do you prefer the more scenic route? Jonathan Mannion is our Photographer of the Week.\n",
            "length": "60608006",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2016/otp-234.mp3"
        },
        {
            "title": "233: Live Up To An Impossibility",
            "datePublished": "Tue, 11 Oct 2016 16:15:00 GMT",
            "description": "This week, we’re discussing changing directions creatively inspired by both new gear and a new environment, which raises a couple questions for us that we’d like to also ask you. To what degree does what you use affect what you make? Aside from tools, how does the environment you create in contribute to the work you produce? Also, once you make a dramatic shift and have the necessities locked in, how do you decide what comes next? Fred Lyon is our Photographer of the Week.\n",
            "length": "63506418",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2016/otp-233.mp3"
        },
        {
            "title": "232: Solid Steel Walls of Reality",
            "datePublished": "Tue, 04 Oct 2016 17:45:00 GMT",
            "description": "This week a few thoughts around the new National Museum of African American History &amp; Culture and how photography was sourced and is used throughout the museum. Also, rock and roll photography — has increasingly limited access to the band and performances limited the resulting quality of the work? Sails Chong is our Photographer of the Week.\n",
            "length": "60291543",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2016/otp-232.mp3"
        },
        {
            "title": "231: I Look Forward to Looking Back",
            "datePublished": "Tue, 27 Sep 2016 16:30:00 GMT",
            "description": "This week, we’re in a few different directions and we begin with a discussion around the Smithsonian’s newly opened National Museum of African American History and Culture. Specifically, do you feel an obligation to visit places like these - places that are as much a historical record as they are a cultural cautionary tale? Also, a followup to  the gear discussion that we started last week. Plus, a terrific email from a listener inspires this week’s G+ group assignment. Claude Cahun is our Photographer of the Week.\n",
            "length": "63876069",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2016/otp-231.mp3"
        },
        {
            "title": "230: Full-On Artistic Telephone",
            "datePublished": "Tue, 20 Sep 2016 16:00:00 GMT",
            "description": "This week, we begin with a discussion around how we actually discuss art, including some of the collective meaning of the terms we use. Also, can concepts like “commentary” and “criticism” be as effective if they are non-verbal? For example, is a jazz improvisation an appropriate response to a particular work of art? Also, we spend some time talking about gear, from Hackintoshes, to the slew of new cameras announced (or “pre-announced”) at this year’s Photokina. Alexey Titarenko is our Photographer of the Week.\n",
            "length": "69526347",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2016/otp-230.mp3"
        },
        {
            "title": "229: Almost to the Shipping Point of Shipping",
            "datePublished": "Tue, 13 Sep 2016 16:30:00 GMT",
            "description": "This week, we’re talking about getting work out the door, and some of the difficulties that can arise around trying to figure out how and why to make the changes necessary to do it. Sometimes the best thing you can do is to take a step back from the thinking and the strategizing and just make. Also, we discuss the Documerica project and how differently a similar project might look today. Jacob Riis is our Photographer of the Week.\n",
            "length": "65179779",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2016/otp-229.mp3"
        },
        {
            "title": "228: The Giant Pachinko Game in the Sky",
            "datePublished": "Tue, 06 Sep 2016 00:00:00 GMT",
            "description": "This week, we’re doing another Q&amp;A show and, as usual, you all sent in some terrific questions that we had a great time going through. Topics include: how often to update your website, whether or not to shoot DNG, how to get more engaging street shots, whether or not to print in-house and a bunch more. Marc Riboud is our Photographer of the Week.\n",
            "length": "71024120",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2016/otp-228.mp3"
        },
        {
            "title": "227: Psychologize That Up The Wazoo",
            "datePublished": "Tue, 30 Aug 2016 15:45:00 GMT",
            "description": "This week, a discussion around photojournalism inspired by the Netflix series Conflict that raises a few questions for us to chew on. Would you ever put yourself in harm’s way for a photograph? If you already do, why? Is it for the photograph or the thrill of the shoot? Or some combination of both? Is a photograph more valuable than the life that is potentially lost capturing it? Also, does taking photos at important or milestone events enhance or take away from your ability to enjoy/remember said event? Plus, a teaser for next week in the show notes: what do you see when you look at art? Richard Tuschman is our Photographer of the Week.\n",
            "length": "61182289",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2016/otp-227.mp3"
        },
        {
            "title": "226: You Want The Pixie Dust",
            "datePublished": "Tue, 23 Aug 2016 14:30:00 GMT",
            "description": "This week, we discuss the magic of things and the legacy of genius. Is Winogrand’s camera, Clapton’s Stratocaster, Picasso’s brush or Hemingway’s typewriter somehow imbued with greatness? In choosing the same tools as our heroes, do we secretly (or not so secretly) hope that a bit of their magic will rub off on us? Photojournalist Nicole Tung is our Photographer of the Week.\n",
            "length": "53286119",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2016/otp-226.mp3"
        },
        {
            "title": "225: The Megapixel List of Life",
            "datePublished": "Tue, 16 Aug 2016 16:00:00 GMT",
            "description": "This week, a discussion around printing (spoiler: be sure to use the correct profiles) leads to the start of a larger discussion around the perceived value of signatures. Do you sign your prints? If so, why? If you don’t, why not? Also, looking for the one camera that does everything—even the things you don’t currently need it to do—is a fool’s errand. Better to look for the right tool for the job at hand and let the future sort itself out. Brad Goldpaint is our Photographer of the Week.\n",
            "length": "66393534",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2016/otp-225.mp3"
        },
        {
            "title": "224: Blink Decision",
            "datePublished": "Tue, 09 Aug 2016 17:00:00 GMT",
            "description": "This week, a discussion around the work and process of iconic Japanese photographer Daido Moriyama — specifically around the value of revisiting a place in order to refine your vision of it and how details often emerge through repetition. Also, how much time should you devote to your website? What are some “must have” features? Plus, do six-year-olds need to know about Daguerre? Eve Arnold is our Photographer of the Week.\n",
            "length": "60709370",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2016/otp-224.mp3"
        },
        {
            "title": "223: Driving Backwards is a Bad Idea",
            "datePublished": "Tue, 02 Aug 2016 18:15:00 GMT",
            "description": "This week, how do you know if you’re close to the target if the target hasn’t been clearly defined? We discuss the difficulty in embarking on a journey (creative or otherwise) without at least a direction. How to you calibrate your creative compass when there is no true North? Also, next week we’re talking about the work and process of Daido Moriyama, using a video in this week’s show notes as a reference. Plus, who was the nineteenth century’s most photographed individual? The answer may surprise you. Klaus Enrique is our Photographer of the Week.\n",
            "length": "64467762",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2016/otp-223.mp3"
        },
        {
            "title": "222: Form of Stupidity, Shape of an Idiot",
            "datePublished": "Tue, 26 Jul 2016 15:00:00 GMT",
            "description": "This week, a couple books about Saul Leiter show that great photography is not always about per pixel sharpness and bright, saturate color. The problem is, when do you know when it is and when it isn’t? Can a photographic style be plotted like a course on a map, or does it only happen in the rear view mirror? Also, video seems to be the “it” factor for much of the photography industry, but is it worth it, when you consider the gear, the time and the ability required to really do it well? Arthur Tress is our Photographer of the Week.\n",
            "length": "65578365",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2016/otp-222.mp3"
        },
        {
            "title": "221: All the Salt in the World",
            "datePublished": "Tue, 19 Jul 2016 17:00:00 GMT",
            "description": "This week, we talk about getting out of your own way and recognize that giving up control doesn't mean giving up the wheel. Also, we discuss a fascinating article on Chuck Close and what we sometimes leave on the studio floor in the name of art. Plus, photojournalist Ed Kashi is our Photographer of the Week.\n",
            "length": "71539069",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2016/otp-221.mp3"
        },
        {
            "title": "220: They Want Paul Bunyan",
            "datePublished": "Tue, 12 Jul 2016 17:00:00 GMT",
            "description": "This week, we’re taking a look at the fact vs. the possible fiction around the myth of famed photojournalist Robert Capa — specifically, the photographs of the D-Day invasion in WWII. Also, a discussion around gear. What do you do when the camera is the limitation, not your vision, and you’re trying to decide whether or not you’re “pro” enough to justify a major upgrade? How much should passion play into the equation? Daniel Milnor is our Photographer of the Week.\n",
            "length": "63093503",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2016/otp-220.mp3"
        },
        {
            "title": "219: Bell Curve of Adoption",
            "datePublished": "Tue, 05 Jul 2016 18:30:00 GMT",
            "description": "This week, an article in the New York Times about Richard Avedon’s project “In the American West” has us discussing legacy. Who really owns your work after you’ve gone? Also, can you overshoot your own “creative sweet spot” only to end up in uncharted waters? We use the work of fantastic painter Andrew Salgado as an example. Plus, when do you give in to technology, even if it means changing a workflow that has worked for years? Janette Beckman is our Photographer of the Week.\n",
            "length": "57025363",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2016/otp-219.mp3"
        },
        {
            "title": "218: Moon Rocks Down Here Cost a Lot of Money",
            "datePublished": "Tue, 28 Jun 2016 18:15:00 GMT",
            "description": "This week, a discussion around limited editions and perceived value. Does a false sense of scarcity make people want work more? And how does scarcity affect value if the demand isn’t there to begin with? Also, we talk about the notion of creative rivalry using the Pet Sounds and Rubber Soul as a jumping off point. Plus, some gear thoughts around Hasselblad’s new X1D medium format mirrorless camera. Bill Cunningham is our Photographer of the Week.\n",
            "length": "65082798",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2016/otp-218.mp3"
        },
        {
            "title": "217: A Plus B Equals Jello",
            "datePublished": "Tue, 21 Jun 2016 18:30:00 GMT",
            "description": "This week, you’ve got questions and we’ve got answers. Spoiler: Not all of the answers are good. Great questions about motivation, focus, growth, the business side, finding balance and more. Plus a new assignment and Josef Hoflehner is our Photographer of the Week.\n",
            "length": "74888415",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2016/otp-217.mp3"
        },
        {
            "title": "216: Unintentionally Intentional",
            "datePublished": "Tue, 14 Jun 2016 17:45:00 GMT",
            "description": "This week, are 10,000 hours alone really enough to be great at anything? Maybe, but the real answer is likely more nuanced. Experience does not necessarily equal expertise. Intent and purpose — not to mention innate ability — also play a role in chasing perfection. Plus, can analog tools make digital processing more efficient? Jim Brandenburg is our Photographer of the Week.\n",
            "length": "72554784",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2016/otp-216.mp3"
        },
        {
            "title": "215: Don’t Trust Experts",
            "datePublished": "Tue, 07 Jun 2016 16:45:00 GMT",
            "description": "This week, a discussion around the work of painter Jeremy Mann, via the documentary A Solitary Mann by Loic Zimmermann. How much does happenstance figure into your creative output? Is your current style intentional or the result of a “happy accident” that you now continue to refine? The recent killing of an NPR photojournalist in Afghanistan sparks a conversation around photojournalism and the multiple areas where importance figures into making. Plus, remembering Muhammad Ali through the incredible photographs of his life and career. Nick Brandt is our Photographer of the Week.\n",
            "length": "42715147",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2016/otp-215.mp3"
        },
        {
            "title": "214: The Oxygen and the Spark",
            "datePublished": "Tue, 31 May 2016 17:45:00 GMT",
            "description": "This week, baseball and theater inspire a discussion around making things that can’t be made and how the conversation between maker and audience is sometimes the exact context that is lacking. Also, a discussion around landscape photography prompted by a listener email. Plus, a wrap up (for now at least) of the current Steve McCurry snafu. Clayton James Cubitt is our Photographer of the Week.\n",
            "length": "43192760",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2016/otp-214.mp3"
        },
        {
            "title": "213: You’re Not About the Craft If You Use Laser Triggers",
            "datePublished": "Tue, 24 May 2016 16:30:00 GMT",
            "description": "This week, we’re talking about memories, specifically the culling of photographic memories. If forced to choose, how do you decide which memories to keep? What single shot best captures your childhood, your wedding, your parents or children? In the deluge of photographic imagery, how you choose the right lifeboat? Also, Cindy Sherman has released her first new work in five years, but without any context, is it any good? Hiro is our Photographer of the Week.\n",
            "length": "41255227",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2016/otp-213.mp3"
        },
        {
            "title": "212: Audience Inflation",
            "datePublished": "Tue, 17 May 2016 00:15:00 GMT",
            "description": "We’re a day early and all over the map this week, with topics including rating photographs in a changing aesthetic, online vs offline creative communities, making vs. sharing and a continuation of last week’s discussion about post-processing — specifically, how much is too much? Michael Kenna is our Photographer of the Week.\n",
            "length": "39187472",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2016/otp-212.mp3"
        },
        {
            "title": "211: I Do Wanna Be A Person Eating Pancakes!",
            "datePublished": "Tue, 10 May 2016 17:30:00 GMT",
            "description": "This week, we talk about the continuing evolution of photography from the perspective of seeing how genres are blending into one another and how so much of contemporary photography can fall under “lifestyle.” Also, two sides of a Photoshop discussion around retouching — one from the point of view of a model and the other from an icon of photojournalism. Plus, how do you feel about narrative in photography? Do you want to be told what a photo or body of work means, or do you prefer assigning your own narrative and/or backstory to the work? Bruce Davidson is our Photographer of the Week.\n",
            "length": "43251339",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2016/otp-211.mp3"
        },
        {
            "title": "210: I’m Over Here in Sharpshooter’s Corner",
            "datePublished": "Tue, 03 May 2016 16:45:00 GMT",
            "description": "This week, after a quick teaser of next week’s show, we’re taking your questions and attempting to answer them. Topics range from gear to legacy to what makes a great photographer. We love doing these shows and if you didn’t get a question in this time, keep an eye out for the next one. Maurice Tabard is our Photographer of the Week.\n",
            "length": "55229581",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2016/otp-210.mp3"
        },
        {
            "title": "209: Oddly Fascinating",
            "datePublished": "Tue, 26 Apr 2016 17:15:00 GMT",
            "description": "This week, the unexpected passing of Prince has us starting the show discussing art from the perspective of both ownership and influence. We talk about priorities (artistic and otherwise) and to what degree our presence in the world allows us to experience the world. Plus, we discuss some of the differences between opinion and critique and how who you ask can be just as important as what. Alex Prager is our Photographer of the Week.\n",
            "length": "44987401",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2016/otp-209.mp3"
        },
        {
            "title": "208: Echoes of Memories",
            "datePublished": "Tue, 19 Apr 2016 16:45:00 GMT",
            "description": "This week, Happy Anniversary to us! We talk a bit about four years of On Taking Pictures, which leads to a discussion on the value of output. There’s the idea of getting better with practice, which we’ve talked about several times, but also the value of the body of work as an object, independent of anything else. We also talk about meanings we associate to objects and share a wonderful email from a listener called “The Mythology of Things” in which he works through some reasons that objects become more to us than their component parts. Also, is the Photo Renaissance over or are we in a New Golden Age of photography? Former Baltimore Sun photographer A. Aubrey Bodine is our Photographer of the Week.\n",
            "length": "47608703",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2016/otp-208.mp3"
        },
        {
            "title": "207: Emojis Don’t Count",
            "datePublished": "Tue, 12 Apr 2016 10:45:00 GMT",
            "description": "This week, we start out talking about how as our creative goals change, our gear needs often change along with them and how the concept of “good enough” is nothing if not fluid. Also, The Next Rembrandt has us wondering how connected to your work do you have to be for it still to be yours? Can machines create art? Or is the human experience a necessary and fundamental component to make art? John Minihan is our Photographer of the Week.\n",
            "length": "51254606",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2016/otp-207.mp3"
        },
        {
            "title": "206: It’s Hard to Juggle Slowly",
            "datePublished": "Tue, 05 Apr 2016 17:30:00 GMT",
            "description": "This week, are you a multitasker? Or is multitasking merely a buzzword to make us feel like we’re actually getting things done? A voicemail from a listener has us discussing our approaches to managing multiple projects. Also, it’s not always about the picture — story is still important, especially when you’re pitching ideas to magazines and editorial outlets. Plus, 30 years after Chernobyl, our fascination with abandoned places and a terrific Crit Wall entry from the G+ Group. Tim Walker is our Photographer of the Week.\n",
            "length": "44886596",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2016/otp-206.mp3"
        },
        {
            "title": "205: Somebody Has To Be A Dictator",
            "datePublished": "Tue, 29 Mar 2016 16:30:00 GMT",
            "description": "This week, Instagram’s change from a time-based feed to an algorithmic one has us discussing the value of platforms like Instagram, Facebook, Flickr, etc. as viable means of sharing work, especially when it’s got a commercial component to it. We also talk about flow states – those periods of creativity when time seems to stop — both from the standpoints of controlling when they happen and what to do when they don’t. Plus, how many memories do you need? We talk about the often overwhelming size of photo collections and some of the ways to manage them. We tackle a couple Crit Wall entries from listeners and Peter Goin is our Photographer of the Week.\n",
            "length": "44951120",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2016/otp-205.mp3"
        },
        {
            "title": "204: Dog Paddle Motion in the Air",
            "datePublished": "Tue, 22 Mar 2016 17:45:00 GMT",
            "description": "This week, we discuss what happens when you can no longer do what you love. What do you do if you can’t shake feeling that your best work is behind you? Malcolm McLaren’s son Joe Corré wants to burn his £5m collection of punk memorabilia.  Here’s a question for next week: Do collectors of art or cultural ephemera have a responsibility to keep it or is personal meaning (or the lack thereof) more important? Chime in at podcast@ontakingpictures.com. Barbara Crane is our Photographer of the Week.\n",
            "length": "49268011",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2016/otp-204.mp3"
        },
        {
            "title": "203: Shrimp et tu, Brute?",
            "datePublished": "Tue, 15 Mar 2016 17:00:00 GMT",
            "description": "This week, a follow up from a listener about our “what makes a professional?” discussion from last week, specifically the idea of professionalism in behavior vs gear/appearance, etc. We also talk a little about regional aesthetics in art and photography and wonder how much of the technical limitations or defects that seem important to people making the work matter to larger audiences. Plus, a few things to think about ahead of next week's show. Alen MacWeeney is our Photographer of the Week.\n",
            "length": "37027023",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2016/otp-203.mp3"
        },
        {
            "title": "202: Jeffery and Bill Meet the Swamp Monster",
            "datePublished": "Tue, 08 Mar 2016 20:30:00 GMT",
            "description": "This week, what does it mean to be a professional? Is it merely making a living from one’s endeavor or is there something else? Is photography something you need to do to achieve some greater sense of fulfillment, or is it simply a vocation? And is one more valid than the other? Also, we talk a bit about a new Van Gogh film that uses an oil painting for every frame. Ryszard Horowitz is our Photographer of the Week.\n",
            "length": "47256108",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2016/otp-202.mp3"
        },
        {
            "title": "201: No Such Thing as Never or Always",
            "datePublished": "Tue, 01 Mar 2016 18:30:00 GMT",
            "description": "This week, how digital technology helped Emmanuel Lubezki shape the natural light on The Revenant. Also, we discuss the often cryptic presentation of online tutorials and ask: “How do you learn something new?” Plus, letting what you know affect what do and how far you’re willing to push outside your comfort zone. Check the show notes for teases of next week’s show. Ernesto Bazan is our Photographer of the Week.\n",
            "length": "43017017",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2016/otp-201.mp3"
        },
        {
            "title": "200: Learn To Do It Without the Crutch",
            "datePublished": "Tue, 23 Feb 2016 17:30:00 GMT",
            "description": "This week, we’re discussing the good and the bad of habits—making them, breaking them and learning how to recognize when you may need one over the other. Also, a follow up on last week’s audiophile/photography discussion, particularly around street photography. Plus, we geek out a little over an interview with Photoshop Master Bert Monroy in which he talks about his massive 750,000 layer Photoshop illustration of Times Square. Robyn Beeche is our Photographer of the Week.\n",
            "length": "43820545",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2016/otp-200.mp3"
        },
        {
            "title": "199: Claustrophobia In All the Control",
            "datePublished": "Tue, 16 Feb 2016 17:15:00 GMT",
            "description": "Paris Photo LA is cancelled permanently and what that means to collectors and fans of photography. Where do you fall when it comes to awards and competitions? Are they worthwhile endeavors and potentially valuable experiences or simply distracting popularity contests? Also, we discuss an interesting connection between audiophiles and photographers and the suggestion that where you came to photography from has an influence on the type of work that you produce or are drawn to. Sebastiao Salgado is our Photographer of the Week.\n",
            "length": "42612225",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2016/otp-199.mp3"
        },
        {
            "title": "198: Ghost of Familiarity",
            "datePublished": "Tue, 09 Feb 2016 21:15:00 GMT",
            "description": "This week, we’re starting off with Cindy Crawford—she’s worked with some of the top photographers in the world and in her new book, Becoming, she shares what she’s learned from them. Also, we discuss the seesaw that is balances humility and confidence and how we may need to find a new struggle. Plus, technical details from Taylor Wessing and Instagram gives you more ways to share. Gilbert Garcin is our Photographer of the Week.\n",
            "length": "34892505",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2016/otp-198.mp3"
        },
        {
            "title": "197: House Elf of Genius",
            "datePublished": "Tue, 02 Feb 2016 19:00:00 GMT",
            "description": "This week, we talk a little about the recent Gregory Crewdson show at the Gagosian in NYC and how seeing a photograph in person can be vastly different than seeing it on a screen. Also, how you feel about meeting your heroes? Would you like a one-on-one, or do you prefer to keep them in your imagination? Plus, a trip to B&amp;H sparks a discussion around gear—both the limitations of it and the notion that regardless of how well a piece of gear works, there’s something to how it feels in your hand that impacts how you use it. Miles Aldridge is our Photographer of the Week.\n",
            "length": "43092446",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2016/otp-197.mp3"
        },
        {
            "title": "196: Mind-field of Obstacles",
            "datePublished": "Tue, 26 Jan 2016 17:30:00 GMT",
            "description": "This week, an experiment we proposed on the show a year ago yields some terrific results for a listener. Also, is the bigger problem getting beyond a plateau, or realizing that you’ve reached one in the first place? Plus, Instagram has grown beyond food photos and into a robust platform for discovery, particularly for photojournalism. Alfa Castaldi is our Photographer of the Week.\n",
            "length": "42180463",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2016/otp-196.mp3"
        },
        {
            "title": "195: Everybody’s Eating Oreos for Breakfast",
            "datePublished": "Tue, 19 Jan 2016 18:30:00 GMT",
            "description": "This week, is art just a shell game of semantics? Do the names and labels matter at all as long as you’re making mistakes, making work and moving forward? Why do we get so spun up over something so nebulous? Also, do you buy photobooks to enjoy, or simply to leave them shrink-wrapped on a shelf, hoping that they will appreciate in value? Are collectors screwing it up for the folks who want to enjoy the work? Plus, Tyler Shields is a genius...or is that just what he wants you to think? Richard Mosse is our Photographer of the Week.\n",
            "length": "42508641",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2016/otp-195.mp3"
        },
        {
            "title": "194: Asking for Real Estate",
            "datePublished": "Tue, 12 Jan 2016 17:00:00 GMT",
            "description": "This week, a discussion partially prompted by the passing of David Bowie on living your art. Does the work/art you create exist apart from you or is one an intrinsic part of the other? Also, a conversation with Gregory Crewdson about his new body of work. Plus, is there such a thing as “the perfect size” for printing and displaying your photos? How do you determine what’s too big or too small? Belgian photographer Marc Lagrange is our Photographer of the Week.\n",
            "length": "35216426",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2016/otp-194.mp3"
        },
        {
            "title": "193: Not Starting From Zero",
            "datePublished": "Tue, 05 Jan 2016 18:30:00 GMT",
            "description": "This week, we’re taking a look back on 2015 and discussing what worked, what didn’t and what we’d like our respective 2016s to look like. We’re also responding to a listener question around changes in the industry and what the career of a maker may look like moving forward. Plus, you asked for some of our favorite Lynda tutorials, so we’ve each picked our top three. Jing Huang is our first Photographer of the Week for 2016. Welcome to the new year everyone.\n",
            "length": "52576570",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2016/otp-193.mp3"
        },
        {
            "title": "192: Find Another Cliff",
            "datePublished": "Tue, 29 Dec 2015 16:45:00 GMT",
            "description": "For the last show of the year, we’re doing a Q&amp;A show and taking a stab at answering some of your questions. We can’t thank you enough for not only listening week in and week out, but also for helping to build a community of makers that we are both extremely proud of. We are very much looking forward to 2016 and can’t wait to see what all of you are up to. If you have ideas, comments or suggestions, or you just want to say hello, email us at podcast@ontakingpictures.com. Happy New Year everyone!\n",
            "length": "50168494",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2015/otp-192.mp3"
        },
        {
            "title": "191: Gardiner Used All the Saturation",
            "datePublished": "Tue, 22 Dec 2015 17:45:00 GMT",
            "description": "This week, is boring art bad? Then again, who is to say whether any art is either good or bad? That said, do we miss part of the conversation if we don’t “get” a piece of art from the start? Or, should expecting to connect aesthetically to a particular piece or  body of work be enough? Also, is there such thing as taking a perfect photograph and would you try 720,000 times to take it? Plus, we discuss a couple of your Crit Wall entries. Arthur Meyerson is our Photographer of the Week.\n",
            "length": "43248567",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2015/otp-191.mp3"
        },
        {
            "title": "190: One Big Bundle of Bias",
            "datePublished": "Tue, 15 Dec 2015 17:45:00 GMT",
            "description": "This week, we’re discussing a letter from a listener who offers observations on the intellectualizing of modern art and how we tend to find it difficult to relate when we look at it emotionally. Also, another letter from a listener sparks a discussion around what to do when a shoot (or a project) doesn’t turn out the way you wanted it to and how we gauge success or failure. Next week, we’re looking at an NPR article that asks whether or not it’s bad if art is boring. Check the show notes. Roy DeCarava is our Photographer of the Week.\n",
            "length": "40504236",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2015/otp-190.mp3"
        },
        {
            "title": "189: An Analytical Gamble",
            "datePublished": "Tue, 08 Dec 2015 17:45:00 GMT",
            "description": "This week, we discuss what to do when you feel like you’ve said all you want to (or can) say creatively, including some recent examples of creators who have decided to make dramatic changes to both what and how they create. Also, TIME has updated their contracts, which looks to have a dramatic affect on how freelance photographers are able to monetize their work. Plus, David Bowie has a new album and video that’s full of cultural references and surreal imagery...and isn’t that exactly what we’ve come to expect? Kevin Russ is our Photographer of the Week.\n",
            "length": "47248424",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2015/otp-189.mp3"
        },
        {
            "title": "188: A Facsimile of a Facsimile",
            "datePublished": "Tue, 01 Dec 2015 17:30:00 GMT",
            "description": "This week, we discuss a terrific NPR article on how people prefer to consume and contextualize information. It may offer some insights into how we as creators present our own work and how and to what degree a given audience may respond. Also, what do you do when what’s popular isn’t the way you see? Do you try to bend your own aesthetic to fit in, or stay in the familiar and let them come to you? Plus, we tease up a few items for next week, so be sure to check the show notes. John Chiara is our Photographer of the Week.\n",
            "length": "41620192",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2015/otp-188.mp3"
        },
        {
            "title": "187: A Cultivated Fantasy",
            "datePublished": "Tue, 24 Nov 2015 16:15:00 GMT",
            "description": "This week, we’re talking about leaps—not leaps of faith, but rather those unconscious leaps in process, technique or vision that serve as lines of demarcation for the work that came before and after them. Also, a listener writes in for advice about how to position the services he offers. Plus, a couple Crit Wall selections and a teaser for next week’s show around the stages of an artist’s life and career. Brigitte Lacombe is our Photographer of the Week.\n",
            "length": "36140531",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2015/otp-187.mp3"
        },
        {
            "title": "186: Little Blips of Satisfaction",
            "datePublished": "Tue, 17 Nov 2015 17:00:00 GMT",
            "description": "This week, we begin with a warm thank you to everyone who made it out to the DC meetup.  It was really terrific to get to meet you all and we will definitely be doing more of these. The big discussion centers around a question from a listener who asked whether talking so much affects the doing—and both the quality and quantity of what we actually are able to ship. Also, giving yourself permission to fail. Icelandic shooter, Ragnar Axelsson is our Photographer of the Week.\n",
            "length": "39666443",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2015/otp-186.mp3"
        },
        {
            "title": "185: What Keeps You Falling Back Into It?",
            "datePublished": "Tue, 10 Nov 2015 17:00:00 GMT",
            "description": "This week, the dangers of letting yourself become defined by what you produce or how much (or how little) it is worth. Also, you can’t make iconic work, but you might be able to make it good. The problem is, is good good enough? Plus, Instagram as a platform for buying and selling art. Ben Thomas is our Photographer of the Week.\n",
            "length": "35930523",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2015/otp-185.mp3"
        },
        {
            "title": "184: A Somewhat Liberal Political Predilection",
            "datePublished": "Tue, 03 Nov 2015 17:30:00 GMT",
            "description": "This week, do creatives always have a responsibility to practice their craft? Or, should we get to choose when and how we let inspiration move us into action? Also, do you work better alone, or when surrounded by others who may be on a similar creative journey? Plus, we discuss a couple photography-related iOS apps and a terrific Kickstarter photobook project that uses a unique printing method to beautifully complement the theme of the subject matter. Michael Borek is our Photographer of the Week.\n",
            "length": "38962613",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2015/otp-184.mp3"
        },
        {
            "title": "183: We’re Playing It Blue Today",
            "datePublished": "Tue, 27 Oct 2015 10:00:00 GMT",
            "description": "This week, Bill is on his honeymoon in Europe, so we’re doing another Q&amp;A show that we actually recorded last week before he left. Ironically, we did the show on Back to the Future Day, which means that while we were recording it for the future, you’re really listening to it in the past. Science!\n",
            "length": "49218504",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2015/otp-183.mp3"
        },
        {
            "title": "182: Trading on the Hype",
            "datePublished": "Tue, 20 Oct 2015 16:30:00 GMT",
            "description": "This week, we start with a terrific discussion around self-promotion. How do you decide how to best represent yourself and to whom? Is there a difference between the “personal” you and your public brand? Should there be? Also, some final thoughts on the discussions around Magic Lessons. In two weeks, we’re talking about truth and ethics in photojournalism, so check the show notes for the link. Tabitha Soren is our Photographer of the Week.\n",
            "length": "45362591",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2015/otp-182.mp3"
        },
        {
            "title": "181: You’re Gonna Get Paid, Son",
            "datePublished": "Tue, 13 Oct 2015 18:00:00 GMT",
            "description": "This week, we continue our platform discussion from last week and expand on it into areas of reach and archiving. Do you look at your website as long term storage of ideas or a snapshot of where you are in the moment? Also, an interesting story around whether art is personal property or a ward of the state. The Elizabeth Gilbert discussion has been moved until next week. Check the link in the show notes so you can follow along. Tatiana Gulenkina is our Photographer of the Week.\n",
            "length": "42214583",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2015/otp-181.mp3"
        },
        {
            "title": "180: Holding a Leica, In Her Underwear",
            "datePublished": "Tue, 06 Oct 2015 16:45:00 GMT",
            "description": "This week, we’re talking about influences, using the terrific Keith Richards Netflix documentary Under the Influence as a starting point. How do we want to be influenced and to what extent should we allow our work (or art) to change because of it? Too little and the influence may be wasted. Too much and the work may cease to be our own — and ultimately less authentic. We also talk about art as a vehicle for moving us towards attentiveness, as explained wonderfully by Milton Glaser. Plus, we’ve got some links that we will be discussing next week about inspiration and what we could or should expect from it. Conceptual photographer Daisuke Yokota is our Photographer of the Week.\n",
            "length": "58908930",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2015/otp-180.mp3"
        },
        {
            "title": "179: The Timeline of that Osmosis",
            "datePublished": "Tue, 29 Sep 2015 16:15:00 GMT",
            "description": "This week, we talk a little about the iPhone 6s and the iPhone’s impact on photography for both amateurs and professionals. Also, we discuss the Bruce Gilden photos that have been making the rounds lately from his recently released book, Face. Should intent be a factor in viewing or appreciating photography, or is it all about the end product? Also, a few teasers for next week, when we'll be discussing influence and the question of whether or not something is art, simply because it moves you to attentiveness. Linden Gledhill is our Photographer of the Week.\n",
            "length": "57757725",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2015/otp-179.mp3"
        },
        {
            "title": "178: Circles for Sixty Years",
            "datePublished": "Tue, 22 Sep 2015 00:00:00 GMT",
            "description": "This week, we’re back in our respective cities and begin with a bit of follow up on the discussion around tools and process started in last week’s “walk and talk” episode. We also ask ourselves and each other “what’s my creative hurdle or bottleneck?” Here’s a question for you listeners: How directly do the tools you use affect your final product? Can you ONLY get the results with a DSLR and “big lights”? Or would mirrorless and natural light be just as good? Hiroshi Sugimoto is our Photographer of the Week.\n",
            "length": "57158100",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2015/otp-178.mp3"
        },
        {
            "title": "177: The Reflection Isn't Perfecto",
            "datePublished": "Wed, 16 Sep 2015 23:00:00 GMT",
            "description": "This week, we’re going West Wing and doing a walk and talk LIVE from the National Mall in Washington DC. We’re talking about the connection between tools and process and their effect on the work we produce and we wonder whether it’s better to just keep using the tools that are familiar, rather than always chasing the latest pieces of kit. Since we are on the Mall, home to the many of the Smithsonian museums, our Photographer of the Week is the first photographer and curator of photography for the Smithsonian, Thomas Smillie.\n",
            "length": "39299645",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2015/otp-177.mp3"
        },
        {
            "title": "176: Creativity is a Line Item",
            "datePublished": "Tue, 08 Sep 2015 17:15:00 GMT",
            "description": "This week, are film shooters just better photographers? Also, we discuss a TIME article that suggests the idea that traditional photographs will soon become relics, out of time with the future of photography. Plus, a listener asks what we think of the classic “nifty fifty.” Pedro E. Guerrero is our Photographer of the Week.\n",
            "length": "60749646",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2015/otp-176.mp3"
        },
        {
            "title": "175: Very Little Time For the Present",
            "datePublished": "Tue, 01 Sep 2015 15:45:00 GMT",
            "description": "This week, we unpack some of the challenges around deciding that something is not art, just because you don’t agree with it or understand it. Does making art an “ism” stifle growth and innovation? Also, long before drones surveilled us, there were...pigeons? Plus, a tease of next week’s show, where we will be talking about what some believe to be the future of photography.  Ilse Bing is our Photographer of the Week.\n",
            "length": "51812069",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2015/otp-175.mp3"
        },
        {
            "title": "174: A Reality Distortion Field of Pixels",
            "datePublished": "Tue, 25 Aug 2015 16:15:00 GMT",
            "description": "This week, we talk a little about gear and the ongoing debate over megapixels, using the new Sony A7R II as an example. We also talk about film and why it’s ultimately pointless to keep having the “film v digital” discussions. Spoiler: they’re just different. Use what challenges you and gets you out taking pictures. Grete Stern is our Photographer of the Week.\n",
            "length": "62625028",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2015/otp-174.mp3"
        },
        {
            "title": "173: Where Do You Put the Chisel?",
            "datePublished": "Tue, 18 Aug 2015 19:30:00 GMT",
            "description": "This week, inspired by a recent NPR story, we talk about the idea of art as an experience, where the mechanics of viewing objects become almost more important than the objects themselves. We also discuss some of the opportunities that young people have today, with regard to the viewing and sharing of their experiences, that we simply didn’t have when we were growing up. Plus, with so many cameras on the market, how do you recommend one to a friend who just wants to take good pictures? Lee Friedlander is our Photographer of the Week.\n",
            "length": "57408002",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2015/otp-173.mp3"
        },
        {
            "title": "172: Creative Fiefdoms",
            "datePublished": "Tue, 11 Aug 2015 17:45:00 GMT",
            "description": "This week, on our first all east coast edition of the show, we’re taking a stab at answering some of your questions. You have asked some really great questions this time around - around process, gear, where we think art is going, even asking about some of our favorite things. Anuar Patjane is our Photographer of the Week.\n",
            "length": "66813389",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2015/otp-172.mp3"
        },
        {
            "title": "171: Big Subterranean Factor",
            "datePublished": "Tue, 04 Aug 2015 18:30:00 GMT",
            "description": "This week, we talk about the temporal nature of the things we make. Should they be preserved for the future or allowed to decay to a natural end, whatever that means? We also discuss transitions and how making the decision to leap can come from a variety of sources and happen for a variety of reasons, not the least of which is fear. Plus, an interesting looking trailer has emerged for a new biopic of Eadweard Muybridge. Lorena Lohr is our Photographer of the Week.\n",
            "length": "46079616",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2015/otp-171.mp3"
        },
        {
            "title": "170: We All Want To Be Steve McCurry",
            "datePublished": "Tue, 28 Jul 2015 18:45:00 GMT",
            "description": "This week, prompted by a member of the OTP G+ Community, we begin with a bit of follow up on the discussion from last week about the influence of Robert Frank. Also, there is no best, but there just might be a best for you. Plus, a terrific photographer that neither one of us had ever heard of. Pinup photographer Bunny Yeager is our Photographer of the Week.\n",
            "length": "52490840",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2015/otp-170.mp3"
        },
        {
            "title": "169: I’ll Make a Burger for the Next Guy",
            "datePublished": "Tue, 21 Jul 2015 18:45:00 GMT",
            "description": "This week, we’re discussing a recent New York Times article about Robert Frank, specifically the breadth of his influence on photography and the degree to which he either pursued or avoided fame and celebrity. We also discuss a few news items sent in by listeners, including an interesting piece about a new book by David Bailey which seems to be comprised mostly of mistakes from the darkroom. Rebecca Norris Webb is our Photographer of the Week.\n",
            "length": "54078872",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2015/otp-169.mp3"
        },
        {
            "title": "168: This Is Not How We Play Bridge",
            "datePublished": "Tue, 14 Jul 2015 18:00:00 GMT",
            "description": "This week, we geek out a little over the New Horizons images of Pluto. Think about this: it will take four months to receive all of the data from nearly 4 billion miles away. We also discuss Chris Arnade’s photos from Hunt’s Point and whether or not being a good person is unethical. Plus, can you sell out as an artist anymore? Magnum photographer Alex Webb is our Photographer of the Week.\n",
            "length": "54805076",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2015/otp-168.mp3"
        },
        {
            "title": "167: The Activity of Non-Activity",
            "datePublished": "Tue, 07 Jul 2015 19:00:00 GMT",
            "description": "This week, we talk about change and some of the things that means for photographers in a market that never seems to stop. How do you view your own work and are there ways that viewing it differently could lead in new or exciting directions? Also, an interesting discussion around the NY Times article we teased last week with Cindy Sherman and Laurie Simmons. Larry Sultan is our Photographer of the Week.\n",
            "length": "56789765",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2015/otp-167.mp3"
        },
        {
            "title": "166: Less Bill & Ted’s, More British",
            "datePublished": "Tue, 30 Jun 2015 19:15:00 GMT",
            "description": "This week, we discuss the TED talk we mentioned last week by Jimmy Nelson and how things aren’t always as they seem or as we want them to be. Also, we’re all making stuff and it’s okay to want it to be liked. Plus, generational changes in the art market: important or just theater? Rondal Partridge is our Photographer of the Week.\n",
            "length": "46667293",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2015/otp-166.mp3"
        },
        {
            "title": "165: Our Piece of Cheese Keeps Getting Smaller",
            "datePublished": "Tue, 23 Jun 2015 20:00:00 GMT",
            "description": "This week, an article sent in by a listener gets us discussing the idea of doing what you love. Is it a fantasy or can you really love doing something and still call it work? If everyone does only what they love, who does the work that nobody loves? Also, we talk a little about gear, including the allure of Petzval and Helios lenses and the new DxO One add-on camera for iPhone. Another suggestion from a listener is this week’s Photographer of the Week, cinematographer Christopher Doyle.\n",
            "length": "42685699",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2015/otp-165.mp3"
        },
        {
            "title": "164: Photographic Baseball Cards",
            "datePublished": "Tue, 16 Jun 2015 20:45:00 GMT",
            "description": "This week, where do the lines of completionism, perfectionism and obsession intersect? Can you be one and not the other? Also, we talk about compromise—what can come out of it and how much is too much. Plus, we chime in on a couple entries from the Crit Wall. Stan Douglas is our Photographer of the Week.\n",
            "length": "47581596",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2015/otp-164.mp3"
        },
        {
            "title": "163: A Generational Byproduct",
            "datePublished": "Tue, 09 Jun 2015 18:15:00 GMT",
            "description": "This week, do the memories imprinted on us in our youth define the experiences of maturity? Are we somehow aesthetically tethered to our past? Also, visiting a museum with the co-curator of the show is a good thing.  \"The photographer of Paris par excellence,\" Willy Ronis is our Photographer of the Week.\n",
            "length": "46633942",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2015/otp-163.mp3"
        },
        {
            "title": "162: I Grow Chickens, The Chickens Lay the Eggs",
            "datePublished": "Tue, 02 Jun 2015 18:00:00 GMT",
            "description": "This week, a brief follow up on the Atlantic article about creative entrepreneurs. Also, how a single photograph (in this case, a magazine cover) can still be a cultural watershed moment. Plus, a clever response to the recent Richard Prince fiasco. Masataka Nakano is our Photographer of the Week.\n",
            "length": "45029215",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2015/otp-162.mp3"
        },
        {
            "title": "161: It’s Not Patrons, It’s Patronizing",
            "datePublished": "Tue, 26 May 2015 18:15:00 GMT",
            "description": "This week, we discuss an article from the Atlantic on the changing role of the artist and the rise of “creative entrepreneurs.” Have you ever thought about taking a year off? We talk about Stefan Sagmeister’s creative sabbaticals. Also, get ready for Mad Max Fury Road in black and white. Jacques Henri Lartigue is our Photographer of the Week.\n",
            "length": "37356935",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2015/otp-161.mp3"
        },
        {
            "title": "160: Each Generation Forgets",
            "datePublished": "Tue, 19 May 2015 19:15:00 GMT",
            "description": "This week, we do some follow up on last week’s show, including a bit about chasing perfection, happiness, normality, etc. We also discuss the Radiolab episode we mentioned last week involving the photojournalist and the fallen soldier and who should have the say over viewing the resulting photographs. Music photographer Gregory Nolan is our Photographer of the Week.\n",
            "length": "36256518",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2015/otp-160.mp3"
        },
        {
            "title": "159: It’s a Crowded Place, My Head",
            "datePublished": "Tue, 12 May 2015 18:45:00 GMT",
            "description": "This week’s discussion goes a little off the reservation. Should the idea of making a living from your creative endeavors factor into whether or not you pursue them? How do you decide between should and must?  Also, it’s hard to live in the present when you can’t stop worrying about the future. Instagram photographer Last Suspect is our Photographer of the Week.\n",
            "length": "35695194",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2015/otp-159.mp3"
        },
        {
            "title": "158: The Mayor of Fujitown",
            "datePublished": "Tue, 05 May 2015 17:15:00 GMT",
            "description": "This week, standout work from last weekend’s Paris Photo LA and some observations on the growing trend of really big prints and really banal subject matter. Also, abstraction and alternative processes in mainstream photography. Plus, a revision on the “through the window” debacle from a few weeks ago. Scottish photographer Bill Anderson is our PotW.\n",
            "length": "37900559",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2015/otp-158.mp3"
        },
        {
            "title": "157: The Cossacks of Organization",
            "datePublished": "Tue, 28 Apr 2015 18:30:00 GMT",
            "description": "This week, we’re testing Mixlr for doing live episodes of OTP. We begin the first episode of Year Four (can you believe it?) with an email from a listener talking about the relative value of “formal” groups and associations with regard to photography and the visual arts. Does belonging to an “official” group, such as ASMP help your career? If so, how? Also, we discuss an interesting article talking about the differences between fact and fiction in photojournalism and how the new storytelling is driving what direction the genre is taking. Landscape and architectural photographer Franco Fontana is our Photographer of the Week.\n",
            "length": "31380611",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2015/otp-157.mp3"
        },
        {
            "title": "156: The Great Men Theory of Art",
            "datePublished": "Tue, 21 Apr 2015 18:15:00 GMT",
            "description": "This week marks the end of three years of bringing you OTP every week. We start out the episode discussing your poll responses to last week’s court ruling around photography and privacy. We also talk about the DUFFY documentary and wonder about impact and legacy. Who are your most iconic photographers? Plus, a discussion around the recent Sally Mann essay in the New York Times magazine. Christopher Marley is our Photographer of the Week.\n",
            "length": "33791608",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2015/otp-156.mp3"
        },
        {
            "title": "155: It’s All a Barometer",
            "datePublished": "Tue, 14 Apr 2015 16:45:00 GMT",
            "description": "This week, we discuss a recent ruling around privacy and art—what that could mean to you not only as a photographer, but also as a citizen. Also, we attempt to weigh in on some ideas around content vs. curation, using a recent MoMA show as an example. Plus, a link to a fantastic documentary that we’ll be discussing in next week’s show. Pentti Sammallahti is our Photographer of the Week.\n",
            "length": "37343465",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2015/otp-155.mp3"
        },
        {
            "title": "154: 500k Followers or 100 Followers",
            "datePublished": "Tue, 07 Apr 2015 17:00:00 GMT",
            "description": "This week, we’re talking footprints...social footprints and how, for some types of photography, being a good (or even great) photographer is no longer enough. It’s also about how many eyes you bring along with you. Bill shares his recent experience judging selections for a camera club in NYC. Joni Sternbach is our Photographer of the Week.\n",
            "length": "38799599",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2015/otp-154.mp3"
        },
        {
            "title": "153: The Community Is Getting Inside My Head",
            "datePublished": "Tue, 31 Mar 2015 17:30:00 GMT",
            "description": "This week, we talk a bit about the democratization of photography vs demonetization, not from the point of view of making money but from simply making pictures. Also, how can social media impact photography as an individual pursuit? When did photography become a social activity? Francesca Woodman is our Photographer of the Week.\n",
            "length": "46219400",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2015/otp-153.mp3"
        },
        {
            "title": "152: The Stone is Noise",
            "datePublished": "Tue, 24 Mar 2015 18:00:00 GMT",
            "description": "This week, a question sent in for last week’s Q&amp;A show around deciding how to know when something just isn’t working sparks a terrific discussion on purpose, intent, cutting through the noise and even throwing in the towel. We also talk about how to give your own work value, when value is so subjective. Harold \"Doc\" Edgerton and Gjon Mili are our first dual Photographers of the Week.\n",
            "length": "35627485",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2015/otp-152.mp3"
        },
        {
            "title": "151: Perfectly Punctuated Piece On Absolutely Nothing",
            "datePublished": "Tue, 17 Mar 2015 17:45:00 GMT",
            "description": "It’s Q&amp;A time and we do our best to answer the questions you’ve sent in. We got a ton of great questions this time about gear, process, business and even a few that were too big to tackle, so we’ll get them in the mix for larger discussions next week. William Albert Allard is our Photographer of the Week.\n",
            "length": "47191610",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2015/otp-151.mp3"
        },
        {
            "title": "150: Who’s Pressing the Brakes",
            "datePublished": "Tue, 10 Mar 2015 17:00:00 GMT",
            "description": "This week, a memo written by David Mamet sparks a discussion around the meaning and importance we give the things we make. Also a follow up on the Norman Seef video and how, for some photographers, the connection with the subject is the point and the photographs are merely a byproduct of the experience. Leonard Freed is our Photographer of the Week.\n",
            "length": "34191645",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2015/otp-150.mp3"
        },
        {
            "title": "149: It’s a Little Bit of a Ghost",
            "datePublished": "Tue, 03 Mar 2015 18:45:00 GMT",
            "description": "This week, what a difference a week makes. We begin with some followup to last week’s show and discuss expectation, process vs product and how for some (me) Artist is not the same as artist. Also, iconic photographers don’t always make iconic photographs. Plus, we reflect a bit on the life of Leonard Nimoy both as an actor and as our Photographer of the Week.\n",
            "length": "40747550",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2015/otp-149.mp3"
        },
        {
            "title": "148: Idle Hands Problem",
            "datePublished": "Tue, 24 Feb 2015 18:15:00 GMT",
            "description": "This week, what do you do when the motivation just isn't there? We may love what we do, but sometimes it’s hard to hold on to whether loving the process is enough. Also, are the rich kids taking over the arts? Photojournalist Melissa Lyttle is our Photographer of the Week.\n",
            "length": "41103586",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2015/otp-148.mp3"
        },
        {
            "title": "147: Artistic Post-It Note",
            "datePublished": "Tue, 17 Feb 2015 18:00:00 GMT",
            "description": "This week, should there be standards defining what is and isn’t considered photojournalism? Plus, are labels important, necessary or just noise? We also take a look at a potential alternative to Photoshop, the new Affinity Photo. Spencer Tunick is our Photographer of the Week.\n",
            "length": "43813427",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2015/otp-147.mp3"
        },
        {
            "title": "146: Pattern Recognition Machine",
            "datePublished": "Tue, 10 Feb 2015 18:45:00 GMT",
            "description": "This week, we’re going deep into discussing the power of a single photograph. Social or emotional impact notwithstanding, are photographs (or art for that matter) better with additional context? Also, you’ll never believe what Carol Armstrong found in her closet. Iconic sports shooter Neil Leifer is our Photographer of the Week.\n",
            "length": "38789564",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2015/otp-146.mp3"
        },
        {
            "title": "145: Priceless Gets A Price",
            "datePublished": "Tue, 03 Feb 2015 17:15:00 GMT",
            "description": "This week, a bunch of recent articles around use and copyright have us discussing “Who really owns what, and for how long?” Also, should art be enjoyed or merely collected? Bill may have found the perfect camera...for him. Louise Dahl-Wolfe is our Photographer of the Week.\n",
            "length": "36469467",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2015/otp-145.mp3"
        },
        {
            "title": "144: Ronin Photographers",
            "datePublished": "Tue, 27 Jan 2015 17:45:00 GMT",
            "description": "This week, a domestic worker wins a Magnum Fellowship, two Magnum icons try Google Glass and we discuss entertainment before the word “format.” Also, we discuss what happens when you stop trusting your gear? “Small Town Inertia” shooter Jim Mortram is our Photographer of the Week.\n",
            "length": "35301477",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2015/otp-144.mp3"
        },
        {
            "title": "143: Set For Life",
            "datePublished": "Tue, 20 Jan 2015 17:45:00 GMT",
            "description": "This week, a conversation overheard on the train sparks a discussion around the need to create or not and whether we would trade a creative life (whatever that means)  for a nine to five if we could. Also, is your personal value in the experience of making or in the resulting artifact/object? Obscure Romanian shooter Andre Pandele is our Photographer of the Week.\n",
            "length": "52212977",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2015/otp-143.mp3"
        },
        {
            "title": "142: Time Capsule Effect",
            "datePublished": "Tue, 13 Jan 2015 20:30:00 GMT",
            "description": "This week, a few shorter discussions around work for hire vs licensing your work, work that becomes relevant years after it was produced and whether or not your work should continue after you are no longer the one producing it. Deborah Parkin is our Photographer of the Week.\n",
            "length": "40997425",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2015/otp-142.mp3"
        },
        {
            "title": "141: Frayved Peegan",
            "datePublished": "Wed, 07 Jan 2015 18:00:00 GMT",
            "description": "Welcome to 2015! In this week’s show, we talk about how sometimes doing the right thing doesn’t get you very far and how copyright and the web still has a long way to go. Also, a terrific email from a listener raises the question “What would you do?” Portland based shooter Delaney Allen is our Photographer of the Week.\n",
            "length": "37613414",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2015/otp-141.mp3"
        },
        {
            "title": "140: An Official Knock-off",
            "datePublished": "Wed, 31 Dec 2014 01:00:00 GMT",
            "description": "We’re finishing off 2014 with one last listener Q&amp;A show. But first, we’re talking about the idea of planned obsolescence. Is current gear as good as it was 20 years ago? Is anything? Then, Bill’s trip to a recent Saul Leiter show in NYC sparks some discussion around the idea of posthumous artist foundations and legacy. User submitted photojournalist Matt Black is our Photographer of the Week.\n",
            "length": "47437552",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2014/otp-140.mp3"
        },
        {
            "title": "139: Nothing But A Mirror",
            "datePublished": "Tue, 23 Dec 2014 18:00:00 GMT",
            "description": "This week, we discuss a documentary on last week’s Photographer of the Week, Jane Bown, who recently passed away at 89. Can photography be “just” a job and still be important? Or do we have to approach it as art (whatever that means to you)  for it to have any sort of deeper meaning? Pioneer of early motion studies, Eadweard Muybridge is our Photographer of the Week.\n",
            "length": "45069603",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2014/otp-139.mp3"
        },
        {
            "title": "138: A Little Obsessive That Way",
            "datePublished": "Tue, 16 Dec 2014 18:15:00 GMT",
            "description": "This week, does “most expensive” always equate to best? SPOILER: No. Also, does finding an emotional connection to photographs (or any creative endeavor) mean finding an anchor you can relate to from your own life experience or can art have meaning in a vacuum? Plus, a terrific video series from the George Eastman House. Jane Bown is our Photographer of the Week.\n",
            "length": "41869505",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2014/otp-138.mp3"
        },
        {
            "title": "137: Good is a Moving Target",
            "datePublished": "Tue, 09 Dec 2014 17:30:00 GMT",
            "description": "This week, what makes a “good” photograph (or painting, sculpture, film, etc.)? Are there checkboxes that need to be hit or is good something more intangible, more ephemeral - maybe even exclusively personal? Also, once you do make something good, what do you charge for it? Where does value come from? Arthur Leipzig is our Photographer of the Week.\n",
            "length": "46701528",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2014/otp-137.mp3"
        },
        {
            "title": "136: Destiny or Resignation",
            "datePublished": "Tue, 02 Dec 2014 19:15:00 GMT",
            "description": "This week, we’re talking about the friction of creativity, getting out of your own way and how often the only way out is through. Also, finding help with the work that isn’t in your wheelhouse and using process to overcome technical limitations. Anne Geddes is our Photographer of the Week.\n",
            "length": "45725592",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2014/otp-136.mp3"
        },
        {
            "title": "135: No Touchdowns In Photography",
            "datePublished": "Tue, 25 Nov 2014 18:00:00 GMT",
            "description": "This week, Inspired by an email exchange Bill and I had with a listener, we ask each other as well as all of you: “What makes a good photographer?” Is it the work? Is it ONLY the work? Or is making interesting (read: good) work merely a byproduct of being an interesting person? Can you even separate the person from the work? Plus, Sohei Nishino is our Photographer of the Week.\n",
            "length": "45893617",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2014/otp-135.mp3"
        },
        {
            "title": "134: A Couple Dozen Eye Rolls",
            "datePublished": "Tue, 18 Nov 2014 17:30:00 GMT",
            "description": "This week, a discussion around a documentary about Polaroid, called Time Zero, gets us wondering about objects versus process and whether there is more intrinsic value in the artifact or the content. We also look at a few “link-baity” news items around the value of photography as art. Carrie Mae Weems is our Photographer of the Week.\n",
            "length": "40589502",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2014/otp-134.mp3"
        },
        {
            "title": "133: No Way Out But Through",
            "datePublished": "Tue, 11 Nov 2014 16:45:00 GMT",
            "description": "This week, are you an artist or an entrepreneur? While on the surface they may seem similar, each offers a unique set of challenges that often require very different approaches to overcome. It’s an important question that many of us wrestle with as we try to find a balance between creating art and producing product. Guatemalan shooter Luis Gonzalez Palma is our Photographer of the Week.\n",
            "length": "34383433",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2014/otp-133.mp3"
        },
        {
            "title": "132: Some Kind Of Sublimation",
            "datePublished": "Thu, 06 Nov 2014 17:15:00 GMT",
            "description": "This week, a wrap up of our terrific OTP meetup in Philly sparks an interesting discussion. Should art - both the making and the viewing - be a privilege or a right, regardless of ethnicity or economic standing? Are humans better with a healthy serving of art and culture in their diets? Also, is there such thing as too much art? Fascinating installation artist Chris Engman is our Photographer of the Week.\n",
            "length": "41999488",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2014/otp-132.mp3"
        },
        {
            "title": "131: Fuddy Duddy Hall of Fame",
            "datePublished": "Tue, 28 Oct 2014 18:45:00 GMT",
            "description": "This week, is your image your own? Should photographers be able to use photographs of you without your permission - or even your knowledge? Also, an interesting discussion around when the idea for a project is more interesting than the execution. Plus, pricing and what freelance photographers can expect to make. Miller Mobley is our Photographer of the Week.\n",
            "length": "55511481",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2014/otp-131.mp3"
        },
        {
            "title": "130: So Many Topics, So Little Time",
            "datePublished": "Tue, 21 Oct 2014 10:30:00 GMT",
            "description": "This week, we turn the show over to you, the listeners. It’s not so much a Q&amp;A show as it is taking deeper look at previous topics that you’ve written in about. Topics include sources of inspiration, whether video is a “must”, how to improve, what not to shoot, the future of photography and even our favorite photos. Plus, you get to hear us botch the pronunciation of J.D. 'Okhai Ojeikere, our Photographer of the Week.\n",
            "length": "47537662",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2014/otp-130.mp3"
        },
        {
            "title": "129: Shake Some Streusel For Your Homie",
            "datePublished": "Tue, 14 Oct 2014 17:30:00 GMT",
            "description": "This week, with such great gear at our disposal, why does Program mode get such a bad wrap? Also should you be take a more serious look at Instagram as a delivery platform for your work? Pulitzer prize winning photojournalist Tyler Hicks is our Photographer of the week.\n",
            "length": "47505483",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2014/otp-129.mp3"
        },
        {
            "title": "128: A Baked Aesthetic",
            "datePublished": "Tue, 07 Oct 2014 17:00:00 GMT",
            "description": "This week, we begin with a listener question around passion and purpose. What drives the “why” behind your work? Should public perception/reception play a role in what or why you create or should accolades be merely a byproduct? Nicholas Nixon is our Photographer of the Week.\n",
            "length": "51724549",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2014/otp-128.mp3"
        },
        {
            "title": "127: The Rabbit Always Moves",
            "datePublished": "Tue, 30 Sep 2014 16:30:00 GMT",
            "description": "This week, we try to tackle more of your questions and there are some terrific ones. Topics are all over the map and provide a great deal to think about not only for photography, but for anyone trying to make things and live a creative life. Photojournalist Ami Vitale is our Photographer of the Week.\n",
            "length": "58884608",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2014/otp-127.mp3"
        },
        {
            "title": "126: Flying Trapeze",
            "datePublished": "Tue, 23 Sep 2014 16:45:00 GMT",
            "description": "This week, we talk about leaping into the unknown and how empowering it can be to make the transition from “whether to move” into “how to move.” Also, how much editorial control would you give up for money? Monster celebrity shooter Sam Jones is our Photographer of the Week.\n",
            "length": "51656425",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2014/otp-126.mp3"
        },
        {
            "title": "125: Creative Swagger",
            "datePublished": "Tue, 16 Sep 2014 17:45:00 GMT",
            "description": "This week, we wrestle with confidence, momentum and the differences between passion and curiosity. We also talk about finding the stuff that fills your cup, regardless of whether or not it happens to be your full time job. He documented WWI and was aboard the Endurance - Frank Hurley is our Photographer of the Week.\n",
            "length": "59427124",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2014/otp-125.mp3"
        },
        {
            "title": "124: Just Another Point on the Curve",
            "datePublished": "Tue, 09 Sep 2014 19:15:00 GMT",
            "description": "This week, we talk about when to begin and when it might be time to throw in the towel and move on to something else. Also, we discuss Seth Godin’s idea of living somewhere between comfort and danger and ask, “where do you live?” User-suggested Jon Wyatt is our Photographer of the Week.\n",
            "length": "57111787",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2014/otp-124.mp3"
        },
        {
            "title": "123: The Weegee of the Modern World Doesn’t Exist",
            "datePublished": "Tue, 02 Sep 2014 19:30:00 GMT",
            "description": "This week, we discuss the terrific documentary on the life and work of Dorothea Lange. Topics include getting lost in your work and questions like is art an act of total attention? Also, Bill raises the question of whether models should have a say as to how they are treated in post. Howard Schatz is our Photographer of the Week.\n",
            "length": "52537164",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2014/otp-123.mp3"
        },
        {
            "title": "122: Disrupting the Familiar",
            "datePublished": "Tue, 26 Aug 2014 17:00:00 GMT",
            "description": "If this week’s show has a theme, it’s change. Try as you might, you can’t avoid it forever and even if you could, sometimes it’s exactly what you need. We also discuss censorship and intent in a couple recent news articles. David Bailey is our Photographer of the week.\n",
            "length": "53656995",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2014/otp-122.mp3"
        },
        {
            "title": "121: Not Enough Room For Romance",
            "datePublished": "Tue, 19 Aug 2014 18:15:00 GMT",
            "description": "Do you find yourself looking for signs? Not Stop or Yield, but signs from God, the Universe, or what have you telling you what to do? This week, we talk about signs and how waiting for them can often be an excuse for not taking action. We also talk about memories, specifically how bad humans are at remembering details and how photographs can uncover or even rewrite what you previously believed to be the truth. Plus, fantastic fashion photographer Elizaveta Porodina is our Photographer of the Week.\n",
            "length": "50760960",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2014/otp-121.mp3"
        },
        {
            "title": "120: You’re Not Moving Cannonballs",
            "datePublished": "Tue, 12 Aug 2014 17:45:00 GMT",
            "description": "This week’s show is a bit of a monster. We do our best to answer your questions and there were tons of them - some on gear, others on process and technique. There’s a little something for everyone, but you had best grab a bottle of water and some snacks ‘cause this one clocks in at over two hours. Michel Tcherevkoff is our Photographer of the Week.\n",
            "length": "67977176",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2014/otp-120.mp3"
        },
        {
            "title": "119: Glacial Evolution",
            "datePublished": "Tue, 05 Aug 2014 17:45:00 GMT",
            "description": "This week, for some people making lists and setting goals are the only way to feel like progress is being made. For others, “goal” is just a four letter word. How do you gauge your creative progress? Inspired by last week’s discussion, paparazzi photographer Ron Galella is our Photographer of the Week.\n",
            "length": "55801120",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2014/otp-119.mp3"
        },
        {
            "title": "118: Savings Bond of Memories",
            "datePublished": "Tue, 29 Jul 2014 21:45:00 GMT",
            "description": "This week, we talk about photographs as a sort of time machine and how often embarrassing snapshots over time become the things you treasure most. Also, should the arts be co-opted by academia or is getting out and doing the work the way to go? How would you feel being famous for only shooting one person? It’s something we discuss around our Photographer of the Week, Milton Greene.\n",
            "length": "50505167",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2014/otp-118.mp3"
        },
        {
            "title": "117: Reset The Mechanism",
            "datePublished": "Tue, 22 Jul 2014 17:00:00 GMT",
            "description": "This week, using Garry Winogrand’s current retrospective as an example, we discuss what happens when practice means different, not necessarily better. Also, in a submission from a listener, we look at a list of 10 ways we may be making our lives harder than they have to be. How many are you guilty of? Plus, Magnum photographer Gueorgui Pinkhassov is our Photographer of the Week.\n",
            "length": "48382973",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2014/otp-117.mp3"
        },
        {
            "title": "116: Freefalling",
            "datePublished": "Tue, 15 Jul 2014 17:45:00 GMT",
            "description": "This week, we begin with a follow up to last week’s discussion about direction and confidence (or lack thereof, as the case may be). All you really control is when you begin and when you ship. Recognizing those things that truly are beyond your control (and letting go of them) can be liberating and just the fuel you need to move forward. Todd Hido is our Photographer of the Week.\n",
            "length": "48933627",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2014/otp-116.mp3"
        },
        {
            "title": "115: Doing It For Love Not Money",
            "datePublished": "Tue, 08 Jul 2014 18:30:00 GMT",
            "description": "This week, interviews with Bob Dylan and Frank Zappa beg the question, is there such a thing as being past your creative prime? Also, where do the great ideas come from and what do you do when they stop? Daido Moriyama is our Photographer of the Week.\n",
            "length": "52022988",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2014/otp-115.mp3"
        },
        {
            "title": "114: Creativity On A Wire",
            "datePublished": "Tue, 01 Jul 2014 17:00:00 GMT",
            "description": "This week, we’re discussing the difficulties in making decisions - creative or otherwise - without first knowing the outcome. Also, beyond likes and hit counters, what’s the real value in going viral? Plus, Apple’s recent announcement about the future of Aperture has us musing on our reliance on software and what to do when the tool(s) you love are no longer available. Conceptual fine art photographer Brooke Shaden is our Photographer of the Week.\n",
            "length": "47111125",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2014/otp-114.mp3"
        },
        {
            "title": "113: A Day Late & A Dollar Short",
            "datePublished": "Wed, 25 Jun 2014 19:00:00 GMT",
            "description": "This week, we begin with a discussion about gear - specifically how newer crop-sensor cameras compare to full frame and why more megapixels leads to bigger, but not always better images. Plus Tom Cruise as a metaphor for refining yourself away from a borrowed life. This week we’ve got two Photographers of the Week - Robb Kendrick and David Stoecklein - both shoot similar subject matter, yet their results are at opposite ends of the spectrum.\n",
            "length": "44757536",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2014/otp-113.mp3"
        },
        {
            "title": "112: You Wanted A Do-Over",
            "datePublished": "Tue, 17 Jun 2014 16:45:00 GMT",
            "description": "This week, what happens when creativity doesn’t go the way you want it to? Sometimes there’s “good enough,” while other times, you get the opportunity to take another pass at it. How do you know when to choose one over the other?  Also, we talk about fear as not only an obstacle, but also as a motivator to get you “living above the 45.” Randy Scott Slavin is our Photographer of the Week. Oh, and happy 71st birthday to The Man Who Writes the Songs (even though he didn’t write that one), Barry Manilow.\n",
            "length": "47893962",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2014/otp-112.mp3"
        },
        {
            "title": "111: Desert Island Book Choices",
            "datePublished": "Tue, 10 Jun 2014 19:30:00 GMT",
            "description": "This week, you’ve got questions and we do our best to answer them on topics ranging from choosing to shoot in color or black &amp; white and best practices for deliverables to getting your work in front of art buyers and whether or not a signature “look” to your work is important. Someone even asked for our desert island book choices. Listener-suggested Australian Magnum photographer Trent Parke is our Photographer of the Week.\n",
            "length": "56935052",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2014/otp-111.mp3"
        },
        {
            "title": "110: The ‘Why’ is Much More Interesting",
            "datePublished": "Tue, 03 Jun 2014 16:15:00 GMT",
            "description": "This week, Bill’s recent viewing of Tim’s Vermeer inspires a discussion around the technical nature of creating art. If we allow the process to be augmented by technology, at what point is the art in the making and not in the end result? Also, we discuss an interview with Cartier-Bresson and wonder if he would embrace modern changes in photography such as Instagram. Andreas Gursky (Rhein II) is our Photographer of the Week.\n",
            "length": "49622716",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2014/otp-110.mp3"
        },
        {
            "title": "109: Cause and Effect Issue",
            "datePublished": "Tue, 27 May 2014 16:45:00 GMT",
            "description": "This week we’re talking about intent. Whether how you shoot, how you practice or what tools you use, intent seems to be directly proportional to outcome. Also, what makes a curator? Does accreditation automatically mean better or more valid or can you just have great taste? Former Look and Life shooter Douglas Kirkland is our Photographer of the Week.\n",
            "length": "50015107",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2014/otp-109.mp3"
        },
        {
            "title": "108: Capital “P” Picasso ",
            "datePublished": "Tue, 20 May 2014 18:00:00 GMT",
            "description": "A big discussion on the differences between art and craft lead off this week’s show, inspired in part by a listener email. We also talk about obstacles, both personal and professional and how they can sometimes relegate Making Things to the back burner, if only for a while. Larry Fink is our Photographer of the Week.\n",
            "length": "50117091",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2014/otp-108.mp3"
        },
        {
            "title": "107: Backwards To Go Forwards",
            "datePublished": "Tue, 13 May 2014 17:30:00 GMT",
            "description": "This week, a big discussion about creativity - how sometimes you need to put down the todo list and just focus on making the work that makes you happy and let the chips fall where they may.  Also, some thoughts from Picasso on why you shouldn’t compromise in your art. Diane Arbus is our Photographer of the Week.\n",
            "length": "53231096",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2014/otp-107.mp3"
        },
        {
            "title": "106: The Story Is In The Risk",
            "datePublished": "Tue, 06 May 2014 16:30:00 GMT",
            "description": "This week, a new book from photographer Danny Lyon sparks a great discussion about intent and we unpack the idea of creating a body of work versus living your way through it. We also ask the question: “Is art a part of our lives or are our lives a part of some greater art?” Jeff Wall is our Photographer of the Week. Please help us grow the show by sharing it with your friends via Twitter or Facebook.\n",
            "length": "54331165",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2014/otp-106.mp3"
        },
        {
            "title": "105: More of the Crazy Juice",
            "datePublished": "Tue, 29 Apr 2014 19:30:00 GMT",
            "description": "On the heels of Paris Photo, this week we’re talking about inspiration and how art is too often priced for collectors, rather than fans. Is taking great pictures enough to be a great photographer? Also, making art doesn’t always have to be a painful experience. Plus, Art Kane is our Photographer of the Week.\n",
            "length": "49667157",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2014/otp-105.mp3"
        },
        {
            "title": "104: Happy Doing What You’re Doing Right Now",
            "datePublished": "Tue, 22 Apr 2014 18:30:00 GMT",
            "description": "This week, we discuss experience versus results and how process sometimes trumps outcome. Also, do photographers, particularly photojournalists, have a responsibility to filter what not to show? A listener question about placing a value on our work - why is it so difficult? Carl van Vechten is our Photographer of the Week.\n",
            "length": "52835161",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2014/otp-104.mp3"
        },
        {
            "title": "103: A Lifetime of Rehearsal",
            "datePublished": "Tue, 15 Apr 2014 17:00:00 GMT",
            "description": "This week, we discuss obsession as both a motivator and a meditation and whether or not photography might be just one big performance. Also, do you worry about what you’re not shooting as much as what you are? Plus, living for your resume vs. your eulogy. Pulitzer Prize-winning photojournalist Anja Niedringhaus is our Photographer of the Week.\n",
            "length": "57307021",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2014/otp-103.mp3"
        },
        {
            "title": "102: Rigging the Roulette Wheel",
            "datePublished": "Tue, 08 Apr 2014 14:30:00 GMT",
            "description": "Big Q&amp;A show this week as we attempt to tackle some of your questions from the Google+ Community. We got some great questions on process, intent and even the business side of creativity. Danny Lyon is our Photographer of the Week.\n",
            "length": "54332212",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2014/otp-102.mp3"
        },
        {
            "title": "101: Cookie Cutter Wisdom",
            "datePublished": "Tue, 01 Apr 2014 18:00:00 GMT",
            "description": "This week, we discuss authenticity - is the quest for authenticity real or just a hoax perpetuated by hipsters and organic farmers? Also, thoughts on Steven Pressfield’s The War of Art - realizing what you are and getting down to business. Could this book be a good candidate for a group discussion? Plus, Lee Friedlander is our PotW.\n",
            "length": "51754233",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2014/otp-101.mp3"
        },
        {
            "title": "100: Discovering Something New",
            "datePublished": "Tue, 25 Mar 2014 17:30:00 GMT",
            "description": "Episode 100! Thank you so much for coming along with us each week. This week, we discuss how a place can (and should) get under your skin to help fuel creativity. Also, is technology killing creativity and prosperity? Would you pay real money to increase your social media reach? Facebook thinks so. Plus, fashion photographer Erwin Blumenfeld is our Photographer of the Week.\n",
            "length": "44838267",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2014/otp-100.mp3"
        },
        {
            "title": "99: Authenticity Complex",
            "datePublished": "Tue, 18 Mar 2014 20:30:00 GMT",
            "description": "For this last double-digit episode, we talk about the entitlement of an artistic life. Should society reward creativity? Also, more on the seemingly endless question of whether social media works or is simply a distraction. Plus, we question whether photography has to be good to be important with our Photographer of the Week, Terry Richardson.\n",
            "length": "52409382",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2014/otp-099.mp3"
        },
        {
            "title": "98: Signal to Noise",
            "datePublished": "Tue, 11 Mar 2014 18:45:00 GMT",
            "description": "Big show this week as we take a look at some of the latest art and photography news and how the stories may affect making a living as a creative. Content may be the new black, but who really wins if all of it is free? With no roadmap to navigate, we raise more questions than answers. How do you find your way? Lewis Hine is our Photographer of the Week.\n",
            "length": "54229553",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2014/otp-098.mp3"
        },
        {
            "title": "97: The Best Version Of Me",
            "datePublished": "Tue, 04 Mar 2014 19:45:00 GMT",
            "description": "This week, we talk about how technology is affecting branding and marketing. With so much noise and so many choices, how do you know what works? Also, can your future self be your present hero? Plus, transformation - how much is enough? Fantastic dance photographer Barbara Morgan is our Photographer of the Week.\n",
            "length": "44170364",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2014/otp-097.mp3"
        },
        {
            "title": "96: Pencil Marks",
            "datePublished": "Tue, 25 Feb 2014 19:30:00 GMT",
            "description": "Is your photography business your own? We discuss one interesting case where the answer was no. We also talk about image, not the one you’re making but the one you’re living, which helps set the stage for next week’s discussion on branding. Plus, surf photographer Mickey Smith on a present worth remembering and UK photographer Thurston Hopkins is our Photographer of the Week.\n",
            "length": "51418393",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2014/otp-096.mp3"
        },
        {
            "title": "95: Finding The New",
            "datePublished": "Tue, 18 Feb 2014 19:30:00 GMT",
            "description": "This week, when is enough really enough? How do you know when it’s time to make subtle corrections versus charting an entirely new course? We also discuss the potential of collaboration and how narrative is changing the way we view photography. Portrait photographer Brett Walker is our Photographer of the Week.\n",
            "length": "49176249",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2014/otp-095.mp3"
        },
        {
            "title": "94: The Custodian Ideal ",
            "datePublished": "Tue, 11 Feb 2014 18:30:00 GMT",
            "description": "This week is a Q&amp;A show where we take a bunch of listener questions and try to answer them without sounding like idiots. But first, do you miss the good ol’ days of analog? We discuss Bill’s recent (and expensive) foray into large-format film on an 8x10 portrait shoot. Photographer, professor and MacArthur Fellow An-My Lê is our Photographer of the week.\n",
            "length": "52239273",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2014/otp-094.mp3"
        },
        {
            "title": "93: Listen to Yourself",
            "datePublished": "Tue, 04 Feb 2014 22:45:00 GMT",
            "description": "This week, we discuss the little voice - the gnawing (knowing) inside all of us that pushes us forward. How do you choose what to listen to and what to dismiss? Where do you draw the line between what you can do and what you will do? Plus, where has the mystique around photography gone? Ormond Gigli is our Photographer of the Week.\n",
            "length": "47006422",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2014/otp-093.mp3"
        },
        {
            "title": "92: The Analogy of the Sphere",
            "datePublished": "Tue, 28 Jan 2014 19:30:00 GMT",
            "description": "This week, we chime in on a recent NY Times article that questions the new definition of photography. Should using a camera somewhere in the process be a prerequisite to calling something a photograph? Are curators simply throwing stuff at the wall and hoping that Art is the only thing that sticks? We also discuss a listener email that centers around the flood of tutorials and techniques available to photographers, which begs the question “What should I learn?” Plus, National Geographic shooter Bruce Dale is our Photographer of the Week.\n",
            "length": "51718292",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2014/otp-092.mp3"
        },
        {
            "title": "91: Isn’t That The Fun Of It?",
            "datePublished": "Tue, 21 Jan 2014 22:00:00 GMT",
            "description": "This week, a discussion about The Secret Life of Walter Mitty gets us talking about art, specifically whether or not we tend to romanticize the life and work of the artist (spoiler: Penn should have taken the shot!). Also, with so many resources available, how do we step away from the learning and get down to doing? Our photographer of the Week, Duane Michals make brilliant use of mixed media and image sequences to tell stories not possible with a single photograph.\n",
            "length": "49024805",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2014/otp-091.mp3"
        },
        {
            "title": "90: Uncharted Territory",
            "datePublished": "Tue, 14 Jan 2014 20:15:00 GMT",
            "description": "This week, we go further down the rabbit hole of Mentorship and discuss our most important mentors as well as what type of mentor each of us could benefit from now. We also talk about how AI may affect or even remove the choices we make in the not-too-distant future via the film Her. Brilliant architectural photographer Julius Schulman is our Photographer of the Week.\n",
            "length": "50774325",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2014/otp-090.mp3"
        },
        {
            "title": "89: 42 Puppies and a Snow Cone Machine",
            "datePublished": "Tue, 07 Jan 2014 18:45:00 GMT",
            "description": "For the first episode of 2014, we discuss how the tools that we use shape the way we use them. We also talk about the photographer/subject relationship and discuss how to better connect with the people you are photographing, which may even inspire Bill to take on a new project. Master vs. Mentor - one is about status while the other is about a relationship. Stephen Shore is our Photographer of the Week.\n",
            "length": "49334053",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2014/otp-089.mp3"
        },
        {
            "title": "88: Didn’t You Hear My Inner Monologue?",
            "datePublished": "Tue, 31 Dec 2013 18:30:00 GMT",
            "description": "For the last episode of OTP in 2013, we discuss looking back to look forward. We look not at creating resolutions as much as mantras, concepts to drive us ahead and allow some wiggle room for the things that don’t work out exactly the way you think they will. Also, we look at ways to refine/expand the OTP G+ Group, which has now crossed 800! Iconic photojournalist Steve McCurry is our Photographer of the Week. Thank you so much for your time, your energy and your willingness to let us wrestle with the things we do week after week. We couldn’t do it without you.\n",
            "length": "47646604",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2013/otp-088.mp3"
        },
        {
            "title": "87: I’m Wearing Tap Shoes?",
            "datePublished": "Tue, 24 Dec 2013 17:00:00 GMT",
            "description": "This week is all about you, the listeners, as we try to answer some of the questions you’ve asked via email, twitter and the Google+ group. We also talk through some camera and photo related news. Conceptual portrait slash fashion photographer, Miss Aniela is our Photographer of the Week.\n",
            "length": "55812456",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2013/otp-087.mp3"
        },
        {
            "title": "86: Sing Me What You’re Going To Play",
            "datePublished": "Tue, 17 Dec 2013 19:00:00 GMT",
            "description": "This week, Bill’s recent musical interlude inspires a discussion around how embarrassment and fear can paralyze us, more than just creatively. Also, the practice of practice and who owns your likeness and for how long? Iconic fashion shooter Mario Testino is our Photographer of the Week.\n",
            "length": "47951287",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2013/otp-086.mp3"
        },
        {
            "title": "85: Good Art Doesn’t Have a Shelf Life",
            "datePublished": "Tue, 10 Dec 2013 20:30:00 GMT",
            "description": "This week, we talk about projects, specifically long-term projects and how the full value of them (on both sides) often isn’t fully realized until you’re well down the timeline. Also, who decides what art is important, or even good for that matter? Should “good art” (whatever that means) define the current culture or reflect it? Plus, 19th century French photographer Charles Marville is our Photographer of the Week.\n",
            "length": "51440418",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2013/otp-085.mp3"
        },
        {
            "title": "84: Your Definition of Yourself",
            "datePublished": "Tue, 03 Dec 2013 22:30:00 GMT",
            "description": "This week, we remember icon Saul Leiter and discuss not only legacy but intent and what it means to live and create with purpose. Who gets to decide what work (if any) is important? Plus, we talk a little about tools, including the new crop of 4K displays on the horizon. Ethnologist and photographer of the American West and of Native American peoples Edward Curtis is our PotW.\n",
            "length": "49204269",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2013/otp-084.mp3"
        },
        {
            "title": "83: It’s Not A Pendulum, It’s A Kaleidoscope ",
            "datePublished": "Tue, 26 Nov 2013 18:00:00 GMT",
            "description": "This week, we gear out a little (just a little) and talk about light, specifically the subtleties and how much they may or may not affect your end product. Also, we talk about funding projects. Should you pony up the cash, or is crowd-funding a possible solution? Plus, user-suggested Photographer of the Week, portrait shooter Martin Schoeller.\n",
            "length": "49072484",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2013/otp-083.mp3"
        },
        {
            "title": "82: Going ‘All In’ On Yourself",
            "datePublished": "Wed, 20 Nov 2013 04:30:00 GMT",
            "description": "This week, should exceptional talent be a gift or a chore? Does what you do have to feed your soul to be important, or is just doing the work enough? Also, when are too many options not a good thing? Plus, we discuss the new documentary “Everybody Street” and Tim Flach is our Photographer of the Week.\n",
            "length": "45496395",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2013/otp-082.mp3"
        },
        {
            "title": "81: An Artistic Vacation",
            "datePublished": "Tue, 12 Nov 2013 19:00:00 GMT",
            "description": "This week, thank yous and follow up to last week’s episode. How do we decide what we do and don’t want creatively? Is a hard-coded trajectory helpful, or merely another distraction you need to adhere to? Also, we talk about an interesting article by Kirk Tuck and a really great interview with our Photographer of the Week, Walker Evans.\n",
            "length": "48992357",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2013/otp-081.mp3"
        },
        {
            "title": "80: It’s Something To Take Seriously",
            "datePublished": "Thu, 07 Nov 2013 22:45:00 GMT",
            "description": "This week, synchronicity and the beauty of moments. Bill recaps his whirlwind trip to Italy and we discuss why seeing art in person is better than seeing it through a viewfinder. Model turned photographer, Lee Miller is our Photographer of the Week.\n",
            "length": "49792401",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2013/otp-080.mp3"
        },
        {
            "title": "79: Photography Without A Net",
            "datePublished": "Tue, 29 Oct 2013 16:15:00 GMT",
            "description": "This week, the importance of heroes and how being inspired by one can make you feel like a kid again. Also, are you shooting for the present or for posterity? Plus, we talk about an interesting performance art piece and the intention behind it. Greg Heisler’s former boss, Arnold Newman, is our Photographer of the Week.\n",
            "length": "46221501",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2013/otp-079.mp3"
        },
        {
            "title": "78: Shutter Priority on Glass Plate",
            "datePublished": "Tue, 22 Oct 2013 20:15:00 GMT",
            "description": "This week, we tackle some great questions from you, the listeners, about topics ranging from personal and professional goals to social media and where we find inspiration outside of photography.  We also try to find the line between art and porn. Plus, National Geographic wildlife photographer Paul Nicklen is our Photographer of the Week.\n",
            "length": "52319532",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2013/otp-078.mp3"
        },
        {
            "title": "77: Knowing Which Mistakes To Keep",
            "datePublished": "Tue, 15 Oct 2013 19:30:00 GMT",
            "description": "This week, we talk about the creative work we do and why we do it. What draws you to the art you make: love or fear? Where does social media fit into the new “sharing” (read:free) economy? Plus, iconic photojournalist W. Eugene Smith is our Photographer of the Week.\n",
            "length": "54159387",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2013/otp-077.mp3"
        },
        {
            "title": "76: Slamming Up Against the Walls (Like in an A-Ha Video)",
            "datePublished": "Tue, 08 Oct 2013 19:00:00 GMT",
            "description": "This week, we discuss mentors and community. Whatever happened to someone taking you under their wing? Is learning from one person different, or better, than learning from a collective? Also, we talk a little about some of the fantastic projects you are posting to the Google+ group. Plus, as a nod to Bill’s new Fuji x100s, Henri Cartier-Bresson is our Photographer of the Week.\n",
            "length": "47565478",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2013/otp-076.mp3"
        },
        {
            "title": "75: Film comes in a can. Like soup.",
            "datePublished": "Tue, 01 Oct 2013 19:00:00 GMT",
            "description": "We’ve got a big show this week, beginning with a little follow up on last week’s discussion about branding and websites, specifically writing. We also talk about practice...does practice really make perfect or just better? Plus, we answer several of your emails and questions from the G+ Community. Edward Burtynsky is our Photographer of the Week.\n",
            "length": "53271434",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2013/otp-075.mp3"
        },
        {
            "title": "74: Self-Deluding Defense Mechanism",
            "datePublished": "Tue, 24 Sep 2013 17:30:00 GMT",
            "description": "This week, we’re chewing on the the idea of you as your brand and we’re talking blogs, logos, portfolios and more. What do you expect from your online presence and how do you know when you’ve got it right? We also gear out a little as Bill considers a new camera for his upcoming vacation. Plus, brilliant portrait photographer Nigel Parry is our Photographer of the Week.\n",
            "length": "50407369",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2013/otp-074.mp3"
        },
        {
            "title": "73: It's Not All Warm and Fuzzy",
            "datePublished": "Mon, 16 Sep 2013 20:30:00 GMT",
            "description": "This week, we wrestle with creativity; is making something “good” a struggle? If it’s not, are you doing something wrong? Plus a listener sends in a great list of things to help you find your purpose. We also walk the line between art and pornography (and wonder whether the government should pay for it) with our Photographer of the Week, Robert Mapplethorpe.\n",
            "length": "50735516",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2013/otp-073.mp3"
        },
        {
            "title": "72: Get Behind the Train and Push",
            "datePublished": "Tue, 10 Sep 2013 20:00:00 GMT",
            "description": "This week, we follow up on our previous discussion about location. We also look at making art (or content) as a lifestyle, rather than an end game. Plus, we tackle a great question for a listener: How do you know when to go pro and what does that really mean anyway? Dramatic black &amp; white street photography, courtesy of Ray Metzger, our Photographer of the Week.\n",
            "length": "62663577",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2013/otp-072.mp3"
        },
        {
            "title": "71: Disruption",
            "datePublished": "Tue, 03 Sep 2013 18:30:00 GMT",
            "description": "Are you following a straight line or tacking an irregular course? Is one more effective than the other, providing you can see True North? What is the real value in a life spent making art? Plus, Russian photographer and graphic designer, Alexander Rodchenko is our Photographer of the Week.\n",
            "length": "65702441",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2013/otp-071.mp3"
        },
        {
            "title": "70: The Gaia Argument",
            "datePublished": "Tue, 27 Aug 2013 21:15:00 GMT",
            "description": "This week, we’re talking film; both the technical side and the aesthetics. Is film as close as we’ll get to alchemy, or is it merely a placebo to look back on happier times? Also, cameras are better than they’ve ever been, so why isn’t there more great work? If you’re a fan of Art Deco and Fritz Lang, you’re going to love the work of our Photographer of the Week, Czech shooter, Frantisek Drtikol.\n",
            "length": "58378474",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2013/otp-070.mp3"
        },
        {
            "title": "69: Play With Your Deckled Edges",
            "datePublished": "Tue, 20 Aug 2013 17:30:00 GMT",
            "description": "The week, who are you presenting to the world, you, or a manufactured version of you? Also, all roads lead to film when Bill borrows a Leica M7. Plus, what’s the difference between collecting and curating? Artist-slash-photographer, Vic Muniz sparks some interesting discussion on the nature of art as our Photographer of the Week.\n",
            "length": "62751927",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2013/otp-069.mp3"
        },
        {
            "title": "68: An Incorrect Perspective",
            "datePublished": "Tue, 13 Aug 2013 17:00:00 GMT",
            "description": "This week, we celebrate looking at work through the eyes of an amateur. Also towards the end of the show, we hit upon a somewhat profound revelation about art and bicycling. Plus, Art Streiber is our Photographer of the Week.\n",
            "length": "61245461",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2013/otp-068.mp3"
        },
        {
            "title": "67: Far Enough Along Your Curve ",
            "datePublished": "Tue, 06 Aug 2013 22:30:00 GMT",
            "description": "This week, how do you gauge whether or not the work you do is authentic? What do you do when good isn’t good enough or how much to you chalk up to timing? Also, should you be held accountable for the consistency of the art you create? Plus, brilliant fashion and fine art photographer, Lillian Bassman is our Photographer of the Week.\n",
            "length": "58491416",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2013/otp-067.mp3"
        },
        {
            "title": "66: You Don’t Want To See Me When I’m Bored",
            "datePublished": "Tue, 30 Jul 2013 18:00:00 GMT",
            "description": "This week, we talk about image; both the images you take as photographers as well as the image you present of yourself as the photographer. Do better shoes make you a better photographer and, if so, when did being cool trump being good? We also tackle some listener Q&amp;A and profile Horst P. Horst as our Photographer of the Week.\n",
            "length": "50392015",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2013/otp-066.mp3"
        },
        {
            "title": "65: Doing Nothing is the Enemy",
            "datePublished": "Tue, 23 Jul 2013 18:30:00 GMT",
            "description": "This week, we talk reinvention. Sometimes you choose, while other times, the choice is made for you. Do you go willingly, or kicking and screaming? Also, how do you take your work (or yourself) to the next level? Plus, you may not know the name, but you definitely know the photos; Philippe Halsman is our Photographer of the Week.\n",
            "length": "46684012",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2013/otp-065.mp3"
        },
        {
            "title": "64: Goldilocks Camera Phenomenon",
            "datePublished": "Tue, 16 Jul 2013 17:15:00 GMT",
            "description": "We lighten things up this week and talk about gear, specifically cameras and why what’s right for you may not be right for someone else...and that’s okay. Also, sometimes your photos really don’t matter... just enjoy the moment. Plus, Ellen von Unwerth brings the sexy as our Photographer of the Week.\n",
            "length": "52347966",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2013/otp-064.mp3"
        },
        {
            "title": "63: The Core of the Struggle",
            "datePublished": "Tue, 09 Jul 2013 20:45:00 GMT",
            "description": "Last week, we talked about valuing your work. This week, we take on the idea of defining artistic goals and how a journey without a destination can have a dramatic impact on the work you create. Also, how do you decide just how much creative capital to invest? Plus, brilliant Chinese street photographer, Ho Fan is our Photographer of the Week.\n",
            "length": "52118503",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2013/otp-063.mp3"
        },
        {
            "title": "62: Artists Aren’t Plumbers",
            "datePublished": "Tue, 02 Jul 2013 16:30:00 GMT",
            "description": "This week, we do a bit of follow up on last week’s episode, which really seems to have touched a nerve with listeners. At what point does worrying about putting a value on your work keep you from doing your work? Also, Bill contemplates going big for a new project. “Original Mad Man” Bert Stern is our Photographer of the Week.\n",
            "length": "45581482",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2013/otp-062.mp3"
        },
        {
            "title": "61: Happenstance Threw It Over The Line",
            "datePublished": "Wed, 26 Jun 2013 00:45:00 GMT",
            "description": "This week, we wrestle with “good enough”; what does it really mean, and who gets to decide? Where do we draw the line between homage and just plain thievery? Plus, documentary photographer Martin Parr is our Photographer of the Week.\n",
            "length": "46091773",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2013/otp-061.mp3"
        },
        {
            "title": "60: The Problem is Always Me",
            "datePublished": "Tue, 18 Jun 2013 19:00:00 GMT",
            "description": "Big discussions this week as we talk about different facets of collaboration and look to dispel The Myth of the Lone Artist. A short film by Eric Becker prompts us to wonder whether or not the world is for want of inspirational material. Plus, classic sports photographer Hy Peskin is our Photographer of the Week.\n",
            "length": "47649078",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2013/otp-060.mp3"
        },
        {
            "title": "59: Food Doesn’t Talk Back",
            "datePublished": "Tue, 11 Jun 2013 22:15:00 GMT",
            "description": "This week we talk about getting through a shoot when you feel like a truck ran over you. Also, do retouchers deserve credit? If so, when and how much? Plus, abstract photographer and MacArthur \"Genius\" Fellow Uta Barth is our Photographer of the week.\n",
            "length": "48529137",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2013/otp-059.mp3"
        },
        {
            "title": "58: Art is Exposure",
            "datePublished": "Tue, 04 Jun 2013 18:45:00 GMT",
            "description": "This week, we wrestle with whether or not you can be an artist, without locking your own self worth/self image to your art. What does it mean to live a creative life anyway? We weigh in on the firing of the photo staff by the Chicago Sun Times. Plus, we look at two Civil War era photographers, Mathew Brady and Alexander Gardner as our Photographers of the Week.\n",
            "length": "50578545",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2013/otp-058.mp3"
        },
        {
            "title": "57: A Big Pool of Hustle",
            "datePublished": "Tue, 28 May 2013 18:30:00 GMT",
            "description": "We discuss why it is that we bother to create anything. What are we looking for, praise or just a body of work? Bill takes the plunge into filmmaking (sort of) and we get some great questions from listeners. Magnum photographer, Josef Koudelka is our Photographer of the Week.\n",
            "length": "49254455",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2013/otp-057.mp3"
        },
        {
            "title": "56: Then It Becomes RoboCop",
            "datePublished": "Tue, 21 May 2013 17:15:00 GMT",
            "description": "Big show this week as Bill and Jeffery question what happens when it’s the process used to create the art that’s interesting, not the result. Also, where do we draw the line between photo manipulation and photo journalism? Plus, questions from the Google+ group and listener-suggested Alec Soth is our Photographer of the Week.\n",
            "length": "49724197",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2013/otp-056.mp3"
        },
        {
            "title": "55: When Life Gives You Lemmings",
            "datePublished": "Tue, 14 May 2013 18:15:00 GMT",
            "description": "Bill battles severe back pain to discuss whether or not people know good from bad and how Steven Soderbergh’s observations on the state of cinema may also reflect the state of art. We also wonder how we should go about judging our own growth. Plus, voracious street shooter, Garry Winogrand, is our Photographer of the Week.\n",
            "length": "49928551",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2013/otp-055.mp3"
        },
        {
            "title": "54: Where’s Joseph Campbell When You Need Him? ",
            "datePublished": "Tue, 07 May 2013 16:00:00 GMT",
            "description": "Bill and Jeffery discuss why content is no longer king and how you should focus on making (read: doing) something that’s important to you. Adobe kills individual licenses. Are they doing the right thing with the new Creative Cloud? Plus, “Tulsa” photographer Larry Clark is our Photographer of the Week.\n",
            "length": "49496674",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2013/otp-054.mp3"
        },
        {
            "title": "53: Dig Down To Make More Room",
            "datePublished": "Tue, 30 Apr 2013 19:30:00 GMT",
            "description": "Heroes aren’t just for children, especially when you meet them in person. Art for art’s sake, rather than investment. Plus, listener emails and Vancouver street shooter, Fred Herzog as Photographer of the Week.\n",
            "length": "49987272",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2013/otp-053.mp3"
        },
        {
            "title": "52: Backfill Reasoning",
            "datePublished": "Tue, 23 Apr 2013 20:00:00 GMT",
            "description": "Once you realize that everything you do leads to the next thing, and that the journey is the reward, you’ll be fine. Do clients want your work or your juice? Plus, controversial photographer and art world darling, Cindy Sherman is our Photographer of the Week.\n",
            "length": "46658428",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2013/otp-052.mp3"
        },
        {
            "title": "51: No Secret Sauce",
            "datePublished": "Tue, 16 Apr 2013 20:30:00 GMT",
            "description": "Does it really take village to succeed as a photographer today, and should technology dictate where your career-compass guides you? Despite the changes to photography as a business, clients and art buyers are still looking for talent; but are they looking where you are? Plus, get out your shot glasses, iconic New York lensman, Jay Maisel is Photographer of the Week.\n",
            "length": "51009590",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2013/otp-051.mp3"
        },
        {
            "title": "50: Tortured Plateau",
            "datePublished": "Tue, 09 Apr 2013 20:45:00 GMT",
            "description": "To tag or not to tag? Folder structure, naming conventions, file formats and overall workflow ideas in this week’s show. Why do filmmakers get all of the cool stuff lately? Plus, photographic icon Alfred Eisenstadt is Photographer of the Week.\n",
            "length": "46598867",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2013/otp-050.mp3"
        },
        {
            "title": "49: Happiness is an Inside Job",
            "datePublished": "Wed, 03 Apr 2013 16:45:00 GMT",
            "description": "Things get a little heavy as Bill and Jeffery discuss the importance of dreams and what often keeps us from chasing them. Plus, standing up for the value of your work, just how limited are limited editions and pioneering female photographer Margaret Bourke-White as Photographer of the Week.\n",
            "length": "49321463",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2013/otp-049.mp3"
        },
        {
            "title": "48: $500 and a Lollipop",
            "datePublished": "Tue, 26 Mar 2013 19:45:00 GMT",
            "description": "Bill and Jeffery try to iron out the intricacies of copyright and usage, photography as part of a larger, happier life. Photographer and film director Gordon Parks as Photographer of the Week.\n",
            "length": "44298702",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2013/otp-048.mp3"
        },
        {
            "title": "47: Inspiration Is Like Tinkerbell",
            "datePublished": "Tue, 19 Mar 2013 21:00:00 GMT",
            "description": "Knowing when to stop, how sometimes quantity leads to quality, backup follow-up, and more. Photographer and Filmmaker Anton Corbijn is Photographer of the Week.\n",
            "length": "44059605",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2013/otp-047.mp3"
        },
        {
            "title": "46: 151 Lights and a News Desk",
            "datePublished": "Tue, 12 Mar 2013 22:00:00 GMT",
            "description": "Bill gets fancy at the news desk, the importance of backups and technique vs gear. Plus, influential documentary photographer, Robert Frank as Photographer of the Week.\n",
            "length": "46065216",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2013/otp-046.mp3"
        },
        {
            "title": "45: True North On Your Creative Compass",
            "datePublished": "Tue, 05 Mar 2013 22:00:00 GMT",
            "description": "Light looking like lights, the long-term view of your portfolio, science vs alchemy of film, and more. Stéphane Lavoué is Photographer of the Week.\n",
            "length": "42639240",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2013/otp-045.mp3"
        },
        {
            "title": "44: Sensor Verite",
            "datePublished": "Tue, 26 Feb 2013 16:00:00 GMT",
            "description": "How much change is too much change for the sake of commerce? Why portraits are different than other types of photography, and who is copyright really protecting? Classic sports magazine shooter Ozzie Sweet is Photographer of the Week\n",
            "length": "42835373",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2013/otp-044.mp3"
        },
        {
            "title": "43: Artistic Monkhood",
            "datePublished": "Tue, 19 Feb 2013 11:30:00 GMT",
            "description": "Safe vs Experimental, to get good you need to stop trying to get good, and Jeffery's monologue at 42:20 which is among the best things ever spoken on our show. Iconic war photograph Robert Capa is Photographer of the Week.\n",
            "length": "46732355",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2013/otp-043.mp3"
        },
        {
            "title": "42: That’s Just Going to the Driving Range",
            "datePublished": "Tue, 12 Feb 2013 22:30:00 GMT",
            "description": "Style vs Fashion and How do you develop a style anyway? The influence of luck, snow angels, and listener Q&amp;A. Michael Light is Photographer of the Week.\n",
            "length": "43862053",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2013/otp-042.mp3"
        },
        {
            "title": "41: Our Microscopes Got More Powerful",
            "datePublished": "Wed, 06 Feb 2013 03:15:00 GMT",
            "description": "Decaying Americana, taking being uncomfortable one small step at a time, and some talk about starting a flickr group on this week's show. Modernist Paul Strand is Photographer of the Week.\n",
            "length": "46295119",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2013/otp-041.mp3"
        },
        {
            "title": "40: I’m Buying a Smoke Machine",
            "datePublished": "Tue, 29 Jan 2013 18:00:00 GMT",
            "description": "The new Gregory Crewdson Documentary, the morality of Photoshop, and Q&amp;A from a pile of listener emails. Master of masters Richard Avedon is Photographer of the Week.\n",
            "length": "48850794",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2013/otp-040.mp3"
        },
        {
            "title": "39: The President and an Umbrella",
            "datePublished": "Tue, 22 Jan 2013 18:00:00 GMT",
            "description": "Presidential portraits, the 'cool kid camera club', why Bill uses prime lenses, and the importance of having Dreams on this week's show. Celebrity portrait and fashion photographer Norman Jean Roy is Photographer of the Week.\n",
            "length": "48937601",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2013/otp-039.mp3"
        },
        {
            "title": "38: Tug of War with the Muse",
            "datePublished": "Tue, 15 Jan 2013 20:00:00 GMT",
            "description": "Technical and creative limitations as inspiration, schtick vs style, and how the artistic process is what gives art it's humanity. Innovative fashion photographer Paolo Roversi is Photographer of the Week.\n",
            "length": "43089939",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2013/otp-038.mp3"
        },
        {
            "title": "37: Jump in the River",
            "datePublished": "Tue, 08 Jan 2013 18:00:00 GMT",
            "description": "Photographers not known for their pictures, popularity contests, and trying to be a nice guy in a divisive world. Listener emails about exploitation, education, and 'Meditation' are answered. Classic agressive street photographer and filmmaker William Klein is Photographer of the Week.\n",
            "length": "52598145",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2013/otp-037.mp3"
        },
        {
            "title": "36: The Schrodinger Moment",
            "datePublished": "Wed, 02 Jan 2013 20:30:00 GMT",
            "description": "An epic show this week wherein Bill and Jeffery tear into legacy, life, death, and being remembered. It's deep and heavy and well worth the time. B&amp;W conversion, photography movies, and photo education also make an appearance. Portraitist Platon is our Photographer of the Week.\n",
            "length": "46516516",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2013/otp-036.mp3"
        },
        {
            "title": "35: Justification After the Fact",
            "datePublished": "Wed, 26 Dec 2012 21:30:00 GMT",
            "description": "It's the last episode of 2012 so we conquer comment trolls, Fuji's lack of auto-focus, and whether historical artistic perspective matters at all anyway. Artistic portrait man Philip-Lorca diCorcia is our Photographer of the Week.\n",
            "length": "43080795",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2013/otp-035.mp3"
        },
        {
            "title": "34: Learning Everything All the Time",
            "datePublished": "Tue, 18 Dec 2012 18:15:00 GMT",
            "description": "The plateaus of getting better, why change is scary, why Jeffery can't decide what camera to buy and it's not because there are no good cameras available. Modern surrealist photographer Man Ray is our Photographer of the Week.\n",
            "length": "43975988",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2013/otp-034.mp3"
        },
        {
            "title": "33: Troubleshooting in Real Time",
            "datePublished": "Tue, 11 Dec 2012 20:30:00 GMT",
            "description": "An update and discussion about how Bill's December portrait project is going, does pre-visualization suck creativity, and where is the line between photography and photo-illustration anyway? Darkroom artist Jerry Uelsmann is our Photographer of the Week.\n",
            "length": "43435822",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2013/otp-033.mp3"
        },
        {
            "title": "32: Screw Those People",
            "datePublished": "Wed, 05 Dec 2012 06:00:00 GMT",
            "description": "Should you retire of you're no longer doing good work? What skateboarding has in common with photography and why Bill will never get asked to shoot the Pirelli calendar. Portraitist William Coupon is our Photographer of the Week.\n",
            "length": "42297928",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2013/otp-032.mp3"
        },
        {
            "title": "31: Too Much Information",
            "datePublished": "Tue, 27 Nov 2012 20:15:00 GMT",
            "description": "Coercion vs connection in portrait photography , making it through the fear of failure or even fear of success, and what? Bill is shooing video now? The world must be ending, so we might as well start at the beginning with 19th century French portrait photographer Nadar as PotW.\n",
            "length": "42006198",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2013/otp-031.mp3"
        },
        {
            "title": "30: Entrances Confused with Dead Ends",
            "datePublished": "Wed, 21 Nov 2012 16:30:00 GMT",
            "description": "Our thoughts on the HBO series 'Witness', classic Hollywood portraits, tips for making your composites look more real, and a deep delve into the mind of photographer of the week Joel Meyerowitz.\n",
            "length": "43418595",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2013/otp-030.mp3"
        },
        {
            "title": "29: Richard Scarry Book on Acid",
            "datePublished": "Tue, 13 Nov 2012 21:45:00 GMT",
            "description": "How do you know when you've got it right? Are trends in art supposed to be chased or ridden, and is there is a location which really is the 'place to be' at any particular time? Parisian street photographer Brassai is this week's photographer.\n",
            "length": "42651040",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2013/otp-029.mp3"
        },
        {
            "title": "28: Ability to Recognize...Maybe",
            "datePublished": "Wed, 07 Nov 2012 17:30:00 GMT",
            "description": "How do we know when art 'works' or doesn't? Is it intuition or knowledge? Bill and Jeffery also tackle some listener mail about b/w conversion, hype in the art world, and a rebuttal of a listener who thinks Bill is a little too cranky. Master portraitist Irving Penn is this week's photographer.\n",
            "length": "42800065",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2013/otp-028.mp3"
        },
        {
            "title": "27: A Body of Work Only in Hindsight",
            "datePublished": "Wed, 31 Oct 2012 18:30:00 GMT",
            "description": "A serious episode this week as Jeffery and Bill discuss whether a body of work is retrospective in origin or whether it's built masterpiece by masterpiece. Also David Hockney's article on perspective, scanning slides with your dslr, and asking why photography is ever a crime. The wonderful Alfred Sieglitz is this week's photographer.\n",
            "length": "43996930",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2013/otp-027.mp3"
        },
        {
            "title": "26: Brain Calibration Issue",
            "datePublished": "Fri, 26 Oct 2012 20:30:00 GMT",
            "description": "Extra bonus episode so that Jeffery and Bill could get caught up on and answer all the listen feedback they've been getting lately. We talk about the worth of process, light source color, framing, photo books, and the new Faking It exhibit at the Met in NYC. Get on board!\n",
            "length": "36659608",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2013/otp-026.mp3"
        },
        {
            "title": "25: The Weather Is What You're Photographing",
            "datePublished": "Tue, 23 Oct 2012 22:00:00 GMT",
            "description": "This week Bill tells all about his trip to Yosemite and Sequoia National Parks while Jeffery gives him a hard time about it. Do you need to leave where you are to see where you've been? And of course it's fitting that Ansel Adams is our photographer of the week.\n",
            "length": "44519652",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2013/otp-025.mp3"
        },
        {
            "title": "24: Negative Space of Technique",
            "datePublished": "Fri, 10 Feb 2012 00:00:00 GMT",
            "description": "This week is all about who deserves to get paid, whether craft has inherent value, and why Bill would like to take more than one photograph with an iPhone even with a purple fringed lens flare. Amateur savant Vivian Meier is our photographer of the week.\n",
            "length": "45556006",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2013/otp-024.mp3"
        },
        {
            "title": "23: Everyone’s Job to be Everything",
            "datePublished": "Mon, 01 Oct 2012 21:30:00 GMT",
            "description": "Bill and Jeffery respond to a bit more feedback about workshops &amp; websites, Jeffery's thinking about taking up senior portraits, Bill can't stand photographers who don't know what they're talking about. Magnum photographer Elliot Erwitt is our photographer of the week.\n",
            "length": "43762354",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2013/otp-023.mp3"
        },
        {
            "title": "22: Ann Curry is a Better Photographer than You",
            "datePublished": "Mon, 24 Sep 2012 21:30:00 GMT",
            "description": "Bill and Jeffery respond to feedback about workshops &amp; websites, famous people buying Leicas, and why taking less pictures is better. Then Bill recounts being ignored by Philip Glass and his methodology behind a group shot of 10 people. Of course Edward Steichen, our photographer of the week, could have done a better job I'm sure.\n",
            "length": "43526500",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2013/otp-022.mp3"
        },
        {
            "title": "21: Vanity Fairy",
            "datePublished": "Tue, 18 Sep 2012 18:00:00 GMT",
            "description": "Bill is nervous for the first time in a while and it's not about the latest crop of cameras coming out at Photokina. Also, your portfolio site might just suck, but Jeffery's diatribe on the subject might just help. All this plus the century old amazing work of Karl Blossfeldt on this week's On Taking Pictures.\n",
            "length": "39135038",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2013/otp-021.mp3"
        },
        {
            "title": "20: Moment Much Bigger than that Photograph",
            "datePublished": "Tue, 11 Sep 2012 20:00:00 GMT",
            "description": "Different aspect ratios, photo projects based on teenage killers, and a long and somewhat heavy discussion about why we bother taking pictures at all and what they mean to us.\n",
            "length": "40385195",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2013/otp-020.mp3"
        },
        {
            "title": "19: Bare with a Snoot",
            "datePublished": "Tue, 14 Feb 2012 18:30:00 GMT",
            "description": "When 5 lights are just right, why people bother to shoot with a 4x5, as well as who Berenice Abbott was and why her work still rocks.\n",
            "length": "35258032",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2013/otp-019.mp3"
        },
        {
            "title": "18: Fifty Dollars and an Ice Cream Cone",
            "datePublished": "Tue, 28 Aug 2012 11:00:00 GMT",
            "description": "Fielding work inquiries, moon photography, the impossible rebirth of 8x10 Polaroid, artists vs technicians, and the wonderful work of Greg Heisler.\n",
            "length": "38049266",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2013/otp-018.mp3"
        },
        {
            "title": "17: Still Lifes of People",
            "datePublished": "Wed, 22 Aug 2012 23:00:00 GMT",
            "description": "Deep follow-up discussion on seducing your subjects, exploiting them to make a buck, and why we want to be Dan Winters when we grow up.\n",
            "length": "37043124",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2013/otp-017.mp3"
        },
        {
            "title": "16: Portraiture is a Dance",
            "datePublished": "Tue, 14 Aug 2012 22:00:00 GMT",
            "description": "Stephen Shore's tips for street photography, exploitative vs interesting, and what do we mean by portrait anyway?\n",
            "length": "40007440",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2013/otp-016.mp3"
        },
        {
            "title": "15: Salting the Steak",
            "datePublished": "Tue, 07 Aug 2012 20:45:00 GMT",
            "description": "The Curiosity Mars rover, going on an internet diet, Canon service story, how everything is a trade-off, and Imogen Cunningham.\n",
            "length": "36453889",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2013/otp-015.mp3"
        },
        {
            "title": "14: Creativity Comes From Doing",
            "datePublished": "Tue, 31 Jul 2012 18:30:00 GMT",
            "description": "Refinement vs change, novelty vs quality, the creative mindset, and composite pioneer William Notman as photographer of the week.\n",
            "length": "34193951",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2013/otp-014.mp3"
        },
        {
            "title": "13: Hand Gestures & Credit Cards",
            "datePublished": "Tue, 24 Jul 2012 16:45:00 GMT",
            "description": "SI runs Instagram pictures, Fuji discontinues a bunch of Velvia, Canon releases a mirrorless EOS body, more talk about shooting outside your comfort zone, and Albert Watson as photographer of the week.\n",
            "length": "35055536",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2013/otp-013.mp3"
        },
        {
            "title": "12: Kaleidoscopic Changes",
            "datePublished": "Tue, 17 Jul 2012 21:45:00 GMT",
            "description": "Better examples of Olympic portraits, Jock Sturges vs Sally Mann, is Magnum Photo still relevant, plus strategies and failures of trying to get out of your comfort zone on this episode of On Taking Pictures.\n",
            "length": "39436367",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2013/otp-012.mp3"
        },
        {
            "title": "11: Workflow: From Camera to Paper",
            "datePublished": "Tue, 10 Jul 2012 20:30:00 GMT",
            "description": "Skin tones color samples, multi-touch displays, and Bill walks through his workflow from camera to delivery on this episode of On Taking Pictures.\n",
            "length": "33978760",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2013/otp-011.mp3"
        },
        {
            "title": "10: Feels Like a Sunday",
            "datePublished": "Wed, 04 Jul 2012 17:45:00 GMT",
            "description": "Lot's of user feedback, bad US Olympic portraits, contact sheet website design, and Bill Eggleston on this special holiday episode of On Taking Pictures.\n",
            "length": "30865317",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2013/otp-010.mp3"
        },
        {
            "title": "9: Making the Cut",
            "datePublished": "Tue, 26 Jun 2012 17:00:00 GMT",
            "description": "How to choose the images in your portfolio, and how to show them to people. The advantages of prints, book, web, or iPad.\n",
            "length": "32908075",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2013/otp-009.mp3"
        },
        {
            "title": "8: The Amateur Professional",
            "datePublished": "Tue, 19 Jun 2012 21:00:00 GMT",
            "description": "Amateur vs Professional, what's the difference and does it matter? Does intent weigh in on the quality of your work? Why Bill hates the phrase 'spray and pray', and well as the news that Jeffery has started watching Dawson's Creek from the beginning.\n",
            "length": "36583117",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2013/otp-008.mp3"
        },
        {
            "title": "7: Creepy Kids at Retina Resolution",
            "datePublished": "Tue, 12 Jun 2012 21:30:00 GMT",
            "description": "Time lapse movies, Asian doppelgangers of American celebrities, why you probably don't need the new Macbook Pro, photorealistic paintings, Jeffery wants a 4x5, and Sony makes the perfect professional walk-around camera since the Leica.\n",
            "length": "30611855",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2013/otp-007.mp3"
        },
        {
            "title": "6: Inspiration & Criticism",
            "datePublished": "Sun, 05 Feb 2012 22:00:00 GMT",
            "description": "Does seeing the work of Saul Leiter or Herb Ritts hurt or help? What kinds of criticism can you handle and which tear you down? Less news and lots of philosophy, opinion, and deep conversation on this week's show.\n",
            "length": "36409562",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2013/otp-006.mp3"
        },
        {
            "title": "5: Apple Software Exodus",
            "datePublished": "Tue, 29 May 2012 20:15:00 GMT",
            "description": "iPhone camera apps, Facebook vs G+, why Scott Bourne is moving to Lightroom, getting sued for protecting your copyright, the genius of Saul Leiter, and more.\n",
            "length": "37197622",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2013/otp-005.mp3"
        },
        {
            "title": "4: Printing Objects",
            "datePublished": "Tue, 22 May 2012 20:15:00 GMT",
            "description": "Scanning with your dSLR, HCM interview on Charlie Rose, and a discussion of Annie Liebovitz's Olympic photos. André Kertész is Photographer of the Week.\n",
            "length": "34093421",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2013/otp-004.mp3"
        },
        {
            "title": "3: The Future of Film",
            "datePublished": "Mon, 14 May 2012 15:15:00 GMT",
            "description": "Model sues retoucher, PDN talks about the future of film, and the 2.8 Million dollar Leica. Edward Weston is Photographer of the Week.\n",
            "length": "34513263",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2013/otp-003.mp3"
        },
        {
            "title": "2: 3.6 Million Dollar Photograph",
            "datePublished": "Thu, 10 May 2012 19:15:00 GMT",
            "description": "Copyright claims, the Nikon D800, and the 3.6 Million dollar battlefield photo. Portraitist Yousuf Karsh is Photographer of the Week.\n",
            "length": "27581959",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2013/otp-002.mp3"
        },
        {
            "title": "1: Falling Bears",
            "datePublished": "Thu, 10 May 2012 14:15:00 GMT",
            "description": "In their pilot episode, Jeffery and Bill take on photographer's rights, the limits of more megapixels, and the contents of New York City's photographic archive. Parisian street photographer from the turn of the last century, Eugene Atget is Photographer of the Week.\n",
            "length": "28238139",
            "sourceUrl": "http://director.5by5.tv/d/otp/5by5.cachefly.net/audio/broadcasts/otp/2013/otp-001.mp3"
        }
    ]
}