{
    "artwork": "http://is2.mzstatic.com/image/thumb/Music4/v4/92/15/c9/9215c938-abfb-c3be-d7af-7130d3b56378/source/100x100bb.jpg",
    "description": "For entrepreneurs who want to start and grow a business. Learn how to get your business started including naming your business, choosing the right business identity, and establishing your LLC, Corporation, or Partnership. Learn marketing techniques including traditional marketing and advertising methods and internet marketing techniques to build your market and establish your brand. I want to help you start your own business so you can take control of your future.",
    "feedURL": "http://feeds2.feedburner.com/startupdaddypod",
    "podcastURL": "http://www.startupdaddy.com",
    "publisher": "comments@startupdaddy.com (Ian Gordon: Business Strategist and Online Marketer)",
    "title": "Podcast – Startup Daddy Business Startup Podcast Radio Show",
    "episodes": [
        {
            "title": "Mitch Joel Talks About Ctrl Alt Delete",
            "datePublished": "Sun, 26 May 2013 03:46:45 +0000",
            "description": "In this episode of Startup Daddy I talk with Mitch Joel about his new book, Ctrl Alt Delete: Reboot Your Business. Reboot Your Life. Your Future Depends on It.  We also touch on his thoughts about balancing what he calls the three tiers of entrepreneurial life- Family/Personal, Community, and Professional. Technology has fundamentally changed the [&#8230;]",
            "length": "0",
            "sourceUrl": "http://feedproxy.google.com/~r/startupdaddypod/~5/jzsdaas3ZZo/Ep26_Mitch_Joel_Cntrl_Alt_Delete.mp3",
            "categories": [
                "Podcast",
                "Ctrl Alt Delete",
                "Mitch Joel"
            ]
        },
        {
            "title": "The New Rules of Social SEO",
            "datePublished": "Fri, 26 Apr 2013 21:58:33 +0000",
            "description": "In this episode of Startup Daddy, I talk about the new rules of Search Engine Optimization.  The new rules of SEO rely heavily on social media, specifically having your website and content shared on social media websites. I also talk about the importance of a Google Places profile to Local Businesses. Sign up for a [&#8230;]",
            "length": "0",
            "sourceUrl": "http://feedproxy.google.com/~r/startupdaddypod/~5/PtrqBNDx9ec/SD025.mp3",
            "categories": [
                "Podcast",
                "Marketing & Branding",
                "social media marketing"
            ]
        },
        {
            "title": "Getting Your Business Off To A Great Start",
            "datePublished": "Sat, 19 Jan 2013 06:49:07 +0000",
            "description": "In this episode, of Startup Daddy I talk about some things you can do to get your business off to a great start in the coming year. I cover the 3 Words exercise started by Chris Brogan, where you pick 3 words that will frame your year. If you pick three words, please drop them [&#8230;]",
            "length": "0",
            "sourceUrl": "http://feedproxy.google.com/~r/startupdaddypod/~5/34gA101M6Cg/SD024.mp3",
            "categories": [
                "Podcast",
                "Business Ideas",
                "Planning",
                "Success Mindset"
            ]
        },
        {
            "title": "Doing The Work, Business Plans, Presentations and Pitches",
            "datePublished": "Fri, 12 Aug 2011 08:35:59 +0000",
            "description": "In this episode, of Startup Daddy, I answer some questions from audience email.  Some of the topics covered include: Do the Work, by Steven Pressfield (Amazon affiliate link) Domino Project Starting A Business Plan Getting Your Business Funded Advice About Presentations &#38; Pitches What Makes A Good Presentation or Elevator Pitch Guy Kawasaki&#8217;s 10, 20, 30 Rule for making presentations or pitches Play [&#8230;]",
            "length": "0",
            "sourceUrl": "http://feedproxy.google.com/~r/startupdaddypod/~5/9_997DwPBr4/SD023.mp3",
            "categories": [
                "Podcast",
                "business books",
                "Starting A Business",
                "Steven Pressfield"
            ]
        },
        {
            "title": "The Best Books To Read When Starting A Business",
            "datePublished": "Mon, 14 Jun 2010 19:59:03 +0000",
            "description": "In this episode of Startup Daddy, I talk about the best business books for starting a business, and a service that makes it easy to share large files with clients (or anyone else).  I get asked about books a lot, so I made a new page on this site called, Recommended Reading.  I thought it [&#8230;]",
            "length": "19099198",
            "sourceUrl": "http://feedproxy.google.com/~r/startupdaddypod/~5/H-FUHBymdGQ/SD021_ipod.m4v",
            "categories": [
                "Podcast",
                "business authors",
                "business books",
                "dropbox",
                "Starting A"
            ]
        },
        {
            "title": "The Biggest Challenge Starting My New Business So Far",
            "datePublished": "Sat, 29 May 2010 11:02:06 +0000",
            "description": "In this episode of Startup Daddy,  I talk about one of the challenges I have been facing getting my new business going.  Starting a business with young children in your life is hard. Period.  Hopefully, by talking about some of my challenges, I can encourage some of you, to push through your challenges, and not [&#8230;]",
            "length": "8712645",
            "sourceUrl": "http://feedproxy.google.com/~r/startupdaddypod/~5/l9Opmvq9lnw/SD020.mp3",
            "categories": [
                "Podcast",
                "challenges starting a business",
                "Family Life"
            ]
        },
        {
            "title": "Facebook Social Plugins- Do You Like It, Or Do You Like Like It?",
            "datePublished": "Fri, 23 Apr 2010 20:42:46 +0000",
            "description": "In this edition of Startup Daddy, I talk about changes Facebook made this week, and Facebook Social Plugins. They are big changes that impact not only traffic to your website, but the way you can market your business. If you have a Facebook Fan Page for your business or yourself, you need to know that [&#8230;]",
            "length": "11926631",
            "sourceUrl": "http://feedproxy.google.com/~r/startupdaddypod/~5/dw_5Hg2z1u4/SD019.mp3",
            "categories": [
                "Podcast",
                "Cardiac Health Foundation",
                "facebook like button",
                "facebook marketing",
                "facebook social plugins",
                "Mikey Network",
                "walk of life"
            ]
        },
        {
            "title": "Scott Stratten Interview: Unmarketing And Social Media Advice For Entreprenuers",
            "datePublished": "Fri, 09 Apr 2010 20:15:22 +0000",
            "description": "In this episode of Startup Daddy, I interview Scott Stratten, president of Unmarketing, and author of a soon to be released book: UnMarketing: Stop Marketing. Start Engaging (affiliate link). Scott has a successful company, popular marketing blog, busy speaking schedule, and a book deal with a major publisher.  I figure that&#8217;s someone you could learn [&#8230;]",
            "length": "37302704",
            "sourceUrl": "http://feedproxy.google.com/~r/startupdaddypod/~5/GPwhFUN6HJM/SD018.mp3",
            "categories": [
                "Podcast",
                "Scott Stratten",
                "social media for small business",
                "Twitter for small business",
                "UnMarketing"
            ]
        },
        {
            "title": "Creating A Professional Presence On Social Media Sites",
            "datePublished": "Wed, 17 Feb 2010 16:44:22 +0000",
            "description": "In this episode of Startup Daddy I talk about creating a professional looking presence on social media sites like Facebook and Youtube. Facebook has over 400 million active users.  More than half log in every day and the average user spends about an hour per day there. See why you should be there? In this [&#8230;]",
            "length": "6109726",
            "sourceUrl": "http://feedproxy.google.com/~r/startupdaddypod/~5/Tx0Pi_9DHbU/SD017.mp3",
            "categories": [
                "Podcast",
                "facebook",
                "facebook fan page",
                "Marketing & Branding",
                "podcamp toronto",
                "youtube channel background"
            ]
        },
        {
            "title": "From Idea To Company In 7 Days",
            "datePublished": "Fri, 22 Jan 2010 14:00:49 +0000",
            "description": "In this episode of Startup Daddy I talk about my new company, Memory Deck.  I hope that by talking about the process I&#8217;m going through as I start this new company, you will see that you can do it too. While my partner and I have been researching and planning this for months, when it [&#8230;]",
            "length": "7707850",
            "sourceUrl": "http://feedproxy.google.com/~r/startupdaddypod/~5/kiFaUeN7Lug/SD016.mp3",
            "categories": [
                "Podcast",
                "llc",
                "Memory Deck",
                "Starting A Business"
            ]
        },
        {
            "title": "Year End and New Beginnings",
            "datePublished": "Tue, 08 Dec 2009 19:44:14 +0000",
            "description": "In this episode of Startup Daddy, I’m going to talk about a new business I’m starting, and some tools I am using to collaborate with a partner in another Country.  In today’s time saver quick tip, I’m going to talk about some things that will help save you some time and money when it’s time [&#8230;]",
            "length": "7322554",
            "sourceUrl": "http://feedproxy.google.com/~r/startupdaddypod/~5/9Qi9TOvmSNE/SD015.mp3",
            "categories": [
                "Podcast",
                "Starting A Business",
                "tax preparation",
                "year end"
            ]
        },
        {
            "title": "The Business Plan Video: Elements of the business plan VIDEO PODCAST",
            "datePublished": "Wed, 04 Nov 2009 15:14:17 +0000",
            "description": "This episode of Startup Daddy is my first Video Podcast. I made a video that talks about the different kinds of business plans and the elements that a business plan should contain. About a month ago, I posted this video to YouTube. When I compare my statistics for the number of people who listen to [&#8230;]",
            "length": "21031425",
            "sourceUrl": "http://feedproxy.google.com/~r/startupdaddypod/~5/_q4_LrNr7P4/SD014.m4v",
            "categories": [
                "Podcast",
                "business plan",
                "business planning",
                "Starting A Business",
                "write a business plan"
            ]
        },
        {
            "title": "Interview With Marc Warnke Author Of ONO: Options Not Obligations",
            "datePublished": "Wed, 21 Oct 2009 10:35:25 +0000",
            "description": "In this episode of Startup Daddy I have a conversation with Marc Warnke,  author of ONO: Options Not Obligations.   A few months ago Marc popped up on my radar as he was promoting his book.  What made me stop and take notice was his concept of the Family First Entrepreneur.  This has been the way [&#8230;]",
            "length": "38137529",
            "sourceUrl": "http://feedproxy.google.com/~r/startupdaddypod/~5/l753_fK9kRg/SD013.mp3",
            "categories": [
                "Podcast",
                "Family First Entrepreneur",
                "Marc Warnke",
                "ONO.",
                "Success Mindset"
            ]
        },
        {
            "title": "What Bill Clinton Said At The Canadian National Exhibition That Every Entrepreneur Should Hear",
            "datePublished": "Mon, 31 Aug 2009 19:46:26 +0000",
            "description": "This past Saturday, I went to see Bill Clinton speak at the Canadian National Exhibition (CNE), or as the locals call it, the EX.  Whatever you think of Bill Clinton, and whatever your political views are, he said some things during his speech that every entrepreneur should hear. Though he attended the funeral for Ted [&#8230;]",
            "length": "9927253",
            "sourceUrl": "http://feedproxy.google.com/~r/startupdaddypod/~5/3xqPsUh47hI/SD012.mp3",
            "categories": [
                "Podcast",
                "Bill Clinton",
                "Canadian National Exhibition",
                "Success Mindset"
            ]
        },
        {
            "title": "Q & A: Answering Startup Questions From The Audience",
            "datePublished": "Thu, 20 Aug 2009 17:48:57 +0000",
            "description": "In this episode of Startup Daddy , I answer questions from YOU.  I really want to help you get your businesses started, and one of the ways I back that up with action is to invite you to send me your questions.  I want this to be a conversation, not a lecture.  A lot of [&#8230;]",
            "length": "14482227",
            "sourceUrl": "http://feedproxy.google.com/~r/startupdaddypod/~5/LmZCsNfoHTs/SD011.mp3",
            "categories": [
                "Podcast",
                "business advice",
                "llc",
                "start a business"
            ]
        },
        {
            "title": "Basic Financial Statements, Cash Flow, And Why You Should Write A Business Plan",
            "datePublished": "Thu, 06 Aug 2009 11:39:50 +0000",
            "description": "In this episode of the Startup Daddy podcast, I talk about the importance of writing at least a basic business plan, and how to tackle some basic financial statements: Startup Expense Table, Break-even Analysis, and Cash Flow Statement. When you write a business plan, the process is the juice.  Going through the research and thought [&#8230;]",
            "length": "17689156",
            "sourceUrl": "http://feedproxy.google.com/~r/startupdaddypod/~5/_6N3-KtmrVs/SD010.mp3",
            "categories": [
                "Podcast",
                "break-even analysis",
                "cash flow statement",
                "Starting A Business",
                "startup expense table",
                "writing a business plan"
            ]
        },
        {
            "title": "How To Get Started With Market Research and Evaluate Business Opportunities",
            "datePublished": "Thu, 21 May 2009 12:46:07 +0000",
            "description": "In this episode of the Startup Daddy Podcast, I talk about how to conduct initial market research to determine of there is a market or potential market for a particular product or service.  I also talk about some ways to evaluate an opportunity and some tools I use for market research. Today&#8217;s feature segment is [&#8230;]",
            "length": "16715760",
            "sourceUrl": "http://feedproxy.google.com/~r/startupdaddypod/~5/5lY0c1PoZKc/SD009.mp3",
            "categories": [
                "Podcast",
                "market research",
                "market research tools",
                "research",
                "start a business"
            ]
        },
        {
            "title": "Online Bookkeeping and Invoicing",
            "datePublished": "Sat, 09 May 2009 00:01:30 +0000",
            "description": "There was a weird problem with iTunes where many of you downloaded a file that was silent.  I thought the best thing to do, was to repost the file and give it a whole new record, so iTunes would look at it as a whole new podcast.  This way, if you are subscribed, you will [&#8230;]",
            "length": "22140917",
            "sourceUrl": "http://feedproxy.google.com/~r/startupdaddypod/~5/Z-yqM2yAY88/SD008b.mp3",
            "categories": [
                "Podcast",
                "bookeeping software",
                "freshbooks",
                "online invoicing"
            ]
        },
        {
            "title": "The Productivity Podcast: How To Get Into Getting Things Done",
            "datePublished": "Thu, 05 Mar 2009 18:47:06 +0000",
            "description": "In this episode of Start A Business With Startup Daddy, I talk about productivity, and two books that have put me on the path to getting more done each day: Getting Things Done, by David Allen and Zen to Done, by Leo Babauta. In order to accomplish all I have to in a given day, [&#8230;]",
            "length": "14679843",
            "sourceUrl": "http://feedproxy.google.com/~r/startupdaddypod/~5/UlNBzo4OW7E/SD007.mp3",
            "categories": [
                "Podcast",
                "Success Mindset",
                "getting things done",
                "GTD",
                "productivity",
                "Zen To Done"
            ]
        },
        {
            "title": "Home Based Business Idea: Affiliate Marketing Basics",
            "datePublished": "Fri, 13 Feb 2009 21:33:04 +0000",
            "description": "In this episode of Start A Business With Startup Daddy, I talk about Affiliate Marketing.  It is a type of home based business that offers flexible hours and location, as well as leaving plenty of time in your day to spend with your family or to pursue other interests. I explain what affiliate marketing is, [&#8230;]",
            "length": "15554413",
            "sourceUrl": "http://feedproxy.google.com/~r/startupdaddypod/~5/C7v4kE4-LFI/SD006.mp3",
            "categories": [
                "Business Ideas",
                "Podcast",
                "Starting A Business",
                "affiliate marketing",
                "home based business",
                "home business ideas"
            ]
        },
        {
            "title": "Getting Health Insurance When You Are Self Employed",
            "datePublished": "Fri, 12 Dec 2008 10:48:45 +0000",
            "description": "In this episode of Start A Business With Startup Daddy, I interview Dan Zeidler, an expert in both Individual and Group Health Insurance coverage.  He answers your questions about getting health insurance for you and your family when you are self employed, and getting coverage for you and your employees after you grow your business.  [&#8230;]",
            "length": "32901631",
            "sourceUrl": "http://feedproxy.google.com/~r/startupdaddypod/~5/1Ch_xN863lw/SD005.mp3",
            "categories": [
                "Podcast",
                "Starting A Business",
                "getting health insurance",
                "health insurance",
                "health insurance for self employed"
            ]
        },
        {
            "title": "Creating A Web 2.0 Interactive Website For Your New Business With No Programming Knowledge",
            "datePublished": "Mon, 10 Nov 2008 23:08:06 +0000",
            "description": "In this episode of Start A Business With Startup Daddy, I talk about how you can have a modern, Web 2.0, interactive website for your new business, even if your computer skills are limited to sending email and searching Google. I discuss free open source software you can use to create your website, as well [&#8230;]",
            "length": "15366588",
            "sourceUrl": "http://feedproxy.google.com/~r/startupdaddypod/~5/O2lWsN6Zt9s/SD004.mp3",
            "categories": [
                "Podcast",
                "Starting A Business",
                "create a website",
                "start a business",
                "wordpress"
            ]
        },
        {
            "title": "Setting Up Your Home Office And The Easy Way To Start Branding Your New Business",
            "datePublished": "Thu, 30 Oct 2008 18:33:50 +0000",
            "description": "In this episode of Startup Daddy, I give some tips about setting up your home office and get you started with branding by talking about getting a Business Identity Package for your new business. Creating a Logo and making sure all of the things that project the image for your company- Logo, Website, Letterhead, Business [&#8230;]",
            "length": "14261007",
            "sourceUrl": "http://feedproxy.google.com/~r/startupdaddypod/~5/ERWbw23iAec/SD003.mp3",
            "categories": [
                "Marketing & Branding",
                "Podcast",
                "Starting A Business",
                "business identity",
                "business identity package",
                "home office",
                "setup home office"
            ]
        },
        {
            "title": "Business Entity Basics: Protecting Yourself with an LLC or Corporation",
            "datePublished": "Mon, 20 Oct 2008 16:57:58 +0000",
            "description": "In this episode of Startup Daddy, I talk about the differences between business entities.  I explain Sole Proprietorships, Partnerships, Limited Liability Companies (LLC), and Corporations, and why it is so important to protect yourself. In the Time Saver Quick Tip, I recommend a virtual phone system to give you a professional image without the cost [&#8230;]",
            "length": "11005826",
            "sourceUrl": "http://feedproxy.google.com/~r/startupdaddypod/~5/JZWXnejUbv0/SD002.mp3",
            "categories": [
                "Podcast",
                "Starting A Business",
                "business entity",
                "establish an llc",
                "file an llc",
                "file corporation",
                "get an llc",
                "llc"
            ]
        },
        {
            "title": "Starting Your New Business: The Checklist Every First Time Business Owner Needs",
            "datePublished": "Wed, 08 Oct 2008 00:06:13 +0000",
            "description": "This is the premier podcast episode of Startup Daddy.  In this episode I talk about my entrepreneurial path, and how I made the leap from unhappy employee to financially independent home based business owner. In this episode you’ll also find: The basics of starting a business A checklist to get you started The 2 books [&#8230;]",
            "length": "14811209",
            "sourceUrl": "http://feedproxy.google.com/~r/startupdaddypod/~5/VTmaSwA0oKc/SD001.mp3",
            "categories": [
                "Podcast",
                "Starting A Business",
                "Success Mindset",
                "david allen",
                "e-myth",
                "getting things done",
                "michael gerber",
                "start a business",
                "startup checklist"
            ]
        }
    ]
}