{
    "artwork": "http://is5.mzstatic.com/image/thumb/Music71/v4/af/99/cb/af99cbca-48f6-80f2-30ee-006f85fcf0ab/source/100x100bb.jpg",
    "description": "Bitch Media is a feminist response to pop culture, home to whip-smart writers, artists, and activists who analyze popular media with an eye on gender, race, class, and sexuality. A new Bitch podcast comes out every Thursday: Popaganda is a 45-minute in-depth exploration of themes ranging from stand-up comedy to sex work and Backtalk is our quick, fun conversation about the week in pop culture.",
    "feedURL": "http://bitchradio.pagatim.libsynpro.com/rss",
    "podcastURL": "https://bitchmedia.org/feminist-podcasts",
    "title": "Popaganda",
    "episodes": [
        {
            "title": "Rage On",
            "datePublished": "Thu, 05 Mar 2020 19:02:48 +0000",
            "description": "<p>This week, Dahlia and Amy reflect on the past years of pop culture, feminism, and rageful conversations. Backtalk couldn’t have happened without its listeners and all of the thoughtful feedback that have sparked convos in each episode. We’ve giggled, we’ve cried, and we’ve learned so much along the way. Thanks so much for all of the support.   Always and forever, your rage cheerleaders!<br />  <br /> You can follow Amy at: <br /> https://twitter.com/amyadoyzie<br /> https://www.instagram.com/amylamjam<br /> <a href=\"http://www.byamylam.com/\">byamylam.com</a><br />  <br /> You can follow Dahlia at: <br /> https://twitter.com/salvadordahlia<br /> https://www.instagram.com/dahliabalcazar<br /> <a href= \"https://www.salvadordahlia.com/\">https://www.salvadordahlia.com</a></p>",
            "length": "97448469",
            "sourceUrl": "http://traffic.libsyn.com/bitchradio/Backtalk__Rage_On.mp3?dest-id=207567"
        },
        {
            "title": "VictimblamingToo",
            "datePublished": "Thu, 20 Feb 2020 19:29:19 +0000",
            "description": "<p>This week, Dahlia and Amy discuss comments made by Harvey Weinstein’s lawyer, Donna Rotunno, insisting that women could avoid sexual assault by not placing themselves in risky situations. Plus we read some great listener notes that start conversations. </p> <p> </p> <p>READ <br /> “Ceremonials” by Katharine Coldiron is a twelve-part lyric novella inspired by Florence + the Machine's 2011 album of the same name. Between prose and poetry, it’s about two girls who fall in love at boarding school and the ghosts that follow.</p> <p> </p> <p>WATCH <br /> Netflix’s “Next in Fashion” features amazing designers and garments, with a behind-the-scenes look at their creative process. </p> <p> </p> <p>LISTEN <br /> “Sullen Girl” by Fiona Apple</p>",
            "length": "67520222",
            "sourceUrl": "http://traffic.libsyn.com/bitchradio/Backtalk__VictimblamingToo.mp3?dest-id=207567"
        },
        {
            "title": "Cleaning Up After “American Dirt”",
            "datePublished": "Thu, 06 Feb 2020 19:48:40 +0000",
            "description": "<p>This week, Dahlia and Amy get into the controversy over the publishing industry and the book that’s too big to fail. “American Dirt” by Jeanine Cummins, and her publisher, Flatiron Books, have been at the center of discussions about how the industry decides who deserves huge advances and to have their books championed, and what writers get left behind. Will this literary drama change the publishing landscape?</p> <p> </p> <p>READ<br /> “I Know What I Am: The Life and Times of Artemisia Gentileschi” by Gina Siciliano is a gorgeous look at the life of the seventeenth-century painter.</p> <p> </p> <p>WATCH<br /> “Gloria Bell” stars Julianne Moore as a middle-aged woman living her ordinary life in this tender film.</p> <p> </p> <p>LISTEN<br /> “religion (u can lay your hands on me)” by Shura</p>",
            "length": "70102785",
            "sourceUrl": "http://traffic.libsyn.com/bitchradio/Cleaning_Up_After_American_Dirt.mp3?dest-id=207567"
        },
        {
            "title": "Weinstein in Court",
            "datePublished": "Thu, 23 Jan 2020 20:00:00 +0000",
            "description": "<p>This week Dahlia and Amy talk about the beginning of the trial against Harvey Weinstein in New York. Weinstein was first exposed in 2017 in part due to the investigative reporting by Jodi Kantor and Megan Twohey at the “New York Times.” The story of that investigation is documented in their book, “She Said,” and reveals all of the work that went into their story. </p> <p> </p> <p>WATCH<br /> “Watchmen” is a multivalent exploration of justice and corruption. Plus superheroes and great acting. </p> <p> </p> <p>READ<br /> “The Friend” by Sigrid Nunez explores grief, canine companionship, and writing life.  </p> <p> </p> <p>LISTEN<br /> “Hit Reset” by The Julie Ruin<br /> <br /></p>",
            "length": "60224509",
            "sourceUrl": "http://traffic.libsyn.com/bitchradio/Weinstein_in_Court.mp3?dest-id=207567"
        },
        {
            "title": "Happy New Year! The World Is On Fire!",
            "datePublished": "Thu, 09 Jan 2020 23:03:59 +0000",
            "description": "<p>Dahlia and Amy ring in the new year (yay!) talking about how the world is burning down (boo!). The beginning of this decade can feel hopeless, but all hope is not lost: stay informed, organize, and create change. </p> <p><br /> WATCH<br /> Not to be confused with “Celebrity Couples Therapy,” “Couples Therapy” on Showtime is a really interesting look at the work of being a therapist. There’s also a very strange and engaging new “Dracula” miniseries on Netflix. </p> <p><br /> READ<br /> “Severance” by Ling Ma is the apocalyptic dystopian consumerist novel of our times. </p> <p><br /> LISTEN<br /> “Fresh Blood” by Eels</p>",
            "length": "64236312",
            "sourceUrl": "http://traffic.libsyn.com/bitchradio/Happy_New_Year_The_World_Is_On_Fire.mp3?dest-id=207567"
        },
        {
            "title": "Trumpeachment Update",
            "datePublished": "Thu, 28 Nov 2019 13:51:31 +0000",
            "description": "<p>This week, Dahlia and Amy talk about the latest in the impeachment inquiry and whether it means we’ll finally kick Trump out of office. A whole crew of former and current government officials have appeared to testify as to whether Trump engaged in a quid pro quo with the Ukrainian president. The testimonies have revealed a Trumpian shitshow that points directly at that quid pro quo—but will it be enough to dethrone him?</p> <p> </p> <p>WATCH<br /> “Parasite” by director Bong Joon-ho is a film for our times. Bong shows us how capitalism has failed us all in this smart, funny, and anxiety-inducing film.</p> <p> </p> <p>READ<br /> “The Beautiful Ones,” a memoir that Prince was working on before his death, was meant to \"be a handbook for the brilliant community,\" \"a radical call for collective ownership, for black creativity,\" and “a book about freedom.” Featuring Prince’s own handwritten memoir pages, the book is also filled with photos, letters, and other rad Prince ephemera.</p> <p> </p> <p>LISTEN<br /> “Rich Man’s World 1%” by Immortal Technique</p>",
            "length": "65431839",
            "sourceUrl": "http://traffic.libsyn.com/bitchradio/Backtalk__Trumpeachment_Update.mp3?dest-id=207567"
        },
        {
            "title": " OK Meme-er",
            "datePublished": "Thu, 14 Nov 2019 05:40:55 +0000",
            "description": "<p><span style=\"font-weight: 400;\">This week, Dahlia and Amy talk about the meme that’s the perfect digital eye roll. “OK Boomer” is the millennial and Gen Z clapback that has some people clutching their pearls. But what does this meme say about calling out people in power and starting a conversation about what young people stand to inherit? </span></p> <p> </p> <p><span style=\"font-weight: 400;\">WATCH</span></p> <p><span style=\"font-weight: 400;\">Last Week Tonight with John Oliver’s “Eat Shit, Bob Murray” episode is a perfect middle finger to a wretched coal baron who silences critics with frivolous, expensive lawsuits. </span></p> <p> </p> <p><span style=\"font-weight: 400;\">READ</span></p> <p>\"In the Dream House\" by Carmen Maria Machado<br /> <br /></p> <p><span style=\"font-weight: 400;\">LISTEN</span></p> <p><span style=\"font-weight: 400;\">The Muffs “Sad Tomorrow”</span></p>",
            "length": "29439686",
            "sourceUrl": "http://traffic.libsyn.com/bitchradio/BackTalk_111419_v2.mp3?dest-id=207567"
        },
        {
            "title": "FaceBOO! ",
            "datePublished": "Thu, 31 Oct 2019 19:00:00 +0000",
            "description": "<p><span style=\"font-weight: 400;\">This week, Dahlia and Amy talk Facebook’s bid for world domination and what Mark Zuckerberg’s latest appearance before Congress revealed. Ahead of the 2020 elections and in the wake of influence campaigns that have led to violence around the world, it’s been asked if the social-media giant is capable of growing responsibly. (Hint: nope). </span></p> <p> </p> <p><span style=\"font-weight: 400;\">Extra reading:</span> <a href= \"https://www.nytimes.com/2019/10/29/opinion/kelly-bachman-comedian-weinstein.html\"> <span style=\"font-weight: 400;\">I’m the Comedian Who Just Confronted Harvey Weinstein. Here’s Why I Spoke Up.</span></a> <span style=\"font-weight: 400;\">[New York Times]</span></p> <p> </p> <p><span style=\"font-weight: 400;\">READ </span></p> <p><span style=\"font-weight: 400;\">“Fake Like Me” by Barbara Bourland is part art-world exposé, part murder-mystery, and all-engrossing. </span></p> <p> </p> <p><span style=\"font-weight: 400;\">WATCH </span></p> <p><span style=\"font-weight: 400;\">Jenny Slate’s Netflix Special “Stage Fright” is a quirky mix of her stand-up and documentary footage with her family. </span></p> <p> </p> <p><span style=\"font-weight: 400;\">LISTEN </span></p> <p><span style=\"font-weight: 400;\">“Which Witch” by Florence + The Machine</span></p>",
            "length": "39185608",
            "sourceUrl": "http://traffic.libsyn.com/bitchradio/Back_Talk_103119_v2.mp3?dest-id=207567"
        },
        {
            "title": "Backtalk: So Burning Books is Back?",
            "datePublished": "Thu, 17 Oct 2019 21:05:33 +0000",
            "description": "<p><span style=\"font-weight: 400;\">This week, Dahlia and Amy get into the recent campus conflict when white students with hurt feelings thought it’d be a good idea to burn books written by a visiting author. Jennine Capó Crucet was invited to Georgia Southern University to speak about her novel, which was required reading for some freshmen students at the school. Students confronted her during the Q&A and burned her novel after Capó Crucet’s lecture! Plus, we celebrate Indigenous People's Day and what it means to decolonize a federal holiday. </span></p> <p> </p> <p><span style=\"font-weight: 400;\">READ </span></p> <p><span style=\"font-weight: 400;\">In “Molly Fox’s Birthday” by Deirdre Madden, an unnamed narrator spends the day in her friend’s home. Molly is an actress visiting London, and the narrator, a playwright inhabiting Molly’s Irish cottage on her birthday, reflects on their friendship and the crafts of writing and acting. </span></p> <p> </p> <p><span style=\"font-weight: 400;\">WATCH </span></p> <p><span style=\"font-weight: 400;\">“Doubt,” starring Meryl Streep, Philip Seymour Hoffman, Amy Adams, and the incomparable Viola Davis was released in 2008 and worth a re-watch in this #MeToo moment. </span></p> <p> </p> <p><span style=\"font-weight: 400;\">LISTEN</span></p> <p><span style=\"font-weight: 400;\">“Aute Couture” by Rosalia</span></p>",
            "length": "85979648",
            "sourceUrl": "http://traffic.libsyn.com/bitchradio/BackTalk_101917_v2.mp3?dest-id=207567"
        },
        {
            "title": "Who Gets to Host the Impeachment Party?",
            "datePublished": "Fri, 04 Oct 2019 01:49:09 +0000",
            "description": "<p><span style=\"font-weight: 400;\">This week, Dahlia and Amy get into the impeachment inquiry. Hold the balloons and streamers, it’s a long road ahead to remove Trump from office. How did we arrive at this specific moment when so many outspoken politicians, especially women of color Democrats, have been calling for his removal for years? </span></p> <p> </p> <p><span style=\"font-weight: 400;\">READ </span></p> <p><span style=\"font-weight: 400;\">“Freshwater” by Akwaeke Emezi is a gorgeous and surreal exploration of fractured identity.</span> <span style=\"font-weight: 400;\"><br /></span><span style= \"font-weight: 400;\"><br /></span><span style= \"font-weight: 400;\">WATCH</span></p> <p><span style=\"font-weight: 400;\">Netflix’s “Unbelievable,” based on a true events, is a necessary look at how law enforcement can support rape survivors without inflicting more harm. </span></p> <p> </p> <p><span style=\"font-weight: 400;\">LISTEN </span></p> <p><span style=\"font-weight: 400;\">“Cities in Dust” by Siouxsie and the Banshees</span></p>",
            "length": "98061248",
            "sourceUrl": "http://traffic.libsyn.com/bitchradio/BackTalk_100319_v2.mp3?dest-id=207567"
        },
        {
            "title": "Backtalk: Toxic Diet Culture Targeting Kids",
            "datePublished": "Thu, 19 Sep 2019 13:00:00 +0000",
            "description": "<p><span style=\"font-weight: 400;\">This week, Dahlia and Amy talk about Kurbo, a weight loss app for children. The app is from Weight Watchers and they claim its purpose is to help children become healthier but experts say that an app like Kurbo can cause children to have an unhealthy relationship with food, promote eating disorders, and cause extra stress. The app feels like a ploy to create future consumers for the $72 billion diet industry and it’s so wrong. </span></p> <p> </p> <p><span style=\"font-weight: 400;\">WATCH </span></p> <p><span style=\"font-weight: 400;\">“What We Do in the Shadows” (both the movie and the FX TV series) take a hilarious mockumentary lens to vampire living. </span></p> <p> </p> <p><span style=\"font-weight: 400;\">READ </span></p> <p><span style=\"font-weight: 400;\">Yukiko Motoya’s short story collection, “The Loneliest Bodybuilder” is quirky, surreal, and so much fun to read. A must-read for contemporary Japanese literature. </span></p> <p> </p> <p><span style=\"font-weight: 400;\">LISTEN</span></p> <p><span style=\"font-weight: 400;\">“Skin & Bone” by Ambrosia Parsley</span></p>",
            "length": "89229248",
            "sourceUrl": "http://traffic.libsyn.com/bitchradio/BackTalk091919_v2.mp3?dest-id=207567"
        },
        {
            "title": "Backtalk: Back to School ",
            "datePublished": "Fri, 06 Sep 2019 03:08:10 +0000",
            "description": "<p><span style=\"font-weight: 400;\">This week, Dahlia and Amy get into the back-to-school season. We spend more than a decade in school developing our worldview and learning how to be decent human beings. What happens when the people in charge of our education are closed-minded and unwilling to accept social progress? From schools with Confederate namesakes to creating a more inclusive curriculum, here’s a look at all the ways our education can shape us. </span></p> <p> </p> <p><span style=\"font-weight: 400;\">WATCH </span></p> <p><span style=\"font-weight: 400;\">Based on the Patricia Highsmith romance novel, “The Price of Salt” (1952), “Carol” is a gorgeous film starring Cate Blanchett and Rooney Mara about unrequited lesbian love in an unaccepting time. </span></p> <p> </p> <p><span style=\"font-weight: 400;\">READ </span></p> <p><span style=\"font-weight: 400;\">“Trick Mirror: Reflections on Self delusion” by Jia Tolentino covers internet culture, scammers, reality shows, and so much more. This essay collection is truly an instant classic of the worst decade. </span></p> <p><span style=\"font-weight: 400;\"><br /></span><span style= \"font-weight: 400;\">LISTEN </span></p> <p><span style=\"font-weight: 400;\">“Darkest Hour” by Joy Crookes</span></p>",
            "length": "89602688",
            "sourceUrl": "http://traffic.libsyn.com/bitchradio/BackTalk090519_v2.mp3?dest-id=207567"
        },
        {
            "title": "Backtalk: The Power of the People ",
            "datePublished": "Thu, 22 Aug 2019 03:17:02 +0000",
            "description": "<p><span style=\"font-weight: 400;\">This week, Dahlia and Amy dig into the mass protest movements across the globe. From Puerto Rico to Portland, Oregon, people are showing up to have their voices heard en masse, demonstrating that the power of people to bring down oppressive systems is inspiring and necessary. </span></p> <p><span style=\"font-weight: 400;\">READ </span></p> <p><span style=\"font-weight: 400;\">The New York Time’s 1619 Project is a reframing of American history, centering on the first enslaved Africans and the effects of slavery that can still be felt to this day. The project is a reminder that history isn’t static and can only benefit from more perspectives. </span></p> <p><span style=\"font-weight: 400;\">WATCH </span></p> <p><span style=\"font-weight: 400;\">HBO’s Years and Years is a near-future dystopia centered on the Lyons, a British family, and how they deal with life in extraordinarily fucked up times.</span> <span style=\"font-weight: 400;\"><br /></span><span style= \"font-weight: 400;\"><br /></span><span style= \"font-weight: 400;\">LISTEN </span></p> <p><span style=\"font-weight: 400;\">Mucha Data by Cazzu</span></p> <p> </p>",
            "length": "95858048",
            "sourceUrl": "http://traffic.libsyn.com/bitchradio/BackTalk_082219_v2.mp3?dest-id=207567"
        },
        {
            "title": "BackTalk: This is What White-Supremacist Terrorism Looks Like",
            "datePublished": "Thu, 08 Aug 2019 12:06:36 +0000",
            "description": "<p><span style=\"font-weight: 400;\">This week, Dahlia and Amy are heartbroken over the spate of mass murders at the hands of white men with assault weapons. They talk about the importance of naming the acts of violence as white supremacist terrorism and how marginalized people across all communities are left vulnerable. Plus, we take a moment to celebrate the life and work of Toni Morrison, whose words and stories have forever shifted how we understand our world—for the better. </span></p>",
            "length": "102582848",
            "sourceUrl": "http://traffic.libsyn.com/bitchradio/BackTalk080819_v2.mp3?dest-id=207567"
        },
        {
            "title": "BackTalk: A Racist by Any Other Name ",
            "datePublished": "Thu, 25 Jul 2019 11:52:31 +0000",
            "description": "<p><span style=\"font-weight: 400;\">This week, Dahlia and Amy agree it’s about time for mainstream media organizations to label racists as racists. Recently, Trump tweeted to four congresswomen of color that they should go back to where they came from and accused them of being un-American. While his vile tweets were unsurprising, it was unexpected to see a national news outlet like NPR finally label it as racist. Language matters and it’s important to use the right words to describe despicable people. Plus, a shoutout to all our listeners and their support—it means so much!</span> <span style= \"font-weight: 400;\"><br /></span><span style= \"font-weight: 400;\"><br /></span><span style= \"font-weight: 400;\">READ </span></p> <p><span style=\"font-weight: 400;\">Milkman by Anna Burns, winner of the 2018 Man Booker Prize, is a stream-of-consciousness novel that depicts 1970s Belfast through the eyes of “middle sister,” a young woman who is caught between town gossip and a local paramilitary known as “the milkman,”</span> <span style= \"font-weight: 400;\"><br /></span><span style= \"font-weight: 400;\"><br /></span><span style= \"font-weight: 400;\">WATCH </span></p> <p><span style=\"font-weight: 400;\">HBO’s limited series, The Night Of, has some amazing performances and cinematography exploring the criminal justice machine and how it grinds through anyone involved in it. </span></p> <p> </p> <p><span style=\"font-weight: 400;\">LISTEN </span></p> <p> </p> <p><span style=\"font-weight: 400;\">“Alaska” by Banks is a dramatic and dreamy song for the summer.</span></p>",
            "length": "113129408",
            "sourceUrl": "http://traffic.libsyn.com/bitchradio/BackTalk072519_v3.mp3?dest-id=207567"
        },
        {
            "title": "Recasting a Disney Princess",
            "datePublished": "Fri, 12 Jul 2019 02:13:43 +0000",
            "description": "<div>This week, Dahlia and Amy talk about the live-action casting for Disney's \"The Little Mermaid.\" Halle Bailey was announced as Ariel in the upcoming film and many racists cried it would be inaccurate to have Black mermaid in this classic story. Why is it so important for viewers to see a young Black woman be cast as a Disney princess? Plus we're taking a break from Amy vs Dahlia, but leave a rate & review to let us know what you'd like us to argue about in the future. </div>",
            "length": "119772608",
            "sourceUrl": "http://traffic.libsyn.com/bitchradio/BackTalk071119_v2.mp3?dest-id=207567"
        },
        {
            "title": "The Hideous Man Who Became President",
            "datePublished": "Fri, 28 Jun 2019 21:26:53 +0000",
            "description": "<p class=\"m_7427548043454495525gmail-p1\">This week, Dahlia and Amy discuss E. Jean Carroll's cover story for New York Magazine about all of the hideous men from her life. Through her piercing and frank prose, Carroll shares an account of sexual assault at the small hands of Trump. How will this latest accusation against Trump affect his presidency—if at all? In our latest \"frivolous\" argument, Amy and Dahlia want to know what you think of the 90's comeback in fashion! Text \"fashion\" to 503-855-6485 to let us know! </p>",
            "length": "97272128",
            "sourceUrl": "http://traffic.libsyn.com/bitchradio/BackTalk_062719_v2.mp3?dest-id=207567"
        },
        {
            "title": "Backtalk: It's the End of the World & We Know It ",
            "datePublished": "Thu, 13 Jun 2019 22:07:16 +0000",
            "description": "<div>This week, Dahlia and Amy are talking about climate change. Climate science consistently shows we must curb our greenhouse gas emissions ASAP in order to stop the exponential damage to the environment, which will most likely create global climate devastation by 2050. Though we can live more conscientiously, it's also up to governmental bodies to set policies and regulations that can create larger change. The fight against climate change can feel hopeless, but at least we're in this together.<strong> </strong></div> <div> </div> <div><strong>June is Pride month and in Amy vs. Dahlia, they discuss the worst co-opting of the celebration: Is it the upcoming Straight Pride parade or how brands are unabashedly performing allyship to sell you shit? Text “pride” to 503-855-6485 share your feelings!</strong></div>",
            "length": "124903808",
            "sourceUrl": "http://traffic.libsyn.com/bitchradio/BackTalk061319_v2.mp3?dest-id=207567"
        },
        {
            "title": "The Devil Works Hard But Anti-Abortion Politicians Work Harder",
            "datePublished": "Thu, 30 May 2019 14:09:56 +0000",
            "description": "<div>This week, Dahlia and Amy discuss the recent passage of the most severe abortion ban in Alabama and what this could mean for Roe v. Wade and abortion access across the country. Anti-abortion politicians continue to argue for the sanctity of life and the personhood of a fetus while ignoring the humanity of the person who would have to carry the fetus to term—even if their pregnancy was a result of rape or incest. The devil works hard, but anti-abortion politicians work harder. And in Amy vs. Dahlia, who are both in the midst of moving across the country, we want to know what you think is the worst part about packing up and moving. Text \"moving\" to 503-855-6485 share your feelings!</div> <div> </div>",
            "length": "50777049",
            "sourceUrl": "http://traffic.libsyn.com/bitchradio/BackTalk053019_v2_.mp3?dest-id=207567"
        },
        {
            "title": "Meh of Thrones",
            "datePublished": "Thu, 16 May 2019 21:17:30 +0000",
            "description": "<div class=\"gs\"> <div class=\"\"> <div id=\":g9j\" class=\"ii gt adO\"> <div id=\":h21\" class=\"a3s aXjCH\"> <div dir=\"ltr\"> <div dir=\"auto\">This week, Dahlia and Amy get into their disappointment over the last and final season of \"Game of Thrones.\" The epic series has given audiences a big cultural moment in the world of dragons, the fight for power, and a slew of women characters to love and hate—but is it doing justice to the story? In Amy vs. Dahlia, we want to know who could have been the best leader of the Seven Kingdoms, dead or alive. Text “thrones” to 503-855-6485 to let us know what you think!</div> </div> </div> </div> </div> </div>",
            "length": "86771648",
            "sourceUrl": "http://traffic.libsyn.com/bitchradio/Back_Talk_051619_v2.mp3?dest-id=207567"
        },
        {
            "title": "Student Moans",
            "datePublished": "Thu, 02 May 2019 13:00:00 +0000",
            "description": "<p>This week, Dahlia and Amy get upset about student loans. Elizabeth Warren's campaign recently unveiled a student loan forgiveness plan as part of her platform, finally seriously centering the student debt crisis as something the government should help alleviate. How we talk about the student loan crisis is important because it can shift the focus from student responsibility to how predatory loaning is screwing us all. And we still want to know what you want to see re-booted in Amy vs Dahlia! Text “reboot” to 503-855-6485 to let us know what you think!</p> <p>WATCH<br /> Barry Jenkins's deeply moving \"If Beale Street Could Talk\" is now on Hulu and a must-watch of this James Baldwin adaptation about Black love against a harsh reality of structural anti-Black violence.</p>",
            "length": "87549248",
            "sourceUrl": "http://traffic.libsyn.com/bitchradio/BackTalk050219_v1.mp3?dest-id=207567"
        },
        {
            "title": "Backtalk: That's not consent. That's capitalism.",
            "datePublished": "Thu, 18 Apr 2019 14:55:59 +0000",
            "description": "<p><span style=\"font-weight: 400;\">This week, Dahlia and Amy get into the newest marketing ploy around consent: condoms that require four hands to open. These kinds of throwaway, viral products commodify ideas around sexual violence without actually working to solve a problem (while hoisting the blame for sexual assault away from the perpetrator), and we’re sick of it. And in Amy vs. Dahlia, we argue about what blast-from-the-past TV show needs to make a comeback.</span> <strong>Text “reboot” to 503-855-6485 to let us know what you think!</strong></p> <p> </p>",
            "length": "89746688",
            "sourceUrl": "http://traffic.libsyn.com/bitchradio/Back_Talk_041819_v2.mp3?dest-id=207567"
        },
        {
            "title": "Popaganda Revisited:  Who Writes Our History? ",
            "datePublished": "Thu, 11 Apr 2019 14:00:00 +0000",
            "description": "<p>Rebroadcasted from February 2017: History isn’t static—it’s the stories we tell ourselves about the past. And that story changes depending on who’s doing the telling. On this episode, we explore what it means to tell your own history in three different ways. Iranian-American comedian <a href= \"https://twitter.com/NeginFarsad?ref_src=twsrc%5Egoogle%7Ctwcamp%5Eserp%7Ctwgr%5Eauthor\" target=\"_blank\" rel=\"noopener\">Negin Farsad</a> talks with us being a super patriotic teen and her new book, <a href= \"https://www.hachettebookgroup.com/titles/negin-farsad/how-to-make-white-people-laugh/9781455558223/\" target=\"_blank\" rel=\"noopener\"><em>How to Make White People Laugh</em></a>. Then, writer <a href= \"https://twitter.com/baggageclaimed?ref_src=twsrc%5Egoogle%7Ctwcamp%5Eserp%7Ctwgr%5Eauthor\" target=\"_blank\" rel=\"noopener\">Jessica Machado</a> discusses the life and music of blueswoman Bessie Smith, <a href= \"https://bitchmedia.org/article/got-the-world-in-a-jug-blueswomen-feminism-bessie-smith\" target=\"_blank\" rel=\"noopener\">who told her own story in song in the 1920s and 30s</a>. Finally, we call up brilliant scholar Roxanne Dunbar-Ortiz to dig into her work, <a href= \"http://www.beacon.org/An-Indigenous-Peoples-History-of-the-United-States-P1164.aspx\" target=\"_blank\" rel=\"noopener\"><em>An Indigenous Peoples’ History of the United States</em></a>. Listen in! </p>",
            "length": "122839808",
            "sourceUrl": "http://traffic.libsyn.com/bitchradio/Popaganda041119_v1.mp3?dest-id=207567"
        },
        {
            "title": "Backtalk: What about “Us\"?",
            "datePublished": "Thu, 04 Apr 2019 19:55:50 +0000",
            "description": "<p><span style=\"font-weight: 400;\">This week, Dahlia and Amy dig into Jordan Peele's latest horror film, \"Us.\" Lots of spoilers while they talk about how the film fits into genre canons, symbolism, and what can it all mean? And in Amy vs. Dahlia, an argument about the worst of adulting. There are so many terrible things to choose from, but is it paying your bills on time or having to cook yourself? Let us know what you can't stand about being grown. Text “Adult” to 503-855-6485 to let us know what you think!</span></p>",
            "length": "112513088",
            "sourceUrl": "http://traffic.libsyn.com/bitchradio/BackTalk_040419_v2.mp3?dest-id=207567"
        },
        {
            "title": "Popaganda: Revisited - You Feel Me?",
            "datePublished": "Thu, 28 Mar 2019 18:27:37 +0000",
            "description": "<p>In this episode, we’re going to be talking about an emotion you’ve probably heard a lot about lately: empathy. The way we talk about it, it’s almost like a superpower: it’s like we want to believe that the cure to political divisiveness, racism, and even war lies in the act of imagining exactly how someone else feels. But is empathy really going to save the world?</p> <p>First, Dr. Carolyn Pedwell, associate professor in Cultural Studies at the University of Kent, explains how different people define “empathy” and use it to achieve various, and sometimes opposing, goals. One of those parties is the virtual reality industry, and tech journalist Rose Eveleth explains the potentials and pitfalls of empathic VR experiences. Then we go into another sort of empathy experience with cartoonist Ben Passmore, whose comic and animated short, “Your Black Friend,” tackles empathy in a different, sharper way. Finally, we talk with scholar and activist Frances Lee (of the Bitch 50!) about how we can practice empathy better: in a way that acknowledges the humanity of other people without making it all about ourselves.</p>",
            "length": "113235008",
            "sourceUrl": "http://traffic.libsyn.com/bitchradio/Popaganda_032819_v1.mp3?dest-id=207567"
        },
        {
            "title": "Backtalk: Scammer SZN",
            "datePublished": "Thu, 21 Mar 2019 21:04:08 +0000",
            "description": "<p><span style=\"font-weight: 400;\">This week, Dahlia and Amy get into all things scammy. The recent news of what the FBI called “Operation Varsity Blues” has revealed a multi-million dollar college admissions scheme run by an organization to aid wealthy parents in bribing university administrators and college prep tutors to pay their way into elite schools. Another day, another story about the wealthy taking advantage of systems built to maintain their status! And Amy vs. Dahlia wants to know who’s the worse scammer: baritone Silicon Valley liar, Elizabeth Holmes, or Fyre Fest disaster bro, Billy McFarland! What’s your choice? Text “Scam” to 503-855-6485 to let us know what you think!</span></p>",
            "length": "119343488",
            "sourceUrl": "http://traffic.libsyn.com/bitchradio/BackTalk032119_v2.mp3?dest-id=207567"
        },
        {
            "title": "Popaganda: Revisited - Sex Work is Work",
            "datePublished": "Fri, 15 Mar 2019 16:39:34 +0000",
            "description": "<p>From the archive: Discussions of sex work often get mired in a couple basic questions: is it “good” or “bad”? Are sex workers empowered or not? But sex workers are a diverse group—their experiences aren’t all good or bad. On this show, we try to reframe the issue by exploring the legal and financial realities of sex work.</p> <p>For example: How does a dominatrix do her taxes? What kinds of healthcare do sex workers need? How would decriminalizing sex work change peoples’ lives? </p> <p> </p>",
            "length": "125258048",
            "sourceUrl": "http://traffic.libsyn.com/bitchradio/Popaganda031419_v1.mp3?dest-id=207567"
        },
        {
            "title": "Backtalk: YA's Cancel Culture",
            "datePublished": "Thu, 07 Mar 2019 18:05:04 +0000",
            "description": "<p><span style=\"font-weight: 400;\">This week, Dahlia and Amy dig into the world of YA drama. Recently, two YA authors have chosen to cancel their own debut novels after being called out by some readers for \"problematic\" issues in the text. Dahlia and Amy talk about the effects of cancel culture that demands perfect art. Also, a Petty Political Pminute on what may be the road ahead to 45's impeachment. And Amy vs. Dahlia are debating the worst of the worst: manspreading vs mansplaning! What’s your choice? Text “Man” to 503-855-6485 to let us know what you think!</span></p>",
            "length": "107881088",
            "sourceUrl": "http://traffic.libsyn.com/bitchradio/BackTalk_030719_v2.mp3?dest-id=207567"
        },
        {
            "title": "Backtalk: Haute Couture Blackface",
            "datePublished": "Thu, 21 Feb 2019 18:27:42 +0000",
            "description": "<p>This week, Dahlia and Amy are back! They’ve got pop culture picks! They’ve got read, watch, and listen recommendations! They’ve got so many rage-induced opinions! In recent months, controversies have popped up in the news with the discovery of prominent politicians and actors donning blackface and prestige design houses releasing couture designs with unmistakable references to blackface. Amy vs. Dahlia wants to know who should win the Oscar’s Best Picture award! Amy thinks the beautifully-filmed “Roma” is the winner and Dahlia’s brilliant pick is “The Favourite.” What’s your choice? Text “Oscars” to 503-855-6485 to let us know what you think!</p>",
            "length": "104733248",
            "sourceUrl": "http://traffic.libsyn.com/bitchradio/20190221_Backtalk_v2.mp3?dest-id=207567"
        },
        {
            "title": "Backtalk: Our Favorites of 2018",
            "datePublished": "Fri, 28 Dec 2018 02:27:31 +0000",
            "description": "<p>In this episode, Dahlia, Amy, and special guest Soleil share their pop culture faves that got them through this year, from <em>Shirkers</em> and <em>The Marvelous Mrs. Maisel</em>, to online hoaxes, sandwich outfits, and <em>Queer Eye</em>. We've celebrated the best of this year's pop culture, and now we're ready for you, 2019.</p>",
            "length": "50131427",
            "sourceUrl": "http://traffic.libsyn.com/bitchradio/backtalk_122718.mp3?dest-id=207567"
        },
        {
            "title": "Backtalk: Who Gets to Make Mistakes?",
            "datePublished": "Fri, 14 Dec 2018 19:21:15 +0000",
            "description": "<div><span id= \"m_-5425352363977982460gmail-docs-internal-guid-7eaee344-7fff-1df7-bdee-9cad656de09a\"> This week, Dahlia and Amy round up some of the big hits of bad takes. From Lena Dunham's letter from the editor where she admits to lying to protect a rapist to a weird piece dissecting Ariana Grande's \"thank u, next\" music video, who gets to make mistakes over and over again? Writers get the brunt of the backlash, but how much responsibility should the editor take when they're the ones who click \"publish\"? Amy vs. Dahlia wants you to weigh in on the best winter flick! Amy can watch \"Home Alone\" every year and Dahlia loves Nora Ephron's classic \"When Harry Met Sally.\" Who do you wanna chill with more? Kevin or Sally? Text “winter” to 503-855-6485 to let us know what you think!</span></div>",
            "length": "24319062",
            "sourceUrl": "http://traffic.libsyn.com/bitchradio/backtalk_121418.mp3?dest-id=207567"
        },
        {
            "title": "Backtalk: Mind the Wage Gap",
            "datePublished": "Thu, 29 Nov 2018 22:57:24 +0000",
            "description": "<p>This week, Dahlia and Amy talk about what real allyship can look like in Hollywood and beyond. Recently, Porter magazine hosted a roundtable with Gabrielle Union, Gina Rodriguez, Ellen Pompeo, and Emma Roberts where Pompeo called on white folks to do better and Rodriguez brought up the issue of pay inequity. Who gets uncomfortable in these conversations and does it create real change? And, as promised, Amy's fave pop culture moment is this the Black Mirror-esque anti-Amazon ad. In this week’s Amy vs. Dahlia, we’re hashing out the holidays: Are you Bah! Humbag! or Merry Everything? Text “Holiday” to 503-855-6485 to let us know what you think! </p>",
            "length": "26213190",
            "sourceUrl": "http://traffic.libsyn.com/bitchradio/Backtalk_112918.mp3?dest-id=207567"
        },
        {
            "title": "Popaganda: The Pumpkin Spice Must Flow",
            "datePublished": "Thu, 22 Nov 2018 17:00:00 +0000",
            "description": "<p>At the end of summer, when the super hot days get rarer, the signs of fall appear: reddish leaves, leather jackets, people talking about football, and pumpkin spice lattes. Like death and taxes, the pumpkin spice latte seems inevitable, and it takes up an incredible amount of space in the public consciousness. So yes, we’re succumbing to the siren song and devoting a whole episode to the PSL.</p> <p>So why are we so obsessed with pumpkin spice? And why is it so easy to hate on the drink and the people who consume it? How did this assortment of spices from the Indian subcontinent become the hallmark of basicness, and what can its autumnal popularity tell us about capitalism, misogyny, and the need to belong?</p> <p>On this episode, we have a special guest! Backtalk’s Amy Lam reads an excerpt of a spicy ode to squash. In our first segment, you’ll hear from Tiffany Midge, a poet and humorist who wrote “An Open Letter to White Girls Regarding Pumpkin Spice and Cultural Appropriation.” After that, you’ll get the specialty coffee barista’s perspective from Adam JacksonBey. Then you’ll hear from Rebecca Jennings, a consumer reporter for Vox who wrote about the backlash to pumpkin spice and what it all means. Finally, Sasanka Jinadasa chimes in to remind us of what we lose when we’re so hyper focused on the meaning behind a latte.</p>",
            "length": "31741954",
            "sourceUrl": "http://traffic.libsyn.com/bitchradio/bmp_112118_pumpkinspice.mp3?dest-id=207567"
        },
        {
            "title": "Popaganda: The Fight for the Middle Ages",
            "datePublished": "Fri, 16 Nov 2018 00:53:43 +0000",
            "description": "<p style=\"font-weight: 300;\">On this episode of the show, we’ll be talking about the Middle Ages: that period in European history that most of us learned about through Game of Thrones and Robin Hood. We think of it as racially homogenous, rigidly gendered, and brutish, but scholars like the ones Soleil talks to in today’s show have more nuanced interpretations. And yet, white supremacists within the alt right are attempting to claim the Middle Ages for their own political ends. What is the truth, and why does it matter?</p> <p style=\"font-weight: 300;\">First, you’ll hear from Dr. Tory Pearman on the lives and public perception of people with disabilities in Medieval Europe. Then, Dr. Dorothy Kim elaborates on the connections between the alt right and Medieval Studies and what scholars like her are doing to take back control over the field they love.</p>",
            "length": "35226898",
            "sourceUrl": "http://traffic.libsyn.com/bitchradio/bmp_111518_medieval_FINAL.mp3?dest-id=207567"
        },
        {
            "title": "Backtalk: Thank You for Voting—Next!",
            "datePublished": "Thu, 08 Nov 2018 23:32:42 +0000",
            "description": "<p>This week, Dahlia and Amy update on the latest horrifying policies the Trump administration are hoping to force into law. Beyond the midterm elections, the monsters in the White House are working overtime to push through harmful legislation, including limiting gender to being recognized to what one is assigned at birth, an end to birthright citizen, and more terribleness. In this week’s Amy vs. Dahlia, we’re debating the worse fake politician: Veep’s Selina Meyers or Idiocracy’s President Dwayne Elizondo Mountain Dew Herbert Camacho! Text “Politician” to 503-855-6485 to let us know what you think!</p>",
            "length": "31252524",
            "sourceUrl": "http://traffic.libsyn.com/bitchradio/Backtalk110618.mp3?dest-id=207567"
        },
        {
            "title": "Popaganda: The Devil You Know",
            "datePublished": "Thu, 01 Nov 2018 23:28:59 +0000",
            "description": "<p>This episode is all about how cool the Devil is, especially for people of marginalized genders and sexualities. The devil is all over popular media, not as a straight symbol of absolute evil, but as something a little more nuanced and approachable—and sometimes even a little queer. Is this a sign of the end times and the moral degradation of humanity? Or does the character’s appeal to young people speak to a greater rejection of good vs. evil binaries?</p> <p>To find out, Soleil spoke with two experts. First, you’ll hear from Megan Kennedy, the executive director of Utah’s Religious Education Series, on the political side of evil. Then you’ll hear from Holly Lyman Antolini, the rector at St. James’s Episcopal Church in Cambridge, Massachusetts, on what it means to disregard the idea of absolute evil. We hope you enjoy the show!</p>",
            "length": "26443904",
            "sourceUrl": "http://traffic.libsyn.com/bitchradio/bmp_110118_thedevil_DRAFT.mp3?dest-id=207567"
        },
        {
            "title": "Backtalk: Let’s Take Refuge in Horror",
            "datePublished": "Thu, 25 Oct 2018 21:40:07 +0000",
            "description": "<p>This week, Dahlia and Amy get creepy and ghouly about screen horror (as opposed to the horror of our everyday lives). In this Halloweeny episode, we dig into the role of horror film and TV and how it helps us cope with our lived realities. We've also got a Petty Political Pminute starring our least favorite ventriloquist dummy, Jared Kushner. In this week’s Amy vs. Dahlia, we're debating the metaphor of the Haunting of Hill House: Is it all about childhood trauma or white supremacy? Text “Haunting” to 503-855-6485 to let us know!</p>",
            "length": "30039606",
            "sourceUrl": "http://traffic.libsyn.com/bitchradio/Backtalk_102518.mp3?dest-id=207567"
        },
        {
            "title": "Rebecca Solnit Talks Women, Activism, and Anger with Andi Zeisler",
            "datePublished": "Tue, 23 Oct 2018 20:03:01 +0000",
            "description": "<p>Even if you’ve never heard of Rebecca Solnit, you know who she is. It was Solnit’s 2008 essay at the blog TomDigest that identified the concept we know today as mansplaining. (“Most women fight wars on two fronts, one for whatever the putative topic is and one simply for the right to speak, to have ideas, to be acknowledged to be in possession of facts and truths, to have value, to be a human being.”) But long before Solnit became a patron saint of the extremely online, she was an activist, a historian, a mapmaker, and a prolific author of books on a dizzying breadth of topics: the history of walking (2000’s Wanderlust); the motion-photography pioneer Eadweard Muybridge (2004’s River of Shadows); the emerging evidence of climate change (2018’s Drowned River); and ambient cultural misogyny (2015’s essay collection Men Explain Things to Me).</p> <p>Solnit’s new book of essays, titled Call Them By Their True Names: American Crises (And Essays), connects the Trump administration, economic inequality, Indigenous history, police brutality, and gentrification gracefully, tying them together with meditations on American exceptionalism and the importance of precise language that gets right down to the lived facts of politics. Call Them By Their True Names doesn’t boil over with long-simmering ire on behalf of democracy and social justice, but rather deploys Solnit’s trademark precision, dry wit, and enduring optimism toward an absorbing whole. All the more reason to get her on the phone to talk about the role, and the necessity, of anger in a world that tosses up fresh outrages at least once a day.</p>",
            "length": "32759685",
            "sourceUrl": "http://traffic.libsyn.com/bitchradio/WR_Rebecca_Solnit_interview.mp3?dest-id=207567"
        },
        {
            "title": "Popaganda: Will Veganism Save the World?",
            "datePublished": "Fri, 19 Oct 2018 18:21:23 +0000",
            "description": "<p>On this episode of the show, we’ll be talking all about veganism and the politics of eating plants and meat. Is it possible to reduce it to a diet or wellness thing, or is it inherently political? What is the connection between industrialized meat production and patriarchy? And why does Western culture conflate eating meat with masculinity, and what does that have to do with climate change?</p> <p>Soleil will talk to two folks about the place of veganism in politics. First, you’ll hear from Carol J. Adams, author of The Sexual Politics of Meat and a recent cookbook, Protest Kitchen, on masculine anxieties around meat-eating and the progressive case for veganism. Then, Alicia Kennedy, a food and spirits writer and host of the Meatless podcast, on the complex relationships all people have with their own food choices.</p>",
            "length": "29123022",
            "sourceUrl": "http://traffic.libsyn.com/bitchradio/bmp_101918_veganism.mp3?dest-id=207567"
        },
        {
            "title": "Backtalk: What Are We Supposed to Do Now?",
            "datePublished": "Thu, 11 Oct 2018 19:17:29 +0000",
            "description": "<p>This week, Dahlia and Amy are tired, depressed, and angry—what are we supposed to do with all these awful feelings? In the wake of the Supreme Court confirmation for Brett Kavanaugh, we’re thinking about who gets to display feelings and what it tells us about where our feelings belong. Mostly, we feel rage, but it isn’t enough and we’re thinking about what productive anger can look like. And in this week’s Amy vs. Dahlia, we want to know what’s more annoying about feminist marketing: all the vaginas or the faux self-care? Text “Marketplace” to 503-855-6485 to let us know!</p>",
            "length": "32895104",
            "sourceUrl": "http://traffic.libsyn.com/bitchradio/backtalk_101118.mp3?dest-id=207567"
        },
        {
            "title": "Popaganda: The Pumpkin Spice Must Flow",
            "datePublished": "Thu, 04 Oct 2018 18:21:32 +0000",
            "description": "<p>At the end of summer, when the super hot days get rarer, the signs of fall appear: reddish leaves, leather jackets, people talking about football, and pumpkin spice lattes. Like death and taxes, the pumpkin spice latte seems inevitable, and it takes up an incredible amount of space in the public consciousness. So yes, we’re succumbing to the siren song and devoting a whole episode to the PSL.</p> <p>So why are we so obsessed with pumpkin spice? And why is it so easy to hate on the drink and the people who consume it? How did this assortment of spices from the Indian subcontinent become the hallmark of basicness, and what can its autumnal popularity tell us about capitalism, misogyny, and the need to belong?</p> <p>On this episode, we have a special guest! Backtalk’s Amy Lam reads an excerpt of a spicy ode to squash. In our first segment, you’ll hear from Tiffany Midge, a poet and humorist who wrote “An Open Letter to White Girls Regarding Pumpkin Spice and Cultural Appropriation.” After that, you’ll get the specialty coffee barista’s perspective from Adam JacksonBey. Then you’ll hear from Rebecca Jennings, a consumer reporter for Vox who wrote about the backlash to pumpkin spice and what it all means. Finally, Sasanka Jinadasa chimes in to remind us of what we lose when we’re so hyper focused on the meaning behind a latte.</p>",
            "length": "31736521",
            "sourceUrl": "http://traffic.libsyn.com/bitchradio/bmp_100418_pumpkinspice.mp3?dest-id=207567"
        },
        {
            "title": "Backtalk: We Said #MeToo, Now What?",
            "datePublished": "Thu, 27 Sep 2018 22:23:38 +0000",
            "description": "<p>This week, Dahlia and Amy discuss how the #MeToo movement can evolve beyond survivors exposing their own traumas and the role of abusers in creating real change. From public radio to the Supreme Court, what can a true reckoning with misogyny and abuse look like? We’ve also got a Petty Political Pminute—with a bonus! And in our latest Amy vs. Dahlia, we’re asking the important question of plant lady or cat lady?! Text “Pussywillow” to 503-855-6485 to let us know!</p>",
            "length": "31538826",
            "sourceUrl": "http://traffic.libsyn.com/bitchradio/Backtalk_092618.mp3?dest-id=207567"
        },
        {
            "title": "Popaganda: When People Become Internet Memes",
            "datePublished": "Fri, 21 Sep 2018 00:15:15 +0000",
            "description": "<p dir=\"ltr\">The Internet, which connects us to each other in ways that were pretty unimaginable to most people a century ago, has become a totally casual part of daily life. It’s changed so much: from the way we do business to the way we unlock our front doors. But it’s also changed the way we see ourselves and our relationships to other people. We live in a time when even children are able to use social media to juggle a front-facing, personal brand with their imperfect, true selves; and when a small gaffe could bring the rage of hundreds of thousands of strangers into your life.</p> <p dir=\"ltr\"><strong id= \"m_2218864870271884223gmail-docs-internal-guid-a53490e8-ae7a-9e2c-5b6a-8be378aadaab\"> <br /></strong>So Soleil wanted to take a step back and ask: how did things get this way? And does the Internet have to be like this?</p>",
            "length": "34424416",
            "sourceUrl": "http://traffic.libsyn.com/bitchradio/bmp_071918_internet_rerun.mp3?dest-id=207567"
        },
        {
            "title": "Backtalk: Naomi Osaka & Serena Williams Deserved Better",
            "datePublished": "Thu, 13 Sep 2018 21:00:58 +0000",
            "description": "<p><span style=\"font-weight: 400;\">This week, Dahlia and Amy talk about what went down at the U.S. Open and how it hurt both Naomi Osaka and Serena Williams. In a sport with a history of sexism and racism, specifically anti-Blackness, it's tough to ignore the unfairness lobbed at Williams during this championship match and how it overshadowed Osaka's win. And we've got time for a Petty Political Pminute! We want to know if you like your cooking shows baked in delight or like an overheated kitchen—text “Food” to 503-855-6485 to let us know!</span></p>",
            "length": "32048318",
            "sourceUrl": "http://traffic.libsyn.com/bitchradio/backtalk_091318____.mp3?dest-id=207567"
        },
        {
            "title": "Popaganda: Speaking to Specters",
            "datePublished": "Thu, 06 Sep 2018 20:03:01 +0000",
            "description": "<p><span style=\"font-weight: 400;\">Whether they expose past tragedies or family tragedies, ghosts reveal what is hidden away, under the layers of social etiquette, historical revisionism, and taboo. A poltergeist may expose unethical building practices as a ghost on videotape may reveal an unsolved murder.</span></p> <p><br /> <span style=\"font-weight: 400;\">In that way, the monster is really a messenger: of a past that won’t stay buried, of feelings that haven’t been acknowledged, of a heartache that still stings. In this episode, we’ll be talking about the storytelling potential of ghosts and the truths that emerge when they appear. First, Stu Maddux, the independent filmmaker behind the web series </span><em><span style=\"font-weight: 400;\">Queer Ghost Hunters</span></em><span style=\"font-weight: 400;\">, will speak on the task of unearthing hidden queer histories. Then you’ll hear Margaret “Maggs” Williams of the Bench Breaking Broads, an all-woman ghost-hunting crew that operate in the American South. Enjoy the show, and don’t forget to check out our Ghosts issue of Bitch magazine, on newsstands now!</span></p>",
            "length": "22523028",
            "sourceUrl": "http://traffic.libsyn.com/bitchradio/Popaganda_090618_ghosts.mp3?dest-id=207567"
        },
        {
            "title": "Popaganda: Queering Virginity",
            "datePublished": "Thu, 30 Aug 2018 16:23:09 +0000",
            "description": "<p>On her Netflix one-woman show, Nanette, Hannah Gadsby opines, “There’s only ever been two options for a little girl to grow up into: virgin or whore…. And I don’t fit neatly into either of those categories. Virgin or whore? I mean, on a technicality, I’d get virgin.” Virginity is a weird, nebulous idea that’s mostly measured in heterosexual terms. So what value does virginity hold for queer and trans people? Is it worth pulling it out of the patriarchal muck?</p> <p>So on this episode, Soleil talks to Juno Roche, a trans writer and advocate who recently authored a book called Queer Sex. Then she discusses the theological aspect of virginity with Presbyterian minister Mihee Kim-Kort, author of \"Outside the Lines: How Embracing Queerness Will Transform Your Faith.\" Enjoy the show!</p>",
            "length": "30436668",
            "sourceUrl": "http://traffic.libsyn.com/bitchradio/bmp_070518_virginity_rebroadcast.mp3?dest-id=207567"
        },
        {
            "title": "Backtalk: #MeToo Is Here To Stay",
            "datePublished": "Thu, 23 Aug 2018 20:49:55 +0000",
            "description": "<p>This week, Dahlia and Amy talk about a report that Asia Argento paid a settlement to a former castmate who accused her of sexual assault amidst questions about whether Argento’s behavior undermines the <a href= \"https://soundcloud.com/tags/MeToo\">#MeToo</a> movement. Another case has come to light about a female NYU professor who harassed and assaulted a male student and how the <a href= \"https://soundcloud.com/tags/MeToo\">#MeToo</a> movement can be inclusive for all survivors. Plus, we need your votes about the worst Marky Mark film text “Mark” to 503-855-6485 to let tell us which film was suckier.</p>",
            "length": "29139740",
            "sourceUrl": "http://traffic.libsyn.com/bitchradio/BT82218.mp3?dest-id=207567"
        },
        {
            "title": "Popaganda: Pro Wrestling with the Sublime",
            "datePublished": "Thu, 16 Aug 2018 18:51:25 +0000",
            "description": "<p>Pro wrestling hasn’t been the kindest entertainment industry for women. Relegated to Playboy-sponsored pillow fight matches or mud wrestling, women wrestlers didn’t get to shine for their athleticism or fighting prowess very often until Chyna came around in the late 90s. Her storylines were pretty meta, with male wrestlers and announcers who questioned her qualifications being on the receiving end of her feminist rage. But even then, women wrestlers like her had to constantly endure being sexually objectified and called “yapping female dogs” by the commentators. Yet pro wrestling is still very much a part of American pop culture, with folks making connections between it and other forms of expression, as an art form. So what’s the draw? Why does pro wrestling affect people so much, to the point of emotional catharsis? And… is it art? Today’s guests are two people who’ve shown me just how cool wrestling can be.</p> <p>First, I talk to Julian Burrell, producer of a really great podcast called Tights and Fights, about a wrestling match that made him cry.</p> <p>Then you’ll hear from Kath Barbadoro, a comedian and host of Wrestlesplania, a podcast where she explains to her co-host, Rachel Millman, why wrestling is good.</p> <p><strong>SHOUT-OUTS</strong></p> <p><span style=\"font-weight: 400;\">Read</span> <a href= \"https://www.bitchmedia.org/article/turning-20/wwe-attitude-era-sexism\"> <span style=\"font-weight: 400;\">April LaValle’s retrospective take on WWE’s Attitude era</span></a> <span style= \"font-weight: 400;\">for Bitch.</span></p> <p><span style=\"font-weight: 400;\">Curious about EVE?</span> <a href=\"https://www.evewrestling.com/\"><span style= \"font-weight: 400;\">Find out more about their mission, events, and wrestlers.</span></a></p> <p><span style=\"font-weight: 400;\">Check out</span> <a href= \"https://www.themarysue.com/hulk-hogan-wwe-hall-of-fame-chyna/\"><span style=\"font-weight: 400;\"> this great writeup on Chyna and her history with the WWE</span></a> <span style=\"font-weight: 400;\">at the Mary Sue.</span></p> <p><span style=\"font-weight: 400;\">If pro wrestling lingo seems a bit confusing, you can cross-reference with</span> <a href= \"https://www.complex.com/sports/2016/08/pro-wrestling-insider-terms/\"> <span style=\"font-weight: 400;\">this handy guide from Complex</span></a><span style=\"font-weight: 400;\">.</span></p>",
            "length": "31780824",
            "sourceUrl": "http://traffic.libsyn.com/bitchradio/bmp_081618_prowrestlingwiththesublime.mp3?dest-id=207567"
        },
        {
            "title": "Backtalk: The Myth of Racism Against White People",
            "datePublished": "Thu, 09 Aug 2018 19:03:52 +0000",
            "description": "<p><span style=\"font-weight: 400;\">This week, Dahlia and Amy dig into the trolling of writer and lawyer Sarah Jeong with accusations of racism against white people. Jeong was recently hired to the <em>New York Times</em> editorial board when conservative trolls dug up tweets where she mocked white folks with the likes of #CancelWhitePeople. It’s too bad that punching up with bad jokes about white people isn’t enough to get someone fired because it doesn’t cause concrete harm. Plus,</span> this might be the spiciest Amy vs. Dahlia—text “Animal” to 503-855-6485 to let us know your pick for best pet!</p>",
            "length": "30843760",
            "sourceUrl": "http://traffic.libsyn.com/bitchradio/Backtalk_080918_.mp3?dest-id=207567"
        },
        {
            "title": "Popaganda: The Blue Wave",
            "datePublished": "Thu, 02 Aug 2018 20:06:54 +0000",
            "description": "<p><span style=\"font-weight: 400;\">As we go into the 2018 midterm election season, we’ve got a lot of unknowns to think about. What can we expect to change this time around? Will there be more political upsets, like we’ve seen during the Democratic primaries in New York with the ascendancy of first-timer Alexandria Ocasio Cortez? One thing’s for sure: this year, more women, especially women of color, are running for public office than have ever before. Today, I’ll talk to two people with unique insight into how this all happened and what we can look forward to in November.</span></p> <p><span style=\"font-weight: 400;\">First, I talk to Erin Vilardi, the founder and CEO of</span> <a href= \"https://voterunlead.org/\"><span style= \"font-weight: 400;\">VoteRunLead</span></a><span style= \"font-weight: 400;\">, an organization that trains women to run for office. Then I speak to Minnesota State Senator</span> <a href= \"https://www.patriciatorresray.com/\"><span style= \"font-weight: 400;\">Patricia Torres Ray</span></a><span style= \"font-weight: 400;\">, who is seeking her party’s nomination for a Congressional seat in a few weeks, about why she’s running.</span></p> <p><span style=\"font-weight: 400;\">SHOUT-OUTS</span></p> <p><span style=\"font-weight: 400;\">Last November, Lillyanne Pham wrote an article for Bitch on</span> <a href= \"https://www.bitchmedia.org/article/women-color-running-office-2018\"> <span style=\"font-weight: 400;\">women of color candidates to watch</span></a></p> <p><span style=\"font-weight: 400;\">Curious about those Rutgers numbers? Here’s</span> <a href= \"http://cawp.rutgers.edu/buzz-2018-potential-women-candidates-us-congress-and-statewide-elected-executive\"> <span style=\"font-weight: 400;\">more data on women candidates than you can shake a stick at</span></a><span style= \"font-weight: 400;\">! Look up your state!</span></p> <p><span style=\"font-weight: 400;\">Want even</span> <em><span style=\"font-weight: 400;\">more</span></em> <span style= \"font-weight: 400;\">numbers?? The Washington Post has</span> <a href= \"https://www.washingtonpost.com/news/politics/wp/2018/07/30/the-wave-thats-building-for-november-may-not-be-blue-so-much-as-pink/?utm_term=.3fc011227f3f\"> <span style=\"font-weight: 400;\">a good review of survey data on women candidates and their favorability</span></a><span style= \"font-weight: 400;\">.</span></p>",
            "length": "29892903",
            "sourceUrl": "http://traffic.libsyn.com/bitchradio/bmp_080218_bluewave.mp3?dest-id=207567"
        },
        {
            "title": "Backtalk: Don’t Waste Hannah Gadsby’s Time",
            "datePublished": "Thu, 26 Jul 2018 19:08:24 +0000",
            "description": "<p>This week, Dahlia and Amy dig into Hannah Gadsby’s tremendous, heartbreaking, and honest Nanette. Gadsby’s Netflix special gives us insight into what it means to to tell one’s story to wide acceptance—at one’s own expense. Using comedy as an example, Gadsby asks: Is it enough to be in control of our own narratives and art if we’re still creating and consuming it through a colonized gaze? When do folks from marginalized communities get to be messy, frank, show their whole selves? Plus, let us know what you want Dahlia and Amy to argue about—text “Fight” to 503-855-6485!</p>",
            "length": "27659329",
            "sourceUrl": "http://traffic.libsyn.com/bitchradio/Backtalk_072418.mp3?dest-id=207567"
        },
        {
            "title": "Popaganda: When People Become Internet Memes",
            "datePublished": "Thu, 19 Jul 2018 13:00:00 +0000",
            "description": "<p dir=\"ltr\">The Internet, which connects us to each other in ways that were pretty unimaginable to most people a century ago, has become a totally casual part of daily life. It’s changed so much: from the way we do business to the way we unlock our front doors. But it’s also changed the way we see ourselves and our relationships to other people. We live in a time when even children are able to use social media to juggle a front-facing, personal brand with their imperfect, true selves; and when a small gaffe could bring the rage of hundreds of thousands of strangers into your life.</p> <p dir=\"ltr\"><strong id= \"m_2218864870271884223gmail-docs-internal-guid-a53490e8-ae7a-9e2c-5b6a-8be378aadaab\"> <br /></strong>So I wanted to take a step back and ask, how did things get this way? And does the Internet have to be like this?</p>",
            "length": "33922029",
            "sourceUrl": "http://traffic.libsyn.com/bitchradio/bmp_071918_internet.mp3?dest-id=207567"
        },
        {
            "title": "Backtalk: Turn off the Gaslight",
            "datePublished": "Thu, 12 Jul 2018 19:00:00 +0000",
            "description": "<p>This week, Dahlia and Amy got to thinking more about the ubiquity of gaslighting after seeing a Twitter thread by writer Carmen Maria Machado and the case against Junot Diaz. The term originates from an eponymous play and film about a husband who gaslights his wife into thinking she’s going mad and is now commonly used to describe making another person feel as if their own thoughts and memories are untrue and inaccurate. This episode explores how gaslighting operates on a larger scale when organizations and institutions use it to make us doubt our own feelings. Plus, an Amy vs. Dahlia worth getting animated about—vote by texting \"Disney\" to 503-855-6485!</p>",
            "length": "28046359",
            "sourceUrl": "http://traffic.libsyn.com/bitchradio/Backtalk_071218__.mp3?dest-id=207567"
        },
        {
            "title": "Popaganda: Queering Virginity",
            "datePublished": "Thu, 05 Jul 2018 22:51:57 +0000",
            "description": "<p><span style=\"font-weight: 400;\">On her Netflix one-woman show,</span> <em><span style= \"font-weight: 400;\">Nanette</span></em><span style= \"font-weight: 400;\">, Hannah Gadsby opines, “There’s only ever been two options for a little girl to grow up into: virgin or whore…. And I don’t fit neatly into either of those categories. Virgin or whore? I mean, on a technicality, I’d get virgin.” Virginity is a weird, nebulous idea that’s mostly measured in heterosexual terms. So what value does virginity hold for queer and trans people? Is it worth pulling it out of the patriarchal muck?\\</span></p> <p><span style=\"font-weight: 400;\">So on this episode, I’ll talk to</span> <a href=\"https://justjuno.com/\"><span style= \"font-weight: 400;\">Juno Roche</span></a><span style= \"font-weight: 400;\">, a trans writer and advocate who recently authored a book called</span> <em><span style= \"font-weight: 400;\">Queer Sex</span></em><span style= \"font-weight: 400;\">. Then I discuss the theological aspect of virginity with Presbyterian minister</span> <a href= \"http://miheekimkort.com/\"><span style=\"font-weight: 400;\">Mihee Kim-Kort</span></a><span style=\"font-weight: 400;\">, author of</span> <em><span style=\"font-weight: 400;\">Outside the Lines: How Embracing Queerness Will Transform Your Faith</span></em><span style=\"font-weight: 400;\">. I hope you enjoy the show!</span></p> <p><strong>SHOUT-OUTS</strong></p> <p><span style=\"font-weight: 400;\">Read</span> <a href= \"https://www.bitchmedia.org/article/juno-roche-queer-sex-interview\"> <span style=\"font-weight: 400;\">our interview with Juno Roche</span></a> <span style=\"font-weight: 400;\">on their book,</span> <em><span style=\"font-weight: 400;\">Queer Sex.</span></em></p> <p><span style=\"font-weight: 400;\">Curious about what it’s like to have sex with a fake hymen? Check out</span> <a href= \"https://www.thecut.com/2012/09/sex-with-a-fake-hymen.html\"><span style=\"font-weight: 400;\"> this funny review from The Cut</span></a><span style= \"font-weight: 400;\">!</span></p> <p><span style=\"font-weight: 400;\">Here’s the trailer for</span> <a href= \"https://www.youtube.com/watch?v=jXVPjg7gNBw\"><em><span style= \"font-weight: 400;\">Daddy I Do</span></em></a><span style= \"font-weight: 400;\">, a documentary on purity balls.</span></p> <p><span style=\"font-weight: 400;\">You can watch Hannah Gadsby’s</span> <em><span style= \"font-weight: 400;\">Nanette</span></em> <span style= \"font-weight: 400;\">on</span> <a href= \"https://www.netflix.com/title/80233611\"><span style= \"font-weight: 400;\">Netflix</span></a><span style= \"font-weight: 400;\">.</span></p>",
            "length": "29649233",
            "sourceUrl": "http://traffic.libsyn.com/bitchradio/bmp_070518_virginity.mp3?dest-id=207567"
        },
        {
            "title": "Backtalk: We Don’t Need to Be Civil to Inhumane People",
            "datePublished": "Thu, 28 Jun 2018 19:44:00 +0000",
            "description": "<p>This week, Dahlia and Amy survived another week where hell is empty and all the devils are here on earth. It’s been a couple weeks of horrifying news and the last thing we need to hear is how progressive folks need to be civil to the inhumane Right. It feels the the least possible harm that Stephen Miller, Kirstjen Nielsen, and Sarah Huckabee Sanders can face is to have their restaurant meals interrupted while they’re supporting an administration that’s tearing families apart at the border and putting them in detention centers. More in bad news: Screw SCOTUS. But in an attempt at some fun: a new Amy vs Dahlia!</p>",
            "length": "29609526",
            "sourceUrl": "http://traffic.libsyn.com/bitchradio/Backtalk_062818.mp3?dest-id=207567"
        },
        {
            "title": "Labors of Love",
            "datePublished": "Thu, 21 Jun 2018 19:00:00 +0000",
            "description": "<p><span style=\"font-weight: 400;\">Why do romance novels get such a bad rap? The genre is often maligned as being inferior to more “literary” writing, but there’s so much more to it than shirtless cowboys and inaccurate portrayals of BDSM etiquette. Romance writers like today’s two guests live in a complicated world. They navigate arcane sorting algorithms, racism, and more intracommunity drama than you can shake a stick at. But despite all of the hardships, they keep on working hard to make sure their readers get the happy endings they’re looking for.</span></p> <p><span style=\"font-weight: 400;\">First, we have Tracey Livesay, a former criminal defense attorney and current author of interracial romance novels. She talks about how she became a fan of the genre and why she loves its community. Second, CK Gold, writer of LGBTQ fantasy romance ebooks, shares some fascinating things she’s learned about race, marketability, and metadata.</span></p> <p><span style=\"font-weight: 400;\">SHOUT-OUTS</span></p> <p><a href= \"https://www.buzzfeed.com/bimadewunmi/meet-the-black-women-upending-the-romance-novel-industry\"> <span style= \"font-weight: 400;\">https://www.buzzfeed.com/bimadewunmi/meet-the-black-women-upending-the-romance-novel-industry</span></a></p> <p><a href= \"https://www.nytimes.com/2018/06/01/books/review/jaime-green-romance-columnist.html\"> <span style= \"font-weight: 400;\">https://www.nytimes.com/2018/06/01/books/review/jaime-green-romance-columnist.html</span></a></p> <p><a href= \"https://www.amazon.com/Billionaire-Werewolfs-Princess-Harlequin-Nocturne-ebook/dp/B076ZLWRFZ/ref=sr_1_4?s=digital-text&ie=UTF8&qid=1529021439&sr=1-4&keywords=billionaire\"> <span style= \"font-weight: 400;\">https://www.amazon.com/Billionaire-Werewolfs-Princess-Harlequin-Nocturne-ebook/dp/B076ZLWRFZ/</span></a></p>",
            "length": "29245066",
            "sourceUrl": "http://traffic.libsyn.com/bitchradio/bmp_062118_laboroflove.mp3?dest-id=207567"
        },
        {
            "title": "Backtalk: Summer Screen Faves",
            "datePublished": "Thu, 14 Jun 2018 21:06:50 +0000",
            "description": "<p><span style=\"font-weight: 400;\">This week, Dahlia and Amy are ringing in the summer raving about some of the best anticipated film and television shows coming out. Dahlia has rounded up Bitch-approved TV shows and movies premiering soon, and is obviously really loving all the great horror and true crime shows and films. Spending a few hours watching some of great television and films can be a balm against all the horrible news we’re seeing everyday. Plus, some Amy vs Dahlia results!</span></p>",
            "length": "29563551",
            "sourceUrl": "http://traffic.libsyn.com/bitchradio/Backtalk_061218.mp3?dest-id=207567"
        },
        {
            "title": "The Best Things in Life Are Freelance",
            "datePublished": "Fri, 08 Jun 2018 18:23:26 +0000",
            "description": "<p><span style=\"font-weight: 400;\">Almost half of millennials do freelance work—that is, they work as contract laborers, often in fields like writing, design, and computer programming—and the majority of those workers are women. The idea of ditching the office, the 9 to 5, and the butthead coworkers can be so tempting, but is this life all it’s cracked up to be? How do you find community when you don’t have to go anywhere to do your job? And what are your rights as a freelance worker?</span></p> <p><span style=\"font-weight: 400;\">First, we talk to</span> <a href=\"https://decorcione.wordpress.com/\"><span style= \"font-weight: 400;\">Danielle Corcione</span></a><span style= \"font-weight: 400;\">, a freelance journalist who recently looked into how #MeToo intersects with the lack of labor protections for freelancers. Then, we speak with</span> <a href= \"https://www.halunenlaw.com/our-team/emma-r-denny/\"><span style= \"font-weight: 400;\">Emma Denny</span></a><span style= \"font-weight: 400;\">, a lawyer who specializes in workplace harassment litigation, on what the options are for folks who want to fight back against sexist workplaces, both physical and digital. And finally, we go to</span> <a href= \"https://www.thecovenmpls.com/\"><span style=\"font-weight: 400;\">The Coven</span></a><span style=\"font-weight: 400;\">, a coworking space for women and nonbinary folks in Minneapolis, MN, and talk to the founders about how they took the work of building a safe and equitable space into their own hands.</span></p> <p><span style=\"font-weight: 400;\">SHOUT-OUTS</span></p> <p><a href=\"https://qz.com/859832/coworking/\"><span style= \"font-weight: 400;\">The frustrating truth I learned about co-working spaces after I was sexually harassed in one</span></a></p> <p><a href= \"https://www.citylab.com/equity/2018/01/gig-economy-freelancers-sexism-research/549578/\"> <span style=\"font-weight: 400;\">The Gig Economy May Strengthen Men's 'Invisible Advantage' at Work</span></a></p> <p><a href= \"https://s3-us-west-1.amazonaws.com/adquiro-content-prod/documents/Infographic_UP-URL_2040x1180.pdf\"> <span style=\"font-weight: 400;\">“Freelancing in America,” the survey sponsored by Upwork and the Freelancers’ Union</span></a></p>",
            "length": "35488122",
            "sourceUrl": "http://traffic.libsyn.com/bitchradio/bmp_060718_freelance.mp3?dest-id=207567"
        },
        {
            "title": "Backtalk: Racists, Stop Calling The Cops",
            "datePublished": "Fri, 25 May 2018 00:13:41 +0000",
            "description": "<p>This week, Dahlia and Amy talk about the spate of incidents of racists calling the police on Black people and POC doing everyday things. When Black and Indigenous people took up space at a Starbucks, enjoyed themselves at a park BBQ, and went on a campus visit at a university, anxious white racists took to dialing 911. This is a case of white supremacy literally policing where non-white people are allowed to go in their daily lives, posing a danger to the lives of people of color in these situations. Let’s keep talking about these incidents so they don’t become normalized. Some communities have come together to show they won’t be scared off, like the folks in Oakland around Lake Merritt. Plus, we still really want to hear about your fave Golden Girl!</p>",
            "length": "31917497",
            "sourceUrl": "http://traffic.libsyn.com/bitchradio/backtalk_052418.mp3?dest-id=207567"
        },
        {
            "title": "What Does Gender Sound Like?",
            "datePublished": "Thu, 17 May 2018 20:01:53 +0000",
            "description": "<p><span style=\"font-weight: 400;\">Music interacts with gender in surprising and strange ways: sometimes upholding the binary, sometimes undermining it. In this episode, we’ll talk to three people who’ve thought deeply about that dynamic and come up with their own interpretations of what it all means.</span></p> <p><span style=\"font-weight: 400;\">First, we discuss how gender identities are constructed through music with</span> <a href= \"http://shadolith.tumblr.com/\"><span style= \"font-weight: 400;\">Marcy Nabors</span></a><span style= \"font-weight: 400;\">, an independent composer. Then we talk to Musicology scholar</span> <a href= \"https://fillinginthegapsweb.wordpress.com/\"><span style= \"font-weight: 400;\">Emily Masincup</span></a> <span style= \"font-weight: 400;\">about how the musical motifs of the Lord of the Rings trilogy—known sausage fest—helped her enjoy the films on a deeper level. Finally, you’ll hear from</span> <a href= \"https://aidenkfeltkamp.weebly.com/\"><span style= \"font-weight: 400;\">Aiden Feltkamp</span></a><span style= \"font-weight: 400;\">, an opera librettist and producer, about “pants roles” and his fight to make opera more accessible and welcoming for LGBTQIA folks.</span></p> <p><strong>SHOUTOUTS</strong></p> <p><span style=\"font-weight: 400;\">Check out</span> <a href= \"https://daily.bandcamp.com/2017/02/16/vocaloids-our-friends-electric/\"> <span style=\"font-weight: 400;\">the Bandcamp article</span></a> <span style=\"font-weight: 400;\">Marcy references on the different ways composers are using Vocaloid audio.</span></p> <p><span style=\"font-weight: 400;\">For more on Pyotr Tchaikovsky and how sexuality figured into his work, start with</span> <a href= \"http://www.cambridge.org/us/academic/subjects/music/nineteenth-century-music/tchaikovsky-symphony-no-6-pathetique\"> <span style=\"font-weight: 400;\">this book on his 6th, or</span> <em><span style= \"font-weight: 400;\">Pathétique</span></em><span style= \"font-weight: 400;\">, Symphony</span></a><span style= \"font-weight: 400;\">.</span></p> <p><span style=\"font-weight: 400;\">And here’s</span> <a href= \"http://www.macleans.ca/society/the-interview-joni-mitchell/\"><span style=\"font-weight: 400;\"> Joni Mitchell</span></a> <span style=\"font-weight: 400;\">on her “sus chords.”</span></p>",
            "length": "29705239",
            "sourceUrl": "http://traffic.libsyn.com/bitchradio/bmp_051718_whatdoesgendersoundlike.mp3?dest-id=207567"
        },
        {
            "title": "Backtalk: Junot Diaz & MeToo",
            "datePublished": "Thu, 10 May 2018 15:42:57 +0000",
            "description": "<p>This week, Dahlia and Amy talk about the latest in this #MeToo movement and what accountability can look like. More and more stories are coming out across industries of those who are abusing their power and we’re beginning to see more claims within the literary world. Last month, Junot Diaz published a heartbreaking account of his own rape, sharing his #MeToo moment. This is in contrast to recent allegations against him as the source of other’s #MeToo stories. Can Junot Diaz reckon with his own history of abuse without further abusing others? Plus Petty Political Pminute and a Golden Girls Amy Vs. Dahlia!</p>",
            "length": "32379760",
            "sourceUrl": "http://traffic.libsyn.com/bitchradio/backtalk_051018.mp3?dest-id=207567"
        },
        {
            "title": "Birth of the New",
            "datePublished": "Thu, 03 May 2018 21:50:14 +0000",
            "description": "<p><span style=\"font-weight: 400;\">End of the world getting you down? We may never truly know what the future holds, and to some of us, the looming threat of an apocalypse is the most effective birth control. In this episode of Popaganda, Soleil digs into parenting and the end of the world: whether that means a total lifestyle change or global environmental calamity.</span></p> <p><span style=\"font-weight: 400;\">First, she talks with Chicago DSA podcast producer Eleanor Russell about the ways in which reproductive justice is tied with economic justice. Then, she discusses the revelatory work of Octavia Butler and her imaginings of the future with essayist Jade Sanchez-Ventura. Along the way, she muses about Cormac McCarthy’s book,</span> <em><span style= \"font-weight: 400;\">The Road</span></em><span style= \"font-weight: 400;\">; familiar dystopias; and Cardi B’s drive to have it all.</span></p> <p><span style=\"font-weight: 400;\">SHOUT-OUTS</span></p> <p><a href=\"https://soundcloud.com/talkin-socialism\"><span style= \"font-weight: 400;\">Talkin’ Socialism</span></a><span style= \"font-weight: 400;\">, the official podcast of the Chicago DSA.</span></p> <p><span style=\"font-weight: 400;\">You can read Jade Sanchez-Ventura’s brilliant essay, “Raising Babies in End of Days,” over at</span> <a href= \"http://muthamagazine.com/2018/03/raising-babies-end-days/\"><em><span style=\"font-weight: 400;\"> Mutha Magazine</span></em></a><span style= \"font-weight: 400;\">.</span></p> <p><span style=\"font-weight: 400;\">Here’s more info on the anthology,</span> <a href= \"http://octaviasbrood.com/\"><em><span style= \"font-weight: 400;\">Octavia’s Brood</span></em></a><em><span style= \"font-weight: 400;\">.</span></em></p> <p><span style=\"font-weight: 400;\">More on the</span> <a href= \"https://www.theguardian.com/cities/2018/mar/19/overpopulation-cities-environment-developing-world-racist-paul-ehrlich\"> <span style=\"font-weight: 400;\">racist undercurrents of overpopulation discourse</span></a><span style= \"font-weight: 400;\">.</span></p> <p><span style=\"font-weight: 400;\">The</span> <a href= \"https://secure.pmpress.org/index.php?l=product_detail&p=260\"><em> <span style=\"font-weight: 400;\">Revolutionary Women</span></em></a> <span style=\"font-weight: 400;\">book of stencils mentioned by Jade.</span></p>",
            "length": "36541379",
            "sourceUrl": "http://traffic.libsyn.com/bitchradio/bmp_050318_apocolypse.mp3?dest-id=207567"
        },
        {
            "title": "Backtalk: Summer Music Fests",
            "datePublished": "Thu, 26 Apr 2018 22:03:23 +0000",
            "description": "<p>This week, Dahlia and Amy talk about summer music fests, Beychella, and the dismal treatment of sexual harassment at festivals. This year's Coachella was a moment with Beyoncé being the first Black woman artist headlining and featuring a very pregnant Cardi B. doing her thing. But it wasn't without concerns, as outlined in a \"Teen Vogue\" piece where a writer documented all of the times she was sexually harassed. Plus we've got a literal Petty Political Pminute!</p>",
            "length": "30289964",
            "sourceUrl": "http://traffic.libsyn.com/bitchradio/backtalk_042418.mp3?dest-id=207567"
        },
        {
            "title": "Popaganda: I Saw the Sign",
            "datePublished": "Fri, 06 Apr 2018 00:22:02 +0000",
            "description": "<p class=\"p1\">Do you believe what you read in horoscopes? In pop culture, we imbue the zodiac signs with certain stereotypical behaviors. Virgos are judgmental, Leos are always starving for attention, Geminis are two-faced. The general gist is that the sun’s position in the sky relative to 12 astrological signs at the time of your birth can tell you all about the kind of person you’ll be. At least, enough to receive the same advice once a week. On this episode of Popaganda, you’ll be hearing from two people whose lives are entangled in astrology. We’ll talk about finding yourself in horoscopes, zodiac pie, and how astrology might work alongside social justice.</p> <p class=\"p1\">First, we speak with Claire Comstock-Gay, a.k.a Madame Clairevoyant, who writes weekly horoscopes for <em>The Cut</em>. We actually covered her in Bitch last year! Then we hear from Candace Kita, a community organizer who attends the Portland School of Astrology, who explains what it means to “queer” the study of the zodiac. And she reads Soleil's birth chart! Cool!</p>",
            "length": "28535371",
            "sourceUrl": "http://traffic.libsyn.com/bitchradio/Popaganda_040518.mp3?dest-id=207567"
        },
        {
            "title": "Backtalk: Nat Geo’s Racism & Spring Break",
            "datePublished": "Thu, 22 Mar 2018 21:41:11 +0000",
            "description": "<p class=\"p1\">This week, Dahlia and Amy talk about how the National Geographic is finally coming to terms with its racism and how we think about spring break in pop culture. Finally, in its 130th year, National Geographic is beginning to acknowledge its history of perpetuating colonialism through racist editorial decisions. Like, duh. The impact that the magazine has had on how folks view many parts of the world can't be understated. The same can be said about pop culture references to spring break and popular destinations that are seen as party towns without thinking about how these cities are homes to entire communities. And of course, we've got a new Amy vs. Dahlia—and this is a spicy one.</p>",
            "length": "43137611",
            "sourceUrl": "http://traffic.libsyn.com/bitchradio/Backtalk_032218.mp3?dest-id=207567"
        },
        {
            "title": "Popaganda: Faking It",
            "datePublished": "Thu, 15 Mar 2018 23:50:37 +0000",
            "description": "<p class=\"p2\">On today’s show, Soleil will be talking about one of her favorite subjects: the act of faking it. Why do we do it, and what does it mean when we accuse others of doing it? And what does the impostor tell us about the boundaries we erect in order to define ourselves and our place in the world? To answer those questions, she’ll take on the Portsmouth Sinfonia, the phenomenon of the “fake geek girl,” Rachel Dolezal, and the awful—but perhaps enlightening—film White Chicks.</p> <p class=\"p2\">We have two guests on the show this week: first, Soleil talks with Michi Trota, managing editor of the two-time Hugo Award-winning Uncanny Magazine, about how to it feels to be pushed out of a community is supposed to be all about celebrating outcasts. Then Soleil speaks with Amalia Nicholson—a content producer and cohost of the podcast Borrowed Interest, a show that focuses on the experiences of Black women in advertising—about everyone’s favorite Wayans Brothers movie (besides Don’t Be a Menace to South Central While Drinking Your Juice in the Hood, of course).</p>",
            "length": "37956171",
            "sourceUrl": "http://traffic.libsyn.com/bitchradio/031518_Popaganda.mp3?dest-id=207567"
        },
        {
            "title": "Backtalk: Good, Bad & Problematic at The Oscars",
            "datePublished": "Thu, 08 Mar 2018 22:19:25 +0000",
            "description": "<p class=\"p1\">This week, Dahlia and Amy are back to grumble and celebrate the Academy Awards. They dig into the limits of #MeToo in an industry that would continue to celebrate known abusers Gary Oldman and Kobe Bryant and overlook Ryan Seacrest's abusive behavior so he can stay on the red carpet. And the tale of two white women actors, Emma Stone and Frances McDormand, and how their different remarks reflect what White Feminism or true allyship can look like at the Oscars. And of course the latest update on the clown car show that is the Trump administration in Petty Political Pminute, and don't forget the latest Amy vs. Dahlia!</p>",
            "length": "47006659",
            "sourceUrl": "http://traffic.libsyn.com/bitchradio/BT_030818.mp3?dest-id=207567"
        },
        {
            "title": "Popaganda: Watching What You Eat",
            "datePublished": "Thu, 01 Mar 2018 23:08:25 +0000",
            "description": "<p class=\"p1\">What does it take to get “well”? When we think about wellness, especially right now, we tend to think of it as everything we do to make our lives and bodies healthy. Rather than defining health through the negation of sickness, wellness advocates press that being “well” is an ongoing process of maintenance and care. But so much of what we think about wellness is so wrapped up in watching and being watched—through fitness apps, Instagram, bureaucracy, or just the day-to-day experience of going to the grocery store.</p> <p class=\"p1\">On this episode of Popaganda, Soleil will be talking with a few folks about that peculiar facet of wellness. First, food writer Serena Maria Daniels shares her experience of growing up in a family that participated in the Supplemental Nutrition Assistance Program (SNAP) and how it feels to apply for the program as an adult. Then she talks to Dr. Elizabeth Hoover, assistant professor of American Studies at Brown University, about the ways in which Native American communities have fought for control over their food supply. Finally, eating disorder specialist Renee McGregor walks her through the trouble with “clean eating,” and the ways in which food bloggers can inadvertently encourage disordered eating.</p>",
            "length": "32906388",
            "sourceUrl": "http://traffic.libsyn.com/bitchradio/030118_Wellness.mp3?dest-id=207567"
        },
        {
            "title": "Backtalk: Stoneman Douglas & The Olympics",
            "datePublished": "Fri, 23 Feb 2018 01:38:45 +0000",
            "description": "<p>This week, Dahlia and Amy talk about the growing anti-gun student movement that’s happened since the shooting at the Parkland, Florida, high school and an update about the Winter Olympics. After the latest horrific shooting at Marjory Stoneman Douglas high school, students have rallied together to demand serious gun control and that the NRA get out of the pockets of politicians. And at this year’s Winter Olympics in Pyeongchang, a #MeToo moment with Shaun White and some incredible performances from Chloe Kim and the American figure skating team. Plus, a Petty Political Pminute and a new Amy vs. Dahlia poll!</p>",
            "length": "64896148",
            "sourceUrl": "http://traffic.libsyn.com/bitchradio/BT2_022218.mp3?dest-id=207567"
        },
        {
            "title": "Popaganda: You Feel Me?",
            "datePublished": "Sat, 17 Feb 2018 00:04:54 +0000",
            "description": "<p>Popaganda is back! In this episode, we’re going to be talking about an emotion you’ve probably heard a lot about lately: empathy. The way we talk about it, it’s almost like a superpower: it’s like we want to believe that the cure to political divisiveness, racism, and even war lies in the act of imagining exactly how someone else feels. But is empathy really going to save the world?</p> <p>First, Dr. Carolyn Pedwell, associate professor in Cultural Studies at the University of Kent, explains how different people define “empathy” and use it to achieve various, and sometimes opposing, goals. One of those parties is the virtual reality industry, and tech journalist Rose Eveleth explains the potentials and pitfalls of empathic VR experiences. Then we go into another sort of empathy experience with cartoonist Ben Passmore, whose comic and animated short, “Your Black Friend,” tackles empathy in a different, sharper way. Finally, we talk with scholar and activist Frances Lee (of the Bitch 50!) about how we can practice empathy better: in a way that acknowledges the humanity of other people without making it all about ourselves.</p> <p>This episode of Popaganda is also our new host’s first with us! Soleil’s excited to jump on board and we hope you’re looking forward to all that she’ll be bringing to the table, too.</p>",
            "length": "45808370",
            "sourceUrl": "http://traffic.libsyn.com/bitchradio/Popaganda_021618.mp3?dest-id=207567"
        },
        {
            "title": "Backtalk: Actual Bad Feminists",
            "datePublished": "Thu, 08 Feb 2018 21:23:01 +0000",
            "description": "<p>This week, Dahlia and Amy (a.k.a your friendly neighborhood rage cheerleaders) talk about Rose McGowan’s confrontation with trans activist Andi Dier and Katie Roiphe’s “feminist” screed against #MeToo. At a recent stop on her book tour, Dier asked McGowan to explain remarks she made on Rupaul’s podcast about how transwomen didn’t grow up as women. Then they talk about the Roiphe essay you don’t need to read and how exhausting contrarian feminists need to step away from writing unproductive fodder criticizing young women.</p>",
            "length": "61150398",
            "sourceUrl": "http://traffic.libsyn.com/bitchradio/BT020818.mp3?dest-id=207567"
        },
        {
            "title": "Backtalk: #MeToo Backlash & Larry Nassar Sentencing",
            "datePublished": "Thu, 25 Jan 2018 22:23:30 +0000",
            "description": "<p><span style=\"font-weight: 400;\">This week, Dahlia and Amy dig into the latest “feminist” backlash against the #MeToo movement in light of Babe.Net’s Aziz Ansari—a story which showed how a celebrity who banked on his male feminist allyship ultimately doesn’t want to respect boundaries around consent. Then they talk about the sentencing hearing for former USA Gymnastics and Michigan State University physician Larry Nassar, who has pled guilty to child molestation, and the systemic failure of powerful organizations to protect the vulnerable. Plus, another Petty Political Pminute on Trump’s terrible tweet about this year’s Women’s March and the latest in the Mueller investigation.</span></p>",
            "length": "58521017",
            "sourceUrl": "http://traffic.libsyn.com/bitchradio/Backtalk_12518.mp3?dest-id=207567"
        },
        {
            "title": "Backtalk: Is It Really Time’s Up in Hollywood?",
            "datePublished": "Thu, 11 Jan 2018 22:58:34 +0000",
            "description": "<p>In this first episode of 2018, Dahlia and Amy get into this year's Golden Globes, the Time's Up movement, and the misguided obsession for Oprah 2020. The Golden Globes is the first awards show since the fallout from the Weinstein effect and it didn't shy away from talking about <a href= \"https://soundcloud.com/tags/MeToo\">#MeToo</a> and the latest movement to announce that Time's Up for sexual harassment and violence against women in the industry. But is it all for show and what will real, concrete change look like? Plus, they kick off another segment of Petty Political Pminute with all the best/worst details from Michael Wolff's tell-all of the first days of the Trump White House in Fire and Fury.</p>",
            "length": "66273742",
            "sourceUrl": "http://traffic.libsyn.com/bitchradio/Backtalk_011118.mp3?dest-id=207567"
        },
        {
            "title": "Backtalk: We Made It Through 2017",
            "datePublished": "Thu, 28 Dec 2017 22:43:30 +0000",
            "description": "<p>Pour yourself a sweet drink because we made it through 2017! The year that felt like a decade with the inauguration of 45, no gun reform in sight, attacks on marginalized communities through policies, the normalization of supremacists, and, of course, the Weinstein effect. But we made it through because we have one another and we believe in the possibility of real concrete change. On this episode, Dahlia and Amy share their pop culture faves that got them through this year from Latinx pop music and the TV series based on Margaret Atwood’s “The Handmaid’s Tale” and “Alias Grace” to the November elections and pro-athletes taking a stand by taking a knee. We have hope, power in numbers, and we’re ready for 2018 for more inspiring pop culture and for invites to impeachment parties. Don’t let the bastards grind you down.</p>",
            "length": "47198921",
            "sourceUrl": "http://traffic.libsyn.com/bitchradio/backtalk_122817.mp3?dest-id=207567"
        },
        {
            "title": "Backtalk: Silence Breakers & The Weinstein Effect",
            "datePublished": "Fri, 15 Dec 2017 00:45:38 +0000",
            "description": "<p>This week, Dahlia and Amy breakdown Time’s much-anticipated “Person of the Year” magazine cover and cover story, and the continued fallout from the Weinstein effect. We thank our respective dieties that Trump’s ego isn’t being fed for being on the Time cover, but another white supremacist icon graces its cover instead. Taylor Swift accompanies Ashley Judd, agricultural worker Isabel Pascual, former Uber engineer Susan Fowler, lobbyist Adama Iwu, and an anonymous hospital worker who represents those who are unable to speak out publicly. Though Swift had her own sexual harassment suit to contend with, we dig into whether or not she’s really a “silence breaker.” Then they discuss the latest batch of folks of predators and why Woody Allen is still a protected Hollywood institution (like, wyd, Kate Winslet?).</p>",
            "length": "58545677",
            "sourceUrl": "http://traffic.libsyn.com/bitchradio/backtalk_121417.mp3?dest-id=207567"
        },
        {
            "title": "Backtalk: Believe Women & Just Say No to Normalizing Nazis",
            "datePublished": "Fri, 01 Dec 2017 02:17:17 +0000",
            "description": "<p>Ya’ll, it’s finally December. 2017 is nearing an end and the outrageous news cycle keeps churning. This week, Dahlia and Amy talk about the latest attempt by conservative “infiltration” group Project Veritas to discredit the “Washington Post” for covering the sexual abuse allegations against Alabama candidate for the Senate Roy Moore and how this undermines the true stories of survivors. Lena Dunham didn’t need to get involved either, but she “naively” thought it was a good idea to release a statement in support of her friend, former “Girls” writer and accused sexual assaulter, Murray Miller. Then they dig into the latest debacle that is a a “New York Times” profile of a Nazi sympathizer and how it fails to reveal anything behind the pathology of white supremacy while normalizing neighborly hate.</p>",
            "length": "53940184",
            "sourceUrl": "http://traffic.libsyn.com/bitchradio/backtalk_113017.mp3?dest-id=207567"
        },
        {
            "title": "Backtalk: Louis C.K. & Election 2017",
            "datePublished": "Thu, 16 Nov 2017 20:37:23 +0000",
            "description": "<p>Another episode, another week of yell-talking about the latest revelations of sexual harassment and assault. This week, Dahlia and Amy declare that Louis C.K. is cancelled after he’s finally admitted that the alleged rumors about him are true, albeit through a terrible nonapology. And they talk about the assault claims against Alabama candidate for Senate Roy Moore that will piss you off because a known child molester is actually considered a viable Republican candidate. But we end on a positive note! There were some historic, inspiring, and hopeful victories across the country so that 2017 isn’t just one big toilet bowl of a year after all.</p>",
            "length": "60804746",
            "sourceUrl": "http://traffic.libsyn.com/bitchradio/backtalk_111617.mp3?dest-id=207567"
        },
        {
            "title": "The Year That’s Lasted a Lifetime: An Election Retrospective",
            "datePublished": "Wed, 08 Nov 2017 21:58:40 +0000",
            "description": "<p>It has been exactly 365 days since the election of Donald Trump. For many of us, that day marked the beginning of a year of resistance. In this election special, Bitch staff share what that fateful day sparked in us, how it changed us, and how it moved us to action. We are here for our community and invite you to share your stories with us on social media using #BitchVotes2017.</p>",
            "length": "20674395",
            "sourceUrl": "http://traffic.libsyn.com/bitchradio/Election_Special_FINAL2.mp3?dest-id=207567"
        },
        {
            "title": "Backtalk: Indictment Day & Kevin Spacey",
            "datePublished": "Fri, 03 Nov 2017 00:52:34 +0000",
            "description": "<p><span style=\"font-weight: 400;\">This week, Dahlia and Amy dig into the beginning of the indictments against Trump-adjacent folks and the latest crop of sexual abuse allegations against powerful men. There’s a moment of mini-celebrations because FBI director’s Robert Mueller’s investigation into Trump’s campaign team and possible collusion with Russian officials. Indictments were served for former Trump campaign manager Paul Manafort and his business partner Rick Gates. Trump’s former advisor, George Papadopoulos, plead guilty to lying to the FBI! Yowza. Prayer hand emojis for more days of indictment to come. Then they discuss the latest in Hollywood BS with actor Anthony Rapp’s story of a 26-year-old Kevin Spacey making sexual advances against Rapp when he was just 14 years old. Spacey tried to divert from attention to this by coming out as a gay man. Ugh.</span></p>",
            "length": "46207939",
            "sourceUrl": "http://traffic.libsyn.com/bitchradio/backtalk_110217.mp3?dest-id=207567"
        },
        {
            "title": "Backtalk: Weinstein, #MeToo, Everything is Terrible",
            "datePublished": "Thu, 19 Oct 2017 23:24:17 +0000",
            "description": "<p>This week, Dahlia and Amy talk-yell about all of the sexual harassment and assault allegations against Hollywood producer, Harvey Weinstein, and its impact on the industry and beyond. Following breaking stories from the New York Times and the New Yorker, more than 40 women have come forward with their own stories of abuse from Weinstein. This case against Weinstein can introduce a sea change in both the film industry and beyond, but this episode also discusses the limits of survivors sharing their trauma for empathy, like in the case with #MeToo tag. Women have faced sexual assault and harassment since approximately forever, will exposing ourselves with #MeToo create impactful cultural change? They also dig into Mayim Bialik’s victim-blamey NYT op-ed where she posits that maybe ladies wouldn’t be so easily harassed if they’d only just dress more modestly (she’s since apologized for her misguided essay).</p>",
            "length": "58100132",
            "sourceUrl": "http://traffic.libsyn.com/bitchradio/backtalk_101917.mp3?dest-id=207567"
        },
        {
            "title": "Backtalk: Lone Wolf Myth & Kneeling for Justice",
            "datePublished": "Fri, 06 Oct 2017 14:00:00 +0000",
            "description": "<p>This week, Dahlia and Amy talk about how mainstream media upholds white supremacy by continually casting white, male, mass murderers as “lone wolves.” This week marked the deadliest mass shooting in recent US history, where Stephen Paddock gunned down 58 people and injured 500 more, yet there have been headlines humanizing him and how he “enjoyed gambling, country music; lived quiet life before massacre.” Let’s not kid ourselves, the story about the killer would be much different if he wasn’t white. Then they discuss the latest in pro-athletes protests as the NFL season gets underway, and how no one respects Trump the “bum.” Speaking of him, in the Mr. Toad Trump’s Wild Ride segment, they dig into his purposeful and racist inaction in the face of a natural disaster in Puerto Rico.</p>",
            "length": "54023358",
            "sourceUrl": "http://traffic.libsyn.com/bitchradio/backtalk_100517.mp3?dest-id=207567"
        },
        {
            "title": "Backtalk: Jemele Is Not Wrong & The Emmys",
            "datePublished": "Thu, 21 Sep 2017 22:44:57 +0000",
            "description": "<p>This week, Dahlia and Amy talk about the very factual statement: Donald Trump is a white supremacist, as tweeted by sports journalist and truth-teller Jemele Hill, and the highs and lows of this year’s Emmys. Last week, Trump supporters were in an uproar over Hill’s tweets calling Trump out for exactly who is and the White House did not take kindly to it—Sarah Huckabee Sanders remarked that Hill should lose her job over the tweets! Then they celebrate some of the great Emmy wins and groan about the Sean Spicer cameo no one asked for. In this week’s Mr. Toad Trump’s Wild Ride, they talk about the impact of taking away DACA status from its recipients and what’s on the forecast for the policy.</p>",
            "length": "56232273",
            "sourceUrl": "http://traffic.libsyn.com/bitchradio/backtalk_092117.mp3?dest-id=207567"
        },
        {
            "title": "Big News for Popaganda",
            "datePublished": "Thu, 14 Sep 2017 22:17:42 +0000",
            "description": "<p class=\"m_-6818547586622572099m_-2219538927769555514gmail-p1\"> <span class= \"m_-6818547586622572099m_-2219538927769555514gmail-s1\">We've got something to share this week and a special interview. Bitch Media Editorial Director Lisa Factora-Borchers talks with Sarah Mirk about her favorite memories over her four years hosting the show and what's next for her work-wise.</span></p>",
            "length": "31502046",
            "sourceUrl": "http://traffic.libsyn.com/bitchradio/bmp_091417_goodbye.mp3?dest-id=207567"
        },
        {
            "title": "Backtalk Goes Back to School",
            "datePublished": "Thu, 07 Sep 2017 16:00:00 +0000",
            "description": "<p><span style=\"font-weight: 400;\">This week, Dahlia and Amy go back to school! They talk about some of their fave school memories like Dahlia and chicken mummies (!!), and Amy and wearing her first-day-of-school clothes for all the days of the week. And they dig into some of their favorite pop culture that helped them get through school. Dahlia was a baby riot goth who loved bands like Jack off Jill and telenovelas on Univision. Amy can’t stop talking about the 90’s teen drama,</span> <em><span style= \"font-weight: 400;\">My So Called Life</span></em><span style= \"font-weight: 400;\">. Then they discuss the Trump administration's latest attack on equity by investigation alleged race-based discrimination due to affirmative action in university admissions. And to close out this week’s special episode, they’re listening to Hop Along’s “</span><a href= \"https://www.youtube.com/watch?v=AfkfPGu6P74\"><span style= \"font-weight: 400;\">Young and Happy</span></a><span style= \"font-weight: 400;\">.”</span></p>",
            "length": "56504364",
            "sourceUrl": "http://traffic.libsyn.com/bitchradio/backtalk_090717.mp3?dest-id=207567"
        },
        {
            "title": "Backtalk: Trump & Tina Fey Respond to Charlottesville",
            "datePublished": "Thu, 24 Aug 2017 22:02:45 +0000",
            "description": "<p>This week, Dahlia and Amy dive into the two of the most awful and inadequate responses to the white supremacist rally in Charlottesville, Virginia. Beginning with Trump’s comments that there was “blame on both sides” when violence erupted at the “Unite the Right” rally last week, resulting in the murder of Heather Heyer when a white supremacist plowed his car into a group of counter-protestors. Then they discuss Tina Fey’s latest segment on a special “SNL Weekend Update” where she suggests fighting white supremacy by eating sheet cake. Really. But not all hope is lost, especially when people left the sheet cake at home and hit the streets to show up against white supremacists, like in Boston when a massive group of counter protestors greatly outnumbered the alt-right rally.</p>",
            "length": "42181739",
            "sourceUrl": "http://traffic.libsyn.com/bitchradio/backtalk_082417.mp3?dest-id=207567"
        },
        {
            "title": "Food Writing",
            "datePublished": "Thu, 17 Aug 2017 22:24:23 +0000",
            "description": "<div>Chow down on food politics. On this episode, three food writers of color talk about reshaping food media. It's often tricky to discuss race, gender, and class in the food industry! We hear from chef and \"Racist Sandwich\" podcast host Soleil Ho, Eater and <em>A Hungry Society</em> writer Korsha Wilson, and Thrillist editor Khushbu Shah.</div>",
            "length": "46643035",
            "sourceUrl": "http://traffic.libsyn.com/bitchradio/bmp_081717_foodpolitics.mp3?dest-id=207567"
        },
        {
            "title": "Backtalk: Google Manifesto & Transphobia Is Not a Joke",
            "datePublished": "Thu, 10 Aug 2017 20:48:44 +0000",
            "description": "<p><span style=\"font-size: 8pt;\">This week, exemplifies the question that <a href= \"http://www.vogue.com/article/fashion-runway-frank-ocean-t-shirt-panorama-brandon-male-twitter\"> <span style=\"font-weight: 400;\">Frank Ocean’s t-shirt</span></a> <span style=\"font-weight: 400;\">asked: “”Why be racist, sexist, homophobic or transphobic when you could just be quiet?” Dahlia and Amy talk about the terribly misguided memo from a Google employee and the deplorable transphobia on the Breakfast Club. Recently, it was reported that</span> <a href= \"https://motherboard.vice.com/en_us/article/evzjww/here-are-the-citations-for-the-anti-diversity-manifesto-circulating-at-google\"> <span style=\"font-weight: 400;\">a senior software engineer at Google decided that he needed to spread the good word</span></a> <span style=\"font-weight: 400;\">around biological determinism as the reason behind the low number of women working in tech. This</span> <a href= \"http://gizmodo.com/exclusive-heres-the-full-10-page-anti-diversity-screed-1797564320\"> <span style=\"font-weight: 400;\">10-page manifesto</span></a> <span style=\"font-weight: 400;\">was leaked to the public and quickly went viral. They discuss how popular radio show, the Breakfast Club, is under fire for an interview where the hosts laughed as their comedian guest, Lil Duval, spewed harmful, violent transphobia—just a few days after</span> <a href= \"https://www.allure.com/story/janet-mock-response-the-breakfast-club-trans-women\"> <span style=\"font-weight: 400;\">writer Janet Mock had appeared on the show</span></a><span style=\"font-weight: 400;\">. This radio segment comes with the latest report that</span> <a href= \"http://www.vulture.com/2017/08/dave-chappelle-radio-city-music-hall-review.html\"> <span style=\"font-weight: 400;\">Dave Chapelle’s residency at Radio City Music Hall</span></a> <span style=\"font-weight: 400;\">opens with transphobic jokes. And in this week’s Petty Political Pminute, we talk about the latest worst person inside the sad White House walls, Stephen Miller, and how everyone in the current administration are ugly toes on the most wretched foot you’ve ever seen.</span></span></p>",
            "length": "39537311",
            "sourceUrl": "http://traffic.libsyn.com/bitchradio/backtalk_081017.mp3?dest-id=207567"
        },
        {
            "title": "Beach Bodies",
            "datePublished": "Thu, 03 Aug 2017 23:17:21 +0000",
            "description": "<p>Every body is a beach body, amiright? On this episode, we hit the sands of a nude beach, travel through the woods, and chat about eating cheeseburgers poolside in discussions about learning to love our bodies. Featuring fat-positive fashion blogger Jessica Torres, artist and model Sawyer DeVuyst, Jenny Bruso of Unlikely Hikers, and an oral history of the racial segregation of American pools.</p>",
            "length": "39248501",
            "sourceUrl": "http://traffic.libsyn.com/bitchradio/bmp_080317_beachbodies.mp3?dest-id=207567"
        },
        {
            "title": "Backtalk: Military Trans Ban & Limits of White Imagination",
            "datePublished": "Thu, 27 Jul 2017 23:29:02 +0000",
            "description": "<p><span style=\"font-weight: 400;\">This week, Dahlia and Amy dig into the latest in Trump BS and the controversy around an upcoming project from the</span> <em><span style=\"font-weight: 400;\">Game of Thrones</span></em> <span style=\"font-weight: 400;\">showrunners. Earlier this week, Trump announced via three tweets (how presidential!) that he intends to ban transgender people from serving in the military. What are potential impacts of this policy, will it come to fruition, and is this just another inflammatory announcement meant to rile everyone up? They also talk about latest news around a television project in the works from the showrunners of the</span> <em><span style=\"font-weight: 400;\">Game of Thrones</span></em><span style=\"font-weight: 400;\">, which is tentatively titled</span> <em><span style= \"font-weight: 400;\">Confederate</span></em> <span style= \"font-weight: 400;\">and will supposedly present a vision of the USA if the Union had lost and the enslavement of Africans continued. Smdh forever.</span></p>",
            "length": "37528181",
            "sourceUrl": "http://traffic.libsyn.com/bitchradio/backtalk_072717.mp3?dest-id=207567"
        },
        {
            "title": "Invisibility",
            "datePublished": "Thu, 20 Jul 2017 19:00:00 +0000",
            "description": "<div dir=\"ltr\"> <div>Seeing the unseen. We talk about the often-invisible work that goes into emotional labor with Leah Lakshmi Piepzna-Samarasinha and hear from Andrea Ritchie, the author of Invisible No More: Police Violence Against Black Women and Women of Color. Plus: new music from artist Julia Weldon. </div> </div>",
            "length": "48033585",
            "sourceUrl": "http://traffic.libsyn.com/bitchradio/bmp_072017_invisibility.mp3?dest-id=207567"
        },
        {
            "title": "Backtalk: Hollywood Shenanigans—Revenge Porn & Unequal Pay",
            "datePublished": "Thu, 13 Jul 2017 22:06:15 +0000",
            "description": "<p><span style=\"font-weight: 400;\">This week, Dahlia and Amy get into the latest in Hollywood shenanigans. First up is the potential prosecution of the sole Kardashian brother, Rob Kardashian, for posting revenge porn against his ex-fiancé and mother of his infant daughter, Blac Chyna. Revenge porn is another realm of online harassment that often targets women and Rob Kardashian’s online meltdown might bring greater awareness to how posting nude photos of other people is illegal in 34 states. Then they dig into the latest conversation around unequal pay in Hollywood spurred by the news that</span> <em><span style=\"font-weight: 400;\">Hawaii Five-O</span></em> <span style=\"font-weight: 400;\">stars Daniel Dae Kim and Grace Park did not renew their contracts because they weren’t being paid as much as their white male costars, and Emma Stone shares a story of how her white male costars have had to take a pay cut so that she can have pay equity on her films. Such shenanigans, much misogyny. Also another Petty Political Pminute covering the latest in Russian collusion leaving Dahlia and Amy wondering if Trump has ordered a U-Haul yet because they need to vacate their present residence.</span></p>",
            "length": "37909778",
            "sourceUrl": "http://traffic.libsyn.com/bitchradio/backtalk_071317.mp3?dest-id=207567"
        },
        {
            "title": "Life in Late Capitalism",
            "datePublished": "Thu, 06 Jul 2017 22:00:00 +0000",
            "description": "<div>We hear three stories about the ways capitalism seeps into our ideas of success, failure, and freedom. Disability rights activist Stephanie Woodward tells us what it's like to occupy a Republican senators' office with a crew of wheelchair-using protesters. The co-founder of POOR magazine breaks down ways the United States makes it illegal to be poor. And a youth mentor shares her perspective on being a first-generation American who's expected to put her paycheck above all else.</div>",
            "length": "47153363",
            "sourceUrl": "http://traffic.libsyn.com/bitchradio/bmp_070617_lifeinlatecapitalism.mp3?dest-id=207567"
        },
        {
            "title": "Backtalk: Where’s the Justice? & Beguiling Whiteness",
            "datePublished": "Thu, 29 Jun 2017 19:15:02 +0000",
            "description": "<p>This week, Dahlia and Amy discuss the disappointing verdicts in both the mistrial in the sexual assault case against Bill Cosby and the acquittal of the police officer who murdered Philando Castile. They also get into the beguiling whiteness of “The Beguiled,” a film set during the Civil War with an all-white main cast. We get to rub our petty hands in this week’s Petty Political Pminute since there’s been a delay in voting for Trumpcare—a healthcare plan to ensure the rich remain alive and richer, while working folks try to figure out basic healthcare needs.</p>",
            "length": "38328155",
            "sourceUrl": "http://traffic.libsyn.com/bitchradio/backtalk_062917.mp3?dest-id=207567"
        },
        {
            "title": "Redefining Dating",
            "datePublished": "Thu, 22 Jun 2017 19:30:00 +0000",
            "description": "<div>Let's talk about sex! And also not having sex! This episode looks at how there's no such thing as \"traditional\" dating. Dating norms have evolved over our history and continue to grow and change as we have more freedom to define happiness for ourselves. We talk with Moira Weigel, the author of the book Labor of Love: The Invention of Dating, and the founder of NYC's meetup group for asexual and agender folks. Plus, sex positive selfie enthusiast Ev'yan Whitney interviews a very special person about dating: her mom.</div>",
            "length": "45462718",
            "sourceUrl": "http://traffic.libsyn.com/bitchradio/bmp_062217_redefiningdating.mp3?dest-id=207567"
        },
        {
            "title": "Backtalk: Oh Really, Megyn Kelly? & Bustle’s Hustle",
            "datePublished": "Thu, 15 Jun 2017 19:23:57 +0000",
            "description": "<p>This week, Dahlia and Amy get really, very, super frustrated about Megyn Kelly’s new NBC show where she’ll feature fake news, conspiracy theorist Alex Jones. They also dig into how Bustle is trying to hustle their readers into giving up their personal information under the guise of delivering more personalized content—all the while ripping off Bitch Media’s donor circle name. And in the Petty Political Pminute, it’s all about Comey’s hearings and the lying, liar-ness of Trump.</p>",
            "length": "58513494",
            "sourceUrl": "http://traffic.libsyn.com/bitchradio/backtalk_061517.mp3?dest-id=207567"
        },
        {
            "title": "Video Games and Identity",
            "datePublished": "Thu, 08 Jun 2017 18:52:03 +0000",
            "description": "<p class=\"m_6461300262111535026gmail-p1\">Our Final Fantasy characters, ourselves. Writer Sam Riedel walks us through the ramifications of Gamergate and how role-playing games helped her articulate her trans identity. Then, we talk with scholar Saud Al-Zaid about the connection between massively popular first-person-shooter games like Call of Duty and the U.S. military.</p>",
            "length": "43469889",
            "sourceUrl": "http://traffic.libsyn.com/bitchradio/bmp_060817_videogames.mp3?dest-id=207567"
        },
        {
            "title": "Backtalk: White Supremacy Kills & DAPL Update",
            "datePublished": "Thu, 01 Jun 2017 18:35:30 +0000",
            "description": "<p><span style=\"font-weight: 400;\">This week, Dahlia and Amy talk about the horrific attack in Portland by a known white supremacist and the newly-leaked documents that reveal that counterterrorism tactics were used against water protectors at Standing Rock to protect corporate interests. And in this Petty Political Pminute: What is going on with Trump’s handholding and handshakes?</span></p>",
            "length": "46233017",
            "sourceUrl": "http://traffic.libsyn.com/bitchradio/backtalk_060117.mp3?dest-id=207567"
        },
        {
            "title": "Radical Science",
            "datePublished": "Thu, 25 May 2017 18:50:34 +0000",
            "description": "<p class=\"m_533606734830285970gmail-p1\">Behold! Using the power of science to interrogate societal assumptions around race and gender! We talk with experimental physicist Dr. Chanda Prescod-Weinstein about the physics of melanin and then biologist and sociologist Shay-Akil McLean about decolonizing science—and the physical marks that inequality leaves on our bones.</p>",
            "length": "44226395",
            "sourceUrl": "http://traffic.libsyn.com/bitchradio/bmp_052517_radicalscience.mp3?dest-id=207567"
        },
        {
            "title": "Backtalk: Accountability of PWR BTTM & Murder of Jordan Edwards",
            "datePublished": "Thu, 18 May 2017 20:50:27 +0000",
            "description": "<p>This week, Dahlia and Amy talk about what accountability looks like for two recent stories: the sexual assualt allegations against the queer punk band PWR BTTM and the murder of teenager Jordan Edwards at the hands of a police officer. They dig into what it looks like to be held responsible for one’s actions. In Mr. Toad Trump’s Wide Ride, they talk about Trump’s scandal around the firing of FBI director James Comey and the hearings with former Attorney General Sally Yates.</p>",
            "length": "47604341",
            "sourceUrl": "http://traffic.libsyn.com/bitchradio/backtalk_051817.mp3?dest-id=207567"
        },
        {
            "title": "Money Feelings",
            "datePublished": "Thu, 11 May 2017 20:00:00 +0000",
            "description": "<p>Hate the capitalist system, still have to earn a living. It's the way life goes. We talk with feminists about squaring their feelings about our exploitative economy with each person's need to make money and feel stable. This episode features real talk from Michelle Tea, Ashley C. Ford, Roan Boucher, and the crew behind the podcast Criminal.</p>",
            "length": "59570930",
            "sourceUrl": "http://traffic.libsyn.com/bitchradio/bmp_051117_moneyfeelings.mp3?dest-id=207567"
        }
    ]
}