{
    "artwork": "http://is2.mzstatic.com/image/thumb/Music62/v4/4a/29/aa/4a29aa85-ea00-97b6-4c14-5afca2b80e35/source/100x100bb.jpg",
    "description": "POPULAR TECHNOLOGY RADIO - provides you with the most authoritative insight and information on today’s emerging technologies and products in a fast paced and entertaining two-hour weekly show. Hosts Mike Etchart and Jason Masters, along with a gang of tech experts and gadget geeks, bring you a wide array of topics the latest news and information in home and hand-held technology, music, photography, entertainment, gaming and more. Get expert advice on stereo components, home recording equipment, smart phones, e-readers, digital imaging, dashboard apps, innovations, social networks, industry buzz, rumors and the cold hard facts. Pop Tech Radio helps you make sense of the barrage of choices available in the marketplace. Whether you need a new television, game console, camera or smartphone; or even if you just want the latest game or app to add to your device, Pop Tech Radio provides you with vital, comprehensive advice from leading experts. Listen to our webcast live each Saturday from 9 a.m. to 11 a.m. Pacific at RadioAmerica.org.",
    "feedURL": "http://feeds.feedburner.com/PopularTechnologyRadio",
    "podcastURL": "http://www.PopTechRadio.com",
    "publisher": "info@ernlive.com (Entertainment Right Now)",
    "title": "Popular Technology Radio",
    "episodes": [
        {
            "title": "Del Breckenfeld, Universal Audio, and More at NAMM 2020 | #223",
            "datePublished": "Sat, 15 Feb 2020 01:00:00 GMT",
            "description": "<p style=\"text-align:left\">There are a lot of contributors to the growing music industry here at NAMM 2020, and we sit down with a few to chat about their careers. First up, Chief Amplifier for Amplify Entertainment Marketing, Del Breckenfeld, discusses his career at Fender and his experiences organizing shows and meeting big artists. Product Specialist for Universal Audio, Tom Waterman, explains Universal Audio's new product, LUNA, and how it's integrated with Apollo. LUNA uses an easy to navigate UI to help you achieve the sound that you want. Managing Director, Dave Bryce, entertains us with the story of how Music Player Network came to be and what he's gone through to keep it alive. Tune in for more great stories and products from the floor of NAMM 2020.</p>\r\n\r\n<p><ul><li>[00:00:00] Del Shares His History with Fender</li>\r\n<li>[00:06:26] Universal Audio Apollo X More Affordable</li>\r\n<li>[00:12:33] Recording Great Sound With an Old Twist</li>\r\n<li>[00:19:53] The Story Behind Music Player Network</li>\r\n<li>[00:27:50] Why is a Forum This Big of a Deal?</li>\r\n<li>[00:35:55] What has Inspired Recent Musical Movies?</li></ul></p><img src=\"http://feeds.feedburner.com/~r/PopularTechnologyRadio/~4/8AZsfMCKSV4\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "15537200",
            "sourceUrl": "http://feedproxy.google.com/~r/PopularTechnologyRadio/~5/8AZsfMCKSV4/PT_021520.mp3"
        },
        {
            "title": "Content Creation for Consumers is Easier Than Ever | #222",
            "datePublished": "Sat, 8 Feb 2020 02:00:00 GMT",
            "description": "<p style=\"text-align:left\">With technology progressing at such a quick pace it's getting easier for creators to produce content. This year at NAMM 2020 we discuss how the advancements of technology have made it so affordable to make music, and how companies are able to produce quality products at an affordable price, with Tech Expert, Mike Castanon. Whether we notice it or not the NAMM show has changed the way we live our lives from the way we entertain ourselves with music, to the way we set up our homes and more! Former President and CEO of Roland Corporation U.S. and past Chairman of NAMM, Dennis Houlihan, shares the history of NAMM, including how NAMM was started in New York by piano makers wanting to raise the ethical bar for the piano industry. Then, Global Product Line Manager, Scott Wood, tells us about the capabilities of their awesome new 24 channel mixer. Closing out the show, Audio and Tech Writer for Sound Stage! Solo, The Wirecutter, and Jazz Times, Brent Butterworth, explains why he immediately bought a pair of AKG K371 headphones after testing out a pair. Tune in to hear more about NAMM 2020.</p>\r\n\r\n<p><ul><li>[00:00:00] Musical Equipment Quality and Quantity</li>\r\n<li>[00:06:46] Creating Music has Never Been Easier</li>\r\n<li>[00:12:31] The History of the Renowned NAMM Show</li>\r\n<li>[00:19:53] How has NAMM Impacted Daily Lives?</li>\r\n<li>[00:27:50] Soundcraft Shows Off 24 Channel Mixer</li>\r\n<li>[00:35:53] AKG Makes Amazing Affordable Headphones</li></ul></p><img src=\"http://feeds.feedburner.com/~r/PopularTechnologyRadio/~4/WcMaphZse9c\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "15673600",
            "sourceUrl": "http://feedproxy.google.com/~r/PopularTechnologyRadio/~5/WcMaphZse9c/PT_020820.mp3"
        },
        {
            "title": "How CES Changed Over 30 Years, New Audio Tech at CES 2020 | #221",
            "datePublished": "Sat, 1 Feb 2020 01:00:00 GMT",
            "description": "<p style=\"text-align:left\">While many headphone and other audio companies are absent from CES this year, there is still a decent number of audio tech companies on the show floor. Audio Tech Writer for the Wirecutter, SoundStage! Solo, and JazzTimes, Brent Butterworth, breaks down what we've learned about new audio tech, and chats about how CES has changed over the past 30 years. The purpose for CES has changed with online marketplaces and advancements in new shipping technology. Then, Brent goes into detail on why major audio companies didn't show up to CES this year. Could home theatre systems be replaced with soundbars equipped with Dolby Atmos? Tune in to find out!</p>\r\n\r\n<p><ul><li>[00:00:00] How Has CES Changed Over 30 Years?</li>\r\n<li>[00:05:24] The Transformation of CES Over the Years</li>\r\n<li>[00:12:30] Where is all the Audio Tech at CES 2020?</li>\r\n<li>[00:19:51] Sound Bars are Replacing the Home Theatre</li>\r\n<li>[00:28:39] Wireless Taking Over the Audio Market</li>\r\n<li>[00:35:52] What You Need to Know About CES 2020</li></ul></p><img src=\"http://feeds.feedburner.com/~r/PopularTechnologyRadio/~4/j8YxXglYfcg\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "15704600",
            "sourceUrl": "http://feedproxy.google.com/~r/PopularTechnologyRadio/~5/j8YxXglYfcg/PT_020120.mp3"
        },
        {
            "title": "TCL's Mini LED, 4K Live TV, Tech Monopolies, 5G at CES 2020 | #220",
            "datePublished": "Sat, 25 Jan 2020 02:00:00 GMT",
            "description": "<p style=\"text-align:left\">Every year tech companies from around the world gather at CES to show their latest and greatest. Freelance Tech and Travel Writer for CNET and The New York Times Geoffrey Morrison, chats about some of the innovative technology he's spied on the show floor at CES 2020. TCL has been making waves with Mini LED screens. Will this challenge LG's OLED tech for the top spot? Then, we discuss Next Gen TV's over-the-air 4K television IP based solution, Sonos' suit against Google what it could mean for other giant tech monopolies, and some of 5G technology's pitfalls. Tune in for more details from CES 2020.</p>\r\n\r\n<p><ul><li>[00:00:00] TCL Shows off new Mini LED Technology </li>\r\n<li>[00:06:15] Will Mini LED Displays Replace OLED?</li>\r\n<li>[00:12:30] Next Gen TV Providing Free 4K On Live TV</li>\r\n<li>[00:19:51] How Does IP Based Live TV Work?</li>\r\n<li>[00:27:47] Who Can Stop These Tech Monopolies?</li>\r\n<li>[00:35:52] 5G Might Not Be All Your Hoping For</li></ul></p><img src=\"http://feeds.feedburner.com/~r/PopularTechnologyRadio/~4/uBXPi8o9kEk\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "15710800",
            "sourceUrl": "http://feedproxy.google.com/~r/PopularTechnologyRadio/~5/uBXPi8o9kEk/PT_012520.mp3"
        },
        {
            "title": "Black Friday Deals, Automobility LA, Tesla Cybertruck | #219",
            "datePublished": "Sat, 23 Nov 2019 01:00:00 GMT",
            "description": "<p style=\"text-align:left\">Black Friday is just around the corner and we're scouring the internet for the best deals we can find. This of course means we'll talk about TVs, because as Mike Etchart and Audio Tech Writer for the Wirecutter, SoundStage! Solo, JazzTimes, Brent Butterworth, know all too well, deals on TVs are always the hottest out there around this time of year. We also discuss the importance of having good audio and how TVs aren't the only home theater products gaining in quality; the beloved sound bars are also on the rise. Then, we chat with Popular Technology Radio Producer, Cody Castleberry, about his plans for the shopping weekend and the interesting deals he's seen, including $600 off on new Samsung phones! Shifting our focus, JoshCAR Hollywood Car Consultant, Josh Hancock, informs us on the LA Auto Show (now known as Automobility LA) and its importance in the worldwide car market. Then, Josh fills us in on the new Tesla Cybertruck and anticipated Ford Electric F-150. Tune in for more. </p>\r\n\r\n<p><ul><li>[00:00:00] Then to Now: Black Friday TV Prices</li>\r\n<li>[00:06:00] TV and Soundbar Quality on the Rise</li>\r\n<li>[00:12:31] Black Friday Deal Watch</li>\r\n<li>[00:19:52] TVs, DNA Tests, and Cell Phones, Oh My</li>\r\n<li>[00:29:05] LA Auto Show and Regulation Battles</li>\r\n<li>[00:35:54] Tesla Cybertruck, Ford Electric F-150</li></ul></p><img src=\"http://feeds.feedburner.com/~r/PopularTechnologyRadio/~4/Uo1skAzj2RU\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "15686000",
            "sourceUrl": "http://feedproxy.google.com/~r/PopularTechnologyRadio/~5/Uo1skAzj2RU/PT_112319.mp3"
        },
        {
            "title": "New Mini-LED Tech From TCL, Disney+ Enters Streaming Wars | #218",
            "datePublished": "Sat, 9 Nov 2019 01:00:00 GMT",
            "description": "<p style=\"text-align:left\">With Disney+ right around the corner, we take another look of the streaming video landscape. Freelance Tech and Travel Writer for CNET and The New York Times, Geoffrey Morrison, discusses the increasing number of players in movie streaming space and how much the market can bear. The average family seems to have a pain point of about 3-4 subscriptions before they dial back their spending. Then, we learn about a new advancement in television technology brought to market by Chinese upstart manufacturer, TCL - Mini LED. Just what is LED, and what makes it better than what we have now? Tune in to find out. Also, don't miss Geoffrey's review of the GoPro MAX. </p>\r\n\r\n<p><ul><li>[00:00:00] The Streaming Wars Are Heating Up</li>\r\n<li>[00:06:24] Subscription Service Pain Points</li>\r\n<li>[00:12:31] TCL First to Market with Mini-LED Tech</li>\r\n<li>[00:19:52] What is Mini-LED?</li>\r\n<li>[00:27:44] Modern Television Technology Review</li>\r\n<li>[00:35:53] $500 GoPro MAX: Is It Worth It?</li></ul></p><img src=\"http://feeds.feedburner.com/~r/PopularTechnologyRadio/~4/sWlDqHHqccM\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "15679800",
            "sourceUrl": "http://feedproxy.google.com/~r/PopularTechnologyRadio/~5/sWlDqHHqccM/PT_110919.mp3"
        },
        {
            "title": "Amazon Announces a Bevvy of New, Awesome Products | #217",
            "datePublished": "Sat, 5 Oct 2019 01:00:00 GMT",
            "description": "<p style=\"text-align:left\">We've all enjoyed some of the amazing services that Amazon provides at one point or another, but have you checked out their growing line of consumer electronics products? Host, Mike Etchart, and Co-Founder and Digital Strategist of Label Logic, Jay Gilbert, discuss the culture of change, and customer first philosophy of Amazon, as well as their recent bevvy of new tech product announcements. If you're a fan of hi-fi audio, stay tuned for Amazon Echo Studio and Music HD. We also learn more about the Echo Buds, Show, Loop, Frames, Smart Oven, and Flex. Tune in if you're a fan of Amazon's quiet take-over of the consumer electronics market.</p>\r\n\r\n<p><ul><li>[00:00:00] Amazon's Culture of Change</li>\r\n<li>[00:06:12] Amazon Taking Over, and Echo Studio</li>\r\n<li>[00:12:31] Dolby Atmos, Amazon Music HD, Echo Buds</li>\r\n<li>[00:19:51] Amazon Echo Show, Loop, and Frames</li>\r\n<li>[00:28:01] Amazon Privacy, Smart Oven, and Flex</li>\r\n<li>[00:35:53] In the Business of Tech Simplification</li></ul></p><img src=\"http://feeds.feedburner.com/~r/PopularTechnologyRadio/~4/_oPzCPBYpq0\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "15673600",
            "sourceUrl": "http://feedproxy.google.com/~r/PopularTechnologyRadio/~5/_oPzCPBYpq0/PT_100519.mp3"
        },
        {
            "title": "Understanding Cyber Security and How to Protect Ourselves | #216",
            "datePublished": "Sat, 28 Sep 2019 01:00:00 GMT",
            "description": "<p style=\"text-align:left\">Cyber security is front page news these days as big tech companies and governmental organizations are getting caught up in the firestorm of hacking and data breaches. So how do these breaches come to be? Chief Evangelist for Saviynt, and cyber security expert, Diana Volere, discusses the issues that come with living in a technologically advanced world. Corporations and organizations constantly feel the pressure to maximize operation efficiency while maintaining an appropriate level of cyber security, and it becomes a juggling act that some inevitably fail. We chat about the shift of every industry towards cloud storage and away from physical servers and how that affects security. There is definitely a human error factor as well, but that doesn't mean we should give cyber security professionals a free pass, it is their job to keep the public's information secure. So that leaves it up to us to do our part, as much as we hate it, by changing our passwords often, viewing email proposals or pleas for help with a healthy level of suspicion, and keeping our credit card information secure online. Tune in to learn more about how digital security has become so compromised in recent years and what you should be doing to safeguard yourself and your business.\r\n\r\n</p>\r\n\r\n<p><ul><li>[00:00:00] Cyber Security Vs Operational Efficiency</li>\r\n<li>[00:06:23] Cloud vs Physical Server Security</li>\r\n<li>[00:12:30] Human Error, Responsibility, Ransomware</li>\r\n<li>[00:19:51] No Such Thing As Absolute Security</li>\r\n<li>[00:27:36] Politics, Freedom, and Data Control</li>\r\n<li>[00:35:52] Digital Awareness / Cyber Security Tips</li></ul></p><img src=\"http://feeds.feedburner.com/~r/PopularTechnologyRadio/~4/5KmUEHoPIpg\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "15667400",
            "sourceUrl": "http://feedproxy.google.com/~r/PopularTechnologyRadio/~5/5KmUEHoPIpg/PT_092819.mp3"
        },
        {
            "title": "Porsche Taycan, Electric Vs Hybrid, Rivian, Ford, EV Bikes | #215",
            "datePublished": "Sat, 21 Sep 2019 01:00:00 GMT",
            "description": "<p style=\"text-align:left\">The automotive and technology worlds clash often, but nowhere are the lines of tech and motor company blurred as much as with the rising electric vehicle market. JoshCAR Hollywood Car Consultant, Josh Hancock, joins us to discuss the new Porsche Taycan and whether or not Tesla should be quaking in their boots regarding this vehicle's release. Then we chat about the public's lower anxiety over the range of electric vehicles thanks to recent advancements pushing every day EVs above the 250 mile mark and how that affects their market share. Don't feel left out if you're a truck guy/gal, because electrification is coming to a full-size pickup near you soon with the announcement of Rivian's R1T and Ford's all-electric F-150. These trucks pack a punch, thanks to their electric motors, and provide more torque for towing. Changing topics, we delve into one of the biggest benefits of having an electric vehicle, the low maintenance! Aside from your obvious stuff like tires, brakes, and batteries, there's pretty much nothing else to worry about as you commute day-to-day. Switching lanes, everybody's favorite four-wheeled contraptions aren't the only vehicles getting an electric makeover; tune in to hear about the small, but vibrant market of electric motorcycles, bicycles, and other oddities.</p>\r\n\r\n<p><ul><li>[00:00:00] Tesla's New Competition: Porsche Taycan</li>\r\n<li>[00:06:59] All Electric vs Hybrid Electric Cars</li>\r\n<li>[00:12:30] Lower Range Anxiety, Higher Market Share</li>\r\n<li>[00:19:51] Rivian Forces Ford's Hand on Electric</li>\r\n<li>[00:27:37] Electric Cars Require Less Maintenance</li>\r\n<li>[00:35:52] Electric Bicycles, Motorcycles, and More</li></ul></p><img src=\"http://feeds.feedburner.com/~r/PopularTechnologyRadio/~4/aiFovY9YSoY\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "15667400",
            "sourceUrl": "http://feedproxy.google.com/~r/PopularTechnologyRadio/~5/aiFovY9YSoY/PT_092119.mp3"
        },
        {
            "title": "The Battle for Music Streaming Supremacy Continues | #214",
            "datePublished": "Sat, 7 Sep 2019 01:00:00 GMT",
            "description": "<p style=\"text-align:left\">What is your favorite way to listen to music these days? Are you still a physical record listener, or have you jumped on the Spotify band wagon? Perhaps you listen to an obscure digital service provider (DSP) like Deezer or Music Aficionado. Whatever your cup of tea happens to be, we're discussing the rise of streaming services, and where they may be headed in the future today with Co-Founder of Label Logic, and music industry veteran, Jay Gilbert. We delve into the issues facing certain streaming services, like Spotify, and more niche providers like licensing fees and how they can stay afloat when music is their focus. For other companies like Amazon, Apple, and Google, music is a rounding error in their overall business, so a failure in their streaming services wouldn't affect their bottom line. How do the Pandoras and Spotifys of the world keep up in this market? Well, by providing a more personalized experience, of course! We also discuss how a service like YouTube became top dog in the world of music streaming. Playlists, access to everything conceivable, and curation seem to be fan favorites among music listeners. Tune in to learn more. </p>\r\n\r\n<p><ul><li>[00:00:00] Some Music Never Made it to Streaming</li>\r\n<li>[00:05:59] Will Spotify Have Trouble Keeping Up?</li>\r\n<li>[00:12:30] Pandora and YouTube Music</li>\r\n<li>[00:19:51] How YouTube, iTunes Became Juggernauts</li>\r\n<li>[00:27:47] Why Curation and Ease of Access Will Win</li>\r\n<li>[00:35:53] Will Crowded Music Streaming Thin Out?</li></ul></p><img src=\"http://feeds.feedburner.com/~r/PopularTechnologyRadio/~4/vZpSGvZ8ccE\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "15673600",
            "sourceUrl": "http://feedproxy.google.com/~r/PopularTechnologyRadio/~5/vZpSGvZ8ccE/PT_090719.mp3"
        },
        {
            "title": "Nate Mitchell Exits Facebook, AR/VR Update, Oculus Rift | #213",
            "datePublished": "Sat, 31 Aug 2019 01:00:00 GMT",
            "description": "<p style=\"text-align:left\">With the news that Nate Mitchell is leaving Facebook, we thought it'd be a great time to check in on the augmented reality (AR) and virtual reality (VR) worlds. Gameplay Productions Owner and Director, Cheyenne Decker, discusses the impact of Oculus Rift and the amazing team of visionaries behind the project on the world of virtual reality today. We also chat about the advancement of augmented reality and how it is enabling other industries to perform more efficiently. Closing out the show we talk about the growing risk of regulation for the tech giants of Silicon Valley and how this risk may have influenced the creators of Oculus to leave Facebook. Tune in for more news on augmented and virtual reality.</p>\r\n\r\n<p><ul><li>[00:00:00] Nate Mitchel Leaves Oculus/ What is AR?</li>\r\n<li>[00:06:22] AR in the Real World and Marketing</li>\r\n<li>[00:12:30] How Oculus Rift Brought VR Roaring Back</li>\r\n<li>[00:19:50] Why Did Facebook Buy Oculus Anyway?</li>\r\n<li>[00:27:42] Haptic Suits and Ecosystem Economics</li>\r\n<li>[00:35:52] Tech Giant Regulation/ Great VR Games</li></ul></p><img src=\"http://feeds.feedburner.com/~r/PopularTechnologyRadio/~4/Z0PFp0WbHSw\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "15624000",
            "sourceUrl": "http://feedproxy.google.com/~r/PopularTechnologyRadio/~5/Z0PFp0WbHSw/PT_083119.mp3"
        },
        {
            "title": "Mergers, Tornadoes, and Keeping Your Ears Safe at Concerts | #212",
            "datePublished": "Sat, 10 Aug 2019 01:00:00 GMT",
            "description": "<p style=\"text-align:left\">If you've ever thought that big corporate mergers don't affect you, you might be wrong. Mike shines a light on the constant bad hand that consumers get after mergers like the AT&T and Time Warner merger. Then, Writer for The Wirecutter and Editor for SoundStage! and JazzTimes, Brent Butterworth, tells us about the random tornado that came through his part of the greater Los Angeles area and why he's getting a new roof. Switching topics, we chat about cutting the cord, increasing entertainment bills, the effects of mergers on everyday Americans, and great ear protection for loud concerts. Tune in to learn more. </p>\r\n\r\n<p><ul><li>[00:00:00] AT&T/Time Warner Merger Hurts Consumers</li>\r\n<li>[00:06:06] Brent's Rare Tornado and Cutting Cords</li>\r\n<li>[00:12:30] How Do Mergers Affect Content Creation?</li>\r\n<li>[00:19:50] Protect Your Ears with Loop Earplugs</li>\r\n<li>[00:28:07] Wear Protection at Loud Concerts</li>\r\n<li>[00:35:52] Staying Quiet in Your Dorm Room</li></ul></p><img src=\"http://feeds.feedburner.com/~r/PopularTechnologyRadio/~4/Iqep7gYwDnw\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "15667400",
            "sourceUrl": "http://feedproxy.google.com/~r/PopularTechnologyRadio/~5/Iqep7gYwDnw/PT_081019.mp3"
        },
        {
            "title": "T-Mobile/Sprint Merger, Its Wacky Facets, and Travel Plans | #211",
            "datePublished": "Sat, 3 Aug 2019 01:00:00 GMT",
            "description": "<p style=\"text-align:left\">If there's one thing we've learned as consumers, its that huge corporate mergers never work out in our favor. Freelance Writer, Editor, and Photographer for CNET and The New York Times, Geoffrey Morrison, discusses the proposed merger between T-Mobile and Sprint  that has the attorneys general of California, Texas, and New York up in arms. There are a couple of weird facets about this merger that leave us scratching our heads, like its inclusion of Dish Network as a propped up fourth cell phone carrier. We also chat about the roll out of 5G internet and SpaceX's plans with low orbit satellite internet. Geoff also shares why he switched to Google Fi from T-Mobile, how to save money while abroad with your cell phone plan, and how to avoid getting financially destroyed by predatory travel packages. Tune in for more!</p>\r\n\r\n<p><ul><li>[00:00:00] The Best Ways to Be a Cellphone Roamer</li>\r\n<li>[00:05:59] Travel Packages / T-Mobile Sprint Merger</li>\r\n<li>[00:12:31] T-Mobile/Sprint Merger Facing Pressure</li>\r\n<li>[00:19:51] Dish An Unlikely Third Wheel in Merger</li>\r\n<li>[00:27:09] 5G vs Low Orbit Satellite Internet</li>\r\n<li>[00:35:52] Likelihood of T-Mobile/Sprint Merger</li></ul></p><img src=\"http://feeds.feedburner.com/~r/PopularTechnologyRadio/~4/AdhC6Gtaeh4\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "15667400",
            "sourceUrl": "http://feedproxy.google.com/~r/PopularTechnologyRadio/~5/AdhC6Gtaeh4/PT_080319.mp3"
        },
        {
            "title": "Bose's New Headphones, Android's Agent Smith, and Streaming | #210",
            "datePublished": "Sat, 13 Jul 2019 01:00:00 GMT",
            "description": "<p style=\"text-align:left\">If you're a frequent listener of Popular Technology Radio, you've probably heard The Wirecutter Writer and Writer and Editor for SoundStage! Solo, Brent Butterworth, talk about the phenomenon called 'eardrum suck'. This painful, psychosomatic condition afflicts some users of high end noise cancelling headphones, but thankfully the new Bose NC 700 Headphones have a remedy. These $399 replacements for the Bose QuietComfort 35 II get high marks from Brent, who claims they are more comfortable, sound better, and have adjustable levels of noise cancellation. We also chat about the oversaturation of the headphone market after Chinese manufacturers decided to start marketing their own products; like Haomeja who promise \"Supercar loud boom sounds.\" Changing topics, we discuss the recent, and rampant, 'Agent Smith' malware afflicting millions of Android devices and how to use best practices to avoid contracting such technological afflictions. Closing up the show we discuss Amazon's new Lord of the Rings prequel TV series and multiplayer video game, as well as the oncoming deluge of new streaming services. Tune in to learn more.</p>\r\n\r\n<p><ul><li>[00:00:00] New Bose Headphones - No Eardrum Suck</li>\r\n<li>[00:06:54] Death of Audio Jack / Rise of Bluetooth</li>\r\n<li>[00:12:31] Oversaturation of the Headphone Market</li>\r\n<li>[00:19:52] Android Virus and iPads for Musicians</li>\r\n<li>[00:27:55] \"Agent Smith\", Best Practices and Scams</li>\r\n<li>[00:35:53] It's the Golden Age of Television</li></ul></p><img src=\"http://feeds.feedburner.com/~r/PopularTechnologyRadio/~4/wt1WyBZvbvk\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "15679800",
            "sourceUrl": "http://feedproxy.google.com/~r/PopularTechnologyRadio/~5/wt1WyBZvbvk/PT_071319.mp3"
        },
        {
            "title": "Jony Ive and His Contribution to Product Design and Tech | #209",
            "datePublished": "Sat, 6 Jul 2019 01:00:00 GMT",
            "description": "<p style=\"text-align:left\">The news reached us at Popular Technology Radio recently that Jony Ive will be departing from Apple after many years of splendid and revolutionary product design. This departure comes with an asterisk, as he will be setting up shop in a new design studio and his first customer will be Apple. Award Winning Product Design Consultant, Todd Metlen, discusses Jony Ive's unquestionable impact on the world of design and consumer electronics, the nuances of product design, his time at Nokia, and the impossibility of maintaining brand loyalty. Join us as we toast Jony Ive in his new venture and thank him for what he has given the world thus far.</p>\r\n\r\n<p><ul><li>[00:00:00] Revolutionary Product Designer Jony Ive</li>\r\n<li>[00:05:39] How a Design Focus Elevated Apple</li>\r\n<li>[00:12:30] Limitations of Form Follows Function</li>\r\n<li>[00:19:50] Airplane Mode, Nokia, and Obsolescence</li>\r\n<li>[00:28:18] Difficulty of Maintaining Brand Loyalty</li>\r\n<li>[00:35:51] Product Design vs. Architecture</li></ul></p><img src=\"http://feeds.feedburner.com/~r/PopularTechnologyRadio/~4/flVHSZSSDTk\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "15661200",
            "sourceUrl": "http://feedproxy.google.com/~r/PopularTechnologyRadio/~5/flVHSZSSDTk/PT_070619.mp3"
        },
        {
            "title": "E3 Wrap Up, Cyberpunk 2077, and Cloud Based Gaming | #208",
            "datePublished": "Sat, 29 Jun 2019 01:00:00 GMT",
            "description": "<p style=\"text-align:left\">The biggest trade show in the video games industry recently wrapped up in southern California, and we have our eyes on a few upcoming games revealed at the expo. Gameplay Productions Owner and Director and veteran of the gaming industry, Cheyenne Decker, discusses the rapid pace at which the gaming industry is changing; from trade shows, to consoles, to cloud computing. We also chat about our favorite game reveals at E3 2019, like Cyberpunk 2077, Death Stranding, DOOM Eternal, Final Fantasy 7 Remake, Zelda Breath of the Wild 2, and more! Tune in to get an update on the video game industry.</p>\r\n\r\n<p><ul><li>[00:00:00] History of E3 and the Gaming Industry</li>\r\n<li>[00:05:14] The Trouble of Big Gaming Trade Shows</li>\r\n<li>[00:12:29] Video Games: A Brutal Hit-Driven Market</li>\r\n<li>[00:19:49] Cyberpunk 2077 and Cloud Gaming</li>\r\n<li>[00:29:12] Nintendo, Microsoft, Sony, and Facebook</li>\r\n<li>[00:35:48] Games From E3 That Have Us Excited</li></ul></p><img src=\"http://feeds.feedburner.com/~r/PopularTechnologyRadio/~4/IH76QIxM1xg\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "15667400",
            "sourceUrl": "http://feedproxy.google.com/~r/PopularTechnologyRadio/~5/IH76QIxM1xg/PT_062919.mp3"
        },
        {
            "title": "iTunes, Streaming, iPod, and the Future of Digital Music | #207",
            "datePublished": "Sat, 15 Jun 2019 10:00:00 GMT",
            "description": "<p style=\"text-align:left\">When the iPod was released in October of 2001, the world of music changed and changed further still when it was followed up by the release of the iTunes store. Digital Strategist and Co-Founder of Label Logic, and Host of Your Morning Coffee, Jay Gilbert, remembers the history of the iPod and iTunes in light of the recent announcement that iTunes will see the biggest change since it was established 18 years ago. Then, we discuss how the trends have evolved over the years, from mix-tape cassettes and CDs, to digital downloads and streaming services. Join us for an overall look at the current landscape of the music industry.</p>\r\n\r\n<p><ul><li>[00:00:00] iPod, iTunes, and Portable Music Players</li>\r\n<li>[00:05:51] Remembering iTunes, and Its New Form</li>\r\n<li>[00:12:30] How iTunes Helped the iPod Succeed</li>\r\n<li>[00:19:50] iTunes and Explosion of Digital Media</li>\r\n<li>[00:27:39] The Rise of Spotify and Streaming Music</li>\r\n<li>[00:35:52] Pandora, Voice Command, Mobile Music</li></ul></p><img src=\"http://feeds.feedburner.com/~r/PopularTechnologyRadio/~4/MZFoo8E2wZg\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "15667400",
            "sourceUrl": "http://feedproxy.google.com/~r/PopularTechnologyRadio/~5/MZFoo8E2wZg/PT_061519.mp3"
        },
        {
            "title": "A Critical Look at Cable Internet and Streaming Industry | #206",
            "datePublished": "Sat, 1 Jun 2019 10:00:00 GMT",
            "description": "<p style=\"text-align:left\">If you feel like your cable internet bill has growing curiously big over the last few years, you're not the only one. Kicking off the show, host, Mike Etchart, remembers the good old days of dial up internet and his $9/month American Online (AOL) bill. Then, we chat with Consumer Columnist for The Los Angeles Times, David Lazarus, about the cable companies stranglehold on regional broadband internet services and how things got to be the way they are. We also explore how the shift of TV consumers from bloated cable TV packages to cord cutting streaming services is making internet service providers (ISPs) charge more to offset their losses; but that doesn't mean these price hikes are justified. David offers a case for having more regulation in the telecommunications industry, not necessarily in a heavy handed sense, but we at least need a referee on the field or an adult in the room. Closing the show, Popular Technology Radio Producer, Cody Castleberry, describes his experience with broadband internet in the pacific northwest. Tune in for more about the under-regulated world of ISPs.</p>\r\n\r\n<p><ul><li>[00:00:00] A Brief History of ISPs</li>\r\n<li>[00:05:23] Are Cable Internet Prices Justified?</li>\r\n<li>[00:12:30] From DSL to Cable to Streaming Video</li>\r\n<li>[00:19:51] Streaming Entices ISPs to Charge More</li>\r\n<li>[00:27:54] The Telecom Industry Needs An Adult</li>\r\n<li>[00:35:52] Largest ISPs and Content Bundles</li></ul></p><img src=\"http://feeds.feedburner.com/~r/PopularTechnologyRadio/~4/MXzdthUiwlU\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "15667400",
            "sourceUrl": "http://feedproxy.google.com/~r/PopularTechnologyRadio/~5/MXzdthUiwlU/PT_060119.mp3"
        },
        {
            "title": "How to Navigate Buying a TV and Associated Hardware | #205",
            "datePublished": "Sat, 25 May 2019 01:00:00 GMT",
            "description": "<p style=\"text-align:left\">The TV market has become saturated with jaw-droppingly cheap televisions that still look nice; but don't get too comfortable, there are still plenty of pitfalls to avoid when making a purchase. Freelance Writer, Editor, and Photographer for CNET and The New York Times and Writer for The Wirecutter, Geoffrey Morrison, has written, and talked, and thought, and ranted, and raved about a lot of the misconceptions in the television industry and is here to shed some light on the topic. We find out why HDR and 4K televisions mean nothing without an appropriate source or signal from a Bluray player or streaming service. Also, don't make the mistake of overpaying for HDMI cables and under appreciating an external sound device like a soundbar. Wrapping up the hour we take a look at the best, and the most cost effective TV brands, from TCL and VIZIO to LG and Samsung. Tune in to find out how Chinese brands like TCL and VIZIO were able to push Korean and Japanese companies out of the mid to low price TV category.</p>\r\n\r\n<p><ul><li>[00:00:00] Mike's Old 32\" Sony Wega Was a Beast</li>\r\n<li>[00:06:33] Geoffrey Morrison Explains HDR</li>\r\n<li>[00:12:30] Delicate Dance of 4K Content vs Hardware</li>\r\n<li>[00:19:51] Buy Cheap HDMI Cables + A Nice Soundbar</li>\r\n<li>[00:27:48] VIZIO and TCL Make Best Budget TVs</li>\r\n<li>[00:35:32] Chinese Companies Corner The Market</li></ul></p><img src=\"http://feeds.feedburner.com/~r/PopularTechnologyRadio/~4/Gsygbt9w32Y\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "15667400",
            "sourceUrl": "http://feedproxy.google.com/~r/PopularTechnologyRadio/~5/Gsygbt9w32Y/PT_052519.mp3"
        },
        {
            "title": "The Big Four Of Cellular Plans and Their Inner Workings | #204",
            "datePublished": "Sat, 18 May 2019 01:00:00 GMT",
            "description": "<p style=\"text-align:left\">Cellular carriers are not loved, but we sure wouldn't want to live without them. As much ire as U.S. telecom companies might face, they are a necessary evil; but which companies have the best plans? Thankfully, The Wirecutter Contributor, Rob Pegoraro, reveals to us some of the inner workings of how cell phone carriers operate, the difference between prepaid and postpaid plans, and the limits of 5G. We also discover how cell carriers rank on the consumer satisfaction index, and what the strengths and weaknesses are of the 'big four' in wireless - AT&T, Sprint, T-Mobile, and Verizon. Tune in to learn how to avoid pitfalls and if your service may be in need of updating.</p>\r\n\r\n<p><ul><li>[00:00:00] Cell Phone Carriers: A Necessary Evil</li>\r\n<li>[00:06:38] The Big 4 of Cell Phone Plans</li>\r\n<li>[00:12:30] Prepaid Plans, Sprint / T-Mobile Merger</li>\r\n<li>[00:19:51] Cellular Resellers, and Limits of 5G</li>\r\n<li>[00:27:26] Communication Customer Satisfaction</li>\r\n<li>[00:35:52] Which Carrier Should You Choose?</li></ul></p><img src=\"http://feeds.feedburner.com/~r/PopularTechnologyRadio/~4/X3PPGVCHSkM\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "15667400",
            "sourceUrl": "http://feedproxy.google.com/~r/PopularTechnologyRadio/~5/X3PPGVCHSkM/PT_051819.mp3"
        },
        {
            "title": "Spotify, Streaming Battles, Huawei TV, Summer is Coming | #203",
            "datePublished": "Sat, 4 May 2019 01:00:00 GMT",
            "description": "<p style=\"text-align:left\">The world of streaming is in a tumultuous period. Many Netflix competitors are entering the market, pure-music companies like Spotify are having trouble generating revenue, and Game of Thrones is ending! Freelance Writer, Editor, and Photographer for CNET and The New York Times, Geoffrey Morrison, and Audio and Musical Instrument Writer for The Wirecutter, SoundStage! Solo, JazzTimes, Brent Butterworth, discuss Spotify and their apparent subscriber gains amidst their capital loss. Is there a way back for Spotify? Or is their business model too narrow to be financially advantageous? We also chat about the competition Netflix is soon to face with players like Disney Plus, Apple, and others throwing their lot into the mix. Disney is likely the biggest threat to Netflix's video streaming dominance. How do companies like HBO factor into the equation, with their flagship series ending soon? In other news, Huawei has announced they will be releasing a 8K 5G television that has us wondering \"who even needs this?\" We close out the show with a look at the constant onslaught of small audio-based trade shows that keep Brent busy throughout the year, and how more companies are moving away from tradeshow giants like CES in favor of these smaller venues. Tune in to learn more about these topics and more!</p>\r\n\r\n<p><ul><li>[00:00:00] Spotify Gains Subs, Loses Money</li>\r\n<li>[00:07:43] Where Does Spotify Go From Here?</li>\r\n<li>[00:12:30] Netflix, HBO, Game of Thrones' Legacy</li>\r\n<li>[00:19:52] Disney Plus, Apple TV, Netflix, YouTube</li>\r\n<li>[00:27:32] Huawei 8K 5G TV, and Huge Televisions</li>\r\n<li>[00:35:53] Summer Tech and Trade Shows</li></ul></p><img src=\"http://feeds.feedburner.com/~r/PopularTechnologyRadio/~4/_A5Fd66i2gY\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "15673600",
            "sourceUrl": "http://feedproxy.google.com/~r/PopularTechnologyRadio/~5/_A5Fd66i2gY/PT_050419.mp3"
        },
        {
            "title": "Amazon, Facebook, and Others Constantly Abusing Consumer Trust | #202",
            "datePublished": "Sat, 20 Apr 2019 01:00:00 GMT",
            "description": "<p style=\"text-align:left\">Big technology companies are constantly facing backlash from data breaches and intentionally selling personal information to advertisers. The trend continues as we learn more about Amazon's recently revealed policy of listening in on, and transcribing, audio clips from everyday conversations. Host of Reality TV Show, \"Fix My Brand\", and Brand Expert, Ali Craig, discusses how data breaches, malignant activity such as the collection and selling of personal information, and an unwillingness by large tech companies to apologize affects brand images of Amazon, Google, Facebook, and Apple. We also chat about eBay's newly found niche market, and upcoming E3 news, including Playstation 5 rumors. Are you taken aback by the ceaseless flow of controversial activity surrounding big tech companies?</p>\r\n\r\n<p><ul><li>[00:00:00] Playstation 5 Rumored as E3 Approaches</li>\r\n<li>[00:05:10] Amazon Listening In, and Brand Loyalty</li>\r\n<li>[00:12:30] When Will People Push Back?</li>\r\n<li>[00:19:51] Appeal Amazon Has That Google Doesn't</li>\r\n<li>[00:28:04] Analyzing eBay's Path Forward</li>\r\n<li>[00:35:52] Facebook Blunders - Dirty Side of Tech</li></ul></p><img src=\"http://feeds.feedburner.com/~r/PopularTechnologyRadio/~4/-AX4KrF7YjM\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "15667400",
            "sourceUrl": "http://feedproxy.google.com/~r/PopularTechnologyRadio/~5/-AX4KrF7YjM/PT_042019.mp3"
        },
        {
            "title": "AI Scaling, True Wireless Headphones, and Geoff's Undersea Adventure | #201",
            "datePublished": "Sat, 13 Apr 2019 01:00:00 GMT",
            "description": "<p style=\"text-align:left\">Last week, Freelance Writer, Editor, and Photographer for The Wirecutter and CNET, Geoffrey Morrison, teased us all with his vacation in the Caribbean. Now, he's back to being just a normal plebeian like the rest of us. First off, we chat with Geoff about Apple's uncanny ability to hold dominance over the tablet market, while not being able to reproduce a similarly prolific reign over the world wide cell phone market. Next up, we learn about AI scaling, the latest in television picture technology; while it may not offer any revolutionary picture quality upgrades, it will make older formats look better on newer televisions. Then, we discuss Apple AirPods 2, true wireless headphones, and their sound quality and comfort. Closing the show, Geoff shares his undersea adventure in the Caribbean, and the 360 degree video he captured using an Insta360 camera. Tune in to learn more.</p>\r\n\r\n<p><ul><li>[00:00:00] How Does Apple Dominate Tablet Market?</li>\r\n<li>[00:07:07] What Is AI Scaling and Should You Care?</li>\r\n<li>[00:12:31] AI Scaling Slightly Improves TV Picture</li>\r\n<li>[00:19:51] Pros and Cons of AirPods, True Wireless</li>\r\n<li>[00:27:29] Headphones, AI Assistants, and Security</li>\r\n<li>[00:35:52] Geoffrey's 360-Degree Undersea Adventure</li></ul></p><img src=\"http://feeds.feedburner.com/~r/PopularTechnologyRadio/~4/oseNTXxKD2Q\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "15667400",
            "sourceUrl": "http://feedproxy.google.com/~r/PopularTechnologyRadio/~5/oseNTXxKD2Q/PT_041319.mp3"
        },
        {
            "title": "Content Creation Freedom, Video Games, and Game of Thrones | #200",
            "datePublished": "Sat, 6 Apr 2019 01:00:00 GMT",
            "description": "<p style=\"text-align:left\">With the impending debut of season eight of the hit HBO show, Game of Thrones, we encourage everyone to sign up to HBO Now, rather than pirating. Host, Mike Etchart, recently discovered some interesting facts about online malware in relation to some of our favorite shows that may surprise you. Then, Freelance Writer and Editor for The Wirecutter and CNET, Geoffrey Morrison, discusses the upcoming season of Game of Thrones, HBO's decline, and an article that details all the missteps that lead up to the failure of BioWare's Anthem. Next up, Popular Technology Radio Producer, Cody Castleberry, joins the fray as we discuss some of our favorite games (including Sea of Thieves, God of War, and Metal Gear), the business of video games and microtransactions, E3, and why giving passionate creatives the reigns on video game, movie, or other media development is usually the best idea. Tune in as we discuss the clash of business and art. </p>\r\n\r\n<p><ul><li>[00:00:00] Torrents are Dark and Full of Terrors</li>\r\n<li>[00:04:28] Game of Thrones, HBO, and Anthem</li>\r\n<li>[00:12:30] Sea of Thieves, God of War, and Stadia</li>\r\n<li>[00:19:51] Business of Games: Microtransactions</li>\r\n<li>[00:28:03] E3 - A Tradeshow for Blockbusters</li>\r\n<li>[00:35:52] Creative Freedom Begets Great Content</li></ul></p><img src=\"http://feeds.feedburner.com/~r/PopularTechnologyRadio/~4/PSzJH64Gnig\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "15667400",
            "sourceUrl": "http://feedproxy.google.com/~r/PopularTechnologyRadio/~5/PSzJH64Gnig/PT_040619.mp3"
        },
        {
            "title": "Apple Announcements, Subscription Fatigue, IKEA Sonos SYMFONISK | #199",
            "datePublished": "Sat, 30 Mar 2019 01:00:00 GMT",
            "description": "<p style=\"text-align:left\">One of the principle objectives of cord cutting is to reduce our monthly television fees, but are we getting to a point where having all of our favorite services is starting to cost too much again? Tech pundit, Howard Soroka, says the two words \"subscription fatigue\" are at the top of his notes for his discussion today, and we wonder if consumers are approaching burn out. Additionally, Apple has made a slew of announcements recently, revealing Apple Arcade, Apple Card, Apple News+, Apple TV+ and more. Is there enough room in the streaming service market for Apple, or will they fight their way in, knocking other services down along the way. Next, Audio and Musical Instrument Writer for the Wirecutter, Brent Butterworth, picks apart what little information we have about the IKEA/Sonos partnered speaker. Will it have Bluetooth, or Wi-Fi? Tune in to get Brent's expert analysis.</p>\r\n\r\n<p><ul><li>[00:00:00] Subscription Fatigue and Ranking Roger</li>\r\n<li>[00:05:34] Apple News+ Announcement</li>\r\n<li>[00:12:31] Apple Arcade, Card, and TV+</li>\r\n<li>[00:19:51] Who's Lunch Will Apple TV+ Eat?</li>\r\n<li>[00:28:27] IKEA and Sonos Partner to Make Speaker</li>\r\n<li>[00:35:52] What Is the IKEA SYMFONISK Speaker?</li></ul></p><img src=\"http://feeds.feedburner.com/~r/PopularTechnologyRadio/~4/MRyCDBRajW0\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "15673600",
            "sourceUrl": "http://feedproxy.google.com/~r/PopularTechnologyRadio/~5/MRyCDBRajW0/PT_033019.mp3"
        },
        {
            "title": "Google Stadia Makes Huge Splash at Game Developers Conference | #198",
            "datePublished": "Sat, 23 Mar 2019 01:00:00 GMT",
            "description": "<p style=\"text-align:left\">The Game Developers Conference usually scoots under the radar of most people in the tech world, but this year a certain mega corporation is making a big splash. Host Mike Etchart starts off the show with a warning about big company mergers: they will always win, and the consumer will always lose. This is made evident with AT&T's immediate price hikes on services like DIRECTV NOW. Next, Engadget Editor Senior Editor, Jessica Conditt, gives us the details on the biggest announcement of the Game Developers Conference - Google Stadia. This game streaming service sets out to Netflix-ify the video game industry, providing access to the latest virtual experiences via any device with an internet connection and the ability to stream video. Also, we chat about the health of the video game industry, indie games, Steam, the AAA tier game sector, and more. Closing the show, Popular Technology Radio Producer, Cody Castleberry, shares his thoughts on Google Stadia. Is latency one of Stadia's key flaws? Listen in for more about Google Stadia, indie games, and the Game Developers Conference.</p>\r\n\r\n<p><ul><li>[00:00:00] Fool Us Once, AT&T...</li>\r\n<li>[00:05:29] Game Developers Conference and Stadia</li>\r\n<li>[00:12:31] Pros and Cons of Google Stadia</li>\r\n<li>[00:19:51] Stadia To Amalgamate Video Game Market?</li>\r\n<li>[00:27:23] Indie Games, Getting Noticed, and More</li>\r\n<li>[00:35:53] Our Take on Google Stadia</li></ul></p><img src=\"http://feeds.feedburner.com/~r/PopularTechnologyRadio/~4/GsLH1UOaXk0\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "15667400",
            "sourceUrl": "http://feedproxy.google.com/~r/PopularTechnologyRadio/~5/GsLH1UOaXk0/PT_032319.mp3"
        },
        {
            "title": "Cutting the Cord and TV Entertainment Freedom with Luke Bouma | #197",
            "datePublished": "Sat, 16 Mar 2019 01:00:00 GMT",
            "description": "<p style=\"text-align:left\">Is your cable or satellite bill becoming a sore point for your wallet? Is that top-tier bundle causing spousal-budget arguments? Well, get out of the 2000s and into the modern age - cut the cord! Owner of Cord Cord Cutters News, Luke Bouma, gives us tips on ditching our cable bills and replacing it with streaming services at a much reduced cost, or even terrestrial broadcast antennas for free! You'd be surprised what's available to those willing to look. Also, we take a look at how the roll out of 5G may break the stranglehold certain companies have on the in-home internet service industry. Break free from high bills and restrictive programming; learn more at Cord Cutters News!</p>\r\n\r\n<p><ul><li>[00:00:00] Cord Cutting: Find Alternatives to Cable</li>\r\n<li>[00:06:57] Over-the-Air and Digital Antennas</li>\r\n<li>[00:12:31] Skinny Bundles, Streaming, and 5G</li>\r\n<li>[00:19:52] 5G, New Netflix Rivals, Spectrum Choice</li>\r\n<li>[00:27:56] Bypassing Middlemen and Self Discipline</li>\r\n<li>[00:35:52] Roku Dominating Streaming Landscape</li></ul></p><img src=\"http://feeds.feedburner.com/~r/PopularTechnologyRadio/~4/qKXSkdpQ8So\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "15667400",
            "sourceUrl": "http://feedproxy.google.com/~r/PopularTechnologyRadio/~5/qKXSkdpQ8So/PT_031619.mp3"
        },
        {
            "title": "Harman, Festival Sound, Bohemian Rhapsody, NAMM 2019 Wrap Up | #196",
            "datePublished": "Sat, 2 Mar 2019 01:00:00 GMT",
            "description": "<p style=\"text-align:left\">We wrap up our coverage of NAMM 2019 with a look back in musical history and how different the industry is today. Kicking off the show we chat with guest co-host and technology expert, Mike Castanon, about upcoming guests and amazing advancements in music tech affordability. Then, Harman International Industries Director of Corporate Communications, David Glaubke, discusses the history of JBL, from humble beginnings in the 1920s to their role in advancing live sound technology at Woodstock. We also learn about the rigorous testing Harman equipment goes through before its sent out. Next, Amplify Entertainment Marketing Chief Amplifier, Del Breckenfeld, is ecstatic over the success of Bohemian Rhapsody, the Queen bio flick, which featured authentic instruments and costumes created by Del and his team. Also, Del fills us in on the results of the Gambler reunion show, and Roland's new Tone Capsules. Closing out the show, Mike Etchart shares his excitement over Gibson Brand, Inc.'s restructuring and return to NAMM. Listen in for more about Bohemian Rhapsody, Harman International, JBL, Gibson, music history, and dates for the next Gambler reunion show.</p>\r\n\r\n<p><ul><li>[00:00:00] Casio Pianos, Queen, and Amp Emulation</li>\r\n<li>[00:06:25] History of JBL - From MGM to Woodstock</li>\r\n<li>[00:12:30] Harman: Simplicity and Rigorous Testing</li>\r\n<li>[00:19:51] Bohemian Rhapsody and A Star Is Born</li>\r\n<li>[00:27:59] Gambler Reunion, Roland Tone Capsules</li>\r\n<li>[00:35:52] Gibson Guitar Comeback and Casio Piano</li></ul></p><img src=\"http://feeds.feedburner.com/~r/PopularTechnologyRadio/~4/i1SaTlt6AXA\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "15667400",
            "sourceUrl": "http://feedproxy.google.com/~r/PopularTechnologyRadio/~5/i1SaTlt6AXA/PT_030219.mp3"
        },
        {
            "title": "Engadget, Matias, Parachut, and Paris Region Entreprises at CES | #195",
            "datePublished": "Sat, 23 Feb 2019 01:00:00 GMT",
            "description": "<p style=\"text-align:left\">There is so much to see at CES that we couldn't possibly glimpse it all. That's why we have people like Engadget Reviews Editor, Cherlynn Low, on to chat about what really got her excited for the future of tech at the Consumer Electronics Show. From 5G phones to the latest chip architecture from Intel, Cherlynn geeks out with us about wonderful, and sometimes quirky, reveals from our favorite companies. Next up, Matias Corporation Chief Operating Officer and Co-Founder, Steve McGowan, has a solution for anyone who's feeling left out in the cold by Apple's decision to discontinue their wired keyboards for Mac computers. Then, we learn about the revolution to the consumer market that is Parachut.co, from Co-Founders, Philip and Melissa Niu. This access economy service has been dubbed \"the Netflix of Stuff\", providing access to real, physical items for a monthly subscription. Closing the show, Paris Region Entreprises CMO, Joel Halpern, describes how the state of Ile de France is a leader in European tech growth. Partnering with Air France, Dassault Systemes, and Total, Paris Region has brought 35 start up companies to CES with a focus on artificial intelligence and how we can use it for good. Tune in for the last episode of coverage from CES 2019.</p>\r\n\r\n<p><ul><li>[00:00:00] Stressful Life of an Engadget Editor</li>\r\n<li>[00:04:50] 5G, NVIDIA, Intel, Beauty at CES 2019</li>\r\n<li>[00:12:30] Matias Offers Wired Keyboards for Mac</li>\r\n<li>[00:19:51] Parachut: The Netflix of Stuff</li>\r\n<li>[00:29:32] Millenials Are All About Access</li>\r\n<li>[00:35:52] Paris Region Entreprises at CES 2019</li></ul></p><img src=\"http://feeds.feedburner.com/~r/PopularTechnologyRadio/~4/e4NWa82g1K0\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "15667400",
            "sourceUrl": "http://feedproxy.google.com/~r/PopularTechnologyRadio/~5/e4NWa82g1K0/PT_022319.mp3"
        },
        {
            "title": "Dennis Houlihan and Audio-Technica's Gary Boss at NAMM 2019 | #194",
            "datePublished": "Sat, 16 Feb 2019 01:00:00 GMT",
            "description": "<p style=\"text-align:left\">The NAMM Show was started 1901, in New York City, by a group of piano merchants who wanted to show off their wares and bring integrity to their industry. Little did they know they set in motion a chain of events that would lead to the creation of not one, but two of the world's largest trade shows. Technology expert, Mike Castanon, and former President and CEO of Roland Corporation U.S. and past Chairman of NAMM, Dennis Houlihan, walk us through the history of the show and the humble beginnings of CES at this long-running music merchants showcase. Dennis also describes what makes Roland such a unique and successful company: the ability to cater to different markets around the world. Then, we chat with Audio-Technica Marketing Director of Professional Markets, Gary Boss, about the company's focus on streaming and podcast equipment, what goes into making a professional DJ turntable, and a slew of exciting release for consumers of all types. Listen in for another episode of coverage from the NAMM Show 2019.</p>\r\n\r\n<p><ul><li>[00:00:00] The Old and the New at NAMM 2019</li>\r\n<li>[00:05:34] NAMM History, Dennis Houlihan's Start</li>\r\n<li>[00:12:30] What Makes Roland Stand Out?</li>\r\n<li>[00:19:51] Streamer Kits from Audio-Technica</li>\r\n<li>[00:28:11] Professional Turntables for Pro DJs</li>\r\n<li>[00:35:52] Audio-Technica Product Lightning Round</li></ul></p><img src=\"http://feeds.feedburner.com/~r/PopularTechnologyRadio/~4/zS6ZXkFbqyc\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "15667400",
            "sourceUrl": "http://feedproxy.google.com/~r/PopularTechnologyRadio/~5/zS6ZXkFbqyc/PT_021619.mp3"
        },
        {
            "title": "OMRON, Harley-Davidson, Audio-Technica, and TechDen at CES 2019 | #193",
            "datePublished": "Sat, 9 Feb 2019 01:00:00 GMT",
            "description": "<p style=\"text-align:left\">CES is the best place to keep up with all of the new gadgets and gizmos coming out this year, and we're back from our stage at the Las Vegas Convention Center with more coverage. First up, OMRON Director of Corporate Engineering, Mike Chen, explains their mission statement and what their technology means for the rest of the world. Next, Director of Digital Growth for Harley-Davidson, Ken Ostermann, details their first electric bike ever - the 2020 Harley-Davidson LiveWire. Is this the future of biking? Then, we chat with Audio-Technica Marketing Director, Gary Boss, about their wide array of phono cartridges, turntables, and premium Bluetooth headphones. Wrapping up the show, TechDen Founder and CEO, James Symons, has a solution for parents who want to teach their kids good screen time habits in a positive way. Don't miss this episode of Popular Technology Radio for the latest insights from CES 2019.</p>\r\n\r\n<p><ul><li>[00:00:00] OMRON's Forpheus Represents the Future</li>\r\n<li>[00:06:27] The Harmony of Humans and Machines</li>\r\n<li>[00:12:30] The 2020 Harley-Davidson LiveWire</li>\r\n<li>[00:19:51] Turntables Live on with Audio-Technica</li>\r\n<li>[00:29:11] Audio-Technica's True Wireless Earbuds</li>\r\n<li>[00:35:52] Curb Your Childrens' Device Screen Time</li></ul></p><img src=\"http://feeds.feedburner.com/~r/PopularTechnologyRadio/~4/oPTsxM1i4gs\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "15667400",
            "sourceUrl": "http://feedproxy.google.com/~r/PopularTechnologyRadio/~5/oPTsxM1i4gs/PT_020919.mp3"
        },
        {
            "title": "Morris Hayes and Tom Waterman Talk Music Tech at NAMM 2019 | #192",
            "datePublished": "Sat, 2 Feb 2019 01:00:00 GMT",
            "description": "<p style=\"text-align:left\">Every year musicians and audio companies gather in Anaheim, California to show of the latest in industry tech and celebrate the heritage of centuries past at the NAMM show. Starting off the show, technology expert, Mike Castanon, and host, Mike Etchart, discuss the melding of past and present in audio technology that happens at NAMM. Then, Musical Director and Keyboardist of Prince and the New Power Generation, Morris Hayes, recalls what it was like to land the gig and work with the legendary musician, Prince, and how music technology has evolved over the years. Next up, Universal Audio Product Specialist, Tom Waterman, discusses the history of Universal Audio and their new line of Apollo interfaces including the Apollo X. Wrapping up the show, Mike Castanon and Mike Etchart describe the dramatic shift in prices of musical and recording equipment from 30 years ago to today - it's an amazing time to build an at-home recording studio. Are you excited for the changes in the music industry?</p>\r\n\r\n<p><ul><li>[00:00:00] Centuries of Music Tech Blend at NAMM</li>\r\n<li>[00:05:41] Morris Hayes on Working with Prince</li>\r\n<li>[00:12:30] The Time Morris Hayes Said Too Much</li>\r\n<li>[00:19:50] The History of Universal Audio</li>\r\n<li>[00:27:42] New Apollo X Records 54-Piece Orchestra</li>\r\n<li>[00:35:51] Now is the Best Time for Home Studios</li></ul></p><img src=\"http://feeds.feedburner.com/~r/PopularTechnologyRadio/~4/MzxQ6HLawas\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "15661200",
            "sourceUrl": "http://feedproxy.google.com/~r/PopularTechnologyRadio/~5/MzxQ6HLawas/PT_020219.mp3"
        },
        {
            "title": "Sound Bars, Streaming Services, and Trends at CES 2019 | #191",
            "datePublished": "Sat, 26 Jan 2019 01:00:00 GMT",
            "description": "<p style=\"text-align:left\">Nestled away on our broadcast platform at CES 2019, we took some time to reflect on past trends and look towards the future. Starting the show, audio journalist for The Wirecutter, SoundStage! Solo, and JazzTimes, Brent Butterworth, shares his excitement about modern sound bars and urges us all to get one for our home theaters. Then, we discuss format wars, their effect on consumers, and what is going on in the world of digital media. Next, we explore Brent's new-found appreciation for The Beatles, a band he's traditionally had a fair amount of disdain for. Closing the show, President and CEO of the International Food and Beverage Technology Association (IFBTA), Rob Grimes, tells us why identifying the trends over the fads is important for him in his bid to stay ahead of the curve in the food and beverage vertical. Tune in for the latest from CES 2019.</p>\r\n\r\n<p><ul><li>[00:00:00] The Proliferation of Good Sound bars</li>\r\n<li>[00:07:19] Vizio's Sound bars Are Great Experience</li>\r\n<li>[00:12:30] A Lesson From Format Wars of the Past</li>\r\n<li>[00:19:51] 2019: The Year of Big Media Shake-ups</li>\r\n<li>[00:27:54] Two Guys Pontificating About The Beatles</li>\r\n<li>[00:35:51] Identifying Trends over Fads at CES 2019</li></ul></p><img src=\"http://feeds.feedburner.com/~r/PopularTechnologyRadio/~4/uzct6JkglWM\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "15661200",
            "sourceUrl": "http://feedproxy.google.com/~r/PopularTechnologyRadio/~5/uzct6JkglWM/PT_012619.mp3"
        },
        {
            "title": "Miracle-Gro and New Headphone Tech at Record-Breaking CES 2019 | #190",
            "datePublished": "Sat, 19 Jan 2019 01:00:00 GMT",
            "description": "<p style=\"text-align:left\">The Consumer Electronics Show has been around for 52 years and it continues to break records every year. Consumer Technology Association Manager, Industry Communications, Danielle Cassagnol, gives us some of the history of CES, from its start in the basement at the NAMM show, to the juggernaut event that it is today. Then, we discuss why in the heck Miracle-Gro has decided to dip their toes in the tech-show pond with Senior Vice President and General Manager, Mike Sutterer. Mike and Miracle-Gro have a solution that will bring your in-home farming to the next level. Closing the show, audio journalist for The Wirecutter, SoundStage! Solo, and JazzTimes, Brent Butterworth, fills us in on the amazing technological advancements being made in the headphone category. Don't miss out on our second show from the floor of CES 2019!</p>\r\n\r\n<p><ul><li>[00:00:00] Another Record Breaking Year for CES</li>\r\n<li>[00:06:23] History of CES and Exciting Health Tech</li>\r\n<li>[00:12:30] Miracle-Gro is at CES 2019?</li>\r\n<li>[00:19:50] Miracle-Gro Twelve Indoor System</li>\r\n<li>[00:27:56] Surround Sound and Noise Canceling</li>\r\n<li>[00:35:51] Eardrum Suck and Bluetooth Quality</li></ul></p><img src=\"http://feeds.feedburner.com/~r/PopularTechnologyRadio/~4/tSW4v4Wx4_U\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "15661200",
            "sourceUrl": "http://feedproxy.google.com/~r/PopularTechnologyRadio/~5/tSW4v4Wx4_U/PT_011919.mp3"
        },
        {
            "title": "Television Innovations, DJI Drones and Cameras at CES 2019 | #189",
            "datePublished": "Sat, 12 Jan 2019 01:00:00 GMT",
            "description": "<p style=\"text-align:left\">Every year hundreds of thousands of people and thousands of exhibitors gather to put the entire electronics industry on display across millions of square feet in Las Vegas, Nevada. CES 2019 is in full swing as we chat with our longtime buddy and Editor-at-large for the Wirecutter, Geoffrey Morrison, about the latest revelations in the television segment. There is a huge amount of news to cover, including LG's roll-up OLED TVs, Samsung and Sony's behemoth screens, the market confusion of microLED, quantum dot, OLED, QLED, and TCL's dominance of the inexpensive television market and expansion into appliances. Next, DJI Senior Communications Manager, Patrick Santucci, explains how they came to dominate the consumer drone market, and what they're bringing to the skies for casual fliers and cinematic professionals alike. If you thought that's all there was to DJI, you'd be wrong. Find out how their line of cameras and gimbals can help you look like an action-shot professional!</p>\r\n\r\n<p><ul><li>[00:00:00] Welcome to CES 2019 and Huge TVs!</li>\r\n<li>[00:06:50] LG Roll-Up TVs the Answer to Huge Sets?</li>\r\n<li>[00:12:30] TCL Makes Splash in Consumer Appliances</li>\r\n<li>[00:19:51] MicroLED, Quantum Dot, OLED Explained</li>\r\n<li>[00:27:46] DJI - Dominating the Drone Segment</li>\r\n<li>[00:35:52] More Than Just Drones, DJI Does Cameras</li></ul></p><img src=\"http://feeds.feedburner.com/~r/PopularTechnologyRadio/~4/04tH4_tSrOY\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "15667400",
            "sourceUrl": "http://feedproxy.google.com/~r/PopularTechnologyRadio/~5/04tH4_tSrOY/PT_011219.mp3"
        },
        {
            "title": "New Television Technology and Rivian at Upcoming CES 2019 | #188",
            "datePublished": "Sat, 22 Dec 2018 01:00:00 GMT",
            "description": "<p style=\"text-align:left\">CES 2019 is on the horizon and we take look ahead at what is perhaps the most pervasive category at the show: TVs. Freelance Writer for The Wirecutter and CNET, Geoffrey Morrison, gives us a reality check on Samsung's latest advancement in TV technology, 8K resolution. While this could be useful for VR or very large screens, most people will never be able to tell the difference between 8K and 4K, so don't waste your money. Then, we learn the differences between QLED and OLED, and discover why OLED rollable and transparent TVs will likely be novelty items for the foreseeable future. We close out the show with THE DRIVE with Alan Taylor host and Entertainment Radio Network CEO, Alan Taylor, as he fills us in on an up-and-coming electric vehicle company: Rivian. Don't miss the latest rumors from CES.</p>\r\n\r\n<p><ul><li>[00:00:00] Are Smaller Players Still Attending CES?</li>\r\n<li>[00:00:00] Don't Waste Your Money on 8K TVs</li>\r\n<li>[00:00:00] QLED vs OLED</li>\r\n<li>[00:00:00] OLED Rollable TVs Coming in 2019?</li>\r\n<li>[00:00:00] Transparent TV and Resolution Escalation</li>\r\n<li>[00:00:00] Watch Out for Rivian at CES 2019!</li></ul></p><img src=\"http://feeds.feedburner.com/~r/PopularTechnologyRadio/~4/Fpd02Zwdaz0\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "15661200",
            "sourceUrl": "http://feedproxy.google.com/~r/PopularTechnologyRadio/~5/Fpd02Zwdaz0/PT_122218.mp3"
        },
        {
            "title": "Understanding 5G, Automotive Autonomy, and VW Dieselgate | #187",
            "datePublished": "Sat, 15 Dec 2018 01:00:00 GMT",
            "description": "<p style=\"text-align:left\">As we finish our gadget shopping for Christmas we consider the cycle of new consumer electronics. Debuted every year at CES, these products usually don't drop until the end of the year, or later in some cases. One of the prominent new technologies we're thinking about looking into next year is the rollout of 5G wireless networks, and here to shed a little light on this complicated topic is CNET Executive Editor, Roger Cheng. We discover the benefits and shortcomings of the fledgling wireless standard, and learn how its introduction paralleles and differs from the rollout of 4G over a decade ago. Then, Hollywood Car Consultant, Josh Hancock, expounds upon the Volvo S90 we first heard about last week - he is very impressed with its sound system, interior, and level two autonomy. Closing the show, we discuss Volkswagen's dieselgate and how it has effectively squashed the momentum of diesel motors in the United States. Don't miss the latest in mobile and automotive technology.</p>\r\n\r\n<p><ul><li>[00:00:00] The Cycle of Tech, and Tweet Blunders</li>\r\n<li>[00:06:17] What Exactly is 4G LTE?</li>\r\n<li>[00:12:30] The Benefits of 5G Networks</li>\r\n<li>[00:19:51] 5G - Fast Internet, Short Range</li>\r\n<li>[00:28:16] Volvo S90 and Levels of Autonomy</li>\r\n<li>[00:35:51] Did Volkswagen Dieselgate Kill Diesel?</li></ul></p><img src=\"http://feeds.feedburner.com/~r/PopularTechnologyRadio/~4/gUGTxTPdUyc\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "15661200",
            "sourceUrl": "http://feedproxy.google.com/~r/PopularTechnologyRadio/~5/gUGTxTPdUyc/PT_121518.mp3"
        },
        {
            "title": "Automotive Technology at the Los Angeles Auto Show 2018 | #186",
            "datePublished": "Sat, 8 Dec 2018 01:00:00 GMT",
            "description": "<p style=\"text-align:left\">It has become increasingly apparent that the automotive and technology industries' fates have become intertwined as the latest gadgets and gizmos are embedded in our daily drivers. We discuss the trends that lead us to where we are today with JoshCAR Hollywood Car Consultant, Josh Hancock, at the start of the show. Then, Josh fills us in on some of the news coming out of the Los Angeles Auto Show, like Reviver Auto's digital license plates, Amazon's Alexa powered Echo Auto, and the emergence of two new all-electric car companies: BYTON and Rivian. Closing out the show, we wonder if the country is really ready for the next wave of electric vehicles. Tune in for the latest details from the LA Auto Show.</p>\r\n\r\n<p><ul><li>[00:00:00] Tracing the Auto Tech Explosion Back</li>\r\n<li>[00:06:44] Ups and Downs of Early Infotainment</li>\r\n<li>[00:12:30] Digital Plates, Spin, and Echo Auto</li>\r\n<li>[00:19:51] Reviver Auto and California Car Market</li>\r\n<li>[00:27:39] BYTON and Rivian Electrify LA Auto Show</li>\r\n<li>[00:35:51] Why We Aren't Quite Ready for EVs</li></ul></p><img src=\"http://feeds.feedburner.com/~r/PopularTechnologyRadio/~4/yzNKJkqSdto\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "15667400",
            "sourceUrl": "http://feedproxy.google.com/~r/PopularTechnologyRadio/~5/yzNKJkqSdto/PT_120818.mp3"
        },
        {
            "title": "Holiday Shopping and Digital Voice Assistants Trend Upwards | #185",
            "datePublished": "Sat, 1 Dec 2018 01:00:00 GMT",
            "description": "<p style=\"text-align:left\">Black Friday and Cyber Monday reported record breaking online sales while brick-and-mortar businesses saw slight slumps; but an unexpected victor emerged as eBay reported the strongest two days in their history. Mike Etchart waxes poetic about the glory days of eBay in the early 2000s and what a revelation it was to be able to find rare items previously only found through exhaustive garage saling and swap meeting. Alas, all good things fade, and as Amazon.com rose to prominence, eBay's success waned; and what wondrous, unexpected avenues Amazon would follow in the age of digital voice assistants. The Washington Post Tech Columnist, Geoffrey Fowler, recently wrote an article detailing his experience with the 'big three' of smart speakers - Amazon Alexa, Google Assistant, and Siri. While each assistant has their quirks, pitfalls, and triumphs, one speaker stands above all. Geoffrey describes how Amazon was able to claim the top spot from competitors that, at first glance, should have had an upper hand in the space. Then, ERN Production Assistant, Cody Castleberry, details his experience out among the throngs of Black Friday (or rather, Black Thursday) shoppers. The decline of brick-and-mortar sales is apparent, as less intensive crowds are gathered in checkout lines year by year. We close the show with a few Cyber Monday statistics that may be surprising, and a discussion about the convenience of sharing your information contrasting the price of admission for a private, more exclusive Apple ecosystem. Learn more about holiday shopping trends and your favorite digital voice assistants. </p>\r\n\r\n<p><ul><li>[00:00:00] Remembering Glory Days of eBay</li>\r\n<li>[00:06:01] Digital Voice Assistants and Tribes</li>\r\n<li>[00:12:30] Amazon Alexa: The Good, Bad, and Ugly</li>\r\n<li>[00:19:51] Amazon vs. Google vs. Apple </li>\r\n<li>[00:28:25] Online Holiday Shopping Shift Continues</li>\r\n<li>[00:35:51] Info Inclusive vs. Privately Exclusive</li></ul></p><img src=\"http://feeds.feedburner.com/~r/PopularTechnologyRadio/~4/OfnRoBOOssM\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "15661200",
            "sourceUrl": "http://feedproxy.google.com/~r/PopularTechnologyRadio/~5/OfnRoBOOssM/PT_120118_e.mp3"
        },
        {
            "title": "Evolution of Sound, Headphones, and the Holiday Shopping Frenzy | #184",
            "datePublished": "Sat, 24 Nov 2018 01:00:00 GMT",
            "description": "<p style=\"text-align:left\">Black Friday has come and gone, but the best deals of the year are still going on through Cyber Monday and the rest of what has now been dubbed Cyber Week. Mike Etchart opens the show with a few holiday shopping season forecast statistics for 2018 that may surprise you. Then, we discuss the history of headphones with Brent Butterworth from Wirecutter. Next, Brent tells us about a $50 pair of headphones that you can't pass up from Tribit, the XFree Tune, and why journalist have such a hard time touring the Chinese factories that make all of our favorite electronics. Cranking up the volume, we chat about the secret, dark art of noise canceling headphones, and why the Anker Soundcore Space NC may be the best bang for your 100 bucks on the market. Closing the show, Brent fills us in on the Puro Sound Labs headphones and his top pick for portable bluetooth speakers - the Tribit XBoom. Don't miss this episode if you're in the market for some new sound!</p>\r\n\r\n<p><ul><li>[00:00:00] Shopping Season Forecast Statistics</li>\r\n<li>[00:06:28] History of Premium Headphones</li>\r\n<li>[00:12:30] Tribit, Chinese Factories, and Tuning</li>\r\n<li>[00:19:51] Dark Arts of Noise Canceling Headphones</li>\r\n<li>[00:28:32] Anker Soundcore Space NC</li>\r\n<li>[00:35:52] Puro Sound Labs and Tribit XBoom</li></ul></p><img src=\"http://feeds.feedburner.com/~r/PopularTechnologyRadio/~4/RXI8REfbsb0\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "15667400",
            "sourceUrl": "http://feedproxy.google.com/~r/PopularTechnologyRadio/~5/RXI8REfbsb0/PT_112418.mp3"
        },
        {
            "title": "TV Prices Drop and 360 Cam Tech Advances Before Black Friday | #183",
            "datePublished": "Sat, 17 Nov 2018 01:00:00 GMT",
            "description": "<p style=\"text-align:left\">Popular Technology Radio is back as Thanksgiving, Black Friday, and Cyber Monday draw closer, promising amazing deals on everything from 360 cameras to TV sets. First off, Mike Etchart gets back in the pilot's chair, contrasts the prices of TVs today with plasma sets of 20 years ago, and gets us ready for CES and NAMM in January 2019. Then, Geoff Morrison tells us why heavily discounted televisions during the Black Friday weekend aren't as good of deals as we may be lead to believe. Next, we dive into how TVs have gotten as inexpensive as they have due to the natural progression of manufacturing technology. Changing topics, Geoff describes why Insta360's One X is the best camera on the market. Closing the show, we discuss LG's monopoly on OLED TV manufacturing technology, and why Samsung can't get a foothold in this market. Tune in and get ready for Black Friday!</p>\r\n\r\n<p><ul><li>[00:00:00] Mike Etchart, Back in the Pilot's Seat</li>\r\n<li>[00:07:10] Discount TVs, Not As Good As You Think</li>\r\n<li>[00:12:30] Asian Manufacturing Power Shifts</li>\r\n<li>[00:19:51] Lack of Name Brand Recognition in China</li>\r\n<li>[00:28:22] The Wirecutter Loves Insta360's One X</li>\r\n<li>[00:35:51] LG's Monopoly On OLED</li></ul></p><img src=\"http://feeds.feedburner.com/~r/PopularTechnologyRadio/~4/bQe87VcxcwU\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "15661200",
            "sourceUrl": "http://feedproxy.google.com/~r/PopularTechnologyRadio/~5/bQe87VcxcwU/PT_111718.mp3"
        },
        {
            "title": "Apple's World Wide Developers Conference and HDR Televisions | #182",
            "datePublished": "Sat, 9 Jun 2018 10:00:00 GMT",
            "description": "<p> Keeping up with the pace of technological advances is no easy feat; thankfully our expert hosts, Jason Masters and Mike Etchart, are up to the challenge! We begin the hour with an analysis of the 2018 Apple World Wide Developers Conference which placed a significant emphasis on software upgrades. Notably, iOS 12 will continue to work on legacy devices, FaceTime can now accommodate up to 32 simultaneous users per session with an added Animoji filter option, and new devices will support Dolby Atmos for next-level surround sound. With sweet tunes top of mind, we learn how Apple Music will stack up against competing for streaming applications such as Spotify. Changing focus, The Wire Cutter's Geoff Morrison delves into the evolution of television technology. While most modern TVs are offered in HDR, your viewing experience will vary greatly depending on the set's resolution. Geoff also goes in depth describing the differences between 2K, 4K, and 8K TVs. Lastly, Geoff tells us about the newest broadcasting standard that will be here by winter of 2020; ATSC 3.0 will deliver Ultra HD and Dolby Atmos over the air for free, and will most likely have a box that you integrate into your current entertainment system. If your home is in need of a technology update, we have the information you need to make the best decision.</p>\r\n<p><ul><li>[00:00:00] TV Prices Race to the Bottom</li>\r\n<li>[00:08:00] Apple Lover vs. Android Fanboy</li>\r\n<li>[00:12:31] Apple Worldwide Developers Conference</li>\r\n<li>[00:19:52] Apple TV/ Spectrum Skinny Bundle</li>\r\n<li>[00:29:07] Hear the Difference with Dolby Atmos</li>\r\n<li>[00:35:53] Apple Music Raises Bar for Streaming</li>\r\n<li>[00:42:13] High Dynamic Range (HDR) Basics</li>\r\n<li>[00:49:51] How to Get a True HDR Experience</li>\r\n<li>[00:54:44] Comparing HDR10 and Dolby Vision</li>\r\n<li>[01:02:05] Should You Upgrade to an 8K TV?</li>\r\n<li>[01:08:39] Beginner's Guide to Better HDR</li>\r\n<li>[01:18:09] New TV Broadcasting Standards for 2020</li></ul></p><img src=\"http://feeds.feedburner.com/~r/PopularTechnologyRadio/~4/d5RiFIHARAQ\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "31427800",
            "sourceUrl": "http://feedproxy.google.com/~r/PopularTechnologyRadio/~5/d5RiFIHARAQ/PT_060918.mp3"
        },
        {
            "title": "Augmented World Expo and Jamstik | #181",
            "datePublished": "Sat, 26 May 2018 12:00:00 GMT",
            "description": "<p>Technology opens doors that we could never have imagined and now it's possible for many of us to access these new worlds from our mobile phones. We begin the hour with the Co-Founder of the Augmented World Expo, Ori Inbar, who discusses how the expo has evolved in the last nine years. There will be over 400 speakers (100 of which are women) and 250 exhibitors that will be displaying the latest in augmented reality (AR) and virtual reality (VR). For anywhere from $49-$1000 (depending on the package you want), you can attend the expo and explore the wonderful advancements that have been made in the AR world. While this event is open to the public, it mostly attracts professionals that are working or wanting to work in the industry. If you're interested in discovering more about what the future holds for AR and VR, you don't want to miss this. Switching gears, we talk with Chris Heille, Director of Product Innovation of Zivix LLC, about their latest Indiegogo campaign for the Jamstik 7 and Jamstik 12. After the success of the original Jamstik and the Jamstik Plus, the team decided that they really needed to take these musical products to the next level. These new models of the Jamstik will feature seven or twelve frets (model specific) and the updated software will make it possible to use them not only on Apple products but Windows friendly machines as well. They will come equipped with MIDI Bluetooth and a USB port to connect to the device of your choice. The Jamstik 7, which was designed specifically for beginners will be priced, unbundled, at around $249 and the 12 at $279. If you are ready for some new technology in your life, tune in for more now.</p>\r\n<p><ul><li>[00:00:00] Augmented World Expo</li>\r\n<li>[00:04:45] 50 Year 'Overnight Success'</li>\r\n<li>[00:12:31] Augmented Reality Cloud</li>\r\n<li>[00:19:51] Developers and Creators</li>\r\n<li>[00:25:07] Jamstik Seven and Twelve</li>\r\n<li>[00:35:53] Apple and Windows Compatible</li></ul></p><img src=\"http://feeds.feedburner.com/~r/PopularTechnologyRadio/~4/Lk6EOnzl5dA\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "15686000",
            "sourceUrl": "http://feedproxy.google.com/~r/PopularTechnologyRadio/~5/Lk6EOnzl5dA/PT_052618.mp3"
        },
        {
            "title": "Lux Products Kono, Cibus and Gene Editing, and 1MORE Headphones | #180",
            "datePublished": "Sat, 5 May 2018 12:00:00 GMT",
            "description": "<p>Keep cool with an affordable smart thermostat, eat right with gene edited foods, and listen to your favorite tunes with 1MORE headphones. Alan Taylor, Host of the Drive with Alan Taylor, and Brendon Massa share their experience with the Lux Kono smart thermostat. Then, we chat with Rob Munin, CEO of Lux Products, about the company's history dating back to 1914, and their recent foray into the smart thermostat market. Next, Cibus Chief Scientific Officer, Greg Gocal, describes the difference between GMO and gene edited foods. Cibus is working to revolutionize the way we engineer plants. Last, Ari Morguelan, Director of Marketing and PR for 1MORE USA, Inc., explains the genesis of the company and what makes their patented headphone technology unique. <a href=\"https://www.ernlive.com/show/poptech-radio/59/episodes/lux-products-kono-cibus-and-gene-editing-and-1more-headphones-180\">Tune in now.</a></p>\r\n\r\n<p><ul><li>[00:00:00] Alan Taylor Tests the Lux Kono</li>\r\n<li>[00:06:32] Lux, Not Just a Thermostat Company</li>\r\n<li>[00:12:30] Lux Kono - Easy, Affordable, Customizable</li>\r\n<li>[00:19:35] Geofencing and Voice Control</li>\r\n<li>[00:27:13] GMO vs Gene Editing</li>\r\n<li>[00:35:54] Cibus Makes Use of Natures Gifts</li>\r\n<li>[00:42:14] 1MORE Headphones</li>\r\n<li>[00:46:57] Grammy Winning Tuning Quality</li>\r\n<li>[00:54:45] Two New Headphones from 1MORE</li></ul></p><img src=\"http://feeds.feedburner.com/~r/PopularTechnologyRadio/~4/Blvzfj9bWDM\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "23057800",
            "sourceUrl": "http://feedproxy.google.com/~r/PopularTechnologyRadio/~5/Blvzfj9bWDM/PT_050518.mp3"
        },
        {
            "title": "360 Made Easier by Insta360 and Online Marketing Explained by 4-Tell | #179",
            "datePublished": "Sat, 14 Apr 2018 12:00:00 GMT",
            "description": "<p>Get your 360 video career off the ground with Insta360 and market your products effectively online with 4-Tell. Insta360 Senior Marketing Manager, Michael Shabun, gives us a tour of their 360 degree camera lineup and FlowState updates. 4-Tell President and CEO, Tom O'Keefe, shares his predictions for the future of in-store and online retail and describes what 4-Tell does in this space. <a href=\"https://www.ernlive.com/show/poptech-radio/59/episodes/360-made-easier-by-insta360-and-online-marketing-explained-by-4-tell-179\">Tune in to find out more.</a></p>\r\n\r\n<p><ul><li>[00:00:00] Insta360 Makes 360 Degree Video Easy</li>\r\n<li>[00:03:42] New One and Nano S Cameras</li>\r\n<li>[00:12:30] FlowState Update and Titan from Insta360</li>\r\n<li>[00:19:52] Triggered Ads and Amazon Go</li>\r\n<li>[00:32:11] Augmented Reality Shopping</li>\r\n<li>[00:35:55] Thievery in the Workplace and 4-Tell</li></ul></p><img src=\"http://feeds.feedburner.com/~r/PopularTechnologyRadio/~4/9PjVI0STkXE\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "15667400",
            "sourceUrl": "http://feedproxy.google.com/~r/PopularTechnologyRadio/~5/9PjVI0STkXE/PT_041418.mp3"
        },
        {
            "title": "Orbi, Shell Ocean Discovery XPRIZE, and Intel Studies Whales | #178",
            "datePublished": "Sat, 31 Mar 2018 12:00:00 GMT",
            "description": "<p>From your fortified bunker of a home to the open ocean, technology is enhancing our lives in more ways than we can count. NETGEAR Product Management Leader for Orbi Connected Home, Amit Rele, describes how their Orbi mesh Wi-Fi network can deliver internet to the farthest reaches of your house. With tri-band communication, a sleek, accessible app, and great coverage with just two units, Orbi consistently garners praise from reviewers across the net. Then, we dive deep with XPRIZE Prize Lead and Senior Director of Planet and Environment, Jyotika Virmani, Ph.D., who fills us in on the nine finalists for the Shell Ocean Discovery XPRIZE. Mapping the seafloor is no easy feat. Then, Intel Labs Senior Principal Engineer, Dr. Ted Wilke, shares how they're partnering with Parley for the Oceans and SnotBot to use AI and machine learning to collect samples from whales and their exhalant. With a mission to identify and study whale morphometry, Dr. Ted Wilke and Intel are lending their knowledge to Parley for the Ocean's effort to determine the health of the ocean by discerning the wellbeing of top predators, whales.<a href=\"https://www.ernlive.com/show/poptech-radio/59/episodes/orbi-shell-ocean-discovery-xprize-and-intel-studies-whales-178\">Tune in now.</a></p>\r\n\r\n<p><ul><li>[00:00:00] Old Houses vs Wi-Fi Connectivity</li>\r\n<li>[00:05:20] Orbi Mesh Wi-Fi Saves Mike's Bacon</li>\r\n<li>[00:12:30] Deliver Us from Wi-Fi Dead Zones</li>\r\n<li>[00:19:09] Get Around Thick Walls with Orbi</li>\r\n<li>[00:28:19] Coverage and Parental Controls</li>\r\n<li>[00:35:11] Orbi: Top Reviewed Home Mesh Network</li>\r\n<li>[00:41:31] Shell Ocean Discovery XPRIZE</li>\r\n<li>[00:45:53] 9 Teams Vie for Ocean Discovery XPRIZE</li>\r\n<li>[00:54:02] Mapping the Ocean for Future Prosperity</li>\r\n<li>[01:01:25] Intel and SnotBot Study Whales with AI</li>\r\n<li>[01:07:59] Identification and Morphometry</li>\r\n<li>[01:17:26] What Tale Can a Whale's Tail Tell?</li></ul></p><img src=\"http://feeds.feedburner.com/~r/PopularTechnologyRadio/~4/zrzgJWKxTXk\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "30814000",
            "sourceUrl": "http://feedproxy.google.com/~r/PopularTechnologyRadio/~5/zrzgJWKxTXk/PT_033118.mp3"
        },
        {
            "title": "SleepScore Max, Phone Usage Habits, and SHARP | #177",
            "datePublished": "Sat, 17 Mar 2018 12:00:00 GMT",
            "description": "<p>We take a look at our sleeping and phone habits and delve into the world of SHARP appliances this week on Popular Technology Radio. First, SleepScore VP of Sleep Science and Scientific Affairs, Roy Raymann, demystifies sleep research and the SleepScore Max to help us get a good night's rest. Then, Expert in Mind-Brain Behavior and the Science of Happiness at Harvard / Psychologist at Massachusetts General Hospital Department of Psychiatry, Dr. Nancy Etcoff, shares her findings on phone addiction in a study she did with Motorola and offers up suggestions on how to wean ourselves off of our devices. Last, Peter Weedfald, Senior Vice President of Sales and Marketing for SHARP Home Appliances, fills us in on their new SuperSteam countertop oven, gesture controlled in-wall microwave drawer, and plasmacluster ion purification technology. <a href=\"https://www.ernlive.com/show/poptech-radio/59/episodes/sleepscore-max-phone-usage-habits-and-sharp-177\">Tune in now.</a></p>\r\n\r\n<p><ul><li>[00:00:00] Turning Research Into Sleep</li>\r\n<li>[00:05:29] Consistency and Circadian Rhythm</li>\r\n<li>[00:12:31] Manage Your Habits by Measuring Them</li>\r\n<li>[00:19:53] Recommendations for Better Sleep</li>\r\n<li>[00:27:33] Habitual Phone Usage a Problem</li>\r\n<li>[00:35:56] Pay Attention to the Tasks at Hand</li>\r\n<li>[00:42:16] Gesture Control for your Microwave?</li>\r\n<li>[00:49:57] SuperSteam Your Countertop</li>\r\n<li>[00:54:46] Cooking With Steam</li>\r\n<li>[01:02:09] Steamed Pizza? Say What?</li>\r\n<li>[01:10:06] Plasmacluster Ion Tech Cleans House</li>\r\n<li>[01:18:10] Keep It Simple SHARP</li></ul></p><img src=\"http://feeds.feedburner.com/~r/PopularTechnologyRadio/~4/u7W1FQcp5DI\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "31136400",
            "sourceUrl": "http://feedproxy.google.com/~r/PopularTechnologyRadio/~5/u7W1FQcp5DI/PT_031718.mp3"
        },
        {
            "title": "Motiv Fitness Tracking Ring and Online Danger | #176",
            "datePublished": "Sat, 3 Mar 2018 12:00:00 GMT",
            "description": "<p>Are you sick of bulky wrist-worn health monitors? Tired of tricksters emailing you about the PayPal account you don't even have? Well, Motiv Co-Founder and CTO, Curt von Badinski, and Secure Anchor Consulting Founder and CEO, Eric Cole, PhD, have solutions for you. Curt tells us about their lightweight, fitness tracker ring, and the struggle it took to get it to market. Then, Dr. Cole shares some of his tips for staying cyber safe, avoiding email scams, and making sure your family is protected.<a href=\"https://www.ernlive.com/show/poptech-radio/59/episodes/motiv-fitness-tracking-ring-and-online-danger-176\">Tune in now.</a></p>\r\n\r\n<p><ul><li>[00:00:00] Get Useful Info in a Minimal Package</li>\r\n<li>[00:05:13] The Tech of Tiny Health Monitoring Ring</li>\r\n<li>[00:12:31] Fitness Ring Challenges</li>\r\n<li>[00:19:55] Safeguard Your Information</li>\r\n<li>[00:28:52] Keeping Kids Safe on the Internet</li>\r\n<li>[00:35:57] Scam Emails - Beware Urgency and Emotion</li></ul></p><img src=\"http://feeds.feedburner.com/~r/PopularTechnologyRadio/~4/OcFcZSJvywA\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "15481400",
            "sourceUrl": "http://feedproxy.google.com/~r/PopularTechnologyRadio/~5/OcFcZSJvywA/PT_030318.mp3"
        },
        {
            "title": "Smart Nora, ASTI, EchoBox, Bitdefender, and FarmBot | #175",
            "datePublished": "Sat, 24 Feb 2018 12:00:00 GMT",
            "description": "<p>Learn how to stay cybersafe, jam to your favorite tunes, sleep right, and automate your garden this week on Pop Tech Radio. First off, Smart Nora CEO and Co-Founder, Behrouz Hariri, tells us about their microphone activated, inflatable pillow powered anti-snoring device that keeps your partner from strangling you in your sleep. Then, Adaptive Sound Technology, Inc. (ASTI) President and CEO, Sam Nicolino, explains how they've painstakingly captured naturalistic, urban, and other sounds to drown out background noise while you sleep. Next, EchoBox Director of Growth, Josh McKenzie, shares how they've been able to provide premium Hi-Fi, titanium bodied earbuds at a reasonable price. Also, Bitdefender IoT Director, Dan Berte, wakes us up a cold reality; every internet-enabled device is at risk to cyber threats. Find out the Bitdefender BOX can keep us safe. Finally, Rory Aronson, CEO of FarmBot, shares his vision for building a self-sufficient future - hundreds of thousands of micro farms across the globe. <a href=\"https://www.ernlive.com/show/poptech-radio/59/episodes/smart-nora-asti-echobox-bitdefender-and-farmbot-175\">Tune in now.</a></p>\r\n\r\n<p><ul><li>[00:00:00] Snore No More with Smart Nora</li>\r\n<li>[00:06:54] Sleep - One of Three Pillars of Health</li>\r\n<li>[00:12:31] Get to Sleep with ASTI</li>\r\n<li>[00:19:54] Adaptive Sound Environments for Baby</li>\r\n<li>[00:31:43] Audiophile Earbuds for Reasonable Price</li>\r\n<li>[00:35:56] EchoBox in VR and on the Road</li>\r\n<li>[00:42:16] Defend Your Home with Bitdefender BOX</li>\r\n<li>[00:47:43] Shield Yourself From Cyber Attacks</li>\r\n<li>[00:54:46] Be Self Sufficient; Be Your Own Farmer</li>\r\n<li>[01:02:09] Automate Your Garden - Reap the Rewards</li>\r\n<li>[01:10:32] Open Source Farming Info at Openfarm</li>\r\n<li>[01:18:10] FarmBot: An Iterative Process</li></ul></p><img src=\"http://feeds.feedburner.com/~r/PopularTechnologyRadio/~4/34SPdnwSTe8\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "31291400",
            "sourceUrl": "http://feedproxy.google.com/~r/PopularTechnologyRadio/~5/34SPdnwSTe8/PT_022417.mp3"
        },
        {
            "title": "Viome Returns to Save Your Gut, Health, and Money | #174",
            "datePublished": "Sat, 10 Feb 2018 12:00:00 GMT",
            "description": "<p>This is your gut. There are many like it, but this one is yours. Your gut is your best friend. It is your life. You must master it as you must master your life. Viome Founder and CEO, Naveen Jain, and Chief Medical Officer, Helen Messier, describe the unique nature of everyone's gut, and how wildly different microbiome needs can be. The microorganisms in your body control you in almost every way, so if they're not happy, you're not happy. Find out how a simple test and a few hundred dollars can save you thousands on medical expenses by getting your microbiome in check. Also, <a href=\"https://www.ernlive.com/show/poptech-radio/59/episodes/viome-returns-to-save-your-gut-health-and-money-174\">discover what Viome's latest tests have found out about the way food affects each person differently. </a></p>\r\n\r\n<p><ul><li>[00:00:00] Catching Up With Viome</li>\r\n<li>[00:06:40] Humans: A Microorganisms' Story</li>\r\n<li>[00:12:31] Ditch the Pills, Fix Your Gut</li>\r\n<li>[00:19:53] Jason's Diet and Viome's Ongoing Studies</li>\r\n<li>[00:27:38] Diversify Your Diet - Reap The Rewards</li>\r\n<li>[00:35:57] Fit Doesn't Equal Healthy</li></ul></p><img src=\"http://feeds.feedburner.com/~r/PopularTechnologyRadio/~4/G-MMUMZJ6xI\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "15735600",
            "sourceUrl": "http://feedproxy.google.com/~r/PopularTechnologyRadio/~5/G-MMUMZJ6xI/PT_021018.mp3"
        },
        {
            "title": "Old History and New Tech at NAMM 2018 | #173",
            "datePublished": "Sat, 3 Feb 2018 12:00:00 GMT",
            "description": "<p>Mike Etchart and Guest Co-Host, Mike Castanon, are living it up at NAMM 2018 surrounded by their favorite things in the whole world, musical instruments! NAMM (the National Association of Music Merchants) showcases the newest, coolest tech, alongside the best classics in the music world. First, we chat with Universal Audio Product Specialist, Tom Waterman, about their part in the birth of the modern recording industry. Then, VP of Sales Operations for Roland, Robin Kelly, tells the story of when the TR-808 was first released, from failure to underground success. Next, we chat with Survios Director of Marketing, Hunter Kitagawa, about their new VR music creation experience, Electronauts. Former Chairman of NAMM, Dennis Houlihan, discusses the robust future of retail in the music industry and how musicians want a place to touch and play an instrument before they buy. Also, James 'McGoo' McGregor fills us in on his new app, PLNIFY, that makes your life as a traveling team easy. QSC Product Manager of Pro PA Loudspeakers, Chris Brouelette, describes how they've made PA and amplification tech compact and lightweight for the modern age. Then, Del Breckenfeld tells us about his charity benefit with the band, Gambler. Premier Guitar Publisher and Managing Director, Jon Levy, gives us some insight on the duality of musicians interest, and Fender's wacky guitar on display in their booth. We wrap up the show with Vienna Symphonic Library Director of Marketing and PR, Martin Tichy, discuesses how they've made composing orchestral pieces simple. <a href=\"https://www.ernlive.com/show/poptech-radio/59/episodes/old-history-and-new-tech-at-namm-2018-173\">Find out more, here!</a></p>\r\n\r\n<p><ul><li>[00:00:00] NAMM, A Trade Show Like No Other</li>\r\n<li>[00:06:09] Universal Audio and Bill Putnam Sr.</li>\r\n<li>[00:12:30] The Revival of Universal Audio</li>\r\n<li>[00:19:53] The TR-808: From Failure to Revolution</li>\r\n<li>[00:27:26] The Customer is #1 at Roland</li>\r\n<li>[00:35:54] Get Into the Music with Electronauts</li>\r\n<li>[00:42:16] The Future of Retail and NAMM</li>\r\n<li>[00:49:23] PLNIFY Your Life on the Road</li>\r\n<li>[00:54:46] Bring Your PA Without a Workout Regimen</li>\r\n<li>[01:02:09] Del Breckenfeld and Amplify EM</li>\r\n<li>[01:12:18] Your #1 Source for Guitar News</li>\r\n<li>[01:18:10] VSL Brings Orchestra to Your Fingertips</li></ul></p><img src=\"http://feeds.feedburner.com/~r/PopularTechnologyRadio/~4/lChH3deRyl8\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "31471200",
            "sourceUrl": "http://feedproxy.google.com/~r/PopularTechnologyRadio/~5/lChH3deRyl8/PT_020318.mp3"
        },
        {
            "title": "Omron, Sniffy, TCL, Kids Connect, and ChiliPad at CES 2018 | #172",
            "datePublished": "Sat, 27 Jan 2018 12:00:00 GMT",
            "description": "<p>We wrap up our coverage of CES 2018 with a host of great products and insights from industry leaders. First off, Marketing Group Manager for Omron Automation, Mike Chen, introduces us to Forpheus, a ping pong robot tutor, and Omron's wide array of manufacturing targeted AI, software, and robotics. Then, Alexandre Juving-Brunet, Sniffy Founder and CEO/COO, tells us about his 5D multisensorial experience that uses synthesized fragrances to appeal to one of our most ingrained senses, smell. Next, TCL Product Evangelist, Bruce Walker, shares some of the brand's triumphs and future plans, including an expanded offering, and growing market share. Also, industry veteran and BoxBuild Co-Founder, Todd Metlen, explains why CES is irrelevant to his company, and how Kickstarter and online marketing strategies have all but replaced the titanic trade show. Last, Chili Technology Co-Founder, Todd Youngblood, helps us cool down in the summer, and stay warm in the winter with their ChiliPad, an amazing new temperature controlled mattress pad.<a href=\"https://www.ernlive.com/show/poptech-radio/59/episodes/omron-automation-sniffy-tcl-kids-connect-and-chili-at-ces-2018-172\">Tune in now.</a></p>\r\n\r\n<p><ul><li>[00:00:00] Meet Forpheus - The Ping Pong Robot</li>\r\n</li>[00:05:53] Respectful Robots and Drowsy Drivers</li>\r\n</li>[00:12:30] Smell Before You Buy with Sniffy</li>\r\n</li>[00:24:26] TCL Bringing Quality, Affordable TVs</li>\r\n</li>[00:35:31] Live and Die by Consumer Interest</li>\r\n</li>[00:39:56] Kickstarter and Online Marketing > CES?</li>\r\n</li>[00:48:02] Kids Connect: Smart and Safe</li>\r\n</li>[00:55:23] Don't Sleep In Misery, Sleep In 'Chili'</li>\r\n</li>[01:06:36] Sleep Responsibly with ChiliPad</li></ul></p><img src=\"http://feeds.feedburner.com/~r/PopularTechnologyRadio/~4/k-DQUMjhJic\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "26616600",
            "sourceUrl": "http://feedproxy.google.com/~r/PopularTechnologyRadio/~5/k-DQUMjhJic/PT_012718_e.mp3"
        }
    ]
}