{
    "artwork": "http://is2.mzstatic.com/image/thumb/Music111/v4/14/bf/4a/14bf4ab8-db0e-aee4-3a6d-2b797d2d16ca/source/100x100bb.jpg",
    "description": "Welcome to the Official Audioboo channel of the Premier League.\nhttp://premierleague.com (http://premierleague.com)",
    "feedURL": "https://audioboom.com/channels/1609113.rss",
    "podcastURL": "https://audioboom.com/channel/premierleague",
    "publisher": "Premier League",
    "title": "Premier League",
    "episodes": [
        {
            "title": "Redknapp laments \"naive\" defence",
            "datePublished": "Sun, 19 Oct 2014 16:39:22 +0000",
            "description": "QPR manager rues his side going for the win late on in the defeat by Liverpool #qprfc #qpr #lfc #bpl",
            "length": "2329190",
            "sourceUrl": "https://audioboom.com/posts/2576132.mp3?modified=1575062490&source=rss&stitched=1"
        },
        {
            "title": "\"We were lucky,\" admits Rodgers",
            "datePublished": "Sun, 19 Oct 2014 16:17:46 +0000",
            "description": "Liverpool manager on his side's luck to beat QPR and how Philippe Coutinho's introduction helped #bpl #lfc #qprfc #qpr #liverpoolfc",
            "length": "3005807",
            "sourceUrl": "https://audioboom.com/posts/2576091.mp3?modified=1575062819&source=rss&stitched=1"
        },
        {
            "title": "\"We were always in control.\" Jose Mourinho on the victory over Crystal Palace",
            "datePublished": "Sun, 19 Oct 2014 07:41:08 +0000",
            "description": "#cpfc #cfc #bpl",
            "length": "2600199",
            "sourceUrl": "https://audioboom.com/posts/2575582.mp3?modified=1575068447&source=rss&stitched=1"
        },
        {
            "title": "Paul Lambert post-match press-conference: Everton 3-0 Aston Villa",
            "datePublished": "Sat, 18 Oct 2014 18:27:01 +0000",
            "description": "The Aston Villa reacts after his side lost to Everton at Goodison Park #efc #bpl #avfc",
            "length": "1166277",
            "sourceUrl": "https://audioboom.com/posts/2574801.mp3?modified=1575046815&source=rss&stitched=1"
        },
        {
            "title": "Arsene Wenger's post-match press conference: Arsenal 2-2 Hull City",
            "datePublished": "Sat, 18 Oct 2014 18:25:50 +0000",
            "description": "The Arsenal manager expresses his frustrations after his side needed a late equaliser to grab a point #afc #hullcity #hafc #arsenalfc #bpl",
            "length": "1399588",
            "sourceUrl": "https://audioboom.com/posts/2574796.mp3?modified=1575044124&source=rss&stitched=1"
        },
        {
            "title": "Steve Bruce post-match press conference: Arsenal 2-2 Hull City",
            "datePublished": "Sat, 18 Oct 2014 18:07:41 +0000",
            "description": "Hear what the Hull manager made of his side's battling draw at Emirates Stadium #afc #hullcity #bpl",
            "length": "1954050",
            "sourceUrl": "https://audioboom.com/posts/2574775.mp3?modified=1579163935&source=rss&stitched=1"
        },
        {
            "title": "Neil Warnock post-match press conference: Crystal Palace 1-2 Chelsea",
            "datePublished": "Sat, 18 Oct 2014 18:05:46 +0000",
            "description": "The Crystal Palace manager faces the press after his side's defeat at Selhurst Park #cpfc #bpl #cfc",
            "length": "1501414",
            "sourceUrl": "https://audioboom.com/posts/2574774.mp3?modified=1575065229&source=rss&stitched=1"
        },
        {
            "title": "Manuel Pellegrini post-match press conference: Man City 4-1 Spurs",
            "datePublished": "Sat, 18 Oct 2014 18:04:34 +0000",
            "description": "The Manchester City manager gives his verdict on the victory at the Etihad Stadium #bpl #mcfc #thfc",
            "length": "3298299",
            "sourceUrl": "https://audioboom.com/posts/2574771.mp3?modified=1579163937&source=rss&stitched=1"
        },
        {
            "title": "Joel Ward looking forward to Chelsea test",
            "datePublished": "Fri, 17 Oct 2014 10:31:45 +0000",
            "description": "Crystal Palace defender says his side should not fear the visit of the undefeated Barclays Premier League leaders\r\n#cpfc #bpl #cfc #chelseafc #joelward",
            "length": "688843",
            "sourceUrl": "https://audioboom.com/posts/2571325.mp3?modified=1579162026&source=rss&stitched=1"
        },
        {
            "title": "Barclays Premier League Podcast, Episode 39",
            "datePublished": "Wed, 14 May 2014 09:31:57 +0000",
            "description": "Everton manager Roberto Martinez joins Iain Dowie, Matt Jackson and Marcus Buckland for the final Barclays Premier League Podcast of the season to review what has been an incredible 10 months of top-flight football. The Toffees boss reflects on achieving the club's highest points tally since they last won the league and tells us about the promising batch of youngsters coming through at Goodison Park. We analyse where the title was won and lost and get reaction from Manuel Pellegrini and Vincent Kompany after Manchester City were crowned Champions. Southampton legend Matt Le Tissier tells us about his love for the Saints' fans. Plus we hear from Jose Mourinho, Ryan Giggs and Tony Pulis, and we'll be conducting our very own end of season awards.\n#efc #bpl #epl #everton",
            "length": "42038423",
            "sourceUrl": "https://audioboom.com/posts/2161352.mp3?modified=1579412935&source=rss&stitched=1"
        },
        {
            "title": "Barclays Premier League Podcast, Episode 38",
            "datePublished": "Tue, 06 May 2014 15:29:55 +0000",
            "description": "Crystal Palace chairman Steve Parish joins Dave Farrar and former Charlton Athletic and Ipswich Town midfielder Matt Holland to discuss his club's incredible comeback against Liverpool, which could decide the destination of the title. West Bromwich Albion defender Steven Reid describes his relief at securing top-flight football for another season, while Manchester United midfielder Darren Fletcher reveals the impact Ryan Giggs has had since taking the reins at Old Trafford. Plus we hear from Felix Magath and Ole Gunnar Solsjkaer as Fulham and Cardiff City become the first two sides to be relegated from the Barclays Premier League this season.",
            "length": "35298125",
            "sourceUrl": "https://audioboom.com/posts/2135813.mp3?modified=1579428301&source=rss&stitched=1"
        },
        {
            "title": "Barclays Premier League Podcast, Episode 37",
            "datePublished": "Tue, 29 Apr 2014 17:47:10 +0000",
            "description": "Manchester United legend Bryan Robson and former Sunderland striker Kevin Phillips join Ed Chamberlin and Nigel Winterburn on this week’s show. Robson talks exclusively about his former team-mate Ryan Giggs’ new role as interim manager at Old Trafford and Phillips discusses his recent retirement following an illustrious career as well as his Sunderland’s survival chances. We hear from PFA Award winners Luis Suarez and Eden Hazard, as well as Yaya Toure, Wilfried Bony and many more. #ryangiggs #manutd #lfc #luissuarez #safc #cfc #swans #mcfc",
            "length": "36304247",
            "sourceUrl": "https://audioboom.com/posts/2115717.mp3?modified=1579437178&source=rss&stitched=1"
        },
        {
            "title": "Barclays Premier League Podcast, Episode 36",
            "datePublished": "Tue, 22 Apr 2014 17:34:38 +0000",
            "description": "West Ham United's Mark Noble reveals which England star helped turn him into a fully-fledged professional as he talks about playing for the club he supported as a child. David Moyes' departure from Old Trafford is discussed by journalist Paddy Barclay as he joins Marcus Buckland and former Everton and Chelsea midfielder Graham Stuart. We hear from Brendan Rodgers, Jose Mourinho and Aaron Ramsey and a life-long Crystal Palace fan joins us to marvel at the Tony Pulis Effect. #mufc #whufc",
            "length": "37437332",
            "sourceUrl": "https://audioboom.com/posts/2095456.mp3?modified=1579455501&source=rss&stitched=1"
        },
        {
            "title": "Barclays Premier League Podcast, Episode 35",
            "datePublished": "Tue, 15 Apr 2014 18:10:05 +0000",
            "description": "Fulham captain Brede Hangeland joins Jacqui Oatley and former Liverpool and Tottenham Hotspur defender John Scales to discuss Felix Magath's impact on the club after their crucial win over Norwich City. We hear from Steven Gerrard and Brendan Rodgers as they react to an emotional victory at Anfield against title rivals Manchester City. Former Spurs skipper Gary Mabbutt explains the pressures of leading a top-flight side in the Barclays Premier League. Plus we hear from John Terry, Christian Eriksen and many more. #bpl #epl #fulham #ffc",
            "length": "32456818",
            "sourceUrl": "https://audioboom.com/posts/2078593.mp3?modified=1575074891&source=rss&stitched=1"
        },
        {
            "title": "Barclays Premier League Podcast, Episode 34",
            "datePublished": "Tue, 08 Apr 2014 17:36:37 +0000",
            "description": "Everton’s most successful captain Kevin Ratcliffe joins Dave Farrar and Efan Ekoku to discuss the Toffees' incredible result against Arsenal. West Bromwich Albion defender Gareth McAuley talks exclusively about the Baggies' battle against relegation and Swansea boss Garry Monk tells us about his managerial influences. Plus we hear from Brendan Rodgers, Kieran Richardson and Ole Gunnar Solskjaer.",
            "length": "35486974",
            "sourceUrl": "https://audioboom.com/posts/2058190.mp3?modified=1579473614&source=rss&stitched=1"
        },
        {
            "title": "Barclays Premier League Podcast, Episode 33",
            "datePublished": "Tue, 01 Apr 2014 17:46:16 +0000",
            "description": "“You must take each day as if it could be your last.”\r\nManchester United reserve team coach Nicky Butt explains how his experiences at Old Trafford are helping to develop young talent at the club, plus Liverpool legend Mark Lawrenson joins Jacqui Oatley and former Arsenal and West Ham midfielder Stewart Robson to reflect on an incredible Barclays Premier League weekend where the Reds moved to the top of the table. \r\nJose Mourinho says Chelsea can no longer win the title and former Blues star Marcel Desailly tells us who he thinks will be crowned Champions in May, plus we hear from Ole Gunnar Solskjaer, Peter Odemwingie and Rickie Lambert.\r\n#manutd #bpl #nickybutt #chelseafc #arsenal #cardiffcity",
            "length": "31446089",
            "sourceUrl": "https://audioboom.com/posts/2037661.mp3?modified=1579480905&source=rss&stitched=1"
        },
        {
            "title": "Barclays Premier League Podcast, Episode 32",
            "datePublished": "Wed, 26 Mar 2014 00:10:09 +0000",
            "description": "Norwich City manager Chris Hughton joins Marcus Buckland and Matt Holland after an extraordinary weekend of goals in the Barclays Premier League, and tells us why Alex Tettey’s wonder strike was better than Wayne Rooney's. Hull City's Liam Rosenior reflects on scoring his first goal for the club, and Tottenham Hotspur legend Glenn Hoddle explains how a Spurs fan saved the day in Jerusalem. Plus we hear from Jose Mourinho, Brendan Rodgers and Yaya Toure on the most exciting title race in years.",
            "length": "33501213",
            "sourceUrl": "https://audioboom.com/posts/2019781.mp3?modified=1579489179&source=rss&stitched=1"
        },
        {
            "title": "Barclays Premier League Podcast, Episode 31",
            "datePublished": "Tue, 18 Mar 2014 21:55:36 +0000",
            "description": "Raheem Sterling exclusively speaks about Liverpool’s title hopes to former Everton and Norwich City defender Matt Jackson and Dave Farrar on this week's show. Former World Championship boxer Richie Woodhall tells us all about his efforts to keep West Bromwich Albion fighting fit. Everton manager Roberto Martinez talks about how he has adapted to life at Goodison Park, plus we hear from Fabian Delph, Manuel Pellegrini, Rickie Lambert and many more.",
            "length": "32257091",
            "sourceUrl": "https://audioboom.com/posts/2001773.mp3?modified=1579496632&source=rss&stitched=1"
        },
        {
            "title": "Barclays Premier League Podcast, Episode 30",
            "datePublished": "Tue, 11 Mar 2014 18:10:34 +0000",
            "description": "Chelsea legend Gianfranco Zola discusses the club’s title aspirations with Marcus Buckland and Paul Walsh on this week’s podcast. \r\nEverton manager Roberto Martinez speaks exclusively about four of his star players and Cardiff City defender Declan John tells us all about their fight to stay in the Barclays Premier League. \r\nWe also hear from Adam Lallana, David Moyes, Tim Sherwood and from a community football legend about his work with disadvantaged youngsters in Birmingham.\r\n#saintsfc #ccfc #cfc #chelseafc #efc #everton #chelseafc #zola #cardiffcity",
            "length": "31639496",
            "sourceUrl": "https://audioboom.com/posts/1983628.mp3?modified=1579503869&source=rss&stitched=1"
        },
        {
            "title": "Barclays Premier League Podcast, Episode 29",
            "datePublished": "Tue, 04 Mar 2014 17:26:54 +0000",
            "description": "Ed Chamberlin makes his Podcast debut alongside former West Ham United, Southampton and Crystal Palace striker Iain Dowie, and together they look back at a dramatic weekend in the Barclays Premier League where Chelsea moved four points clear at the top. Stoke City chairman Peter Coates joins us exclusively to explain how his side managed yet another win over Arsenal at the Britannia Stadium, while Aston Villa legend Ian Taylor discusses a wonder goal for Christian Benteke against Norwich City. Also on the show, John Barnes boards the Barclays Bus as Liverpool have a day to remember at Southampton, plus we speak to the blind West Bromwich Albion fan who ran seven marathons in seven days in seven different continents.",
            "length": "32757590",
            "sourceUrl": "https://audioboom.com/posts/1965923.mp3?modified=1579511737&source=rss&stitched=1"
        },
        {
            "title": "Barclays Premier League Podcast, Episode 28",
            "datePublished": "Tue, 25 Feb 2014 18:17:00 +0000",
            "description": "Former Chelsea and Aston Villa striker Tony Cascarino joins Jacqui Oatley to review another important weekend of action in the Barclays Premier League. Dean Ashton speaks exclusively about his former club Norwich City's crucial win against Tottenham Hotspur and hails manager Chris Hughton. We hear from Tomas Rosicky of Arsenal and Wayne Rooney after he signed an extension to his contract at Manchester United. Plus, we find out how Liverpool goalkeeper Simon Mignolet has been paying homage to a stalwart of the Anfield community.",
            "length": "30637085",
            "sourceUrl": "https://audioboom.com/posts/1948692.mp3?modified=1579519606&source=rss&stitched=1"
        },
        {
            "title": "Barclays Premier League Podcast, Episode 27",
            "datePublished": "Tue, 18 Feb 2014 21:06:40 +0000",
            "description": "Lou Macari joins Dave Farrar, former West Ham United midfielder Matt Holland and journalist Jonathan Northcroft to debate Manchester United's chances of climbing the Barclays Premier League table. With only 12 matches to go, it is building up to be an historic season and we ask if Liverpool can become the unlikely title winners. We speak to former Stoke City defender Danny Higginbotham about the tension at the bottom of the table and he reveals the man who could lead any team to safety. Plus we hear from the first German ever to manage in the top flight and Swansea City's club chaplain gives us a different take on their season.\n#cpfc #bpl #epl #mufc #scfc",
            "length": "28560415",
            "sourceUrl": "https://audioboom.com/posts/1931728.mp3?modified=1579527597&source=rss&stitched=1"
        },
        {
            "title": "Barclays Premier League Podcast, Episode 26",
            "datePublished": "Thu, 13 Feb 2014 18:39:23 +0000",
            "description": "Southampton defender Jose Fonte joins Jacqui Oatley and former Arsenal midfielder Stewart Robson to talk exclusively about life at St. Mary's. Don Hutchison speaks to us about his former club West Ham United's recent upturn in fortune following three wins on the bounce. We speak to a delighted Liverpool fan from Sweden about their top four and even title chances. Ray Parlour boards the Barclays Bus with Arsenal fans on their way to Anfield. Plus we hear from new Swansea City head coach boss Garry Monk, West Ham United's Sam Allardyce and Liverpool's Brendan Rodgers.",
            "length": "31463491",
            "sourceUrl": "https://audioboom.com/posts/1920500.mp3?modified=1579530501&source=rss&stitched=1"
        },
        {
            "title": "Barclays Premier League Podcast, Episode 25",
            "datePublished": "Tue, 04 Feb 2014 17:55:41 +0000",
            "description": "Charlie Adam joins Dave Farrar and former Norwich City striker Efan Ekoku to speak exclusively about his double strike for Stoke City creating history against Manchester United. We find out exactly how Jose Mourinho masterminded victory for his Chelsea side at Manchester City on Monday night to change the dynamic of the title race, and Sunderland legend Marco Gabbiadini discusses another 3-0 win for the Black Cats at their great rivals Newcastle United. Plus we talk to former Liverpool winger John Barnes and Southampton’s young star James Ward-Prowse. #scfc #cfc #sfc #safc",
            "length": "32222495",
            "sourceUrl": "https://audioboom.com/posts/1897686.mp3?modified=1579544039&source=rss&stitched=1"
        },
        {
            "title": "Barclays Premier League Podcast, Episode 24",
            "datePublished": "Tue, 28 Jan 2014 18:41:23 +0000",
            "description": "Graham Stuart and Paddy Barclay join Marcus Buckland to discuss the end of a busy January transfer window. Manchester United smashed their club record to sign Juan Mata from Chelsea and we hear from the Spaniard as well as from David Moyes and former United striker Dwight Yorke. We discuss all the other transfer news and hear from a delighted Everton manager Roberto Martinez after Leighton Baines signed a new four-year contract at the club. We get the lowdown on Spurs manager Tim Sherwood from his former team-mate and title winner at Blackburn, Stuart Ripley. Along with Graham and Paddy, Everton legend, Graeme Sharp, gives us his nominations for the Barclays Merit Awards. Plus we hear from a 83-year-old zip-wiring Southampton super fan!",
            "length": "32136627",
            "sourceUrl": "https://audioboom.com/posts/1883020.mp3?modified=1579552864&source=rss&stitched=1"
        },
        {
            "title": "Barclays Premier League Podcast, Episode 23",
            "datePublished": "Tue, 21 Jan 2014 17:19:46 +0000",
            "description": "Norwich City captain Russell Martin tells Jacqui Oatley and former Everton defender Matt Jackson how that late win against Hull City has helped ease the pressure on manager Chris Hughton. We investigate what Chelsea's win over Manchester United means for the title ambitions of both clubs and former Blues winger Pat Nevin drops in to explain why the Jose Mourinho factor can bring glory back to the Bridge. Jacqui also examines what makes women want to take up refereeing at all levels of the game and we hear from Pablo Zabaleta, Tim  Sherwood, and new West Bromwich Albion head coach Pepe Mel.\r\n#mufc #cfc #ncfc# #wbafc",
            "length": "31297345",
            "sourceUrl": "https://audioboom.com/posts/1867317.mp3?modified=1579554072&source=rss&stitched=1"
        },
        {
            "title": "Barclays Premier League Podcast, Episode 22",
            "datePublished": "Tue, 14 Jan 2014 17:49:22 +0000",
            "description": "Former Liverpool midfielder Jason McAteer joins Marcus Buckland and Iain Dowie to tell us why the Reds are the real deal this season, and which of Brendan Rodgers' stars has caught his eye in the past few matches. A Sunderland fan who has been on the terraces for nearly 60 years discusses a new lease of life for the Mackems under head coach Gus Poyet as they move off the foot of the table. We also hear from West Ham United's Andy Carroll after his return from injury, captain Vincent Kompany on another win for free-scoring Manchester City, and Gunners midfielder Jack Wilshere on Arsenal clinging on to top spot, plus we pay tribute to the Barclays Premier League's deadliest ever sub.\r\n#lfc #whu #mcfc",
            "length": "31776346",
            "sourceUrl": "https://audioboom.com/posts/1852029.mp3?modified=1579562567&source=rss&stitched=1"
        },
        {
            "title": "Barclays Premier League Podcast, Episode 21",
            "datePublished": "Tue, 07 Jan 2014 18:30:30 +0000",
            "description": "Cardiff City captain Steven Caulker joins Dave Farrar, former Liverpool and Spurs defender John Scales and journalist Andy Dunn to discuss Ole Gunnar Solskjaer taking charge of the Bluebirds and the impact the “king of subs” has had on the club. With the January transfer window open, Crystal Palace chairman Steve Parish is asked how difficult it is to bring in new talent. West Bromwich Albion defender Jonas Olsson explains how things are looking up at The Hawthorns under a new regime. We also cover Theo Walcott’s shock injury, Tim Sherwood’s start to life at Spurs, and David Moyes needing to get back to winning ways at Old Trafford. #bpl #cpfc #afc #ccfc #cardiffcityfc #wbafc #bluebirds #solskjaer ",
            "length": "31300766",
            "sourceUrl": "https://audioboom.com/posts/1836629.mp3?modified=1579570699&source=rss&stitched=1"
        },
        {
            "title": "Barclays Premier League Podcast, Episode 20",
            "datePublished": "Thu, 02 Jan 2014 17:28:04 +0000",
            "description": "Manchester City legend Peter Reid and Hull City goalkeeper Steve Harper join Marcus Buckland and Stewart Robson to look back at a busy festive period in the Barclays Premier League. Arsenal lead the way but Reid tells us why Joe Hart has helped to make City the team to beat, while Harper gives credit to the fans who have been braving the elements. \r\nWe hear from the new Cardiff City manager Ole Gunnar Solskjaer on his ambitions in South Wales, as well as the unbeaten Tim Sherwood after Tottenham Hotspur’s shock win at Old Trafford. Plus we speak to a Crystal Palace fan about the battle at the bottom end of the table.",
            "length": "34709310",
            "sourceUrl": "https://audioboom.com/posts/1827721.mp3?modified=1579574662&source=rss&stitched=1"
        },
        {
            "title": "Official Barclays Premier League Podcast – Episode 19",
            "datePublished": "Tue, 17 Dec 2013 18:02:26 +0000",
            "description": "Chelsea and England midfielder Frank Lampard joins Marcus Buckland and Alan Curbishley to discuss his incredible career, Mourinho’s return to the Bridge, and the responsibilities of a being a professional footballer. We discuss Steve Clarke and Andre Villas Boas’ surprise dismissals and review another unpredictable weekend of action including Manchester City’s emphatic 6 -3 win over  leaders Arsenal and Liverpool’s 5-0 demolition of Spurs at White Hart Lane. Alan Shearer surprises an unsuspecting Newcastle fan and we hear from Tom Cleverley, Gareth Barry, Jay Rodriguez and many more. #cfc #lfc #mcfc #thfc #bpl #epl #premierleague #avb #lampard #chelseafc #afc #arsenal #mancity",
            "length": "36822943",
            "sourceUrl": "https://audioboom.com/posts/1803095.mp3?modified=1579587123&source=rss&stitched=1"
        },
        {
            "title": "Official Barclays Premier League Podcast - Episode 18",
            "datePublished": "Tue, 10 Dec 2013 18:24:58 +0000",
            "description": "Newcastle United midfielder Vurnon Anita joins Dave Farrar and Graham Stuart to chat about his side’s historic win over Manchester United at Old Trafford. We also hear from both managers, David Moyes and Alan Pardew. Arsenal manager Arsene Wenger talks to us about having a five-point cushion at the top of the table, while the Liverpool manager Brendan Rodgers pays further tribute to his in-form striker Luis Suarez. We also look back at the rest of the weekend's action and hear from all those involved including Jose Mourinho, Rene Meulensteen and Cameron Jerome. #nufc #mufc #afc #arsenal #bpl  #manutd",
            "length": "33780635",
            "sourceUrl": "https://audioboom.com/posts/1788405.mp3?modified=1579588630&source=rss&stitched=1"
        },
        {
            "title": "Official Barclays Premier League Podcast - Episode 17",
            "datePublished": "Tue, 03 Dec 2013 17:27:49 +0000",
            "description": "Hull City defender Alex Bruce joins Jacqui Oatley and Paul Walsh to reflect on the club's historic win over title-chasing Liverpool, as well as to discuss how he copes with having his dad as the manager. We find out how Sunderland legend Michael Gray got on when he boarded the Barclays Bus with three generations of Mackems. Plus we ask why Arsenal’s Aaron Ramsey was applauded by the Cardiff City fans despite putting them to the sword, pay tribute to the evergreen Barclays Premier League legend Ryan Giggs, and hear from Bryan Oviedo, Samir Nasri and many more. #bpl #epl #hcfc #hullcity #lfc #ccfc #ryangiggs #mufc #afc #sfc",
            "length": "31847133",
            "sourceUrl": "https://audioboom.com/posts/1773511.mp3?modified=1579596994&source=rss&stitched=1"
        },
        {
            "title": "Giggs: 'Anfield was the toughest place to visit'",
            "datePublished": "Thu, 28 Nov 2013 21:08:02 +0000",
            "description": "Ryan Giggs turns 40 on 29 November and, to celebrate the milestone, here is the Manchester United legend answering questions from fans on Twitter for premierleague.com last year.\r\n#ryangiggs #giggs #mufc #manutd #classof92",
            "length": "2874094",
            "sourceUrl": "https://audioboom.com/posts/1764326.mp3?modified=1579600779&source=rss&stitched=1"
        },
        {
            "title": "Official Barclays Premier League Podcast - Episode 16",
            "datePublished": "Tue, 26 Nov 2013 18:43:44 +0000",
            "description": "Former Everton defender David Weir joins Dave Farrar and Matt Holland to look back on another weekend of unpredictability, sublime finishes and last minute goals – and that was just the Merseyside derby! We hear from both Roberto Martinez and Brendan Rodgers after that dramatic 3-3 draw at Goodison Park. Crystal Palace legend Mark Bright discusses Tony Pulis' arrival at the club. We hear from Frazier Campbell, Malkay Mackay and David Moyes after Cardiff City leave it late to draw 2-2 with champions Manchester United. We speak to a Manchester City fan about their 6-0 thumping of Spurs and the bizarre tattoo he got for charity. Plus we review the rest of the weekend's action and hear from Jose Mourinho, Charlie Adam and an in form Loic Remy.\r\n#bpl #everton #liverpool #lfc #efc #cpfc",
            "length": "30434816",
            "sourceUrl": "https://audioboom.com/posts/1759334.mp3?modified=1579606461&source=rss&stitched=1"
        },
        {
            "title": "Official Barclays Premier League Podcast - Episode 15",
            "datePublished": "Tue, 26 Nov 2013 18:36:13 +0000",
            "description": "Norwich City legend Bryan Gunn joins Iain Dowie, journalist Neil Ashton and Marcus Buckland to discuss how the Barclays Premier League is shaping up with just over a quarter of the season gone. The title race is wide open - with only six points separating the top eight - and we discuss all the contenders. We speak to Spanish football expert Graham Hunter about how Mauricio Pochettino has managed to inspire Southampton into the top four. We hear from Arsenal manager Arsene Wenger, Manchester United manager David Moyes and Manchester City boss Manuel Pellegrini on their teams' title chances. Plus we look ahead to one of football’s greatest derbies - Everton v Liverpool - which takes place at Goodison Park this weekend.\r\n#bpl #ncfc #sfc #afc #efc #mufc #mcfc #lfc",
            "length": "29911374",
            "sourceUrl": "https://audioboom.com/posts/1759301.mp3?modified=1579606450&source=rss&stitched=1"
        },
        {
            "title": "Official Barclays Premier League Podcast – Episode 14",
            "datePublished": "Tue, 12 Nov 2013 18:12:02 +0000",
            "description": "Aston Villa defender Leandro Bacuna tells us the secret to his free-kick success and West Brom’s Steven Reid joins us after their dramatic late draw at Chelsea. Presenter Jacqui Oatley is also joined by former Arsenal and West Ham midfielder Stewart Robson to review the rest of the weekend’s action including Manchester United’s 1-0 victory over leaders Arsenal at Old Trafford. John Beresford helps explain Newcastle’s recent resurgence after their 1-0 victory at Spurs. We hear from Sunderland’s match winner Phil Bardsley and Manchester City manager Manuel Pellegrini after the Black Cats saw off City 1-0 at the Stadium of Light. Plus we hear from Chris Hughton, Wayne Rooney, Morgen Schneiderlin and many more. #avfc #wbafc #cfc #bpl #arsenal #afc #mufc #mcfc #safc #nufc #ncfc",
            "length": "30562330",
            "sourceUrl": "https://audioboom.com/posts/1724121.mp3?modified=1579621809&source=rss&stitched=1"
        },
        {
            "title": "Official Barclays Premier League Podcast – Episode 13",
            "datePublished": "Tue, 05 Nov 2013 18:26:39 +0000",
            "description": "Stoke City goalkeeper Asmir Begovic is our special guest as we discuss his incredible goal at the weekend after only 13 seconds! Dean Saunders also joins us to discuss the first ever South Wales derby with Cardiff City edging out Swansea City 1-0. Presenter Dave Farrar is also joined by Paul Walsh to look back on the rest of the weekend’s action, including Manchester City's 7-0 thumping of Norwich City, Manchester United’s 3-1 victory at Fulham and an impressive 2-0 victory for League leaders Arsenal over in form Liverpool. We hear from Arsene Wenger, Brendan Rodgers, Jose Mourinho as well as the under pressure Chris Hughton and Martin Jol. Plus we talk to a member of the Arsenal Supporters Club in Egypt about the optimism surrounding the League leaders in Cairo.",
            "length": "30493566",
            "sourceUrl": "https://audioboom.com/posts/1707925.mp3?modified=1579622764&source=rss&stitched=1"
        },
        {
            "title": "Official Barclays Premier League Podcast – Episode 12",
            "datePublished": "Wed, 30 Oct 2013 10:00:54 +0000",
            "description": "Liverpool's Brazilian midfielder Lucas Leiva is the special guest as we discuss the club's flying start to the season, Luis Suarez’s hat-trick against West Bromwich Albion, and his own role in this strong Liverpool side. Presenter Marcus Buckland is also joined by Iain Dowie to review a dramatic weekend in the English top flight, where Chelsea's Fernando Torres was the leading man against Manchester City, David Moyes did things the Fergie way at Old Trafford, and Gus Poyet won his first game in charge of Sunderland. Plus we speak to Manchester United legend Peter Schmeichel about how overseas fans go mad for the Barclays Premier League.",
            "length": "35485434",
            "sourceUrl": "https://audioboom.com/posts/1694268.mp3?modified=1579632329&source=rss&stitched=1"
        },
        {
            "title": "Official Barclays Premier League Podcast – Episode 11",
            "datePublished": "Wed, 23 Oct 2013 11:30:19 +0000",
            "description": "Fulham midfielder, Steve Sidwell, and Southampton legend, Matt Le Tissier, join Jacqui Oatley and Matt Jackson to look back on an enthralling weekend of action which treated us to some great goals – from Jack Wilshere’s superb team effort against Norwich to Pajtim Kasami’s bit of individual brilliance at Selhurst Park. Martin Keown shares his thoughts about Arsenal’s title hopes. We hear from Andros Townsend as he continued his superb recent form as well as from Steven Gerrard who became the latest member of the 100 club. Plus we talk to the Newcastle Super Scout who discovered Gazza….",
            "length": "31270212",
            "sourceUrl": "https://audioboom.com/posts/1679920.mp3?modified=1579634150&source=rss&stitched=1"
        },
        {
            "title": "Barclays Premier League Podcast, 2013/14, Episode 10",
            "datePublished": "Tue, 15 Oct 2013 17:29:33 +0000",
            "description": "Everton manager Roberto Martinez joins Alan Curbishley, journalist Jason Burt and Dave Farrar in a managers special this week. Martinez speaks exclusively about his start to life at Goodison Park, his hopes for the future and his excitement at the talent of Ross Barkley. Newcastle United defender Mike Williamson tells us why Alan Pardew is the right man for the Magpies and previews their match this weekend against Liverpool.  Southampton Under-18 coach Jason Dodd explains the secret to their success in producing world-class players. And we discuss the managerial changes at the top and bottom of the table, ask which managers are getting it right and hear from David Moyes, Arsene Wenger, Jose Mourinho and the newest recruit to the Barclays Premier League, Gus Poyet.\r\n#efc #bpl #afc #wenger #safc #mufc #saintsfc",
            "length": "41400083",
            "sourceUrl": "https://audioboom.com/posts/1662959.mp3?modified=1579642073&source=rss&stitched=1"
        },
        {
            "title": "Barclays Premier League Podcast, 2013/14, Episode 9",
            "datePublished": "Tue, 08 Oct 2013 17:48:22 +0000",
            "description": "Marcus Buckland is joined by the former Chelsea and Everton midfielder, Graham Stuart, to reflect on a weekend where the Barclays Premier League’s young stars shone, with Manchester United’s Adnan Januzaj, West Ham’s Ravel Morrison and Arsenal’s Jack Wilshere all getting their names on the scoresheet. West Ham United legend Julian Dicks joins to discuss the Hammers’ 3-0 win over Tottenham Hotspur at White Hart Lane. We speak exclusively to Fulham goalkeeper David Stockdale after their last-gasp victory over Stoke City. We hear from Gus Poyet after he was appointed Sunderland’s new manager and also hear from Joleon Lescott, Daniel Sturridge and Adam Lallana. Plus we talk to a life-long Crystal Palace fan about an away day to remember at Anfield on Saturday. #safc #ffc#afc #wilshere #whufc #westham #ravelmorrison #thfc #poyet #lfc #bpl #premierleague #barclayspremierleague #cpfc",
            "length": "31885568",
            "sourceUrl": "https://audioboom.com/posts/1648551.mp3?modified=1579651202&source=rss&stitched=1"
        },
        {
            "title": "Barclays Premier League Podcast, 2013/14, Episode 8",
            "datePublished": "Tue, 01 Oct 2013 16:47:52 +0000",
            "description": "Dave Farrar is joined by former Charlton Athletic and Republic of Ireland midfielder Matt Holland to look back on another unpredictable weekend of top-flight action including shock wins for West Brom and Aston Villa over two of the title favourites. West Brom goalkeeping coach, Dean Kiely, joins the podcast to discuss their historic win at Old Trafford and former Manchester City manager Brian Horton analyses the Citizens’ worrying away form. Daniel Sturridge and Brendan Rodgers discuss the goalscoring return of Luis Suarez. Roberto Martinez hails Everton’s new striking sensation, Romelu Lukaku. We hear from Vincent Kompany, Rickie Lambert and Jordan Mutch. Plus we talk to a Southampton season ticket holder about their European ambitions. #mcfc #bpl #lfc #wbafc #mufc #premierleague #ccfc #saintsfc",
            "length": "31426583",
            "sourceUrl": "https://audioboom.com/posts/1633523.mp3?modified=1579659823&source=rss&stitched=1"
        },
        {
            "title": "Barclays Premier League Podcast, 2013/14, Episode 7",
            "datePublished": "Tue, 24 Sep 2013 16:57:45 +0000",
            "description": "Dave Farrar is joined by former Arsenal and West Ham United midfielder Stewart Robson to look back on all the weekend’s Barclays Premier League drama including a one-sided Manchester derby, a Leighton Baines-inspired win for Everton against West Ham and a first top-flight goal for John Obi Mikel.  Former Sunderland midfielder, Kevin Kilbane, discusses Paolo Di Canio’s departure from Sunderland. We speak exclusively to Aston Villa’s assistant manager Ian Culverhouse, as he and Paul Lambert continue to mastermind the club’s revival. And we hear from Michael Laudrup, Jose Mourinho and Dejan Lovren after his shock winner for Southampton at Anfield. #bpl #avfc #mikel #lfc #saintsfc #safc #paolodicanio #perfectpunter #culverhouse #efc #whufc #mcfc #mufc #swanseacity",
            "length": "29499256",
            "sourceUrl": "https://audioboom.com/posts/1619286.mp3?modified=1579661592&source=rss&stitched=1"
        },
        {
            "title": "Barclays Premier League Podcast 2013-14, Episode 6",
            "datePublished": "Tue, 17 Sep 2013 17:28:24 +0000",
            "description": "Marcus Buckland and former Everton and Norwich City defender Matt Jackson review the weekend’s action in the Barclays Premier League, including an emotional night for Swansea City midfielder Jonjo Shelvey against his former club Liverpool on Monday night. John Hartson joins us to discuss a dramatic evening at the Liberty Stadium.\r\nAlso we discuss maiden home wins for Manchester United’s David Moyes and Everton’s Roberto Martinez and we speak exclusively to Cardiff City manager Malkay Mackay about their start to life in the top flight. Plus we hear from Christian Eriksen, Gareth Barry and Hatem Ben Arfa.\r\n#thfc #ccfc #mufc #bpl #swans #lfc #liverpoolfc #shelvey #premierleague #christianeriksen #nufc",
            "length": "30829901",
            "sourceUrl": "https://audioboom.com/posts/1606350.mp3?modified=1579671292&source=rss&stitched=1"
        },
        {
            "title": "Barclays Premier League Podcast 2013/14, Episode 5",
            "datePublished": "Tue, 10 Sep 2013 17:35:29 +0000",
            "description": "Jacqui Oatley is joined by former Liverpool and Spurs defender John Scales and football journalist Paddy Barclay, to look at how the Barclays Premier League is shaping up with Liverpool leading the way after three matches. Crystal Palace defender Dean Moxey talks ahead of his team’s trip to Old Trafford this Saturday. Swansea City chairman Huw Jenkins explains how his players had to be brought back down to earth after last season’s heroics. We hear from Marouane Fellaini on his dream move to Manchester United, Theo Walcott on Mesut Ozil, Arsenal’s record-breaking signing, and Roberto Martinez on Everton’s successful transfer business. And we speak exclusively to former Aston Villa and Celtic midfielder Stiliyan Petrov about his fight against leukaemia. #Arsenal #AFC #Ozil #cpfc #petrov #mufc #efc #theowalcott #bpl #manutd #liverpoolfc #lfc #fellaini #swanseacity ",
            "length": "33966285",
            "sourceUrl": "https://audioboom.com/posts/1593104.mp3?modified=1579673241&source=rss&stitched=1"
        },
        {
            "title": "Barclays Premier League Podcast 2013/14, Episode 4",
            "datePublished": "Tue, 03 Sep 2013 16:45:04 +0000",
            "description": "Dave Farrar and Alan Curbishley discuss a frenetic final day of transfer activity in which Gareth Bale left North London to become the world’s most expensive player and Mesut Ozil came the other way as he joined Arsenal in a club-record deal. European football expert Gabriele Marcotti talks us through all the other last-minute comings and goings in the transfer window. We speak to former Liverpool manager Roy Evans as the Reds honoured the great Bill Shankly by beating their arch-rivals Manchester United at Anfield. We talk to West Brom defender Steven Reid about their difficult start to the season and working with Nicolas Anelka. And we look back at all of the rest of the weekend’s action, hearing from Olivier Giroud, Ian Holloway, Paolo Di Canio and many more....\r\n#bpl #arsenal #lfc #afc# #mesutozil @marcotti @perfectpunter #safc #cpfc #deadlineday #mufc",
            "length": "31828349",
            "sourceUrl": "https://audioboom.com/posts/1580713.mp3?modified=1579682926&source=rss&stitched=1"
        },
        {
            "title": "Barclays Premier League Podcast 2013/14, Episode 1",
            "datePublished": "Wed, 28 Aug 2013 16:03:18 +0000",
            "description": "In this special Preview of the 2013/14 Barclays Premier League season, Dave Farrar is joined by two special guests, former Arsenal and West Ham midfielder, Stewart Robson, and ex Norwich and Nigeria striker, Efan Ekoku. It’s the first time in living memory that England's top three clubs begin their campaigns with a new manager – we hear from the three new men in charge – David Moyes at Manchester United, Manuel Pellegrini at Manchester City and a returning Jose Mourinho at Chelsea. Cardiff City’s Ben Turner and Hull City’s James Chester both join us to discuss their clubs’ return to the top flight. European football expert Andy Brassall talks us through all the major transfer news in what’s been a summer of speculation. And we hear from Arsene Wenger, Roberto Martinez, Mark Hughes and Ryan Giggs among others.",
            "length": "38720442",
            "sourceUrl": "https://audioboom.com/posts/1570716.mp3?modified=1579686261&source=rss&stitched=1"
        },
        {
            "title": "Barclays Premier League Podcast 2013/14, Episode 2",
            "datePublished": "Wed, 28 Aug 2013 15:53:02 +0000",
            "description": "Marcus Buckland is joined by former Republic of Ireland midfielder Matt Holland to look back on a compelling opening weekend of the season. We speak to former Chelsea midfielder Pat Nevin about the Jose Mourinho effect at Stamford Bridge. We hear from the two new managers in Manchester, David Moyes and Manuel Pellegrini, who both got off to winning starts. Young Southampton starlet James Ward-Prowse joins us after their 1-0 opening day win at West Brom. And we speak to a Crystal Palace season ticket holder about the buoyant atmosphere at Selhurst Park on Sunday.",
            "length": "30092482",
            "sourceUrl": "https://audioboom.com/posts/1570709.mp3?modified=1579686256&source=rss&stitched=1"
        },
        {
            "title": "Barclays Premier League Podcast 2013/14, Episode 3",
            "datePublished": "Tue, 27 Aug 2013 21:11:41 +0000",
            "description": "Jacqui Oatley is joined by former Manchester City, Liverpool and Spurs striker Paul Walsh to reflect on a weekend where Manchester United and Chelsea had to share the spoils at Old Trafford and Cardiff City shocked one of the title favourites. \r\nWe hear from David Moyes, Jose Mourinho, Malkay Mackay and Craig Bellamy. We speak exclusively to Stoke City goalkeeper Asmir Begovic about his future at the club. Former Arsenal defender Nigel Winterburn explains why Arsene Wenger must strengthen his squad. Plus we hear from a life-long Everton fan about a Merseyside legend. #AFC #BPL #SCFC #arsenal #stokecity #cardiffcity #carmci #mcfc #mufc #cfc",
            "length": "26144141",
            "sourceUrl": "https://audioboom.com/posts/1569404.mp3?modified=1579685759&source=rss&stitched=1"
        }
    ]
}