{
    "artwork": "http://is1.mzstatic.com/image/thumb/Music62/v4/c9/2a/ff/c92aff94-4eff-bc0f-96e9-0c12310602f9/source/100x100bb.jpg",
    "description": "William D. Parker from the Principal Matters Blog reveals his school leadership strategies, insights from other leaders, and practical tips so that you can have the tools to achieve your own goals. Rediscover healthy motivation, resolve conflicts and challenges, maximize your communication, grow your instructional abilities, and learn to streamline responsibilities—all while creating raving fans among your team members, students, parents, and patrons. William is currently Principal of Skiatook High School near Tulsa, Oklahoma. As a former teacher of the year, the 2012 Oklahoma Assistant Principal of the Year, and author of the recently released book, Principal Matters, he is also a blogger, musician, and speaker. He and his wife Missy are the proud parents of four children: 3 girls and 1 boy. When he is not serving his school and family, he is a sought-after keynote speaker for principal conferences and leadership seminars.  He has learned to leverage his lessons through Facebook, Twitter, YouTube, Podcasting, eBooks, self-publishing, seminars, and online newsletters.  Listen in for motivation to create incredible momentum in your school community.",
    "feedURL": "http://173.254.20.84/feed/podcast/",
    "podcastURL": "https://www.williamdparker.com",
    "title": "Principal Matters: The School Leader's Podcast with William D. Parker",
    "episodes": [
        {
            "title": "PMP219: Pause. Breathe. Flourish. Part 2 with Jen Schwanke",
            "datePublished": "Wed, 11 Nov 2020 13:56:15 +0000",
            "description": "<p>This week Jen Schwanke continues asking me questions about my new book Pause. Breathe. Flourish. Living Your Best Life as an Educator. Jen Schwanke is the principal of Indian Run Elementary and author of two books, You’re The Principal, Now What? and The Principal Re-Boot: 8 Ways to Revitalize Your School Leadership. In Part 2 of our conversation, […]</p>\n<p>The post <a href=\"https://williamdparker.com/2020/11/11/pmp219-pause-breathe-flourish-part-2-with-jen-schwanke/\" target=\"_blank\">PMP219: Pause. Breathe. Flourish. Part 2 with Jen Schwanke</a> first appeared on <a href=\"https://williamdparker.com/\" target=\"_blank\">Principal Matters</a>.</p>",
            "length": "44666207",
            "sourceUrl": "https://traffic.libsyn.com/secure/principalmatters/PMP219.mp3",
            "categories": [
                "Education",
                "Podcast",
                "Principal",
                "School",
                "Jen Schwanke",
                "Pause. Breath. Flourish.",
                "positive messaging",
                "the writing process",
                "toxic positivity",
                "William D. Parker"
            ]
        },
        {
            "title": "PMP218: Reflections on Pause. Breathe. Flourish. with Jen Schwanke",
            "datePublished": "Wed, 04 Nov 2020 12:00:00 +0000",
            "description": "<p>When Jen Schwanke and I sat down to talk about my new book this week, Jen turned the microphone to ask me some questions. Jen Schwanke is the principal of Indian Run Elementary and author of two books, You’re The Principal, Now What? and The Principal Re-Boot: 8 Ways to Revitalize Your School Leadership. Here […]</p>\n<p>The post <a href=\"https://williamdparker.com/2020/11/04/pmp218-reflections-on-pause-breathe-flourish-with-jen-schwanke/\" target=\"_blank\">PMP218: Reflections on Pause. Breathe. Flourish. with Jen Schwanke</a> first appeared on <a href=\"https://williamdparker.com/\" target=\"_blank\">Principal Matters</a>.</p>",
            "length": "44234246",
            "sourceUrl": "https://traffic.libsyn.com/secure/principalmatters/PMP218.mp3",
            "categories": [
                "Education",
                "Personal",
                "Podcast",
                "Principal",
                "School",
                "Pause. Breathe. Flourish.",
                "Reflections with Jen Schwanke",
                "self-care",
                "self-reflection",
                "William D. Parker"
            ]
        },
        {
            "title": "PMP217: 57 Years Together, A Tribute to My Parents",
            "datePublished": "Wed, 28 Oct 2020 17:04:34 +0000",
            "description": "<p>This year’s pandemic has made it difficult to see my parents as they live a long distance and are both in a vulnerable age group. Instead of posting about education this week, I want to share some personal reflections here instead. It was Sunday, October 27, 1963, 57 years ago at the time of this […]</p>\n<p>The post <a href=\"https://williamdparker.com/2020/10/28/pmp217-57-years-together-a-tribute-to-my-parents/\" target=\"_blank\">PMP217: 57 Years Together, A Tribute to My Parents</a> first appeared on <a href=\"https://williamdparker.com/\" target=\"_blank\">Principal Matters</a>.</p>",
            "length": "20969802",
            "sourceUrl": "https://traffic.libsyn.com/secure/principalmatters/PMP217.mp3",
            "categories": [
                "Leadership",
                "Personal",
                "Podcast",
                "anniversary tribute",
                "J.D. and Polly Parker",
                "memories of my childhood",
                "podcast",
                "Principal Matters",
                "William D. Parker"
            ]
        },
        {
            "title": "PMP216: A Principal’s Toolbox with Justin Thomas",
            "datePublished": "Wed, 21 Oct 2020 10:30:00 +0000",
            "description": "<p>Although it is so important to understand your “why” in leadership, it is also imperative to understand “how” to effectively do your work. This week’s guest, Dr. Justin Thomas, provides practical feedback from his years as an elementary principal with several takeaways from his new book, A Principal’s Toolbox: Real Talk on Tackling School Leadership […]</p>\n<p>The post <a href=\"https://williamdparker.com/2020/10/21/pmp216-a-principals-toolbox-with-justin-thomas/\" target=\"_blank\">PMP216: A Principal’s Toolbox with Justin Thomas</a> first appeared on <a href=\"https://williamdparker.com/\" target=\"_blank\">Principal Matters</a>.</p>",
            "length": "50053492",
            "sourceUrl": "https://traffic.libsyn.com/secure/principalmatters/PMP216.mp3",
            "categories": [
                "Education",
                "Interviews",
                "Leadership",
                "Podcast",
                "Principal",
                "School",
                "Uncategorized",
                "Justin Thomas",
                "podcast",
                "Principal Matters",
                "William D. Parker"
            ]
        },
        {
            "title": "PMP215: Reflections from Pause. Breathe. Flourish. with Sonia Lopez-Morales",
            "datePublished": "Wed, 14 Oct 2020 11:00:33 +0000",
            "description": "<p>During the summer, several principals from across the nation joined me for a Re-Opening Mastermind to collaborate, explore, brainstorm and support one another during the difficult days of planning for a new school year. As I was wrapping up the final content for my newest book, I shared an advance copy of my new book, […]</p>\n<p>The post <a href=\"https://williamdparker.com/2020/10/14/pmp215-reflections-from-pause-breathe-flourish-with-sonia-lopez-morales/\" target=\"_blank\">PMP215: Reflections from Pause. Breathe. Flourish. with Sonia Lopez-Morales</a> first appeared on <a href=\"https://williamdparker.com/\" target=\"_blank\">Principal Matters</a>.</p>",
            "length": "49220290",
            "sourceUrl": "https://traffic.libsyn.com/secure/principalmatters/PMP215.mp3",
            "categories": [
                "Education",
                "Interviews",
                "Podcast",
                "Principal",
                "School",
                "education",
                "immigrant communities",
                "pandemic",
                "school leadership",
                "Sonia Lopez-Morales"
            ]
        },
        {
            "title": "PMP214: Pause. Breathe. Flourish. Part 2, Review with Dr. Jeff Springer",
            "datePublished": "Wed, 07 Oct 2020 10:00:00 +0000",
            "description": "<p>This week I was interviewed again by Dr. Jeff A. Springer, Ed.D., Educational Leadership Coach – Spring Strategies, LLC, and 2013 TASSP Texas State Principal of the Year, as we explored the final chapters from my new book, Pause. Breathe. Flourish.: Living Your Best Life as an Educator. Listen to the podcast episode for more […]</p>\n<p>The post <a href=\"https://williamdparker.com/2020/10/07/pmp214-pause-breathe-flourish-part-2-review-with-dr-jeff-springer/\" target=\"_blank\">PMP214: Pause. Breathe. Flourish. Part 2, Review with Dr. Jeff Springer</a> first appeared on <a href=\"https://williamdparker.com/\" target=\"_blank\">Principal Matters</a>.</p>",
            "length": "41723356",
            "sourceUrl": "https://traffic.libsyn.com/secure/principalmatters/PMP214.mp3",
            "categories": [
                "Education",
                "Interviews",
                "Leadership",
                "Personal",
                "Podcast",
                "Principal",
                "growth",
                "Jeff Springer",
                "Pause. Breathe. Flourish.",
                "podcast",
                "reflection",
                "relationships",
                "spirituality",
                "William D. Parker"
            ]
        },
        {
            "title": "PMP213: Pause. Breathe. Flourish. A Review with Dr. Jeff Springer",
            "datePublished": "Wed, 30 Sep 2020 11:00:00 +0000",
            "description": "<p>This week I talk with Jeff A. Springer, Ed.D., Educational Leadership Coach from Spring Strategies, LLC, and 2013 TASSP Texas State Principal of the Year. In this episode, Dr. Springer turns the table and interviews me about my new book, Pause. Breathe. Flourish. Living Your Best Life as an Educator. In his endorsement of the […]</p>\n<p>The post <a href=\"https://williamdparker.com/2020/09/30/pmp213-pause-breathe-flourish-a-review-with-dr-jeff-springer/\" target=\"_blank\">PMP213: Pause. Breathe. Flourish. A Review with Dr. Jeff Springer</a> first appeared on <a href=\"https://williamdparker.com/\" target=\"_blank\">Principal Matters</a>.</p>",
            "length": "53612623",
            "sourceUrl": "https://traffic.libsyn.com/secure/principalmatters/PMP213.mp3",
            "categories": [
                "Education",
                "Leadership",
                "Personal",
                "Podcast",
                "education",
                "Jeff Springer",
                "mindfulness",
                "Pause. Breathe. Flourish.",
                "self-growth",
                "William D. Parker"
            ]
        },
        {
            "title": "PMP212: Strategies for Helping Gen Z Students with Dr. Tim Elmore",
            "datePublished": "Wed, 23 Sep 2020 11:00:00 +0000",
            "description": "<p>When this pandemic began, many of us were asking what lessons we may learn from something none of us ever experienced before. Dr. Tim Elmore began asking similar questions to survivors of the Great Depression and other crises experiences. The result? He has just published his latest book, The Pandemic Population: Eight Strategies to Help […]</p>\n<p>The post <a href=\"https://williamdparker.com/2020/09/23/pmp212-strategies-for-helping-gen-z-students-with-dr-tim-elmore/\" target=\"_blank\">PMP212: Strategies for Helping Gen Z Students with Dr. Tim Elmore</a> first appeared on <a href=\"https://williamdparker.com/\" target=\"_blank\">Principal Matters</a>.</p>",
            "length": "30633436",
            "sourceUrl": "https://traffic.libsyn.com/secure/principalmatters/PMP212.mp3",
            "categories": [
                "Education",
                "Leadership",
                "Podcast",
                "School",
                "Dr. Tim Elmore",
                "growing leaders",
                "Pandemic Population",
                "podcast",
                "Principal Matters",
                "William D. Parker"
            ]
        },
        {
            "title": "PMP211: Reflections on Reopening Schools, Part 2, with Jen Schwanke",
            "datePublished": "Thu, 17 Sep 2020 11:00:00 +0000",
            "description": "<p>As you are re-engaging with your school community, what lessons are you learning as you walk through this new journey with your staff, students, parents and community? This week, Jen Schwanke joins me again to share what she’s been learning during re-opening school. Jen is the Principal of Indian Run Elementary in Dublin, Ohio. She’s […]</p>\n<p>The post <a href=\"https://williamdparker.com/2020/09/17/pmp211-reflections-on-reopening-schools-part-2-with-jen-schwanke/\" target=\"_blank\">PMP211: Reflections on Reopening Schools, Part 2, with Jen Schwanke</a> first appeared on <a href=\"https://williamdparker.com/\" target=\"_blank\">Principal Matters</a>.</p>",
            "length": "49148192",
            "sourceUrl": "https://traffic.libsyn.com/secure/principalmatters/PMP211.mp3",
            "categories": [
                "Education",
                "Leadership",
                "Podcast",
                "Principal",
                "School",
                "Jen Schwanke",
                "schools"
            ]
        },
        {
            "title": "PMP210: Re-opening Reflections with Jen Schwanke",
            "datePublished": "Thu, 10 Sep 2020 10:00:00 +0000",
            "description": "<p>This week I reconnected with Principal Jen Schwanke, Principal of Indian Run Elementary, author and education consultant, for reflections on what re-opening has looked like for her school in Dublin, Ohio. Together we explored some lessons she’s already learning that may be helpful for your leadership. Listen to the entire podcast episode for even more […]</p>\n<p>The post <a href=\"https://williamdparker.com/2020/09/10/pmp210-re-opening-reflections-with-jen-schwanke/\" target=\"_blank\">PMP210: Re-opening Reflections with Jen Schwanke</a> first appeared on <a href=\"https://williamdparker.com/\" target=\"_blank\">Principal Matters</a>.</p>",
            "length": "49688613",
            "sourceUrl": "https://traffic.libsyn.com/secure/principalmatters/PMP210.mp3",
            "categories": [
                "Education",
                "Leadership",
                "Personal",
                "Podcast",
                "Principal",
                "School",
                "reopening school"
            ]
        },
        {
            "title": "PMP209: Supporting Students from Immigrant Families in a Pandemic",
            "datePublished": "Thu, 03 Sep 2020 11:00:00 +0000",
            "description": "<p>Last week I talked a high school principal who told me she has already referred more students than normal to therapists and counselors for social emotional supports for this time of year. I imagine you are more aware than ever the anxiety surrounding the start of school for so many families. In addition, you have […]</p>\n<p>The post <a href=\"https://williamdparker.com/2020/09/03/pmp209-supporting-students-from-immigrant-families-in-a-pandemic/\" target=\"_blank\">PMP209: Supporting Students from Immigrant Families in a Pandemic</a> first appeared on <a href=\"https://williamdparker.com/\" target=\"_blank\">Principal Matters</a>.</p>",
            "length": "44612290",
            "sourceUrl": "https://traffic.libsyn.com/secure/principalmatters/PMP209.mp3"
        },
        {
            "title": "PMP208: New School Year Celebrations and Challenges",
            "datePublished": "Thu, 27 Aug 2020 11:00:33 +0000",
            "description": "<p>This is the time of year when the green stalks of corn begin to brown and yellow, and the once moist kernels begin to harden into dry grain. If you’ve ever shucked corn, you may know the difference between the sweet smell of corn-on-the-cob versus the drier, dusty smell of corn harvested in the fall. When […]</p>\n<p>The post <a href=\"https://williamdparker.com/2020/08/27/pmp208-new-school-year-celebrations-and-challenges/\" target=\"_blank\">PMP208: New School Year Celebrations and Challenges</a> first appeared on <a href=\"https://williamdparker.com/\" target=\"_blank\">Principal Matters</a>.</p>",
            "length": "19880182",
            "sourceUrl": "https://traffic.libsyn.com/secure/principalmatters/PMP208.mp3"
        },
        {
            "title": "PMP207: Equity in Education During a Pandemic",
            "datePublished": "Thu, 20 Aug 2020 11:00:27 +0000",
            "description": "<p>Last week I was in a conversation with a principal from South Carolina, a member of a Mastermind for Reopening Schools that I have been leading. Each week more than a dozen principals join me from across the U.S. to discuss the specific scenarios unique to their own school communities while beginning the new semester […]</p>\n<p>The post <a href=\"https://williamdparker.com/2020/08/20/pmp207-equity-in-education-during-a-pandemic/\" target=\"_blank\">PMP207: Equity in Education During a Pandemic</a> first appeared on <a href=\"https://williamdparker.com/\" target=\"_blank\">Principal Matters</a>.</p>",
            "length": "28016593",
            "sourceUrl": "https://traffic.libsyn.com/secure/principalmatters/PMP207.mp3"
        },
        {
            "title": "PMP206: Growing Through a Mastermind with Anthony Fisher",
            "datePublished": "Thu, 13 Aug 2020 22:00:01 +0000",
            "description": "<p>Especially during difficult times, leaders need support from other leaders. Each week this past year, I have been hosting virtual one-hour conversations with select groups of school leaders through Principal Matters Masterminds. Together we have studied books, provided times for self-reflection, and allowed leaders to take turns in “hot-seat” opportunities. The result? I have built […]</p>\n<p>The post <a href=\"https://williamdparker.com/2020/08/13/pmp206-growing-through-a-mastermind-with-anthony-fisher/\" target=\"_blank\">PMP206: Growing Through a Mastermind with Anthony Fisher</a> first appeared on <a href=\"https://williamdparker.com/\" target=\"_blank\">Principal Matters</a>.</p>",
            "length": "37893742",
            "sourceUrl": "https://traffic.libsyn.com/secure/principalmatters/PMP206.mp3"
        },
        {
            "title": "PMP205: Preparing the Start-of-School Year in a Pandemic",
            "datePublished": "Thu, 06 Aug 2020 12:09:37 +0000",
            "description": "<p>Jenny is a returning student at her high school. She has a part-time job which keeps her up late most nights.  When her school opens this fall, she knows remote-learning is the option until her building opens again. She calls the school but gets a busy signal. Then she uses her iPhone to log into […]</p>\n<p>The post <a href=\"https://williamdparker.com/2020/08/06/pmp205-preparing-the-start-of-school-year-in-a-pandemic/\" target=\"_blank\">PMP205: Preparing the Start-of-School Year in a Pandemic</a> first appeared on <a href=\"https://williamdparker.com/\" target=\"_blank\">Principal Matters</a>.</p>",
            "length": "26106875",
            "sourceUrl": "https://traffic.libsyn.com/secure/principalmatters/PMP205.mp3"
        },
        {
            "title": "PMP204: We are all Pioneers and Tweeners this school year!",
            "datePublished": "Thu, 30 Jul 2020 11:00:00 +0000",
            "description": "<p>This week I did my first in-person meeting with a group of fellow-school leaders as they plan for the beginning of a new school year. The team of administrators sat in a room with tables at appropriate distances, and we wore masks. Whenever I wear a mask, my glasses become foggy. So I held my […]</p>\n<p>The post <a href=\"https://williamdparker.com/2020/07/30/pmp204-we-are-all-pioneers-and-tweeners-this-school-year/\" target=\"_blank\">PMP204: We are all Pioneers and Tweeners this school year!</a> first appeared on <a href=\"https://williamdparker.com/\" target=\"_blank\">Principal Matters</a>.</p>",
            "length": "20596501",
            "sourceUrl": "https://traffic.libsyn.com/secure/principalmatters/PMP204.mp3"
        },
        {
            "title": "PMP203: Cultivating PLAY in Leadership with Jeff Springer",
            "datePublished": "Thu, 23 Jul 2020 11:00:00 +0000",
            "description": "<p>One of the biggest challenges for the a new school year is deciding how to mitigate concerns for safety while ensuring ways to still actively engage, support, and reach students. In this week’s podcast episode, Dr. Jeff Springer shares takeaways from his research on the power of P.L.A.Y. in schools and offers suggestions for school […]</p>\n<p>The post <a href=\"https://williamdparker.com/2020/07/23/pmp203-cultivating-play-in-leadership-with-jeff-springer/\" target=\"_blank\">PMP203: Cultivating PLAY in Leadership with Jeff Springer</a> first appeared on <a href=\"https://williamdparker.com/\" target=\"_blank\">Principal Matters</a>.</p>",
            "length": "42030702",
            "sourceUrl": "https://traffic.libsyn.com/secure/principalmatters/PMP203.mp3"
        },
        {
            "title": "PMP202: Transforming School Cultures with Dr. Anthony Muhammad",
            "datePublished": "Thu, 16 Jul 2020 11:00:00 +0000",
            "description": "<p>As you think about your own leadership, I’m curious if you give yourself the kind of scrutiny you may give your own team members? In other words, are you allowing the kind of self-reflection where you first identify your own areas of needed growth before asking others to grow? These are the thoughts and questions […]</p>\n<p>The post <a href=\"https://williamdparker.com/2020/07/16/pmp202-transforming-school-cultures-with-dr-anthony-muhammad/\" target=\"_blank\">PMP202: Transforming School Cultures with Dr. Anthony Muhammad</a> first appeared on <a href=\"https://williamdparker.com/\" target=\"_blank\">Principal Matters</a>.</p>",
            "length": "38166917",
            "sourceUrl": "https://traffic.libsyn.com/secure/principalmatters/PMP202.mp3"
        },
        {
            "title": "PMP201: Rebooting for the Summer with Jen Schwanke",
            "datePublished": "Thu, 09 Jul 2020 11:21:38 +0000",
            "description": "<p>On March 17, 2020, many schools across the U.S. began responding to the global pandemic of COVID-19 with school closures. Most school leaders were scrambling to figure out how to keep school communities safe while adjusting to a new norm. Jen Schwanke, Principal of Indian Run Elementary in Dublin, Ohio, was no exception. While her […]</p>\n<p>The post <a href=\"https://williamdparker.com/2020/07/09/pmp201-rebooting-for-the-summer-with-jen-schwanke/\" target=\"_blank\">PMP201: Rebooting for the Summer with Jen Schwanke</a> first appeared on <a href=\"https://williamdparker.com/\" target=\"_blank\">Principal Matters</a>.</p>",
            "length": "25818065",
            "sourceUrl": "https://traffic.libsyn.com/secure/principalmatters/PMP201.mp3"
        },
        {
            "title": "PMP200: Looking Back at Distance Learning with Jen Schwanke",
            "datePublished": "Thu, 25 Jun 2020 11:00:00 +0000",
            "description": "<p>Now that the dust has settled from distance learning, school leaders are asking: what worked, and what didn’t work? How did you stay connected to people, or what important milestones did you miss? In this week’s podcast episode, Principal Jen Schwanke shares reflections on ways school leaders can look back at lessons during distance or […]</p>\n<p>The post <a href=\"https://williamdparker.com/2020/06/25/pmp200-looking-back-at-distance-learning-with-jen-schwanke/\" target=\"_blank\">PMP200: Looking Back at Distance Learning with Jen Schwanke</a> first appeared on <a href=\"https://williamdparker.com/\" target=\"_blank\">Principal Matters</a>.</p>",
            "length": "41377430",
            "sourceUrl": "https://traffic.libsyn.com/secure/principalmatters/PMP200.mp3"
        },
        {
            "title": "PMP199: Panel Discussion on Equity & Racism, Part 2",
            "datePublished": "Thu, 18 Jun 2020 11:00:00 +0000",
            "description": "<p>Last week, my guests William Stubbs, Marlena Gross-Taylor, and Don Parker shared feedback on their personal and professional reflections around equity, racism, and inequalities. They each gave suggestions to help you decide how to respond in your own school community. In Part 2 of this discussion, they dive even deeper as they share several strategies, […]</p>\n<p>The post <a href=\"https://williamdparker.com/2020/06/18/pmp199-panel-discussion-on-equity-racism-part-2/\" target=\"_blank\">PMP199: Panel Discussion on Equity & Racism, Part 2</a> first appeared on <a href=\"https://williamdparker.com/\" target=\"_blank\">Principal Matters</a>.</p>",
            "length": "40384839",
            "sourceUrl": "https://traffic.libsyn.com/secure/principalmatters/PMP199.mp3"
        },
        {
            "title": "PMP198: Panel Discussion on Equity and Racism, Part 1",
            "datePublished": "Thu, 11 Jun 2020 11:00:00 +0000",
            "description": "<p>No community has been immune to conversations surrounding equity, racism, and inequalities. As Marlena Gross-Taylor, one of the guests on this week’s podcast episode explains, these conversations have been going on for at least four hundred years. It seems this time, however, communities have reached a tipping point – with vast majorities of Americans expressing […]</p>\n<p>The post <a href=\"https://williamdparker.com/2020/06/11/pmp198-panel-discussion-on-equity-and-racism-part-1/\" target=\"_blank\">PMP198: Panel Discussion on Equity and Racism, Part 1</a> first appeared on <a href=\"https://williamdparker.com/\" target=\"_blank\">Principal Matters</a>.</p>",
            "length": "38751394",
            "sourceUrl": "https://traffic.libsyn.com/secure/principalmatters/PMP198.mp3"
        },
        {
            "title": "PMP197: 10 Tips for New Assistant Principals",
            "datePublished": "Thu, 04 Jun 2020 11:00:00 +0000",
            "description": "<p>Starting a new school year is like preparing for a marathon. The journey begins with training long before the race begins. And once the race starts, you need a lot of endurance for the road ahead. School leadership is the same. As you enter summer, the ways you “condition” in the weeks ahead may help […]</p>\n<p>The post <a href=\"https://williamdparker.com/2020/06/04/pmp197-10-tips-for-new-assistant-principals/\" target=\"_blank\">PMP197: 10 Tips for New Assistant Principals</a> first appeared on <a href=\"https://williamdparker.com/\" target=\"_blank\">Principal Matters</a>.</p>",
            "length": "39089105",
            "sourceUrl": "https://traffic.libsyn.com/secure/principalmatters/PMP197.mp3"
        },
        {
            "title": "PMP196: Generation Optimism with Juan David Campolargo",
            "datePublished": "Thu, 28 May 2020 11:00:00 +0000",
            "description": "<p>Even in uncertain times, it is good to remember that positive ideas can come from even the most difficult situations. Juan David Campolargo, a seventeen-year-old high school student from Chicago, is no stranger to difficulty. Immigranting to the U.S. from Venezuela at age 14, he began to learn English for the first time, and over […]</p>\n<p>The post <a href=\"https://williamdparker.com/2020/05/28/pmp196-generation-optimism-with-juan-david-campolargo/\" target=\"_blank\">PMP196: Generation Optimism with Juan David Campolargo</a> first appeared on <a href=\"https://williamdparker.com/\" target=\"_blank\">Principal Matters</a>.</p>",
            "length": "28075045",
            "sourceUrl": "https://traffic.libsyn.com/secure/principalmatters/PMP196.mp3"
        },
        {
            "title": "PMP195: Instruction from a Distance with Jena Nelson",
            "datePublished": "Thu, 21 May 2020 11:00:00 +0000",
            "description": "<p>During school closures and remote learning, maintaining connection with students has been an enormous puzzle to solve. When 8th grade teacher Jena Nelson, from Deer Creek Middle School in Edmond, Oklahoma, switched to online delivery, she looked at this new difficulty as a new opportunity. Digging into her arsenal of costumes from her previous years […]</p>\n<p>The post <a href=\"https://williamdparker.com/2020/05/21/pmp195-instruction-from-a-distance-with-jena-nelson/\" target=\"_blank\">PMP195: Instruction from a Distance with Jena Nelson</a> first appeared on <a href=\"https://williamdparker.com/\" target=\"_blank\">Principal Matters</a>.</p>",
            "length": "26439570",
            "sourceUrl": "https://traffic.libsyn.com/secure/principalmatters/PMP195.mp3"
        },
        {
            "title": "PMP194: Lessons from Leading in New York with Principal Patrick McLaughlin",
            "datePublished": "Thu, 14 May 2020 11:00:00 +0000",
            "description": "<p>School leaders share a common bond – whether you lead in an urban, suburban or rural setting. During the last two months, I’ve also been thinking a lot about another common bond all school leaders now share: caring and serving from a distance. Whether your school is public, charter, or private – you wear many […]</p>\n<p>The post <a href=\"https://williamdparker.com/2020/05/14/pmp194-lessons-from-leading-in-new-york-with-principal-patrick-mclaughlin/\" target=\"_blank\">PMP194: Lessons from Leading in New York with Principal Patrick McLaughlin</a> first appeared on <a href=\"https://williamdparker.com/\" target=\"_blank\">Principal Matters</a>.</p>",
            "length": "28642215",
            "sourceUrl": "https://traffic.libsyn.com/secure/principalmatters/PMP194.mp3"
        },
        {
            "title": "PMP193: Taking a Music Break from COVID-19",
            "datePublished": "Thu, 07 May 2020 11:00:00 +0000",
            "description": "<p>I don’t know about you, but it seems like every waking hour has been spent adjusting to a new normal, and the idea of relaxing almost seems unkind when you think of all the sacrifices people are making during times like this. In Oklahoma, school leaders have been managing distance learning for more than a […]</p>\n<p>The post <a href=\"https://williamdparker.com/2020/05/07/pmp193-taking-a-music-break-from-covid-19/\" target=\"_blank\">PMP193: Taking a Music Break from COVID-19</a> first appeared on <a href=\"https://williamdparker.com/\" target=\"_blank\">Principal Matters</a>.</p>",
            "length": "39077680",
            "sourceUrl": "http://traffic.libsyn.com/principalmatters/PMP193.mp3"
        },
        {
            "title": "PMP192: Leading from a Distance, Part 2 with Jen Schwanke",
            "datePublished": "Thu, 30 Apr 2020 11:00:00 +0000",
            "description": "<p>When storms roll across my home state of Oklahoma, residents here have a few common reactions. First, we listen to the weather station. Oklahoma has the best storm-tracking radar systems in the world. Second, we check our storm closets or shelters to make sure we have a good place to hide if severe weather turns […]</p>\n<p>The post <a href=\"https://williamdparker.com/2020/04/30/pmp192-leading-from-a-distance-part-2/\" target=\"_blank\">PMP192: Leading from a Distance, Part 2 with Jen Schwanke</a> first appeared on <a href=\"https://williamdparker.com/\" target=\"_blank\">Principal Matters</a>.</p>",
            "length": "25139299",
            "sourceUrl": "http://traffic.libsyn.com/principalmatters/PMP192.mp3"
        },
        {
            "title": "PMP191: Reflections on Leading from a Distance",
            "datePublished": "Thu, 23 Apr 2020 11:00:00 +0000",
            "description": "<p>If you’re like me, you’re probably still adjusting to a new normal. Each morning I still wake up, walk the dog, or go for a run around the neighborhood. I login to my email and check my calendar for the series of meetings via Zoom or Google Meets. But life still doesn’t feel normal yet. […]</p>\n<p>The post <a href=\"https://williamdparker.com/2020/04/23/pmp191-reflections-on-leading-from-a-distance/\" target=\"_blank\">PMP191: Reflections on Leading from a Distance</a> first appeared on <a href=\"https://williamdparker.com/\" target=\"_blank\">Principal Matters</a>.</p>",
            "length": "31388625",
            "sourceUrl": "http://traffic.libsyn.com/principalmatters/PMP191.mp3"
        },
        {
            "title": "PMP190: 5 Tips for Running the Uncertain Leadership Roads Ahead",
            "datePublished": "Thu, 16 Apr 2020 11:00:53 +0000",
            "description": "<p>This morning I was running a three-mile track around my neighborhood. As I passed the houses and occasional drivers, I felt a sudden kinship to my neighbors I’m not sure I’ve felt before. We don’t just share the same zip-code; we now share a common experience. And this experience spreads beyond our cities and states. […]</p>\n<p>The post <a href=\"https://williamdparker.com/2020/04/16/pmp190-5-tips-for-running-the-uncertain-leadership-roads-ahead/\" target=\"_blank\">PMP190: 5 Tips for Running the Uncertain Leadership Roads Ahead</a> first appeared on <a href=\"https://williamdparker.com/\" target=\"_blank\">Principal Matters</a>.</p>",
            "length": "30087100",
            "sourceUrl": "http://traffic.libsyn.com/principalmatters/PMP190.mp3"
        },
        {
            "title": "PMP189: Building Bridges to Reach Students with Dr. Don Parker",
            "datePublished": "Wed, 08 Apr 2020 11:00:00 +0000",
            "description": "<p>When Don Parker was a Dean of Students, he knew his students were struggling – especially those with high risk factors. Don’s passion became simple and challenging: Find the best ways to help students be more successful. Through his doctoral dissertation and his practice as a school administrator, he narrowed his focus to two approaches: […]</p>\n<p>The post <a href=\"https://williamdparker.com/2020/04/08/pmp189-building-bridges-to-reach-students-with-dr-don-parker/\" target=\"_blank\">PMP189: Building Bridges to Reach Students with Dr. Don Parker</a> first appeared on <a href=\"https://williamdparker.com/\" target=\"_blank\">Principal Matters</a>.</p>",
            "length": "33086793",
            "sourceUrl": "http://traffic.libsyn.com/principalmatters/PMP189.mp3"
        },
        {
            "title": "PMP188: COVID-19 Update, Principal Reboot, Finding Balance Continued",
            "datePublished": "Wed, 01 Apr 2020 11:00:52 +0000",
            "description": "<p>This week I had the privilege of capturing a few minutes with Chris Legleiter, Principal of Leawood Middle School, Blue Valley Schools, just outside Kansas City, Missouri.  The state of Kansas has closed buildings for the rest of the school year, and like principals around the world, Chris is learning what it means to still […]</p>\n<p>The post <a href=\"https://williamdparker.com/2020/04/01/pmp188-covid-19-update-principal-reboot-finding-balance-continued/\" target=\"_blank\">PMP188: COVID-19 Update, Principal Reboot, Finding Balance Continued</a> first appeared on <a href=\"https://williamdparker.com/\" target=\"_blank\">Principal Matters</a>.</p>",
            "length": "69417397",
            "sourceUrl": "http://traffic.libsyn.com/principalmatters/PMP188.mp3"
        },
        {
            "title": "PMP187: Reboot for Principals, Part 2",
            "datePublished": "Wed, 25 Mar 2020 11:00:00 +0000",
            "description": "<p>As schools across the nation continue closures because of the Coronavirus pandemic, this week’s episode includes an update from listener, Terrence Simmons, Assistant Principal at Floyd Elementary, in Nye County, Nevada. Their team has already launched distance learning for their students, and the district website serves as a great resource for parents wanting guidance and […]</p>\n<p>The post <a href=\"https://williamdparker.com/2020/03/25/pmp187-reboot-for-principals-part-2/\" target=\"_blank\">PMP187: Reboot for Principals, Part 2</a> first appeared on <a href=\"https://williamdparker.com/\" target=\"_blank\">Principal Matters</a>.</p>",
            "length": "57086188",
            "sourceUrl": "http://traffic.libsyn.com/principalmatters/PMP187.mp3"
        },
        {
            "title": "PMP186: Reboot for Principals with Jen Schwanke",
            "datePublished": "Wed, 18 Mar 2020 11:00:00 +0000",
            "description": "<p>Throughout the world, schools are managing the challenges of school closures in response to news of the spreading corona virus or COVID-19. As a school leader, you are expected to manage difficulties, but sometimes you are managing in uncharted territory. Also in the midst of helping others, what can you do to make sure you’re […]</p>\n<p>The post <a href=\"https://williamdparker.com/2020/03/18/pmp186-reboot-for-principals-with-jen-schwanke/\" target=\"_blank\">PMP186: Reboot for Principals with Jen Schwanke</a> first appeared on <a href=\"https://williamdparker.com/\" target=\"_blank\">Principal Matters</a>.</p>",
            "length": "46887475",
            "sourceUrl": "http://traffic.libsyn.com/principalmatters/PMP186.mp3"
        },
        {
            "title": "PMP185: The Power of Sharing Your Own Story",
            "datePublished": "Wed, 11 Mar 2020 11:00:00 +0000",
            "description": "<p>What stories have shaped your own leadership journey? I recently finished reading, Educated: A Memoir by Tara Westover. If you’re unfamiliar with the book, Tara Westover grew up in a rural Idaho with parents who embraced radical ideologies, including not giving their daughter a birth certificate, not vaccinating her, and not providing her with any […]</p>\n<p>The post <a href=\"https://williamdparker.com/2020/03/11/pmp185-the-power-sharing-of-your-own-story/\" target=\"_blank\">PMP185: The Power of Sharing Your Own Story</a> first appeared on <a href=\"https://williamdparker.com/\" target=\"_blank\">Principal Matters</a>.</p>",
            "length": "21376988",
            "sourceUrl": "http://traffic.libsyn.com/principalmatters/PMP185.mp3"
        },
        {
            "title": "PMPEncore151: Hiring High Quality Educators, Part 2",
            "datePublished": "Thu, 05 Mar 2020 12:00:00 +0000",
            "description": "<p>Why is hiring such an important part of your responsibility as a principal? First and foremost, because the students, teachers, and community members deserve high quality education experiences. And secondly, because the people in your school often reflect on your own leadership.  Although we cannot judge ourselves by the way others behave, school leaders are […]</p>\n<p>The post <a href=\"https://williamdparker.com/2020/03/05/pmpencore151-hiring-high-quality-educators-part-2/\" target=\"_blank\">PMPEncore151: Hiring High Quality Educators, Part 2</a> first appeared on <a href=\"https://williamdparker.com/\" target=\"_blank\">Principal Matters</a>.</p>",
            "length": "47527231",
            "sourceUrl": "http://traffic.libsyn.com/principalmatters/PMPEncore151.mp3"
        },
        {
            "title": "PMPEncore150: Hiring High Quality Educators, Part 1",
            "datePublished": "Thu, 27 Feb 2020 12:00:30 +0000",
            "description": "<p>One day the teachers at Indian Run Elementary, in Dublin, Ohio, organized a “Flash TACO bar” – a spontaneous buffet meal where they shared great food and fun together. As principal of the school, Jen Schwanke reflected on the joy and creativity of her teachers: they not only love teaching but they also enjoy working […]</p>\n<p>The post <a href=\"https://williamdparker.com/2020/02/27/pmpencore150-hiring-high-quality-educators-part-1/\" target=\"_blank\">PMPEncore150: Hiring High Quality Educators, Part 1</a> first appeared on <a href=\"https://williamdparker.com/\" target=\"_blank\">Principal Matters</a>.</p>",
            "length": "50519308",
            "sourceUrl": "http://traffic.libsyn.com/principalmatters/PMPEncore150.mp3"
        },
        {
            "title": "PMP184: 5 Voices for Leading Teams with Jeremie Kubicek",
            "datePublished": "Thu, 20 Feb 2020 12:00:55 +0000",
            "description": "<p>It goes without saying that in order to lead you must have followers. But taking others to a destination doesn’t just mean accomplishing all the to-do’s on your checklist. Leadership requires relationships. And meaningful relationships do not happen by accident; they are intentional and purposeful. Part of building meaningful relationships involves understanding yourself and the […]</p>\n<p>The post <a href=\"https://williamdparker.com/2020/02/20/pmp184-5-voices-for-leading-teams-with-jeremie-kubicek/\" target=\"_blank\">PMP184: 5 Voices for Leading Teams with Jeremie Kubicek</a> first appeared on <a href=\"https://williamdparker.com/\" target=\"_blank\">Principal Matters</a>.</p>",
            "length": "25973703",
            "sourceUrl": "http://traffic.libsyn.com/principalmatters/PMP184.mp3"
        },
        {
            "title": "PMP183: Gen Z Unfiltered, Part 2 with Andrew McPeak",
            "datePublished": "Wed, 12 Feb 2020 12:00:14 +0000",
            "description": "<p>“When is a time you have used grit, and what lesson did you learn?” This is just one of 100 questions you find included in the Table Talk Cards that come as a bonus with the book Generation Z Unfiltered: Facing Nine Hidden Challenges of the Most Anxious Population by Dr. Tim Elmore and Andrew […]</p>\n<p>The post <a href=\"https://williamdparker.com/2020/02/12/pmp183-gen-z-unfiltered-part-2-with-andrew-mcpeak/\" target=\"_blank\">PMP183: Gen Z Unfiltered, Part 2 with Andrew McPeak</a> first appeared on <a href=\"https://williamdparker.com/\" target=\"_blank\">Principal Matters</a>.</p>",
            "length": "27092998",
            "sourceUrl": "http://traffic.libsyn.com/principalmatters/PMP183.mp3"
        },
        {
            "title": "PMP182: Generation Z Unfiltered with Andrew McPeak",
            "datePublished": "Thu, 06 Feb 2020 12:00:54 +0000",
            "description": "<p>Students today face newer and different challenges than students of the past. Although many of the skills or values they need to be successful remain the same regardless of time and place, they also have unique challenges that make them one of the most anxious generations in history. If we “take the filters” off our […]</p>\n<p>The post <a href=\"https://williamdparker.com/2020/02/06/pmp182-generation-z-unfiltered-with-andrew-mcpeak/\" target=\"_blank\">PMP182: Generation Z Unfiltered with Andrew McPeak</a> first appeared on <a href=\"https://williamdparker.com/\" target=\"_blank\">Principal Matters</a>.</p>",
            "length": "32338385",
            "sourceUrl": "http://traffic.libsyn.com/principalmatters/PMP182.mp3"
        },
        {
            "title": "Encore099: Collaborating for Results – Interview with Dr. Judi Barber",
            "datePublished": "Thu, 30 Jan 2020 13:00:21 +0000",
            "description": "<p>I am digging into the archives of Principal Matters to bring you an episode from January 2018, when I had the privilege to interview Dr. Judi Barber. First, let me tell you a story. During the previous Christmas break of 2017, I had taken my family to see the newest Star Wars movie. In the […]</p>\n<p>The post <a href=\"https://williamdparker.com/2020/01/30/encore099-collaborating-for-results-interview-with-dr-judi-barber/\" target=\"_blank\">Encore099: Collaborating for Results – Interview with Dr. Judi Barber</a> first appeared on <a href=\"https://williamdparker.com/\" target=\"_blank\">Principal Matters</a>.</p>",
            "length": "51622876",
            "sourceUrl": "http://traffic.libsyn.com/principalmatters/PMPEncore099.mp3"
        },
        {
            "title": "PMP181: Finding Your Swing – How Leadership & Teamwork Go Hand-in-Hand",
            "datePublished": "Thu, 23 Jan 2020 12:37:43 +0000",
            "description": "<p>This week I had the privilege of spending an afternoon with a team of new assistant principals. As we talked about their first semester, they shared the lessons they’ve learned in time management, communication, and problem solving. They are finding their unique places on new teams, understanding their new roles for the first time, and […]</p>\n<p>The post <a href=\"https://williamdparker.com/2020/01/23/pmp181-finding-your-swing-how-leadership-teamwork-go-hand-in-hand/\" target=\"_blank\">PMP181: Finding Your Swing – How Leadership & Teamwork Go Hand-in-Hand</a> first appeared on <a href=\"https://williamdparker.com/\" target=\"_blank\">Principal Matters</a>.</p>",
            "length": "14332704",
            "sourceUrl": "http://traffic.libsyn.com/principalmatters/PMP181.mp3"
        },
        {
            "title": "PMP180: Tipping Points and Why Small Things Matter",
            "datePublished": "Thu, 16 Jan 2020 12:00:43 +0000",
            "description": "<p>What does it take for small actions to produce big results? Over Christmas break, I listened to the audio-version of Malcolm Gladwell’s Tipping Point: How Little Things Can Make a Big Difference and learned some value lessons we can apply to our schools. Let me quickly summarize by saying that Gladwell painstakingly details the phenomenon […]</p>\n<p>The post <a href=\"https://williamdparker.com/2020/01/16/pmp180-tipping-points-and-why-small-things-matter/\" target=\"_blank\">PMP180: Tipping Points and Why Small Things Matter</a> first appeared on <a href=\"https://williamdparker.com/\" target=\"_blank\">Principal Matters</a>.</p>",
            "length": "17625386",
            "sourceUrl": "http://traffic.libsyn.com/principalmatters/PMP180.mp3"
        },
        {
            "title": "PMP179: Special Edition – Principal Matters 2019 Year In Review",
            "datePublished": "Wed, 08 Jan 2020 12:00:37 +0000",
            "description": "<p>Last week my family and I traveled back to Tennessee to see my parents and extended family. My parents both turned 79 this past year. Life has slowed down a lot for them now. One of my mother’s favorite past times, for instance, is walking the woods — gathering treasures like small rocks or interesting […]</p>\n<p>The post <a href=\"https://williamdparker.com/2020/01/08/pmp179-special-edition-principal-matters-2019-year-in-review/\" target=\"_blank\">PMP179: Special Edition - Principal Matters 2019 Year In Review</a> first appeared on <a href=\"https://williamdparker.com/\" target=\"_blank\">Principal Matters</a>.</p>",
            "length": "15278127",
            "sourceUrl": "http://traffic.libsyn.com/principalmatters/PMP179.mp3"
        },
        {
            "title": "PMP178: 10 Positive Takeaways from the Past Decade",
            "datePublished": "Tue, 24 Dec 2019 17:30:00 +0000",
            "description": "<p>Just like you, I can think of many reasons to worry about the future or raise concerns about trends that have developed over the past decade. Whether that includes increases in school shootings, soaring health care costs, rises in the costs of education, the number of children experiencing trauma, growing concerns in climate change or […]</p>\n<p>The post <a href=\"https://williamdparker.com/2019/12/24/pmp178-10-positive-takeaways-from-the-past-decade/\" target=\"_blank\">PMP178: 10 Positive Takeaways from the Past Decade</a> first appeared on <a href=\"https://williamdparker.com/\" target=\"_blank\">Principal Matters</a>.</p>",
            "length": "12480788",
            "sourceUrl": "http://traffic.libsyn.com/principalmatters/PMP178.mp3"
        },
        {
            "title": "PMP177: Cha Cha’s for Making Learning Stick with LeAnn Nickelsen",
            "datePublished": "Wed, 18 Dec 2019 12:38:21 +0000",
            "description": "<p>A few weeks ago, I was sharing with a group of principals one of my favorite video-clips from the movie, The Incredibles. It’s the scene where Lucius, aka the superhero, Frozone, is watching as his city is under attack from his apartment window. He pushes a button on his remote control to open a wall […]</p>\n<p>The post <a href=\"https://williamdparker.com/2019/12/18/pmp177-cha-chas-for-making-learning-stick-with-leann-nickelsen/\" target=\"_blank\">PMP177: Cha Cha’s for Making Learning Stick with LeAnn Nickelsen</a> first appeared on <a href=\"https://williamdparker.com/\" target=\"_blank\">Principal Matters</a>.</p>",
            "length": "30217242",
            "sourceUrl": "http://traffic.libsyn.com/principalmatters/PMP177.mp3"
        },
        {
            "title": "Encore146: Balancing Priorities with Jen Schwanke",
            "datePublished": "Thu, 12 Dec 2019 00:00:58 +0000",
            "description": "<p>Thank you @JenSchwanke for the great takeaways in this encore episode! #principalmatters #edleadership</p>\n<p>The post <a href=\"https://williamdparker.com/2019/12/11/encore146-balancing-priorities-with-jen-schwanke/\" target=\"_blank\">Encore146: Balancing Priorities with Jen Schwanke</a> first appeared on <a href=\"https://williamdparker.com/\" target=\"_blank\">Principal Matters</a>.</p>",
            "length": "47960726",
            "sourceUrl": "http://traffic.libsyn.com/principalmatters/PMPEncore146.mp3"
        },
        {
            "title": "PMP176: Leading Through Equity with William Stubbs",
            "datePublished": "Wed, 04 Dec 2019 12:00:10 +0000",
            "description": "<p>In October 2018, William Stubbs, an instructional leadership director at Oklahoma City Public Schools at the time, entered and won the Teach for America’s Shark Tank OKC as a contestant in the city’s Shark Tank competition. He was awarded $10,000 to implement stronger partnerships and mentoring opportunties for the city’s young men of color with […]</p>\n<p>The post <a href=\"https://williamdparker.com/2019/12/04/pmp176-leading-through-equity-with-william-stubbs/\" target=\"_blank\">PMP176: Leading Through Equity with William Stubbs</a> first appeared on <a href=\"https://williamdparker.com/\" target=\"_blank\">Principal Matters</a>.</p>",
            "length": "45562026",
            "sourceUrl": "http://traffic.libsyn.com/principalmatters/PMP176.mp3"
        },
        {
            "title": "PMP175: Middle School Matters with Phyllis Fagell",
            "datePublished": "Wed, 27 Nov 2019 23:00:59 +0000",
            "description": "<p>Do you remember what is was like to be a middle school student? For many people, memories of those years often bring back stories filled with anxiety and awkward physical, emotional, and social changes. According to Phyllis Fagell, however, those years can be good ones. “Probably what people might be most surprised to know is […]</p>\n<p>The post <a href=\"https://williamdparker.com/2019/11/27/pmp175-middle-school-matters-with-phyllis-fagell/\" target=\"_blank\">PMP175: Middle School Matters with Phyllis Fagell</a> first appeared on <a href=\"https://williamdparker.com/\" target=\"_blank\">Principal Matters</a>.</p>",
            "length": "29219943",
            "sourceUrl": "http://traffic.libsyn.com/principalmatters/PMP175.mp3"
        },
        {
            "title": "PMP174:  10 Areas to Focus on for Growth as a Leader with Chris Legleiter",
            "datePublished": "Thu, 21 Nov 2019 00:00:03 +0000",
            "description": "<p>Every person in your school is at a different level of growth. Not just students, but teachers are also at stages of growth. Leadership is not any different. Some educators are just beginning the journey. Others are finishing their first few years, and some are experiencing years of mastery in certain strategies or subjects. Over […]</p>\n<p>The post <a href=\"https://williamdparker.com/2019/11/20/pmp174-10-areas-to-focus-on-for-growth-as-a-leader-with-chris-legleiter/\" target=\"_blank\">PMP174:  10 Areas to Focus on for Growth as a Leader with Chris Legleiter</a> first appeared on <a href=\"https://williamdparker.com/\" target=\"_blank\">Principal Matters</a>.</p>",
            "length": "32485090",
            "sourceUrl": "http://traffic.libsyn.com/principalmatters/PMP174.mp3"
        }
    ]
}