{
    "artwork": "http://is5.mzstatic.com/image/thumb/Music62/v4/e7/c4/ad/e7c4adc4-617b-dbfc-1768-0104ce57478a/source/100x100bb.jpg",
    "description": "Dan Savage, America's only advice columnist, answers your sex questions and yaps about politics. To record a question for Dan to be answered in a later podcast, call 206-302-2064. For a much longer version of the show, with no ads, visit savagelovecast.com and get yourself a season subscription.",
    "feedURL": "http://savagelove.libsyn.com/rss",
    "podcastURL": "http://podcasts.thestranger.com/savagelove/",
    "title": "Savage Lovecast",
    "episodes": [
        {
            "title": "Savage Love Episode 733",
            "datePublished": "Tue, 10 Nov 2020 09:00:00 +0000",
            "description": "Our opening \"sexcess\" story features a black light. You people are creative! Dan counsels a gay man whose boyfriend is so closeted and scared of his military father, (this boyfriend lives in his parent's basement,) that he has to sneak in and out under cover of night. Kind of fun when you're in high school, but in your 30s? Not so much. On the Magnum: Have you ever heard a rabbi say: \"The religion is messing you up\"? Meet the fearless rabbi Jeremy Gerber. He and Dan discuss blow job technique as well as the practice of mikvah- where couples abstain from all contact during, and for seven days after menstruation. And a 59 year old man who used to be in a sexless marriage is now getting tons of sex. But how can he retrain his dick to orgasm faster? This episode is brought to you by AdamandEve.com. Get 50% off just about any item, plus free shipping when you enter the offer code \"Savage\". This episode is brought toy by Tushy- the modern bidet attachment that washes your ass completely. Go to www.HELLOtushy.com and get 10% off your order with promo code SAVAGE. Stop wiping and start washing with TUSHY.     This episode is brought to you by Helix Sleep-the best mattress for your individualized comfort. Right now, get up to $200 off ALL mattress orders at HelixSleep.com/SAVAGE.",
            "length": "23647377",
            "sourceUrl": "http://podtrac.com/pts/redirect.mp3/traffic.libsyn.com/savagelove/savagelove-111020.mp3?dest-id=36185",
            "epNo": "733"
        },
        {
            "title": "Savage Love Episode 732",
            "datePublished": "Tue, 03 Nov 2020 09:00:00 +0000",
            "description": "Our opening covid-era Sexcess story features seniors in a retirement community huffing on ice bongs and getting it on. If they can do it, you can too. A Wiccan druid witchy woman is dating a Christian dude. They let each other be. But when he requests that they do some role playing where she dresses up as a \"sexy witch\" and puts a spell on him, she wonders if she should be offended or just hop on his broomstick already. Dan interviews Adam Sass, author of Surrender Your Sons- a YA thriller about a gay kid who escapes from a conversation therapy camp. It sounds awesome! Book sales will support , an organization fighting to ban conversion therapy. What do you do, when your boyfriend's mother offers you a baby blanket made by her mother, but you don't have or want kids? A) Tell her you don't want the stupid blanket. B) Take the stupid blanket. 206-302-2064   voicemail@savagelovecast.com Today’s Lovecast is brought to you by MeUndies.com: High quality, super-comfortable, good looking undies. Get 15% off your first order when you go to . This episode is brought to you by Squarespace. They make it easy to build a website or blog. Give it a whirl at  and if you want to buy it, use the code Savage for a 10% off your first purchase.     This episode is brought to you by . Get 50% off just about any item, plus free shipping when you enter the offer code \"Savage\".",
            "length": "24515269",
            "sourceUrl": "http://podtrac.com/pts/redirect.mp3/traffic.libsyn.com/savagelove/savagelove-110320.mp3?dest-id=36185",
            "epNo": "732"
        },
        {
            "title": "Savage Love Episode 731",
            "datePublished": "Tue, 27 Oct 2020 08:00:00 +0000",
            "description": "A man and his much younger girlfriend decided to seek a unicorn through swinging apps. Her only rule was to set the age limit to women over 30. So, naturally, he went for women in their 20s. What's the problem?! A queer woman is into being choked. She knows it's unsafe. Is there any way to do breath play safely? On the Magnum, Dan chats with the Political Gabfest luminary Emily Bazelon about the conservative shift in the Supreme Court. Sexy! And, a woman's boyfriend was able to get her off using only his foot. What has your boyfriend done for you lately?     ThredUP is the world’s largest online thrift store with over 35,000 brands at up to 90% off retail price. For a limited time, get up to 30% off your first order at . This episode is brought to you by Talkspace- online therapy that makes it easy to get extra mental health support. For $100 off your first month, go to  and use the offer code Savage.     The Savage Lovecast is brought to you by Dame Products: a woman-founded sex toy company. Visit  to get $10 off your first order.      ",
            "length": "24103579",
            "sourceUrl": "http://podtrac.com/pts/redirect.mp3/traffic.libsyn.com/savagelove/savagelove-102720.mp3?dest-id=36185",
            "epNo": "731"
        },
        {
            "title": "Savage Love Episode 730",
            "datePublished": "Tue, 20 Oct 2020 08:00:00 +0000",
            "description": "A woman is considering becoming a 24/7 slave for a man in a don't-ask-don't-tell relationship with his wife. But maybe he's just cheating on the wife? How can you be sure? Over a decade ago, a woman was in an abusive relationship. He went too far and they broke up. He has been apologizing ever since. Now that she has forgiven him, she wants to connect with him again. Should she? On the Magnum version of the show, Dan chats with disabilities activist Andrew Gurza about some very inappropriate PDA in a park by folks with cognitive delay. He also unveils his new line of sex toys by and for disabled people. And, is it an acceptable move to guide a woman's hand down to your dick when you are making out? 206-302-2064  voicemail@savagelovecast.com This episode is brought to you by Helix Sleep-the best mattress for your individualized comfort. Right now, get up to $200 off ALL mattress orders at      This podcast is brought to you by . Click on the microphone and enter \"Savage\" for postage, a digital scale, and a 4 week trial.     This episode is brought toy by Tushy- the modern bidet attachment that washes your ass completely. Go to  and get 10% off your order with promo code SAVAGE. Stop wiping and start washing with TUSHY.",
            "length": "24786942",
            "sourceUrl": "http://podtrac.com/pts/redirect.mp3/traffic.libsyn.com/savagelove/savagelove-102020.mp3?dest-id=36185",
            "epNo": "730"
        },
        {
            "title": "Savage Love Episode 729",
            "datePublished": "Tue, 13 Oct 2020 08:00:00 +0000",
            "description": "A woman's friend is acting like a damn fool. Again. She plans to travel across the country to meet a man she met online, without even having spoken to him on the phone. Is she getting catfished? Who knows? Should the caller try to talk her gullible, sensitive friend out of this recklessness? An erotic dancer feels guilty when her customers fall in love with her. Is she leading them on? On the Magnum, Dan welcomes back writer and digital rights activist Cory Doctorow. They discuss the appeal of conspiracy theories, Joe Biden, and texting expectations among many other things. And, a man and his long term girlfriend have mis-matched libidos. He is poly and horny. She is asexual. They are about to adopt her cousins and raise them together. So now would be a difficult time to begin a relationship with a dear friend of theirs, right? Maybe, maybe not. It's always so complicated! 206-302-2064        voicemail@savagelovecast.com     This episode is brought to you by Squarespace. They make it easy to build a website or blog. Give it a whirl at  and if you want to buy it, use the code Savage for a 10% off your first purchase.           This episode is brought to you by Helix Sleep-the best mattress for your individualized comfort. Right now, get up to $200 off ALL mattress orders at .     Foria is an all natural health & sexual wellness company with product lines using the power of plant actives & CBD to effectively enhance intimacy, sexual pleasure, daily wellbeing, and relief from discomfort. Get 20% off your first order by visiting",
            "length": "26884262",
            "sourceUrl": "http://podtrac.com/pts/redirect.mp3/traffic.libsyn.com/savagelove/savagelove-101320.mp3?dest-id=36185",
            "epNo": "729"
        },
        {
            "title": "Savage Love Episode 728",
            "datePublished": "Tue, 06 Oct 2020 08:00:00 +0000",
            "description": "A woman would like a gigolo please. Or two. She knows she could score a man for free, but likes the idea of paying for it. Is this possible? How? Whoopsy daisy! A woman was texting her friend about the crippling crush she has on a co-worker, when she realized she was texting the co-worker herself. The gal reacted gracefully, but now what? On the Magnum, Dan interviews Dr Raphael Landovitz, about the promise of a new injectable version of PrEP. And, a 17 year old girl had penetrative sex for the first time. She's psyched! But she was very, very wet, and he was... not all that hard. Don't worry, teens! It gets better. 206-302-2064       voicemail@savagelovecast.com This episode of the Savage Lovecast is sponsored by OMGyes.com: a website dedicated to getting scientific truths out about women's sexual pleasure. Savage Lovecast listeners can get a discount if they go to . ThredUP is the world’s largest online thrift store with over 35,000 brands at up to 90% off retail price. For a limited time, get up to 30% off your first order at . The Savage Lovecast is brought to you by Dame Products: a woman-founded sex toy company. Visit  to get $10 off your first order.",
            "length": "26504546",
            "sourceUrl": "http://podtrac.com/pts/redirect.mp3/traffic.libsyn.com/savagelove/savagelove-100620.mp3?dest-id=36185",
            "epNo": "728"
        },
        {
            "title": "Savage Love Episode 727",
            "datePublished": "Tue, 29 Sep 2020 08:00:00 +0000",
            "description": "Some rando started following a woman on Insta. He confessed that he jerks off to her yoga photos. She told him she would have to charge him a fee for this. He agreed. The question is... how much? A woman Googled her dad. What did she find? She found videos of women in bathing suits. If you Googled her dad, you would see this. Should she tell her dad? Good lord, how? On the Magnum, let's talk about anal prolapse, shall we? Because it's so sexy! Tristan Taormino, author of The Ultimate Guide to Anal Sex for Women, talks about ways to mitigate this common problem. She and Dan also revisit the question of whether polyamory is cancelled in the time of Covid-19. And, when you think your mom is cool with you being gay, but then re-posts some Trumpy nonsense, should you try to educate her? 206-302-2064 voicemail@savagelovecast.com Today’s Lovecast is brought to you by MeUndies.com: High quality, super-comfortable, good looking undies. Get 15% off your first order when you go to .     This episode is brought to you by Allform- premium, customizable sofas and chairs shipped right to your door. For 20% off your perfect sofa, go to .         The Savage Lovecast is brought to you by Dame Products: a woman-founded sex toy company. Visit  to get $10 off your first order.",
            "length": "25824526",
            "sourceUrl": "http://podtrac.com/pts/redirect.mp3/traffic.libsyn.com/savagelove/savagelove-092920.mp3?dest-id=36185",
            "epNo": "727"
        },
        {
            "title": "Savage Love Episode 726",
            "datePublished": "Tue, 22 Sep 2020 08:00:00 +0000",
            "description": "A woman is still friendly with her ex-husband. So friendly that she sends him nudes which he pays for. But she just learned that he's re-married! Is it unethical to continue this naughty exchange? A woman begs Dan to tell her to break up with her emotionally shut-down boyfriend. Dan obliges. Dan chats with 24/7 sub goddess Lina Dune about the healing power of safe, sane, consensual kink. A little of the conversation is on the Micro and all of it is on the Magnum. And a woman notices that her boyfriend never gets hard when he goes down on her. And he doesn't do it very often. Is there anything she can do to make her lovely vag irresistible? 206-302-3064  voicemail@savagelovecast.com     This episode is brought to you by Talkspace- online therapy that makes it easy to get extra mental health support. For $100 off your first month, go to  and use the offer code Savage.         This episode is brought toy by Tushy- the modern bidet attachment that washes your ass completely. Go to  and get 10% off your order with promo code SAVAGE. Stop wiping and start washing with TUSHY.         This podcast is brought to you by . Click on the microphone and enter \"Savage\" for postage, a digital scale, and a 4 week trial.",
            "length": "25241055",
            "sourceUrl": "http://podtrac.com/pts/redirect.mp3/traffic.libsyn.com/savagelove/savagelove-092220.mp3?dest-id=36185",
            "epNo": "726"
        },
        {
            "title": "Savage Love Episode 725",
            "datePublished": "Tue, 15 Sep 2020 08:00:00 +0000",
            "description": "A woman was babysitting her neighbor's 3 year-old daughter. The girl took her clothes off and started touching herself. Should the caller say something to the parents? Is this behavior a red flag for abuse? Or is this just how the 3 year-olds roll? A man with a very girthy penis can't come without extended penis-in-vagina action. But sometimes his ladies can't handle it. He started faking his orgasms. Any other solutions here? On the Magnum version of the show, Caitlin Doughty (host of Ask a Mortician on YouTube,) is on to discuss how the pandemic is changing the way we handle funerals, grieving and possible positive changes in the death industry. She is the most charming goth mortician you'll ever encounter. And, in the response calls, our ever-pragmatic listeners offer great suggestions on how to make a bed work for three people. 206-302-2064  voicemail@savagelovecast.com     ThredUP is the world’s largest online thrift store with over 35,000 brands at up to 90% off retail price. For a limited time, get up to 30% off your first order at .     This episode of the Savage Lovecast is sponsored by OMGyes.com: a website dedicated to getting scientific truths out about women's sexual pleasure. Savage Lovecast listeners can get a discount if they go to . This episode is brought to you by Squarespace. They make it easy to build a website or blog. Give it a whirl at  and if you want to buy it, use the code Savage for a 10% off your first purchase.",
            "length": "23576115",
            "sourceUrl": "http://podtrac.com/pts/redirect.mp3/traffic.libsyn.com/savagelove/savagelove-091520.mp3?dest-id=36185",
            "epNo": "725"
        },
        {
            "title": "Savage Love Episode 724",
            "datePublished": "Tue, 08 Sep 2020 08:00:00 +0000",
            "description": "A woman has had a LOT of sex, mostly with men. But she is realizing that she is truly only attracted to women. The problem is, when she talks to a hot woman, she starts stuttering and stammering in terror. How can she grow to be comfortable in her true skin? A man's girlfriend fantasizes that she's a gay man when they have sex. Does this mean she's trans? She insists she's all woman, but the caller is worried, worried, worried. On the Magnum, a deep dive onto vaginas (yup!) with Dr. Jen Gunter, author of The Vagina Bible. She and Dan discuss tipped uteruses, HATING your boyfriend just before your period, and a rare ear-labia connection. Vaginas are weird and great! And, how can one make one's bed most comfortable for three? 206-302-2064  voicemail@savagelovecast.com This episode is brought to you by Earnest: Earnest makes it easy to refinance your student loans. Get a $100 cash bonus when you refinance a student loan at . Terms apply.     This episode is brought to you by Doordash. Get breakfast, lunch, dinner and more delivered from your favorite restaurants right to your doorstep with one easy click. Get $5 off your first order of $15 or more when you download the DoorDash app and enter promo code SAVAGE.         This episode of the Lovecast is brought to you by Babbel: the new way to learn a foreign language. Right now, when you purchase a three month subscription, Babbel will give our listeners 3 additional months for FREE with Promo Code: SAVAGE",
            "length": "24788823",
            "sourceUrl": "http://podtrac.com/pts/redirect.mp3/traffic.libsyn.com/savagelove/savagelove-090820.mp3?dest-id=36185",
            "epNo": "724"
        },
        {
            "title": "Savage Love Episode 723",
            "datePublished": "Tue, 01 Sep 2020 08:00:00 +0000",
            "description": "A woman's husband had low testosterone, so he started taking T. But then, he turned into a total asshole! Is this normal? Is this just what testosterone does? A trans woman has not yet had bottom surgery. While she waits, how can she find a woman who would want her as she is now, and how she will be later? On the Magnum, Dan chats with sex researcher Alexandra Marcotte about her study looking at how men and women differ in their enjoyment of dick pics. A woman has a girlfriend but they don't live together. The caller is very cautious about covid-19: She wipes all her groceries down, sterilizes the doorknobs- that sort of thing. Meanwhile, her girlfriend's roommates are going out to bars, throwing caution to the wind. How can the caller try to limit contact? Is there a huge fight in their future? Open your wallets and go to  206-302-2064   voicemail@savagelovecast.com This episode is brought to you by Helix Sleep-the best mattress for your individualized comfort. Right now, get up to $200 off ALL mattress orders at .     This episode is brought to you by Squarespace. They make it easy to build a website or blog. Give it a whirl at  and if you want to buy it, use the code Savage for a 10% off your first purchase.     This episode is brought to you by Hello Fresh. Get fresh, pre-measured ingredients and mouthwatering seasonal recipes delivered right to your door. Get $80 off your first box when you go to .",
            "length": "24800735",
            "sourceUrl": "http://podtrac.com/pts/redirect.mp3/traffic.libsyn.com/savagelove/savagelove-090120.mp3?dest-id=36185",
            "epNo": "723"
        },
        {
            "title": "Savage Love Episode 722",
            "datePublished": "Tue, 25 Aug 2020 08:00:00 +0000",
            "description": "A woman started dating a transman. But then his personality completely changed. I this just a trans thing? Or a coincidence? A verse dyke working as a nanny in an uptight conservative community can't find any other lesbians. She's so horny she would settle for a man. But how can she find someone willing to be her \"walking dildo?\" On the Magnum, a deep dive into cuckolding, with the utterly charming Venus from the Venus Cuckoldress Podcast. What drives a man to be turned on watching his partner get together with other men? What's in it for the woman? It's a wild, wild world and Venus takes us through it. And blechhhh! Her man douses himself in cologne. She HATES the smell of cologne. He knows this, and still pours buckets of expensive chemicals on himself to mask his natural, lovely body scent. Why? Why do they do this? Our caller is worried about hurting his feelings. So she sits there and suffers. If you smell something, say something. 206-302-2064 voicemail@savagelovecast.com Today’s Lovecast is brought to you by MeUndies.com: High quality, super-comfortable, good looking undies. Get 15% off your first order when you go to . ThredUP is the world’s largest online thrift store with over 35,000 brands at up to 90% off retail price. For a limited time, get up to 30% off your first order at . The Savage Lovecast is brought to you by Dame Products: a woman-founded sex toy company. Visit  to get $10 off your first order.",
            "length": "25404059",
            "sourceUrl": "http://podtrac.com/pts/redirect.mp3/traffic.libsyn.com/savagelove/savagelove-082520.mp3?dest-id=36185",
            "epNo": "722"
        },
        {
            "title": "Savage Love Episode 721",
            "datePublished": "Tue, 18 Aug 2020 08:00:00 +0000",
            "description": "Have you ever gone snorkeling...naked? On a long anticipated second date? She has. Hear ALL about it... A woman's sister is *still* planning her 100 person wedding for this October. Will covid-19 be over by then? Certainly not. So should the caller go or tell her stupid sister to postpone her stupid wedding already? On the Magnum, Dan chats with clinical psychologist and sex therapist Dr. David Ley, about the difference between sex addiction and kinks. And, can extroverts successfully date introverts? Voicemail@savageloivecast.com           206-302-2064 This episode is brought to you by Helix Sleep-the best mattress for your individualized comfort. Right now, get up to $200 off ALL mattress orders at .     This episode is brought to you by Talkspace- online therapy that makes it easy to get extra mental health support. For $100 off your first month, go to  and use the offer code Savage.         This podcast is brought to you by . Click on the microphone and enter \"Savage\" for postage, a digital scale, and a 4 week trial.",
            "length": "26699315",
            "sourceUrl": "http://podtrac.com/pts/redirect.mp3/traffic.libsyn.com/savagelove/savagelove-081820.mp3?dest-id=36185",
            "epNo": "721"
        },
        {
            "title": "Savage Love Episode 720",
            "datePublished": "Tue, 11 Aug 2020 08:00:00 +0000",
            "description": "A man's new boyfriend is really great in every way! Except...he believes in mythical creatures, thinks he has super-powers and that the government is communicating with him through the radio. So, should the caller leave his mentally ill new boyfriend or try to get him some help? Meanwhile, a woman's sister has started dating a \"professional\" astrologer who had gotten kicked out of the marines, believes in conspiracy theories and wants to move to Mexico with the caller's sister after dating for just a few months. How can the caller help her stubborn sister see all those red flags a'flappin'? On the Magnum, It's a generational battle royale! Dan chats with Jill Filipovic author of \"Ok Boomer, Let's Talk\" in a Millennial vs Boomer sex-advice smack down! (Just kidding. They agree on pretty much everything.) Filipovic's book goes into the ways the younger generations have been shafted by the olds. Time to seize power, youngun's! A bi man's boyfriend is being driven crazy by his new neighbor. She has noisy sex at all hours, disrupting the boyfriend's sleep and work life. Should they have ear-piercing retaliatory sex to teach her a lesson? voicemail@savagelovecast.com 206-302-2064     This episode is brought to you by Squarespace. They make it easy to build a website or blog. Give it a whirl at  and if you want to buy it, use the code Savage for a 10% off your first purchase.     This episode is brought to you by Earnest: Earnest makes it easy to refinance your student loans. Get a $100 cash bonus when you refinance a student loan at e. Terms apply. This episode of the Lovecast is brought to you by : the new way to learn a foreign language. Right now, when you purchase a three month subscription, Babbel will give our listeners 3 additional months for FREE with Promo Code: SAVAGE",
            "length": "24457800",
            "sourceUrl": "http://podtrac.com/pts/redirect.mp3/traffic.libsyn.com/savagelove/savagelove-081120.mp3?dest-id=36185",
            "epNo": "720"
        },
        {
            "title": "Savage Love Episode 719",
            "datePublished": "Tue, 04 Aug 2020 08:00:00 +0000",
            "description": "Our opening covid-19 \"sexcess\" story is extra special this week. You will never think of Tollhouse cookies the same way again. Don't you hate it when your brother-in-law steals your underpants, and uses them to jack off? This little sordid story only gets worse. On the Magnum, meet the dominatrix who commands her clients to read Black feminist theory. Mistress Velvet and Dan discuss performative wokeness, allies vs. accomplices, and the transformative power of S&M among many other things. Mistress Velvet knows her shit. Obey her and listen in. And a woman and her boyfriend keep breaking the bed! Is there a bed frame out there that can withstand this couple's vigorous rutting?     This episode is brought to you by Doordash. Get breakfast, lunch, dinner and more delivered from your favorite restaurants right to your doorstep with one easy click. Get $5 off your first order of $15 or more when you download the DoorDash app and enter promo code SAVAGE.           Today's episode is brought to you by Dirty Diana- a new sex positive, fictional podcast starring Demi Moore and created by Shana Feste. It's a show for all of us who are craving connection and searching for a new kind of erotica. Check it out at            This episode of the Savage Lovecast is sponsored by OMGyes.com: a website dedicated to getting scientific truths out about women's sexual pleasure. Savage Lovecast listeners can get a discount if they go to .",
            "length": "25834975",
            "sourceUrl": "http://podtrac.com/pts/redirect.mp3/traffic.libsyn.com/savagelove/savagelove-080420.mp3?dest-id=36185",
            "epNo": "719"
        },
        {
            "title": "Savage Love Episode 718",
            "datePublished": "Tue, 28 Jul 2020 08:00:00 +0000",
            "description": "An Irish man has found dating success with his \"personal operating manual.\" After the second date or so, he slides over a piece of paper delineating his likes and dislikes, in bed and out. It cuts through a lot of clutter, says he. For those of you separated from your loved ones because of travel restrictions, there could be some hope maybe? Dan chats with Chelsea from \"Love is Not Tourism\" a group working to allow stipulations for folks who want to reunite with their beloveds in other countries. A kindly aunt has been counseling her newly out niece. The niece and her mother don't get along. Is it wrong for the caller to step in and chaperone her niece on her first date with a slightly older girl? And, one hot day, a woman found her \"nubbin\" tingling when she thought about ice cream for a second. Panic ensues. Is she some kind of ice cream fetishizing pervert? Her girlfriend tells her to chill out. So do we. Voicemail@savagelovecast.com     206-302-2064     This podcast is brought to you by . Click on the microphone and enter \"Savage\" for postage, a digital scale, and a 4 week trial.         This episode is brought to you by Hello Fresh. Get fresh, pre-measured ingredients and mouthwatering seasonal recipes delivered right to your door. Get $80 off your first box when you go to .     This episode is brought to you by Earnest: Earnest makes it easy to refinance your student loans. Get a $100 cash bonus when you refinance a student loan at . Terms apply.",
            "length": "24938871",
            "sourceUrl": "http://podtrac.com/pts/redirect.mp3/traffic.libsyn.com/savagelove/savagelove-072820.mp3?dest-id=36185",
            "epNo": "718"
        },
        {
            "title": "Savage Love Episode 717",
            "datePublished": "Tue, 21 Jul 2020 08:00:00 +0000",
            "description": "A man has been with his boyfriend for a year. The boyfriend's supposedly straight roommate gives intimate hugs and drops obvious homo hints when he's drunk. The caller doesn't like him or trust him. Does he have to put up with this? This lady likes a giant, huge, enormous, really big penis. She proposes a hack for when she's with a more modestly endowed gentleman. Could she insert a yoni egg inside her vagina, to simulate that Big Dick feeling? Would this work? Dan? On the Magnum, we welcome the Kinsey Institute's Justin Lehmiller. Dan and Dr. Lehmiller discuss the difficulty of stating your sexual desires to a partner when your desires are...weird.  Or disturbing. It's tough out there for a closet kinkster. Dr. Lehmiller's rational thinking and soothing voice are a balm in these confusing times. Finally, a man is dating a woman he really likes. But her parents are Trump supporters. She claims she isn't going to vote at all in November. (!!!) Is she a secret Trump supporter? Does he have the right to demand she vote for Biden? Does this rise to DTMFA levels? Voicemail@savagelovecast.com      206-302-2064 This episode is brought to you by Helix Sleep-the best mattress for your individualized comfort. Right now, get up to $200 off ALL mattress orders at .     Today’s Lovecast is brought to you by MeUndies.com: High quality, super-comfortable, good looking undies. Get 15% off your first order when you go to .     This episode is brought to you by Squarespace. They make it easy to build a website or blog. Give it a whirl at  and if you want to buy it, use the code Savage for a 10% off your first purchase.",
            "length": "24598443",
            "sourceUrl": "http://podtrac.com/pts/redirect.mp3/traffic.libsyn.com/savagelove/savagelove-072120.mp3?dest-id=36185",
            "epNo": "717"
        },
        {
            "title": "Savage Love Episode 716",
            "datePublished": "Tue, 14 Jul 2020 08:00:00 +0000",
            "description": "A young gay man is having a great time with his boyfriend who is 14 years older than him. Can it last? How? On the Magnum, be charmed by comedian Jay Jurden. We were. Jay and Dan talk about gays, three-ways and Catholic guilt, among other things. A woman has a fantasy of being \"taken\" by an older man with power over her. But wouldn't any man who acts this out with her be a total creep? Finally, are there dog toys sold in pet stores that are secretly meant to be sex toys? For humans? Voicemail@savagelovecast.com           206-302-2064     This episode of the Lovecast is brought to you by : the new way to learn a foreign language. Right now, when you purchase a three month subscription, Babbel will give our listeners 3 additional months for FREE with Promo Code: SAVAGE     This episode is brought to you by Doordash. Get breakfast, lunch, dinner and more delivered from your favorite restaurants right to your doorstep with one easy click. Get $5 off your first order of $15 or more when you download the DoorDash app and enter promo code SAVAGE. This episode of the Savage Lovecast is sponsored by OMGyes.com: a website dedicated to getting scientific truths out about women's sexual pleasure. Savage Lovecast listeners can get a discount if they go to .",
            "length": "23671200",
            "sourceUrl": "http://podtrac.com/pts/redirect.mp3/traffic.libsyn.com/savagelove/savagelove-071420.mp3?dest-id=36185",
            "epNo": "716"
        },
        {
            "title": "Savage Love Episode 715",
            "datePublished": "Tue, 07 Jul 2020 08:00:00 +0000",
            "description": "Hear the tale of the NB lesbian who snooped and found out that  the sex worker they want to hire makes more money than they do, and finds this unacceptable. (Confidential to the caller: you'll eventually get over the pummeling Dan gives you.) We were so honored to welcome Dr. Erin Berry -regional Medical Director of Planned Parenthood. Dan and Dr. Berry blasted through a bunch of your questions (HPV vaccine for men, molluscum, IUDs, bidets for women, more!) and of course they discussed abortion and the recent Supreme Court decision. Dr. Berry is a rock star. Some of it is on the Micro version and all of it is on the Magnum. Listen in. And, a queer woman enjoys using her strap-on as if it were a penis. But do gay men do the same? 206-302-2064   voicemail@savagelovecast.com This podcast is brought to you by . Click on the microphone and enter \"Savage\" for postage, a digital scale, and a 4 week trial. This episode is brought to you by Squarespace. They make it easy to build a website or blog. Give it a whirl at  and if you want to buy it, use the code Savage for a 10% off your first purchase. This episode is brought to you by Talkspace- online therapy that makes it easy to get extra mental health support. For $100 off your first month, go to  and use the offer code Savage.",
            "length": "24981084",
            "sourceUrl": "http://podtrac.com/pts/redirect.mp3/traffic.libsyn.com/savagelove/savagelove-070720.mp3?dest-id=36185",
            "epNo": "715"
        },
        {
            "title": "Savage Love Episode 714",
            "datePublished": "Tue, 30 Jun 2020 08:00:00 +0000",
            "description": "A gay married man faces a choice. He can keep his stable job, if he moves to...Kansas. Dan brings on Kansas State Representative Brandon Woodard to try to sell his state to the caller. At the top of this list of the midwestern state's redemptive qualities: Kansas is only 3 hours away from everywhere else! So, they've got that going for them. A woman is horrified that her husband wants to \"suckle\" her breasts as if she were lactating. \"Just one time?\" he begs. On the Magnum, Dan gushingly chats with public health super-hero Dr. Demetre Daskalakis. The dreamy Deputy Commissioner for Disease Control at the NYC Health Department is responsible for some of the most honest, rational, pro-sex messaging coming out of New York City, and Dan is nothing less than star-struck. Listen in. And, a woman with step-children found herself watching some step-mom porn. And she liked it! WHAT DOES THIS MEAN? 206-302-2064   voicemail@savagelovecast.com     This episode is brought to you by Helix Sleep-the best mattress for your individualized comfort. Right now, get up to $200 off ALL mattress orders at .     This episode is brought to you by Allform- premium, customizable sofas and chairs shipped right to your door. For 20% off your perfect sofa, go to .         This episode of the Savage Lovecast is brought to you by Blue Apron. Check out this week’s menu at   ",
            "length": "23642570",
            "sourceUrl": "http://podtrac.com/pts/redirect.mp3/traffic.libsyn.com/savagelove/savagelove-063020.mp3?dest-id=36185",
            "epNo": "714"
        },
        {
            "title": "Savage Love Episode 713",
            "datePublished": "Tue, 23 Jun 2020 08:00:00 +0000",
            "description": "Thongs! They are so sexy! But when used as a face mask at the hardware store, what then? A woman has been dating a guy for a few months. He has one of those giant penises you have heard about. So there's that. But he is also saying some troubling, racist and sexist things. So. Should she continue to see the big dick with a big dick? On the Magnum, Dan chats with women's health expert Dr. Tami Rowen about the near ubiquitous practice of pubic hair grooming. Why are so many women bush-whacking? Are there any benefits to leaving your \"down there\" hair alone? And, a man (with a lovely Irish accent) wants to have kids with his girlfriend, but doesn't want to live with her. Is there a way to maintain a relationship and co-parent from two separate houses?  ThredUP is the world’s largest online thrift store with over 35,000 brands at up to 90% off retail price. For a limited time, get up to 30% off your first order at . This podcast is brought to you by . Click on the microphone and enter \"Savage\" for postage, a digital scale, and a 4 week trial. The Savage Lovecast is brought to you by Dame Products: a woman-founded sex toy company. Visit  to get $10 off your first order.",
            "length": "24978995",
            "sourceUrl": "http://podtrac.com/pts/redirect.mp3/traffic.libsyn.com/savagelove/savagelove-062320.mp3?dest-id=36185",
            "epNo": "713"
        },
        {
            "title": "Savage Love Episode 712",
            "datePublished": "Tue, 16 Jun 2020 08:00:00 +0000",
            "description": "Oh Jesus Mary and Joseph, our opening sex during quarantine story is scorching hot this week, hoo boy. A woman is working from home with her boyfriend. He sets up his computer monitors with one screen always playing Twtich streams with young blonde hotties. Is the caller allowed to be annoyed by this? On the Magnum, sex toy expert and generally charming person Erika Moen is on to make a bunch of recommendations for gear to get you through these extremely challenging times. Also, what is up with sex dolls? A deep discussion ensues. A woman asked her man to dominate her. He responded \"You suck at doing dishes!!\" That's not what she had in mind. How can she teach him to boss her around sexily? 206-302-2064        voicemail@savagelovecast.com     This episode of the Savage love cast is brought to you by Everlane: Luxury basic clothing and accessories, made at ethical factories without those retail markups. For free shipping, and to support the Lovecast, go to      This episode is brought to you by Squarespace. They make it easy to build a website or blog. Give it a whirl at  and if you want to buy it, use the code Savage for a 10% off your first purchase.     Today’s Lovecast is brought to you by MeUndies.com: High quality, super-comfortable, good looking undies. Get 15% off your first order when you go to .",
            "length": "24312768",
            "sourceUrl": "http://podtrac.com/pts/redirect.mp3/traffic.libsyn.com/savagelove/savagelove-061620.mp3?dest-id=36185",
            "epNo": "712"
        },
        {
            "title": "Savage Love Episode 711",
            "datePublished": "Tue, 09 Jun 2020 08:00:00 +0000",
            "description": "At a business meeting, an older, sophisticated gay man gave a presentation with a couple buttons of his jeans undone. Was he sending a message? If so, what? A woman has noticed that men are now wearing wedding rings on BOTH hands. Are they sending a message? If so, what? On the Magnum, it's a deep anal-sex hygiene dive with gay culture columnist Ty Mitchel. A caller wonders why the younger men he sleeps with have trouble keeping...fresh. Dan and Ty are here to help. And, a woman's roommate is going out and having casual hookups. During these 'Rona times, it puts the whole house at risk. How can she confront him about this? 206-302-2064     voicemail@savagelovecast.com     This episode is brought toy by Tushy- the modern bidet attachment that washes your ass completely. Go to  and get 10% off your order with promo code SAVAGE. Stop wiping and start washing with TUSHY.         This episode of the Savage Lovecast is sponsored by OMGyes.com: a website dedicated to getting scientific truths out about women's sexual pleasure. Savage Lovecast listeners can get a discount if they go to .     This episode is brought to you by Talkspace- online therapy that makes it easy to get extra mental health support. For $100 off your first month, go to T and use the offer code Savage.",
            "length": "25442720",
            "sourceUrl": "http://podtrac.com/pts/redirect.mp3/traffic.libsyn.com/savagelove/savagelove-060920.mp3?dest-id=36185",
            "epNo": "711"
        },
        {
            "title": "Savage Love Episode 710",
            "datePublished": "Tue, 02 Jun 2020 08:00:00 +0000",
            "description": "A remote controlled buttplug? In the bath? This pandemic is getting pretty fun! A woman asks a question that so many of us are also wondering: is it safe to be romantically intimate with someone who has already recovered from covid-19? When? Dan brings on the intrepid Dr. Barak to answer, and as usual hits him with a gnarly second question just to make the good doctor squirm. Are you a parent? Have you had some challenges raising your kids? Is your kid a foot fetishist? If you answered either yes or no to any of these questions, then you're going to want to listen in. And, a man in an open relationship feels empty and sad after he orgasms with anyone but his primary partner. How can he retrain his brain? Tickets to the Savage Lovecast Livestream are at www.savagelovecast.com/events Send your written questions ahead of time to livestream@savagelovecast.com 206-302-2064  voicemail@savagelovecast.com     The Savage Lovecast is brought to you by Dame Products: a woman-founded sex toy company. Visit  to get $10 off your first order.           ThredUP is the world’s largest online thrift store with over 35,000 brands at up to 90% off retail price. For a limited time, get up to 30% off your first order at .     This episode of the Savage love cast is brought to you by Everlane: Luxury basic clothing and accessories, made at ethical factories without those retail markups. For free shipping, and to support the Lovecast, go to",
            "length": "26560134",
            "sourceUrl": "http://podtrac.com/pts/redirect.mp3/traffic.libsyn.com/savagelove/savagelove-060220.mp3?dest-id=36185"
        },
        {
            "title": "Savage Love Episode 709",
            "datePublished": "Tue, 26 May 2020 08:00:00 +0000",
            "description": "A married couple in an open relationship used to enjoy glory holes at play parties. Then along came some covid-19. But did that stop them? Hell no! They grabbed the kids' old sheets and made a home glory hole. Now THAT'S what I'm talking about, America! A man's mother died when he was 13, and his father quickly re-married. He found a letter revealing that his father and step-mother had been having an affair before his mother died. Now what? His dad is sick and old. Should he confront him about it? On the Magnum version of the show, Dan interviews BDSM educator BlakSyn about kink and race play. How can you use words with a history of trauma, in a transformative, consensual way? Is it ever OK to use the word \"slave?\" What about the N-word? And, a 60 year-old man whispers about how he came 7 times the other night. He just wants you to know this.   Now we know. 206-302-2064  voicemail@savagelovecast.com     This episode is brought to you by Squarespace. They make it easy to build a website or blog. Give it a whirl at  and if you want to buy it, use the code Savage for a 10% off your first purchase.     This episode is brought toy by Tushy- the modern bidet attachment that washes your ass completely. Go to  and get 10% off your order with promo code SAVAGE. Stop wiping and start washing with TUSHY. This episode is brought to you by Allform- premium, customizable sofas and chairs shipped right to your door. For 20% off your perfect sofa, go to .",
            "length": "25905610",
            "sourceUrl": "http://podtrac.com/pts/redirect.mp3/traffic.libsyn.com/savagelove/savagelove-052620.mp3?dest-id=36185",
            "epNo": "709"
        },
        {
            "title": "Savage Love Episode 708",
            "datePublished": "Tue, 19 May 2020 08:00:00 +0000",
            "description": "A married man is sick of his military husband being overseas all the time. How can they make their  chronically long-distance relationship work?   Ok, here's something you've all wondered: how do you get rid of sex dolls? Are they too toxic for the landfill? Is there a market for \"gently used?\"   On the Magnum, how are the poly people supposed to do their poly thing, right now? Dan chats with Diana Adams, a lawyer and mediator who specializes in LGBTQ and polyamorous families.   Is there a polite, non-confrontational, and effective way to ask a lover to delete your nudes? You know, before things get bad?   206-302-2064  voicemail@savagelovecast.com       The Savage Lovecast is brought to you by Dame Products: a woman-founded sex toy company. Visit  to check out Eva- the hands-free vibrator.           This episode is brought toy by Tushy- the modern bidet attachment that washes your ass completely. Go to  and get 10% off your order with promo code SAVAGE. Stop wiping and start washing with TUSHY.           This podcast is brought to you by . Click on the microphone and enter \"Savage\" for postage, a digital scale, and a 4 week trial.",
            "length": "25077215",
            "sourceUrl": "http://podtrac.com/pts/redirect.mp3/traffic.libsyn.com/savagelove/savagelove-051920.mp3?dest-id=36185",
            "epNo": "708"
        },
        {
            "title": "Savage Love Episode 707",
            "datePublished": "Tue, 12 May 2020 08:00:00 +0000",
            "description": "We open the show with a marital tale of delicious rug burn. It's the battle of the podcast Goliaths! Dan welcomes Marc Maron to the show, and the two engage in a civil debate about whether porn can be \"addictive.\" Also, they discuss a very special piece of equipment. Some of this convo is on the Micro version and all of it is on the Magnum. He likes to wear womens' clothing when he spanks it. She thinks this makes him queer. He insists he's not. She says he should find a lady who likes that sort of thing. He says he only wants her. These are the kinds of arguments this couple has. A lesbian plans to propose to her girlfriend of 4 years. She wants to throw a giant \"proposal party\" with friends and family from far and wide as a surprise. She was planning on doing this soon. You know, during the pandemic? Will Dan talk her out it? God, let's hope so. 206-302-2064  voicemail@savagelovecast.com ThredUP is the world’s largest online thrift store with over 35,000 brands at up to 90% off retail price. For a limited time, get up to 30% off your first order at .     Today’s Lovecast is brought to you by MeUndies.com: High quality, super-comfortable, good looking undies. Get 15% off your first order when you go to .           This episode is brought to you by Squarespace. They make it easy to build a website or blog. Give it a whirl at  and if you want to buy it, use the code Savage for a 10% off your first purchase.",
            "length": "24871997",
            "sourceUrl": "http://podtrac.com/pts/redirect.mp3/traffic.libsyn.com/savagelove/savagelove-051220.mp3?dest-id=36185",
            "epNo": "707"
        },
        {
            "title": "Savage Love Episode 706",
            "datePublished": "Tue, 05 May 2020 08:00:00 +0000",
            "description": "Have you ever done it hanging from a cliff in your mountain-climbing harness? This caller has. They named the climb \"Quarantine.\" Meanwhile in Italy, a woman managed to slip a finger in her boyfriend's butt. He didn't stop her, but didn't say anything about it, and they haven't discussed it since. How can she bring it up with him and resume this activity when they are reunited? On the Magnum, Dan chats with JoEllen Notte, author of \"The Monster Under the Bed: Sex, Depression, and the Conversations We Aren't Having\" about being an introvert during the pandemic, and how it IS possible to be both horny and depressed. A woman is dating a man who cares about his appearance, is capable of crying and makes her breakfast. IS HE GAY? 206-302-2064   voicemail@savagelovecast.com This episode of the Savage Lovecast is sponsored by OMGyes.com: a website dedicated to getting scientific truths out about women's sexual pleasure. Savage Lovecast listeners can get a discount if they go to OMGYES.com/Savage. This episode is brought to you by Pill Club: the birth control subscription that is delivered right to your door. Get a special care package with your first delivery. Go to www.thepillclub.com/Savage     This episode is brought to you by Helix Sleep-the best mattress for your individualized comfort. Right now, get up to $200 off ALL mattress orders at HelixSleep.com/SAVAGE.      ",
            "length": "24595099",
            "sourceUrl": "http://podtrac.com/pts/redirect.mp3/traffic.libsyn.com/savagelove/savagelove-050520.mp3?dest-id=36185",
            "epNo": "706"
        },
        {
            "title": "Savage Love Episode 705",
            "datePublished": "Tue, 28 Apr 2020 08:00:00 +0000",
            "description": "Hear the tale of the garden wanker, or \"What Really Happens in the Asparagus Patch.\" Dr. Bummer is back! Our epidemiologist pal Dr. Daniel Westreich has returned to talk about the state of the pandemic, how the physical distancing is working, and to mull over the possibility that this could be an opportunity to eliminate ALL STIs. We can dream. On the Magnum, Dan chats with Katelyn Bowden, founder of the BadAss Army- a group that fights for victims of revenge porn. And, we end with a heartwarming coming-out story from a woman who recorded a video for her family and sent it out via group chat. Their response...may shock you. Remember: Not everyone is totally awful.  206-302-2064  voicemail@savagelovecast.com       This podcast is brought to you by . Click on the microphone and enter \"Savage\" for postage, a digital scale, and a 4 week trial.           This episode of the Savage Lovecast is sponsored by OMGyes.com: a website dedicated to getting scientific truths out about women's sexual pleasure. Savage Lovecast listeners can get a discount if they go to .           This episode is brought to you by Talkspace- online therapy that makes it easy to get extra mental health support. For $100 off your first month, go to  and use the offer code Savage.",
            "length": "26284490",
            "sourceUrl": "http://podtrac.com/pts/redirect.mp3/traffic.libsyn.com/savagelove/savagelove-042820.mp3?dest-id=36185",
            "epNo": "705"
        },
        {
            "title": "Savage Love Episode 704",
            "datePublished": "Tue, 21 Apr 2020 08:00:00 +0000",
            "description": "This pandemic is getting sexier and sexier! Who's up for some Strip Ping-Pong? A gay man hooked up with a dude he had met a few months ago through an app. The dude asked our caller if he found him attractive. But the dude's photo was wildly inaccurate. He had gained weight since the photo was taken. When the caller tried to tactfully explain this, dude went ballistic, accusing him of being fat-phobic. Judge Savage issues his ruling. On the Magnum...let's get a lawyer! The pandemic will be mighty good for the lawyering business apparently. Dan brings on divorce attorney Lori Lopez Guzzo to give some free advice to a woman whose husband wants a divorce after encouraging her to quit her job. Her advice? Lawyer up and take him down. And, a woman had broken up with her boyfriend. But now that she is locked down and lonely, she just wanted to be \"held and cuddled.\" Is it ok to invite him back into her life...temporarily? Ok, enough with the Covid-19 calls already! Send us some non-covid related queries and we'll run a virus-free show, we swear! 206-302-2064   voicemail@savagelovecast.com This episode of the Savage Lovecast is brought to you by Blue Apron. Check out this week’s menu at      This episode is brought to you by Doordash. Get breakfast, lunch, dinner and more delivered from your favorite restaurants right to your doorstep with one easy click. Get $5 off your first order of $15 or more when you download the DoorDash app and enter promo code SAVAGE.     ThredUP is the world’s largest online thrift store with over 35,000 brands at up to 90% off retail price. For a limited time, get up to 30% off your first order at .  ",
            "length": "26348856",
            "sourceUrl": "http://podtrac.com/pts/redirect.mp3/traffic.libsyn.com/savagelove/savagelove-042120.mp3?dest-id=36185",
            "epNo": "704"
        },
        {
            "title": "Savage Love Episode 703",
            "datePublished": "Tue, 14 Apr 2020 08:00:00 +0000",
            "description": "We open with a quarantine sex story, in which a woman's boyfriend pulls on one of her dresses, and things get even better from there. A woman in a poly relationship knows she has to end things soon with her primary partner. So, naturally, she started sleeping with her roommate. Is it time to pull the plug? During these terrible times? How? At long last, it's the guest we've all been waiting for. Feminist comedic genius Erin Gibson, co-host of the Throwing Shade podcast and author of Feminasty: The Complicated Woman’s Guide to Surviving the Patriarchy without Drinking Herself to Death is on to answer some questions, and keep us all company in quarantine. A NYC sex worker who specializes in latex, wonders if it would be safe for her to keep seeing clients in person if she wore a high quality gas mask. 206-302-2064   voicemail@savagelovecast.com Thanks to Theragun for supporting the Savage Lovecast. Theragun is the handheld percussive therapy device that releases your deepest muscle tension using a scientifically-calibrated combination of depth, speed, and power. For a limited time, Lovecast listeners get up to $150 off your device. Check it out at . This episode is brought to you by Squarespace. They make it easy to build a website or blog. Give it a whirl at  and if you want to buy it, use the code Savage for a 10% off your first purchase.     This episode is brought to you by Pill Club: the birth control subscription that is delivered right to your door. Get a special care package with your first delivery. Go to .",
            "length": "23909019",
            "sourceUrl": "http://podtrac.com/pts/redirect.mp3/traffic.libsyn.com/savagelove/savagelove-041420.mp3?dest-id=36185",
            "epNo": "703"
        },
        {
            "title": "Savage Love Episode 702",
            "datePublished": "Tue, 07 Apr 2020 08:00:00 +0000",
            "description": "We open the show with a quarantine sex story featuring some very mysterious noises... Have no fear, Doc Barak is here! Dan brings on our long-suffering medical expert to reassure us about how covid-19 can and cannot be transmitted. The good doctor's giggle is, dare we say...infectious. On the Magnum, Dan interviews comedian and podcast host Pete Dominick to help him answer some questions from the hard-to-find straight male perspective. And, after a one night stand, a woman and her lover are still communicating. They had planned to meet in Moscow for a second date, but then the pandemic happened. Is she falling in love? Is it just the stress? Should she tell him? 206-302-2064  voicemail@savagelovecast.com This episode is brought to you by Helix Sleep-the best mattress for your individualized comfort. Right now, get up to $200 off ALL mattress orders at .     Thanks to Roman for supporting Savage Lovecast. Roman is a men’s health company that offers remote online diagnosis for ED and convenient monthly delivery of medication. For a free online, visit      Today’s Lovecast is brought to you by MeUndies.com: High quality, super-comfortable, good looking undies. Get 15% off your first order when you go to .",
            "length": "24027929",
            "sourceUrl": "http://podtrac.com/pts/redirect.mp3/traffic.libsyn.com/savagelove/savagelove-040720.mp3?dest-id=36185",
            "epNo": "702"
        },
        {
            "title": "Savage Love Episode 701",
            "datePublished": "Tue, 31 Mar 2020 08:00:00 +0000",
            "description": "Just when you thought you understood the world, Dan chats with open relationships guru Tristan Taormino, to tell you to CLOSE IT UP. Monogamy is where it's at these days. Just for a while. A woman in a long distance relationship is trying to embrace video sex. But she worries that she doesn't look sexy when she's truly pleasuring herself. How can she learn to do the \"performance\" of video sex, and still get off? On the Magnum, Dan calls up Searah Deysach from the feminist sex-toy store Early to Bed, to talk about \"sleeves.\" What are they? What are those bumps? Where can I get me one? And, a lesbian decided not to respond to a trans woman on a dating app. Does this make her a transphobic monster? 206-302-2064  voicemail@savagelovecast.com     This podcast is brought to you by . Click on the microphone and enter \"Savage\" for postage, a digital scale, and a 4 week trial.     This episode is brought to you by Doordash. Get breakfast, lunch, dinner and more delivered from your favorite restaurants right to your doorstep with one easy click. Get $5 off your first order of $15 or more when you download the DoorDash app and enter promo code SAVAGE. ThredUP is the world’s largest online thrift store with over 35,000 brands at up to 90% off retail price. For a limited time, get up to 30% off your first order at .",
            "length": "26011981",
            "sourceUrl": "http://podtrac.com/pts/redirect.mp3/traffic.libsyn.com/savagelove/savagelove-033120.mp3?dest-id=36185",
            "epNo": "701"
        },
        {
            "title": "Savage Love Episode 700",
            "datePublished": "Tue, 24 Mar 2020 08:00:00 +0000",
            "description": "This week, Dan's guest is epidemiologist Daniel Westreich, who spells out the concept of physical distancing, and why sexual intimacy is going to be pretty difficult to attain for many of us. Some of the conversation is on the Micro, and all of it is on the Magnum. A man asks if virtual reality porn makes sense to help \"spice up your sex life.\" Why yes, it makes  A LOT of sense right now. A woman who is engaged to be married to her boyfriend has a female friend. This friend made a drunken, predatory pass at her. Can/should she forgive and try to salvage the friendship? And, saddle up for this weird ride: A man is married to his wife. Cool, cool. They have an open relationship. No prob. She has a boyfriend. Nice. She lives with her boyfriend. Ok? He is not allowed to seek outside partners. Wait-  what?  Also, his wife's boyfriend forbids her from having sex with the caller, her husband. Soooooo. The caller needs a little chat from Dan Savage. Ring ring! 206-302-2064  voicemail@savagelovecast.com This episode of the Savage Lovecast is brought to you by Blue Apron. Check out this week’s menu at      This episode of the Savage Lovecast is sponsored by OMGyes.com: a website dedicated to getting scientific truths out about women's sexual pleasure. Savage Lovecast listeners can get a discount if they go to .     This episode is brought to you by Talkspace- online therapy that makes it easy to get extra mental health support. For $100 off your first month, go to  and use the offer code Savage.",
            "length": "23576115",
            "sourceUrl": "http://podtrac.com/pts/redirect.mp3/traffic.libsyn.com/savagelove/savagelove-032420.mp3?dest-id=36185",
            "epNo": "700"
        },
        {
            "title": "Savage Love Episode 699",
            "datePublished": "Tue, 17 Mar 2020 08:00:00 +0000",
            "description": "Here at Savage Lovecast world headquarters, in the heart of the epicenter of the Big Sick, we are keeping calm and carrying on, baby! Dan chats with Dr. Jen Gunter, who had to practice social distancing for ONE YEAR, so quit griping. She offers some strategies for how to deal with your new isolation. And, Dr.Debby Herbenick explains that although the corona virus is not sexually transmitted, you still can't just be mashing with anyone safely these days. Uh doy! Hear the tale of Maya, stuck in Spain and wondering if her relationship is mature enough to endure the rigors of quarantine. And, taking a breather, (as it were) from all this virus talk, Dan speaks with Brian Earp,  author of Love Drugs: The Chemical Future of Relationships. The tech-savvy at-risk youth are poised to accept this chemical future. 206-302-2064  voicemail@savagelovecast.com This episode of the Savage love cast is brought to you by Everlane: Luxury basic clothing and accessories, made at ethical factories without those retail markups. For free shipping, and to support the Lovecast, go to  This episode is brought to you by Squarespace. They make it easy to build a website or blog. Give it a whirl at  and if you want to buy it, use the code Savage for a 10% off your first purchase. This episode of the Savage Lovecast is sponsored by OMGyes.com: a website dedicated to getting scientific truths out about women's sexual pleasure. Savage Lovecast listeners can get a discount if they go to .",
            "length": "29717816",
            "sourceUrl": "http://podtrac.com/pts/redirect.mp3/traffic.libsyn.com/savagelove/savagelove-031620.mp3?dest-id=36185",
            "epNo": "699"
        },
        {
            "title": "Savage Love Episode 698",
            "datePublished": "Tue, 10 Mar 2020 08:00:00 +0000",
            "description": "Sometimes people call us when they're drunk. Sometimes they call us about their dogs. Welcome to the center of this Venn diagram.  A woman has been invited to a \"costume wedding.\" She will be required to dress up like a character in a movie. Is this asking too much? On the Magnum version of the show, it's a super-weird \"What You Got?\" with an evolutionary reproductive biologist who mulls over the *possibility* that the animal kingdom is teeming with same-sex behavior. Not just the homo penguins. And, a young woman is turned on by much older men. How can she score a silver fox without looking like gold digger? 206-302-2064   voicemail@savagelovecast.com Thanks to Roman for supporting Savage Lovecast. Roman is a men’s health company that offers remote online diagnosis for ED and convenient monthly delivery of medication. For a free online, visit  This episode is brought to you by Doordash. Get breakfast, lunch, dinner and more delivered from your favorite restaurants right to your doorstep with one easy click. Get $5 off your first order of $15 or more when you download the DoorDash app and enter promo code SAVAGE. ThredUP is the world’s largest online thrift store with over 35,000 brands at up to 90% off retail price. For a limited time, get up to 30% off your first order at .",
            "length": "22965476",
            "sourceUrl": "http://podtrac.com/pts/redirect.mp3/traffic.libsyn.com/savagelove/savagelove-031020.mp3?dest-id=36185",
            "epNo": "698"
        },
        {
            "title": "Savage Love Episode 697",
            "datePublished": "Tue, 03 Mar 2020 09:00:00 +0000",
            "description": "A gay man was hooking up at a bathhouse. His brand new lover wanted to bring a little romance into the encounter by saying the caller's name and complimenting him. The caller was horrified. Isn't bathhouse sex supposed to be anonymous? Meanwhile, in another corner of our universe, a woman is appalled that her boyfriend closes his eyes when they're having sex. How can she get him to gaze deeply into her soul while pounding her real good? On the Magnum version of the show, Dan chats with stand-up comedian, and podcaster Cameron Esposito about her new book: Save Yourself, and how queerness and the experience of being closeted impacts her comedy. Finally, a married man with a one year-old child bemoans the quality of the \"service sex\" he's getting these days. With he ever see the return of enthusiastic rutting? 206-302-2064   voicemail@savagelovecast.com This episode is brought to you by Squarespace. They make it easy to build a website or blog. Give it a whirl at  and if you want to buy it, use the code Savage for a 10% off your first purchase. This episode is brought toy by Tushy- the modern bidet attachment that washes your ass completely. Go to  and get 10% off your order with promo code SAVAGE. Stop wiping and start washing with TUSHY. Today’s Lovecast is brought to you by MeUndies.com: High quality, super-comfortable, good looking undies. Get 15% off your first order when you go to .",
            "length": "22375318",
            "sourceUrl": "http://podtrac.com/pts/redirect.mp3/traffic.libsyn.com/savagelove/savagelove-030320.mp3?dest-id=36185",
            "epNo": "697"
        },
        {
            "title": "Savage Love Episode 696",
            "datePublished": "Tue, 25 Feb 2020 09:00:00 +0000",
            "description": "A straight man was dating a woman, and it felt great. Until she gave him the \"I'm not ready for a relationship\" line. Is this always a lie? What does it mean? Dan spells it out, with no sugar on top. A man is worried about his new girlfriend. You see, she has never had penetrative sex. Is he special enough to be her first? On the Micro and more on the Magnum, Dan chats with weed journalist (now there's a sweet job if ever we've heard of one,) Lester Black. They talk about a woman whose smart husband turns into a drooling dullard whilst blazed, smoking when you're pregnant, and the effects of marijuana on dick size. Can you resist this show? No, you cannot. A man on the frozen tundra hasn't had sex in 3 years because he claims to be a grower, not a shower. Women reject him because of his dick size (he thinks) and then reject him further when he fails to eat them out properly. But he wants to learn! He asks his female friends if he can practice on them, but strangely, they all say \"no.\" Just...no. 206-302-2064   voicemail@savagelovecast.com   This episode is brought to you by Harry's- they make the best razors you will ever shave with. New customers get $5 off a trial set at .     This episode is brought to you by Helix Sleep-the best mattress for your individualized comfort. Right now, get up to $200 off ALL mattress orders at .         This episode of the Savage love cast is brought to you by Everlane: Luxury basic clothing and accessories, made at ethical factories without those retail markups. For free shipping, and to support the Lovecast, go to       ",
            "length": "24337009",
            "sourceUrl": "http://podtrac.com/pts/redirect.mp3/traffic.libsyn.com/savagelove/savagelove-022520.mp3?dest-id=36185",
            "epNo": "696"
        },
        {
            "title": "Savage Love Episode 695",
            "datePublished": "Tue, 18 Feb 2020 09:00:00 +0000",
            "description": "A man is going through a divorce from his wife of 7 years. Although their breakup was peaceful, now her communication is curt and unfriendly. Is he entitled to feel angry about her unwarranted coldness? A man kindly lent a friend some money. Now she keeps asking him for more and more every month! Should he just set her up with a regular payment, or cut off the friendship? On the Micro and the Magnum version of the show, Dan chats with Dr. Wednesday Martin, author of Untrue, about women's libido, how it really works, and how our culture's misunderstanding harms relationships. A group of folks were disparaging \"outie vaginas\" at a party. One of the women there got awfully quiet. Did they offend her? Is this the equivalent of making fun of itsy-bitsy, teeny-tiny penises? 206-302-2064   voicemail@savagelovecast.com This episode is brought to you by Talkspace- online therapy that makes it easy to get extra mental health support. For $100 off your first month, go to  and use the offer code Savage. ThredUP is the world’s largest online thrift store with over 35,000 brands at up to 90% off retail price. For a limited time, get up to 30% off your first order at . This episode is brought to you by Doordash. Get breakfast, lunch, dinner and more delivered from your favorite restaurants right to your doorstep with one easy click. Get $5 off your first order of $15 or more when you download the DoorDash app and enter promo code SAVAGE.",
            "length": "25030195",
            "sourceUrl": "http://podtrac.com/pts/redirect.mp3/traffic.libsyn.com/savagelove/savagelove-021820.mp3?dest-id=36185",
            "epNo": "695"
        },
        {
            "title": "Savage Love Episode 694",
            "datePublished": "Tue, 11 Feb 2020 09:00:00 +0000",
            "description": "A young man has been dating a woman for a short time. She seems great...except. Except she is anti-abortion, and anti-gay in a lazy, not very heartfelt sort of way. Can he use his sex powers to change her feeble mind? Meanwhile, a woman is dating a guy also for a short time. He told her that if he got her pregnant, he would insist that she keep the child instead of have an abortion. Should she, maybe, dump him immediately? On the Magnum, Dan chats with the writer Jillian Keenan about spanking: It's for grown-ups only please. They discuss the origins of a spanking fetish and whether corporal punishment as a child seeps into an adult's erotic imagination. A married man with a religious upbringing feels shame and guilt about masturbating. His wife contributes to this mindset. His marriage is sexless and even his urologist agrees that he needs to ejaculate already. How can he learn to wank with pride?   Shame and guilt. Keeping us in business since 2006. 206-302-2064  or  This episode is brought to you by Calm, the #1 app for sleep and relaxation. For a limited time get 25% off a Calm Premium subscription at .     Thanks to Roman for supporting Savage Lovecast. Roman is a men’s health company that offers remote online diagnosis for ED and convenient monthly delivery of medication. For a free online, visit      This episode is brought to you by . Get 50% off just about any item, plus free shipping when you enter the offer code \"Savage\".",
            "length": "23393466",
            "sourceUrl": "http://podtrac.com/pts/redirect.mp3/traffic.libsyn.com/savagelove/savagelove-021120.mp3?dest-id=36185",
            "epNo": "694"
        },
        {
            "title": "Savage Love Episode 693",
            "datePublished": "Tue, 04 Feb 2020 09:00:00 +0000",
            "description": "A woman is hoping to find a monogamous partner who is also kinky. But when she puts the word \"kinky\" in her profile she gets flooded with ridiculous pervs. How can she filter out the clueless horndogs? Hear the very unpleasant tale of a gay couple who venture to an older man's apartment for a hook-up, only to find there were many more men there than promised. Why was this gentleman so dishonest? Aren't older men supposed to be supportive mentors for up and coming young 'mos? On the Magnum, Dan speaks with super-duper smart writer Peggy Orenstein, (author of Girls and Sex) about her new book- Boys and Sex. She and Dan discuss how boys both suffer from and then perpetuate the culture of toxic masculinity. If you have a kid with a penis, you should listen to this one. A man is ordained to marry people through one of those mail-in certificates. His sister has asked him to perform her marriage ceremony. But her fiancé is a lying, coke addled, no-good drunk! How can he bless this mess? 206-302-2064  or voicemail@savagelovecast.com     The Savage Lovecast is brought to you by Dame Products: a woman-founded sex toy company. Visit  to check out Eva- the hands-freevibrator.     This episode is brought to you by Squarespace. They make it easy to build a website or blog. Give it a whirl at  and if you want to buy it, use the code Savage for a 10% off your first purchase. This episode is brought to you by . Get 50% off just about any item, plus free shipping when you enter the offer code \"Savage\".",
            "length": "22529963",
            "sourceUrl": "http://podtrac.com/pts/redirect.mp3/traffic.libsyn.com/savagelove/savagelove-020420.mp3?dest-id=36185",
            "epNo": "693"
        },
        {
            "title": "Savage Love Episode 692",
            "datePublished": "Tue, 28 Jan 2020 09:00:00 +0000",
            "description": "Have you ever experienced conflict during a family vacation? The first call on this show might put it all in perspective for you. A protective big sister can't stand that her 17 year-old sis is dating a 21 year-old man. Their parents don't mind. Should big sister give the guy a chance, or is the age difference unacceptable? On the Magnum, Dan chats with Dr. Elizabeth Sheff from Psychology Today about raising children within a polyamorous household. And finally, a woman is considering becoming a fin-dom, with the power to financially ruin her client. But she doesn't want to ruin anyone. Is there a way to ethically do this? 206-302-2064    voicemail@savagelovecast.com The Savage Lovecast is brought to you by Dame Products: a woman-founded sex toy company. Visit  to check out Eva- the hands-free vibrator.     Today’s Lovecast is brought to you by MeUndies.com: High quality, super-comfortable, good looking undies. Get 15% off your first order when you go to .       This episode is brought to you by . Get 50% off just about any item, plus free shipping when you enter the offer code \"Savage\".",
            "length": "24693738",
            "sourceUrl": "http://podtrac.com/pts/redirect.mp3/traffic.libsyn.com/savagelove/savagelove-012820.mp3?dest-id=36185",
            "epNo": "692"
        },
        {
            "title": "Savage Love Episode 691",
            "datePublished": "Tue, 21 Jan 2020 09:00:00 +0000",
            "description": "Scootch closer, ya'll. It's Bible study with Dan Savage. On with the show: A happily single woman finally broke down after pressure from her friend to have some sex. Against her misgivings, he convinced her to pursue a relationship, promising that if it didn't work out, they could go back to being friends, easy-peasy. Guess what! Now that she wants to break it off, he can't deal with being just friends AND they are starting a business together. Please take heed to this cautionary tale. A pregnant woman can't stand the consistency of her husband's thick, slimy spit. If he drinks more water, will it change? Can she demand he do so?   On the Magnum, Dan speaks with writer Michal Daveed about hypno-kink. You know, erotic hypnosis? She explains how god damn sexy it can be, and dispels some myths too.   And, hear a most UNwholesome tale about what goes down under the mistletoe. Seriously, that whole mistletoe thing has always been a recipe for disaster, don't you think? 206-302-2064   voicemail@savagelovecast.com This episode is brought to you by Squarespace. They make it easy to build a website or blog. Give it a whirl at  and if you want to buy it, use the code Savage for a 10% off your first purchase. ThredUP is the world’s largest online thrift store with over 35,000 brands at up to 90% off retail price. For a limited time, get up to 30% off your first order at . This episode is brought to you by Calm, the #1 app for sleep and relaxation. For a limited time get 25% off a Calm Premium subscription at .",
            "length": "23385943",
            "sourceUrl": "http://podtrac.com/pts/redirect.mp3/traffic.libsyn.com/savagelove/savagelove-012120.mp3?dest-id=36185",
            "epNo": "691"
        },
        {
            "title": "Savage Love Episode 690",
            "datePublished": "Tue, 14 Jan 2020 09:00:00 +0000",
            "description": "Hand-wringing women, am I right? First we have a lady who feels guilty about masturbating at night when her partner is snoring next to her. And another woman feels guilty about \"objectifying\" her new cross-dressing boyfriend. Is it wrong to be attracted to him in his female garb? On the Magnum version of the show, Dan chats with John Moe, from the Hilarious World of Depression podcast about being a depressed person, or dating one. And, if you dare, hear all about the disturbing things a woman found in her husband's workshop including greasy rubber gloves, feces-stained towels, empty wine bottles and underpants with holes cut out of them. Good lord, this call. 206-302-2064. Or email it to voicemail@savagelovecast.com     This episode is brought to you by Helix Sleep-the best mattress for your individualized comfort. Right now, get up to $200 off ALL mattress orders at .         This episode is brought to you by Talkspace- online therapy that makes it easy to get extra mental health support. For $100 off your first month, go to  and use the offer code Savage.         This episode of the Savage love cast is brought to you by Everlane: Luxury basic clothing and accessories, made at ethical factories without those retail markups. For free shipping, and to support the Lovecast, go to       ",
            "length": "23528676",
            "sourceUrl": "http://podtrac.com/pts/redirect.mp3/traffic.libsyn.com/savagelove/savagelove-011420.mp3?dest-id=36185",
            "epNo": "690"
        },
        {
            "title": "Savage Love Episode 689",
            "datePublished": "Tue, 07 Jan 2020 09:00:00 +0000",
            "description": "Why, oh why (bemoans this woman,) is it that the indie, cool, female-owned sex stores never carry dildos that are big enough for her? WHY?! A gay man has been invited to be the man of honor at his sister's wedding. But you know what's weird? The sister is marrying a racist, anti-gay creep who has convinced her that the caller (and all gay people) are degenerates. So. Should our caller carry out his man of honor duties nonetheless? On the Magnum version of the show, Dan chats with Michael Hobbes, co-host of the \"You're Wrong About\" podcast, about the misinformation swirling around the concept of human trafficking. And a 20 year-old woman is dating an older man. He wants to have kids one day. She is nowhere near considering such a thing. But when they have sex, she gets turned on by talking about getting knocked up. Is it unethical to engage in pregnancy dirty talk with a man who wants to be a dad? This episode is brought to you by Doordash. Get breakfast, lunch, dinner and more delivered from your favorite restaurants right to your doorstep with one easy click. Get $5 off your first order of $15 or more when you download the DoorDash app and enter promo code SAVAGE. Thanks to Roman for supporting Savage Lovecast. Roman is a men’s health company that offers remote online diagnosis for ED and convenient monthly delivery of medication. For a free online, visit  This episode is brought to you by Squarespace. They make it easy to build a website or blog. Give it a whirl at  and if you want to buy it, use the code Savage for a 10% off your first purchase.",
            "length": "23968369",
            "sourceUrl": "http://podtrac.com/pts/redirect.mp3/traffic.libsyn.com/savagelove/savagelove-010720.mp3?dest-id=36185",
            "epNo": "689"
        },
        {
            "title": "Savage Love Episode 688",
            "datePublished": "Tue, 31 Dec 2019 09:00:00 +0000",
            "description": "It's kind of the bad actors show. A biting biter bit her boyfriend and drew blood. He didn't like it, so she calls him a baby. A dude wonders if can catch a contact high from sleeping with someone who is on meth. A man is miffed because a couple who came to the wedding didn't sent them a gift. Dan sternly chastises them all. People! It's 2020! Behave yourselves! On the Magnum, Dan interviews journalist L.V. Anderson about the history of herpes hysteria. And, vampire porn: How popular is it? Let's have some stats. This episode of the Savage Lovecast is sponsored by OMGyes.com: a website dedicated to getting scientific truths out about women's sexual pleasure. Savage Lovecast listeners can get a discount if they go to . ThredUP is the world’s largest online thrift store with over 35,000 brands at up to 90% off retail price. For a limited time, get up to 30% off your first order at  This episode is brought to you by Calm, the #1 app for sleep and relaxation. For a limited time get 25% off a Calm Premium subscription at .",
            "length": "22860777",
            "sourceUrl": "http://podtrac.com/pts/redirect.mp3/traffic.libsyn.com/savagelove/savagelove-123119.mp3?dest-id=36185",
            "epNo": "688"
        },
        {
            "title": "Savage Lovecast #687",
            "datePublished": "Tue, 24 Dec 2019 09:00:00 +0000",
            "description": "A formerly repressed man is discovering his wild side. He and his wife like to do it in quasi-public in the mountains. He just got her a remote controlled vibrator, and wants to see if he can get her off in a restaurant. But is this ethical? Will people notice? Dan interviews the co-author of a study that finds that women tend to trust gay male shopkeepers over women shopkeepers. They theorize that women find another woman selling beauty products and clothes can't be trusted because their reptile brains tell them they in competition for mates. So that's depressing... Merry Christmas! An 18 year-old woman has started seeing a 21 year-old guy who claimed he was celibate, but sure doesn't act like it. She thinks he's lying to himself and her. She just wants to bone him already. Should she put him out of his celibate misery? And finally, did ya'll know they sell octopus at Costco? This episode of the Savage Lovecast is sponsored by : a website dedicated to getting scientific truths out about women's sexual pleasure. Savage Lovecast listeners can get a discount if they go to OMGYES.com/Savage.     This episode is brought to you by Squarespace. They make it easy to build a website or blog. Give it a whirl at  and if you want to buy it, use the code Savage for a 10% off your first purchase.     This episode of the Savage Lovecast is brought to you by Blue Apron. Check out this week’s menu and get $60 off at",
            "length": "22802890",
            "sourceUrl": "http://podtrac.com/pts/redirect.mp3/traffic.libsyn.com/savagelove/savagelove-122419.mp3?dest-id=36185",
            "epNo": "687"
        },
        {
            "title": "Savage Love Episode 686",
            "datePublished": "Tue, 17 Dec 2019 09:00:00 +0000",
            "description": "The show begins with an insecurity vampire. You know the kind. A person who sucks you dry with their endless need for praise and reassurance. This man is dating one, but is she entirely to blame? It's complicated. And, it's a wedding battle royale! In one corner we have our caller getting married to a man who has a child by a previous marriage- living out of town. In the other corner is the fiancé's mother, who wants to minimize contact between the kid and the caller. Whose side are you on? Grab some popcorn and listen in. On the Magnum, Santa's rollin' up! What's he got this time? Well, if he listens to resident sex toy expert Erika Moen (and he does,) out tumbles a massive cache of marital aids, including a cock sleeve that spins! A bullet vibe! A dual density dildo! \"Sex in a Can! \" And a Sex Machine. Like an actual machine. Not Santa himself. Is it January yet? And finally, a lesbian is in a stable, joyful, poly relationship. But she is grappling with a new partner in the scene, who has a medical condition that causes her to burp and fart ALL THE TIME. It's driving the caller bonkers. She considers this a real torment. We consider it podcast gold. 206-302-2064 voicemail@savagelovecast.com This episode of the Savage love cast is brought to you by Everlane: Luxury basic clothing and accessories, made at ethical factories without those retail markups. For free shipping, and to support the Lovecast, go to  This episode is brought to you by Doordash. Get breakfast, lunch, dinner and more delivered from your favorite restaurants right to your doorstep with one easy click. Get $5 off your first order of $15 or more when you download the DoorDash app and enter promo code SAVAGE.     Thanks to  for supporting Savage Lovecast. Native makes safe, simple, effective products that people use in the bathroom everyday with trusted ingredients and trusted performance. For 20% off your first purchase, visit nativedeodorant.com and enter promo code \"Savage\" during checkout.        ",
            "length": "24192186",
            "sourceUrl": "http://podtrac.com/pts/redirect.mp3/traffic.libsyn.com/savagelove/savagelove-121719.mp3?dest-id=36185",
            "epNo": "686"
        },
        {
            "title": "Savage Love Episode 685",
            "datePublished": "Tue, 10 Dec 2019 09:00:00 +0000",
            "description": "Hot tubs. Are they a safe, relaxing haven or a menacing vector of disease? Here's a poly peril. What do you do when you really, really don't like your boyfriend's other boyfriend? On the Magnum, all of your chastity cage questions are answered, including \"Chastity cages? What are you even talking about?\" Dr. Ashley Winter is a urologist, sexual medicine specialist and the co-host of \"The Full Release Podcast.\" She knows her stuff. And, when your wife wants to go to the Amazon to hunt for psychedelic drugs with a former lover, how do you deal with all the...feelings? 206-302-2064 voicemail@savagelovecast.com This episode is brought to you by Talkspace- online therapy that makes it easy to get extra mental health support. For $100 off your first month, go to  and use the offer code Savage.     ThredUP is the world’s largest online thrift store with over 35,000 brands at up to 90% off retail price. For a limited time, get up to 30% off your first order at .     This episode is sponsored by Honey- the free browser extension that scans the web for coupon codes and discounts while you shop online. Get Honey for FREE and save some money.",
            "length": "24574801",
            "sourceUrl": "http://podtrac.com/pts/redirect.mp3/traffic.libsyn.com/savagelove/savagelove-121019.mp3?dest-id=36185",
            "epNo": "685"
        },
        {
            "title": "Savage Love Episode 684",
            "datePublished": "Tue, 03 Dec 2019 09:00:00 +0000",
            "description": "A man went on a date and he felt fireworks. But later that she told him that wasn't feeling it, but wants to be friends. He doesn't need friends. He already has friends. Should he bother? This question is pretty simple. Her new lover has a gargantuan penis that is shaped like a sweet potato. How on earth is she supposed to accommodate him? On the Magnum version of the show, meet the woman who read every single one of Dan's newspaper columns since he started writing them in 1991. You could say she is a sex expert expert. She has some wisdom to share. And, a kinkster living in a repressed Asian country has a masochistic friend who asked him to arrange a very dangerous scene for her. How can he set this up and also keep her safe? OH, the Danger! 206-302-2064 voicemail@savagelovecast.com Thanks to Roman for supporting Savage Lovecast. Roman is a men’s health company that offers remote online diagnosis for ED and convenient monthly delivery of medication. For a free online, visit  This episode is brought to you by Pill Club: the birth control subscription that is delivered right to your door. Get a special care package with your first delivery. Go to . Today’s Lovecast is brought to you by MeUndies.com: High quality, super-comfortable, good looking undies. Get 15% off your first order when you go to .",
            "length": "25553062",
            "sourceUrl": "http://podtrac.com/pts/redirect.mp3/traffic.libsyn.com/savagelove/savagelove-120319.mp3?dest-id=36185",
            "epNo": "684"
        },
        {
            "title": "Savage Love Episode 683",
            "datePublished": "Tue, 26 Nov 2019 09:00:00 +0000",
            "description": "A man is getting re-married. Is it shoddy to use the same officiant as his first wedding? Dan talks to a woman who had a blurry encounter with another woman as a very sexually repressed Christian school. Her lover called it rape the next day. It's been ten years, and in this #MeToo era, the caller wonders if she should find the woman and apologize. On the Magnum, a biseuxal woman wonders how she can reconcile being shy and also explore her sexually dominant side. Dan brings the wonderful Midori, wholeads the ForteFemme Women's Dominance Intensive. She knows her stuff, and will surely help churn out an army of joyfully dominant women. Also, Dan issues a tutorial on how to talk dirty without being vulgar. Ok Miss Manners...206-302-2064     This podcast is brought to you by . Click on the microphone and enter \"Savage\" for postage, a digital scale, and a 4 week trial.         This episode of the Savage love cast is brought to you by Everlane: Luxury basic clothing and accessories, made at ethical factories without those retail markups. For free shipping, and to support the Lovecast, go to      This episode is brought to you by Squarespace. They make it easy to build a website or blog. Give it a whirl at  and if you want to buy it, use the code Savage for a 10% off your first purchase.",
            "length": "24764582",
            "sourceUrl": "http://podtrac.com/pts/redirect.mp3/traffic.libsyn.com/savagelove/savagelove-112619.mp3?dest-id=36185",
            "epNo": "683"
        },
        {
            "title": "Savage Love Episode 682",
            "datePublished": "Tue, 19 Nov 2019 09:00:00 +0000",
            "description": "A woman is concerned about her friend. Why? Well, for one, she is in a 24/7 dom/sub relationship with an abusive ex-con. They have kids, and the friend is open with them about the nature of her marriage. Is it possible to explain in a healthy way that mommy is actually a slave? We've been getting a lot of calls just like this one lately: a woman has a crush on her bandmate. He's married and it would ruin everything. But still...(You musicians are HORNY.) On the Magnum, sure, gender reveal parties are unnecessary and annoying, but did you know that they have become...DEADLY? Emma Gray from HuffPost is on to discuss why gender reveal parties suck, basically.   And, after 12 years, a woman finally got out of the toxic relationship with the father of her child. She's free! But, he still begs her to have sex, and they had great sex. Should she take him up on it? What do you think? 206-302-2064 voicemail@savagelovecast.com     This episode is brought to you by . Get 50% off just about any item, plus free shipping when you enter the offer code \"Savage\".     This episode of the Savage Lovecast is brought to you by Blue Apron. Check out this week’s menu and get $60 off at  ThredUP is the world’s largest online thrift store with over 35,000 brands at up to 90% off retail price. For a limited time, get up to 30% off your first order at .",
            "length": "24230012",
            "sourceUrl": "http://podtrac.com/pts/redirect.mp3/traffic.libsyn.com/savagelove/savagelove-111919.mp3?dest-id=36185",
            "epNo": "682"
        }
    ]
}