{
    "artwork": "http://is2.mzstatic.com/image/thumb/Music62/v4/03/3a/4e/033a4e48-4dd9-c4f7-efdb-ef3330b54488/source/100x100bb.jpg",
    "description": "Host Chris Sowa traverses the globe having interesting, informative, and – at times – hilarious conversations about sex … with strangers.",
    "feedURL": "http://sexwithstrangersshow.com/podcasts/feed.xml",
    "podcastURL": "http://sexwithstrangersshow.com",
    "title": "Sex with Strangers",
    "episodes": [
        {
            "title": "Episode 1: Sex in Tokyo",
            "datePublished": "Thu, 13 Mar 2014 23:26:00 GMT",
            "description": "Chris travels to Tokyo to explore Japanese sex culture. Topics discussed include host and hostess clubs, happening bars, Japanese rope bondage, love hotels, maid cafes, train groping, Western media attention, and much more.",
            "length": "104420369",
            "sourceUrl": "http://traffic.libsyn.com/sexwithstrangers/sws_s01e01.mp3"
        },
        {
            "title": "Episode 2: Grindr in Wyoming",
            "datePublished": "Thu, 27 Mar 2014 19:00:00 GMT",
            "description": "Chris chats with Grindr users in Wyoming, meeting some fascinating characters with surprising backstories. He also picks up quite a bit of new terminology along the way. Topics discussed include hookups, otters, creeps, money offers, religion, married guys, and much more.",
            "length": "72913557",
            "sourceUrl": "http://traffic.libsyn.com/sexwithstrangers/sws_s01e02.mp3"
        },
        {
            "title": "Episode 3: Dungeon Fetish Party",
            "datePublished": "Thu, 10 Apr 2014 19:00:00 GMT",
            "description": "Chris attends a fetish party at Continuum Dungeon in Chicago where he interviews three professional dominatrixes and an array of attendees ranging from lifestyle kinksters to vanilla onlookers. Guests include Mistress Cleo LaVamp, Mistress Desiree Demonix, and Mistress Elena Croft. This episode also features a conversation with BDSM and kinky sex educator and blogger Tynan Fox, recorded in St Paul, MN. If you liked this episode I recommend listening to episode 442 of the RISK! Podcast entitled Slave. Update: An error was made in the working definition for the term paraphilia. That error is corrected in the first few minutes of episode 4: Sex at Mardi Gras.",
            "length": "84093971",
            "sourceUrl": "http://traffic.libsyn.com/sexwithstrangers/sws_s01e03.mp3"
        },
        {
            "title": "Episode 4: Sex at Mardi Gras",
            "datePublished": "Thu, 24 Apr 2014 19:00:00 GMT",
            "description": "Chris travels to New Orleans during Mardi Gras to chat with party people from around the world. He also sits down with some sex workers, including a 62-year-old escort. This episode also features a conversation with sex columnist and author Stefanie Iris Weiss about her most recent book Eco-Sex: Go Green Between the Sheets and Make Your Love Life Sustainable.",
            "length": "61823532",
            "sourceUrl": "http://traffic.libsyn.com/sexwithstrangers/sws_s01e04.mp3"
        },
        {
            "title": "Episode 5: Adventures in Sex Work",
            "datePublished": "Thu, 08 May 2014 19:00:00 GMT",
            "description": "This episode draws on conversations recorded in Tokyo, New York, New Orleans, and Chicago. Topics explored include tickle porn, traditional porn, fetish modeling, stripping, prostitution, sugar daddies, and much more. Guests include a $750-an-hour gigolo and America's favorite 62-year-old escort, Erin.",
            "length": "91981909",
            "sourceUrl": "http://traffic.libsyn.com/sexwithstrangers/sws_s01e05.mp3"
        },
        {
            "title": "Episode 6: Sex in Boomtown USA",
            "datePublished": "Thu, 22 May 2014 19:00:00 GMT",
            "description": "Chris travels to Williston, North Dakota to investigate the impact of the oil boom and subsequent migration of thousands of men from around the world to this small community.",
            "length": "78596238",
            "sourceUrl": "http://traffic.libsyn.com/sexwithstrangers/sws_s01e06.mp3"
        },
        {
            "title": "Episode 7: Sex in Mumbai",
            "datePublished": "Thu, 10 Jul 2014 19:00:00 GMT",
            "description": "Chris travels to Mumbai, India where he discusses transgender issues, arranged marriages, fairness creams, and sex work with a delightful array of locals. This episode also features a conversation with feminine image consultant and founder of Nouveau She, Monica Prata.",
            "length": "77801059",
            "sourceUrl": "http://traffic.libsyn.com/sexwithstrangers/sws_s01e07.mp3"
        },
        {
            "title": "Episode 8: Sex, Drugs, and Equality at Chicago Pride",
            "datePublished": "Thu, 24 Jul 2014 19:00:00 GMT",
            "description": "Chris chats with L's, G's, B's, T's, Q's, I's, A's, and some folks who are too cool for labels at the 2014 Chicago Pride Parade.",
            "length": "57145432",
            "sourceUrl": "http://traffic.libsyn.com/sexwithstrangers/sws_s01e08.mp3"
        },
        {
            "title": "Episode 9: Financial Domination",
            "datePublished": "Thu, 31 Jul 2014 19:00:00 GMT",
            "description": "Chris explores the topic of financial domination, a fascinating virtual form of BDSM.",
            "length": "66525452",
            "sourceUrl": "http://traffic.libsyn.com/sexwithstrangers/sws_s01e09.mp3"
        },
        {
            "title": "Episode 10: Sex with Strippers",
            "datePublished": "Thu, 21 Aug 2014 19:00:00 GMT",
            "description": "Chris talks with 3 Chicago strippers about cocaine, lap dances, bachelor and bachelorette parties, \"extras,\" golden showers, stalkers and much more.",
            "length": "71234866",
            "sourceUrl": "http://traffic.libsyn.com/sexwithstrangers/sws_s01e10.mp3"
        },
        {
            "title": "Episode 11: Sex with Rent Boys",
            "datePublished": "Thu, 11 Sep 2014 19:00:00 GMT",
            "description": "Chris chats with 1 former and 2 current male escorts. The former being podcaster, sex worker advocate, and writer Eric Barry. You can find Eric's show, Full Disclosure, on iTunes, Stitcher Radio and at FDpod.com. Topics discussed in this episode include fisting, scat, incest play, gay-for-pay, and Nancy Reagan.",
            "length": "88852828",
            "sourceUrl": "http://traffic.libsyn.com/sexwithstrangers/sws_s01e11.mp3"
        },
        {
            "title": "Episode 12: Sex with Porn Clerks",
            "datePublished": "Mon, 29 Sep 2014 19:00:00 GMT",
            "description": "Chris talks with one former and two current porn clerks about why sex shops continue to thrive in the Internet age.",
            "length": "70152470",
            "sourceUrl": "http://traffic.libsyn.com/sexwithstrangers/sws_s01e12.mp3"
        },
        {
            "title": "Episode 13: Sex with Mormons",
            "datePublished": "Thu, 20 Nov 2014 19:00:00 GMT",
            "description": "Chris travels to Utah to chat with current and former LDS members about the sexual politics of the Mormon Church. Guests include everyone from a Salt Lake City escort to an anti-porn activist at Brigham Young University.",
            "length": "123432462",
            "sourceUrl": "http://traffic.libsyn.com/sexwithstrangers/sws_s01e13.mp3"
        },
        {
            "title": "Episode 14: Sex Positive Portland",
            "datePublished": "Fri, 05 Dec 2014 19:00:00 GMT",
            "description": "Chris travels to Portland where he talks to some key figures in the city’s expansive sex positive community. Topics include polyamory, play parties, furies, Sex Positive World, the PDX Kink Calendar, the Catalyst Art and Cultural Space, and the InHerTube sex toy company. Chris also visits Casa Diablo the world’s first vegan strip club.",
            "length": "108242872",
            "sourceUrl": "http://traffic.libsyn.com/sexwithstrangers/sws_s01e14.mp3"
        },
        {
            "title": "Episode 15: Sex with Age-Players",
            "datePublished": "Mon, 5 Jan 2015 19:00:00 GMT",
            "description": "From adult babies to naughty school girls. Chris explores the world of age-play, a place where consenting adults can be kids again.",
            "length": "66927738",
            "sourceUrl": "http://traffic.libsyn.com/sexwithstrangers/sws_s01e15.mp3"
        },
        {
            "title": "Episode 16: Professional Phone Sex",
            "datePublished": "Thu, 12 Feb 2015 19:00:00 GMT",
            "description": "Chris chats with several phone sex performers and even sits in on a 9-hour no-taboos phone sex shift.",
            "length": "93299514",
            "sourceUrl": "http://traffic.libsyn.com/sexwithstrangers/sws_s01e16.mp3"
        },
        {
            "title": "Episode 17: Fifty Shades of Evil",
            "datePublished": "Mon, 23 Mar 2015 19:00:00 GMT",
            "description": "Chris travels to Clearwater, Florida to chat with couples spending Valentine’s Day at the world’s first Hooters. But this episode mainly focuses on conversations with three professional dominatrixes –Svetlannah Doll, Calista Curves, and Domina Vera Lamarr— whom Chris coaxed into seeing Fifty Shades of Grey. Master Hook, a lifestyle master, also shares some thoughts on the film. And finally, we check in with Fiona from the porn clerks episode to learn about how the Fifty Shades series has impacted her job and the sex toy industry as a whole.",
            "length": "81632630",
            "sourceUrl": "http://traffic.libsyn.com/sexwithstrangers/sws_s01e17.mp3"
        },
        {
            "title": "Episode 18: Alpacas Gone Wild",
            "datePublished": "Sun, 24 May 2015 19:00:00 GMT",
            "description": "In this episode we take a detour from human sexuality and dive into the sexual triumphs and tragedies of livestock. Chris visits two farms in Washington state where he encounters horny alpacas, genetically perfect pigs, and some very confused birds. Chris also chats with comedian Tamale Sepp about her former life as a champion dairy judge and horse semen scientist. Finally, Chris interviews two hu-cow erotica authors (Gemma Wolf and Narcissa Rivers) about the “human cow” fetish and the surprising economics of self-publishing erotica through Amazon.",
            "length": "65704679",
            "sourceUrl": "http://traffic.libsyn.com/sexwithstrangers/sws_s01e18.mp3"
        },
        {
            "title": "Episode 19: Sex with Fetish Filmmakers",
            "datePublished": "Wed, 08 Jul 2015 19:00:00 GMT",
            "description": "Chris chats with a variety of fetish filmmakers. He talks pegging with adult actress Candi Apple aka the Strap-On Princess, sploshing with the Pie Master and Angel Rose from sexyslapstickvideos.com, smoking fetish with Clif from USA Smokers and Don from Smoking Kittens Productions, and Shoe-play and vore with Bob a filmmaker with 8 different shoe-play stores on clips4sale.com.",
            "length": "76539244",
            "sourceUrl": "http://traffic.libsyn.com/sexwithstrangers/sws_s01e19.mp3"
        },
        {
            "title": "Episode 20: Sex in Iceland",
            "datePublished": "Fri, 20 Nov 2015 19:00:00 GMT",
            "description": "\r\n        Chris travels to Iceland to chat with locals about the country’s infamous hookup culture, “end demand” prostitution policies, BDSM scene, and much more. This episode also features a couple of brief exchanges with Icelandic rapper Blaz Roca.\r\n        ",
            "length": "79620458",
            "sourceUrl": "http://traffic.libsyn.com/sexwithstrangers/sws_s01e20.mp3"
        },
        {
            "title": "Episode 21: Sex Therapy",
            "datePublished": "Wed, 30 Dec 2015 19:00:00 GMT",
            "description": "\r\n            This episode features interviews with: Chicago-based sex therapist Michelle Herzog from the Center for Mindful Living, global sex therapist Dr. Susan Kaye from the Institute for Mindy Body Therapy, and New York/San Francisco-based sex therapist and author David Ortmann. David co-wrote the book Sexual Outsiders: Understanding BDSM Sexualities and Communities with Richard Sprott. Articles discussed in this episode include “14 Women Tell What It’s Like Having Sex With A Micropenis” from Buzzfeed and “You’re 16. You’re a Pedophile. You Don’t Want to Hurt Anyone. What Do You Do Now?” by Luke Malone. You can listen to the This American Life episode inspired by Luke Malone’s article here and check out the breakdown of Sensate Focus mentioned on the show here.\r\n        ",
            "length": "76312772",
            "sourceUrl": "http://traffic.libsyn.com/sexwithstrangers/sws_s01e21.mp3"
        },
        {
            "title": "Episode 22: The 2016 AVN Awards and Expo",
            "datePublished": "Tue, 16 Feb 2016 19:01:00 GMT",
            "description": "\r\n        Porn performers featured in this episode include Ron Jeremy, Farrah Abraham, Nikki Knightly, Kelly Klaymore, MaseratiXXX, Carmen Valentina, Daisy Monroe, Piper Perri, Yasmine de Leon, Tyra Scott, Sarah Jesse, Angel Deluca, Lila Lovely, Riley Reynolds, Lacey Starr, Savanah Stevens, JoJo Kiss, Zoe Parker, Katalina Mills, Farah Valentine, Heather Lexi of Erotique Entertainment, Michelle Austin the voluptuous diva behind Kennston Productions and FTM.xxx, and Chaturbate cam girl Shannon Scot. This episode also features Bella Roxxx from Adult Star Makers as well as representatives from Wicked Pictures, Kink.com, Holodexxx, HoloGirls VR, and VR Bangers. And let’s not forget Dr. Ben Durover.\r\n        ",
            "length": "108540006",
            "sourceUrl": "http://traffic.libsyn.com/sexwithstrangers/sws_s01e22.mp3"
        },
        {
            "title": "Episode 23: New York Sex Parties",
            "datePublished": "Thu, 24 Mar 2016 12:15:00 GMT",
            "description": "\r\n        Some of the parties discussed in this episode include Chemistry, Kinky Salon NYC, Myth, Spam, Hacienda, 2 House of Scorpio events: Countdown and Lip Service, Kinky Riot, Wild’s Playground, and Curvy Fling. We will also hear from Jack from Adult Socials. You can find more information about Wild’s Playground and Kinky Riot on FetLife. Both parties often take place at Pendulum Dungeon. Don’t forget to check out the full archives of Jefferson’s blog One Life, Take Two and to listen to every episode of Billy Procida’s Manwhore Podcast. Watch the Huffpost Live video about Hacienda Villa here, and book your reservation for Hacienda Maison here. And when you’re done with all of that, remember to read Polly Superstar’s Reddit AMA.\r\n        ",
            "length": "86152790",
            "sourceUrl": "http://traffic.libsyn.com/sexwithstrangers/sws_s01e23.mp3"
        },
        {
            "title": "Episode 24: New York Continued",
            "datePublished": "Wed, 27 Apr 2016 12:30:00 GMT",
            "description": "\r\n        This episode features conversations that didn’t quite fit into the sex party episode but were simply too good to leave on the cutting room floor. Ames Bex makes his second appearance on the show. This time he talks about directing porn and his ongoing transition into manhood, both legally and physically. Ames also has a podcast of his own called Mister Bex Talks Sex. Photographer and Kink tour guide Efrain John Gonzalez aka Gonzobear, takes Chris through Manhattan’s Meatpacking District where he gives walking tours “that take you back to the good old days of the 80's and 90's, when the district was packed with some of the kinkiest, sleaziest and craziest bars and underground clubs in Manhattan.” We also hear from Selena Fire, Patricia Johnson, and Mark Michaels, the three co-founders of Pleasure Salon: a monthly social gathering designed to “bring together members of the BDSM, swinger, alternative gender, LGBTQ, sex-activist, porn, sex educator, nudist, sex-magic, polyamory, Pagan, radical faerie, tantra, sex-blogger, sex writer, pervert and sex-worker communities, and others whose passion is sex or sexuality” in a casual cocktail party environment. Patricia and Mark also talk about the 5 books they’ve coauthored together.\r\n        ",
            "length": "61262866",
            "sourceUrl": "http://traffic.libsyn.com/sexwithstrangers/sws_s01e24.mp3"
        },
        {
            "title": "\r\n        Episode 25: Behind the Scenes at Kink.com with Quinn Quintana\r\n        ",
            "datePublished": "Sat, 20 Aug 2016 02:00:00 GMT",
            "description": "\r\n        Chris explores San Francisco's historic Armory also known as the Porn Palace with kink.com tour guide Quinn Quintana. Quinn is also a comedian and the host of Hot Tub Interviews with Porn Stars. Quinn and Chris spent hours exploring kink.com sets, props, and cages. Don’t forget to check out the Vice article mentioned in this episode \"Why Can You Go to Prison for Making Scat Porn?\"\r\n        ",
            "length": "81841008",
            "sourceUrl": "http://traffic.libsyn.com/sexwithstrangers/sws_s01e25.mp3"
        },
        {
            "title": "Episode 26: Fighting the Trafficking Narrative from Alaska to Rhode Island",
            "datePublished": "Sun, 11 Sep 2016 01:00:00 GMT",
            "description": "Mainstream discussions of the sex industry have mostly revolved around human trafficking. In this episode we explore why that narrative is misleading and harmful. The interviews featured here were recorded in Nebraska, Rhode Island, Alaska, California, and Illinois. Guests include Terra Burns (<a target=\"_blank\" href=\"http://sextraffickingalaska.com/\">Community United for Safety and Protection</a>), Maxine Doogan (<a target=\"_blank\" href=\"http://esplerp.org/\">the Erotic Service Providers Legal, Educational and Research Project</a>), Bella Robinson (<a target=\"_blank\" href=\"http://coyoteri.org/wp/\">COYOTE RI</a>), Monica Peterson and Rex Hamaker (<a target=\"_blank\" href=\"http://humantraffickingcenter.org/\">University of Denver's Human Trafficking Center</a>), Hannah Marshall (<a target=\"_blank\" href=\"https://www.brown.edu/academics/anthropology/index.php?q=marshall-hannah\">Brown University</a>), and Erin Black (The Sexual A-Team). Articles discussed in this episode include <a target=\"_blank\" href=\"http://www.thedailybeast.com/articles/2014/05/07/the-banks-war-on-porn.html\">The Banks' War on Porn Stars</a> by Richard Abowitz and Marlow Stern, <a target=\"_blank\" href=\"http://www.vox.com/2015/8/18/9166669/why-legalize-prostitution\">The Case for Decriminalizing Prostitution</a> by German Lopez, Washington Post fact checker Glenn Kessler's <a target=\"_blank\" href=\"https://www.washingtonpost.com/news/fact-checker/wp/2015/04/24/why-you-should-be-wary-of-statistics-on-modern-slavery-and-trafficking/\">Why You Should be Wary About Statistics on 'Modern Slavery' and 'Trafficking'</a> and <a target=\"_blank\" href=\"https://www.washingtonpost.com/news/fact-checker/wp/2015/12/14/the-biggest-pinocchios-of-2015/\">The Biggest Pinocchios of 2015</a>, <a target=\"_blank\" href=\"http://www.nytimes.com/2016/05/08/magazine/should-prostitution-be-a-crime.html?_r=0\">Should Prostitution be a Crime?</a> by Emily Bazelon. Also check out Bazelon's <a target=\"_blank\" href=\"http://www.nytimes.com/2016/05/25/magazine/why-amnesty-international-is-calling-for-decriminalizing-sex-work.html\">follow-up</a> concerning Amnesty International's <a target=\"_blank\" href=\"https://www.amnesty.org/en/documents/pol30/4062/2016/en/\">Policy on State Obligations to Respect, Protect and Fulfil the Human Rights of Sex Workers</a>. Three quick corrections: Maxine (not Terra) interviewed Keyana; Sextraffickingalaska.com is maintained by Community United for Safety and Protection (not just Terra); Last (and in fact least), Chris began gathering audio for this episode in October of 2015 (not September of 2015). We regret these errors.",
            "length": "145752554",
            "sourceUrl": "http://traffic.libsyn.com/sexwithstrangers/sws_s01e26.mp3"
        },
        {
            "title": "Episode 27: Sex, Food, and Intentional Weight Gain",
            "datePublished": "Mon, 31 Oct 2016 19:00:00 GMT",
            "description": "Chris chats with people in the feederism (sometimes also called feedism) fetish community. All 4 featured guests get off on gaining weight as well as encouraging others to pack on pounds. Two of these guests also work as professional fetish models. You can find out more about Kimmy Crush at <a href=\"http://bbwsurf.com/\" target=\"_blank\">BBWSurf.com</a>, and <a href=\"http://lily.bigcuties.com/\" target=\"_blank\">Lily’s site</a> is through <a href=\"http://bigcuties.com/\" target=\"_blank\">bigcuties.com</a>. The True Life episode mentioned at the end of this episode <a href=\"https://www.youtube.com/watch?v=a2oOQOjz70E\" target=\"_blank\">“I Have a Feeding Fetish”</a> is currently available on Youtube.",
            "length": "72062906",
            "sourceUrl": "http://traffic.libsyn.com/sexwithstrangers/sws_s01e27.mp3"
        },
        {
            "title": "Episode 28: The War on Porn",
            "datePublished": "Sun, 29 Jan 2017 19:00:00 GMT",
            "description": "Chris chats with porn performers <a href=\"http://www.chanelpreston.com\">Chanel Preston</a> and <a href=\"https://twitter.com/themickeymod?lang=en-gb\">Mickey Mod</a> about the current state of the porn industry, why they oppose condom mandates like Proposition 60, and their work with the <a href=\"http://www.apac-usa.com\">Adult Performer Advocacy Committee</a> (APAC). <a href=\"https://twitter.com/mikestabile?lang=en\">Michael Stabile</a> from <a href=\"http://www.kink.com\">Kink.com</a> joins the discussion to talk about the rise of anti-porn forces within US politics and corporate America. Jerry Barnett, the  free speech activist and author of <a href=\"http://sexandcensorship.org/porn-panic-the-book/\">Porn Panic: Sex and Censorship in the UK</a>, helps us understand what's happening across the pond. And it's not encouraging! British porn sensation <a href=\"http://www.harrietsugarcookie.com\">Harriet Sugarcookie</a> and her business partner Tommie round out this episode by sharing their thoughts on censorship, their unique approach to making pornography, and the healing power of <a href=\"http://www.harrietsugarcookie.com\">harrietsugarcookie.com</a>. Check out the official position of the American Association of Sexuality Educators, Counselors and Therapists (AASECT) on sex/porn addiction <a href=\"http://www.aasect.org/position-sex-addiction\">here</a>, and a similar statement from The Mormon Mental Health Association mentioned on the show <a href=\"http://www.mormonmentalhealthassoc.org/position-statements\">here</a>. Correction: Chris mistakenly refers to this show as \"episode 29\" when it is in fact episode 28.",
            "length": "87410526",
            "sourceUrl": "http://traffic.libsyn.com/sexwithstrangers/sws_s01e28.mp3"
        },
        {
            "title": "Episode 29: Valentine's Day in Amsterdam's Main Red Light District",
            "datePublished": "Fri, 31 Mar 2017 19:00:00 GMT",
            "description": "\r\n        Chris travels to Amsterdam to chat with couples and sex workers spending Valentine's Day in De Wallen, the world's most famous red light district. Chris is joined in this episode by listener Taylor Hernowitz, who helped Chris interview women working in window brothels and couples exploring voyeurism at the Sex Palace Peep Show. This episode also features representatives from a number of organizations dedicated to improving the lives of people working in the sex industry, including <a href=\"http://wijzijnproud.nl/en_GB/\">PROUD</a> the official union of sex workers in the Netherlands, the <a href=\"http://www.redumbrellafund.org/\">Red Umbrella Fund</a>, which supplies grants to sex worker-led organizations around the globe and is headquartered in Amsterdam, and the <a href=\"http://www.pic-amsterdam.com/wordpress/\">Prostitution Information Center</a> located in the heart of De Wallen. Don't forget to check out the CNN article mentioned on the show: <a href=\"http://www.cnn.com/2015/12/21/europe/driving-lessons-sex-netherlands/\">Dutch Driving Instructors Can Trade Lessons for Sex</a>. You can find the episode of Reply All Chris referenced <a href=\"https://gimletmedia.com/episode/83-voyage-into-pizzagate/\">here</a>. And the three episodes of Jess' podcast that are available in English are <a href=\"http://www.lizhi.fm/1785064/2541219552606924294\">A Dutch Sex Worker</a>, <a href=\"http://www.lizhi.fm/1785064/2521010024225583110\">A Poly Family</a>, and <a href=\"http://www.lizhi.fm/1785064/2572243226439485446\">Conscious Kink</a>. Don't let the Chinese intros for these episodes fool you; the interviews are in English. The original upload of this episode had a technical glitch that created audio gaps when played on certain speakers. That has been fixed. If you have any issues, please delete the file and download it again. If troubles persist, download or stream this episode directly at <a href=\"http://sexwithstrangersshow.com\">sexwithstrangersshow.com</a>. We apologize for the inconvenience.\r\n        ",
            "length": "115942549",
            "sourceUrl": "http://traffic.libsyn.com/sexwithstrangers/sws_s01e29.mp3"
        },
        {
            "title": "Episode 30: Paying for Sex",
            "datePublished": "Fri, 19 May 2017 15:00:00 GMT",
            "description": "\r\n        Chris chats with 6 men who, collectively, have purchased sexual services well over 100 times. Topics discussed include buying and using drugs (mostly cocaine) with sex workers, seeing porn stars, sex tourism (mostly to Columbia and Thailand), and the sugar lifestyle/<a target=\"_blank\" href=\"http://www.seekingarrangements.com\">seekingarrangements.com</a>. Articles referenced in this episode include Salon's <a target=\"_blank\" href=\"http://www.salon.com/2012/08/19/how_risky_is_oral_sex/\">\"How risky is Oral Sex?,\"</a> and CNN's cheery <a target=\"_blank\" href=\"http://www.cnn.com/2013/06/03/health/hpv-oral-cancer-explainer/\">\"Yes, Oral Sex Can Lead to Cancer.\"</a>\r\n        ",
            "length": "78954166",
            "sourceUrl": "http://traffic.libsyn.com/sexwithstrangers/sws_s01e30.mp3"
        },
        {
            "title": "Episode 31: Sex and Disability",
            "datePublished": "Fri, 30 Jun 2017 19:00:00 GMT",
            "description": "\r\n        This episode features people with physical disabilities talking about the able-bodied world's tendency to erase their sexuality, using Tindr in a wheelchair, disability-related sexual superpowers, and much more. Comedian <a href=\"http://www.springdaycomedy.com\" target=\"_blank\">Spring Day</a> makes her triumphant return. She and her boyfriend, comedian <a href=\"http://twitter.com/timrenkowcomedy\" target=\"_blank\">Tim Renkow</a>, both have cerebral palsy and talk frankly about their sex life. The fetishization of disabled people, often called devoteeism, also comes up in this episode. Check out the excellent BBC3 documentary Meet the Devotees <a href=\"http://youtube.com/watch?v=dtCwyqD-Vp8\" target=\"_blank\">here</a>. We also talk about the role sex workers sometimes play in enriching the lives of people with disabilities. Check out <a href=\"http://youtube.com/watch?v=bYfz4svcvqE\" target=\"_blank\">Rachel Wotton's Ted Talk</a> exploring this topic. Her film <a href=\"http://imdb.com/title/tt1951238/?ref_=fn_al_tt_1\" target=\"_blank\">Scarlet Road</a> also comes up, as does the 2012 feature film <a href=\"http://imdb.com/title/tt1866249/?ref_=fn_al_tt_1\" target=\"_blank\">The Sessions</a> about Mark O'Brien's experiences with a sex surrogate. You can watch an Oscar-winning documentary short about Mark O'Brien <a href=\"http://youtube.com/watch?v=JzEGZnWT5dA\" target=\"_blank\">here</a> and read his article “On Seeing a Sex Surrogate” <a href=\"http://thesunmagazine.org/issues/174/on_seeing_a_sex_surrogate\" target=\"_blank\">here</a>. Other articles mentioned on the show include <a href=\"http://vice.com/en_us/article/av4m8p/hand-angel-hand-jobs-taiwan-748\" target=\"_blank\">this Vice piece</a> about Hand Angels, <a href=\"http://atwiki.assistivetech.net/index.php/Sexual_Positioning_Devices\" target=\"_blank\">this guide to sexual positioning devices</a>, and a <a href=\"http://salon.com/1999/07/12/obrien/\" target=\"_blank\">fascinating obituary</a> published by Salon about Mark O'Brien. Other podcasts mentioned on the show include the <a href=\"http://wnyc.org/shows/deathsexmoney/\" target=\"_blank\">Death Sex and Money</a> episodes <a href=\"http://wnyc.org/story/death-sex-money-rachel-hiroki/\" target=\"_blank\">Newlywed and Paralyzed</a> and <a href=\"http://wnyc.org/story/death-sex-money-nikki-and-darrell/\" target=\"_blank\">Two Wheelchairs and a Baby</a>, as well as an episode of Everybody Swing entitled <a href=\"http://stitcher.com/podcast/everybody-swing/e/episode-31-swinging-in-a-wheelchair-37646824\" target=\"_blank\">Swinging in a Wheelchair</a>. Finally, Ryan Lythall can be reached at <a href=\"mailto:rythall@me.com\">rythall@me.com</a> if you have any follow-up questions or would like to book him for a speaking engagement.\r\n        ",
            "length": "108411933",
            "sourceUrl": "http://traffic.libsyn.com/sexwithstrangers/sws_s01e31.mp3"
        },
        {
            "title": "Episode 32: Lesbian Sex",
            "datePublished": "Mon, 31 Jul 2017 19:00:00 GMT",
            "description": "\r\n        Lesbians, bisexuals, pansexuals, and queer-identified women sound off on everything from scissoring to strap-ons. Porn star <a target=\"_blank\" href=\"http://www.chanelpreston.com\">Chanel Preston</a> returns to discuss shooting girl-girl porn. Other returning guests include Ames Bex, who shares how sex is different now as a trans man than it was back when he identified as a lesbian. Comedian <a target=\"_blank\" href=\"http://www.twitter.com/quinnxquintana\">Quinn Quintana</a> returns to talk about fisting ladies and the many changes that have occurred at <a target=\"_blank\" href=\"http://www.kink.com\">Kink.com's</a> <a target=\"_blank\" href=\"http://www.sfarmory.com\">San Francisco Armory</a> since we recorded episode 25. Fan-favorite Shayla also returns to make her 4th appearance. This episode also features comedians <a target=\"_blank\" href=\"http://www.gwenlaroka.com\">Gwen La Roka</a> and <a target=\"_blank\" href=\"http://www.twitter.com/evermainard\">Ever Mainard</a>. Check out Quinn's web series <a target=\"_blank\" href=\"https://vimeo.com/quinnquintana\">Hot Tub Interviews with Porn Stars</a>, and learn more about her live comedy show <a target=\"_blank\" href=\"http://facebook.com/totalsmutcomedy/\">Total Smut Comedy + Q&A with a Porn Star here</a>.\r\n        ",
            "length": "84807159",
            "sourceUrl": "http://traffic.libsyn.com/sexwithstrangers/sws_s01e32.mp3"
        },
        {
            "title": "Episode 33: Sex with Devotees, Wannabes, and Pretenders",
            "datePublished": "Tue, 14 Nov 2017 19:00:00 GMT",
            "description": "In this follow-up to episode 31, Chris chats with several people who fetishize disability. He also interviews an able-bodied woman who believes she should be a quadriplegic and derives sexual gratification from pretending to be one. <a target=\"_blank\" href=\"http://wp.stu.ca/narrativestudies/\">Dr. Clive Baldwin</a> from St Thomas University discusses Body Integrity Identity Disorder (BIID). And a few podcasters also join the conversation: <a target=\"_blank\" href=\"http://www.andrewgurza.com\">Andrew Gurza</a> from <a target=\"_blank\" href=\"http://www.andrewgurza.com/home\">Disability After Dark</a> and <a target=\"_blank\" href=\"http://www.gimphacks.com\">Jocelyn and Tod from GimpHacks</a>. Check out the <a target=\"_blank\" href=\"http://www.andrewgurza.com/disability-after-dark/2016/10/28/episode-013-devoted-to-you-disabilityafterdark-interviews-a-devotee\">episode of Disability After Dark mentioned in the show here</a>, and <a target=\"_blank\" href=\"http://www.gimphacks.com/devotees\">go here</a> for the full version of the GimpHacks episode excerpted in this show. Also check out Ghoul Cop Bat Cop at <a target=\"_blank\" href=\"http://www.gcbc.show\">GCBC.show</a>.",
            "length": "79431713",
            "sourceUrl": "http://traffic.libsyn.com/sexwithstrangers/sws_s01e33.mp3"
        },
        {
            "title": "Episode 34: Decriminalized Sex Work Down Under",
            "datePublished": "Tue, 02 Jan 2018 08:00:00 GMT",
            "description": "Chris travels to New South Wales, Australia where sex work is decriminalized to interview local sex workers about their lives. Guests include <a target=\"_blank\" href=\"https://www.youtube.com/watch?v=FjelUkkfP7g\">Tilly Lawless</a>, <a target=\"_blank\" href=\"https://www.twitter.com/camcoxsyd?lang=en\">Cameron Cox</a>, <a target=\"_blank\" href=\"http://www.zachunter.com\">Zach Hunter</a>, <a target=\"_blank\" href=\"http://www.sydneyescortforladies.com/tom-jones-male-escort-2/\">Tom Jones</a>, and <a target=\"_blank\" href=\"http://scarletroad.com.au/about/\">Rachel Wotton</a>, among others. Catherine Healy from the <a target=\"_blank\" href=\"http://nzpc.org.nz\">New Zealand Prostitutes' Collective</a> also joins the conversation. To learn more about the decriminalized sex industry in New Zealand <a target=\"_blank\" href=\"http://www.otago.ac.nz/christchurch/otago018607.pdf\">check out this study</a> from the University of Otago, which surveyed 772 sex workers. The government of New Zealand also released <a target=\"_blank\" href=\"http://prostitutescollective.net/wp-content/uploads/2016/10/report-of-the-nz-prostitution-law-committee-2008.pdf\">this exhaustive report</a> in 2008. And while you're clicking on links, <a target=\"_blank\" href=\"http://www.twitter.com/sexwithchris\">follow Chris on Twitter</a>. He just joined as <a target=\"_blank\" href=\"http://www.twitter.com/sexwithchris\">@SexWithChris</a>.",
            "length": "113351704",
            "sourceUrl": "http://traffic.libsyn.com/sexwithstrangers/sws_s01e34.mp3"
        },
        {
            "title": "Episode 35: Back in Alaska for the 15th Annual International Day to End Violence Against Sex Workers",
            "datePublished": "Wed, 31 Jan 2018 23:50:00 GMT",
            "description": "In this follow-up to episode 26, Chris returns to Alaska to attend a memorial and vigil observing <a target=\"_blank\" href=\"http://www.december17.org\">the 15th Annual International Day to End Violence Against Sex Workers</a>. The event took place at the <a target=\"_blank\" href=\"http://alaskakink.com\">Alaska Center for Alternative Lifestyles</a> (ACAL), Alaska's only sex club. Terra Burns returns to update us on her continued fight for the human rights of sex workers in her home state. Amber Batts, currently on parole for sex trafficking (despite never trafficking anyone), tells her story. This episode also features stories about the intersection of drugs and sex work. Finally, Sarha Shaubach, ACAL's owner, recounts her reign as the 2013 International Ms. Leather. You can support <a target=\"_blank\" href=\"http://sextraffickingalaska.com\">Tara and CUSP's</a> efforts to make it illegal for Alaskan police officers to sexually penetrate people under their investigation <a target=\"_blank\" href=\"http://www.crowdrise.com/cuspsafe\">here</a>, and you can read more about convicted rapist and former Anchorage police officer Anthony Rollins <a target=\"_blank\" href=\"http://www.adn.com/alaska-news/article/rollins-sentenced-87-years-prison/2012/04/14/\">here</a> and <a target=\"_blank\" href=\"http://www.adn.com/alaska-news/article/lawsuits-rollins-rape-case-cost-anchorage-55-million/2012/09/04\">here</a>.",
            "length": "96831922",
            "sourceUrl": "http://traffic.libsyn.com/sexwithstrangers/sws_s01e35.mp3"
        },
        {
            "title": "Episode 36: Exploring Thailand's Sex Industry",
            "datePublished": "Wed, 04 Apr 2018 06:00:00 GMT",
            "description": "Chris travels to the Thai cities of Bangkok and Chiang Mai to chat with sex workers and others with insights into Thailand's sex industry, including members of <a target=\"_blank\" href=\"http://www.empowerfoundation.org/index_en.html\">EMPOWER</a> – the country's oldest and largest sex worker organization. The EMPOWER Foundation's 2016 community research project entitled Moving Toward Decent Sex Work is <a target=\"_blank\" href=\"http://www.nswp.org/sites/nswp.org/files/Moving%20Toward%20Decent%20Work%2C%20EMPOWER%20-%20April%202016.pdf\">available in full here</a> and is definitely worth reading. We also recommend <a target=\"_blank\" href=\"https://www.youtube.com/watch?v=YEAbjowQLv8\">The Third Gender</a> a documentary by Vivienne Chen about the Thai trans community, which is available for free on Youtube. For more on this community check out <a target=\"_blank\" href=\"https://en.wikipedia.org/wiki/Kathoey\">the Wikipedia page for Kathoey</a>. Finally, make sure to pay a visit to <a target=\"_blank\" href=\"http://www.facebook.com/sweetsmartstrongsexy/\">Can Do Bar</a> if you ever find yourself in Chiang Mai.",
            "length": "80312030",
            "sourceUrl": "http://traffic.libsyn.com/sexwithstrangers/sws_s01e36.mp3"
        },
        {
            "title": "Episode 37: Listening to Women",
            "datePublished": "Sat, 19 May 2018 02:00:00 GMT",
            "description": "<a target=\"_blank\" href=\"http://www.cindiknox.com/musings/?page_id=921\">Reverend Cindi Knox</a>, porn star <a target=\"_blank\" href=\"http://www.chanelpreston.com/\">Chanel Preston</a>, comedians <a target=\"_blank\" href=\"https://twitter.com/glittercheese\">Liza Treyger</a> and <a target=\"_blank\" href=\"https://twitter.com/megangailey\">Megan Gailey</a>, writer/activist/Juggalo anthropologist <a target=\"_blank\" href=\"https://twitter.com/kittystryker\">Kitty Stryker</a>, and others share their thoughts on a diverse range of issues including #MeToo and Time's Up. This show also features a brief clip from <a target=\"_blank\" href=\"http://americansex.libsyn.com/kitty-stryker-sestafosta-consent-juggalos-ep-36\">episode 36 of American Sex Podcast</a>, which also includes a lengthy conversation about SESTA/FOSTA. For more on that issue check out <a target=\"_blank\" href=\"http://www.savagelovecast.com/episodes/598#.Wv4a7ogvxPY\">episode 598 of the Savage Lovecast</a>, <a target=\"_blank\" href=\"http://www.techdirt.com/articles/20180509/13450339810/police-realizing-that-sesta-fosta-made-their-jobs-harder-sex-traffickers-realizing-made-their-job-easier.shtml\">this techdirt post</a>, <a target=\"_blank\" href=\"http://www.vox.com/culture/2018/4/13/17172762/fosta-sesta-backpage-230-internet-freedom\">this Vox story</a>, <a target=\"_blank\" href=\"https://www.theguardian.com/commentisfree/2018/mar/29/sexual-freedom-fosta-sosta\">this Guardian piece</a>, and <a target=\"_blank\" href=\"http://www.lawfareblog.com/fosta-new-anti-sex-trafficking-legislation-may-not-end-internet-its-not-good-law-either\">the Lawfare post</a> mentioned on the show. Also check out <a target=\"_blank\" href=\"http://www.allure.com/story/beauty-standards-transgender-women\">the Allure article Cindi recommended: Navigating Beauty Standards as a Trans Woman is an Impossible Balancing Act</a>. Other media mentioned include <a target=\"_blank\" href=\"https://www.youtube.com/watch?v=1l26UFQ06eQ\">SNL's Welcome to Hell</a>, <a target=\"_blank\" href=\"https://www.youtube.com/watch?v=YmkiqfmobqI\">that appalling Tony Robbins video</a>, and <a target=\"_blank\" href=\"http://itunes.apple.com/us/podcast/ep2-sexual-harassment-gone-wild/id1310885608?i=1000395494650&mt=2\">episode two of Chanel's podcast Sex Think</a>. Finally, don't forget to check out <a target=\"_blank\" href=\"http://www.consentculture.com\">consentculture.com</a> and Kitty's book <a target=\"_blank\" href=\"http://www.amazon.com/Ask-Building-Consent-Kitty-Stryker/dp/1944934251\">Ask: Building Consent Culture</a>. Correction: It was suggested that Jen is the only parent featured in the show. That is not true. Cindi is both a parent and a grandparent.",
            "length": "129309370",
            "sourceUrl": "http://traffic.libsyn.com/sexwithstrangers/sws_s01e37.mp3"
        },
        {
            "title": "Episode 38: Sex Podcasting with Sex Podcasters",
            "datePublished": "Fri, 06 Jul 2018 05:00:00 GMT",
            "description": "Chris chats with Kevin Allison from the Risk! Podcast, Sunny Megatron and Ken Melvoin-Berg from American Sex Podcast, and Cii Marqui, Jaxon, and Juice from Sex with Strangers a Grown Folks Podcast. Check out Sunny Megatron's article <a href=\"http://sunnymegatron.com/sex-clown-fetish/\" target=\"_blank\">Diary of a Sex Clown: Life Lessons From a Clown Fetishist</a> for more information on clown sex. Watch <a href=\"https://www.youtube.com/watch?v=2JESkTaX8N8\" target=\"_blank\">this video</a> for more insight into prostate massages. <a href=\"http://www.nerdist.com/sex-nerd-sandra-146-golden-showers-with-ken-melvoin-berg-sunny-megatron-and-damon-holzum/\" target=\"_blank\">Listen to this</a> to hear Ken talk extensively about water sports and then check out <a href=\"https://www.stitcher.com/podcast/sex-with-strangers-a-grown-folks-podcast/e/52520235\" target=\"_blank\">I'm Bouta BUST</a>. On a more serious note, the two stories from Risk! Dealing with domestic abuse are <a href=\"http://www.risk-show.com/podcast/the-monster-and-the-man/\" target=\"_blank\">The Monster and the Man</a> and <a href=\"http://www.risk-show.com/podcast/unbreakable/\" target=\"_blank\">Unbreakable</a>.",
            "length": "115271704",
            "sourceUrl": "http://traffic.libsyn.com/sexwithstrangers/sws_s01e38.mp3"
        },
        {
            "title": "Episode 39: Sex in Gay Bathhouses",
            "datePublished": "Thu, 02 Aug 2018 19:00:00 GMT",
            "description": "Chris chats about gay bathhouses with a handful of people, including the manager of <a href=\"http://www.clubphilly.com\" target=\"_blank\">Club Philadelphia</a> and a woman who attended bisexual night at <a href=\"http://www.hawkspdx.com\" target=\"_blank\">Hawks PDX</a>. Kevin Allison from the <a href=\"http://www.risk-show.com\" target=\"_blank\">Risk! Podcast</a> also returns to share some of his experiences at bathhouses and sex clubs around the world. And <a href=\"http://www.steamworksbaths.com/chicago\" target=\"_blank\">Steamworks Chicago</a> gets discussed quite a bit. Articles mentioned in this episode include the <a href=\"http://www.freep.com/story/news/local/michigan/detroit/2017/10/02/detroit-bathhouse-schvitz-purple-gang-mobsters-reopens/721360001/\" target=\"_blank\">Detroit Free Press profile of Schvitz</a> and the PBS NewsHour article <a href=\"http://www.pbs.org/newshour/health/8-things-didnt-know-truvadaprep\" target=\"_blank\">8 Things You Didn't Know About Truvada</a>. Please email Chris if you think you're a good fit for a future episode: chris@sexwithstrangersshow.com and follow him on social media at <a href=\"http://www.twitter.com/sexwithchris\" target=\"_blank\">twitter.com/sexwithchris</a> or find him on Snapchat: ChrisSowa.",
            "length": "109911887",
            "sourceUrl": "http://traffic.libsyn.com/sexwithstrangers/sws_s01e39.mp3"
        },
        {
            "title": "Episode 40: Legal and Illegal Sex Work in Nevada",
            "datePublished": "Wed, 17 Oct 2018 19:00:00 GMT",
            "description": "Chris travels to Nevada to chat with <a target=\"_blank\" href=\"http://www.thealicelittle.com\">Alice Little</a> and <a target=\"_blank\" href=\"https://www.twitter.com/bunnyjennyjade?lang=en\">Jenny Jade</a> from the world famous <a target=\"_blank\" href=\"http://www.bunnyranch.com\">Moonlite BunnyRanch</a> as well as stripper and cam model extraordinaire <a target=\"_blank\" href=\"https://www.twitter.com/litacrystalskul?lang=en\">Lita Crystal-Skull</a> (formerly of the <a target=\"_blank\" href=\"http://www.aliencathouse.com\">Alien Cathouse Brothel</a>) and independent Las Vegas escort <a target=\"_blank\" href=\"https://www.twitter.com/vipkatelayne?lang=en\">Kate Layne</a>. Journalist <a target=\"_blank\" href=\"http://www.luxalptraum.com\">Lux Alptraum</a> joins the conversation to talk about her <a target=\"_blank\" href=\"http://www.vox.com/the-big-idea/2018/5/29/17404736/sex-workers-nevada-fosta-sesta\">Vox article: A Push to Shutter Legal Brothels in Nevada is Based on Misguided Ideas about Sex Work</a>. And we also hear from sex researcher Roni Wiener who is working on their thesis centered on diverse orgasm experiences. Fill out this survey <a target=\"_blank\" href=\"http://www.surveymonkey.com/r/DOES2\">surveymonkey.com/r/DOES2</a> now to help Roni advance our scientific understanding of orgasms. It will only take you 15 to 25 minutes. Update: Shortly after this episode went up Dennis Hof the owner of the Moonlite BunnyRanch passed away. He was 72. Always feel free to email Chris about anything at <a href=\"mailto:chris@sexwithstrangersshow.com\">chris@sexwithstrangersshow.com</a>. You can also tweet at him: <a target=\"_blank\" href=\"https://www.twitter.com/sexwithchris?lang=en\">twitter.com/sexwithchris</a>. Find him on Snapchat: ChrisSowa. And message him on Fetlife: Chris Sowa.",
            "length": "98951968",
            "sourceUrl": "http://traffic.libsyn.com/sexwithstrangers/sws_s01e40.mp3"
        },
        {
            "title": "Episode 41: Sex and the Amish",
            "datePublished": "Mon, 05 Nov 2018 19:00:00 GMT",
            "description": "Chris chats with people who have grown up Amish. Guests include <a href=\"http://www.irawagler.com\" target=\"_blank\">Ira Wagler</a>, author of the aptly named <a href=\"https://www.amazon.com/Growing-Up-Amish-Ira-Wagler/dp/1414339364\" target=\"_blank\">Growing up Amish</a>. Misty Griffin also joins the conversation to talk about her memoir <a href=\"https://www.amazon.com/gp/product/B07FTQDN38/ref=dbs_a_def_rwt_bibl_vppi_i0\" target=\"_blank\">Tears of the Silenced</a> that soberly addresses issues related to sexual assault within the Amish. It is currently available for free in Kindle form to Amazon Prime subscribers. Always feel free to email Chris about anything at <a href=\"mailto:chris@sexwithstrangersshow.com\">chris@sexwithstrangersshow.com</a>. You can also tweet at him: <a target=\"_blank\" href=\"https://www.twitter.com/sexwithchris?lang=en\">twitter.com/sexwithchris</a>. Find him on Snapchat: ChrisSowa. And message him on Fetlife: Chris Sowa. Go to <a href=\"http://www.sexwithstrangersshow.com/\" target=\"_blank\">sexwithstrangersshow.com</a> to find links mentioned in the show.",
            "length": "120972128",
            "sourceUrl": "http://traffic.libsyn.com/sexwithstrangers/sws_s01e41.mp3"
        },
        {
            "title": "Episode 42: Sex Researchers",
            "datePublished": "Sun, 27 Jan 2019 19:00:00 GMT",
            "description": "Chris chats with sex researchers Dr. Justin Lehmiller and Roni Wiener about sexual fantasies, thinking oneself to orgasm, the importance of sex research, and much more. Justin also speaks at length about his book, Tell Me What You Want: The Science of Sexual Desire and How It Can Help You Improve Your Sex Life, which is based on the responses 4,175 American adults gave to a 369-question survey about sexual fantasies. Check out his excellent blog <a target=\"_blank\" href=\"http://www.sexandpsychology.com\">sexandpsychology.com</a> for more of Justin's musings on sex and science. You should also consider filling out Roni's <a target=\"_blank\" href=\"https://www.surveymonkey.com/r/DOES2\">diverse orgasm survey</a>. Learn more about Roni's classes and workshops at <a target=\"_blank\" href=\"http://www.sundragonrising.com\">sundragonrising.com</a>. And for more on the “replication crisis” in science check out <a target=\"_blank\" href=\"https://art19.com/shows/the-weeds/episodes/19474240-83bd-4998-96e1-d20201eaede0\">this episode of Vox's The Weeds</a> and <a target=\"_blank\" href=\"https://youarenotsosmart.com/2017/07/19/yanss-100-the-replication-crisis/\">this episode of You Are Not So Smart</a>. Always feel free to email Chris about anything at <a href=\"mailto:chris@sexwithstrangersshow.com\">chris@sexwithstrangersshow.com</a>. You can also tweet at him: <a target=\"_blank\" href=\"https://www.twitter.com/sexwithchris\">twitter.com/sexwithchris</a>. Find him on Snapchat: ChrisSowa. And message him on Fetlife: Chris Sowa. Go to sexwithstrangersshow.com to find links mentioned in the show.",
            "length": "88871816",
            "sourceUrl": "http://traffic.libsyn.com/sexwithstrangers/sws_s01e42.mp3"
        },
        {
            "title": "Episode 43: Beautiful Kinky Sex-Positive Berlin",
            "datePublished": "Sun, 31 Mar 2019 19:00:00 GMT",
            "description": "Chris travels to Berlin to chat with kinky and sex-positive Germans, including professional dominatrixes <a target=\"_blank\" href=\"http://ladyvelvetsteel.com\">Lady Velvet Steel</a> and <a target=\"_blank\" href=\"http://ladykat.weebly.com/\">Kat Rix</a>, professional submissive <a target=\"_blank\" href=\"http://www.studioluxberlin.de/cms/sonjuscha.html\">Candy Flip</a>, and queer feminist pornographer <a target=\"_blank\" href=\"http://www.cumdifferent.com\">Katybit</a>. Check out the <a target=\"_blank\" href=\"https://www.youtube.com/watch?v=sw_ees6BTSw\">music video for Even the Cutest Kittens Have Fleas</a>, Shauna's blog <a target=\"_blank\" href=\"http://www.stumblingonsexuality.com\">Stumbling on Sexuality</a>, Cosima's German-language blog <a target=\"_blank\" href=\"http://www.cusilife.de\">Cusilife</a>, and Daria's <a target=\"_blank\" href=\"http://www.etsy.com/shop/SubusedOriginal\">custom leather collars</a>. Email Chris about anything at <a href=\"mailto:chris@sexwithstrangersshow.com\">chris@sexwithstrangersshow.com</a>. Tweet at him: twitter.com/sexwithchris. Find him on Snapchat: ChrisSowa. And message him on Fetlife: Chris Sowa. Go to sexwithstrangersshow.com to find more SWS episodes or to donate to the show.",
            "length": "138707199",
            "sourceUrl": "http://traffic.libsyn.com/sexwithstrangers/sws_s01e43.mp3"
        },
        {
            "title": "Episode 44: Sex with Comedians",
            "datePublished": "Fri, 31 May 2019 19:00:00 GMT",
            "description": "Chris chats with comedians <a href=\"http://www.ihatejoelkim.com/\" target=\"_blank\">Joel Kim Booster</a>, <a href=\"http://emantertainment.com/\" target=\"_blank\">Eman El-Husseini</a>, <a href=\"http://www.eitanlevine.com\" target=\"_blank\">Eitan Levine</a>, <a href=\"https://twitter.com/elsajustelsa\" target=\"_blank\">Elsa Eli Waithe</a>, <a href=\"http://reenacalm.com\" target=\"_blank\">Reena Calm</a>, and <a href=\"http://www.saurinchoksi.com/\" target=\"_blank\">Saurin Choksi</a> about comedy and talking about sex and sexuality on stage. In addition to these hilarious comics, award-winning playwright and founder of <a href=\"http://www.camerynmoore.com/smut-slam/\" target=\"_blank\">Smut Slam</a> <a href=\"http://www.camerynmoore.com/\" target=\"_blank\">Cameryn Moore</a> also joins the conversation along with Berlin-based professional dominatrix <a href=\"http://ladyvelvetsteel.com/?lang=en\" target=\"_blank\">Lady Velvet Steel</a>. Make sure to check out Lady Velvet Steel's <a href=\"https://www.youtube.com/watch?v=ccUMwBkenuk\" target=\"_blank\">hilarious Conan segment</a> and Eitan Levine's <a href=\"https://www.youtube.com/watch?v=6VZ_dBbLxwc\" target=\"_blank\">video about joining the circus</a>. You can also sing along to <a href=\"http://www.pornhub.com/view_video.php?viewkey=ph5a281e4ea67e8\" target=\"_blank\">Hamiltoe</a> for free! Listen to Joel Kim Booster's album <a href=\"http://open.spotify.com/album/5Qug7uUePLxhNC9Q46464x\" target=\"_blank\">Model Minority</a> and Eman El-Husseini's album <a href=\"http://open.spotify.com/album/6k7WhLZXEiWJpePDZXIe2S\" target=\"_blank\">Unveiled</a> on Spotify. Watch <a href=\"https://www.youtube.com/watch?v=rrkCuavoTfA\" target=\"_blank\">Eman's 2012 Canadian special</a>. Learn more about <a href=\"http://www.goldcomedy.com/online-course/\" target=\"_blank\">Elsa Waithe's comedy class</a>. Buy <a href=\"http://www.amazon.com/Once-Pun-Time-Legend-Sighs/dp/1720375046\" target=\"_blank\">Reena Calm's book Once a Pun a Time…: Legend of a Sighs Queen</a>. And the next time you're in Brooklyn check out both of the live comedy shows Saurin Choksi produces: <a href=\"http://www.cysknyc.com/#cysknyc\" target=\"_blank\">Comedians You Should Know New York</a> and <a href=\"http://www.brownprivilege.com/comedy\" target=\"_blank\">Brown Privilege Comedy</a>. Podcasts recommended in the show include <a href=\"http://www.gimletmedia.com/shows/reply-all/wbhjbr/27-the-fever\" target=\"_blank\">episode 27 of Reply All, The Fever</a> and <a href=\"http://www.thisiscriminal.com/episode-115-cecilia-5-24-19/\" target=\"_blank\">episode 115 of Criminal, Cecilia</a>. Always feel free to email Chris about anything at <a href=\"mailto:chris@sexwithstrangersshow.com\" target=\"_blank\">chris@sexwithstrangersshow.com</a>. You can also tweet at him: twitter.com/sexwithchris. Find him on Snapchat: ChrisSowa. And message him on Fetlife: Chris Sowa. Go to sexwithstrangersshow.com if the links mentioned above aren't showing up where you're listening to the show.",
            "length": "139602137",
            "sourceUrl": "http://traffic.libsyn.com/sexwithstrangers/sws_s01e44.mp3"
        },
        {
            "title": "Episode 45: Burlesque, Boylesque, Stripping and Competitive Pole Dancing, Oh My!",
            "datePublished": "Sun, 30 Jun 2019 19:00:00 GMT",
            "description": "Chris chats with New Orleans burlesque performer the <a href=\"https://www.instagram.com/rev_spooky/\" target=\"_blank\">Reverend Spooky LeStrange</a>, burlesque performer and contortionist <a href=\"https://www.dahliafatale.com\" target=\"_blank\">Dahlia Fatale</a>, burlesque performer and programming director of <a href=\"https://www.underthegun.theater\" target=\"_blank\">Under the Gun Theater</a> <a href=\"https://www.evalafeva.com\" target=\"_blank\">Eva La Feva</a>, burlesque performer and stripper <a href=\"https://www.instagram.com/porcelain.pistol/?hl=en\" target=\"_blank\">Porcelain Pistol</a>, and burlesque/boylesque performers <a href=\"https://www.instagram.com/willylaqueue/?hl=en\" target=\"_blank\">Willy LaQueue</a> and <a href=\"https://www.instagram.com/bend.mann/?hl=en\" target=\"_blank\">Ben D. Man</a>. Willy also co-runs the <a href=\"https://www.chicagoacademyofburlesque.com\" target=\"_blank\">Chicago Academy of Burlesque</a>. Finally, this episode features a competitive pole dancer and stripper named <a href=\"https://www.instagram.com/poleyourheartout/\" target=\"_blank\">Lisa</a>. Check out <a href=\"https://www.youtube.com/watch?v=7ePDH_XDOL0\" target=\"_blank\">the Laurie Hagen reverse striptease video</a> that Dahlia mentioned. You should also watch <a href=\"https://www.vimeo.com/203208485\" target=\"_blank\">this amazing yeti striptease</a> as well as <a href=\"https://www.youtube.com/watch?v=YAAXQ7BXhh4&fbclid=IwAR1gNEHrr6oJ8EOOcowDnRqQWNAQ-SU2h4mGlV4hWCXPxf5PipI2s1BlNoc\" target=\"_blank\">this incredible pole dancing video featuring Felix Cane</a> that Lisa recommended. FKA Twigs' recent <a href=\"https://www.youtube.com/watch?v=YkLjqFpBh84\" target=\"_blank\">music video for Cellophane</a> also features pole dancing and is definitely worth your time. Aspiring legal scholars can find a <a href=\"http://library.amlegal.com/nxt/gateway.dll/Illinois/chicago_il/title4businessesoccupationsandconsumerpr/chapter4-60liquordealers?f=templates$fn=default.htm$3.0$vid=amlegal:chicago_il\" target=\"_blank\">link to Chicago municipal code 4-60-140 here</a>. You need to scroll down to find it. Correction: Dahlia Fatale did not perform the sexy water act described in the show at the BHoF Tournament of Tease. In addition, only two of the guests (Dahlia and Willy) featured in this episode (rather than 3) teach at the Chicago Academy of Burlesque. We regret the errors. Always feel free to email Chris about anything at <a href=\"mailto:chris@sexwithstrangersshow.com\" target=\"_blank\">chris@sexwithstrangersshow.com</a>. You can also tweet at him: <a href=\"https://www.twitter.com/sexwithchris\" target=\"_blank\">twitter.com/sexwithchris</a>. Find him on Snapchat: ChrisSowa. And message him on Fetlife: Chris Sowa. Go to <a href=\"http://www.sexwithstrangersshow.com\" target=\"_blank\">sexwithstrangersshow.com</a> if the hyperlinks are not compatible with your podcast platform.",
            "length": "113739396",
            "sourceUrl": "http://traffic.libsyn.com/sexwithstrangers/sws_s01e45.mp3"
        },
        {
            "title": "Episode 46: Sex with Swingers",
            "datePublished": "Sun, 15 Sep 2019 19:00:00 GMT",
            "description": "Chris chats with a variety of swingers about  all things swinging lifestyle, including three couples with lifestyle podcasts of their own: Bomber and Belle from the <a href=\"https://www.amourgetaways.com/2018/09/29/the-black-n-kinky-podcast/\" target=\"_blank\">Black N Kinky Lifestyle podcast</a>, Richard and Lauren from the <a href=\"https://room77life.com/category/podcast/\" target=\"_blank\">Room 77 podcast</a> and Angela and Bradford from <a href=\"http://bythebi.com.au/\" target=\"_blank\">By the Bi</a>. The owners of two lifestyle clubs, <a href=\"http://www.clubsinz.com\" target=\"_blank\">Club SINZ</a> in Massachusetts and <a href=\"http://www.nmclubhouse.com\" target=\"_blank\">The New Mexico Clubhouse</a>, also join the conversation. Always feel free to email Chris about anything at <a href=\"mailto:chris@sexwithstrangersshow.com\" target=\"_blank\">chris@sexwithstrangersshow.com</a>. You can also tweet at him: <a href=\"https://www.twitter.com/sexwithchris\" target=\"_blank\">twitter.com/sexwithchris</a>. Find him on Snapchat: ChrisSowa. And message him on Fetlife: Chris Sowa. Go to <a href=\"http://www.sexwithstrangersshow.com\" target=\"_blank\">sexwithstrangersshow.com</a> if any of the above links are not compatible with your podcast platform.",
            "length": "122091736",
            "sourceUrl": "http://traffic.libsyn.com/sexwithstrangers/sws_s01e46.mp3"
        },
        {
            "title": "Episode 47: San Francisco Sextacular: Folsom Street Fair, Bawdy Storytelling's Dixie De La Tour, and Legendary Leatherman Race Bannon",
            "datePublished": "Thu, 24 Oct 2019 19:00:00 GMT",
            "description": "Chris chats with a variety of kinksters at San Francisco's Folsom Street Fair 2019, including <a target=\"_blank\" href=\"http://www.kinkysalon.com\">Kinky Salon's</a> Polly Superstar. <a target=\"_blank\" href=\"http://www.bannon.com/author/race-bannon/\">Race Bannon</a> provides some insights into the history of Folsom as well as kink and leather in San Francisco. And Dixie De La Tour Talks about <a target=\"_blank\" href=\"http://www.bawdystorytelling.com\">Bawdy Storytelling</a>, San Francisco, and being a sexual folklorist. Articles discussed in this episode include the Buzzfeed piece <a target=\"_blank\" href=\"https://www.buzzfeednews.com/article/katienotopoulos/silicone-genital-injection-death-tank-hafertepen\">When a Blogger Died from Silicone Genital Injections, his Fans Blamed his Partner</a> and the New York Times article from this past summer entitled <a target=\"_blank\" href=\"https://www.nytimes.com/2019/06/26/us/pride-parade-police-cops.html\">Do Police Belong at Pride? Marches Face a Difficult Question</a>. Don't forget about our FREE live podcast recording in Chicago on Wednesday Nov 6th at 8pm at The Pleasure Chest located at 3436 N Lincoln Ave in Chicago. It's going to be a live conversation with NYT columnist and author of the Vagina Bible Dr Jen Gunter. We will also have live stand up comedy from hilarious comedian Correy Bell. No tickets necessary. You can simply show up. But it would be great if you RSVPed at one of these three places: <a target=\"_blank\" href=\"https://www.facebook.com/events/743656289435515/\">facebook.com/events/743656289435515/</a>, <a target=\"_blank\" href=\"https://www.fetlife.com/events/849649\">fetlife.com/events/849649</a>, <a target=\"_blank\" href=\"https://www.brownpapertickets.com/event/4426349\">https://www.brownpapertickets.com/event/4426349</a>. Always feel free to email Chris about anything at <a target=\"_blank\" href=\"mailto:chris@sexwithstrangersshow.com\">chris@sexwithstrangersshow.com</a>. You can also tweet at him: <a target=\"_blank\" href=\"https://www.twitter.com/sexwithchris\">twitter.com/sexwithchris</a>. Find him on Snapchat: ChrisSowa and Instagram: <a target=\"_blank\" href=\"https://www.instagram.com/chrisinamerica\">chrisinamerica</a>. And message him on Fetlife: Chris Sowa. Go to <a target=\"_blank\" href=\"http://www.sexwithstrangersshow.com\">sexwithstrangersshow.com</a> if the hyperlinks are not compatible with your podcast platform.",
            "length": "71571547",
            "sourceUrl": "http://traffic.libsyn.com/sexwithstrangers/sws_s01e47.mp3"
        },
        {
            "title": "Episode 48: LIVE from Chicago with Dr Jen Gunter and Comedian Correy Bell",
            "datePublished": "Mon, 18 Nov 2019 16:00:00 GMT",
            "description": "Chris interviews New York Times contributor, OBGYN, and author of the <a target=\"_blank\" href=\"https://www.amazon.com/dp/B07L25YWR1/ref=dp-kindle-redirect?_encoding=UTF8&btkr=1\">Vagina Bible</a> <a target=\"_blank\" href=\"http://www.drjengunter.com\">Dr Jen Gunter</a> in front of a live audience at the Pleasure Chest in Chicago. Hilarious comedian <a target=\"_blank\" href=\"https://www.instagram.com/correyb/?hl=en\">Correy Bell</a> also performs. Always feel free to email Chris about anything at <a href=\"mailto:chris@sexwithstrangersshow.com\">chris@sexwithstrangersshow.com</a>. You can also tweet at him: <a target=\"_blank\" href=\"https://www.twitter.com/sexwithchris\">twitter.com/sexwithchris</a>. Find him on Snapchat: ChrisSowa. Instagram: <a target=\"_blank\" href=\"https://www.instagram.com/chrisinamerica\">chrisinamerica</a>. And Fetlife: Chris Sowa. Go to <a target=\"_blank\" href=\"https://www.sexwithstrangersshow.com\">sexwithstrangersshow.com</a> if the hyperlinks in these show notes are not compatible with your podcast platform.",
            "length": "76522213",
            "sourceUrl": "http://traffic.libsyn.com/sexwithstrangers/sws_s01e48.mp3"
        },
        {
            "title": "Episode 49: Sex and Sugar Dating",
            "datePublished": "Fri, 20 Dec 2019 14:00:00 GMT",
            "description": "Chris discusses sugar dating with 5 sugar babies and one sugar daddy. Guests include <a href=\"https://www.instagram.com/siouxsieqmedia/?hl=en\" target=\"_blank\">Siouxsie Q</a>, Taylor B. Jones from <a href=\"https://thesugardaddyformula.com/\" target=\"_blank\">The Sugar Daddy Formula</a> and Ruby and Sara-Mae Tuson from <a href=\"https://fablegazers.libsyn.com/\" target=\"_blank\">The Sugar Baby Confessionals</a>. Always feel free to email Chris about anything at <a href=\"mailto:chris@sexwithstrangersshow.com\" target=\"_blank\">chris@sexwithstrangersshow.com</a>. You can also tweet at him: <a href=\"https://www.twitter.com/sexwithchris\" target=\"_blank\">twitter.com/sexwithchris</a>. Find him on Snapchat: ChrisSowa. Instagram: <a href=\"https://www.instagram.com/chrisinamerica\" target=\"_blank\">chrisinamerica</a>. And Fetlife: Chris Sowa. Go to <a href=\"http://sexwithstrangersshow.com\" target=\"_blank\">sexwithstrangersshow.com</a> if the links in these show notes are not compatible with your podcast platform.",
            "length": "83642107",
            "sourceUrl": "http://traffic.libsyn.com/sexwithstrangers/sws_s01e49.mp3"
        },
        {
            "title": "Episode 50: Sex with Asexuals and Aromantics",
            "datePublished": "Mon, 3 Feb 2020 13:00:00 GMT",
            "description": "Chris chats with asexuals and aromantics about sex, fantasies, masturbation, non-sexualized kink, attraction, romantic relationships, fan fiction, stigma, representation, misconceptions about being ace and aro, and what it means to be queer, among many other topics. Guests include <a href=\"https://www.drpragatisingh.com\" target=\"_blank\">Dr. Pragati Singh</a>, founder of <a href=\"http://www.indianaces.org/\" target=\"_blank\">Indian Aces</a> and one of the <a href=\"https://www.bbc.com/news/world-50042279\" target=\"_blank\">BBC's 100 Inspiring and Influential Women of 2019</a>, Courtney Lang, host of the <a href=\"https://podcasts.apple.com/us/podcast/a-ok/id1469541675\" target=\"_blank\">A OK podcast</a>, asexual lingerie model <a href=\"https://www.twitter.com/theyasminbenoit\" target=\"_blank\">Yasmin Benoit</a>, writer, activist and former sex worker <a href=\"https://www.twitter.com/kittystryker\" target=\"_blank\">Kitty Stryker</a>, author and activist <a href=\"https://www.sandrabellamy.com\" target=\"_blank\">Sandra Bellamy</a>, and model, photographer, and social media influencer <a href=\"https://www.instagram.com/nikhampshire/?hl=en\" target=\"_blank\">Nik Hampshire</a>, among others. Watch Nik's video <a href=\"https://www.youtube.com/watch?v=V_MlgfFVBt8\" target=\"_blank\">Being Aromantic (while not asexual)</a>. Check out Sandra Bellamy's <a href=\"https://www.youtube.com/channel/UC0I1Z16B5Z7m1yS6835jGHQ\" target=\"_blank\">Youtube Channel</a> and <a href=\"https://amzn.to/37OvLUA\" target=\"_blank\">book</a>. Read Kitty Stryker's article <a href=\"https://www.good.is/articles/sex-worker-asexual-sm\" target=\"_blank\">I'm An Asexual Sex Worker – And It's Not As Complex As It Seems</a>. Listen to episode 79 of the Allusionist <a href=\"https://www.theallusionist.org/allusionist/queer\" target=\"_blank\">“Queer”</a> and all of <a href=\"https://podcasts.apple.com/us/podcast/a-ok/id1469541675\" target=\"_blank\">A OK</a>. Finally, <a href=\"https://www.paypal.com/paypalme2/drpragati\" target=\"_blank\">support Dr. Singh’s work here</a>. Always feel free to email Chris about anything at <a href=\"mailto:chris@sexwithstrangersshow.com\" target=\"_blank\">chris@sexwithstrangersshow.com</a>. You can also tweet at him: <a href=\"https://www.twitter.com/sexwithchris\" target=\"_blank\">twitter.com/sexwithchris</a>. Find him on Snapchat: ChrisSowa. Instagram: <a href=\"https://www.instagram.com/chrisinamerica\" target=\"_blank\">chrisinamerica</a>. And Fetlife: Chris Sowa. Go to <a href=\"http://www.sexwithstrangersshow.com\" target=\"_blank\">sexwithstrangersshow.com</a> if the links in these show notes are not compatible with your podcast platform.",
            "length": "125851817",
            "sourceUrl": "http://traffic.libsyn.com/sexwithstrangers/sws_s01e50.mp3"
        },
        {
            "title": "Episode 51: Sex with Cam Girls",
            "datePublished": "Thu, 19 Mar 2020 11:59:59 GMT",
            "description": "Chris Chats with cam performers <a target=\"_blank\" href=\"twitter.com/littleredbunnyx?lang=en\">LittleRedBunny</a>, <a target=\"_blank\" href=\"twitter.com/lilimissarab?lang=en\">LiliMissArab</a>, <a target=\"_blank\" href=\"twitter.com/mayabum_live\">Maya Bum</a>, <a target=\"_blank\" href=\"twitter.com/misslollipopmfc?lang=en\">Miss Lollipop</a>, <a target=\"_blank\" href=\"witter.com/angelicaveexxx?lang=en\">Angelica Vee</a>, and one cam show viewer named David about the current state of the webcam industry. Check out <a target=\"_blank\" href=\"littleredbunny.com/littleredacademy/\">LittleRedBunny Academy</a> if you'd like to be coached by a camming legend. Current models and studio owners should <a target=\"_blank\" href=\"littleredbunny.com/littleredacademysurvey\">go here</a> to fill out her 2nd Annual State of the Webcam Industry survey. Always feel free to email Chris about anything at <a href=\"mailto:chris@sexwithstrangersshow.com\" target=\"_blank\">chris@sexwithstrangersshow.com</a>. You can also tweet at him: <a href=\"https://www.twitter.com/sexwithchris\" target=\"_blank\">twitter.com/sexwithchris</a>. Find him on Snapchat: ChrisSowa. Instagram: <a href=\"https://www.instagram.com/chrisinamerica\" target=\"_blank\">chrisinamerica</a>. And Fetlife: Chris Sowa. Go to <a href=\"http://www.sexwithstrangersshow.com\" target=\"_blank\">sexwithstrangersshow.com</a> if the links in these show notes are not compatible with your podcast platform.",
            "length": "105511819",
            "sourceUrl": "http://traffic.libsyn.com/sexwithstrangers/sws_s01e51.mp3"
        },
        {
            "title": "Episode 52: Trans Cam Girl Miss Redline",
            "datePublished": "Tue, 14 Apr 2020 11:00:01 GMT",
            "description": "<a target=\"_blank\" href=\"https://www.twitter.com/MissRedline\">Miss Redline</a> chats with Chris about being a cam girl, the challenges of growing up queer in the Bible Belt, and navigating the world as a trans woman. If you're looking for trans-affirming trans porn sites check out <a target=\"_blank\" href=\"https://leatherati.com/dirty-great-trans-positive-and-trans-inclusive-porn-sites-530f83667e30\">this 2013 list</a> from Leatherati, <a target=\"_blank\" href=\"https://www.cosmopolitan.com/uk/love-sex/sex/a23676859/trans-porn/\">this more recent one</a> from Cosmopolitan, and <a target=\"_blank\" href=\"https://www.huffpost.com/entry/the-radical-potential-of-trans-kink-porn_b_58c0944fe4b0a797c1d398c9?guccounter=1&guce_referrer=aHR0cHM6Ly93d3cuZ29vZ2xlLmNvbS8&guce_referrer_sig=AQAAAD-fIyqgXY1m3_vCGam8ExmwFS9hWyLAVCeV0YLVhLSKFsSYzSd9XhsNe2n1SP0gf2In_eebzdi-jTbkVCgfszTyH5pCZTvjygmRqsqaXGXEgdQ1ME_0RnEf48X6wA0hJWwbjcRwhYkL1jwqQvJD5UcDyahS56j5kAAKNUYZ4Dqr\">this HuffPost article</a>. Always feel free to email Chris about anything at <a href=\"mailto:chris@sexwithstrangersshow.com\" target=\"_blank\">chris@sexwithstrangersshow.com</a>. You can also tweet at him: <a href=\"https://www.twitter.com/sexwithchris\" target=\"_blank\">twitter.com/sexwithchris</a>. Find him on Snapchat: ChrisSowa. Instagram: <a href=\"https://www.instagram.com/chrisinamerica\" target=\"_blank\">chrisinamerica</a>. And Fetlife: Chris Sowa. Go to <a href=\"http://www.sexwithstrangersshow.com\" target=\"_blank\">sexwithstrangersshow.com</a> if the links in these show notes are not compatible with your podcast platform.",
            "length": "53692204",
            "sourceUrl": "http://traffic.libsyn.com/sexwithstrangers/sws_s01e52.mp3"
        },
        {
            "title": "Episode 53: Dating From Behind Masks",
            "datePublished": "Tue, 22 Apr 2020 04:00:01 GMT",
            "description": "Celeste and Rick met online in the middle of the COVID-19 pandemic. This is the story of them trying to in-person date while social distancing. Always feel free to email Chris about anything at <a href=\"mailto:chris@sexwithstrangersshow.com\" target=\"_blank\">chris@sexwithstrangersshow.com</a>. You can also tweet at him: <a href=\"https://www.twitter.com/sexwithchris\" target=\"_blank\">twitter.com/sexwithchris</a>. Find him on Snapchat: ChrisSowa. Instagram: <a href=\"https://www.instagram.com/chrisinamerica\" target=\"_blank\">chrisinamerica</a>. And Fetlife: Chris Sowa. Go to <a href=\"http://www.sexwithstrangersshow.com\" target=\"_blank\">sexwithstrangersshow.com</a> if the links in these show notes are not compatible with your podcast platform.",
            "length": "39731841",
            "sourceUrl": "http://traffic.libsyn.com/sexwithstrangers/sws_s01e53.mp3"
        },
        {
            "title": "Episode 54: Black Trans Talk with the Hosts of Marsha's Plate",
            "datePublished": "Fri, 8 May 2020 04:00:01 GMT",
            "description": "Chris chats with Diamond Stylz, Mia Mix, and Zee from Marsha's Plate Black Trans Talk podcast. Articles discussed on the show include <a target=\"_blank\" href=\"https://www.nbcnews.com/feature/nbc-out/trump-administration-rolls-back-obama-era-health-care-protections-transgender-n1009851\">Trump Administration Rolls Back Obama-Era Health Care Protections for Transgender People</a> and <a target=\"_blank\" href=\"https://www.pbs.org/wgbh/frontline/article/trump-administration-environmental-rollbacks-epa-coronavirus/\">During the Coronavirus Crisis, the Trump Administration's Environmental Rollbacks Continue</a>. Always feel free to email Chris about anything at <a href=\"mailto:chris@sexwithstrangersshow.com\" target=\"_blank\">chris@sexwithstrangersshow.com</a>. You can also tweet at him: <a href=\"https://www.twitter.com/sexwithchris\" target=\"_blank\">twitter.com/sexwithchris</a>. Find him on Snapchat: ChrisSowa. Instagram: <a href=\"https://www.instagram.com/chrisinamerica\" target=\"_blank\">chrisinamerica</a>. And Fetlife: Chris Sowa. Go to <a href=\"http://www.sexwithstrangersshow.com\" target=\"_blank\">sexwithstrangersshow.com</a> if the links in these show notes are not compatible with your podcast platform.",
            "length": "68611801",
            "sourceUrl": "http://traffic.libsyn.com/sexwithstrangers/sws_s01e54.mp3"
        },
        {
            "title": "Episode 55: Sex on TV and Film with Hollywood Intimacy Coordinators",
            "datePublished": "Sat, 18 Jul 2020 16:00:01 GMT",
            "description": "Amanda Blumenthal and Jean Franzblau are two of the world's very first intimacy coordinators. They joined Chris to discuss making Hollywood sex and nudity scenes more consensual, inclusive and authentic. Amanda's website is <a target=\"_blank\" href=\"https://www.intimacycoordinator.com\">intimacycoordinator.com</a> and her organization, the IPA, can be found at <a target=\"_blank\" href=\"https://www.intimacyprofessionalsassociation.com\">intimacyprofessionalsassociation.com</a>. Jean's website is <a target=\"_blank\" href=\"https://www.hollywoodintimacycoordinator.com\">hollywoodintimacycoordinator.com</a>. You can learn more about Cuddle Sanctuary at <a target=\"_blank\" href=\"https://www.cuddlesanctuary.com\">cuddlesanctuary.com</a> and find out more about Jean's work as a sex educator at <a target=\"_blank\" href=\"https://www.sexualesteemwithjean.com\">sexualesteemwithjean.com</a>. Always feel free to email Chris about anything at <a href=\"mailto:chris@sexwithstrangersshow.com\" target=\"_blank\">chris@sexwithstrangersshow.com</a>. You can also tweet at him: <a href=\"https://www.twitter.com/sexwithchris\" target=\"_blank\">twitter.com/sexwithchris</a>. Find him on Snapchat: ChrisSowa. Instagram: <a href=\"https://www.instagram.com/chrisinamerica\" target=\"_blank\">chrisinamerica</a>. And Fetlife: Chris Sowa. Go to <a href=\"http://www.sexwithstrangersshow.com\" target=\"_blank\">sexwithstrangersshow.com</a> if the links in these show notes are not compatible with your podcast platform.",
            "length": "67977031",
            "sourceUrl": "http://traffic.libsyn.com/sexwithstrangers/sws_s01e55.mp3"
        }
    ]
}