{
    "artwork": "http://is5.mzstatic.com/image/thumb/Music111/v4/45/f7/e7/45f7e7c8-3300-5fd6-cc07-21a777c06ca5/source/100x100bb.jpg",
    "description": "Knowledge and inspiration from leading ecommerce experts. Brought to you by Shopify.",
    "feedURL": "https://feedpress.me/shopify-masters",
    "podcastURL": "https://www.shopify.com/podcasts/shopify-masters",
    "publisher": "braveen.kumar@shopify.com (Shopify)",
    "title": "Shopify Masters",
    "episodes": [
        {
            "title": "Art of Reinventing: How This Bicycle Company Refines Its Products",
            "datePublished": "Tue, 10 Nov 2020 04:30:00 +0000",
            "description": "<p>In this episode, you’ll learn from an entrepreneur how they extended the demand for bicycles and where to get the best feedback for your product. </p><p>Brooklyn Bicycle Company manufactures bicycles & bicycle accessories to help people move around cities.</p><p>For more on Brookly Bicycle Co. and show notes: <a href=\"https://www.shopify.com/blog/brooklyn-bicycle-product-development\">https://www.shopify.com/blog/brooklyn-bicycle-product-development</a> </p><h3>Tune in to learn</h3><ul><li>How they sold as year’s worth of bikes in one quarter alone and the logistics involved</li><li>The 3 ways to compete in a marketplace</li><li>How they use showrooms to learn why people did and didn’t buy</li></ul>\n",
            "length": "49406991",
            "sourceUrl": "https://feedpress.me/link/16512/14049634/default_tc.mp3",
            "epNo": "299"
        },
        {
            "title": "Adapting to the Times: Three Unique Approaches to Black Friday Cyber Monday",
            "datePublished": "Tue, 3 Nov 2020 04:30:00 +0000",
            "description": "<p>From bypassing discounts to incorporating social impact, for more on how these three previous guests  are planning for BFCM and show notes: <a href=\"https://www.shopify.com/blog/shopify-masters-bfcm-roundup\">https://www.shopify.com/blog/shopify-masters-bfcm-roundup</a></p>\n",
            "length": "48285180",
            "sourceUrl": "https://feedpress.me/link/16512/14023610/default_tc.mp3",
            "epNo": "298"
        },
        {
            "title": "How a Beverage Brand Fills the Cups of Many",
            "datePublished": "Tue, 27 Oct 2020 04:30:00 +0000",
            "description": "<p>In this episode of Shopify Masters, we chat with Rod Johnson of <a href=\"https://blkandbold.com/pages/a-little-about-us\">BLK&Bold</a> on the importance of representation, creating change within communities, and plans for the future.  </p><p>For more on BLK&Bold and show notes: <a href=\"https://www.shopify.com/blog/blk-bold-social-impact\">https://www.shopify.com/blog/blk-bold-social-impact</a>  </p><h3>Tune in to learn </h3><ul><li>Why Rod and Pernell left their corporate careers to start an impactful business</li><li>How BLK&Bold established their retail relationships</li><li>The importance of scalability when building a business model</li></ul>\n",
            "length": "38830657",
            "sourceUrl": "https://feedpress.me/link/16512/14012141/default_tc.mp3",
            "epNo": "296"
        },
        {
            "title": "Building A Niche Board Games Business By Crowdfunding A Million Dollars",
            "datePublished": "Tue, 20 Oct 2020 04:30:00 +0000",
            "description": "<p>This week we are chatting with Dan Blacklock of BoxThrone about crowdfunding, SEO, and customer experience.</p><p>For more on BoxThrone and show notes: <a href=\"https://www.shopify.com/blog/boxthrone-crowdfunding\">https://www.shopify.com/blog/boxthrone-crowdfunding</a></p><h3>Tune in to learn </h3><ul><li>What factors led to the success of their $900,000 Kickstarter campaign</li><li>What are the critical steps to take after your crowdfunding campaign ends</li><li>Why your SEO efforts should be focused on ranking high for Google Image Search results</li></ul>\n",
            "length": "50033508",
            "sourceUrl": "https://feedpress.me/link/16512/13987195/default_tc.mp3",
            "epNo": "295"
        },
        {
            "title": "Using TikTok to Generate 15,000 Sales in One Day",
            "datePublished": "Tue, 13 Oct 2020 04:30:00 +0000",
            "description": "<p>You'll learn from an entrepreneur who used the power of TikTok that led to selling out their entire inventory for 6 months. </p><p>For more on Peace Out Skincare and show notes: <a href=\"https://www.shopify.com/blog/peace-out-skingcare-tiktok\">https://www.shopify.com/blog/peace-out-skingcare-tiktok</a>  </p><h3>Tune in to learn </h3><ul><li>When should you invent a new product or simply improve on an existing product </li><li>How they use TikTok to acquire new customers </li><li>The unique benefits of SMS marketing </li></ul>\n",
            "length": "36396343",
            "sourceUrl": "https://feedpress.me/link/16512/13948066/default_tc.mp3",
            "epNo": "294"
        },
        {
            "title": "7 Tips for Building a 7-Figure Business",
            "datePublished": "Tue, 6 Oct 2020 04:30:00 +0000",
            "description": "<p>In this episode, you'll learn from an entrepreneur who built her business from a personal need by creating stylish blue light glasses that merge fashion with function. Klassy Network since expanded to clothing and accessories. </p><p>For more on Klassy Network and show notes: <a href=\"https://www.shopify.com/blog/klassy-network-social-marketing\">https://www.shopify.com/blog/klassy-network-social-marketing</a>   </p><h3>Tune in to learn </h3><ul><li>What is their 321 strategy that grew their Instagram to their first 1000 followers </li><li>The criteria they look at to evaluate business opportunities and ideas </li><li>Should you or should you not outsource your Facebook ads to an agency </li></ul>\n",
            "length": "50683021",
            "sourceUrl": "https://feedpress.me/link/16512/13932701/default_tc.mp3",
            "epNo": "293"
        },
        {
            "title": "The Scientific Way to Generate and Test Business Ideas",
            "datePublished": "Tue, 29 Sep 2020 04:30:15 +0000",
            "description": "<p>We chat with Stefan Gehrig of King Kong Apparel on product development, prelaunch strategies, and how to generate repeat sales. </p><p>King Kong Apparel is the makers of high-quality bags and backpacks for serious athletes. </p><p>For more on King Kong Apparel and show notes: <a href=\"https://www.shopify.com/blog/king-kong-apparel-prelaunch  \">https://www.shopify.com/blog/king-kong-apparel-prelaunch</a>  </p><h3>Tune in to learn </h3><ul><li>How to use the scientific method to come up with a business idea </li><li>How to drive traffic to a pre-order page </li><li>How to build up excitement for new product releases </li></ul>\n",
            "length": "47194317",
            "sourceUrl": "https://feedpress.me/link/16512/13920129/ep379-kingkongapparel_tc.mp3",
            "epNo": "292"
        },
        {
            "title": "The Power of Data and Feedback for Growing a New Brand",
            "datePublished": "Tue, 22 Sep 2020 04:30:07 +0000",
            "description": "<p>You'll learn from an entrepreneur who used consultations to quickly evolve and adapt his business over time.  <br /><br />The Nue Co. helps people redefine their relationship with good health and how supplements play a part in that. </p><p>For more on The Nue Co. and show notes: <a href=\"https://www.shopify.com/blog/the-nue-co-data\">https://www.shopify.com/blog/the-nue-co-data</a>  </p><h3>Tune in to learn </h3><ul><li>How to use consultation surveys to learn exactly how to market to your customers </li><li>The most challenging part of having a 12-month product development process </li><li>Why they chose to advertise using billboards </li></ul>\n",
            "length": "43154317",
            "sourceUrl": "https://feedpress.me/link/16512/13911979/ep378-thenueco_tc.mp3",
            "epNo": "291"
        },
        {
            "title": "The Journey of a Million-Dollar Customized Jewelry Brand",
            "datePublished": "Tue, 15 Sep 2020 04:30:06 +0000",
            "description": "<p>For more on Revival Jewelry and show notes: <a href=\"https://www.shopify.com/blog/revivial-jewlery-crowdsource\">https://www.shopify.com/blog/revivial-jewlery-crowdsource</a>   </p><h3>Tune in to learn </h3><ul><li>How to manage a business that requires customization for every product </li><li>How they crowdsource the design of their jewelry </li><li>How they market their business when 50% of their customers are buying products as gifts </li></ul>\n",
            "length": "48199090",
            "sourceUrl": "https://feedpress.me/link/16512/13911980/ep377-revivaljewelry_tc.mp3",
            "epNo": "290"
        },
        {
            "title": "Using Life Savings To Kickstart A Planner Business",
            "datePublished": "Tue, 8 Sep 2020 04:30:02 +0000",
            "description": "<p>We chat with Marissa Groots from STIL on how to scale a side hustle, working with large retailers, and how to stay creative with marketing strategies.  </p><p>STIL a company that aims to design organizational products that inspire women to feel, work, and find their best selves. </p><p>For more on STIL and show notes: <a href=\"www.shopify.com/blog/stil-marketing\">www.shopify.com/blog/stil-marketing</a>  </p><h3>Tune in to learn</h3><ul><li>How she was able to sell out her first production run using her life savings  </li><li>Why the moved from focusing on big influencers to featuring their customers into brand ambassadors </li><li>How she turned a seasonal business into predictive and stable revenue throughout the year </li></ul><p> </p>\n",
            "length": "36804642",
            "sourceUrl": "https://feedpress.me/link/16512/13911981/ep376-stil_tc.mp3",
            "epNo": "289"
        },
        {
            "title": "Achieving High Conversion Rates in a Saturated Market",
            "datePublished": "Tue, 1 Sep 2020 04:30:23 +0000",
            "description": "<p>In this episode of Shopify Masters, we chat with Dean Legg of PureChimp about social media ads and how to achieve high conversion rates in a saturated market.  </p><p>PureChimp sells Feel good Japanese matcha green tea and  100% natural skincare. </p><p>For more on PureChimp and show notes: <a href=\"https://shopify.com/blog/purechimp-social-ads\">https://shopify.com/blog/purechimp-social-ads</a> </p><h3>Tune in to learn</h3><ul><li>How to increase your conversion rate</li><li>What to do when you see a lot of competition entering your market</li><li>The pros and cons of the different paid advertising platforms</li></ul>\n",
            "length": "45998112",
            "sourceUrl": "https://feedpress.me/link/16512/13911982/ep375-purechimp_tc.mp3",
            "epNo": "288"
        },
        {
            "title": "The Pre-Launch Strategies of A Million-Dollar Brand",
            "datePublished": "Tue, 25 Aug 2020 04:30:02 +0000",
            "description": "<p>In this episode, you'll learn from entrepreneurs how they built and scale an online business by only using Instagram.</p><p>Healthish sells health-based products that help you live a 'healthish' lifestyle. </p><p>For more on Healthish and show notes: <a href=\"https://www.shopify.com/blog/healthish-influencer-marketing\">https://www.shopify.com/blog/healthish-influencer-marketing</a>  </p><h3>Tune in to learn </h3><ul><li>What is a golden trifecta rule for choosing products </li><li>How to identify Influencers to do Instagram influencer marketing </li><li>What is an ideal Influencer marketing deal </li></ul>\n",
            "length": "53413962",
            "sourceUrl": "https://feedpress.me/link/16512/13911983/ep374-healthish_tc.mp3",
            "epNo": "287"
        },
        {
            "title": "How 2 Teachers Started a 7-Figure T-Shirt Business",
            "datePublished": "Tue, 18 Aug 2020 04:30:07 +0000",
            "description": "<p>You'll learn from an entrepreneur on how they built a 7 figure T-shirt business and how they differentiated in a saturated market. Tumbleweed TexStyles is a Texas-inspired lifestyle apparel brand that was started by two high school teachers with a passion for fashion, music, outdoors, food and culture. </p><p>For more on Tumbleweed TexStyles  and show notes: <a href=\"http://shopify.com/blog/tumbleweed-texstyles-side-hustle\">http://shopify.com/blog/tumbleweed-texstyles-side-hustle</a>  </p><h3>Tune in to learn </h3><ul><li>What should T-shirt entrepreneurs not to waste their time and money on </li><li>How to test and design before moving into production </li><li>What is the best time to email your customers </li></ul>\n",
            "length": "48838990",
            "sourceUrl": "https://feedpress.me/link/16512/13911984/tumbleweedtestyles_tc.mp3",
            "epNo": "286"
        },
        {
            "title": "Pizza In The Post: How Pizza Pilgrims Moved Their Restaurants Online",
            "datePublished": "Tue, 11 Aug 2020 04:00:27 +0000",
            "description": "<p>Thom and James Elliot are the brothers and owners behind Pizza Pilgrims, a chain pizzerias in London and Oxford, United Kingdom. From road tripping and learning throughout Italy for a summer to hustling at street markets to operating 13 locations, The Elliot brothers had to pivot quickly when the impacts of COVID-19 closed their restaurants’ doors.</p><p>For more on Pizza Pilgrims and show notes: <a href=\"https://www.shopify.com/blog/blog/pizza-pilgrims-pivot\">https://www.shopify.com/blog/blog/pizza-pilgrims-pivot</a></p><p>In this episode you will hear: </p><ul><li>How Pizza Pilgrims transited from a street vendor into a chain of restaurants </li><li>How to establish employee retention programs within the hospitality industry </li><li>The process of creating mailable pizzas and moving a restaurant online </li></ul>\n",
            "length": "53305796",
            "sourceUrl": "https://feedpress.me/link/16512/13911985/pizza-pilgrims-final_tc.mp3",
            "epNo": "285"
        },
        {
            "title": "Catch-Up with 3 Previous Guests: Growing Through COVID-19",
            "datePublished": "Tue, 4 Aug 2020 04:30:09 +0000",
            "description": "<p>In this episode, you'll hear from: </p><ul><li>Chris Meade from CROSSNET on how they experienced a 500% increase in sales</li><li>Jess Ekstrom from Headbands of Hope on their masks donation program</li><li>Gamal Codner from Fresh Heritage on tripling  their marketing budget</li></ul><p>For more on our guests and show notes: <a href=\"https://www.shopify.com/blog/shopify-masters-catch-up-2\">https://www.shopify.com/blog/shopify-masters-catch-up-2</a>  </p>\n",
            "length": "42002011",
            "sourceUrl": "https://feedpress.me/link/16512/13911986/ep371-covid19-compile2_tc.mp3",
            "epNo": "284"
        },
        {
            "title": "Best of Both Worlds: Ethical Fashion Label and YouTube Success",
            "datePublished": "Tue, 28 Jul 2020 04:30:10 +0000",
            "description": "<p>Going against industry conventions, Justine Leconte created her namesake label by focusing on ethical production, selling direct to consumers, and building a Youtube channel. In this episode of Shopify Masters, Justine Leconte  shares her launch roadmap, thoughts on the fashion industry, and journey on Youtube. </p><p>Justine is a French fashion designer creating ethical clothing for all body types. </p><p>For more on Justine Leconte and show notes: <a href=\"https://www.shopify.com/blog/justine-leconte-youtube\">https://www.shopify.com/blog/justine-leconte-youtube</a>  </p><h3>Tune in to learn </h3><ul><li>Why fast fashion is a bad business model </li><li>How to grow your YouTube channel to your first 1,000 subscribers </li><li>How to create a giveaway that generates a lot of attention </li></ul>\n",
            "length": "33134106",
            "sourceUrl": "https://feedpress.me/link/16512/13911987/ep369-justineleconte-redo_tc.mp3",
            "epNo": "283"
        },
        {
            "title": "Turning Your Passion Project into a Seven Figure Business",
            "datePublished": "Tue, 21 Jul 2020 16:16:29 +0000",
            "description": "<p>You'll learn from an entrepreneur who launched his passion project and eventually became a 7 figure business. </p><p>State Bicycle creates direct to consumer bikes that are simple, stylish, and affordable. </p><p>For more on State Bicycle and show notes: <a href=\"https://www.shopify.com/blog/state-bicycle-partnerships\">https://www.shopify.com/blog/state-bicycle-partnerships</a> </p><h3>Tune in to learn </h3><ul><li>Why you need to invest in quality control if you want to build multi-decade brand </li><li>Why there’s good revenue and bad revenue and how to tell the difference </li><li>How to get big brands like The Wutang Clan and The Simpsons to collaborate with you </li></ul><p> </p>\n",
            "length": "52845123",
            "sourceUrl": "https://feedpress.me/link/16512/13911988/ep370-statebicycle_tc.mp3",
            "epNo": "282"
        },
        {
            "title": "Creating The Perfect Product For Social Media Virality",
            "datePublished": "Tue, 14 Jul 2020 04:30:01 +0000",
            "description": "<p>You'll learn from an entrepreneur who built a luxury hot sauce brand through an Instagram account. </p><p>Truff is a truffle hot sauce with an upscale but personable aura.  </p><p>For more on Truff and show notes: <a href=\"https://www.shopify.com/blog/truff-social-media\">https://www.shopify.com/blog/truff-social-media</a>  </p><h3>Tune in to learn</h3><ul><li>How they grew an Instagram account from 0 to 10,000 in just a few months</li><li>Why the teased their product to their audience before ever launching it</li><li>What is an influencer seeding program and how it can make or break your product launch</li></ul><p> </p>\n",
            "length": "48391343",
            "sourceUrl": "https://feedpress.me/link/16512/13911989/truff_tc.mp3",
            "epNo": "281"
        },
        {
            "title": "A Youtuber's Journey Of Launching Products Based on Community Feedback",
            "datePublished": "Tue, 7 Jul 2020 04:30:20 +0000",
            "description": "<p>In this episode of Shopify Masters, we speak with Colin Chik, who’s the current CEO of BluuMan to hear how Joe and the team have launched the company based on community feedback, how manufacturers can be your mentors, and why working with micro-influencers is a great investment. </p><p>BluMaan is a range of men's hair products created with input from the BluMaan Community. </p><p>For more on BluMaan  and show notes: <a href=\"https://www.shopify.com/blog/blumaan-community\">https://www.shopify.com/blog/blumaan-community</a></p><h3>Tune in to learn </h3><ul><li>How to build a community before building a product </li><li>The suprising and underutilize dbenefits of builindg a good relationship with your manufacturers </li><li>Why they are moving away from influencers that do product reviews of products in their industry  </li></ul><p>Did you know that you can buy shipping labels for your orders at home and print them with a regular printer, get shipping insurance within the United States, and receive discounted shipping rates with certain carriers with Shopify Shipping? There are no additional fees, carrier account, or app required– this is included with your Shopify plan. So check out Shopify Shipping today at  <a href=\"http://shopify.com/ship\" target=\"_blank\">shopify.com/ship</a> for more information.</p>\n",
            "length": "47437244",
            "sourceUrl": "https://feedpress.me/link/16512/13911990/ep367-blumaan_tc.mp3",
            "epNo": "280"
        },
        {
            "title": "Building A Multi-Million Fitness Brand Without Paid Marketing",
            "datePublished": "Tue, 30 Jun 2020 04:30:13 +0000",
            "description": "<p>Life and business partners, Natalie Holloway and Maximilian Kislevitz are the founders of Bala. They are the makers of Bala Balges, stylish weighted bands that amplify just about any workout.  </p><p>In this episode, you will learn how the husband and wife team: </p><ul><li>Pitched on Shark Tank and had all sharks vying to be their partner</li><li>How they received media coverage from notable publications like Vouge, Marie Claire, and Glamour</li><li>And how they are managing an influx of sales during COVID-19</li></ul><p>For more on Bala and show notes: <a href=\"https://www.shopify.com/blog/bala-organic-marketing\">https://www.shopify.com/blog/bala-organic-marketing</a>  </p><p> Also check out Shopify Ping. It's a free live chat app for Android or iOS devices. It even works on iPads! Did you know that shoppers who use live chats are almost 3 times more likely to complete their purchase? For more information visit <a href=\"http://shopify.com/chat\">shopify.com/chat </a></p><p> </p>\n",
            "length": "46141128",
            "sourceUrl": "https://feedpress.me/link/16512/13911991/bala-final-june-29_tc.mp3",
            "epNo": "279"
        },
        {
            "title": "Moomin Shop: Licensing and Merchandising For An Iconic Global Brand",
            "datePublished": "Tue, 23 Jun 2020 04:30:01 +0000",
            "description": "<p>In this episode, you'll learn from an entrepreneur who saw the need to offer a global brand's merchandise in niche markets. </p><p>The Moomin Shop is the #1 Official Moomin online store, providing Moomin fans around the globe with the best of the Moomins merchandise. </p><p>For more on the Moonmin Shop and show notes: <a href=\"https://www.shopify.com/blog/moomin-shop-licensing\">https://www.shopify.com/blog/moomin-shop-licensing</a>  </p><h3>Tune in to learn </h3><ul><li>What is a licensing deal and how it works </li><li>How they use Facebook Lead ads that return 8 times return on ad spend </li><li>The often missing element that makes your customers engage with your content </li></ul>\n",
            "length": "54969185",
            "sourceUrl": "https://feedpress.me/link/16512/13911992/ep367-moomin_tc.mp3",
            "epNo": "278"
        },
        {
            "title": "Launching A Niche Business with $500",
            "datePublished": "Tue, 16 Jun 2020 04:30:06 +0000",
            "description": "<p>Doe Lashes is a lash brand known for ultra-fine Korean silk lashes that are subtle, comfortable, and for everyday wear. </p><p>For more on Doe Lashes and show notes: <a href=\"https://www.shopify.com/blog/doe-lashes-influencer-marketing\">https://www.shopify.com/blog/doe-lashes-influencer-marketing</a> </p><h3>Tune in to learn </h3><ul><li>What research you should do to determine if a business is viable </li><li>What it means to focus on functions and features rather than your company’s brand </li><li>Why it’s a mistake to ask for influencers to post about your product in exchange for the product </li></ul>\n",
            "length": "58095941",
            "sourceUrl": "https://feedpress.me/link/16512/13911993/ep366-doelashes_tc.mp3",
            "epNo": "277"
        },
        {
            "title": "Catch-Up with 3 Previous Guests: Navigating The Impacts of COVID-19",
            "datePublished": "Tue, 9 Jun 2020 04:30:24 +0000",
            "description": "<p>We chat with Katherine Gaskin from The Content Planner on bringing workshops online, Jimmy Findlay Hickey from Findlay Hats on leveraging various capital and lending programs, and Patrick Coddou from Supply on how they turned around their business from a drop in sales. </p><p>In the spirit of catching up, the team at Shopify recently put together Reunite, a free streamed event where the company's leadership team shared new and upcoming ecommerce products and provided insights about the future of commerce. You can watch quick recaps of key announcements plus find resources on how to put new tools into action for your business by visiting <a href=\"http://www.shopify.com/stream\">www.shopify.com/stream</a>. </p><p>For more on the merchants featured and show notes: <a href=\"https://www.shopify.com/blog/shopify-masters-catch-up\">https://www.shopify.com/blog/shopify-masters-catch-up</a>  </p>\n",
            "length": "51309126",
            "sourceUrl": "https://feedpress.me/link/16512/13911994/covid-19-update_tc.mp3",
            "epNo": "276"
        },
        {
            "title": "Foursquare Meets Volleyball: The Invention of a 7-Figure Sport",
            "datePublished": "Tue, 2 Jun 2020 04:30:37 +0000",
            "description": "<p>In this episode, you'll learn from an entrepreneur who invented a brand new 7-figure sport. </p><p>CROSSNET is the world's first four square volleyball game. </p><p>For more on CROSSNET and show notes: <a href=\"https://www.shopify.com/blog/crossnet-pr\">https://www.shopify.com/blog/crossnet-pr</a>  </p><h3>Tune in to learn </h3><ul><li>How to find a manufacturer to create a brand new type of product when you only have a $5,000 budget </li><li>How to increase sales using FOMO in your email marketing </li><li>How to use LinkedIn to get featured on big publications like Forbes </li></ul>\n",
            "length": "46217221",
            "sourceUrl": "https://feedpress.me/link/16512/13911995/crossnetgame_tc.mp3",
            "epNo": "275"
        },
        {
            "title": "Meet the 3-Person Team Behind a Global Giftware Company",
            "datePublished": "Tue, 26 May 2020 04:30:09 +0000",
            "description": "<p>In this episode, you'll learn from a couple who are life and business partners on how they built a giftware company that designs and produces items that are sold in over 45 countries. </p><p><a href=\"https://bitten-design.com/\">Bitten Design</a> was founded in 2008 and creates giftware from fun ideas. </p><p>For more on Bitten Design and show notes: <a href=\"https://www.shopify.com/blog/bitten-design-bootstrapping\">https://www.shopify.com/blog/bitten-design-bootstrapping</a> </p><p><strong>Tune in to learn: </strong></p><ul><li>The investments and skillsets needed to launch a giftware design company </li><li> How this design team manages legal restrictions, patents, and wholesale relationships  </li><li>The balance between personal and professional life for a couple who are life and business partners </li></ul><p>Music featured in this episode: </p><ul><li>Lovers Hollow by Blue Dot Sessions </li><li>Greylock by Blue Dot Sessions </li><li>Starlight by Chad Crouch </li><li>Periwinkle by Chad Crouch </li></ul><p> </p>\n",
            "length": "21388367",
            "sourceUrl": "https://feedpress.me/link/16512/13911996/bitten-final-03_tc.mp3",
            "epNo": "274"
        },
        {
            "title": "How This Direct To Consumer Fashion Brand Found Its Product Market Fit",
            "datePublished": "Tue, 19 May 2020 04:30:18 +0000",
            "description": "<p>In this episode, you’ll learn from an entrepreneur who nailed their product-market fit to build a Direct to Consumer luxury brand. </p><p>Caraa sells handbags, reimagined. The perfect balance of form and function designed for a life in motion. </p><p>For more on Caraa and show notes: <a href=\"https://www.shopify.com/blog/caraa-partnership \">https://www.shopify.com/blog/caraa-partnership</a>   </p><h3>Tune in to learn </h3><ul><li>How they got their first 100 customers </li><li>How do you know if you have product-market fit? </li><li>How they determine the pricing of their products </li></ul>\n",
            "length": "50379258",
            "sourceUrl": "https://feedpress.me/link/16512/13911997/ep363-caraa_tc.mp3",
            "epNo": "273"
        },
        {
            "title": "40 Prototypes and Lenny Kravitz: How This Cause Driven Brand Differentiates Itself",
            "datePublished": "Tue, 12 May 2020 15:08:53 +0000",
            "description": "<p>In this episode, you’ll learn from an entrepreneur how his toothpaste brand stands out against multi-national brands. </p><p>Twice is a modern oral healthcare company reimagining the everyday experience of brushing your teeth. </p><p>For more on Twice and show notes: https://www.shopify.com/blog/twice-cause-driven  </p><h3>Tune in to learn </h3><ul><li>How to work with a charitable partner </li><li>Do customers care about charitable missions </li><li>How to make the purchase decision easier for your customers </li></ul>\n",
            "length": "53117727",
            "sourceUrl": "https://feedpress.me/link/16512/13911998/ep362-smiletwice_tc.mp3",
            "epNo": "272"
        },
        {
            "title": "Second Act: How They Launched A Second Successful Business",
            "datePublished": "Tue, 5 May 2020 04:30:03 +0000",
            "description": "<p>In this episode, you’ll learn from two entrepreneurs on how they used their experience from successfully launching one ecommerce store in to quickly launching another business in a completely different industry. </p><p>Veldskoen Shoes sells ethically and sustainably made shoes from South Africa. </p><p>For more on Veldskoen Shoes and show notes: <a href=\"https://www.shopify.com/blog/veldskoen-shoes-paid-marketing\">https://www.shopify.com/blog/veldskoen-shoes-paid-marketing</a>  </p><h3>Tune in to learn</h3><ul><li>How to scale ad spend from $1,000 to $30,000 per month</li><li>What is browse abandonment and why is it important to set up email flows for it</li><li>Why recency is the most valuable attribute to know ∫about your customer</li></ul>\n",
            "length": "51379853",
            "sourceUrl": "https://feedpress.me/link/16512/13911999/ep361-veldskoen-shoes_tc.mp3",
            "epNo": "271"
        },
        {
            "title": "How A Custom Shopping App Multiplied Their Conversion Rates",
            "datePublished": "Tue, 28 Apr 2020 04:30:21 +0000",
            "description": "<p>In this episode, you'll learn from an entrepreneur who built a shopping app for their brand which ultimately increased their conversion rate. </p><p>True Vintage is a leading vintage clothing retailer providing global customer base with an eco-friendly approach to fashion.  </p><p>For more on True Vintage and show notes: <a href=\"https://www.shopify.com/blog/true-vintage-app\">https://www.shopify.com/blog/true-vintage-app</a> </p><h3> Tune in to learn </h3><ul><li>How they grew their Instagram to 30,000 followers in just a few months </li><li>How they built a shopping app for their store </li><li>How to scale up a business up to 8,000 SKUs of one-off products </li></ul>\n",
            "length": "43218781",
            "sourceUrl": "https://feedpress.me/link/16512/13912000/ep360-truevintage-rev_tc.mp3",
            "epNo": "270"
        },
        {
            "title": "How to Turn Your Content Marketing Into A Sales Machine",
            "datePublished": "Tue, 21 Apr 2020 04:30:01 +0000",
            "description": "<p>In this episode, you’ll learn from an entrepreneur who grows his traffic by 25% every two months through content marketing.  </p><p>For more on BuddyRest and show notes: <a href=\"https://www.shopify.com/buddyrest-content-marketing\">https://www.shopify.com/buddyrest-content-marketing</a>  </p><p>Tune in to learn   </p><ul><li>What are kaizen principles and how you can apply it to improving your business  </li><li>How to respond when your target customer says your product is too expensive  </li><li>Their system for cranking out great content that improves their SEO  </li></ul>\n",
            "length": "50773812",
            "sourceUrl": "https://feedpress.me/link/16512/13912001/ep359-buddyrest_tc.mp3",
            "epNo": "269"
        },
        {
            "title": "How LastObject Broke Their Crowdfunding Goal in 22 Minutes",
            "datePublished": "Tue, 14 Apr 2020 04:30:06 +0000",
            "description": "<p>In this episode, you’ll learn from an entrepreneur who thoroughly validated her idea that led to a $700k Kickstarter Campaign</p><p>LastSwab is a reusable, sustainable and sanitary alternative to cotton swabs and buds. Replacing at least 1,000 cotton swabs. </p><p>For more on LastObject and show notes: <a href=\"https://www.shopify.com/blog/lastobject-crowdfunding\">https://www.shopify.com/blog/lastobject-crowdfunding.</a></p><p> </p><h3>Tune in to learn</h3><ul><li>How to validate your product idea by collecting emails</li><li>How to market towards a sustainability-focused customer</li><li>How to determine if your passion is worth pursuing as a business</li></ul><p> </p>\n",
            "length": "41337129",
            "sourceUrl": "https://feedpress.me/link/16512/13912002/ep358-lastswab_tc.mp3",
            "epNo": "268"
        },
        {
            "title": "The Secret Ingredients to Building a 7-Figure Meal Service Business",
            "datePublished": "Tue, 7 Apr 2020 04:30:17 +0000",
            "description": "<p>In this episode, you'll learn from an entrepreneur how you can scale your business using email, text, and push notifications</p><p>Eat Well Nashville delivers deliciously healthy, ready-to-eat meals straight to your home or office. </p><p>For more on Eat Well Nashville and show note: <a href=\"https://www.shopify.com/blog/eat-well-nashville-marketing\">https://www.shopify.com/blog/eat-well-nashville-marketing</a></p><p> </p><h3>Tune in to learn</h3><ul><li>Why you should talk to your potential competitors early on</li><li>How to market to customers via text message</li><li>Why they acquired a competitor within their first year of business</li></ul>\n",
            "length": "42967170",
            "sourceUrl": "https://feedpress.me/link/16512/13912003/ep356-eatwellnashville_tc.mp3",
            "epNo": "267"
        },
        {
            "title": "How an Entrepreneur Worked Quickly With Local Government To Help Local Businesses During The Covid-19 Pandemic",
            "datePublished": "Tue, 31 Mar 2020 04:30:27 +0000",
            "description": "<p>In this episode, you’ll learn from an entrepreneur who started a gift certificate program to help local businesses amid the current Covid-19 pandemic</p><p>The Cornwall Gift Certificate Program provides a gift certificate program where shoppers can purchase gift certificates from a slew of local businesses.</p><p>For more on Cornwall Gift Certificate Program and show notes: <a href=\"https://www.shopify.com/blog/cornwall-gift-certificate-pivot\">https://www.shopify.com/blog/cornwall-gift-certificate-pivot</a></p><p><br /><strong>Tune in to learn:</strong></p><ul><li>How a local entrepreneur worked with local government to help businesses stay afloat during the COVID-19 pandemic</li><li>What you should be focused on when launching a business on a tight timeline</li><li>How to prepare when meeting with local government officials especially when you are seeking their help and resources</li></ul>\n",
            "length": "26613262",
            "sourceUrl": "https://feedpress.me/link/16512/13912004/ep357-cornwallgiftcertificates-new_tc.mp3",
            "epNo": "266"
        },
        {
            "title": "How This Direct to Consumer Brand Disrupted the Handcrafted Footwear Industry",
            "datePublished": "Tue, 24 Mar 2020 04:30:01 +0000",
            "description": "<p>In this special episode of Shopify Masters, we visit the office of <a href=\"https://www.velasca.com/\">Velasca</a>, a direct to consumer brand specializing in Italian handcrafted shoes. Co-founder Enrico Casati shares how he left his banking career and launched a direct to consumer brand by connecting local craft-makers in Italy with a global customer base. </p><p><i>The COVID-19 pandemic is affecting entrepreneurs everywhere, some more than others. Velasca, based in an epicenter of the current outbreak, are working incredibly hard to stay connected with their community virtually and adapt to these uncertain times. This episode was recorded in late 2019, and Velasca’s journey is an impressive one to listen to. Send some love their way virtually by </i><a href=\"https://www.velasca.com/\"><i>visiting them here</i></a><i>. At Shopify, we're quickly building new resources to help independent businesses navigate the current situation. up resources to better help our community, Learn more about </i><a href=\"https://www.shopify.com/covid19\"><i>our response to COVID-19 here</i></a><i>. </i></p><p>For more on Velasca and the show notes: <a href=\"https://www.shopify.com/blog/velasca-dtc\">https://www.shopify.com/blog/velasca-dtc</a></p><p><strong>Tune in to learn: </strong></p><ul><li>How Velasca built relationships with the shoemakers and convinced them to take on their orders</li><li>What kind of storytelling that connects to consumers and entertains them</li><li>The process of building out a retail presence that spans over ten stores and three countries</li></ul><p><strong>Music in this episode: </strong></p><ul><li><i>Donnalee by </i>Blue Dot Sessions</li><li><i>Poppyseed by </i>Podington Bear</li><li><i>Vacation Days by </i>KICKSTA</li></ul>\n",
            "length": "24967671",
            "sourceUrl": "https://feedpress.me/link/16512/13912005/shopify-masters-velasca-final_tc.mp3",
            "epNo": "265"
        },
        {
            "title": "The Best Conversion Hacks That Anticipate Customer's Needs",
            "datePublished": "Tue, 17 Mar 2020 04:30:06 +0000",
            "description": "<p>In this episode, you’ll learn from an entrepreneur who entered a saturated market and differentiated themselves from the mass market</p><p>Youth Sport Nutrition is the Developer of PRO-TEEN®, the world's first and only fortified recovery shake for active youths in sport.</p><p>For more on Youth Sport Nutrition and show notes: <a href=\"https://www.shopify.com/blog/youth-sport-nutrition-conversion\">https://www.shopify.com/blog/youth-sport-nutrition-conversion </a></p><h3>Tune in to learn</h3><ul><li>How they grew from 150 pounds per month to 9,000 pounds per month on ads</li><li>What changes they made to their site to improve their products perceived value</li><li>How to sell a product when the buyer is a parent and the end-user is their child</li></ul>\n",
            "length": "47411748",
            "sourceUrl": "https://feedpress.me/link/16512/13912006/ep353-youthsportnutrition_tc.mp3",
            "epNo": "264"
        },
        {
            "title": "How a 7-Figure Swimwear Brand was Built on a Secondhand Sewing Machine",
            "datePublished": "Tue, 10 Mar 2020 04:30:10 +0000",
            "description": "<p>In this episode, you'll learn from an entrepreneur the mindset required to scale your business to 7-figures</p><p>FUSED Hawaii designs timeless, functional swimwear for all body types<br />at all stages of life, so you feel comfortable, confident, and beautiful in your own skin again. </p><p>For more on Fused Hawaii and show notes: <a href=\"https://www.shopify.ca/blog/fused-hawaii-mindset\">https://www.shopify.ca/blog/fused-hawaii-mindset</a></p><h3>Tune in to learn</h3><ul><li>How she was able to finally break through the 7 figure mark</li><li>Why it’s important not to be too attached to the highs or the lows of entrepreneurship</li><li>How to generate sales from Facebook Lives inside Facebook Groups</li></ul>\n",
            "length": "51169201",
            "sourceUrl": "https://feedpress.me/link/16512/13912007/ep355-fusedhawaii_tc.mp3",
            "epNo": "263"
        },
        {
            "title": "How This Natural Skincare Company is Supporting Other Female Founders",
            "datePublished": "Tue, 3 Mar 2020 04:30:05 +0000",
            "description": "<p>In this episode, you'll learn from these two entrepreneurs how purposefully set a work-life balance between your personal life and business.</p><p>NIU BODY is a female-founded beauty company that creates natural skincare at affordable prices.</p><p>For more on NIU BODY and show notes: <a href=\"https://www.shopify.com/blog/niu-body-content\">https://www.shopify.com/blog/niu-body-content</a></p><h3>Tune in to learn</h3><ul><li>What to look for in a co-founder</li><li>How going full time in their business led to $250,000 in sales</li><li>Which social media channel is the best to use to get press</li></ul>\n",
            "length": "53488039",
            "sourceUrl": "https://feedpress.me/link/16512/13912008/ep354-niubody_tc.mp3",
            "epNo": "262"
        },
        {
            "title": "Diversity Matters: This Makeup Brand's Movement for Inclusivity",
            "datePublished": "Tue, 25 Feb 2020 04:30:11 +0000",
            "description": "<p>In this episode, you’ll learn from an entrepreneur who validated her community through a hashtag campaign and then led her towards building her own business</p><p>Makeup For Melanin Girls is a direct-to-consumer beauty brand that leverages community feedback to develop cosmetics tailored to multiethnic beauty consumers. </p><p>For more on MFMG Cosmetics and show notes: <a href=\"https://www.shopify.com/blog/mfmgcosmetics-products\">https://www.shopify.com/blog/mfmgcosmetics-products</a></p><h3>Tune in to learn</h3><ul><li>How to turn a blog in to a business</li><li>Why is a brand book important and what you should include inside your brand book</li><li>What she did after losing an Instagram account of 100,000 followers</li></ul>\n",
            "length": "51561247",
            "sourceUrl": "https://feedpress.me/link/16512/13912009/ep351-makeupformelaningirls_tc.mp3",
            "epNo": "261"
        },
        {
            "title": "Balancing Act: Growth and Purpose for a Social Enterprise",
            "datePublished": "Tue, 18 Feb 2020 04:30:10 +0000",
            "description": "<p>In this episode, you’ll learn from a Chief Growth Officer how to drive growth to a social enterprise</p><p>Sweet Beginnings makes the beelove® family of all-natural line of raw honey and honey-infused body care products. </p><p>For more on Sweet Beginnings and show notes: <a href=\"www.shopify.com/blog/sweetbeginnings-growth\">www.shopify.com/blog/sweetbeginnings-growth</a></p><h3>Tune in to learn</h3><ul><li>How does having an online store affect offline sales</li><li>How should Chief Growth Officer spend their time</li><li>What you get out of one-on-one customer interviews that you can’t get out of surveys</li></ul>\n",
            "length": "43699016",
            "sourceUrl": "https://feedpress.me/link/16512/13912010/ep352-sweetbeginnings_tc.mp3",
            "epNo": "260"
        },
        {
            "title": "How This Direct to Consumer Brand Disrupted the Cookware Industry",
            "datePublished": "Tue, 11 Feb 2020 04:30:03 +0000",
            "description": "<p>In this episode, you’ll learn from an entrepreneur who found a unique way of using their supply chain as a source for marketing, which data metrics played a big role in their successful marketing strategies, and how they disrupted the cookware industry. </p><p>For more on Made In and the show notes: <a href=\"https://www.shopify.com/blog/madeincookware-disruption\">https://www.shopify.com/blog/madeincookware-disruption</a></p><p><strong>Tune in to learn</strong></p><ul><li>What is involved in doing a whole redesign of an ecommerce site</li><li>What you should focus on when improving your product page</li><li>How to use your suppliers and manufacturers as a source of your marketing</li></ul>\n",
            "length": "53294106",
            "sourceUrl": "https://feedpress.me/link/16512/13912011/ep350-madeincookware_tc.mp3",
            "epNo": "259"
        },
        {
            "title": "From Class Project to Kickstarter to Shark Tank",
            "datePublished": "Tue, 4 Feb 2020 04:30:05 +0000",
            "description": "<p>In this episode, you’ll learn from these two entrepreneurs who turned their class project into a 6-figure business</p><p>Kanga invented and patented the world's first iceless cooler designed to fit around an entire case of 12 oz. beverages.</p><p>For more on Kanga and the show notes: https://www.shopify.com/blog/kanga-sharktank</p><h3>Tune in to learn</h3><ul><li>How to collect early feedback from your initial beta customers</li><li>The value of setting your pricepoint higher than what it’s currently worth</li><li>What kind of retargeting photos work best for their ads</li></ul>\n",
            "length": "51268258",
            "sourceUrl": "https://feedpress.me/link/16512/13912012/ep349-buykanga_tc.mp3",
            "epNo": "258"
        },
        {
            "title": "The Business of Planners: How to Create Products and Return Customers",
            "datePublished": "Tue, 28 Jan 2020 04:30:14 +0000",
            "description": "<p>In this episode, you’ll learn form an entrepreneur who got well known in the planner community by posting content on Facebook Groups</p><p>Chasing Planner Peace sells a range of refillable, customizable planners with the widest range of planner refills</p><p>For more on Chasing Planner Peace and show notes: <a href=\"https://www.shopify.com/blog/chasingplannerpeace-product\">https://www.shopify.com/blog/chasingplannerpeace-product</a></p><h3>Tune in to learn</h3><ul><li>How you can build a customer base with custom work, but should quickly move to selling non-custom products</li><li>How to promote your business in other people’s Facebook groups</li><li>How to determine if people are actually going to pay for a product instead of just saying they would</li></ul>\n",
            "length": "45755376",
            "sourceUrl": "https://feedpress.me/link/16512/13912013/ep348-chasingplannerpeace_tc.mp3",
            "epNo": "257"
        },
        {
            "title": "The Business of Celebrations: How Retail Enabled this Party Boutique to Thrive",
            "datePublished": "Tue, 21 Jan 2020 04:30:36 +0000",
            "description": "<p>While shopping for her daughter’s birthday, Rachel Huntington noticed the limited amount of designs for party supplies. Seeking out non-commercial and more creative partyware, Rachel started Bonjour Fete, a boutique for party goods, tableware, decor and all things event design. In this episode of Shopify Masters, Rachel shares her journey of launching online, operating two physical stores, and building relationships with return customers.</p><p>For more on Bonjour Fete and show notes: <a href=\"https://www.shopify.com/blog/bonjourfete-party\">https://www.shopify.com/blog/bonjourfete-party</a></p><h3>Tune in to learn</h3><ul><li>How to use social media to contact vendors instead of spending lots of money to go to trade shows</li><li>The most important metrics to pay attention to when running a physical retail store</li><li>How to create an Instagram feed that drives traffic to your product page</li></ul>\n",
            "length": "28188601",
            "sourceUrl": "https://feedpress.me/link/16512/13912014/ep347-bonjourfete_tc.mp3",
            "epNo": "256"
        },
        {
            "title": "How Purpose Fuelled this Business to Keep Going",
            "datePublished": "Tue, 14 Jan 2020 04:30:02 +0000",
            "description": "<p>In this episode, you’ll learn from an entrepreneur on why and how to figure out WHY you are starting your business</p><p>So Worth Loving is a lifestyle company bridging the gap between not talking about self worth and talking about it.</p><h3>Tune in to learn</h3><ul><li>Why and how to figure out your WHY when starting your business</li><li>How to transition from your full time job to your own business</li><li>How to manage entrepreneurship burnout</li></ul>\n",
            "length": "32298185",
            "sourceUrl": "https://feedpress.me/link/16512/13912015/ep346-soworthloving_tc.mp3",
            "epNo": "255"
        },
        {
            "title": "Bullet Journal’s Journey Through Kickstarter, Publishing, and Production",
            "datePublished": "Tue, 7 Jan 2020 04:30:01 +0000",
            "description": "<p>What started as a way to keep track of his day to day and combat ADHD, Ryder Carroll’s method of Bullet Journal gained a massive following online as he shared his journaling process. From a published book to a successive product, Ryder shares how his intention of solving a common problem led to a new direction in his life and career. </p><p>The Bullet Journal is the analog system for the digital age that lets you track the past, organize the present, and plan your future. </p><p>For more on Bullet Journal, Ryder Carroll, and the show notes: <a href=\"https://www.shopify.com/blog/bullet-journal-methodology \">https://www.shopify.com/blog/bullet-journal-methodology </a></p><h3>Tune in to learn</h3><ul><li>How to showcase how your customers are using your products</li><li>Why you should never be afraid of giving away too much free content</li><li>Why they created a companion app for their products</li></ul>\n",
            "length": "32709613",
            "sourceUrl": "https://feedpress.me/link/16512/13912016/ep345-thebulletjournal_tc.mp3",
            "epNo": "254"
        },
        {
            "title": "How $100 Bottle of Hot Sauce Brings the Heat and Virality",
            "datePublished": "Tue, 31 Dec 2019 04:30:25 +0000",
            "description": "<p>Brothers Nadim and Rami Yahia grew up mixing together condiments and hot sauces to create their own concoctions. They turned this habitual sauce mixing into CustomHeats, a hot sauce business that allows customers to create their own sauces and labels by bridging the food industry with tech and data. In this episode of Shopify Masters, you’ll hear from Nadim Yahia of CustomHeats on marketing with a low budget, developing hardware, and how their $100 bottle of hot sauce went viral. </p><p>For more on CustomHeats and show notes: <a href=\"https://www.shopify.com/blogcustomheats-viral\">https://www.shopify.com/blogcustomheats-viral</a></p><h3>Tune in to learn</h3><ul><li>The challenges with creating a business that allows customers to fully customize their product</li><li>How to use a $100 marketing budget to get on big publications</li><li>How they used their Instagram content to validate their market</li></ul><p> </p>\n",
            "length": "49569253",
            "sourceUrl": "https://feedpress.me/link/16512/13912017/ep344-customheats_tc.mp3",
            "epNo": "253"
        },
        {
            "title": "How Instagram Brings Ventana Surfboards a Wave of Sales",
            "datePublished": "Tue, 10 Dec 2019 04:30:05 +0000",
            "description": "<p>David Dennis was showing some of his photography for a fundraiser when he discovered the complexities of ocean conservation and how surfboards can be made more sustainably. Together with partner Martijn Stiphout, David runs Ventana Surfboards, maker of boards handcrafted from upcycled and reclaimed material. In this episode of Shopify Masters, you’ll hear how David Dennis balances his career at Microsoft while running Ventana Surfboards, the key components of running an impactful sustainable business, and how Instagram drives most of their sales. </p><p>For more on Ventana Surfboards and show notes: <a href=\"https://www.shopify.ca/blog/ventanasurfboards-instagram\">https://www.shopify.ca/blog/ventanasurfboards-instagram</a></p><h3>Tune in to learn</h3><ul><li>How to talk about your brand at a fair or trade show</li><li>How to collaborate with artists to turn their audience in to your customers</li><li>How they sold a $15,000 surfboard from a post on Instagram</li></ul>\n",
            "length": "53050018",
            "sourceUrl": "https://feedpress.me/link/16512/13912018/ep343-ventanasurfboards_tc.mp3",
            "epNo": "252"
        },
        {
            "title": "The Power of Content: How 1 Article Generated $22 Million in Sales",
            "datePublished": "Tue, 3 Dec 2019 04:30:11 +0000",
            "description": "<p>In partnership with the late model and makeup artist Cindy Joseph, Ezra Firestone helped to build BOOM by Cindy Joseph, an age-positive cosmetic line for women of every generation. As an ecommerce growth expert, Ezra has been known to share insights on building brands that resonate with consumers and stand the test of time. In this episode of Shopify Masters, Ezra Firestone shares his life and business journey and the most important lessons he’s learned along the way. </p><p>For more on BOOM by Cindy Joseph,  Ezra  Firestone, and show notes: <a href=\"https://www.shopify.com/blog/boombycindyjoseph-brand\">https://www.shopify.com/blog/boombycindyjoseph-brand</a></p><h3>Tune in to learn</h3><ul><li>What is the love, demo, love video and why is it such an effective marketing tool</li><li>Why you should not drive your traffic straight to a product page and where to drive it to instead</li><li>Where to reinvest in your brand and company</li></ul>\n",
            "length": "46353057",
            "sourceUrl": "https://feedpress.me/link/16512/13912019/ep342-boombycindyjoseph_tc.mp3",
            "epNo": "251"
        },
        {
            "title": "FinalStraw's Journey of Building a Cause Driven Business",
            "datePublished": "Tue, 26 Nov 2019 04:30:01 +0000",
            "description": "<p>Emma Cohen’s time in Thailand exposed her to the effects that single-use plastics had on the ocean. She spent most of her days there cleaning up the washed-up plastic waste on beaches. Emma was so moved by this experience that she returned to school and completed a Master’s in environmental management and sustainability from Harvard. After working for over five years in sustainability research, Emma poured herself into developing a collapsible and portable stainless steel straw and launched FinalStraw in 2017.</p><p>For more on FinalStraw and show notes: <a href=\"https://www.shopify.ca/blog/finalstraw-cause\" target=\"_blank\">https://www.shopify.ca/blog/finalstraw-cause</a></p><h3>Tune in to learn</h3><ul><li>How you can use Amazon reviews to create a superior product</li><li>What’s the best use of your time when preparing for a crowdfunding campaign</li><li>How to balance marketing your cause versus marketing your product</li></ul>\n",
            "length": "50245511",
            "sourceUrl": "https://feedpress.me/link/16512/13912020/ep341-finalstraw_tc.mp3",
            "epNo": "250"
        },
        {
            "title": "Pessimism vs. Enthusiasm When Validating an Idea",
            "datePublished": "Tue, 19 Nov 2019 04:30:08 +0000",
            "description": "<p>When Gamal Codner left corporate America he began to grow out his beard. What started as a symbolic lifestyle change to signify the start of his entrepreneurial journey sparked a new business idea. As his beard got longer, Gamal noticed how there were no grooming products designed for men of color and launched <a href=\"https://www.freshheritage.com/\" target=\"_blank\">Fresh Heritage</a> to address this unmet need in the market. </p><p>For more on Fresh Heritage and show notes: <a href=\"https://www.shopify.com/blog/fresh-heritage-validate\" target=\"_blank\">https://www.shopify.com/blog/fresh-heritage-validate</a></p><h3>Tune in to learn</h3><ul><li>Why it’s important to invest in your education</li><li>Why you do not need the best product, you just need to be different</li><li>How to network with successful brands and get them to give you advice</li></ul>\n",
            "length": "54576405",
            "sourceUrl": "https://feedpress.me/link/16512/13912021/ep340-freshheritage_tc.mp3",
            "epNo": "249"
        },
        {
            "title": "Why Losing Money on a Sale Can Be Beneficial",
            "datePublished": "Tue, 12 Nov 2019 04:30:13 +0000",
            "description": "<p>The scent of a specialty soap from her honeymoon stayed with Danielle Vincent as she went back to work and each time she would smell it, she was transported back to those happy memories. This sensory experience prompted her to launch Outlaw Soaps with her husband Russ. Together, the couple created soaps that would smell like campfire, whiskey, and leather to meet the niche of specialty scents. </p><p>In this episode of Shopify Masters, we’ll hear from Danielle Vincent of Outlaw Soaps on how they navigated production and why feedback from customers are crucial. </p><p>For more on Outlaw Soaps and show notes: <a href=\"https://www.shopify.ca/blog/outlawsoaps-sales\" target=\"_blank\">https://www.shopify.ca/blog/outlawsoaps-sales</a></p><p><strong>Tune In To Learn</strong></p><ul><li>What metric led them to 600% Growth</li><li>Why content marketing and SEO are still worth it even though they take longer for results</li><li>The emails they sent to turn customers in to repeat buyers</li></ul>\n",
            "length": "48922671",
            "sourceUrl": "https://feedpress.me/link/16512/13912022/ep339-outlawsoaps_tc.mp3",
            "epNo": "248"
        },
        {
            "title": "Why Telling Stories is More Important Than Ads",
            "datePublished": "Tue, 5 Nov 2019 04:30:18 +0000",
            "description": "<p>Roller derby wasn’t just a workout for Micki Krimmel, it offered a sense of empowerment and community. The sport inspired Micki to start Superfit Hero, an inclusive and body-positive apparel line to make everyone feel welcomed in the fitness world. </p><p>In this episode of Shopify Masters, Micki Krimmel of Superfit Hero shares her approach to building a community, how she shares inspiring and inclusive stories, and what has helped her to grow her business.</p><p>For more on Superfit Hero and show notes:  <a href=\"https://www.shopify.ca/blog/superfithero-storytelling\">https://www.shopify.ca/blog/superfithero-storytelling</a></p><h3>Tune in to learn</h3><ul><li>Why they decided to start selling fitness apparel in the roller derby niche</li><li>How non-product focused content turns prospects into customers</li><li>Why it’s important to release more products</li></ul>\n",
            "length": "50180310",
            "sourceUrl": "https://feedpress.me/link/16512/13912023/ep338-superfithero_tc.mp3",
            "epNo": "247"
        },
        {
            "title": "How to Scale Beyond Stagnant Sales",
            "datePublished": "Tue, 29 Oct 2019 04:30:24 +0000",
            "description": "<p>Cars fascinated Chris Carey, so much so that he left his full-time job to start Modern Automotive Performance, a business focused on manufacturing and selling automotive performance products. Initially starting with a physical and service location, Modern Automotive Performance expanded to selling products online and grew to generate over $27 million in annual revenue.</p><p>In today’s episode of Shopify Masters, Chris Carey shares how they moved past stagnant sales, which resources changed his way of thinking, and why they closed down their original service business to focus on ecommerce.</p><p>For more on Modern Automotive Performance and show notes: <a href=\"https://www.shopify.ca/blog/maperformance-scale\">https://www.shopify.ca/blog/maperformance-scale</a></p><p><strong>Tune in to learn</strong></p><ul><li>How to use forums to get your first customers</li><li>The key to great customer service that will give you organic growth</li><li>What is an Entrepreneurial Operating System</li></ul>\n",
            "length": "51456339",
            "sourceUrl": "https://feedpress.me/link/16512/13912024/ep337-modernautomotiveperformance_tc.mp3",
            "epNo": "246"
        },
        {
            "title": "Bulletproof's Branding and Scaling Advice",
            "datePublished": "Tue, 22 Oct 2019 04:30:12 +0000",
            "description": "<p>Known as a biohacker and lifestyle guru, Dave Asprey has gained a notable reputation within the health and wellness space. With a bold claim of aiming to live until 180 years old and having published five books on his diet and lifestyle approaches, it was no surprise that Dave decided to launch his own line of nutrition products.</p><p>Under the brand name Bulletproof, consumers can include coffee, proteins, and supplements that Dave personally uses into their routines. Despite Dave’s reputation, building a notable brand within the consumer packaged goods space takes a village and scaling it is no easy feat.</p><p>In this episode of Shopify Masters, you’ll hear from Karen Huh, the VP of Product Management and Strategy and Bulletproof. Karen grew her team from one direct report into three teams of five to six employees, and she looks after everything from research and development to creatives.<br /><br />For more from Bulletproof and the show notes: <a href=\"www.shopify.com/blog/ bulletproof-branding\">www.shopify.com/blog/ bulletproof-branding</a></p><p><strong>Tune in to Learn</strong></p><ul><li>How to get clarity on your brand</li><li>Why it’s important to simplify your brand messaging and how to do it</li><li>How to increase your speed to get things done</li></ul>\n",
            "length": "53127340",
            "sourceUrl": "https://feedpress.me/link/16512/13912025/ep336-bulletproof_tc.mp3",
            "epNo": "245"
        },
        {
            "title": "Disrupting a Stagnant Market  through Self Funding",
            "datePublished": "Tue, 15 Oct 2019 04:30:02 +0000",
            "description": "<p>Josh Elizetxe has been a serial entrepreneur ever since he was a teenager. Having a knack for building websites, SEO, and managing ad dollars, Josh managed sites for an array of businesses when he was still in school. Despite the early success, it wasn't until Josh befriended his dentists through multiple braces treatments and jaw surgery that he found his calling. </p><p>Josh was intrigued by the dental industry and invested his own savings to research an at-home whitening system to disrupt the stagnant market by starting <a href=\"https://www.trysnow.com/\" target=\"_blank\">Snow Teeth Whitening</a>. </p><p>In this episode of Shopify Masters, you'll hear from Josh Elizetxe of Snow on how he found his interest within the dental industry and why it's important to pace yourself in the entrepreneurship journey. </p><p>For more on Josh Elizetxe, Snow, and the show notes: https://www.shopify.com/blog/snow-market-disruption</p><p><strong>Tune in to learn</strong></p><ul><li>How they’ve stepped up influencer marketing to work with celebrities</li><li>Why he invested millions of dollars of his own money into his company</li><li>Why all his retail partners are calling him to stock his product</li><li>How to think of entrepreneurship as a marathon and not a sprint</li></ul>\n",
            "length": "68703008",
            "sourceUrl": "https://feedpress.me/link/16512/13912026/ep335-snow_tc.mp3",
            "epNo": "244"
        },
        {
            "title": "Building a $1.8 Million Gift Box Company",
            "datePublished": "Tue, 8 Oct 2019 04:30:02 +0000",
            "description": "<p>Three Nashville proud friends, Sam Davidson, Stephen Moseley, and Rob Williams, had the idea to start Batch, a gift company curating items made by artisans from their beloved city.   </p><p>Initially starting off selling subscription boxes in 2013, Batch switched gears to be a gift company and grew to have its own retail space while generating $1.8 million in sales annually.  </p><p>In this episode of Shopify Masters, you'll hear from Sam Davidson of Batch on how they validated the concept, work with local makers, and switched their business focus. </p><p>For more on Batch and the show notes: <a href=\"https://www.shopify.com/blog/batch-growth\">https://www.shopify.com/blog/batch-growth</a></p><p><strong>Tune in to learn</strong></p><ul><li>How they used a landing page to validate their business idea</li><li>The customer feedback the convinced them to open a physical retail store</li><li>The most important questions you should ask your existing customers</li></ul><p> </p>\n",
            "length": "53963258",
            "sourceUrl": "https://feedpress.me/link/16512/13912027/ep334-batch_tc.mp3",
            "epNo": "243"
        },
        {
            "title": "Viral Idea To Product In 60 Days",
            "datePublished": "Tue, 1 Oct 2019 04:30:02 +0000",
            "description": "<p>Justin Clark is a serial entrepreneur who loves to launch new products and build brands. In 2017 Justin and his friends decided to give male rompers a chance and launched the company <a href=\"https://romperjack.com/\" target=\"_blank\">Romperjack</a>. </p><p>From ideation to production to marketing, Romperjack went from an idea to a physical product within 60 days.</p><p>In this episode of Shopify Masters, you'll hear from Justin Clark of Romperjack on how he validate product-market fit, work with manufacturers, and move from a viral brand to an everyday brand. </p><p>For more on Justin Clark, Romperjack, and the show notes: https://www.shopify.com/blog/romperjack-viral-product </p><p><strong>Tune in to learn</strong></p><ul><li>How to go from viral idea to a live product in 60 days</li><li>The lifespan of a viral product</li><li>What it means to focus on your brand instead of your products</li></ul><p> </p>\n",
            "length": "56232359",
            "sourceUrl": "https://feedpress.me/link/16512/13912028/ep333-romperjack_tc.mp3",
            "epNo": "242"
        },
        {
            "title": "How to Step Out of Your Comfort Zone and Pitch On National TV",
            "datePublished": "Tue, 24 Sep 2019 04:30:17 +0000",
            "description": "<p>Krista Woods was trying to get rid of the odor from her son's sports gear and discovered the smell was caused by bacteria growth. After testing home remedies that were chemical-free Krista started GloveStix to sell her deodorizer for athletic gear.</p><p>Going from mom to business owner, Krista stepped out of her comfort zone to pitch to national TV programs like the Today Show and Shark Tank.</p><p>In this episode of Shopify Masters, you'll hear from Krista Woods of GloveStix on how she created a physical product, sold during live events, and pitch on national TV programs.</p><p>For more on GloveStix and show notes: https://www.shopify.com/blog/glovestix-tv</p><p><strong>Tune in to learn</strong></p><ul><li>How to use your Facebook friends to launch your business faster</li><li>Why it’s important to know how much you’re willing to lose when starting a<br />business</li><li>How this entrepreneur prepared to pitch on QVC in less than 24 hours</li></ul>\n",
            "length": "63204949",
            "sourceUrl": "https://feedpress.me/link/16512/13912029/glovestix_rev_tc.mp3",
            "epNo": "241"
        },
        {
            "title": "How a Beauty Subscription Box Launched Through Facebook Groups",
            "datePublished": "Tue, 17 Sep 2019 04:30:23 +0000",
            "description": "<p>Bili Balogun always loved beauty and experimenting with new products, so much so that she started her own beauty subscription box months after graduating from college in 2017. </p><p>Bootstrapping with only $200, Bili launched <a href=\"https://tribebeautybox.com/\" target=\"_blank\">Tribe Beauty Box</a> and grew the business to over $300,000 in sales in 16 months.   </p><p>In this episode of Shopify Masters, you'll hear from Bili Balogun of Tribe Beauty Box on how to collaborate with brands, build relationships with subscribers, and launch a business through other Facebook groups. </p><p>For more about Tribe Beauty Box and the show notes: https://www.shopify.com/blog/tribe-beauty-box</p><p><strong>Tune in to learn</strong></p><ul><li>What it means to use your disadvantages as your advantages</li><li>How do you know when to move from research and planning phase to execution</li><li>How they tripled their Facebook group numbers with a giveaway</li></ul>\n",
            "length": "44143627",
            "sourceUrl": "https://feedpress.me/link/16512/13912030/ep331_tribebeautybox_fix_tc.mp3",
            "epNo": "240"
        },
        {
            "title": "How to Create Your Own Viral Moments",
            "datePublished": "Tue, 10 Sep 2019 04:30:17 +0000",
            "description": "<p>Before the historic NBA championship win by the Toronto Raptors in 2019, the team made it to the playoffs in 2014 and launched Yanal Dhailieh into the perfect moment to start his lifestyle and community brand, Peace Collective.</p>\n<p>By wearing a &quot;Toronto vs. Everybody&quot; t-shirt to a Raptors playoffs game and getting featured in a TSN documentary, Yanal turned that moment into an apparel brand that generates millions in revenue annually and two retail stores.</p>\n<p>In this episode of Shopify Masters, you'll hear from Yanal Dhailieh of Peace Collective on how to build a community, grow from viral moments, and create your own virality.</p>\n<p>For more on Peace Collective, Yanal Dhailieh, and show notes: https://www.shopify.ca/blog/peace-collective-viral<br />\n<strong>Tune in to learn</strong></p>\n<ul>\n<li>How to create a viral moment</li>\n<li>How to educate your customers on your cause</li>\n<li>Why storytelling is your biggest advantage over bigger companies and how to do it</li>\n</ul>\n",
            "length": "36870367",
            "sourceUrl": "https://feedpress.me/link/16512/13912031/peacecollective_rev_tc.mp3",
            "epNo": "239"
        },
        {
            "title": "Why an MBA Was Important for This Entrepreneur",
            "datePublished": "Tue, 3 Sep 2019 04:30:19 +0000",
            "description": "<p>Sali Christeson quit a corporate job to pursue the dream of building a fashion brand for ambitious women to look and feel good while breaking barriers.</p>\n<p>Counterintuitive to most tips for entrepreneurs, Sali credits her MBA for building her well-rounded set of skills.</p>\n<p>In this episode of Shopify Masters, you'll hear from Sali Christeson of ARGENT on how to build a fashion brand from the ground up.</p>\n<p>For more on Sali Christeson, ARGENT, and show notes: https://www.shopify.ca/blog/argent-mba</p>\n<p><strong>Tune in to learn</strong></p>\n<ul>\n<li>Why you might want to get an MBA before starting your business</li>\n<li>What is a brand book and what needs to go in a brand book</li>\n<li>How do you measure that you are making progress with building your brand</li>\n</ul>\n",
            "length": "40813008",
            "sourceUrl": "https://feedpress.me/link/16512/13912032/argent_fix_tc.mp3",
            "epNo": "238"
        },
        {
            "title": "How to Partner With Physical Stores to Showcase Your Product",
            "datePublished": "Tue, 27 Aug 2019 04:30:04 +0000",
            "description": "<p>During a golf tournament, Jeremiah Curvers was injured and got a double herniated disk. Bedridden for three months, Jeremiah got to think a lot about mattresses and what he wanted to see in his ideal mattress.</p>\n<p>Motivated by his research, Jeremiah launched Polysleep to create a direct consumer sleep brand that offers better rest while making a social and environmental impact.</p>\n<p>In this episode of Shopify Masters, you'll hear from Jeremiah Curvers of Polysleep on how to partner suppliers and physical stores.</p>\n<p>For more on Polysleep and the show notes: https://www.shopify.com/blog/polysleep-partnership</p>\n<p><strong>Tune in to Learn</strong></p>\n<ul>\n<li>How to partner with physical stores to showcase your product</li>\n<li>Their tricky pre-Black Friday email that sold out all of their Black Friday products</li>\n<li>How to create high converting content with your affiliates</li>\n</ul>\n",
            "length": "52034377",
            "sourceUrl": "https://feedpress.me/link/16512/13912033/ep329_polysleep_tc.mp3",
            "epNo": "237"
        },
        {
            "title": "This Leather Maker's Journey From Basement to Seven Figures",
            "datePublished": "Tue, 20 Aug 2019 04:30:03 +0000",
            "description": "<p>While working at a desk job, Ryan Popoff took on leatherwork as a creative outlet. Initially making a minimalistic wallet for himself, Ryan's wife Jill, encouraged him to sell what he made online.</p>\n<p>Ryan then launched Popov Leather and grew the business from a basement rental to earn seven figures annually while supporting 12 full-time employees.</p>\n<p>In this episode of Shopify Masters, you'll hear from Ryan Popoff of Popov Leather on how to take outstanding product photos and how he works with micro-influencers.</p>\n<p>For more information on Popov Leather and show notes: https://www.shopify.com/blog/popov-leather-influencer</p>\n<p><strong>Tune in to learn</strong></p>\n<ul>\n<li>The key components for product photos that lead to conversions</li>\n<li>The most important question to as in a post-purchase survey</li>\n<li>Which channel for micro-influencer marketing to focus on and why</li>\n</ul>\n",
            "length": "51749329",
            "sourceUrl": "https://feedpress.me/link/16512/13912034/ep327_popovleather_tc.mp3",
            "epNo": "236"
        },
        {
            "title": "Why This Founder Took Two Years to Launch",
            "datePublished": "Tue, 13 Aug 2019 04:30:08 +0000",
            "description": "<p>Mel Wells was inspired by her roommate's desire for a 1920s styled swimsuit to start Beefcake Swimwear. Initially sewing pieces herself, Mel then took the time to research and find sustainable fabrics and an ethical American manufacturer.</p>\n<p>Taking two years before launching, Beefcake Swimwear is a true reflection of Mel's dedication to thoughtfully produce androgynous vintage-inspired swimwear.</p>\n<p>In this episode of Shopify Masters, you'll hear from Mel Wells of Beefcake Swimwear on why it's important to grow at your own pace and how to create a brand that authentically reflects who you are.</p>\n<p>For more information on Beefcake Swimwear and show notes: https://www.shopify.com/blog/beefcake-swimwear-time</p>\n<p><strong>Tune in to learn</strong></p>\n<ul>\n<li>How you can still succeed in business when you’re not a risk-taker</li>\n<li>What to do if you’re an entrepreneur that likes starting businesses but tend to jump around</li>\n<li>Why hiring a PR agency is a worthwhile investment</li>\n</ul>\n",
            "length": "50275096",
            "sourceUrl": "https://feedpress.me/link/16512/13912035/ep326_beefcakeswimwear_tc.mp3",
            "epNo": "235"
        },
        {
            "title": "How to Automate Your Business as Fast as Possible",
            "datePublished": "Tue, 6 Aug 2019 04:30:08 +0000",
            "description": "<p>Remi Silva and Alondra Carbajal were vacationing in Japan when inspiration hit. While most visitors to Tokyo are busy seeing sites and indulging in the local delicacies, Remi was mesmerized by the wide selection of stickers and wondered why the U.S. lacked behind.</p>\n<p>Once back home, the couple put the idea into action and started Blank Tag Co. and has built the stickers company to a multi six-figure business while still having day jobs.</p>\n<p>In this episode of Shopify Masters, you'll hear from Remi Silva of Blank Tag Co. on how he as automated his business and why keeping his day job helps his business.</p>\n<p>For more information on Black Tag Co. and the show notes: https://www.shopify.com/blog/blank-tag-co-automation</p>\n<p><strong>Tune in to learn</strong></p>\n<ul>\n<li>How processes remove motivation from the equation</li>\n<li>Why you should not start with Facebook Ads first and where you should start instead</li>\n<li>What you should test tweak within your first ads</li>\n</ul>\n",
            "length": "50445197",
            "sourceUrl": "https://feedpress.me/link/16512/13912036/ep325_blanktag_tc.mp3",
            "epNo": "234"
        },
        {
            "title": "The Real Sacrifices of Growing a Seven-Figure Business",
            "datePublished": "Tue, 30 Jul 2019 04:30:07 +0000",
            "description": "<p>Stacia Guzzo's mother's breast cancer diagnoses got her into researching the possible causes. The discovery of aluminum's possible link to cancer motivated Stacia to make her own natural beauty products.</p>\n<p>Stacia found her niche with aluminum-free deodorant and started SmartyPits. From a hobby beekeeper who made lip balms, Stacia honed in on her specialty and scaled her business to seven-figures.</p>\n<p>In this episode of Shopify Masters, you'll hear from Stacia Guzzo of SmartPits on how she found her niche and the decisions she had to make to scale her business.</p>\n<p>For more information on Stacia Guzzo, SmartyPits, and show notes: https://www.shopify.com/blog/smartypits-scale</p>\n<p><strong>Tune in to learn</strong></p>\n<ul>\n<li>What is story-based marketing and why it’s so effective</li>\n<li>How to identify whether an idea is great or awful</li>\n<li>How do you know if you’ve gone niche enough</li>\n</ul>\n",
            "length": "45739396",
            "sourceUrl": "https://feedpress.me/link/16512/13912037/ep324_smartypits_tc.mp3",
            "epNo": "233"
        },
        {
            "title": "The Simple Business Model Used to Build a $2.4 Million Business",
            "datePublished": "Tue, 23 Jul 2019 04:30:09 +0000",
            "description": "<p>Colin Macintosh turned the end of a tech startup career into a new beginning for building his own brand.</p>\n<p>Built on a cheeky pun, Sheets &amp; Giggles grew from a simple business model of offering sustainable and comfortable bedding directly to consumers into a brand that's projecting $2.4 million in sales this year.</p>\n<p>In this episode of Shopify Masters, you'll learn from Colin Macintosh of Sheets &amp; Giggles on how he builds a successful crowdfunding campaign and found his niche with eucalyptus lyocell sheets.</p>\n<p>For more information on Colin Macintosh, Sheets &amp; Giggles, and show notes: https://www.shopify.com/blog/sheets-and-giggles-business-model</p>\n<p><strong>Tune in to learn</strong></p>\n<ul>\n<li>The business model you should follow to improve your chances of success</li>\n<li>How they created an 11,000 subscriber email list before launching</li>\n<li>Why a completely unrelated Reddit post drives them traffic and sales</li>\n</ul>\n",
            "length": "53435283",
            "sourceUrl": "https://feedpress.me/link/16512/13912038/ep323_sheetsandgiggles_tc.mp3",
            "epNo": "232"
        },
        {
            "title": "How a Blog Became a Physical Store in Two Years",
            "datePublished": "Tue, 16 Jul 2019 04:30:12 +0000",
            "description": "<p>Nat Elison decided to test out his content marketing skills from running his own marketing agency by launching his own blog.<br />\nAs a longtime tea lover, Nat started Cup &amp; Leaf to blog about all things tea. He publishes on a consistent schedule, reworks content to rank higher on search, and curates products for the online store.<br />\nSince the launch of Cup &amp; Leaf in early 2018, the website now sees 250,000 monthly visitors and brings in $5000 in monthly revenue.<br />\nFor more information on Nat Elison, Cup and Leaf, and show notes: https://www.shopify.com/blog/cup-and-leaf-blog<br />\n<strong>Tune in to learn</strong></p>\n<ul>\n<li>When you should actually spend time on content marketing and SEO</li>\n<li>The content plan they used to grow to 250,000 monthly visitors</li>\n<li>How they drive sales from blog to physical store</li>\n</ul>\n",
            "length": "41809005",
            "sourceUrl": "https://feedpress.me/link/16512/13912039/cupandleaf_new_tc.mp3",
            "epNo": "231"
        },
        {
            "title": "How a Domain Created Credibility",
            "datePublished": "Tue, 9 Jul 2019 04:30:09 +0000",
            "description": "<p>Shopping for some pricy speakers got Andrew Lissimore looking into buying them directly from the manufacturer. After scoring a pricing sheet, Andrew realized there's a healthy margin and an opportunity to sell online.</p>\n<p>When his first sale came in a few weeks later, Andrew knew he was onto something.</p>\n<p>To learn more about Headphones.com and shownotes: https://www.shopify.com/blog/headphones-domain<br />\n<strong>Tune in to learn:</strong></p>\n<ul>\n<li>Why you don’t need to see the entire path towards your goals to get started</li>\n<li>How they created a forum and use it to increase traffic and sales</li>\n<li>How they were able to get a million dollar domain like Headphones.com without paying a million dollars</li>\n</ul>\n",
            "length": "50062766",
            "sourceUrl": "https://feedpress.me/link/16512/13912040/ep321_headphones_tc.mp3",
            "epNo": "230"
        },
        {
            "title": "How A $15 Million Company Was Built On Personal Messages",
            "datePublished": "Tue, 2 Jul 2019 04:30:12 +0000",
            "description": "<p>While most people enjoy a few rounds of golf on the weekend, Tyler Sullivan became obsessed with the game and wanted to achieve the longest drive.</p>\n<p>Along the way, Tyler got custom clubs and drivers made that ended breaking so he started to make his own. Realizing that others might face the same frustration, Tyler started BombTech Golf and began selling the clubs and divers he made.</p>\n<p>For more information on BombTech Golf, Tyler, and shownotes: https://www.shopify.com/blog/bombtech-golf-personal-messages</p>\n<p><strong>Tune in to learn</strong></p>\n<ul>\n<li>How to get your customers to converse with you over email</li>\n<li>How to hire the best Facebook ad experts</li>\n<li>How to create an irresistible offer when customers visit your page</li>\n</ul>\n",
            "length": "55805623",
            "sourceUrl": "https://feedpress.me/link/16512/13912041/EP320_Bombtechgolf_tc.mp3",
            "epNo": "229"
        },
        {
            "title": "How To Create a Need and Justify Your Use Case",
            "datePublished": "Tue, 25 Jun 2019 04:30:27 +0000",
            "description": "<p>Being the dog owner of a Saint Bernard named Harley, Tyson Walters was constantly on cleaning duty and barely kept up with Harley's shedding.<br />\nRealizing that he's not alone, Tyson came up with the idea of Shed Defender and started prototyping breathable onesies for dogs to reduce shedding cleanups.<br />\nAfter going viral, testing out infomercials, and being on Shark Tank, Tyson shares the lessons learned along the way.</p>\n<p>To learn more about Tyson, Shred Defender, and the show notes: https://www.shopify.com/blog/shed-defender-use-case</p>\n<p><strong>Tune in to learn</strong></p>\n<ul>\n<li>How to educate your customers so they’re confident to make a purchase</li>\n<li>What happened when The Shred Defender got featured on a viral website like The Dodo</li>\n<li>The results from doing an As Seen On TV commercial</li>\n</ul>\n",
            "length": "41076323",
            "sourceUrl": "https://feedpress.me/link/16512/13912042/EP319_ShedDefender_tc.mp3",
            "epNo": "228"
        },
        {
            "title": "Why Pivoting Your Business is Vital",
            "datePublished": "Tue, 18 Jun 2019 04:30:04 +0000",
            "description": "<p>Dylan Jacob grew up running his own businesses and knew early on when to change course and adapt.</p>\n<p>Ever since high school Dylan grew a small phone repairs business into a parts manufacturing company and later founded a company that offered the largest color selection of tiles in the United States.</p>\n<p>Despite reaching financial success, Dylan always viewed these ventures as &quot;buffer businesses&quot; and only found his true calling when he dove deep into solving the common problem of how to keep drinks cold.<br />\n<strong>To learn more about Dylan, BrüMate, and the show notes: https://www.shopify.com/blog/brumate-pivot</strong><br />\nTune in to learn</p>\n<ul>\n<li>Do you really need to fly to China to meet with manufacturers</li>\n<li>Why Facebook might drive low-quality leads and how to improve the quality of your leads</li>\n<li>When to pivot your business and what happens when you do</li>\n</ul>\n",
            "length": "52345756",
            "sourceUrl": "https://feedpress.me/link/16512/13912043/EP318_Brumate_tc.mp3",
            "epNo": "227"
        },
        {
            "title": "Why Building a Community Prevents Subscription Cancellations",
            "datePublished": "Tue, 11 Jun 2019 04:30:06 +0000",
            "description": "<p>Adrian Wood went from making music on his laptop to producing for the likes of 50 Cent, Snoop Dogg, and Eminem.</p>\n<p>Beyond catchy composition and rhythm with a hook, he discovered that there were many hopeful producers who lack access to digital assets like drum kits or synth loops to create the songs they had in their minds. Ever since joining Modern Producers as the CEO in 2013, Adrian is on a mission to deliver these digital assets to up-and-coming producers and has built a loyal community of monthly subscribers and outsourced almost all of the content production.<br />\nClick here for more information on Modern Producers and show notes: https://www.shopify.com/blog/modern-producers-subscription<br />\nIn this episode of Shopify Masters, you'll learn from Adrian of Modern Producers on how he built a sustainable business selling digital products through a subscription model.</p>\n",
            "length": "41929377",
            "sourceUrl": "https://feedpress.me/link/16512/13912044/MODERNPRODUCERS_tc.mp3",
            "epNo": "226"
        },
        {
            "title": "A Lesson in Project Management for Entrepreneurs",
            "datePublished": "Tue, 4 Jun 2019 04:30:10 +0000",
            "description": "<p>JP Brousseau dropped and broke his fair share of phones. Sick of replacements and repairs, he started Phone Loops and designed finger and wrist straps that give users a secure and comfortable grip on their devices.</p>\n<p>Despite solving a common problem, having massive media coverage, and being a part of the Oscars VIP gift bags, JP credits project management as the key to Phone Loops’ success.</p>\n<p>In today's episode of Shopify Masters, you’ll hear from JP and COO of Phone Loops, Alex Gingras on how one project management tool helped them to reach millions of sales.</p>\n<p>Tune in to learn</p>\n<ul>\n<li>How they appeared on national TV programs, received media coverage, and got to be apart of the Oscars VIP gift bags</li>\n<li>What questions your Facebook ads consultant should be asking you</li>\n<li>How to scale a 2,000 influencer marketing program</li>\n</ul>\n<p>Show Notes: https://www.shopify.com/blog/phone-loops-product-management</p>\n",
            "length": "45279738",
            "sourceUrl": "https://feedpress.me/link/16512/13912045/PHONELOOPS_tc.mp3",
            "epNo": "225"
        },
        {
            "title": "Fame Didn't Do Any Favors For This NFL Player Turned Entrepreneur",
            "datePublished": "Tue, 28 May 2019 04:30:16 +0000",
            "description": "<p>With more and more celebrities and athletes starting successful businesses, it seems like being already-famous can be quite the headstart. But that doesn't get you out of all the things that can make succeeding in business hard.</p>\n<p>Chris Gronkowski is a former NFL player who learned the hard way that having a sizeable following is no substitute for a product that truly serves the market.</p>\n<p>In today's episode of Shopify Masters, you’ll hear about the humbling moment when he realized that simply pushing his product wasn't going to be enough, and how he built his ecommerce business from scratch to do $3 million in sales.</p>\n<p>Ice Shaker is the ultimate cup used for every aspect of a healthy lifestyle.</p>\n<p>Brand new product, you’re on top of the world. But people out there who have never heard of it before aren’t just going to jump on the bandwagon because you think it’s cool, just because they follow you. You really have to build some kind of proof of concept, some reviews, and really start building a brand.</p>\n<p>Tune in to also learn:</p>\n<ul>\n<li>Why you should read product reviews when designing a new product</li>\n<li>How to address people that say they can get the same product for free</li>\n<li>How to change your ads if your buyers are different than the end user</li>\n</ul>\n<p>Show notes: www.shopify.com/blog/ice-shaker-fame</p>\n",
            "length": "52673018",
            "sourceUrl": "https://feedpress.me/link/16512/13912046/ICESHAKER_tc.mp3",
            "epNo": "224"
        },
        {
            "title": "The Corporate Gifting Strategy That Unlocked Their B2B Revenue",
            "datePublished": "Tue, 21 May 2019 04:30:01 +0000",
            "description": "<p>There are many ways to tap into B2B sales as a B2C brand, depending on your products. Corporate gifts are one entry point.</p>\n<p>In today's episode of Shopify Masters, you’ll learn from a trio of entrepreneurs who bootstrapped their way to a $9 million business thanks in large part to their corporate gifting strategy.</p>\n<p>Chelsea Moore, Jenni Olivero, and Sabena Suri are the co-founders of BOXFOX: pre-curated gift boxes for every milestone, with the option to build a 100% custom gift using their BUILD A BOXFOX platform.</p>\n<p>Show Notes: www.shopify.com/blog/boxfox-corporate-gifting</p>\n",
            "length": "52063216",
            "sourceUrl": "https://feedpress.me/link/16512/13912047/BOXFOX_tc.mp3",
            "epNo": "223"
        },
        {
            "title": "Growing from 7 FIgures to 8 FIgures And The New Problems You Face",
            "datePublished": "Tue, 14 May 2019 04:30:24 +0000",
            "description": "<p>When you first launch, you're faced with one set of problems—polishing your site, making sales, and becoming profitable. As you scale, those problems change with every new level of growth you achieve.</p>\n<p>In this episode of Shopify Masters, you’ll learn from two entrepreneurs who recently grew their business from 7 figures to 8 figures about the new problems they encountered, from hiring the right people to fixing a toxic company culture.</p>\n<p>Show Notes: http://www.shopify.com/blog/moonglow-scaling-problems</p>\n",
            "length": "40387526",
            "sourceUrl": "https://feedpress.me/link/16512/13912048/MOONGLOW_tc.mp3",
            "epNo": "222"
        },
        {
            "title": "How This Company Stays Profitable While Giving Away Cars",
            "datePublished": "Tue, 7 May 2019 04:30:11 +0000",
            "description": "<p>Giveaways are a common marketing tactic in ecommerce, often taking the form of a free product or a gift card. But some go even bigger with their prizes.</p>\n<p>In this episode of Shopify Masters, you'll learn from Justin Burnash, founder of Prime Driven, about how they give away entire cars (you read that right) while still making a profit.</p>\n<p>Justin Burnash is the founder of Prime Driven: a 7-figure business and one stop shop for Toyota car parts.</p>\n<p><strong>Show Notes</strong>: www.shopify.com/blog/prime-driven-car-giveaway</p>\n",
            "length": "52515030",
            "sourceUrl": "https://feedpress.me/link/16512/13912049/PRIMEDRIVEN_tc.mp3",
            "epNo": "221"
        },
        {
            "title": "Achieving a 4.5% Mobile Conversion Rate",
            "datePublished": "Tue, 30 Apr 2019 04:30:00 +0000",
            "description": "<p>One look at your traffic sources will likely tell you that mobile shopping is becoming the new normal. And with this shift in consumer behavior comes the growing importance of mobile-first conversion rate optimization.</p>\n<p>In this episode of Shopify Masters, you’ll hear from Michael Levy, CMO of Pete &amp; Pedro, about how they created a mobile website with a 4.5% conversion rate.</p>\n<p>Pete &amp; Pedro is a company that sells premium grooming products to help men become more confident and look their best.</p>\n<p><strong>Transcript:</strong> http://www.shopify.com/blog/pete-pedro-mobile-cro</p>\n",
            "length": "39485291",
            "sourceUrl": "https://feedpress.me/link/16512/13912050/ec541689_tc.mp3",
            "epNo": "220"
        },
        {
            "title": "Tripling Revenue on a 30-Year-Old Mattress Company",
            "datePublished": "Tue, 23 Apr 2019 04:30:00 +0000",
            "description": "<p>In this episode of Shopify Masters, you'll learn from an entrepreneur who bought a 30-year old company and tripled its revenue</p>\n<p>Soaring Heart handcrafts exquisite organic mattresses and bedding from only the finest materials.</p>\n<p>Show notes:  http://www.shopify.com/blog/soaring-heart-differentiation</p>\n",
            "length": "43898055",
            "sourceUrl": "https://feedpress.me/link/16512/13912051/5c44dda1_tc.mp3",
            "epNo": "219"
        },
        {
            "title": "Focus Is the Key for New Entrepreneurs (In More Ways Than One)",
            "datePublished": "Tue, 16 Apr 2019 04:30:00 +0000",
            "description": "<p>Every entrepreneur at some point learns the true meaning of &quot;focus&quot; and how it applies to so much more than just time management.</p>\n<p>In this episode of Shopify Masters, you’ll learn from one founder who built a million dollar jean company by shifting from a broad focus to a narrow one with his life, his product, his marketing, and more.</p>\n<p>Leo Tropeano is the founder of Mugsy Jeans: stylish jeans for men that are as comfortable as sweatpants.</p>\n<p><strong>Show notes:</strong> https://www.shopify.com/blog/mugsy-focus</p>\n",
            "length": "34507395",
            "sourceUrl": "https://feedpress.me/link/16512/13912052/15322233_tc.mp3",
            "epNo": "218"
        },
        {
            "title": "What It Takes to Get a Million Views on YouTube",
            "datePublished": "Tue, 9 Apr 2019 04:30:00 +0000",
            "description": "<p>In this episode of Shopify Masters, you’ll learn from two entrepreneurs who regularly produce YouTube videos that drive millions of views.</p>\n<p>Patrick Adair Designs creates rings made of materials like carbon fiber, titanium, and other rare materials.</p>\n<p><strong>Tune in to learn</strong></p>\n<ul>\n<li>How to get your first sales by running Instagram auctions</li>\n<li>Why content needs to change when you’re building an audience versus creating customers</li>\n<li>Their exact strategy to creating and promoting a YouTube video to a million views</li>\n</ul>\n<p><strong>Show notes:</strong> https://www.shopify.com/blog/patrick-adair-million-views</p>\n",
            "length": "51499128",
            "sourceUrl": "https://feedpress.me/link/16512/13912053/6b0111a2_tc.mp3",
            "epNo": "217"
        },
        {
            "title": "Building a $5 Million Business By Speaking to Sneakerheads with Content",
            "datePublished": "Tue, 2 Apr 2019 04:30:00 +0000",
            "description": "<p>Sometimes faith in the product is enough for a struggling entrepreneur with no experience to eventually grow into the owner of a successful business.</p>\n<p>In this episode of Shopify Masters, you’ll hear from one of these entrepreneurs who built a $5 million shoecare business by tapping into the content and influencers that sneakerheads care about.</p>\n<p>Stephen Grear is the founder of Reshoevn8r: premium shoe care products for stylish individuals who like to wear their shoes with confidence.</p>\n<p><strong>Tune in to learn</strong></p>\n<ul>\n<li>How to find an Instagram influencer to be your brand ambassador</li>\n<li>How to re-use your content on different platforms</li>\n<li>How a brand can create their own YouTube channel</li>\n</ul>\n<p><strong>Show Notes:</strong> www.shopify.com/blog/reshoevn8r-content-marketing</p>\n",
            "length": "29225224",
            "sourceUrl": "https://feedpress.me/link/16512/13912054/9ffb122a_tc.mp3",
            "epNo": "216"
        },
        {
            "title": "The Pillar Approach: Turning a Twitch Show Into Months of Content",
            "datePublished": "Tue, 26 Mar 2019 04:30:00 +0000",
            "description": "<p>In this episode of Shopify masters, you'll learn from entrepreneurs that focus on creating pillar content that they then use to generate endless content for each social media platform.</p>\n<p>Maxx Burman and  Banks Boutte are the founders of Kitbash 3D. Kitbash3D designs premium 3d model kits with everything you need to create immersive digital environments.</p>\n<p><strong>Tune in to learn</strong></p>\n<ul>\n<li>What is pillar content and how it can allow you to create content specific for each social media platform</li>\n<li>How to put on an online festival for your business</li>\n<li>How focusing on B2B customers can improve your product for all types of customers</li>\n</ul>\n<p><strong>Show Notes:</strong> http://www.shopify.com/blog/kitbash3d-pillar-content</p>\n",
            "length": "51929186",
            "sourceUrl": "https://feedpress.me/link/16512/13912055/808313bc_tc.mp3",
            "epNo": "215"
        },
        {
            "title": "Selling Courses and a Membership Program on Shopify",
            "datePublished": "Tue, 19 Mar 2019 04:30:00 +0000",
            "description": "<p>In this episode, you’ll learn from a hobbyist turned business owner on how to find your niche and how to create &amp; market a course through Shopify.</p>\n<p>Danielle Spurge is the founder of The Merriweather Council. Danielle helps entrepreneurial makers leverage their talents to create sustainable craft-based businesses.</p>\n<p><strong>Tune in to learn</strong></p>\n<ul>\n<li>Why niching down will actually build your business</li>\n<li>How to transition from being a hobbyist to a business owner and how much time you need</li>\n<li>How to create and market a course, even if you don’t think you’re an expert</li>\n</ul>\n<p><strong>Show Notes:</strong> www.shopify.com/blog/merriweather-memberships-courses</p>\n",
            "length": "53934992",
            "sourceUrl": "https://feedpress.me/link/16512/13912056/df2e7edf_tc.mp3",
            "epNo": "214"
        },
        {
            "title": "Controversy, Haters, and Trolls: Dealing With Negativity Online",
            "datePublished": "Tue, 12 Mar 2019 09:30:00 +0000",
            "description": "<p>In this episode, you'll learn from an entrepreneur on how to gracefully handle haters and trolls.</p>\n<p>Lindsay Rubin is the founder of V-dog. V-dog creates healthy, vegan food and treats for dogs.</p>\n<p><strong>Tune in to learn</strong></p>\n<ul>\n<li>How to make sure customers know your core values</li>\n<li>How to handle disagreements with trolls on social media</li>\n<li>How to create blog posts that customers actually want</li>\n</ul>\n<p>**Show Notes:**www.shopify.com/blog/v-dog-controversy-trolls</p>\n",
            "length": "50283251",
            "sourceUrl": "https://feedpress.me/link/16512/13912057/4c0d3202_tc.mp3",
            "epNo": "213"
        },
        {
            "title": "Being Unique Vs Being Too Unique",
            "datePublished": "Tue, 5 Mar 2019 04:30:00 +0000",
            "description": "<p>Being different is the shortest path to standing out with your products in a crowded space. That's not always a good thing, however, when it wins your customer's attention but loses their confidence as a buyer.</p>\n<p>In this episode of Shopify Masters, we talk about why it's important to create products that are unique but recognizable to new customers.</p>\n<p>Our guest is Mark Graham who heads up engineering at Grilla Grills: the best wood pellet, smoker, and ceramic grills to meet your needs.</p>\n<p><strong>Tune in to learn</strong></p>\n<ul>\n<li>The power of a unique looking product</li>\n<li>Why you want to create a video comparing all of your products<br />\n-When you should focus on releasing new products versus improving existing products</li>\n</ul>\n<p><strong>Show Notes:</strong> http://www.shopify.com/blog/grilla-grills-uniqueness</p>\n",
            "length": "39132951",
            "sourceUrl": "https://feedpress.me/link/16512/13912058/80166728_tc.mp3",
            "epNo": "212"
        },
        {
            "title": "The Secret to Partnering with A-List Celebrities Like Drake",
            "datePublished": "Tue, 26 Feb 2019 04:30:00 +0000",
            "description": "<p>In this episode, you'll learn from an entrepreneur who built a million dollar business by getting celebrities like Drake to partner with him.</p>\n<p>Sean Kelly is the founder of Jersey Champs. Jersey Champ is your one-stop shop for one of a kind jerseys that make you stand out from the crowd.</p>\n<p><strong>Tune in to learn</strong></p>\n<ul>\n<li>How to grow your Instagram to your first 10,000 followers</li>\n<li>What makes celebrities like Drake and 2Chainz want to work with you</li>\n<li>What will getting an Instagram verified badge do for your business</li>\n</ul>\n<p><strong>Show Notes:</strong> http://www.shopify.com/blog/jersey-champ-celebrities</p>\n",
            "length": "36267423",
            "sourceUrl": "https://feedpress.me/link/16512/13912059/6190e041_tc.mp3",
            "epNo": "211"
        },
        {
            "title": "The \"100 T-Shirts\" Approach to Product Validation",
            "datePublished": "Tue, 19 Feb 2019 04:30:00 +0000",
            "description": "<p>In this episode, you'll learn from an entrepreneur who tested her business idea by selling 100 t-shirts before launching their own website</p>\n<p>Mallory Rowan is the founder of LVD FItness. LVD is a lifestyle apparel company that provides one month of clean water for every item sold.</p>\n<p><strong>Tune in to learn</strong></p>\n<ul>\n<li>How they sold 100 shirts before launching their store</li>\n<li>How to build a community that engages with each other</li>\n<li>Why the type of content matters depending on which social media platform you’re using</li>\n</ul>\n<p><strong>Show Notes:</strong> http://www.shopify.com/blogs/blog/lvd-vip-list</p>\n",
            "length": "42245073",
            "sourceUrl": "https://feedpress.me/link/16512/13912060/50e360de_tc.mp3",
            "epNo": "210"
        },
        {
            "title": "Partnering With Influencers  While They're Still Small",
            "datePublished": "Tue, 12 Feb 2019 04:30:00 +0000",
            "description": "<p>In today's episode of Shopify Masters, you'll learn from two sisters who leveraged micro influencers to boost their brand. Liza and Lana Mushamel are the founders of Twinkled T: a brand that sells a range of unique nail products designed to bring the nail salon directly into your home.</p>\n<p><strong>Tune in to learn</strong></p>\n<ul>\n<li>How to encourage customers to share their photos</li>\n<li>How to use YouTube to drive traffic to your store</li>\n<li>How to uncover Instagram influencers before they get huge</li>\n</ul>\n<p><strong>Show Notes:</strong> http://www.shopify.com/blogs/blog/twinkled-t-micro-influencers</p>\n",
            "length": "43962046",
            "sourceUrl": "https://feedpress.me/link/16512/13912061/900c1224_tc.mp3",
            "epNo": "209"
        },
        {
            "title": "When Facebook and Google Ads Are Off the Table",
            "datePublished": "Tue, 5 Feb 2019 04:30:00 +0000",
            "description": "<p>In this episode, you'll learn from an entrepreneur who grew their business by finding influencers in Facebook groups</p>\n<p>Saadiq Daya is the founder of VagoGo Vapes. VanGo Vapes creates Liquid for Inhalable-Flavor Connoisseurs</p>\n<p><strong>Tune in to learn</strong></p>\n<ul>\n<li>What to do when you cannot advertise your product on Facebook or Google</li>\n<li>How to use Reddit &amp; Facebook groups for influencer marketing</li>\n<li>How to approach your business when the industry transforms from a sub-culture to mainstream</li>\n</ul>\n<p><strong>Show Notes:</strong> http://www.shopify.com/blogs/blog/vango-vapes-marketing</p>\n",
            "length": "39956331",
            "sourceUrl": "https://feedpress.me/link/16512/13912062/6f25ecb1_tc.mp3",
            "epNo": "208"
        },
        {
            "title": "Why You Need to Get on the Phone When Selling a High-Ticket Product",
            "datePublished": "Mon, 28 Jan 2019 23:30:00 +0000",
            "description": "<p>In this episode of Shopify Masters, you’ll learn from an entrepreneur who focuses on selling her customers on a transformation and why the phone is one of her most important channels.</p>\n<p>Misha Tenenbaum is the CEO of EditStock provides unedited film projects for students to practice video editing.</p>\n<p><strong>Tune in to learn:</strong></p>\n<ul>\n<li>How to find your first 100 customers and what you what you should try to learn from them</li>\n<li>Why you need to sell your customer’s transformation instead of your product</li>\n<li>Why it’s so important to get on the phone with customers especially when you have a higher ticket product</li>\n</ul>\n<p><strong>Show Notes:</strong> http://www.shopify.com/blogs/blog/edit-stock-cold-phone-call</p>\n",
            "length": "50781050",
            "sourceUrl": "https://feedpress.me/link/16512/13912063/07f9c0fe_tc.mp3",
            "epNo": "207"
        },
        {
            "title": "Getting the Perfect YouTube Product Review",
            "datePublished": "Mon, 21 Jan 2019 23:27:00 +0000",
            "description": "<p>YouTube is arguably one of the top destinations for editorial (i.e. not sponsored) product reviews. Having your products covered by the right reviewer, especially if you're confident in what you're selling, can be a huge win for your business.</p>\n<p>On today's episode of Shopify Masters, we talk about how one company leverages reviewers in the tech and gaming space to bring their products to customers who are ready to buy.</p>\n<p>Joe Lieberman is our guest and the Director of Marketing for Antlion Audio: a company that manufactures the world’s leading attachment mic, turning any pair of headphones into a gaming headset.</p>\n<p>Show Notes: https://bit.ly/2W5zE23</p>\n",
            "length": "50564135",
            "sourceUrl": "https://feedpress.me/link/16512/13912064/7d0cd541_tc.mp3",
            "epNo": "206"
        },
        {
            "title": "Using Free Digital Products to Grow Your Business",
            "datePublished": "Mon, 14 Jan 2019 23:01:00 +0000",
            "description": "<p>At its core, effective content marketing isn't merely about churning out blog posts, YouTube videos, or podcasts—it's about creating value independent of your products or services and giving it away to your ideal customers.</p>\n<p>In this episode of Shopify Masters, you’ll learn from an entrepreneur who did just that with free printables, growing an email list of over of 200,000 parents and teachers. It's the strategy they first used when they start and still use today.</p>\n<p>Alexandra Eidens is our guest today and the founder of Big Life Journal: the world’s first growth mindset journals for kids, tweens, and teens.</p>\n<p><strong>Tune in to learn:</strong></p>\n<ul>\n<li>How to find freelancers to build your lead magnets</li>\n<li>How to build a<br />\n200,000 person email list using free printables</li>\n<li>How to run a 60,000 member Facebook group without losing control</li>\n</ul>\n<p><strong>Show Notes:</strong> http://www.shopify.com/blogs/blog/big-life-journal-printables</p>\n",
            "length": "47804359",
            "sourceUrl": "https://feedpress.me/link/16512/13912065/12e3e7e3_tc.mp3",
            "epNo": "205"
        },
        {
            "title": "Turning Your Customers Into Your Influencers",
            "datePublished": "Mon, 7 Jan 2019 23:42:00 +0000",
            "description": "<p>With all the buzz about influencer marketing, it's easy to forget that many of your customers have their own online presence and a network they can influence.</p>\n<p>On today's episode of Shopify Masters, we invite an entrepreneur to share how she grew her business by creating a micro-ambassador program for her brand, effectively turning her customers into her influencers.</p>\n<p>Cindy Collins is the founder of Euphoric Herbals: maker of herbal products, specializing in pregnancy and postpartum, for women and their families.</p>\n<p><strong>Tune in to learn:</strong></p>\n<ul>\n<li>How to identify which business to focus on when you’ve started multiple businesses</li>\n<li>How to think bigger as an ecommerce entrepreneur</li>\n<li>What is a micro ambassador program and how to identify worthy ambassadors</li>\n</ul>\n<p><strong>Show Notes:</strong> http://www.shopify.com/blogs/blog/euphoric-herbals-micro-ambassadors</p>\n",
            "length": "50413258",
            "sourceUrl": "https://feedpress.me/link/16512/13912066/c3946642_tc.mp3",
            "epNo": "204"
        },
        {
            "title": "Growing an Email List of 20,000 (Without a Product to Sell)",
            "datePublished": "Mon, 10 Dec 2018 23:36:00 +0000",
            "description": "<p>In this episode, you’ll learn from an entrepreneur who had a successful product launch by having a highly engaged pre-launch email list.</p>\n<p>Will Africano is the co-founder of GNARBOX: a company that develops products and solutions to revolutionize the multimedia management experience.</p>\n<p>Through that email list, we started messaging and surveying and bringing all of those people into the product development experience.</p>\n<p><strong>Tune in to learn</strong></p>\n<ul>\n<li>How to find the right co-founder for your startup</li>\n<li>How to build a highly engaged 20,000 person pre-launch email list</li>\n<li>What angel investors care about versus venture capitalists</li>\n</ul>\n<p>Show Notes: http://www.shopify.com/blogs/blog/gnarbox-list-building</p>\n",
            "length": "49661333",
            "sourceUrl": "https://feedpress.me/link/16512/13912067/c9758fb8_tc.mp3",
            "epNo": "203"
        },
        {
            "title": "Extreme Business Makeover: Overhauling a Decade-Old Brand",
            "datePublished": "Mon, 3 Dec 2018 23:30:00 +0000",
            "description": "<p>Buying a 10-year-old brand often comes with its fair share of advantages: a proven product, an established customer base, and a solid reputation.<br />\nA rebrand, no matter how much it's needed, can put all of that at risk. Alex Yurek is an entrepreneur who bought and overhauled a mature brand, and on this episode of Shopify Masters he'll share how to do it right.</p>\n<p>Detour Coffee Roasters is one of the top coffee roasters in Canada and is on a mission to make sure no one has to drink a bad cup of coffee again.</p>\n<p><strong>Tune in to learn:</strong></p>\n<ul>\n<li>The process that goes into buying an existing brand</li>\n<li>How to overhaul your brand safely</li>\n<li>How to create a website that serves new customers,<br />\nreturning customers and B2B customers all at the same time</li>\n</ul>\n<p>Show Notes: http://www.shopify.com/blogs/blog/detour-coffee-rebrand</p>\n",
            "length": "50221425",
            "sourceUrl": "https://feedpress.me/link/16512/13912068/6b68e558_tc.mp3",
            "epNo": "202"
        },
        {
            "title": "Customer Onboarding: The Key to Repeat Customers",
            "datePublished": "Mon, 26 Nov 2018 23:29:00 +0000",
            "description": "<p>It generally costs a lot less money and time to sell to existing customers than it does to acquire new ones. That's why marketing shouldn't stop when a customer makes a purchase—not when you can onboard them to help them realize the full value of your products.</p>\n<p>In this episode of Shopify Masters, you’ll learn from an entrepreneur who believes the most important activity you can do to generate repeat business is to onboard new customers after they purchase.</p>\n<p>Patrick Coddou is the founder of Supply: an independent online retailer of premium grooming gear for guys that demand the best.</p>\n<p>Tune in to learn</p>\n<ul>\n<li>How your approach to business transforms when you are able to work on it full-time</li>\n<li>How to onboard new customers with emails so they can get the most value out of your product</li>\n<li>How to catch viewers' attention in the first 5 seconds of a YouTube video so they don’t skip your ad</li>\n</ul>\n<p>Show Notes: http://www.shopify.com/blogs/blog/supply-customer-onboarding</p>\n",
            "length": "47961079",
            "sourceUrl": "https://feedpress.me/link/16512/13912069/3ce89f9c_tc.mp3",
            "epNo": "201"
        },
        {
            "title": "Lessons in Scaling",
            "datePublished": "Mon, 19 Nov 2018 23:30:00 +0000",
            "description": "<p>Growing a seven-figure business in your first year means scaling fast just to keep up. But it's sometimes the things that don't scale that get you there.</p>\n<p>In this episode of Shopify Masters, you’ll learn from an entrepreneur who built an 8-figure business by focusing on product-market fit above all else.</p>\n<p>Paul Hedrick is the founder of Tecovas: makers of beautiful, top-quality western boots &amp; accessories by hand and sells them directly at honest prices.</p>\n<p>Here are the lessons he learned as he scaled the size of his team and his advertising spend.</p>\n<p><strong>Tune in to learn</strong></p>\n<ul>\n<li>How this brand reached 7-figures in their first year by doing things that did not scale</li>\n<li>How to do market research by talking to sales associates at retail stores</li>\n<li>How your average order value affects your advertising strategy</li>\n</ul>\n<p>Show Notes: https://bit.ly/2DoxFyQ</p>\n",
            "length": "49612432",
            "sourceUrl": "https://feedpress.me/link/16512/13912070/2ac1dcde_tc.mp3",
            "epNo": "200"
        },
        {
            "title": "Selling to Businesses by Partnering With Their \"Stack\"",
            "datePublished": "Mon, 12 Nov 2018 23:43:00 +0000",
            "description": "<p>In today's episode of Shopify Masters, you’ll learn how one company transitioned from selling directly to consumers to selling mostly to businesses through partnerships.</p>\n<p>Alon Tamir is the founder and CEO of Studio Proper: maker of beautiful hardware accessories that enable great Apple technology experiences for individuals and businesses alike.</p>\n<p><strong>Tune in to learn</strong></p>\n<ul>\n<li>What is an industrial designer and how much does it cost to work with<br />\none</li>\n<li>How you can get burned from a partnership</li>\n<li>How to transition your site to attract more B2B customers</li>\n</ul>\n<p>Show Notes: http://www.shopify.com/blogs/blog/proper-b2c-to-b2b</p>\n",
            "length": "45965330",
            "sourceUrl": "https://feedpress.me/link/16512/13912071/446b3457_tc.mp3",
            "epNo": "199"
        },
        {
            "title": "Why Product-Market Fit Should Start with the Market First",
            "datePublished": "Mon, 5 Nov 2018 23:29:00 +0000",
            "description": "<p>In this episode of Shopify Masters, you’ll learn from an entrepreneur who relentlessly studies his market to remove features from his products and achieve a better product-market fit.</p>\n<p><strong>Tune in to learn</strong></p>\n<ul>\n<li>A unique way to get an appointment with a retail buyer</li>\n<li>How to mold your product to improve your product-market fit</li>\n<li>How to keep the momentum going after a successful crowdfunding<br />\ncampaign</li>\n</ul>\n<p>Show Notes: http://www.shopify.com/blogs/blog/paper-wallet-product-market-fit</p>\n",
            "length": "45659382",
            "sourceUrl": "https://feedpress.me/link/16512/13912072/46344dc6_tc.mp3",
            "epNo": "198"
        },
        {
            "title": "Turning Old VHS Tapes into a $20 Million a Year Business",
            "datePublished": "Mon, 29 Oct 2018 23:22:00 +0000",
            "description": "<p>The memories you make are priceless. Unless you create a service to help people immortalize them, like our guest on this episode of Shopify Masters.</p>\n<p>Nick Macco is the founder of Legacybox: a service that helps people organize, preserve, and enjoy the most important recorded moments by digitizing aging analog tapes, film, and pictures.</p>\n<p>Find out how he used small frequent failures to bootstrap his company into a $20 million per year business.</p>\n<p><strong>Tune in to learn</strong></p>\n<ul>\n<li>Why talking to customers gives you important insight faster than<br />\nlooking at analytics reports</li>\n<li>The lesson they learned from losing 80% of their company savings on<br />\none ad</li>\n<li>Why revenue should not always be the most important organizational<br />\ngoal</li>\n</ul>\n<p>Show Notes: http://www.shopify.com/blogs/blog/legacy-box-bootstrapping</p>\n",
            "length": "50921066",
            "sourceUrl": "https://feedpress.me/link/16512/13912073/4583f325_tc.mp3",
            "epNo": "197"
        },
        {
            "title": "An Unfair Advantage",
            "datePublished": "Mon, 22 Oct 2018 23:07:00 +0000",
            "description": "<p>In this episode of Shopify Masters, you’ll learn from an entrepreneur who launched a business with one of the biggest men’s lifestyle influencers on YouTube.</p>\n<p>Show Notes: http://www.shopify.com/blogs/blog/tiege-hanley-influencer-cofounder</p>\n",
            "length": "36895196",
            "sourceUrl": "https://feedpress.me/link/16512/13912074/dcfce1ae_tc.mp3",
            "epNo": "196"
        },
        {
            "title": "How to Choose Your Marketing Channels",
            "datePublished": "Mon, 15 Oct 2018 23:30:00 +0000",
            "description": "<p>On this episode of Shopify Masters, you'll learn from two growth hackers about how to go about prioritizing your marketing channels by asking the right questions about your context.</p>\n<p>Show Notes: http://www.shopify.com/blogs/blog/kettle-and-fire-choosing-channels</p>\n",
            "length": "49451530",
            "sourceUrl": "https://feedpress.me/link/16512/13912075/27d21cbd_tc.mp3",
            "epNo": "195"
        },
        {
            "title": "The $50k Email List With an Over 5x Return",
            "datePublished": "Mon, 8 Oct 2018 23:46:00 +0000",
            "description": "<p>In this episode of Shopify Masters, you’ll learn from Gaurav Agarwal, VP of Growth at Molekule: a science and technology company that has reinvented the air purifier.</p>\n<p>Show Notes: http://www.shopify.com/blogs/blog/molekule-prelaunch-email-list</p>\n",
            "length": "48349362",
            "sourceUrl": "https://feedpress.me/link/16512/13912076/4cf683bd_tc.mp3",
            "epNo": "194"
        },
        {
            "title": "Lifting Conversion Rates by Bundling Products",
            "datePublished": "Mon, 1 Oct 2018 23:33:00 +0000",
            "description": "<p>In this episode of Shopify Masters, you’ll learn from an entrepreneur who focuses on solving one major problem per product and then selling them in bundles.<br />\nMagMod designs sleek, portable, and durable flash modifiers for amateur and professional photographers.</p>\n<p>Show Notes: http://www.shopify.com/blogs/blog/mag-mod-bundles</p>\n",
            "length": "55183408",
            "sourceUrl": "https://feedpress.me/link/16512/13912077/b81e6fcb_tc.mp3",
            "epNo": "193"
        },
        {
            "title": "Common Dropshipping Mistakes",
            "datePublished": "Tue, 18 Sep 2018 11:00:00 +0000",
            "description": "<p>In this episode of Shopify Masters, you’ll learn from a serial dropshipper about the mistakes that he made, and that many new dropshippers make, and why he thinks Facebook ads aren't the best place to start your marketing.</p>\n<p>Show Notes: http://www.shopify.com/blog/sunyez-dropshipping-mistakes</p>\n",
            "length": "53875208",
            "sourceUrl": "https://feedpress.me/link/16512/13912078/ea5cc67a_tc.mp3",
            "epNo": "191"
        },
        {
            "title": "The Potential Upside (And Pitfalls) of Translating Your Facebook Ads",
            "datePublished": "Mon, 10 Sep 2018 23:26:00 +0000",
            "description": "<p>In this episode of Shopify Masters, you’ll learn from a marketer who broke through stagnating revenue growth by translating his ads into different languages.</p>\n<p>Show Notes: http://www.shopify.com/blogs/blog/keysmart-translating-ads</p>\n",
            "length": "40024876",
            "sourceUrl": "https://feedpress.me/link/16512/13912079/98a83115_tc.mp3",
            "epNo": "190"
        },
        {
            "title": "Thinking Outside of Your Industry for Unique Product Ideas",
            "datePublished": "Mon, 3 Sep 2018 23:31:00 +0000",
            "description": "<p>In this episode of Shopify Masters, you’ll learn from Raivis Vaitekuns, an entrepreneur in Latvia who found inspiration outside of the specialty coffee industry that he'd been in for six years, to produce a chocolate bar instead.</p>\n<p>Show Notes: http://www.shopify.com/blogs/blog/coffee-pixels-product-inspiration</p>\n",
            "length": "54013979",
            "sourceUrl": "https://feedpress.me/link/16512/13912080/6515a46f_tc.mp3",
            "epNo": "189"
        },
        {
            "title": "What the NBA, NFL, and Disney Look for in Product Licensing Deals",
            "datePublished": "Mon, 27 Aug 2018 23:30:00 +0000",
            "description": "<p>In this episode of Shopify Masters, you’ll learn from an entrepreneur who has built multiple businesses selling licensed products.</p>\n<p>Show Notes: http://www.shopify.com/blogs/blog/uncanncy-brands-licensing</p>\n",
            "length": "40263109",
            "sourceUrl": "https://feedpress.me/link/16512/13912081/f223c1dc_tc.mp3",
            "epNo": "188"
        },
        {
            "title": "Saving Time and Money by 3D Printing Your Prototypes",
            "datePublished": "Mon, 20 Aug 2018 23:30:00 +0000",
            "description": "<p>In this episode of Shopify Masters, you’ll hear from Chris Little, an entrepreneur who reduced his cost and time to market by 3D printing his prototypes before approaching manufacturers.</p>\n<p>Show Notes: http://www.shopify.com/blogs/blog/wintersmiths-prototypes</p>\n",
            "length": "38616774",
            "sourceUrl": "https://feedpress.me/link/16512/13912082/1629039a_tc.mp3",
            "epNo": "187"
        },
        {
            "title": "Why Low-Budget Videos Beat TV-Quality Ads on Facebook",
            "datePublished": "Mon, 13 Aug 2018 23:30:00 +0000",
            "description": "<p>In this episode of Shopify Masters, you’ll learn from an entrepreneur who discovered that the more organic and amateur his ads looked, the better they performed.</p>\n<p>Show Notes: http://www.shopify.com/blogs/blog/kitty-poo-club</p>\n",
            "length": "50733405",
            "sourceUrl": "https://feedpress.me/link/16512/13912083/42e967ca_tc.mp3",
            "epNo": "186"
        },
        {
            "title": "Going Facebook Live with New Product Releases",
            "datePublished": "Mon, 6 Aug 2018 23:19:00 +0000",
            "description": "<p>In this episode of Shopify Masters, you’ll learn how these two entrepreneurs do most of their direct communication with their community through Facebook Live videos— even going so far as to crowdsource product names and perform product releases live.</p>\n<p>Show Notes: http://www.shopify.com/blogs/blog/spirit-hoods-facebook-live</p>\n",
            "length": "55551226",
            "sourceUrl": "https://feedpress.me/link/16512/13912084/098800d2_tc.mp3",
            "epNo": "185"
        },
        {
            "title": "A Quiz-Powered Approach to Email Marketing",
            "datePublished": "Mon, 30 Jul 2018 23:30:00 +0000",
            "description": "<p>In this episode of Shopify Masters, you’ll learn from an entrepreneur who built a custom quiz to learn more about her customers and grow her email list.</p>\n<p>Show Notes: http://www.shopify.com/blogs/blog/primally-pure-quizzes</p>\n",
            "length": "45671091",
            "sourceUrl": "https://feedpress.me/link/16512/13912085/28037b32_tc.mp3",
            "epNo": "184"
        },
        {
            "title": "When Upselling Can Actually Hurt Your Sales",
            "datePublished": "Mon, 23 Jul 2018 23:30:00 +0000",
            "description": "<p>In this episode of Shopify Masters, you’ll learn from an entrepreneur who believes that not every business should try upselling and, when you do, there’s a right time to offer the upsell to customers.</p>\n<p>Show Notes: http://www.shopify.com/blogs/blog/liv-watches-upselling</p>\n",
            "length": "45071316",
            "sourceUrl": "https://feedpress.me/link/16512/13912086/1f77a299_tc.mp3",
            "epNo": "183"
        },
        {
            "title": "Designing a Subscription Box That's Worth Unboxing Every Month",
            "datePublished": "Mon, 16 Jul 2018 23:30:00 +0000",
            "description": "<p>In this episode of Shopify Masters, you’ll learn from an entrepreneur who started his own monthly subscription box to introduce an entire culture to his customers.</p>\n<p>Show Notes: http://www.shopify.com/blogs/blog/bokksu-subscription-box</p>\n",
            "length": "41779055",
            "sourceUrl": "https://feedpress.me/link/16512/13912087/493f2db7_tc.mp3",
            "epNo": "182"
        },
        {
            "title": "How to Sell Guitars by Running Them Over with a Prius",
            "datePublished": "Sat, 7 Jul 2018 23:14:00 +0000",
            "description": "<p>In this episode of Shopify Masters, you'll hear from Adam Klosowiak, the founder of KLOS Guitars: cool, durable, comfortable, portable carbon fiber guitars and ukuleles.</p>\n<p>Find out how they used outlandish durability test videos to get millions of views on Facebook, including going golfing and canoeing with their guitars.</p>\n<p>Show Notes: http://www.shopify.com/blogs/blog/klos-durability-test-videos</p>\n",
            "length": "54147314",
            "sourceUrl": "https://feedpress.me/link/16512/13912088/cbfc8298_tc.mp3",
            "epNo": "181"
        },
        {
            "title": "What Happens When a Former Tesla Employee Decides to Solve Bad Hangovers?",
            "datePublished": "Sat, 30 Jun 2018 23:00:00 +0000",
            "description": "<p>In this episode of Shopify Masters, you’ll learn how an ex-Tesla employee discovered a business idea during a trip to South Korea, quickly launched and then went back to redesign the brand.</p>\n<p>Show Notes: http://www.shopify.com/blogs/blog/morning-recovery-drink-branding</p>\n",
            "length": "59298263",
            "sourceUrl": "https://feedpress.me/link/16512/13912089/76033935_tc.mp3",
            "epNo": "180"
        },
        {
            "title": "Crafting a Stronger Marketing Message by Focusing on Fewer Features",
            "datePublished": "Sat, 23 Jun 2018 22:00:00 +0000",
            "description": "<p>Jean Wu is the founder of que Bottle: water bottle designed to be the best-looking collapsible water bottles that are both functional and fashionable.</p>\n<p>In this episode of Shopify Masters, you'll learn about the copywriting process she uses to create an emotional connection with customers.</p>\n<p>Show Notes: http://www.shopify.com/blogs/blog/que-bottle-focus-your-messaging</p>\n",
            "length": "52843277",
            "sourceUrl": "https://feedpress.me/link/16512/13912090/03f67528_tc.mp3",
            "epNo": "179"
        },
        {
            "title": "Rapid Prototyping: Using 3D Printing to Shorten Your Product Development Time",
            "datePublished": "Sun, 17 Jun 2018 09:00:00 +0000",
            "description": "<p>In this episode of Shopify Masters, you’ll learn from an entrepreneur that used 3D printing to create prototypes of their products before approaching manufacturers, an approach that greatly sped up their testing and iterating times with their manufacturer.</p>\n<p>Show Notes: http://www.shopify.com/blogs/blog/bulat-kitchen-3d-printing</p>\n",
            "length": "52607556",
            "sourceUrl": "https://feedpress.me/link/16512/13912091/68a38a83_tc.mp3",
            "epNo": "178"
        },
        {
            "title": "Which YouTube Influencers Will Actually Make You Money (And Which Ones Won't)",
            "datePublished": "Sat, 9 Jun 2018 22:00:00 +0000",
            "description": "<p>In this episode of Shopify Masters, you’ll learn from an entrepreneur who grew his business by identifying YouTubers who have real influence over what people buy and working with them.</p>\n<p>Show Notes: http://www.shopify.com/blogs/blog/chassis-youtube-influencers</p>\n",
            "length": "52947357",
            "sourceUrl": "https://feedpress.me/link/16512/13912092/08ce5ea5_tc.mp3",
            "epNo": "177"
        },
        {
            "title": "Why (And How) You Should Test Before You Invest in a T-Shirt Design",
            "datePublished": "Sun, 3 Jun 2018 09:00:00 +0000",
            "description": "<p>In this episode of Shopify Masters, you’ll hear the lessons learned by an entrepreneur who built a 6-figure print-on-demand apparel business.</p>\n<p>Ryan McCarthy is the founder of Sugoi Shirts: a store that designs &amp; sells streetwear inspired by Japanese pop culture and anime.</p>\n<p>Show Notes: http://www.shopify.com/blogs/blog/sugoi-shirts-testing-process</p>\n",
            "length": "54939764",
            "sourceUrl": "https://feedpress.me/link/16512/13912093/462cad0f_tc.mp3",
            "epNo": "176"
        },
        {
            "title": "From Diaper Money to Debt-Free: How This Designer Grew His Own Passive Income",
            "datePublished": "Sun, 27 May 2018 09:00:00 +0000",
            "description": "<p>In this episode of Shopify Masters, you’ll learn from Dustin Lee, a designer who pivoted from a freelance business to create passive income through digital products.<br />\nRetroSupply sells digital assets for graphic designers and illustrators inspired by history.</p>\n<p>Show Notes: http://www.shopify.com/blogs/blog/retro-supply-passive-income</p>\n",
            "length": "46771170",
            "sourceUrl": "https://feedpress.me/link/16512/13912094/d88af6ee_tc.mp3",
            "epNo": "175"
        },
        {
            "title": "The Benefits of Bundling: How This Business Does 7-Figures a Month Selling Product Kits",
            "datePublished": "Sun, 20 May 2018 09:00:00 +0000",
            "description": "<p>In this episode of Shopify Masters, you’ll learn from entrepreneurs who created &quot;kits&quot; from their existing products to build a business that now does 7 figures a month.</p>\n<p>Show Notes: http://www.shopify.com/blogs/blog/stealth-angel-product-kits</p>\n",
            "length": "47043287",
            "sourceUrl": "https://feedpress.me/link/16512/13912095/c239e5c9_tc.mp3",
            "epNo": "174"
        },
        {
            "title": "A Proven Process for Outsourcing Content as Part of Your SEO Strategy",
            "datePublished": "Sun, 13 May 2018 08:43:00 +0000",
            "description": "<p>In this episode of Shopify Masters, we do a deep dive into the methods used by an entrepreneur who hires a team of freelancers to create content that brings customers to his store from search engines.</p>\n<p>Show Notes: http://bit.ly/2rCAAgt</p>\n",
            "length": "52331281",
            "sourceUrl": "https://feedpress.me/link/16512/13912096/ca71eb69_tc.mp3",
            "epNo": "173"
        },
        {
            "title": "Why This CEO Still Spends Hours Every Day Doing Customer Support",
            "datePublished": "Sun, 6 May 2018 09:00:00 +0000",
            "description": "<p>In this episode of Shopify Masters, you’ll learn from an entrepreneur who has grown his company but still does his own customer service, and why he thinks the key to staying successful in his market is to continue to answer every email himself.</p>\n<p>Show Notes: http://www.shopify.com/blogs/blog/ergo-dox-customer-service</p>\n",
            "length": "51219085",
            "sourceUrl": "https://feedpress.me/link/16512/13912097/8af5acbb_tc.mp3",
            "epNo": "172"
        },
        {
            "title": "Pulling off a $10k Instagram Launch (Without Any Automation or Ad Spend)",
            "datePublished": "Sun, 29 Apr 2018 08:16:00 +0000",
            "description": "<p>On this episode of Shopify Masters, find out how The Content Planner grew a 4-figure Instagram following just large enough for a successful 5-figure launch without spending any money on ads or relying on social media automation.</p>\n<p>Show Notes: http://www.shopify.com/blogs/blog/content-planner-instagram-launch</p>\n",
            "length": "50577118",
            "sourceUrl": "https://feedpress.me/link/16512/13912098/03b72d14_tc.mp3",
            "epNo": "171"
        },
        {
            "title": "Crowdfunding on Multiple Platforms: Why You Don't Have to Choose Just One",
            "datePublished": "Sun, 22 Apr 2018 09:00:00 +0000",
            "description": "<p>Crowdfunding lowers the barrier to entry for budding entrepreneurs by solving the problem of startup capital.</p>\n<p>With Kickstarter being the leading platform, however, have you ever wondered what else is out there?</p>\n<p>On this episode of Shopify Masters, you’ll learn from two entrepreneurs who successfully launched the same product on Kickstarter, then Indiegogo, then other crowdfunding sites, to gain international exposure and maximize their efforts.</p>\n<p>Jay Neyer and Ross Oltorik are the founders of BodyBoss: the world’s first home gym you can take anywhere.</p>\n<p>Show Notes: http://www.shopify.com/blogs/blog/bodyboss-crowdfunding-multiple-platforms</p>\n",
            "length": "47465416",
            "sourceUrl": "https://feedpress.me/link/16512/13912099/7e7da5d9_tc.mp3",
            "epNo": "170"
        },
        {
            "title": "The Advantages of Embracing the Small in Small Business",
            "datePublished": "Sun, 15 Apr 2018 08:35:00 +0000",
            "description": "<p>In this episode of Shopify Masters, you’ll learn from an entrepreneur who redesigned the entire biblical library for a modern reading experience about how he found success as a small operation.</p>\n<p>Show Notes:  http://www.shopify.com/blogs/blog/bibliotheca-embracing-small-scale</p>\n",
            "length": "56711075",
            "sourceUrl": "https://feedpress.me/link/16512/13912100/b579d75f_tc.mp3",
            "epNo": "169"
        },
        {
            "title": "Using Customer Profiles as a Filter for Making Better Business Decisions",
            "datePublished": "Sun, 8 Apr 2018 09:00:00 +0000",
            "description": "<p>From the moment you choose to start a business, there are countless decisions to be made. Making the right ones often comes down to using your most valuable filter as an entrepreneur: your understanding of your customers.</p>\n<p>In this episode of Shopify Masters, you’ll learn from an entrepreneur who used customer profiles to make every decision that helped her find and tap into a new market within an established industry.</p>\n<p>Gloria Hwang is the founder of Thousand. Thousand is on a mission to rebrand the bike helmet, to help save lives, and reconnect people to their cities, by making a bike helmet you actually want to wear.</p>\n<p>Show Notes: http://www.shopify.com/blogs/blog/thousand-customer-profiles</p>\n",
            "length": "47779281",
            "sourceUrl": "https://feedpress.me/link/16512/13912101/9a0b4aa1_tc.mp3",
            "epNo": "168"
        },
        {
            "title": "The Facebook Live Strategy That Helps This Inventor Market to New Moms",
            "datePublished": "Sun, 1 Apr 2018 08:00:00 +0000",
            "description": "<p>On this episode of Shopify Masters, you'll hear from an entrepreneur who went from being a registered nurse with no business experience to the founder of a $1.4M business that was featured Shark Tank in the span of 2 years.</p>\n<p>Show Notes: http://bit.ly/2pUP0rv</p>\n",
            "length": "50678254",
            "sourceUrl": "https://feedpress.me/link/16512/13912102/0731fbe5_tc.mp3",
            "epNo": "167"
        },
        {
            "title": "The Case for Selling Your Product Before You Launch a Crowdfunding Campaign",
            "datePublished": "Tue, 27 Mar 2018 07:32:00 +0000",
            "description": "<p>In this episode of Shopify Masters, you’ll learn from two entrepreneurs who started selling a minimum viable version of their product to inform their Kickstarter campaign and ride the wave of their crowdfunding success.</p>\n",
            "length": "48808297",
            "sourceUrl": "https://feedpress.me/link/16512/13912103/f3505a7f_tc.mp3",
            "epNo": "166"
        },
        {
            "title": "Selling to Generation Z: Why This Company Launched a Sister Brand",
            "datePublished": "Tue, 20 Mar 2018 07:00:00 +0000",
            "description": "<p>In this episode of Shopify Masters, you’ll learn how an established company recognized a new type of customer buying their products and decided to create a completely separate brand to serve their emerging customer base: teenagers.</p>\n<p>Show Notes: http://www.shopify.com/blogs/blog/knixteen-selling-to-generation-z</p>\n",
            "length": "52695317",
            "sourceUrl": "https://feedpress.me/link/16512/13912104/ef360e27_tc.mp3",
            "epNo": "165"
        },
        {
            "title": "60 and Over: How This Entrepreneur Markets His Products to an Older Demographic",
            "datePublished": "Tue, 13 Mar 2018 06:20:00 +0000",
            "description": "<p>In this episode of Shopify Masters, you’ll hear from an entrepreneur who created his own balm and how he marketed it to a segment of 60-and-over customers by focusing on educating them about the ingredients that go into his product.</p>\n<p>Show Notes:  http://www.shopify.com/blogs/blog/selling-to-an-older-demographic</p>\n",
            "length": "47882149",
            "sourceUrl": "https://feedpress.me/link/16512/13912105/d70378b1_tc.mp3",
            "epNo": "164"
        },
        {
            "title": "Creating a Mission-Based Manufacturing Process That Gives Jobs to Military Spouses",
            "datePublished": "Tue, 6 Mar 2018 06:20:00 +0000",
            "description": "<p>In this episode of Shopify Masters, you’ll learn from two military spouses who became entrepreneurs to create a network of independent manufacturers to produce their products and to provide jobs for others like them.</p>\n<p>Show Notes: http://www.shopify.com/blogs/blog/military-spouses-manufacturing-process</p>\n",
            "length": "40883374",
            "sourceUrl": "https://feedpress.me/link/16512/13912106/8ed79fbf_tc.mp3",
            "epNo": "163"
        },
        {
            "title": "The Unintended Value Proposition That Sold Over 35 Million PopSockets",
            "datePublished": "Tue, 27 Feb 2018 08:34:00 +0000",
            "description": "<p>In this episode of Shopify Masters, you’ll hear from David Barnett, the inventor and founder of the wildly popular PopSocket: a unique smartphone accessory that provides a kickstand, earbud management, and ergonomic grip for your texting, calling, and gaming convenience.</p>\n<p>Show Notes: http://bit.ly/2C9nXAF</p>\n",
            "length": "41379076",
            "sourceUrl": "https://feedpress.me/link/16512/13912107/822e2298_tc.mp3",
            "epNo": "162"
        },
        {
            "title": "Non-Qualified Stock Options, Firing Fast, and the Art of Early Hiring",
            "datePublished": "Tue, 20 Feb 2018 07:50:00 +0000",
            "description": "<p>In this episode of Shopify Masters, you’ll learn from an entrepreneur who sells a product that’s heavy to ship, with long sales cycles and a high price point.</p>\n<p>Show Notes: http://www.shopify.com/blogs/blog/prx-performance-hiring-early</p>\n",
            "length": "43595104",
            "sourceUrl": "https://feedpress.me/link/16512/13912108/3e097729_tc.mp3",
            "epNo": "161"
        },
        {
            "title": "What It Takes to Win the Coveted Amazon Buy Box",
            "datePublished": "Tue, 13 Feb 2018 07:18:00 +0000",
            "description": "<p>In this episode of Shopify Masters, you’ll learn from an entrepreneur who reveals his method for doing product research and launching on Amazon to win the buy box.</p>\n<p>Show Notes: http://www.shopify.com/blogs/blog/aviox-amazon-buy-box</p>\n",
            "length": "41043027",
            "sourceUrl": "https://feedpress.me/link/16512/13912109/e7a10612_tc.mp3",
            "epNo": "160"
        },
        {
            "title": "Surviving in an Industry Where 6 Weeks Is the Equivalent of 6 Months",
            "datePublished": "Tue, 6 Feb 2018 07:39:00 +0000",
            "description": "<p>In this episode of Shopify Masters, you’ll learn from two entrepreneurs who built a systematized business where they can adapt quickly to a fast-growing vaping industry.</p>\n<p>Show notes:<br />\nhttp://www.shopify.com/blogs/blog/surviving-in-the-vaping-industry</p>\n",
            "length": "47577040",
            "sourceUrl": "https://feedpress.me/link/16512/13912110/1327936d_tc.mp3",
            "epNo": "159"
        },
        {
            "title": "Working With the Same Manufacturers Behind Many Luxury Brands",
            "datePublished": "Tue, 30 Jan 2018 08:00:00 +0000",
            "description": "<p>On this episode of Shopify Masters, you’ll learn how one entrepreneur is able to work with the top manufacturers that the luxury brands in his space also work with.</p>\n",
            "length": "51059433",
            "sourceUrl": "https://feedpress.me/link/16512/13912111/a2f7d993_tc.mp3",
            "epNo": "158"
        },
        {
            "title": "How This Social Enterprise Turns Its Customers Into Business Partners",
            "datePublished": "Tue, 23 Jan 2018 08:32:00 +0000",
            "description": "<p>On this episode of Shopify Masters, you’ll learn from two entrepreneurs who built a business where their customers help them source raw materials for their products, becoming their business partners in the process.</p>\n",
            "length": "46547145",
            "sourceUrl": "https://feedpress.me/link/16512/13912112/6a218e29_tc.mp3",
            "epNo": "157"
        },
        {
            "title": "More Than a Store: Why (And How) This Founder Built a Lifestyle Platform Instead",
            "datePublished": "Tue, 16 Jan 2018 08:16:00 +0000",
            "description": "<p>In this episode of Shopify Masters, you’ll learn from an entrepreneur who went beyond building a store and instead decided to create a platform to become the central hub for the Electronic Dance Music scene.</p>\n",
            "length": "49635430",
            "sourceUrl": "https://feedpress.me/link/16512/13912113/8af702f8_tc.mp3",
            "epNo": "156"
        },
        {
            "title": "The Business Benefits of Telling Stories That Aren't About You",
            "datePublished": "Tue, 9 Jan 2018 08:00:00 +0000",
            "description": "<p>In this episode of Shopify Masters, you’ll learn from two entrepreneurs who market their store by not only talking about their products, but by sharing stories about their customers and vendors.</p>\n",
            "length": "48428382",
            "sourceUrl": "https://feedpress.me/link/16512/13912114/88fb75a6_tc.mp3",
            "epNo": "155"
        },
        {
            "title": "From DIY to a Million Dollars: How Alien Outfitters Scaled By Curating Products",
            "datePublished": "Tue, 2 Jan 2018 08:42:00 +0000",
            "description": "<p>In this episode of Shopify Masters, you’ll learn from an entrepreneur who went from selling homemade products to scaling her business by becoming a reseller.</p>\n",
            "length": "49324068",
            "sourceUrl": "https://feedpress.me/link/16512/13912115/a8409e0f_tc.mp3",
            "epNo": "154"
        },
        {
            "title": "The Not-So-Magic Trick These Magicians Use to Launch a New Product Every Month",
            "datePublished": "Tue, 12 Dec 2017 08:00:00 +0000",
            "description": "<p>In this episode of Shopify Masters, you’ll learn from two sleight-of-hand magicians who collaborate with artists to create new playing card products every single month.</p>\n<p>Check out the show notes at: http://bit.ly/2BdVSqG</p>\n",
            "length": "53955044",
            "sourceUrl": "https://feedpress.me/link/16512/13912116/8d60c3e6_tc.mp3",
            "epNo": "153"
        },
        {
            "title": "The Art (and Science) of Facebook Video Ads That Work",
            "datePublished": "Tue, 5 Dec 2017 08:00:00 +0000",
            "description": "<p>In this episode of Shopify Masters, you’ll learn from an entrepreneur who has mastered the art of creating Facebook video ads and trailers for his digital products.</p>\n",
            "length": "55295437",
            "sourceUrl": "https://feedpress.me/link/16512/13912117/4ff01009_tc.mp3",
            "epNo": "152"
        },
        {
            "title": "How This $3K a Day T-Shirt Store Is Preparing for the Holiday Season",
            "datePublished": "Tue, 28 Nov 2017 08:03:00 +0000",
            "description": "<p>In this episode of Shopify Masters, you’ll learn from an entrepreneur who sells $3,000 worth of t-shirts every day and how he’s preparing for the busy holiday shopping season.</p>\n",
            "length": "58046459",
            "sourceUrl": "https://feedpress.me/link/16512/13912118/02051901_tc.mp3",
            "epNo": "151"
        },
        {
            "title": "How to Market a Product Your Customers (Probably) Won't Show Off in Public",
            "datePublished": "Tue, 21 Nov 2017 08:00:00 +0000",
            "description": "<p>In this episode of Shopify Masters, you’ll learn from an entrepreneur who sells underwear by targeting gift givers.</p>\n",
            "length": "48419173",
            "sourceUrl": "https://feedpress.me/link/16512/13912119/6097fb65_tc.mp3",
            "epNo": "150"
        },
        {
            "title": "The Best Way to Convince Customers to Buy an Expensive Product",
            "datePublished": "Tue, 14 Nov 2017 07:22:00 +0000",
            "description": "<p>In this episode of Shopify Masters, you’ll learn from two entrepreneurs who believe you should win your customers’ trust with lower cost products before they feel confident to buy your more expensive products.</p>\n",
            "length": "53047255",
            "sourceUrl": "https://feedpress.me/link/16512/13912120/3fa8b389_tc.mp3",
            "epNo": "149"
        },
        {
            "title": "Everything Under One Roof: Creating a \"Full-Stack\" Product Design Company",
            "datePublished": "Tue, 7 Nov 2017 07:17:00 +0000",
            "description": "<p>In this episode of Shopify Masters, you’ll learn from two entrepreneurs that built a company with their design, manufacturing and marketing all done in-house.</p>\n",
            "length": "47745846",
            "sourceUrl": "https://feedpress.me/link/16512/13912121/3c414c10_tc.mp3",
            "epNo": "148"
        },
        {
            "title": "You Don't Need to Choose Between Making a Living and Making a Difference",
            "datePublished": "Tue, 31 Oct 2017 07:22:00 +0000",
            "description": "<p>In this episode of Shopify Masters, you’ll hear from Jess Ekstrom, who started Headbands of Hope when she was in college, and now offers a wide range of beautiful headbands and hair accessories for all ages.</p>\n",
            "length": "44747419",
            "sourceUrl": "https://feedpress.me/link/16512/13912122/6b23dc77_tc.mp3",
            "epNo": "147"
        },
        {
            "title": "Before You Take a Trip to China to Find a Manufacturer...",
            "datePublished": "Tue, 24 Oct 2017 08:00:00 +0000",
            "length": "51115435",
            "sourceUrl": "https://feedpress.me/link/16512/13912123/15c649c7_tc.mp3",
            "epNo": "146"
        },
        {
            "title": "What You Need to Know About Patenting Your Product Idea",
            "datePublished": "Tue, 17 Oct 2017 08:00:00 +0000",
            "description": "<p>In this episode of Shopify Masters, you’ll learn from a Shark Tank entrepreneur that came up with, prototyped and patented a product all under the radar.</p>\n",
            "length": "42933052",
            "sourceUrl": "https://feedpress.me/link/16512/13912124/cd4cbeff_tc.mp3",
            "epNo": "145"
        },
        {
            "title": "Out-Innovating Billion Dollar Companies on a Shoestring Budget",
            "datePublished": "Tue, 10 Oct 2017 06:48:00 +0000",
            "description": "<p>In this episode of Shopify Masters, you’ll learn how an entrepreneur found the advantages that let him compete against billion dollar companies.</p>\n",
            "length": "44827231",
            "sourceUrl": "https://feedpress.me/link/16512/13912125/4f5f36a8_tc.mp3",
            "epNo": "144"
        },
        {
            "title": "From Dancers to Body Builders: How This Brand Pivoted Without Changing Its Product",
            "datePublished": "Tue, 3 Oct 2017 05:03:00 +0000",
            "description": "<p>In this episode of Shopify Masters, you’ll learn from an entrepreneur that evolved his store as he noticed other demographics latching onto his products and brand. And how he gracefully managed to change his marketing to pivot towards targeting new demographics.</p>\n",
            "length": "56427287",
            "sourceUrl": "https://feedpress.me/link/16512/13912126/0b717ecb_tc.mp3",
            "epNo": "143"
        },
        {
            "title": "Don’t Say What You’re Making, Say Why You’re Making It",
            "datePublished": "Tue, 26 Sep 2017 06:17:00 +0000",
            "description": "<p>In this episode you’ll learn from two entrepreneurs that rapidly prototyped their product and designed and re-designed it from the help of their community.</p>\n",
            "length": "42875380",
            "sourceUrl": "https://feedpress.me/link/16512/13912127/b321419e_tc.mp3",
            "epNo": "142"
        },
        {
            "title": "Don’t Waste Time On Business Cards (And Other Execution Tips)",
            "datePublished": "Tue, 19 Sep 2017 07:00:00 +0000",
            "description": "<p>In this episode of Shopify Masters, you’ll learn from Dan Demsky, an entrepreneur who knows how to execute. He’s launched 4 businesses in the last 10 years and teaches us how to go beyond the ideation phase and get in to the mode of doing.</p>\n",
            "length": "51337370",
            "sourceUrl": "https://feedpress.me/link/16512/13912128/be95d6b7_tc.mp3",
            "epNo": "141"
        },
        {
            "title": "Using Content Marketing to Become a Thought Leader In Your Industry",
            "datePublished": "Tue, 12 Sep 2017 07:00:00 +0000",
            "description": "<p>On today's episode, you’ll learn how one entrepreneur used content marketing to earn the trust of her industry.</p>\n",
            "length": "48496081",
            "sourceUrl": "https://feedpress.me/link/16512/13912129/5b03820c_tc.mp3",
            "epNo": "140"
        },
        {
            "title": "How to Find Viral Content for Your Brand's Facebook and Instagram Profiles",
            "datePublished": "Tue, 5 Sep 2017 10:30:00 +0000",
            "description": "<p>On today's episode, an entrepreneur shares her step-by-step process for finding and repurposing viral content for Facebook and Instagram.</p>\n<p>Topics we cover:</p>\n<ol>\n<li>How to re-purpose viral content for your brand.</li>\n<li>The most important metric to look for when measuring engagement.</li>\n<li>How to hire and train someone to run your social media.</li>\n</ol>\n",
            "length": "44363319",
            "sourceUrl": "https://feedpress.me/link/16512/13912130/3c6ce7c7_tc.mp3",
            "epNo": "139"
        },
        {
            "title": "The Importance of Packaging",
            "datePublished": "Tue, 29 Aug 2017 10:30:00 +0000",
            "description": "<p>On today's episode you'll hear how one entrepreneur invested heavily in her packaging's design. (And avoided making some of the most common mistakes!)</p>\n<p>Topics we cover:</p>\n<ol>\n<li>How to hire a designer to design your packaging.</li>\n<li>How to adapt your marketing if your customer base changes.</li>\n<li>How to get certified organic by the USDA.</li>\n</ol>\n",
            "length": "46640336",
            "sourceUrl": "https://feedpress.me/link/16512/13912131/94723791_tc.mp3",
            "epNo": "138"
        },
        {
            "title": "How NOT to Pitch to a Shark",
            "datePublished": "Tue, 22 Aug 2017 10:30:00 +0000",
            "description": "<p>On today's episode you’ll learn how a husband and wife team prepared to pitch to TV's Shark Tank.</p>\n<p>Topics we cover:</p>\n<ol>\n<li>How to perform market research at a trade show.</li>\n<li>How to identify which advice you should take and which you should ignore.</li>\n<li>Why you shouldn’t pretend to be bigger than you are.</li>\n</ol>\n",
            "length": "46235861",
            "sourceUrl": "https://feedpress.me/link/16512/13912132/76b8ea92_tc.mp3",
            "epNo": "137"
        },
        {
            "title": "Selling Digital Products: There’s More to It Than High Margins",
            "datePublished": "Tue, 15 Aug 2017 10:00:00 +0000",
            "description": "<p>On today's episode, you’ll learn how a service-based business transitioned from selling digital products to launching physical ones. (And all to the same market!)</p>\n<p>Topics we cover:</p>\n<ol>\n<li>Why launch a product when you have a service based business.</li>\n<li>The economics of running a digital product business.</li>\n<li>The pros and cons of selling digital products versus physical products.</li>\n</ol>\n",
            "length": "47159428",
            "sourceUrl": "https://feedpress.me/link/16512/13912133/0ac5c1b4_tc.mp3",
            "epNo": "136"
        },
        {
            "title": "What You Need to Know About Managing a Food-Based Supply Chain",
            "datePublished": "Tue, 8 Aug 2017 12:43:00 +0000",
            "description": "<p>On today's episode, you’ll learn how one entrepreneur wrangled multiple vendors and suppliers to run his perishable food-based supply chain on time.</p>\n<p>Topics we cover:</p>\n<ol>\n<li>How to prepare for delays in your supply chain.</li>\n<li>Why you should encourage comments rather than likes on Facebook.</li>\n<li>What you need to label your product as organic.</li>\n</ol>\n",
            "length": "39728145",
            "sourceUrl": "https://feedpress.me/link/16512/13912134/65c62457_tc.mp3",
            "epNo": "135"
        },
        {
            "title": "Coasting on Current Trends With Kick Push Skate",
            "datePublished": "Tue, 1 Aug 2017 00:57:00 +0000",
            "description": "<p>On today's episode you'll learn how one entrepreneur capitalized on current events.</p>\n<p>Topics we cover:</p>\n<ol>\n<li>The tools to identify a profitable niche.</li>\n<li>Why you should interview influencers.</li>\n<li>How to use your competitor's reviews to improve your product.</li>\n</ol>\n",
            "length": "43904395",
            "sourceUrl": "https://feedpress.me/link/16512/13912135/d1f8e634_tc.mp3",
            "epNo": "134"
        },
        {
            "title": "How to Sell a Solution to a Problem No One Wants to Talk About",
            "datePublished": "Tue, 25 Jul 2017 10:30:00 +0000",
            "description": "<p>On today's episode you’ll learn how the makers of the <a href=\"https://www.squattypotty.com/\">Squatty Potty</a> got creative when it came to marketing their product.</p>\n<p>Topics we cover:</p>\n<ol>\n<li>How to market a taboo product.</li>\n<li>What spending $25,000 on a Facebook video gets you.</li>\n<li>How much of your advertising budget should be devoted to testing.</li>\n</ol>\n",
            "length": "52056262",
            "sourceUrl": "https://feedpress.me/link/16512/13912136/2f2982fc_tc.mp3",
            "epNo": "133"
        },
        {
            "title": "How to Hire Employees 1 through 20 (According to Mizzen+Main)",
            "datePublished": "Tue, 18 Jul 2017 10:00:00 +0000",
            "description": "<p>On today's episode, you’ll learn how Mizzen+Main built a 20-person team without losing their company culture.</p>\n<p>Topics we cover:</p>\n<ol>\n<li>When to hire generalists versus when to hire specialists.</li>\n<li>Why you should hold all-hands meetings every day.</li>\n<li>How to make your debut by sponsoring a podcast.</li>\n</ol>\n",
            "length": "45703296",
            "sourceUrl": "https://feedpress.me/link/16512/13912137/a7015bd8_tc.mp3",
            "epNo": "132"
        },
        {
            "title": "How To Earn A Retailer's Trust So They Can Sell Your Product",
            "datePublished": "Mon, 10 Jul 2017 10:00:00 +0000",
            "description": "<p>On today's episode, you'll learn how one entrepreneur went from selling his product door-to-door to getting an impossible offer on TV's Shark Tank.</p>\n<p>Topics we cover:</p>\n<ol>\n<li>Why you should make your first prototype yourself.</li>\n<li>How to get retailers to to selling your product for the first time.</li>\n<li>What makes a successful trade show.</li>\n</ol>\n",
            "length": "51050246",
            "sourceUrl": "https://feedpress.me/link/16512/13912138/c07bae0e_tc.mp3",
            "epNo": "131"
        },
        {
            "title": "Why One Etsy Seller Started Her Own Store (And Controlled Her Brand)",
            "datePublished": "Tue, 4 Jul 2017 10:00:00 +0000",
            "description": "<p>On today's episode, an entrepreneur reveals why she went from selling on Etsy to opening up her own store.</p>\n<p>Topics we cover:</p>\n<ol>\n<li>How to attract wholesale clients through Etsy.</li>\n<li>How to make sure your differentiators stand out.</li>\n<li>How to hire temporary workers.</li>\n</ol>\n",
            "length": "45090152",
            "sourceUrl": "https://feedpress.me/link/16512/13912139/9e802b6f_tc.mp3",
            "epNo": "130"
        },
        {
            "title": "Why This Entrepreneur Launched... Without Their Flagship Product",
            "datePublished": "Tue, 27 Jun 2017 10:00:00 +0000",
            "description": "<p>On today's episode, you’ll learn why Taft Clothing held off launching their flagship product to market a smaller one first.</p>\n<p>Topics we cover:</p>\n<ol>\n<li>The downside of launching a smaller product before your flagship product.</li>\n<li>How to determine which differentiators matter to your core customers.</li>\n<li>Product photography tips for amateur photographers.</li>\n</ol>\n",
            "length": "53930407",
            "sourceUrl": "https://feedpress.me/link/16512/13912140/1c0a5d57_tc.mp3",
            "epNo": "129"
        },
        {
            "title": "Behind the Scenes of the Buzzfeed Channel: An Interview with Ben Kaufman",
            "datePublished": "Tue, 20 Jun 2017 13:19:00 +0000",
            "description": "<p>On a special episode of Shopify Masters we sit down with Ben Kaufman, the head of BuzzFeed's Product Lab, to understand the future of commerce.</p>\n",
            "length": "25639453",
            "sourceUrl": "https://feedpress.me/link/16512/13912141/e2c36b14_tc.mp3",
            "epNo": "128"
        },
        {
            "title": "How One Entrepreneur Got Her Cakes Into a 1,000 Grocery Stores",
            "datePublished": "Tue, 13 Jun 2017 10:00:00 +0000",
            "description": "<p>On today's episode, Funcakes's Kimberly Aya explains how she scaled her business by going <em>offline</em>.</p>\n<p>Topics we cover:</p>\n<ol>\n<li>How to grow a business without repeat customers.</li>\n<li>How to encourage customer reviews.</li>\n<li>How to get your product into a 1,000 grocery stores.</li>\n</ol>\n<p><a href=\"https://www.cakerental.com/\">FunCakes Rentals</a><br />\n<a href=\"https://www.facebook.com/CakeRental\">Facebook</a><br />\n<a href=\"https://twitter.com/FunCakesRental\">Twitter</a><br />\n<a href=\"https://www.instagram.com/funcakesrental/\">Instagram</a></p>\n",
            "length": "46441382",
            "sourceUrl": "https://feedpress.me/link/16512/13912142/00ca98bf_tc.mp3",
            "epNo": "127"
        },
        {
            "title": "Always Be Testing",
            "datePublished": "Tue, 6 Jun 2017 10:00:00 +0000",
            "description": "<p>On today's episode, <a href=\"https://www.koparibeauty.com/\">Kopari Beauty</a>'s Megan Bush shares why she A/B tests every aspect of her site. (And how she does it.)</p>\n<p>Topics we cover:</p>\n<ol>\n<li>How to take advantage of (and outlive) a trend.</li>\n<li>The advantages of buying ads in traditional media.</li>\n<li>How to test an ad by working backwards.</li>\n</ol>\n",
            "length": "54007695",
            "sourceUrl": "https://feedpress.me/link/16512/13912143/5e9c7c5f_tc.mp3",
            "epNo": "126"
        },
        {
            "title": "Why This Plant-Based Business Went After Low-Hanging Fruit",
            "datePublished": "Tue, 30 May 2017 10:00:00 +0000",
            "description": "<p>In this episode you’ll learn how Veestro's Monica and Mark Klausner use data to go after low-hanging fruit customers.</p>\n<p>Topics we cover:</p>\n<ol>\n<li>How to avoid becoming a me-too company.</li>\n<li>How 'personas' can improve your messaging and marketing.</li>\n<li>What it means to go after low-hanging fruit.</li>\n</ol>\n",
            "length": "49540687",
            "sourceUrl": "https://feedpress.me/link/16512/13912144/9ba078da_tc.mp3",
            "epNo": "125"
        },
        {
            "title": "Finding Partners to Help Grow Your Brand",
            "datePublished": "Tue, 23 May 2017 10:00:00 +0000",
            "description": "<p>On today's episode, Bartaile's Amina Belouizdad shares how her company identifies brands to partner with.</p>\n<p>Topics we cover:</p>\n<ol>\n<li>How to effectively work with multiple designers at the same time.</li>\n<li>What it means to fail early and fail cheaply.</li>\n<li>How to partner with a similarly-sized brand.</li>\n</ol>\n",
            "length": "52591231",
            "sourceUrl": "https://feedpress.me/link/16512/13912145/ca79c4ee_tc.mp3",
            "epNo": "124"
        },
        {
            "title": "Live from Shopify's Unite 2017 Conference",
            "datePublished": "Tue, 16 May 2017 10:00:00 +0000",
            "description": "<p>On a special takeover of Shopify Masters, we unpack the major Merchant-facing product announcements made at Unite 2017, Shopify's Partner &amp; Developer Conference. (Oh, and don't worry. Felix will return in a week!)</p>\n<p>Topics we cover:</p>\n<ol>\n<li>Shopify's new Chip &amp; Swipe Card Reader.</li>\n<li>Shopify Pay.</li>\n<li>The remarkable story of one of our Shopify Partners.</li>\n</ol>\n",
            "length": "21943432",
            "sourceUrl": "https://feedpress.me/link/16512/13912146/9637c75a_tc.mp3",
            "epNo": "123"
        },
        {
            "title": "How One Entrepreneur Grew Their Sales 8X Through Personable Facebook Ads",
            "datePublished": "Tue, 2 May 2017 10:00:00 +0000",
            "description": "<p>On today's episode, we learn how to move away from canned Facebook ads and towards more intimate and personable ads that resonate with your audience.</p>\n<p>Topics we cover:</p>\n<ol>\n<li>How to refine your Facebook ad copy.</li>\n<li>Why you should use Facebook ads to tell your personal story.</li>\n<li>How to grow your store’s subscription program.</li>\n</ol>\n",
            "length": "60545415",
            "sourceUrl": "https://feedpress.me/link/16512/13912147/041edbef_tc.mp3",
            "epNo": "122"
        },
        {
            "title": "How to License Properties From Anime and Video Game Makers",
            "datePublished": "Tue, 25 Apr 2017 10:00:00 +0000",
            "description": "<p>On today's episode, <a href=\"https://sanshee.com/\">Sanshee</a>'s Sarah Fetter shares how she negotiates merchandise deals with the hottest anime and video game properties.</p>\n<p>Topics we cover:</p>\n<ol>\n<li>The key terms of any licensing contract.</li>\n<li>Why shipping terms can trip up a licensing deal.</li>\n<li>Why and how to create key systems for your business.</li>\n</ol>\n",
            "length": "49420274",
            "sourceUrl": "https://feedpress.me/link/16512/13912148/d9c90b3c_tc.mp3",
            "epNo": "121"
        },
        {
            "title": "How to Drive Sales By Partnering With Existing Communities",
            "datePublished": "Tue, 18 Apr 2017 10:00:00 +0000",
            "description": "<p>On today's episode, you’ll learn why <a href=\"https://qalo.com/\">QALO</a>'s KC and Taylor Holiday joined several tight-knit communities to promote their products.</p>\n<p>Topics we cover:</p>\n<ol>\n<li>What it means to take a 'palms down approach.'</li>\n<li>Seeking affiliate partnerships with communities instead of individuals.</li>\n<li>Why you absolutely must over index on customer service when you're launching the dreaded MVP.</li>\n</ol>\n",
            "length": "44957717",
            "sourceUrl": "https://feedpress.me/link/16512/13912149/b2604a53_tc.mp3",
            "epNo": "120"
        },
        {
            "title": "How to Bounce Back When Your Kickstarter Campaign Fails",
            "datePublished": "Tue, 11 Apr 2017 10:00:00 +0000",
            "description": "<p>On today's episode, we learn how Sideclick's Jenn &amp; Brett Epstein relaunched their business after their Kickstarter campaign failed.</p>\n<p>Topics we cover:</p>\n<ol>\n<li>What happens when you <em>don’t</em> reach your funding goals.</li>\n<li>How to relaunch a Kickstarter campaign after failing the first time.</li>\n<li>The difference between working with reviewers vs. bloggers.</li>\n</ol>\n",
            "length": "56286962",
            "sourceUrl": "https://feedpress.me/link/16512/13912150/57598d3e_tc.mp3",
            "epNo": "119"
        },
        {
            "title": "Going Undercover to Understand Your Customers",
            "datePublished": "Tue, 4 Apr 2017 10:00:00 +0000",
            "description": "<p>On today's episode, we speak with an entrepreneur who gathers intelligence about his customer's shopping habits by secretly shopping at their favourite stores.</p>\n<p>Topics we cover:</p>\n<ol>\n<li>How to approach a buyer at a store.</li>\n<li>What you can learn by becoming a secret shopper.</li>\n<li>Why you should start as small as possible when selling to big box retailers.</li>\n</ol>\n",
            "length": "40939044",
            "sourceUrl": "https://feedpress.me/link/16512/13912151/072cabeb_tc.mp3",
            "epNo": "118"
        },
        {
            "title": "How to Build a Luxury Brand From Scratch",
            "datePublished": "Tue, 28 Mar 2017 10:00:00 +0000",
            "description": "<p><a href=\"https://www.linjer.co/\">Linjer</a> sells minimalist goods made using the finest natural materials. On today's episode, we speak with Linjer's Roman Khan and Jennifer Chong and learn how they built a luxury brand through crowdfunding.</p>\n<p>Topics we cover:</p>\n<ol>\n<li>How to earn the respect of large luxury brand manufacturers when you’re just starting out.</li>\n<li>How to let a quality control agency inspect your products for you.</li>\n<li>How to test your Kickstarter campaign before launching.</li>\n</ol>\n<p><a href=\"http://bit.ly/2o0ikKs\">Read a full transcript of the show here</a>.</p>\n",
            "length": "51664257",
            "sourceUrl": "https://feedpress.me/link/16512/13912152/cf97e26b_tc.mp3",
            "epNo": "117"
        },
        {
            "title": "Bringing an Existing Solution to a Market That Didn't Know About It (Yet)",
            "datePublished": "Thu, 23 Mar 2017 10:00:00 +0000",
            "description": "<p>oVertone keeps your fantasy hair looking bright. On today's episode, oVertone's Liora Dudar and Maegan Scarlett share how they solved a problem their customers never knew they had.</p>\n<p>Topics we cover:</p>\n<ol>\n<li>How to vet your vendors.</li>\n<li>How to figure out whether an employee is a good fit... in 30 days.</li>\n<li>What to do when your customers have no idea your solution even exists.</li>\n</ol>\n",
            "length": "55028436",
            "sourceUrl": "https://feedpress.me/link/16512/13912153/68e85c2c_tc.mp3",
            "epNo": "116"
        },
        {
            "title": "How to Speak to Your Fanbase",
            "datePublished": "Tue, 21 Mar 2017 10:00:00 +0000",
            "description": "<p><a href=\"https://www.uistencils.com/\">UI Stencils</a> sells tools for software developers. On today's episode you’ll learn how to speak to your fanbase to drive sales.</p>\n<p>Topics We Cover:</p>\n<ol>\n<li>What a dedicated audience can do for your brand</li>\n<li>How to cultivate your relationship with your tribe</li>\n</ol>\n",
            "length": "46739462",
            "sourceUrl": "https://feedpress.me/link/16512/13912154/6a8dea37_tc.mp3",
            "epNo": "115"
        },
        {
            "title": "Why Fit Matters More Than Form or Function",
            "datePublished": "Thu, 16 Mar 2017 10:00:00 +0000",
            "description": "<p><a href=\"https://www.orangemud.com/\">Orange Mud</a> sells specialized hydration packs for runners. On today's episode, Orange Mud's Josh Sprague shares how he designs a product for the perfect balance of form, function, and above all else, fit.</p>\n<p>Topics We Cover:</p>\n<ol>\n<li>How to iterate your product design.</li>\n<li>Why fit is more important than form or function.</li>\n<li>How to manage an ambassador team.</li>\n</ol>\n",
            "length": "49965307",
            "sourceUrl": "https://feedpress.me/link/16512/13912155/d30e3e7c_tc.mp3",
            "epNo": "114"
        },
        {
            "title": "A Viral Video Led to Over $200,000 in Sales, Here's How",
            "datePublished": "Tue, 14 Mar 2017 10:00:00 +0000",
            "description": "<p><a href=\"https://onekid.com/\">One Kid</a> sells fun, functional outerwear for kids. On today's episode, One Kid's Eric Autard and Sabine Beysel explain how their video went viral, got 5 million views, and led to $200,000 in sales.</p>\n<p>Topics We Cover:</p>\n<ol>\n<li>How to create ads to promote a product video.</li>\n<li>How to launch a product to customers that don’t know they need it.</li>\n<li>How to pick your battles when negotiating with big manufacturers.</li>\n</ol>\n",
            "length": "56145673",
            "sourceUrl": "https://feedpress.me/link/16512/13912156/773048d2_tc.mp3",
            "epNo": "113"
        },
        {
            "title": "How to Streamline Years of Content Marketing",
            "datePublished": "Thu, 9 Mar 2017 10:00:00 +0000",
            "description": "<p>On today's episode, <a href=\"http://sublimestitching.com/\">Sublime Stitching</a>'s Jenny Hart shares how she streamlined her content making workflow.</p>\n<p>Topics we cover:</p>\n<ol>\n<li>How to streamline your blog content.</li>\n<li>How to use Instagram to promote your content.</li>\n<li>What an artist should focus on when their passion becomes their business.</li>\n</ol>\n",
            "length": "57677978",
            "sourceUrl": "https://feedpress.me/link/16512/13912157/669ef6df_tc.mp3",
            "epNo": "112"
        },
        {
            "title": "Learning The Fine Art of... Flipping",
            "datePublished": "Tue, 7 Mar 2017 10:00:00 +0000",
            "description": "<p>On today's episode, <a href=\"https://empireflippers.com/\">Empire Flippers</a> cofounder Justin Cooke explains the nuances of flipping online businesses.</p>\n<p>Topics we cover:</p>\n<ol>\n<li>Buying a business through a third-party.</li>\n<li>How to prepare your business for sale.</li>\n<li>How to gauge the value of an online business.</li>\n</ol>\n",
            "length": "38873124",
            "sourceUrl": "https://feedpress.me/link/16512/13912158/427c7c69_tc.mp3",
            "epNo": "111"
        },
        {
            "title": "The ROI of Hiring a Creative Agency to Build Your Brand Identity",
            "datePublished": "Thu, 2 Mar 2017 10:00:00 +0000",
            "description": "<p><a href=\"https://maap.cc/\">Maap</a> sells premium cycling apparel designed in Melbourne, Australia. On today's episode, Maap's Oliver Cousins explains why he invested in their brand identity right from the start.</p>\n<p>Topics we cover:</p>\n<ol>\n<li>Why it’s critical to nail down your branding, early.</li>\n<li>How to work with a creative agency to figure out your brand identity.</li>\n<li>How to design a product that balances form <em>and</em> function.</li>\n</ol>\n",
            "length": "53211190",
            "sourceUrl": "https://feedpress.me/link/16512/13912159/52894925_tc.mp3",
            "epNo": "110"
        },
        {
            "title": "How to Court VC Funding to Scale Your Business",
            "datePublished": "Tue, 28 Feb 2017 10:00:00 +0000",
            "description": "<p><a href=\"https://order.dahmakan.com/\">Dah Makan</a> creates healthy gourmet lunches delivered straight to your office. On today's episode, Dah Makan's Jonathan Weins explains how they courted Angel and VC funding, and grew their startup to over 40 employees.</p>\n<p>Topics we cover:</p>\n<ol>\n<li>Using other entrepreneurs to reach out to investors.</li>\n<li>Which numbers are most important to VCs.</li>\n<li>Fundraising versus bootstrapping.</li>\n</ol>\n",
            "length": "52542069",
            "sourceUrl": "https://feedpress.me/link/16512/13912160/b38fc725_tc.mp3",
            "epNo": "109"
        },
        {
            "title": "Entering TV's Shark Tank (But Not For the Reasons You Think)",
            "datePublished": "Thu, 23 Feb 2017 11:00:00 +0000",
            "description": "<p>Deals! Sharks! Coozies! On today's episode, <a href=\"https://www.freakerusa.com/\">Freaker USA</a>'s Lauren Krakauskas explains why they went on ABC's <em>Shark Tank</em>, when a deal was the last thing on their minds.</p>\n<p>Topics we cover:</p>\n<ol>\n<li>What it's like to hire someone else to run your business.</li>\n<li>Introducing a $1 tier to a crowdfunding campaign.</li>\n<li>How to protect your brand my making your own... knock-offs.</li>\n</ol>\n",
            "length": "45939970",
            "sourceUrl": "https://feedpress.me/link/16512/13912161/805dedc6_tc.mp3",
            "epNo": "108"
        },
        {
            "title": "Building a Bigger Business",
            "datePublished": "Tue, 21 Feb 2017 11:00:00 +0000",
            "description": "<p>On a special episode of Shopify Masters, <a href=\"http://www.goldieblox.com/\">Goldie Blox</a>'s Debbie Sterling talks about winning Shopify’s 3rd <em>Build a Business</em> competition, and her role as a mentor in the upcoming <em>Build a Bigger Business</em>.</p>\n<p>Topics we cover:</p>\n<ol>\n<li>How to use networking to improve your Kickstarter campaign.</li>\n<li>How to create easily shareable assets for influencers.</li>\n<li>How to keep telling your story in new and exciting ways.</li>\n</ol>\n",
            "length": "35214271",
            "sourceUrl": "https://feedpress.me/link/16512/13912162/9499e371_tc.mp3",
            "epNo": "107"
        },
        {
            "title": "You Don't Have to Know it All to Make it Scale",
            "datePublished": "Thu, 16 Feb 2017 11:00:00 +0000",
            "description": "<p><a href=\"https://www.kisstixx.com/\">Kisstixx</a> sells a lip balm that adds a little chemistry to every kiss. On today’s episode, Kisstixx's Dallas Robinson explains how he used online ads to drive traffic to... <em>offline</em> retail stores. Plus, we debut a new format!</p>\n<p>Topics we cover:</p>\n<ol>\n<li>What makes a product scalable.</li>\n<li>How to successfully launch your product at a trade show.</li>\n<li>How to spend your first 30 days when developing a new product.</li>\n</ol>\n",
            "length": "47606395",
            "sourceUrl": "https://feedpress.me/link/16512/13912163/0409de26_tc.mp3",
            "epNo": "106"
        },
        {
            "title": "The Power of Crowds",
            "datePublished": "Tue, 14 Feb 2017 11:00:00 +0000",
            "description": "<p><a href=\"https://robo3d.com/\">Robo</a> wants to make 3D printing accessible to everyone. On today's episode, Robo's Braydon Moreno shares how he uses video ads to power a <em>$4.7 million business</em>.</p>\n<p>Topics we cover:</p>\n<ol>\n<li>How to run surveys using social media ads.</li>\n<li>How to use influencers to promote your crowdfunding campaign.</li>\n<li>How to create hyper-targeted ads on Facebook.</li>\n</ol>\n",
            "length": "55382938",
            "sourceUrl": "https://feedpress.me/link/16512/13912164/1fb566c1_tc.mp3",
            "epNo": "105"
        },
        {
            "title": "Finesse the Pug (Through Facebook Ads)",
            "datePublished": "Thu, 9 Feb 2017 11:00:00 +0000",
            "description": "<p>On today's episode, you’ll learn how <a href=\"https://www.thepassionatepug.com/\">The Passionate Pug</a>'s Kwaku Nornoo used Facebook to launch a six figure business.</p>\n<p>Topics we cover:</p>\n<ol>\n<li>How to measure a market's passion <em>before</em> you enter it.</li>\n<li>What to do when your Facebook ad has high engagement but no sales.</li>\n<li>Targeting tips to find passionate customers on Facebook.</li>\n</ol>\n",
            "length": "51874169",
            "sourceUrl": "https://feedpress.me/link/16512/13912165/e97c828d_tc.mp3",
            "epNo": "104"
        },
        {
            "title": "A Branding Dilemma",
            "datePublished": "Tue, 7 Feb 2017 11:00:00 +0000",
            "description": "<p><a href=\"https://www.worldwidecyclery.com/\">Worldwide Cyclery</a> wants to redefine what it means to be a bike shop. On today’s episode you’ll learn why Worldwide lists a handful of items on their site, when they actually sit on an inventory of <em>over 20,000 products</em>.</p>\n<p>Topics we cover:</p>\n<ol>\n<li>Why you might need a demo program to sell an expensive product.</li>\n<li>How to decide what to sell where, when you have multiple sales channels.</li>\n<li>How to go from learning to execution.</li>\n</ol>\n",
            "length": "59473526",
            "sourceUrl": "https://feedpress.me/link/16512/13912166/0b2e3a04_tc.mp3",
            "epNo": "103"
        },
        {
            "title": "When it Comes to Traffic, Less is S'More",
            "datePublished": "Wed, 1 Feb 2017 16:34:00 +0000",
            "description": "<p>Typically, the more traffic you get, the better, especially when you make delicious edible cookie dough. But <a href=\"http://www.edoughble.com/\">Edoughble</a> is not a cookie-cutter company. On today’s episode, Edoughble's John and Rana Lustyan share how they found success by focusing on <em>smaller</em> traffic.</p>\n<p>Topics we cover:</p>\n<ol>\n<li>How to approach people to survey them in person.</li>\n<li>How to figure out your branding and messaging.</li>\n<li>How to focus on more qualified traffic.</li>\n</ol>\n",
            "length": "54944107",
            "sourceUrl": "https://feedpress.me/link/16512/13912167/e6310351_tc.mp3",
            "epNo": "102"
        },
        {
            "title": "Walk Like an Animal (Lover), Talk Like an Animal (Lover)",
            "datePublished": "Mon, 30 Jan 2017 17:08:00 +0000",
            "description": "<p><a href=\"https://www.animal-jewelry.com/\">DoToly</a> makes affordable animal jewellery, gifts, and home decor. On today's episode DoToly's Cindy Chan,  shares how  success comes from speaking your customer’s language.</p>\n<p>Topics we cover:</p>\n<ol>\n<li>What it’s like to close down a physical store.</li>\n<li>How to increase your chances of success when selling on a<br />\nmarketplace.</li>\n<li>How to transition from selling on a marketplace to selling on your<br />\nown store.</li>\n</ol>\n",
            "length": "52543753",
            "sourceUrl": "https://feedpress.me/link/16512/13912168/42bc0844_tc.mp3",
            "epNo": "101"
        },
        {
            "title": "Paracable.com Drove 40,000 Visitors a Day Before Having Any Inventory",
            "datePublished": "Thu, 26 Jan 2017 08:00:00 +0000",
            "description": "<p>On today’s episode you’ll learn from an entrepreneur that drove 40,000 visitors a day before ever having a product in inventory.</p>\n<p>In this episode you'll learn:</p>\n<ol>\n<li>\n<p>How to know when you have the right timing for launching a product.</p>\n</li>\n<li>\n<p>How to determine if a PR agency will be a good fit for your business.</p>\n</li>\n<li>\n<p>How to turn angry customers into rabid fans.</p>\n</li>\n</ol>\n",
            "length": "55521288",
            "sourceUrl": "https://feedpress.me/link/16512/13912169/95d3e2f1_tc.mp3",
            "epNo": "100"
        },
        {
            "title": "TheFeelGoodLab.com’s Keys to Early Success on Amazon",
            "datePublished": "Tue, 24 Jan 2017 08:00:00 +0000",
            "description": "<p>In this episode you’ll learn from an entrepreneur that has figured out how to generate early success on Amazon.</p>\n<p>In this episode you'll learn:</p>\n<ol>\n<li>How to successfully crowdsource a logo on 99Designs.</li>\n</ol>\n<p>2. How to effectively communicate with a designer when you yourself aren’t a designer.</p>\n<p>3. The key Amazon SEO factors for increasing your product listing’s ranking.</p>\n",
            "length": "62433881",
            "sourceUrl": "https://feedpress.me/link/16512/13912170/b8619d6b_tc.mp3",
            "epNo": "99"
        },
        {
            "title": "Why TomboyX.com Tripled Revenue When They Focused On Just One Product Line",
            "datePublished": "Thu, 19 Jan 2017 08:00:00 +0000",
            "description": "<p>On this episode you’ll learn from an entrepreneur that tripled revenue when focusing on just one product line.</p>\n<p>In this episode you'll learn:</p>\n<ol>\n<li>How to determine the right mix between manufacturing versus private labeling.</li>\n</ol>\n<p>2. How to determine if a manufacturer can scale with you as you grow.</p>\n<p>3. Lessons learned from barely meeting a Kickstarter fundraising goal.</p>\n",
            "length": "46240097",
            "sourceUrl": "https://feedpress.me/link/16512/13912171/fee85294_tc.mp3",
            "epNo": "98"
        },
        {
            "title": "TheMemeBible.com Used Tumblr to Generate $200,000 in Sales in 3 Weeks",
            "datePublished": "Tue, 17 Jan 2017 08:00:00 +0000",
            "description": "<p>On today’s episode you’ll learn from an entrepreneur that launched a product on Tumblr that resulted in $200,000 of sales in just 3 weeks.</p>\n<p>In this episode you'll learn:</p>\n<ol>\n<li>The difference between working with influencers on Tumblr versus Instagram.</li>\n</ol>\n<p>2. Why you should keep your copy brief when running retargeting ads.</p>\n<ol start=\"3\">\n<li>How to come up with content marketing ideas around your product.</li>\n</ol>\n",
            "length": "47556658",
            "sourceUrl": "https://feedpress.me/link/16512/13912172/bab59299_tc.mp3",
            "epNo": "97"
        },
        {
            "title": "How to Launch a Successful Amazon Business in 2017 with Andrew Youderian",
            "datePublished": "Thu, 12 Jan 2017 08:00:00 +0000",
            "description": "<p>On today’s episode you’ll learn from a successful ecommerce entrepreneur that’s built and sold multiple ecommerce businesses and now works with hundreds of store owners.</p>\n<p>In this episode you'll learn:</p>\n<ol>\n<li>\n<p>What kind of products do well on Amazon.</p>\n</li>\n<li>\n<p>How to build a high converting product page on Amazon.</p>\n</li>\n<li>\n<p>How to use Amazon paid ads.</p>\n</li>\n</ol>\n",
            "length": "34207619",
            "sourceUrl": "https://feedpress.me/link/16512/13912173/9b6d7f79_tc.mp3",
            "epNo": "96"
        },
        {
            "title": "Successfully Launch Into Amazon Using Shopify’s Latest Integration",
            "datePublished": "Tue, 10 Jan 2017 08:00:00 +0000",
            "description": "<p>On today’s episode, you’ll hear from an internal Shopify employee on the latest Shopify integration into Amazon and how to take advantage of it.</p>\n<p>In this episode you'll learn:</p>\n<ol>\n<li>\n<p>The difference between being a reseller and a brand when selling on Amazon.</p>\n</li>\n<li>\n<p>How to kick off the sales machine on Amazon.</p>\n</li>\n<li>\n<p>How to improve your ranking on Amazon’s product listings.</p>\n</li>\n</ol>\n",
            "length": "57265008",
            "sourceUrl": "https://feedpress.me/link/16512/13912174/9d7f901f_tc.mp3",
            "epNo": "95"
        },
        {
            "title": "How DrainStrain.com Got Into 1200 Home Depots",
            "datePublished": "Thu, 5 Jan 2017 08:00:00 +0000",
            "description": "<p>On today’s podcast you’ll learn from an entrepreneur that sold his product into 1,200 Home Depots.</p>\n<p>In this episode you'll learn:</p>\n<ol>\n<li>\n<p>The criteria this entrepreneur uses to kill 100s of ideas.</p>\n</li>\n<li>\n<p>What makes a product attractive to a big box buyer.</p>\n</li>\n<li>\n<p>The difference between selling on Zulilly versus Amazon.</p>\n</li>\n</ol>\n",
            "length": "34492878",
            "sourceUrl": "https://feedpress.me/link/16512/13912175/9e708caf_tc.mp3",
            "epNo": "94"
        },
        {
            "title": "DistilUnion’s Lessons Learned from Launching Their $2 Million Business on Amazon",
            "datePublished": "Tue, 3 Jan 2017 08:00:00 +0000",
            "description": "<p>In this episode you’ll hear the lessons learned from an entrepreneur duo that launched a $2 million business on Amazon.</p>\n<p>In this episode you'll learn:</p>\n<ol>\n<li>\n<p>What goes into a feasibility analysis to determine if a product will be profitable or not.</p>\n</li>\n<li>\n<p>What to focus on to make your listing more discoverable and sell more on Amazon.</p>\n</li>\n<li>\n<p>How to identify which marketing channels you should focus on.</p>\n</li>\n</ol>\n",
            "length": "54076007",
            "sourceUrl": "https://feedpress.me/link/16512/13912176/6abfee36_tc.mp3",
            "epNo": "93"
        },
        {
            "title": "Why CoralaCashmere.com Started Promoting to Local Print Media",
            "datePublished": "Thu, 29 Dec 2016 08:00:00 +0000",
            "description": "<p>On today’s episode you’ll learn from a husband and wife entrepreneur team that started promoting through business through local print media.</p>\n<p>In this episode you'll learn:</p>\n<ol>\n<li>\n<p>How to get factories to invest in you when you are just a small time client.</p>\n</li>\n<li>\n<p>How to make sure that you have a strong foundation with your business partner.</p>\n</li>\n<li>\n<p>How to cater your pitch to specific media outlets.</p>\n</li>\n</ol>\n",
            "length": "49749254",
            "sourceUrl": "https://feedpress.me/link/16512/13912177/b60e2826_tc.mp3",
            "epNo": "92"
        },
        {
            "title": "BlendersEyewear.com Used Insta Meets to Grow Their $2 Million Business",
            "datePublished": "Tue, 27 Dec 2016 08:00:00 +0000",
            "description": "<p>In this episode you’ll learn from an entrepreneur that built a $2 million dollar business by working with influencers he met through in-person Instagram meetups.</p>\n<p>In this episode you'll learn:</p>\n<ol>\n<li>\n<p>How to network with photographers to get great photos of your products for free.</p>\n</li>\n<li>\n<p>What are Insta Meets and how can you find an influencer through an Insta Meet.</p>\n</li>\n<li>\n<p>How to collaborate with other brands to raise your own brand’s credibility.</p>\n</li>\n</ol>\n",
            "length": "51571158",
            "sourceUrl": "https://feedpress.me/link/16512/13912178/8159e462_tc.mp3",
            "epNo": "91"
        },
        {
            "title": "SnowboardAddiction.com Built a $1 Million Business By Creating and Boosting Facebook Videos",
            "datePublished": "Thu, 22 Dec 2016 08:00:00 +0000",
            "description": "<p>On today’s podcast you’ll learn from an entrepreneur that built a $1 million business by creating and promoting videos on YouTube and Facebook.</p>\n<p>In this episode you'll learn:</p>\n<ol>\n<li>\n<p>How to drive customers from your videos to your email list.</p>\n</li>\n<li>\n<p>Why negative comments on YouTube videos can be a good thing.</p>\n</li>\n<li>\n<p>How to decide what content you should give away for free and what you should be charging for.</p>\n</li>\n</ol>\n",
            "length": "42619350",
            "sourceUrl": "https://feedpress.me/link/16512/13912179/8e5be8d9_tc.mp3",
            "epNo": "90"
        },
        {
            "title": "StartupDrugz.com Launched a Million Dollar Business Starting with ProductHunt.com",
            "datePublished": "Tue, 20 Dec 2016 08:00:00 +0000",
            "description": "<p>On today’s podcast you’ll learn about an entrepreneur that launched a million dollar t-shirt business starting with ProductHunt.</p>\n<p>In this episode you'll learn:</p>\n<ol>\n<li>\n<p>How to know if there’s room in the market for your t-shirt brand.</p>\n</li>\n<li>\n<p>The traffic and sales impact of being highly ranked on ProductHunt.</p>\n</li>\n<li>\n<p>How to warm up cold Facebook Ad traffic.</p>\n</li>\n</ol>\n",
            "length": "57413832",
            "sourceUrl": "https://feedpress.me/link/16512/13912180/81f988d9_tc.mp3",
            "epNo": "89"
        },
        {
            "title": "10 Years of Consistency to Build SunnysHair.com Into a Sustainable 6 Figure Business",
            "datePublished": "Thu, 15 Dec 2016 08:00:00 +0000",
            "description": "<p>On today’s podcast you’ll learn from an entrepreneur that believes to be successful you must only focus on what you can do consistently.</p>\n<p>In this episode you'll learn:</p>\n<ol>\n<li>\n<p>The benefits of having a brick and mortar presence.</p>\n</li>\n<li>\n<p>Why you have to have the perception that you have everything in stock when owning a physical store and how it’s different when you’re running an online store.</p>\n</li>\n<li>\n<p>How to grow an email list by running and promoting giveaways.</p>\n</li>\n</ol>\n",
            "length": "61969175",
            "sourceUrl": "https://feedpress.me/link/16512/13912181/18a409f6_tc.mp3",
            "epNo": "88"
        },
        {
            "title": "How StretchEventTents.com Uses a Rotation Program To Innovate The Company",
            "datePublished": "Tue, 13 Dec 2016 08:00:00 +0000",
            "description": "<p>On today’s episode you’ll learn from an entrepreneur that breaths new life into his company by doing 3 month rotations with his employees.</p>\n<p>In this episode you'll learn:</p>\n<ol>\n<li>\n<p>Why you should create a shopping cart for your customers over the phone.</p>\n</li>\n<li>\n<p>What is the most important contribution you can give to your sales team.</p>\n</li>\n<li>\n<p>Why you should pay more attention to industries outside of your own.</p>\n</li>\n</ol>\n",
            "length": "59178021",
            "sourceUrl": "https://feedpress.me/link/16512/13912182/b8a163a0_tc.mp3",
            "epNo": "87"
        },
        {
            "title": "Why ZootilityTools.com Launched a Kickstarter Just to Break Even",
            "datePublished": "Thu, 8 Dec 2016 08:00:00 +0000",
            "description": "<p>On today’s episode you’ll learn why an entrepreneur chose to launch on Kickstarter just to break even.</p>\n<p>In this episode you'll learn:</p>\n<ol>\n<li>\n<p>What makes one product more likely to succeed than others.</p>\n</li>\n<li>\n<p>The rule of thumb for pricing for retail.</p>\n</li>\n<li>\n<p>How to create packaging appropriate for retailers.</p>\n</li>\n</ol>\n",
            "length": "49679881",
            "sourceUrl": "https://feedpress.me/link/16512/13912183/b453daea_tc.mp3",
            "epNo": "86"
        },
        {
            "title": "How TheBeardKing.com Generates 7 Figures in Sales Using Video Content",
            "datePublished": "Tue, 6 Dec 2016 08:00:00 +0000",
            "description": "<p>On today’s episode you’ll learn from two entrepreneurs that created a 7 figure business using video content.</p>\n<p>In this episode you'll learn:</p>\n<ol>\n<li>\n<p>Why you should first solve a problem and then build a brand around the problem.</p>\n</li>\n<li>\n<p>How to plan a content calendar for video content.</p>\n</li>\n<li>\n<p>Why you need to be on Amazon to combat copycats.</p>\n</li>\n</ol>\n",
            "length": "63291568",
            "sourceUrl": "https://feedpress.me/link/16512/13912184/946ba7e5_tc.mp3",
            "epNo": "85"
        },
        {
            "title": "How CWPencils.com Makes a Profit Selling Pencils Online",
            "datePublished": "Thu, 1 Dec 2016 08:00:00 +0000",
            "description": "<p>On this episode you’ll learn from an entrepreneur that’s created a profitable business selling pencils online.</p>\n<p>In this episode you'll learn:</p>\n<ol>\n<li>\n<p>How to do market research when there’s not much data available.</p>\n</li>\n<li>\n<p>Why you should sell stories instead of products and how to sell stories.</p>\n</li>\n<li>\n<p>Why you might not want to carry all the products from a single brand.</p>\n</li>\n</ol>\n",
            "length": "45802873",
            "sourceUrl": "https://feedpress.me/link/16512/13912185/168ab4d6_tc.mp3",
            "epNo": "84"
        },
        {
            "title": "Launching a $2 Million Business By Syndicating Epic Content",
            "datePublished": "Tue, 29 Nov 2016 08:00:00 +0000",
            "description": "<p>On today’s podcast you’ll learn from two entrepreneurs that launched a $2 million business with the help of syndicating epic content.</p>\n<p>In this episode you'll learn:</p>\n<ol>\n<li>\n<p>What to look for when you’re coming up with profitable business ideas.</p>\n</li>\n<li>\n<p>Why you should focus on making money first and then on your passion projects.</p>\n</li>\n<li>\n<p>What’s involved in an ecommerce business sale.</p>\n</li>\n</ol>\n",
            "length": "58833177",
            "sourceUrl": "https://feedpress.me/link/16512/13912186/e4df677e_tc.mp3",
            "epNo": "83"
        },
        {
            "title": "OriginalGrain.com’s First Time Entrepreneurs Launched a $15 Million Watch Company",
            "datePublished": "Thu, 24 Nov 2016 08:00:00 +0000",
            "description": "<p>On this episode two first time entrepreneurs join us to talk about how they started a $15 million watch company with one founder in China.</p>\n<p>In this episode you'll learn:</p>\n<ol>\n<li>\n<p>Why one of the founders moved to China to start a business.</p>\n</li>\n<li>\n<p>Why you should launch on Kickstarter even if you already have a completed product.</p>\n</li>\n<li>\n<p>How to price your products correctly.</p>\n</li>\n</ol>\n",
            "length": "56602991",
            "sourceUrl": "https://feedpress.me/link/16512/13912187/69bb60a6_tc.mp3",
            "epNo": "82"
        },
        {
            "title": "Beardo.com’s List of Criteria to Create Giftable Products During The Holiday Shopping Season",
            "datePublished": "Tue, 22 Nov 2016 08:00:00 +0000",
            "description": "<p>On today’s episode, you’ll learn an entrepreneur’s list of criteria to create a giftable product during the holiday shopping season.</p>\n<p>In this episode you'll learn:</p>\n<ol>\n<li>\n<p>How to promote your product through college and university newsletters.</p>\n</li>\n<li>\n<p>How to personalize just enough when pitching to publications.</p>\n</li>\n<li>\n<p>The process for selling your product as a promotional product.</p>\n</li>\n</ol>\n",
            "length": "53087140",
            "sourceUrl": "https://feedpress.me/link/16512/13912188/ed207c0a_tc.mp3",
            "epNo": "81"
        },
        {
            "title": "Black Friday and Cyber Monday Lessons Learned From a $40 Million Makeup Business",
            "datePublished": "Thu, 17 Nov 2016 08:00:00 +0000",
            "description": "<p>On today’s podcast you’ll learn from the Director of Technology at a $40 million Shopify business on how they’re preparing for Black Friday and Cyber Monday.</p>\n<p>In this episode you'll learn:</p>\n<ol>\n<li>\n<p>What it’s like to run 20 Shopify installations.</p>\n</li>\n<li>\n<p>What it means to think about your operations as its own product.</p>\n</li>\n<li>\n<p>How to manage a successful partnership with outsourced digital marketers.</p>\n</li>\n</ol>\n",
            "length": "50214901",
            "sourceUrl": "https://feedpress.me/link/16512/13912189/3e0af61b_tc.mp3",
            "epNo": "80"
        },
        {
            "title": "Building a Personal Brand and Business Brand With BikiniLuxe.com",
            "datePublished": "Tue, 15 Nov 2016 08:00:00 +0000",
            "description": "<p>On today’s podcast you’ll learn from an entrepreneur that’s building a personal brand and a business brand at the same time.</p>\n<p>In this episode you'll learn:</p>\n<ol>\n<li>\n<p>How to outsource your content marketing.</p>\n</li>\n<li>\n<p>The difference between managing a team of interns versus a team of employees.</p>\n</li>\n<li>\n<p>How to use Polyvore to drive traffic and sales.</p>\n</li>\n</ol>\n",
            "length": "50555087",
            "sourceUrl": "https://feedpress.me/link/16512/13912190/887bfcfb_tc.mp3",
            "epNo": "79"
        },
        {
            "title": "How the Founder of TarDisk.com Turned Around a Quickly Decline Business",
            "datePublished": "Thu, 10 Nov 2016 08:00:00 +0000",
            "description": "<p>In this episode you’ll learn from an entrepreneur that made $200,000 in 6 months to pay for graduate school, then hired a CEO to run his business and ended up having to come back to save his business.</p>\n<p>In this episode you'll learn:</p>\n<ol>\n<li>\n<p>How to get the most out of an MBA program and how to run a business while pursuing an MBA.</p>\n</li>\n<li>\n<p>How to run a hyper-targeted and successful YouTube advertising campaign.</p>\n</li>\n<li>\n<p>The pros and cons of paying employees through equity versus commission.</p>\n</li>\n</ol>\n",
            "length": "53992816",
            "sourceUrl": "https://feedpress.me/link/16512/13912191/61e53cf7_tc.mp3",
            "epNo": "78"
        },
        {
            "title": "Why Less Is More For VraiAndOro.com’s $2 Million Business",
            "datePublished": "Tue, 8 Nov 2016 08:00:00 +0000",
            "description": "<p>In this episode you’ll learn from an entrepreneur that believes that removing products from your store can lead to more sales.</p>\n<p>In this episode you'll learn:</p>\n<ol>\n<li>\n<p>What is brand identity and how to develop your company’s brand identity.</p>\n</li>\n<li>\n<p>Why it’s important and how you can create a story to successfully launch new products.</p>\n</li>\n<li>\n<p>When to use Instagram stories.</p>\n</li>\n</ol>\n",
            "length": "46380497",
            "sourceUrl": "https://feedpress.me/link/16512/13912192/acc985ad_tc.mp3",
            "epNo": "77"
        },
        {
            "title": "How StitchLeggings.com Created Customer Avatars to Sell Thousands of Leggings to Men",
            "datePublished": "Thu, 3 Nov 2016 07:00:00 +0000",
            "description": "<p>In this episode you’ll learn from an entrepreneur that creates customer avatars for all of his marketing.</p>\n<p>In this episode you'll learn:</p>\n<ol>\n<li>\n<p>What kind of questions you should ask your customers to learn more about your market.</p>\n</li>\n<li>\n<p>How to develop your customer avatar.</p>\n</li>\n<li>\n<p>How to encourage and rewards influencers to drive more sales.</p>\n</li>\n</ol>\n",
            "length": "51969083",
            "sourceUrl": "https://feedpress.me/link/16512/13912193/25c851b2_tc.mp3",
            "epNo": "76"
        },
        {
            "title": "The Power of Video To Educate Customers on Inkbox.com’s Innovative Tattoos",
            "datePublished": "Tue, 1 Nov 2016 07:00:00 +0000",
            "description": "<p>In this episode you’ll learn from an entrepreneur that uses the power of video to educate their customers.</p>\n<p>In this episode you'll learn:</p>\n<ol>\n<li>\n<p>Why it’s OK to do things that aren’t scalable at first.</p>\n</li>\n<li>\n<p>Why you need video for a unique product.</p>\n</li>\n<li>\n<p>Why success on Kickstarter can be a double-edged sword.</p>\n</li>\n</ol>\n",
            "length": "38183098",
            "sourceUrl": "https://feedpress.me/link/16512/13912194/7b6b6365_tc.mp3",
            "epNo": "75"
        },
        {
            "title": "GetNadeef.com’s $100K Business From Calling Cart Abandoners",
            "datePublished": "Thu, 27 Oct 2016 07:00:00 +0000",
            "description": "<p>In this episode, you’ll learn from an entrepreneur that’s built a $100,000 business from picking up the phone and calling cart abandoners.</p>\n<p>In this episode you'll learn:</p>\n<ol>\n<li>\n<p>How to use Facebook ads to validate if there are any “signs of life” for your market.</p>\n</li>\n<li>\n<p>How to use question-based selling.</p>\n</li>\n<li>\n<p>What you should say when you are calling cart abandoners.</p>\n</li>\n</ol>\n",
            "length": "53986940",
            "sourceUrl": "https://feedpress.me/link/16512/13912195/364e12ba_tc.mp3",
            "epNo": "74"
        },
        {
            "title": "The Chillest 7 Figure Business Owner",
            "datePublished": "Tue, 25 Oct 2016 07:00:00 +0000",
            "description": "<p>In this episode you’ll hear from one of the chillest 7 figure business owners that’s built a business where he doesn’t even work every day.</p>\n<p>In this episode you'll learn:</p>\n<ol>\n<li>\n<p>Why your business becomes less flexible when you increase your product catalog.</p>\n</li>\n<li>\n<p>How getting creative with themed promo codes helps drive sales.</p>\n</li>\n</ol>\n<p>3. How to attract customers to buy directly from you instead of another marketplace by offering bundle deals.</p>\n",
            "length": "51577777",
            "sourceUrl": "https://feedpress.me/link/16512/13912196/b7fce94d_tc.mp3",
            "epNo": "73"
        },
        {
            "title": "BarbellApparel.com Bootstrapped to Sell 40,000 Pairs of Pants",
            "datePublished": "Thu, 20 Oct 2016 07:00:00 +0000",
            "description": "<p>In this episode you’ll learn how an entrepreneur completely bootstrapped a business that has now sold 40,000 pairs of pants.</p>\n<p>In this episode you'll learn:</p>\n<ol>\n<li>\n<p>Why you should manufacture locally first and then outsource overseas.</p>\n</li>\n<li>\n<p>The foundations companies should build when you’re just starting out.</p>\n</li>\n<li>\n<p>How to keep in contact with your customers after your Kickstarter campaign ends.</p>\n</li>\n</ol>\n",
            "length": "53553938",
            "sourceUrl": "https://feedpress.me/link/16512/13912197/6ae6ce70_tc.mp3",
            "epNo": "72"
        },
        {
            "title": "How Rhone.com Launched to $80K in Sales With a Manually-Built Mailing List",
            "datePublished": "Tue, 18 Oct 2016 07:00:00 +0000",
            "description": "<p>In this episode you’ll learn how an entrepreneur built a mailing list manually and launched to $80,000 in sales.</p>\n<p>In this episode you'll learn:</p>\n<ol>\n<li>\n<p>How to identify if an idea can actually be a profitable business.</p>\n</li>\n<li>\n<p>Why you don’t need to create a completely innovative idea, but just make an existing one marginally better.</p>\n</li>\n<li>\n<p>How to get into an industry that you know nothing about.</p>\n</li>\n</ol>\n",
            "length": "56962004",
            "sourceUrl": "https://feedpress.me/link/16512/13912198/d9644c2a_tc.mp3",
            "epNo": "71"
        },
        {
            "title": "How ThinkCrucial.com Manages an 8 Figure Ecommerce Business on Multiple Platforms",
            "datePublished": "Thu, 13 Oct 2016 07:00:00 +0000",
            "description": "<p>In this episode you’ll learn from an entrepreneur that’s built an 8 figure business and manages selling on multiple platforms with a small team.</p>\n<p>In this episode you'll learn:</p>\n<ol>\n<li>\n<p>Why choosing a manufacturer is not just about who can give you the lowest price.</p>\n</li>\n<li>\n<p>How to find people to hire for a business so that you can step away from the business.</p>\n</li>\n<li>\n<p>How to write product descriptions differently depending on the marketplace you’re selling in.</p>\n</li>\n</ol>\n",
            "length": "45575138",
            "sourceUrl": "https://feedpress.me/link/16512/13912199/efa40809_tc.mp3",
            "epNo": "70"
        },
        {
            "title": "Talking to Customers One-on-One Helped Carbon6Rings.com Build a $1.7 Million Business",
            "datePublished": "Tue, 11 Oct 2016 07:00:00 +0000",
            "description": "<p>In this episode, you’ll learn from a Shopify Build-a-Business winner that believes that talking to customers one-on-one helped them build a $1.7 million business.</p>\n<p>In this episode you'll learn:</p>\n<ol>\n<li>\n<p>How to get feedback from products you give away for free.</p>\n</li>\n<li>\n<p>How to look out for predatory vendors when you’re just starting up.</p>\n</li>\n<li>\n<p>What makes a high converting Kickstarter video.</p>\n</li>\n</ol>\n",
            "length": "57489072",
            "sourceUrl": "https://feedpress.me/link/16512/13912200/5db94d1a_tc.mp3",
            "epNo": "69"
        },
        {
            "title": "Starting a Digital Nomad Business Traveling From Medellin to Austin to Chiang Mai",
            "datePublished": "Thu, 6 Oct 2016 07:00:00 +0000",
            "description": "<p>In this episode, you’ll learn from an entrepreneur that started a business as a digital nomad in Chiang Mai Thailand.</p>\n<p>In this episode you'll learn:</p>\n<ol>\n<li>\n<p>What kind of questions to ask to get the right feedback when testing a product.</p>\n</li>\n<li>\n<p>How to stand out when reaching out to influencers with your product.</p>\n</li>\n<li>\n<p>Why it’s better to launch all your marketing at once rather than over several weeks.</p>\n</li>\n</ol>\n",
            "length": "55515043",
            "sourceUrl": "https://feedpress.me/link/16512/13912201/386dff65_tc.mp3",
            "epNo": "68"
        },
        {
            "title": "KharaKapas.com Started a $1,500/Day Business Even Though She Doesn’t Like Taking Risks",
            "datePublished": "Tue, 4 Oct 2016 16:00:00 +0000",
            "description": "<p>In this episode, you’ll learn from an entrepreneur that stated a $1,500 per day business ever though she doesn’t like taking risks.</p>\n<p>In this episode you'll learn:</p>\n<ol>\n<li>\n<p>How to break through self doubt in entrepreneurship.</p>\n</li>\n<li>\n<p>How to start a business when you don’t like taking big risks.</p>\n</li>\n<li>\n<p>Why it might not be a good idea to collaborate with other brands.</p>\n</li>\n</ol>\n",
            "length": "53456604",
            "sourceUrl": "https://feedpress.me/link/16512/13912202/5eb02e45_tc.mp3",
            "epNo": "67"
        },
        {
            "title": "How HappilyEverBorrowed.com Uses Style Quizzes to Convert Customers",
            "datePublished": "Thu, 29 Sep 2016 07:00:00 +0000",
            "description": "<p>In this episode, you’ll learn from an entrepreneur that uses style quizzes to convert customers and collect highly useful customer data.</p>\n<p>In this episode you'll learn:</p>\n<ol>\n<li>\n<p>How to start a rental business.</p>\n</li>\n<li>\n<p>How to create a quiz to convert customers.</p>\n</li>\n</ol>\n<p>3. How to find and work with high quality interns.</p>\n",
            "length": "50016762",
            "sourceUrl": "https://feedpress.me/link/16512/13912203/f3a25465_tc.mp3",
            "epNo": "66"
        },
        {
            "title": "InkwellPress.com Promotes Lead Magnets Using Facebook to Build a 7 Figure Business",
            "datePublished": "Tue, 27 Sep 2016 07:00:00 +0000",
            "description": "<p>In this episode, I talk to an entrepreneur that uses lead magnets to build a 7 figure business.</p>\n<p>In this episode you'll learn:</p>\n<p>1. How to turn your passion into a business.</p>\n<p>2. How and why you should work backwards when working towards a goal.</p>\n<p>3. How to know what kind of lead magnets to create and how to promote them using Facebook.</p>\n",
            "length": "53696923",
            "sourceUrl": "https://feedpress.me/link/16512/13912204/7a2acd90_tc.mp3",
            "epNo": "65"
        },
        {
            "title": "Minaal.com Started a Digital Nomad Business",
            "datePublished": "Thu, 22 Sep 2016 07:00:00 +0000",
            "description": "<p>In this episode, I talk to an entrepreneur that started a completely digital nomad business.</p>\n<p>In this episode you'll learn:</p>\n<ol>\n<li>\n<p>How they invested $100,000 creating their product.</p>\n</li>\n<li>\n<p>How to overcome the challenges of starting a business while traveling.</p>\n</li>\n<li>\n<p>What kind of prep you need to do before launching your first Kickstarter campaign.</p>\n</li>\n</ol>\n",
            "length": "55336916",
            "sourceUrl": "https://feedpress.me/link/16512/13912205/4838c4dc_tc.mp3",
            "epNo": "64"
        },
        {
            "title": "Why QwerkyWriter.com Focused On Early Adopters First",
            "datePublished": "Tue, 20 Sep 2016 07:00:00 +0000",
            "description": "<p>In this episode you’ll learn from an entrepreneur that focused on winning over early adopters than the entire market in order to successfully launch his product.</p>\n<p>In this episode you'll learn:</p>\n<ol>\n<li>\n<p>How to manage all the feedback you’ll get when running a Kickstarter campaign.</p>\n</li>\n<li>\n<p>Why you want to go after the hardcore early adopter demographic first before promoting your product.</p>\n</li>\n<li>\n<p>What should you do if you encounter copycats.</p>\n</li>\n</ol>\n",
            "length": "60037303",
            "sourceUrl": "https://feedpress.me/link/16512/13912206/dce81513_tc.mp3",
            "epNo": "63"
        },
        {
            "title": "From Broken Watches to a $1 Million Custom Watch Business",
            "datePublished": "Thu, 15 Sep 2016 07:00:00 +0000",
            "description": "<p>In today’s episode you’ll learn from an entrepreneur that launched a business following the lean startup methodology.</p>\n<p>In this episode you'll learn:</p>\n<ol>\n<li>What it’s like to scrap an entire business to start a new one.</li>\n</ol>\n<p>2. What is the lean startup methodology and how to use it to quickly launch a business or product line.</p>\n<p>3. What are key tests every ecommerce site should run.</p>\n",
            "length": "59923210",
            "sourceUrl": "https://feedpress.me/link/16512/13912207/fd384193_tc.mp3",
            "epNo": "62"
        },
        {
            "title": "Working with “Micro Influencers” Helped Thuggies.com Build a Half Million Dollar Business",
            "datePublished": "Tue, 13 Sep 2016 07:00:00 +0000",
            "description": "<p>In this episode you’ll learn from an entrepreneur that believes the key to success is to work with micro influencers rather than celebrity influencers.</p>\n<p>In this episode you'll learn:</p>\n<ol>\n<li>How to validate a product that no one has ever seen before.</li>\n</ol>\n<p>2. Why you should force customers to buy from you online even if you meet them offline.</p>\n<p>3. What are micro influencers, how to find them and how to work with them to promote your business.</p>\n",
            "length": "60031526",
            "sourceUrl": "https://feedpress.me/link/16512/13912208/fc237571_tc.mp3",
            "epNo": "61"
        },
        {
            "title": "CampusProtein.com Powers Their Multi Million Dollar Business With a Nationwide Rep Program",
            "datePublished": "Thu, 8 Sep 2016 07:00:00 +0000",
            "description": "<p>In this episode you’ll learn from an entrepreneur that built out a nationwide rep program that’s helped them build a multi million dollar business.</p>\n<p>In this episode you'll learn:</p>\n<ol>\n<li>How to build, manage and motivate a nationwide rep program.</li>\n</ol>\n<p>2. What kind of guidance to give your first salesperson.</p>\n<p>3. How to identify the areas of your business that will have the biggest impact on your growth.</p>\n",
            "length": "47160475",
            "sourceUrl": "https://feedpress.me/link/16512/13912209/aee1ca00_tc.mp3",
            "epNo": "60"
        },
        {
            "title": "How Running FB Ads to a Kickstarter Campaign Led to $800K In Funding",
            "datePublished": "Tue, 6 Sep 2016 07:00:00 +0000",
            "description": "<p>In this episode you’ll learn how an entrepreneur used Facebook ads to promote a Kickstarter campaign that raised $800,000.</p>\n<p>In this episode you'll learn:</p>\n<ol>\n<li>What is rapid prototyping and how to use it to design your products.</li>\n</ol>\n<p>2. How to make sure you’re ONLY focused on solving your customer’s main problem.</p>\n<p>3. When do you know when your prototype is ready to bring to the market.</p>\n",
            "length": "50059814",
            "sourceUrl": "https://feedpress.me/link/16512/13912210/dea11fad_tc.mp3",
            "epNo": "59"
        },
        {
            "title": "CraftAndMason.com Turned a Hobby Into a Business That’s Doubled In Growth Every Year",
            "datePublished": "Thu, 1 Sep 2016 07:00:00 +0000",
            "description": "<p>In this episode you’ll learn from an entrepreneur that turned his hobby into a business that’s doubled in growth every year.</p>\n<p>In this episode you'll learn:</p>\n<ol>\n<li>How to find out if your hobby is worth turning into a business.</li>\n</ol>\n<p>2. How to stay disciplined in your business spending.</p>\n<p>3. How to make sure you’re not burning yourself out from running a business with a day job.</p>\n",
            "length": "52514520",
            "sourceUrl": "https://feedpress.me/link/16512/13912211/61203f98_tc.mp3",
            "epNo": "58"
        },
        {
            "title": "Hickies.com Set up Their Business To Scale To 50 Countries",
            "datePublished": "Tue, 30 Aug 2016 07:00:00 +0000",
            "description": "<p>In this episode you’ll learn from an entrepreneur that set up his business so that it could quickly scale to 50 countries.</p>\n<p>In this episode you'll learn:</p>\n<ol>\n<li>How to plan out a massive project when you don’t have the time.</li>\n</ol>\n<p>2. How they were able to secure 70 patents for their business.</p>\n<ol start=\"3\">\n<li>What logistics to set up when you’re entering a new geography or market.</li>\n</ol>\n",
            "length": "46948923",
            "sourceUrl": "https://feedpress.me/link/16512/13912212/cac18a0e_tc.mp3",
            "epNo": "57"
        },
        {
            "title": "Why CoquetteCouture.com Needed To Open a Physical Store",
            "datePublished": "Thu, 25 Aug 2016 07:00:00 +0000",
            "description": "<p>In this episode, you’ll hear from an entrepreneur that went from ecommerce to opening a physical store.</p>\n<p>In this episode you'll learn:</p>\n<ol>\n<li>How to sell face to face when you’re not used to it.</li>\n</ol>\n<p>2. What to do if you’re selling products that you’re not passionate about but your customers are.</p>\n<p>3. What’s involved in the buying process when running a retail store.</p>\n",
            "length": "59694165",
            "sourceUrl": "https://feedpress.me/link/16512/13912213/294b1db6_tc.mp3",
            "epNo": "56"
        },
        {
            "title": "WallsNeedLove.com Drives 93% of their Social Traffic From Pinterest",
            "datePublished": "Tue, 23 Aug 2016 07:00:00 +0000",
            "description": "<p>In this episode you’ll learn how a company drives 93% of their social traffic from Pinterest.</p>\n<p>In this episode you'll learn:</p>\n<ol>\n<li>How to work with bloggers to promote your product and get amazing product photos.</li>\n</ol>\n<p>2. How to work with bloggers to promote your product and get amazing product photos</p>\n<p>3. Why you should have an organic pinning strategy before promoting Pinterest pins.</p>\n",
            "length": "55648344",
            "sourceUrl": "https://feedpress.me/link/16512/13912214/f1f1a158_tc.mp3",
            "epNo": "55"
        },
        {
            "title": "How WaxAndWick.co Drives Traffic From Reddit Without Pitching",
            "datePublished": "Thu, 18 Aug 2016 07:00:00 +0000",
            "description": "<p>In this episode you’ll learn how 3 co-founders drive traffic from Reddit without coming across too salesy.</p>\n<p>In this episode you'll learn:</p>\n<ol>\n<li>\n<p>How to delegate tasks to your team and ensure the work gets done.</p>\n</li>\n<li>\n<p>How to know if you should find a partner or outsource.</p>\n</li>\n</ol>\n<p>3. How to avoid getting burned when posting your business on Reddit.</p>\n",
            "length": "59978807",
            "sourceUrl": "https://feedpress.me/link/16512/13912215/7d62cd6e_tc.mp3",
            "epNo": "54"
        },
        {
            "title": "MoabProvisions.com Sold 6 Figures By Going Door to Door With Retailers",
            "datePublished": "Tue, 16 Aug 2016 07:00:00 +0000",
            "description": "<p>In this episode you’ll learn from an entrepreneur that sold 6 figures by going door to door with retailers.</p>\n<p>In this episode you'll learn:</p>\n<ol>\n<li>How to get honest feedback from friends and family.</li>\n</ol>\n<p>2. How to get meetings with key retail decision makers.</p>\n<p>3. What does a business agreement with an affiliate look like.</p>\n",
            "length": "47875563",
            "sourceUrl": "https://feedpress.me/link/16512/13912216/00345db9_tc.mp3",
            "epNo": "53"
        },
        {
            "title": "NerdWax.com Turned Down 2 Shark Tank Offers and Built a $1 Million Business",
            "datePublished": "Thu, 11 Aug 2016 07:00:00 +0000",
            "description": "<p>In this episode you’ll learn from an entrepreneur that went on Shark Tank and turned down 2 offers but still built a million dollar business.</p>\n<p>In this episode you'll learn:</p>\n<ol>\n<li>How to finally take action on your business or product idea.</li>\n</ol>\n<p>2. How to reverse engineer a life you want.</p>\n<p>3. What is the optimal price point for Kickstarter.</p>\n",
            "length": "61707096",
            "sourceUrl": "https://feedpress.me/link/16512/13912217/3c38f8f1_tc.mp3",
            "epNo": "52"
        },
        {
            "title": "ThisIsGround.com Launched A Catalog of Original Products in Just 3 Years",
            "datePublished": "Tue, 9 Aug 2016 07:00:00 +0000",
            "description": "<p>In this episode you’ll learn from an entrepreneur that launches new products very quickly.</p>\n<p>In this episode you'll learn:</p>\n<ol>\n<li>Why an original product needs to have familiar elements.</li>\n</ol>\n<p>2. How to balance your day job with your passion project and how to keep them separate.</p>\n<p>3. How to project how much inventory to have on hand.</p>\n",
            "length": "53881640",
            "sourceUrl": "https://feedpress.me/link/16512/13912218/b16f91fe_tc.mp3",
            "epNo": "51"
        },
        {
            "title": "MissionBelt.com Started a Business That’s Donated $1 Million To Other Entrepreneurs",
            "datePublished": "Thu, 4 Aug 2016 07:00:00 +0000",
            "description": "<p>In this episode you’ll learn from an entrepreneur that started a business that’s also donated $1 million to other aspiring entrepreneurs.</p>\n<p>In this episode you'll learn:</p>\n<ol>\n<li>Why you should find a business you can afford to fund yourself.</li>\n</ol>\n<p>2. Where you should look towards first to improve your supply chain.</p>\n<p>3. How to approach and pitch a retailer.</p>\n",
            "length": "47020862",
            "sourceUrl": "https://feedpress.me/link/16512/13912219/6c0627ed_tc.mp3",
            "epNo": "50"
        },
        {
            "title": "How OldGuysRule.com Targets Baby Boomers",
            "datePublished": "Tue, 2 Aug 2016 07:00:00 +0000",
            "description": "<p>In this episode, you’ll learn from an entrepreneur that built a business targeting baby boomers.</p>\n<p>In this episode you'll learn:</p>\n<ol>\n<li>\n<p>How to identify brands to license from.</p>\n</li>\n<li>\n<p>What does a licensing deal look like and how to set one up that’s beneficial for you.</p>\n</li>\n</ol>\n<p>3. How to successfully start an online community for your brand.</p>\n",
            "length": "51162334",
            "sourceUrl": "https://feedpress.me/link/16512/13912220/c85f6982_tc.mp3",
            "epNo": "49"
        },
        {
            "title": "Huel.com Used a PR Agency to Kickstart a 2 Million Pound Business",
            "datePublished": "Thu, 28 Jul 2016 07:00:00 +0000",
            "description": "<p>In this episode, you’ll learn from an entrepreneur that used a PR agency to kickstart a 2 million pound business.</p>\n<p>In this episode you'll learn:</p>\n<ol>\n<li>What are the signals to look out for to determine if you are in a growing industry.</li>\n</ol>\n<p>2. How to use a PR agency to kickstart a marketing plan.</p>\n<p>3. What you need to prepare before working with a PR agency.</p>\n",
            "length": "53120941",
            "sourceUrl": "https://feedpress.me/link/16512/13912221/7f27647e_tc.mp3",
            "epNo": "48"
        },
        {
            "title": "ColorIt.com Used Amazon as a Proving Ground to Build a $2.5 Million Business",
            "datePublished": "Tue, 26 Jul 2016 07:00:00 +0000",
            "description": "<p>In this episode you’ll learn from an entrepreneur that used Amazon as a proving grounds to build a $2.5 million business.</p>\n<p>In this episode you'll learn:</p>\n<ol>\n<li>How to use Amazon reviews to figure out how to improve on an existing product.</li>\n</ol>\n<p>2. What is consumerability and why you want to sell a product that has consumerability.</p>\n<p>3. How they’re using the free + shipping model to get customers to make more profitable purchases later.</p>\n",
            "length": "59583866",
            "sourceUrl": "https://feedpress.me/link/16512/13912222/679fb8c1_tc.mp3",
            "epNo": "47"
        },
        {
            "title": "Kit Built a Virtual Marketing Employee That Costs $10 a Month",
            "datePublished": "Thu, 21 Jul 2016 07:00:00 +0000",
            "description": "<p>In this episode you’ll learn from an entrepreneur that developed an app that was acquired by Shopify.</p>\n<p>In this episode you'll learn:</p>\n<ol>\n<li>\n<p>How to decide if you should jump into your business full time.</p>\n</li>\n<li>\n<p>How to use your competition to motivate you rather than overwhelm you.</p>\n</li>\n</ol>\n<p>3. How to find advisors for your business and how to work with them.</p>\n",
            "length": "47675761",
            "sourceUrl": "https://feedpress.me/link/16512/13912223/b7ee8f16_tc.mp3",
            "epNo": "46"
        },
        {
            "title": "AbsPancakes.com Shark Tank Results: 1 Year of Sales in 1 Month",
            "datePublished": "Tue, 19 Jul 2016 07:00:00 +0000",
            "description": "<p>In this episode you’ll learn from an entrepreneur that started by selling digital products and then transitioned into physical products.</p>\n<p>In this episode you'll learn:</p>\n<ol>\n<li>\n<p>Why you might want to start with a physical product instead of a digital product for your first business.</p>\n</li>\n<li>\n<p>How this entrepreneur was able to start a business simply through hashtags on Instagram.</p>\n</li>\n</ol>\n<p>3. How to connect with influencers and get them to work with you to cross-promote.</p>\n",
            "length": "64391204",
            "sourceUrl": "https://feedpress.me/link/16512/13912224/42c813ac_tc.mp3",
            "epNo": "45"
        },
        {
            "title": "The Testing Framework Brooklinen.com Used To Build a $10 Million+ Business",
            "datePublished": "Thu, 14 Jul 2016 07:00:00 +0000",
            "description": "<p>In this episode we’ll hear from an entrepreneur that created a testing framework he used to build a $10 million business.</p>\n<p>In this episode you'll learn:</p>\n<ol>\n<li>\n<p>How to survey people in person to validate a product or business idea.</p>\n</li>\n<li>\n<p>How to differentiate yourself in a competitive marketplace.</p>\n</li>\n<li>\n<p>How to find and hire people that are smarter than you.</p>\n</li>\n</ol>\n",
            "length": "55388805",
            "sourceUrl": "https://feedpress.me/link/16512/13912225/9796cf2d_tc.mp3",
            "epNo": "44"
        },
        {
            "title": "FindlayHats.com Drove $28K from 1 Viral Reddit Post",
            "datePublished": "Tue, 12 Jul 2016 07:00:00 +0000",
            "description": "<p>In this episode you’ll learn how an entrepreneur drove $28,000 from 1 viral reddit post.</p>\n<p>In this episode you'll learn:</p>\n<ol>\n<li>\n<p>How to validate a product on Instagram.</p>\n</li>\n<li>\n<p>How to balance life as a freelancer while launching a product business.</p>\n</li>\n</ol>\n<p>3. What are magic moments and how to create them for your customer.</p>\n",
            "length": "61490139",
            "sourceUrl": "https://feedpress.me/link/16512/13912226/fad6a349_tc.mp3",
            "epNo": "43"
        },
        {
            "title": "Cotopaxi.com Uses In-Person 24-Hour Events To Market Their Vision and Brand",
            "datePublished": "Thu, 7 Jul 2016 07:00:00 +0000",
            "description": "<p>In this episode you’ll learn from an entrepreneur that runs in-person 24-hour events to market their vision and brand.</p>\n<p>In this episode you'll learn:</p>\n<ol>\n<li>\n<p>How to attract smart people to your team.</p>\n</li>\n<li>\n<p>What is a public benefit corporation and how can it help your business.</p>\n</li>\n</ol>\n<p>3. How to prepare to launch your own in-person events.</p>\n",
            "length": "55005550",
            "sourceUrl": "https://feedpress.me/link/16512/13912227/5adeb945_tc.mp3",
            "epNo": "42"
        },
        {
            "title": "Your Brand’s Competitive Edge Doesn’t Have To Be In Your Product",
            "datePublished": "Tue, 5 Jul 2016 07:00:00 +0000",
            "description": "<p>On today’s podcast you’ll learn from an entrepreneur that believes that your competitive edge actually does not have to be your product.</p>\n<p>In this episode you'll learn:</p>\n<ol>\n<li>\n<p>What red flags to look for when sourcing products overseas.</p>\n</li>\n<li>\n<p>Why you don’t need to sell a completely original product.</p>\n</li>\n</ol>\n<p>3. How to improve your decision making to start making decisions faster.</p>\n",
            "length": "50559278",
            "sourceUrl": "https://feedpress.me/link/16512/13912228/e043a843_tc.mp3",
            "epNo": "41"
        },
        {
            "title": "Bee-High.com Built and Marketed A Side Business Using Tumblr",
            "datePublished": "Thu, 30 Jun 2016 07:00:00 +0000",
            "description": "<p>On today’s podcast you’ll learn from an entrepreneur that’s building a business on the side and driving traffic from Tumblr.</p>\n<p>In this episode you'll learn:</p>\n<ol>\n<li>\n<p>How and why to get deeply involved with communities before launching your business.</p>\n</li>\n<li>\n<p>How to deal with the lack of energy and momentum when working a day job and starting a business on the side.</p>\n</li>\n</ol>\n<p>3. What is private label dropshipping and why it might be better than traditional dropshipping.</p>\n",
            "length": "66531163",
            "sourceUrl": "https://feedpress.me/link/16512/13912229/5b08a54c_tc.mp3",
            "epNo": "40"
        },
        {
            "title": "Persistence, Not Passion, Helped GetFitBook.com Sell Over Half a Million Books",
            "datePublished": "Tue, 28 Jun 2016 07:00:00 +0000",
            "description": "<p>On today’s podcast you’ll learn from an entrepreneur that argues that persistence is more important than passion and how it helped her sell over half a million books.</p>\n<p>In this episode you'll learn:</p>\n<ol>\n<li>\n<p>What is analysis paralysis and how to combat it.</p>\n</li>\n<li>\n<p>How to promote the content you create.</p>\n</li>\n</ol>\n<p>3. Why you should feature your customers rather than your products when getting PR.</p>\n",
            "length": "59311371",
            "sourceUrl": "https://feedpress.me/link/16512/13912230/bd947f04_tc.mp3",
            "epNo": "39"
        },
        {
            "title": "The Formula LuxyHair.com Used To Grow a 2.8 Million Subscriber YouTube Channel",
            "datePublished": "Thu, 23 Jun 2016 07:00:00 +0000",
            "description": "<p>On today’s episode you’ll learn from an entrepreneur that launched a YouTube channel that has grown to nearly 3 million subscribers.</p>\n<p>In this episode you'll learn:</p>\n<ol>\n<li>\n<p>The difference between self-employment and being a business owner.</p>\n</li>\n<li>\n<p>Why freedom is tough to manage.</p>\n</li>\n</ol>\n<p>3. How to sell without selling.</p>\n",
            "length": "56393180",
            "sourceUrl": "https://feedpress.me/link/16512/13912231/e8d0e892_tc.mp3",
            "epNo": "38"
        },
        {
            "title": "GlowRecipes.com Gets Publicity By Being a Thought Leader",
            "datePublished": "Tue, 21 Jun 2016 07:00:00 +0000",
            "description": "<p>On today's podcast you’ll learn how two entrepreneurs get free publicity by being thought leaders and talking about the future of their industry.</p>\n<p>In this episode you'll learn:</p>\n<ol>\n<li>\n<p>How to become a thought leader and how to use it to get free publicity.</p>\n</li>\n<li>\n<p>How to drive traffic from Instagram and Snapchat to your store.</p>\n</li>\n</ol>\n<p>3. How to find and work with influencers on YouTube.</p>\n",
            "length": "45793261",
            "sourceUrl": "https://feedpress.me/link/16512/13912232/12de8563_tc.mp3",
            "epNo": "37"
        },
        {
            "title": "A $3 Million 4-Hour A Day Business",
            "datePublished": "Thu, 16 Jun 2016 07:00:00 +0000",
            "description": "<p>On today’s podcast you’ll learn from an entrepreneur that built a $3 million business working 4 hours a day.</p>\n<p>In this episode you'll learn:</p>\n<ol>\n<li>\n<p>Why you should drive your non-English speaking customers to Amazon.</p>\n</li>\n<li>\n<p>Why they redo their website from scratch every year.</p>\n</li>\n</ol>\n<p>3. Why you should buy Facebook ads in Europe rather than in the US.</p>\n",
            "length": "51584460",
            "sourceUrl": "https://feedpress.me/link/16512/13912233/703e9d0b_tc.mp3",
            "epNo": "36"
        },
        {
            "title": "How TinyHandsOnline.com Studies Their Customers Using Facebook",
            "datePublished": "Tue, 14 Jun 2016 07:00:00 +0000",
            "description": "<p>On today’s podcast you’ll learn from an entrepreneur that uses Facebook posts to get feedback from her customer without them knowing.</p>\n<p>In this episode you'll learn:</p>\n<ol>\n<li>\n<p>How to balance what you want versus what your customers want.</p>\n</li>\n<li>\n<p>How to get valuable feedback and data out of social media.</p>\n</li>\n</ol>\n<p>3. How to sell a product that requires the sense of smell online.</p>\n",
            "length": "58539775",
            "sourceUrl": "https://feedpress.me/link/16512/13912234/66c40d08_tc.mp3",
            "epNo": "35"
        },
        {
            "title": "BentoAndCo.com Partners With YouTubers and Bloggers To Drive Traffic and Sales",
            "datePublished": "Thu, 9 Jun 2016 07:00:00 +0000",
            "description": "<p>On today’s podcast you’ll learn from an entrepreneur that partners with YouTubers and bloggers to drive traffic and sales to his store.</p>\n<p>In this episode you'll learn:</p>\n<ol>\n<li>\n<p>Why showing the behind-the-scenes of your business can be great content for your customers.</p>\n</li>\n<li>\n<p>The differences between selling to the European, US and Japanese markets.</p>\n</li>\n</ol>\n<p>3. How to analyze if a YouTuber will be a good fit for your product and brand.</p>\n",
            "length": "49628081",
            "sourceUrl": "https://feedpress.me/link/16512/13912235/e2d07417_tc.mp3",
            "epNo": "34"
        },
        {
            "title": "The Power of Routines and Habits and How They Help Build FaucetFace.com",
            "datePublished": "Tue, 7 Jun 2016 07:00:00 +0000",
            "description": "<p>On today's podcast you’ll learn about this entrepreneurs routines, habits and outside interests that helps him build a successful ecommerce business.</p>\n<p>In this episode you'll learn:</p>\n<ol>\n<li>\n<p>Where you should focus when putting together a contract with a manufacturer.</p>\n</li>\n<li>\n<p>Does business school help with entrepreneurship?</p>\n</li>\n</ol>\n<p>3. Why having lots of cash can be the kiss of death.</p>\n",
            "length": "54565837",
            "sourceUrl": "https://feedpress.me/link/16512/13912236/2c09294a_tc.mp3",
            "epNo": "33"
        },
        {
            "title": "How Greats.com Built a Brand With a 50% Repeat Purchase Rate",
            "datePublished": "Thu, 2 Jun 2016 07:00:00 +0000",
            "description": "<p>On today’s podcast you’ll learn from an entrepreneur that built a brand with a 50% repeat purchase rate.</p>\n<p>In this episode you'll learn:</p>\n<ol>\n<li>\n<p>What is a Net Promoter Score and how to measure it.</p>\n</li>\n<li>\n<p>Why you should not post product shots on Instagram.</p>\n</li>\n</ol>\n<p>3. How to customize your pitch to get press to feature you.</p>\n",
            "length": "47893096",
            "sourceUrl": "https://feedpress.me/link/16512/13912237/eb9b2afa_tc.mp3",
            "epNo": "32"
        },
        {
            "title": "Is Crowdfunding The Right Move For Established Brands?",
            "datePublished": "Tue, 31 May 2016 07:00:00 +0000",
            "description": "<p>On today’s podcast you’ll learn from an entrepreneur that successfully raised nearly $400,000 through crowdfunding and why he thinks established brands should not crowdfund.</p>\n<p>In this episode you'll learn:</p>\n<ol>\n<li>\n<p>How they used Kickstarter to come up with their own product idea.</p>\n</li>\n<li>\n<p>How they A/B test their Facebook ads.</p>\n</li>\n</ol>\n<p>3. When to use Facebook ads and when to use Instagram ads.</p>\n",
            "length": "48183984",
            "sourceUrl": "https://feedpress.me/link/16512/13912238/b12313db_tc.mp3",
            "epNo": "31"
        },
        {
            "title": "ABookApart.com Built a Business With a 100% Remote Team",
            "datePublished": "Thu, 26 May 2016 07:00:00 +0000",
            "description": "<p>On today’s podcast you’ll learn from an entrepreneur that built a business with 100% remote team.</p>\n<p>In this episode you'll learn:</p>\n<ol>\n<li>\n<p>Why to hire someone full time when you are still working your day job.</p>\n</li>\n<li>\n<p>How to communicate with a remote team.</p>\n</li>\n</ol>\n<p>3. How to work backwards to achieve your goals.</p>\n",
            "length": "59992587",
            "sourceUrl": "https://feedpress.me/link/16512/13912239/ae269443_tc.mp3",
            "epNo": "30"
        },
        {
            "title": "How BrilliantBusinessMoms.com Uses Pinterest To Power Her Business",
            "datePublished": "Tue, 24 May 2016 07:00:00 +0000",
            "description": "<p>On today’s podcast you’ll learn from an entrepreneur that uses Pinterest to drive the majority of her sales.</p>\n<p>In this episode you'll learn:</p>\n<ol>\n<li>\n<p>How to balance building an audience and creating and selling products.</p>\n</li>\n<li>\n<p>How she created a viral giveaway that resulted in 7,000 new email addresses.</p>\n</li>\n</ol>\n<p>3. What are Pinterest group boards and how to work with them to drive traffic.</p>\n",
            "length": "58155260",
            "sourceUrl": "https://feedpress.me/link/16512/13912240/5c6cfb4a_tc.mp3",
            "epNo": "29"
        },
        {
            "title": "The Power of Positioning and How It Helped NeedWant.com Build a $2.5 Million Business",
            "datePublished": "Thu, 19 May 2016 07:00:00 +0000",
            "description": "<p>On today’s podcast you’ll learn from an entrepreneur that’s launched a $2.5 million portfolio of single-product stores.</p>\n<p>In this episode you'll learn:</p>\n<ol>\n<li>\n<p>How they came up with and tested their positioning using Facebook ads.</p>\n</li>\n<li>\n<p>Why you should meet with manufacturers in person.</p>\n</li>\n<li>\n<p>The pros and cons of being completely transparent with your business’s numbers.</p>\n</li>\n</ol>\n",
            "length": "48680999",
            "sourceUrl": "https://feedpress.me/link/16512/13912241/63c6cc23_tc.mp3",
            "epNo": "28"
        },
        {
            "title": "TryTheWorld.com Grew from 500 to 50,000 Subscription Box Customers",
            "datePublished": "Tue, 17 May 2016 07:00:00 +0000",
            "description": "<p>On today’s podcast you’ll learn from an entrepreneur that grew a subscription service from 500 to 50,000 customers.</p>\n<p>In this episode you'll learn:</p>\n<ol>\n<li>\n<p>The benefits of offering an annual subscription plan.</p>\n</li>\n<li>\n<p>How they use Facebook Lookalike audiences to target their ads.</p>\n</li>\n</ol>\n<p>3. What is churn rate and why it will be crazy at the beginning and stabilize over time.</p>\n",
            "length": "47985059",
            "sourceUrl": "https://feedpress.me/link/16512/13912242/b94acdcc_tc.mp3",
            "epNo": "27"
        },
        {
            "title": "SheFit Beats Competition By Doing Just One Thing Better Than Everyone Else",
            "datePublished": "Thu, 12 May 2016 07:00:00 +0000",
            "description": "<p>On today’s episode you’ll learn from an entrepreneur that trimmed the fat from her business and focused on just doing one thing better than her competitors.</p>\n<p>In this episode you'll learn:</p>\n<ol>\n<li>\n<p>What is the patent process like and why you might want to get one for your product.</p>\n</li>\n<li>\n<p>What Daymond John’s team did to improve their manufacturing process.</p>\n</li>\n</ol>\n<p>3. How can rapid growth put you out of business.</p>\n",
            "length": "61638966",
            "sourceUrl": "https://feedpress.me/link/16512/13912243/9a1561c3_tc.mp3",
            "epNo": "26"
        },
        {
            "title": "ForeverSpin.com Discovered Untapped Customer Bases on Crowdfunding Sites",
            "datePublished": "Tue, 10 May 2016 07:00:00 +0000",
            "description": "<p>On today’s podcast you’ll learn from an entrepreneur that set up ahotline for feedback during their Kickstartercampaign.</p>\n<p>In this episode you'll learn:</p>\n<ol>\n<li>\n<p>The criteria they used to figure out what they wanted tosell.</p>\n</li>\n<li>\n<p>How to attract non-English speaking Kickstarter backers to yourcampaign.</p>\n</li>\n</ol>\n<p>3. Whyyou want to launch on both Kickstarter andIndiegogo.</p>\n",
            "length": "54029179",
            "sourceUrl": "https://feedpress.me/link/16512/13912244/031ac6df_tc.mp3",
            "epNo": "25"
        },
        {
            "title": "How CivilEstimator.com Uses Shopify To Sell Services",
            "datePublished": "Thu, 5 May 2016 07:00:00 +0000",
            "description": "<p>On today’s podcast you’ll learn from a B2B entrepreneur that sells his services through Shopify.</p>\n<p>In this episode you'll learn:</p>\n<ol>\n<li>\n<p>How to use Shopify to collect payments as a service provider.</p>\n</li>\n<li>\n<p>Why cash is king over profits and revenue.</p>\n</li>\n</ol>\n<p>3. Where you should look to improve your business’ cash flow.</p>\n",
            "length": "53231255",
            "sourceUrl": "https://feedpress.me/link/16512/13912245/823278a8_tc.mp3",
            "epNo": "24"
        },
        {
            "title": "The Slow Grind of PR and How It Got CombatFlipFlops.com On Shark Tank",
            "datePublished": "Tue, 3 May 2016 07:00:00 +0000",
            "description": "<p>On today’s podcast you’ll learn from an entrepreneur that manufactures his products in conflict affected areas.</p>\n<p>In this episode you'll learn:</p>\n<ol>\n<li>\n<p>Why you want to find a PR firm that’s the same size as your business.</p>\n</li>\n<li>\n<p>Why you might want to consider outsourcing to countries like Afghanistan and Colombia.</p>\n</li>\n</ol>\n<p>3. How to work with existing businesses in your industry to cut down on the learning curve.</p>\n",
            "length": "43540905",
            "sourceUrl": "https://feedpress.me/link/16512/13912246/695668e4_tc.mp3",
            "epNo": "23"
        },
        {
            "title": "How PrideDesignz.com uses Facebook Fan Pages To Average $30K/Month In Sales",
            "datePublished": "Thu, 28 Apr 2016 07:00:00 +0000",
            "description": "<p>On this week’s episode you'll learn from an entrepreneur that followed her passions and created a Facebook fan page that drives the majority of her traffic.</p>\n<p>In this episode you'll learn:</p>\n<ol>\n<li>\n<p>How you can tell if you’re just interested or if you’re truly passionate about a niche.</p>\n</li>\n<li>\n<p>How to transition from building an audience to monetizing that audience.</p>\n</li>\n</ol>\n<p>3. And the kinds of content to post on your Facebook fan page to get the most engagement with actual examples.</p>\n",
            "length": "64945025",
            "sourceUrl": "https://feedpress.me/link/16512/13912247/67d866af_tc.mp3",
            "epNo": "22"
        },
        {
            "title": "Pragmatism vs. Passion: How RightChannelRadios.com Chose Their Niche",
            "datePublished": "Tue, 26 Apr 2016 07:00:00 +0000",
            "description": "<p>On today’s podcast you’ll learn from an entrepreneur that took a very pragmatic approach to choosing his niche and how you can be successful even if you’re not passionate about the product itself as long as you have a passion for business.</p>\n<p>In this episode you'll learn:</p>\n<ol>\n<li>\n<p>How to prepare when you’re thinking about making the jump from the 9-to-5 to working on your business full time.</p>\n</li>\n<li>\n<p>Why it’s critical and what does it mean to add meaningful value when you’re dropshipping.</p>\n</li>\n</ol>\n<p>3. How to create content when you don’t know anything about the industry.</p>\n",
            "length": "52043447",
            "sourceUrl": "https://feedpress.me/link/16512/13912248/3ab69f7a_tc.mp3",
            "epNo": "21"
        },
        {
            "title": "Knoxlabs.com Validated Using a Splash Page And Made $2.9 Million in 2015",
            "datePublished": "Thu, 21 Apr 2016 07:00:00 +0000",
            "description": "<p>On today’s podcast you’ll learn from an entrepreneur that tested the market with a splash page and very quickly presold 500 products.</p>\n<p>In this episode you'll learn:</p>\n<ol>\n<li>\n<p>How to use a splash page to validate the market.</p>\n</li>\n<li>\n<p>What to do when you are not able to fulfill preorders in time.</p>\n</li>\n</ol>\n<p>3. The cash flow issues and how to handle them when you’re scaling up.</p>\n",
            "length": "46117629",
            "sourceUrl": "https://feedpress.me/link/16512/13912249/0717e3d5_tc.mp3",
            "epNo": "20"
        },
        {
            "title": "How AirTailor.com Uses Conversational Commerce to Sell via Text Message",
            "datePublished": "Tue, 19 Apr 2016 07:00:00 +0000",
            "description": "<p>On today’s podcast you’ll learn from an entrepreneur that sells his services through text messages.</p>\n<p>In this episode you'll learn:</p>\n<ol>\n<li>\n<p>Why they decided to rebrand their company over the next year.</p>\n</li>\n<li>\n<p>What obstacles they’re overcoming as they’re rebranding and what they wish they did differently.</p>\n</li>\n</ol>\n<p>3. How they sell their services through text messages and what apps they use to do it.</p>\n",
            "length": "55988152",
            "sourceUrl": "https://feedpress.me/link/16512/13912250/b92f2b03_tc.mp3",
            "epNo": "19"
        },
        {
            "title": "ImpactMouthguards.com Built a Mid 6-Figure Business By Giving Away Their Products",
            "datePublished": "Thu, 14 Apr 2016 07:00:00 +0000",
            "description": "<p>On today’s podcast you’ll learn from an entrepreneur that wants to give over 500 products away this year and why he believes it’ll increase his sales.</p>\n<p>In this episode you'll learn:</p>\n<ol>\n<li>\n<p>How they educated customers to buy a product that's many times more expensive than the alternative.</p>\n</li>\n<li>\n<p>How to use Facebook ads and giveaways to grow your mailing list.</p>\n</li>\n</ol>\n<p>3. How to keep people on your email list if they originally only joined to enter the contest.</p>\n",
            "length": "41185729",
            "sourceUrl": "https://feedpress.me/link/16512/13912251/f9d91609_tc.mp3",
            "epNo": "18"
        },
        {
            "title": "The Hidden Costs of Fulfillment After CandylabToys.com Raised $118K on Kickstarter",
            "datePublished": "Tue, 12 Apr 2016 07:00:00 +0000",
            "description": "<p>On today’s podcast you’ll learn from an entrepreneur that ran into hidden logistic costs and what he recommends you look out for.</p>\n<p>In this episode you'll learn:</p>\n<ol>\n<li>\n<p>How to approach your personal network to promote your product.</p>\n</li>\n<li>\n<p>Why the hidden costs in logistics are especially dangerous.</p>\n</li>\n</ol>\n<p>3. Why you should figure out how much it costs your manufacturer to produce your products.</p>\n",
            "length": "56827018",
            "sourceUrl": "https://feedpress.me/link/16512/13912252/82d76084_tc.mp3",
            "epNo": "17"
        },
        {
            "title": "Build a Business Winner Leesa.com Proclaims That Ecommerce Is a Numbers Game",
            "datePublished": "Thu, 7 Apr 2016 07:00:00 +0000",
            "description": "<p>On today’s podcast you’ll learn from two entrepreneurs that partnered to take on a $14 billion industry.</p>\n<p>In this episode you'll learn:</p>\n<ol>\n<li>\n<p>How they were able to get to $1 million by their 2nd month.</p>\n</li>\n<li>\n<p>What is the Salary Drug, why you might be hooked on it and how to break free from it.</p>\n</li>\n</ol>\n<p>3. How to know what you should do when your business is stagnating.</p>\n",
            "length": "56576230",
            "sourceUrl": "https://feedpress.me/link/16512/13912253/5c9a30cb_tc.mp3",
            "epNo": "16"
        },
        {
            "title": "SoleBicycles.com Sells 15,000 Bikes A Year Using Content Marketing",
            "datePublished": "Tue, 5 Apr 2016 07:00:00 +0000",
            "description": "<p>On today’s podcast you’ll learn from an entrepreneur that started a direct-to-consumer bike company to cut out the middleman retailers and has had 100% growth year over year.</p>\n<p>In this episode you'll learn:</p>\n<ol>\n<li>\n<p>How to beat your competitors by not marketing your product, but marketing an aspirational lifestyle tied to your product.</p>\n</li>\n<li>\n<p>How they bootstrapped a inventory-heavy business without any significant outside investments.</p>\n</li>\n</ol>\n<p>3. What is a Sourcing Agent and how hiring one helped them scale their business smoothly.</p>\n",
            "length": "48782525",
            "sourceUrl": "https://feedpress.me/link/16512/13912254/2551daf7_tc.mp3",
            "epNo": "15"
        },
        {
            "title": "The Comeback Story of Rockwell Razors and Their Kickstarter Campaign That Almost Failed",
            "datePublished": "Thu, 31 Mar 2016 07:00:00 +0000",
            "description": "<p>On today’s podcast you’ll learn from an entrepreneur that disappointed 2,500 Kickstarter backers and the story of how he made it all right.</p>\n<p>In this episode you'll learn:</p>\n<ol>\n<li>\n<p>How to find out what product features your customers care about.</p>\n</li>\n<li>\n<p>How to use Reddit for feedback and as a sales channel (it’s this entrepreneur’s #1 sales channel).</p>\n</li>\n</ol>\n<p>3. The tough lesson this entrepreneur learned when he blindly trusted professionals.</p>\n",
            "length": "50113767",
            "sourceUrl": "https://feedpress.me/link/16512/13912255/c686b5d4_tc.mp3",
            "epNo": "14"
        },
        {
            "title": "Live from Shopify UNITE: Sales Channels, Buy Buttons and the Future of Commerce",
            "datePublished": "Tue, 29 Mar 2016 07:00:00 +0000",
            "description": "<p>On today's podcast you'll hear from Shopify insiders on the latest features including sales channels, buy buttons and their take on the future of commerce.</p>\n",
            "length": "53945183",
            "sourceUrl": "https://feedpress.me/link/16512/13912256/d67054a6_tc.mp3",
            "epNo": "13"
        },
        {
            "title": "Lessons From RhinoCameraGear.com And Their 6 Kickstarter Campaigns",
            "datePublished": "Thu, 24 Mar 2016 07:00:00 +0000",
            "description": "<p>In this episode you’ll learn from an entrepreneur that’s launched 6 Kickstarter campaigns and plans on launching 2 more this year.</p>\n<p>In this episode you'll learn:</p>\n<ol>\n<li>\n<p>The marketing channels they utilized when running Kickstarter campaigns and how they use PPC during a Kickstarter campaign.</p>\n</li>\n<li>\n<p>How they transitioned the traffic and buzz from Kickstarter to their Shopify store.</p>\n</li>\n</ol>\n<p>3. What benefits they’ve found from creating a business plan and updating it regularly.</p>\n",
            "length": "54421631",
            "sourceUrl": "https://feedpress.me/link/16512/13912257/8460c1aa_tc.mp3",
            "epNo": "12"
        },
        {
            "title": "How TheArtPillow.com Turned His Passion For Art Into a Profitable Career and Business",
            "datePublished": "Tue, 22 Mar 2016 07:00:00 +0000",
            "description": "<p>On today’s podcast you’ll learn from an entrepreneur that turned his passion for art into a business.</p>\n<p>In this episode you'll learn:</p>\n<ol>\n<li>\n<p>If you’re an artist, you first step to monetizing can be offline through art shows.</p>\n</li>\n<li>\n<p>The business side of working with Fab.com.</p>\n</li>\n</ol>\n<p>3. What it’s like to sell your products through a catalogue like CB2.</p>\n",
            "length": "51610893",
            "sourceUrl": "https://feedpress.me/link/16512/13912258/1fbe73ca_tc.mp3",
            "epNo": "11"
        },
        {
            "title": "How PosterGully.com Got Buyers And Sellers Together To Start A $1 Million Art Marketplace",
            "datePublished": "Thu, 17 Mar 2016 07:00:00 +0000",
            "description": "<p>In this episode you’ll learn from an entrepreneur that started an art marketplace in India.</p>\n<p>In this episode you'll learn:</p>\n<ol>\n<li>\n<p>Whether you should focus on buyers or sellers first when launching a marketplace.</p>\n</li>\n<li>\n<p>Why they credit growth hacking for their early traction and what exact tactics they used.</p>\n</li>\n</ol>\n<p>3. How a campus ambassador program changed the game for them and exactly what’s involved in starting and running an ambassador program successfully.</p>\n",
            "length": "45721020",
            "sourceUrl": "https://feedpress.me/link/16512/13912259/97656d48_tc.mp3",
            "epNo": "10"
        },
        {
            "title": "Starting DustAndThings.com From Scratch After Running a 75-Person Company",
            "datePublished": "Tue, 15 Mar 2016 07:00:00 +0000",
            "description": "<p>In this episode you’ll learn from an entrepreneur that already built a 75-person company and then decided to give it all up to start a new business from scratch.</p>\n<p>In this episode you'll learn:</p>\n<ol>\n<li>\n<p>What he quickly realized when he transitioned from a 75-person company to a brand new business with just him and his partner.</p>\n</li>\n<li>\n<p>How he ran Facebook ads to validate his new business.</p>\n</li>\n</ol>\n<p>3. What is premature optimization and how it can kill your business.</p>\n",
            "length": "57079029",
            "sourceUrl": "https://feedpress.me/link/16512/13912260/d598437d_tc.mp3",
            "epNo": "9"
        },
        {
            "title": "How One Entrepreneur Generates $1 Million a Year Selling Marijuana Accessories",
            "datePublished": "Thu, 10 Mar 2016 08:00:00 +0000",
            "description": "<p>In this episode you’ll learn from a top performing sales executive that’s in charge of two Shopify stores in the marijuana accessories industry.</p>\n<p>In this episode you'll learn:</p>\n<ol>\n<li>\n<p>Why you’ll get better customers by offering 100% satisfaction guaranteed refunds rather than giving away free samples.</p>\n</li>\n<li>\n<p>Why not needing revenue immediately can help you focus on building a product-first business.</p>\n</li>\n</ol>\n<p>3. What it’s like working a demanding sales job and running 2 Shopify businesses.</p>\n",
            "length": "51729576",
            "sourceUrl": "https://feedpress.me/link/16512/13912261/a8d0a7aa_tc.mp3",
            "epNo": "8"
        },
        {
            "title": "Marion Smith Turned Down a 6-Figure Salary To Start A Business That Now Makes 6-Figures Every Month",
            "datePublished": "Tue, 8 Mar 2016 08:00:00 +0000",
            "description": "<p>In this episode you’ll learn from a designer that turned down a $150K salary to start her own independent brand.</p>\n<p>In this episode you'll learn:</p>\n<ol>\n<li>\n<p>How to plan out and manage a subscription box product.</p>\n</li>\n<li>\n<p>Why you should get a large order of samples when working with manufacturers rather than just a few samples.</p>\n</li>\n</ol>\n<p>3. How she was able to build a 20,000+ loyal fan base using YouTube.</p>\n",
            "length": "44951159",
            "sourceUrl": "https://feedpress.me/link/16512/13912262/7bf42cce_tc.mp3",
            "epNo": "7"
        },
        {
            "title": "How HandbandPro.com Made $184K Selling A Crossfit Product She Invented",
            "datePublished": "Thu, 3 Mar 2016 08:00:00 +0000",
            "description": "<p>In this episode you’ll learn from an entrepreneur that started doing crossfit to get into shape and then ended up inventing a product for crossfit athletes.</p>\n<p>In this episode you'll learn:</p>\n<ol>\n<li>\n<p>Why you might not want to look at your numbers every day.</p>\n</li>\n<li>\n<p>If you spend less time planning and more time taking action, things start to fall into place.</p>\n</li>\n</ol>\n<p>3. How she used Facebook groups to get her first sales.</p>\n",
            "length": "46161929",
            "sourceUrl": "https://feedpress.me/link/16512/13912263/4ad3196d_tc.mp3",
            "epNo": "6"
        },
        {
            "title": "SmartNora.com Just Broke $1 Million In Presales on Kickstarter and Shopify",
            "datePublished": "Tue, 1 Mar 2016 08:00:00 +0000",
            "description": "<p>In this episode you’ll learn from an entrepreneur that took a product his dad invented to Kickstarter and smashed their $100,000 goal by raising $800,000 and just broke $1 million total after preselling on their Shopify store.</p>\n<p>In this episode you'll learn:</p>\n<ol>\n<li>\n<p>What are the keys to having a high converting Kickstarter video.</p>\n</li>\n<li>\n<p>How to market a 30-day Kickstarter campaign.</p>\n</li>\n</ol>\n<p>3. How to get press by looking at the websites of other companies in your same industry.</p>\n",
            "length": "45821300",
            "sourceUrl": "https://feedpress.me/link/16512/13912264/aa950085_tc.mp3",
            "epNo": "5"
        },
        {
            "title": "How NutButterNation.com Made $75,000 By Targeting The Right Sales Channels",
            "datePublished": "Thu, 25 Feb 2016 08:00:00 +0000",
            "description": "<p>In this episode you’ll learn from an entrepreneur that’s tried to start 8 other businesses and finally hit a success all while doing it on the side.</p>\n<p>In this episode you'll learn:</p>\n<ol>\n<li>\n<p>How to validate an idea early from someone that’s tried to start 8 other businesses.</p>\n</li>\n<li>\n<p>How to get unbiased feedback from friends and family.</p>\n</li>\n</ol>\n<p>3. What processes and systems to set up to market your product successfully.</p>\n",
            "length": "54083936",
            "sourceUrl": "https://feedpress.me/link/16512/13912265/c337d02c_tc.mp3",
            "epNo": "4"
        },
        {
            "title": "How SyghtGlasses.com Made $2,416.51 in 5 Weeks Selling Glasses From China + Store Giveaway",
            "datePublished": "Tue, 23 Feb 2016 08:00:00 +0000",
            "description": "<p>In this episode you’ll learn from an entrepreneur that launched a business in 5 weeks and documented the entire journey.</p>\n<p>In this episode you'll learn:</p>\n<ol>\n<li>\n<p>How to use your competitor’s product reviews to improve your copywriting.</p>\n</li>\n<li>\n<p>How to reverse engineer the viability of a business idea.</p>\n</li>\n</ol>\n<p>3. How to find and work with influencers and only pay them when they sell your product.</p>\n",
            "length": "51709124",
            "sourceUrl": "https://feedpress.me/link/16512/13912266/d60517ad_tc.mp3",
            "epNo": "3"
        },
        {
            "title": "Going Wholesale-Only Helped RushSports.co.za Grow By 200% Each Year",
            "datePublished": "Thu, 18 Feb 2016 08:00:00 +0000",
            "description": "<p>In this episode you’ll learn from an entrepreneur that started selling direct-to-consumer and wholesale and then transitioned to wholesale-only.</p>\n<p>In this episode you'll learn:</p>\n<ol>\n<li>\n<p>Why you might want to be careful about starting a business around a passion.</p>\n</li>\n<li>\n<p>Why it’s dangerous to stock products that you would buy and how to do market research to find out what others would buy.</p>\n</li>\n</ol>\n<p>3. What marketing challenges you’ll face when transitioning to a wholesale-only business.</p>\n",
            "length": "51592049",
            "sourceUrl": "https://feedpress.me/link/16512/13912267/563507ba_tc.mp3",
            "epNo": "2"
        },
        {
            "title": "TreatsHappen.com Launched Their Brand By Going To 30 Trade Shows Last Year",
            "datePublished": "Tue, 16 Feb 2016 08:00:00 +0000",
            "description": "<p>In this episode you’ll learn from two entrepreneurs that launched their brand through trade shows.</p>\n<p>In this episode you'll learn:</p>\n<ol>\n<li>\n<p>What do you get from investing $1,000 into a booth at a show.</p>\n</li>\n<li>\n<p>How to know which shows will be worth your time from two entrepreneurs that went to 30 trade shows in one year.</p>\n</li>\n</ol>\n<p>3. How they use Facebook boosted posts promote their own viral content.</p>\n",
            "length": "42253183",
            "sourceUrl": "https://feedpress.me/link/16512/13912268/fd7273ab_tc.mp3",
            "epNo": "1"
        }
    ]
}