{
    "artwork": "http://is4.mzstatic.com/image/thumb/Music/v4/3b/c4/d7/3bc4d712-1571-31cb-7879-dec3fc27f14f/source/100x100bb.jpg",
    "description": "Dharma talks and guided meditations given six days per week during the Spring, 2011 eight-week Shamatha retreat at the Thanyapura Mind Centre in Phuket, Thailand, with B. Alan Wallace. Podcasts will be posted daily during the retreat.",
    "feedURL": "http://feeds.feedburner.com/AlanWallaceSpring2011Shamatha",
    "podcastURL": "http://podcasts.sbinstitute.com/spring2011/",
    "publisher": "podcasts@sbinstitute.com (Alan Wallace )",
    "title": "Spring 2011 Shamatha Retreat",
    "episodes": [
        {
            "title": "94 Finishing with Loving-kindness ",
            "datePublished": "Sat, 04 Jun 2011 18:16:15 +0700",
            "description": "<p>In this final session, Alan brings us back to the first immeasurable of loving-kindness with a guided meditation which focuses on loving-kindness first for oneself, and then spreading out to all begins.</p>\n\n<p>Thank you for listening to these podcasts. If you have found them of value, please consider donating to the <a href=\"http://sbinstitute.com/\" target=\"_blank\">Santa Barbara Institute</a>.</p>",
            "length": "15051562",
            "sourceUrl": "http://podcasts.sbinstitute.com/spring2011/podcast-audio/48afternoon.mp3"
        },
        {
            "title": "93 Integrating Into the Outside World",
            "datePublished": "Fri, 03 Jun 2011 21:07:36 +0700",
            "description": "<p>Editor's Note: Due to multiple recording errors, this afternoon's podcast is an optimized recording from an iPhone. Because of this, it is difficult to hear clearly. My very sincere apologies. If anyone can improve the quality further, I would love to publish a better version. Please email Lizzy at <a href=\"mailto:podcasts@sbinstitute.com\" target=\"_blank\">podcasts@sbinstitute.com</a> if you are interested.</p>\n\n<p>Also, Alan requests that transcriptions of the afternoon sessions from the past two weeks be created. If you are interested in transcribing one or more afternoon sessions, please email <a href=\"mailto:ksnow@sbinstitute.com\">ksnow@sbinstitute.com</a> with the name of the podcast you want to transcribe. This will be of great benefit to many people.</p>\n\n<p>This afternoon, Alan first guides a beautiful meditation that integrates shamatha, equanimity, compassion, and loving-kindness. He then summarizes the pith points of the last two days of discussion on the development of science and its relationship to the science of the mind of Buddhism. </p>\n\n<p>After that, [55:00] Alan gives us tips for integrating back into the \"outside world,\" and we finish the afternoon with a comment from a participant.</p>",
            "length": "32884317",
            "sourceUrl": "http://podcasts.sbinstitute.com/spring2011/podcast-audio/47afternoon.mp3"
        },
        {
            "title": "92 Easy Comings and Goings",
            "datePublished": "Fri, 03 Jun 2011 09:43:41 +0700",
            "description": "This morning, Alan first speaks about Dharma practice during periods of transition. This is followed by an unguided meditation, which is not included.<img src=\"http://feeds.feedburner.com/~r/AlanWallaceSpring2011Shamatha/~4/mhS2oF2Herg\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "3267775",
            "sourceUrl": "http://podcasts.sbinstitute.com/spring2011/podcast-audio/47morning.mp3",
            "categories": [
                {
                    "_": "Uncategorized",
                    "$": {
                        "domain": "http://podcasts.sbinstitute.com/spring2011/?cat=1"
                    }
                }
            ]
        },
        {
            "title": "91 Final Afternoon Session: The History and Development of Buddhism",
            "datePublished": "Thu, 02 Jun 2011 19:00:07 +0700",
            "description": "<p>Although there are two more days of retreat, this is our last afternoon session. Alan begins by jumping right in to a guided meditation in which he \"puts us through the paces\" of the three types of mindfulness of breathing, settling the mind in its natural state, awareness of awareness, and, finally, vipashyana.</p>\n\n<p>This is followed by a long question and answer period. [26:55] Alan answers these questions from the group, particularly focusing on the final three questions.</p>\n\n<p>1. I have noticed during the retreat how the English language, with personal pronouns an integral grammatical structure, both serves to assist the development of a concretized sense of self/ego and duality, and then becomes like their protector. (I understand most languages represent individuals or groups to a lesser or greater degree (except for Thai, Burmese, and Japanese).) </p>\n\n<p>I experimented during the retreat with not using \"I, me or mine\" and it showed just how deeply ingrained the constructed sense of the world and self is in language.</p>\n\n<p>What is your advice about negotiating the dissonance between language, encoding as it does samsara and ultimate reality, especially anatta, that we are seeking to understand and experience?</p>\n\n<p>2. I am aware of the Tibetan custom of not talking about meditative experiences and realizations. As we begin to talk - and soon will be home and doubtless facing the questions of loved ones and acquaintances (\"So how did it go? What did you get to?!?\") - do you have any advice on how we talk about our retreat? Or our plans for the future? Could you say a little about why the Tibetans take this attitude of saying little or nothing? Is it relevant for us and does it apply to a very ordinary level of experience?</p>\n\n<p>3. Are vividness and clarity simply alternate translations of the same Tibetan/Sanskrit term or do they carry a difference in meaning? Also Gen Lamrimpa mentions 'lucidity' and 'strength of clarity'; what is the distinction?</p>\n\n<p>4. In one of the talks you mentioned briefly that after the Buddha lived, it did not take very long till different interpretations of his teachings started to emerge. Can you tell us a little bit more how the different schools of Buddhism were formed? (How long after the Buddha we can say there was 'Buddhism'?)</p>\n\n<p>5. How did Buddhism develop also to a religion and why do you think it did?</p>\n\n<p>6. Do all schools of Buddhism share the [worldview + practice + way of life] being the heart of the teachings?</p>",
            "length": "61581647",
            "sourceUrl": "http://podcasts.sbinstitute.com/spring2011/podcast-audio/46afternoon.mp3"
        },
        {
            "title": "90 Morning Q&A #3",
            "datePublished": "Thu, 02 Jun 2011 09:43:24 +0700",
            "description": "<p>This morning we begin with an unguided meditation (not included in this recording) and then Alan answers the following questions from the group:</p>\n\n<p>1. Could you clarify the terms mind, awareness, and consciousness? Do you use them interchangeably?</p>\n\n<p>2. You mentioned <i>sem</i> and <i>rigpa</i>. What about <i>lo</i>?</p>",
            "length": "4358073",
            "sourceUrl": "http://podcasts.sbinstitute.com/spring2011/podcast-audio/46morning.mp3"
        },
        {
            "title": "89 Integrated Vipashyana",
            "datePublished": "Wed, 01 Jun 2011 18:29:21 +0700",
            "description": "<p>This afternoon Alan leads a guided meditation [6:25] that integrates the three different methods of vipashyana as taught by Padmasambhava.</p>\n\n<p>After the guided meditation [31:40], Alan talks about the history and development of science by answering the following questions:</p>\n\n<p>1. When did the different schools and interpretations of scientific discovery occur?</p>\n\n<p>2. How did natural philosophy develop into science?</p>\n\n<p>3, How did scientific materialism occur?</p>\n\n<p>4. When did scientific materialism become state religion?</p>\n\n<p>5. Do all branches of science share the same worldview?</p>",
            "length": "48842855",
            "sourceUrl": "http://podcasts.sbinstitute.com/spring2011/podcast-audio/45afternoon.mp3"
        },
        {
            "title": "88 Evaluating Practice",
            "datePublished": "Wed, 01 Jun 2011 09:59:12 +0700",
            "description": "This morning, Alan speaks about skillful means for evaluating our practice and determining whether our aspirations are being fulfilled or not. The following unguided meditation is not included.",
            "length": "4218259",
            "sourceUrl": "http://podcasts.sbinstitute.com/spring2011/podcast-audio/45morning.mp3"
        },
        {
            "title": "87 Vipashyana: Identifying Rigpa",
            "datePublished": "Tue, 31 May 2011 18:26:54 +0700",
            "description": "In this afternoon session, (today's morning session did not include any guidance or teachings and was not recorded) Alan Wallace continues to teach on vipashyana. We begin this afternoon with a 24-minute meditation [1:10] with guidance from the direct words of Padmasambhava. After the meditation, Alan elaborates and gives commentary on the text, which is available <a href=\"http://sbinstitute.com/PodcastNotes/Vipashyana%20Instructions.htm\">online</a>. We conclude the session with a brief (7 minute) guided tonglen meditation.",
            "length": "40628440",
            "sourceUrl": "http://podcasts.sbinstitute.com/spring2011/podcast-audio/44afternoon.mp3"
        },
        {
            "title": "86 Vipashyana: Continuing the Search",
            "datePublished": "Mon, 30 May 2011 18:20:22 +0700",
            "description": "<p>This afternoon, we review the teachings from Saturday afternoon (#84) and practice in the same way. The unguided meditation is not included. There is no question and answer; instead, Alan gives some final remarks after the ~55 minute dharma talk and meditation period.</p>\r\n\r\n<p>Link to the notes from this talk: http://sbinstitute.com/PodcastNotes/Vipashyana%20Instructions.htm</p><img src=\"http://feeds.feedburner.com/~r/AlanWallaceSpring2011Shamatha/~4/M5MrOfJqSRQ\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "32353109",
            "sourceUrl": "http://podcasts.sbinstitute.com/spring2011/podcast-audio/43afternoon.mp3",
            "categories": [
                {
                    "_": "Uncategorized",
                    "$": {
                        "domain": "http://podcasts.sbinstitute.com/spring2011/?cat=1"
                    }
                }
            ]
        },
        {
            "title": "85 Releasing the \"Shoulds\" and Relaxing",
            "datePublished": "Mon, 30 May 2011 10:27:24 +0700",
            "description": "This morning, Alan reminds us to continue to \"downshift\" and loosen up if we find we are unsatisfied with the quality of our meditation. This brief introduction is followed by an unguided meditation, which is not included.<img src=\"http://feeds.feedburner.com/~r/AlanWallaceSpring2011Shamatha/~4/D0DatSLlA2Q\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "2383909",
            "sourceUrl": "http://podcasts.sbinstitute.com/spring2011/podcast-audio/43morning.mp3",
            "categories": [
                {
                    "_": "Uncategorized",
                    "$": {
                        "domain": "http://podcasts.sbinstitute.com/spring2011/?cat=1"
                    }
                }
            ]
        },
        {
            "title": "84 Vipashyana: Searching for the Mind",
            "datePublished": "Sat, 28 May 2011 18:33:43 +0700",
            "description": "This afternoon Alan continues with a second method of vipashyana, \"Engaging in the Search for the Mind,\" again from Padmasambhava's \"Natural Liberation,\" with reference as well to Tsongapa's teachings on the same subject. The dharma talk lasts most of the session, and we conclude with a final seven-minute silent meditation (included), followed by final remarks.",
            "length": "47546287",
            "sourceUrl": "http://podcasts.sbinstitute.com/spring2011/podcast-audio/42afternoon.mp3"
        },
        {
            "title": "83 Morning Q&A #2",
            "datePublished": "Sat, 28 May 2011 09:38:17 +0700",
            "description": "<p>We will continue to go right into unguided meditation sessions in the morning (not included in the recording), followed by brief Q&A. This morning Alan answers one question:</p>\n\n<p>1. In awareness of awareness, I find it difficult to relax, although I am quite concentrated. I notice tension keeps creeping in. Is this common?</p>",
            "length": "2215666",
            "sourceUrl": "http://podcasts.sbinstitute.com/spring2011/podcast-audio/42morning.mp3"
        },
        {
            "title": "82 Vipashyana",
            "datePublished": "Fri, 27 May 2011 18:48:01 +0700",
            "description": "<p>This afternoon, Alan ventures into the realm of vipashyana with an introductory teaching. He draws from Padmasambhava's \"Natural Liberation\" and instructs us on a basic vipashyana technique. The opening talk lasts 55 minutes, and the following unguided vipashyana meditation is included.</p>\n\n<p>After the unguided meditation [1:23:05], Alan continues to elaborate on the value of contemplative introspection and observation. He concludes with a special message for podcast listeners, which begins at 1:42:00.</p>",
            "length": "54607203",
            "sourceUrl": "http://podcasts.sbinstitute.com/spring2011/podcast-audio/41afternoon.mp3"
        },
        {
            "title": "81 Morning Q&A",
            "datePublished": "Fri, 27 May 2011 09:46:28 +0700",
            "description": "<p>This morning's session is an unguided open practice, followed by brief Q&A. The meditation period is not included.</p>\n\n<p>Alan answers these questions:</p>\n\n<p>1. In awareness of awareness, how can I most effectively release medium excitation other than relaxing more?</p>\n\n<p>2. In settling the mind in its natural state, during the period of \"in the seen, let there be just the seen,\" I'm still aware of my breath as well as thoughts arising. What to do?</p>\n\n<p>3. In settling the mind in its natural state, there are now longer and longer intervals between thoughts. What should I be doing in these gaps? Think? Let it be?</p>",
            "length": "3669456",
            "sourceUrl": "http://podcasts.sbinstitute.com/spring2011/podcast-audio/41morning.mp3"
        },
        {
            "title": "80 Equanimity and Rigpa",
            "datePublished": "Thu, 26 May 2011 18:17:25 +0700",
            "description": "<p>Alan begins this afternoon session with a profoundly wise and skillful dharma talk on the deepest kind of equanimity: that which is viewed from the perspective of rigpa. This 55 minute talk is followed by the unguided meditation (not included) and one question from the group:</p>\n\n<p>Sometimes I rephrase your guided meditation questions to suit myself. Is this okay?</p>",
            "length": "31374094",
            "sourceUrl": "http://podcasts.sbinstitute.com/spring2011/podcast-audio/40afternoon.mp3"
        },
        {
            "title": "79 Spatial Awareness of Awareness",
            "datePublished": "Thu, 26 May 2011 09:43:19 +0700",
            "description": "This morning we return to the final phase of the awareness of awareness practice: exploring this awareness spatially. Alan first reviews the technique for the practice. The unguided meditation is not included.",
            "length": "6242837",
            "sourceUrl": "http://podcasts.sbinstitute.com/spring2011/podcast-audio/40morning.mp3"
        },
        {
            "title": "78 Equanimity and Imperturbability",
            "datePublished": "Wed, 25 May 2011 18:20:39 +0700",
            "description": "<p>This afternoon, Alan Wallace sets up a meditation on equanimity, or uppekha, in two parts. First, bringing to mind situations in our lives that arouse aversion and craving, then imagining maintaining equanimity, and reflecting upon right action in those situations. Second, attending to a wide array of beings with equanimity, allowing the awareness to settle and seeing who comes to mind.</p>\n\n<p>During the opening talk, Alan also reviews the four types of enlightened activity.</p>\n\n<p>The unguided meditation is not included in the recording.</p>\n\n<p>Question and answer begins at 38:14 in the recording.</p>\n\n<p>1. I'm confused about your statement that we go to the substrate consciousness without baggage. Did you mean our baggage is dormant?</p>\n\n<p>2. Can you offer any tips for a distracted mind during meditations on the four immeasurables?</p>\n\n<p>3. I've been spending a lot of time practicing on my back, and I think I may need to do this on an ongoing basis. Are there any practices you've taught that can't be done on the back?</p>\n\n<p>4. Can you talk briefly about one's root guru?</p>",
            "length": "33421515",
            "sourceUrl": "http://podcasts.sbinstitute.com/spring2011/podcast-audio/39afternoon.mp3"
        },
        {
            "title": "77 Breaking Through: Awareness of Awareness",
            "datePublished": "Wed, 25 May 2011 09:48:14 +0700",
            "description": "This morning we continue with the practice of awareness of awareness. Alan first gives an introduction, then brief final remarks after the unguided meditation. The unguided meditation is not included in the recording. All meditation sessions are 24 minutes long.",
            "length": "7488322",
            "sourceUrl": "http://podcasts.sbinstitute.com/spring2011/podcast-audio/39morning.mp3"
        },
        {
            "title": "76 Virtue and Mudita",
            "datePublished": "Tue, 24 May 2011 18:21:44 +0700",
            "description": "<p>This afternoon Alan Wallace again sets up an unguided meditation on mudita, or empathetic joy. He first gives a 40 minute dharma talk about skillfully attending to one's own virtues without reifying oneself in the process. </p>\n\n<p>The unguided meditation is not included in the recording.</p>\n\n<p>Alan then answers this question from the group (begins at 42:38 in the recording).</p>\n\n<p>1. Can you speak more about emptiness?</p>",
            "length": "33049939",
            "sourceUrl": "http://podcasts.sbinstitute.com/spring2011/podcast-audio/38afternoon.mp3"
        },
        {
            "title": "75 Shamatha Without a Sign",
            "datePublished": "Tue, 24 May 2011 09:44:41 +0700",
            "description": "<p>This morning Alan Wallace again introduces the practice of shamatha without a sign, or awareness of awareness, as taught by Padmasambhava. We are instructed to look right into our actual sense of being an agent.</p>\n\n<p>The following unguided meditation is not included in the recording.</p>",
            "length": "5133871",
            "sourceUrl": "http://podcasts.sbinstitute.com/spring2011/podcast-audio/38morning.mp3"
        },
        {
            "title": "74 Contentment and Mudita",
            "datePublished": "Mon, 23 May 2011 18:24:17 +0700",
            "description": "<p>This afternoon's session begins with a 50 minute Dharma talk in which Alan Wallace invites us to consider whether we are content, satisfied, perhaps even willing to rejoice in the current trajectory of our individual lives. He talks about balancing between the two extremes of being utterly disappointed with ourselves and being complacent with the way things are. He then explores the possibility of feeling gratitude towards the difficult people and circumstances which have impelled us to this present moment of mudita.</p>\n\n<p>The unguided meditation is not included in this recording. </p>\n\n<p>Q&A with the group begins at 49:10.</p>\n\n<p>1. Can you talk more about bracketing the practices that you call balancing earth and wind, and earth and sky? What is their source, what is their purpose, and what is the benefit?</p>",
            "length": "30605506",
            "sourceUrl": "http://podcasts.sbinstitute.com/spring2011/podcast-audio/37afternoon.mp3"
        },
        {
            "title": "73 Pure Being",
            "datePublished": "Mon, 23 May 2011 09:41:01 +0700",
            "description": "<p>In this morning's session we return to the practice of awareness of awareness. Alan first introduces the technique of oscillation between withdrawal from all appearances and release into space, or non-objectivity.</p>\n\n<p>The unguided meditation is not included.</p>",
            "length": "4479396",
            "sourceUrl": "http://podcasts.sbinstitute.com/spring2011/podcast-audio/37morning.mp3"
        },
        {
            "title": "72 The Origins of Suffering",
            "datePublished": "Sat, 21 May 2011 18:25:06 +0700",
            "description": "<p>This afternoon, Alan first gives a Dharma talk relating to the deepest type of suffering to which we are vulnerable: the pervasive suffering of composite, or conditioned, existence. He asks the question, \"Why do we suffer?\" and explores it from a theistic, materialistic, and then, in depth, a Buddhist perspective. Finally, he posits that in order to develop compassion for this type of deep suffering, we must believe in the possibility of freedom, and use skillful means to draw in this possibility. The skillful means he describes is the powerful of stage of generation practices from the Vajrayana.</p>\n\n<p>Unguided meditation begins at 43:20 in the recording, and the discussion and following Q&A picks back up at 1:10:57.</p>\n\n<p>1. The substrate consciousness is individual, yes? Are the substrate and Buddhanature also individual?</p>\n\n<p>2. When we imagine the Buddha as light, is that symbolic or real?</p>",
            "length": "46171629",
            "sourceUrl": "http://podcasts.sbinstitute.com/spring2011/podcast-audio/36afternoon.mp3"
        },
        {
            "title": "71 Settling the Mind, Phase Three",
            "datePublished": "Sat, 21 May 2011 09:45:48 +0700",
            "description": "This morning, Alan first reviews the practice of settling the mind in its natural state, both in theory and in practice. This is followed by an unguided meditation that begins at 12:00 in the recording.",
            "length": "18714009",
            "sourceUrl": "http://podcasts.sbinstitute.com/spring2011/podcast-audio/36morning.mp3"
        },
        {
            "title": "70 Responding to the Reality of Change",
            "datePublished": "Fri, 20 May 2011 18:14:55 +0700",
            "description": "<p>This afternoon, Alan first gives a lengthy Dharma talk about different methods for responding to the reality of change. He contrasts the materialistic and Buddhist views, and goes into detail about how attachment and grasping block one's ability to achieve freedom from the suffering of change.</p>\n\n<p>This is followed by an unguided meditation on compassion for the suffering of change.</p>\n\n<p>Editor's Note: The unguided meditation and brief Q&A session afterwards are not included in the recording due to a recording error.</p>",
            "length": "21650882",
            "sourceUrl": "http://podcasts.sbinstitute.com/spring2011/podcast-audio/35afternoon.mp3"
        },
        {
            "title": "69 The Power of Settling the Mind",
            "datePublished": "Fri, 20 May 2011 09:56:19 +0700",
            "description": "<p>Alan first speaks for 15 minutes about the benefits of the practice of settling the mind in its natural state and its use in freeing ourselves from our habitual propensities of craving, aversion, and delusion. He also talks about the skillful use of stage of generation practices in the context of settling the mind in its natural state.</p>\n\n<p>The unguided meditation begins at 16:20 in the recording.</p>",
            "length": "19962245",
            "sourceUrl": "http://podcasts.sbinstitute.com/spring2011/podcast-audio/35morning.mp3"
        },
        {
            "title": "68 Gaining Understanding, Insight, and Confidence",
            "datePublished": "Thu, 19 May 2011 18:26:05 +0700",
            "description": "<p>Alan begins this afternoon's session with a lengthy dharma talk on cultivating confidence in the practices, now that we have two full weeks of silent retreat remaining. He also sets up today's meditation on compassion for blatant suffering by speaking about different ways of responding to \"hedonic distress\" and \"genuine distress.\"</p>\n\n<p>The unguided meditation on compassion begins at 35:50 in the recording.</p>\n\n<p>Alan then answers these questions from the group, which begin at 1:04:30. </p>\n\n<p>1. When we achieve shamatha, what comes next in the hours, days and weeks ahead? When it is achieved, how easy is it to lose?</p>\n\n<p>2. How far from achieving shamatha to the first jhana? What will someone experience when entering the first jhana?</p>\n\n<p>3. Can you talk about lengthening practice sessions? I don't know how to increase without being performance driven.</p>",
            "length": "44245024",
            "sourceUrl": "http://podcasts.sbinstitute.com/spring2011/podcast-audio/34afternoon.mp3"
        },
        {
            "title": "67 Settling the Mind in its Natural State",
            "datePublished": "Thu, 19 May 2011 09:54:23 +0700",
            "description": "<p>This morning continues with unguided meditations. Alan first speaks briefly about the tendency to identify with the body and mind as oneself. This practice is particularly effective in eradicating this misunderstanding. It helps us move from, \"Buddhanature is something I have, but I'm really screwed up,\" to, \"Buddhanature is who I am, and the mental afflictions come and go.\"</p>\n\n<p>The unguided meditation begins at 10:45 in the recording.</p>",
            "length": "18062780",
            "sourceUrl": "http://podcasts.sbinstitute.com/spring2011/podcast-audio/34morning.mp3"
        },
        {
            "title": "66 Loving-Kindness and Feelings of Separation",
            "datePublished": "Wed, 18 May 2011 18:14:30 +0700",
            "description": "<p>Another unguided meditation this afternoon, first introduced with a description of the obstacle of feeling separate from others, and how this impedes the flow of loving-kindness.</p>\r\n\r\n<p>The unguided meditation begins at 9:20 in the recording.</p>\r\n\r\n<p>Alan then answers a number of questions from the group, beginning at 37:35 in the recording.</p>\r\n\r\n<p>1. Where does volition reside? It's not there when I look for it. It appears and disappears. </p>\r\n\r\n<p>2. In awareness of awareness practice, I bring my attention to the heart chakra. In loving-kindness practice, you talk about the heart. To me that's slightly different. Is there a distinction?</p>\r\n\r\n<p>3. When I allow my body to breathe without controlling my breath, it is often shallow and light. The practice of tonglen makes my breathing deeper, and this also happens with other visualization practices. Is this okay?</p>\r\n\r\n<p>4. Could you use as an object for shamatha the felt sense loving-kindness in the body?</p>\r\n\r\n<p>5. When doing mindfulness of breathing, I still have some chit-chat, some thoughts, and some images come to mind, but I am able to stay with the breath at least peripherally. When doing awareness of awareness, the chit-chat is still there but thoughts and images are not, it's like there isn't room for them. Why is this?</p>\r\n\r\n<p>6. When I do mindfulness of breathing at the nostrils, I get a nyam in which I feel like my left side is leaning over or dissolving. Is this pranic? Should I work through it , or stop the practice?</p>\r\n\r\n<p>7. In that same situation, if you get to stage four in shamatha but still can not do the practice of mindfulness of breathing attending to the nostrils, where would you go to progress?</p><img src=\"http://feeds.feedburner.com/~r/AlanWallaceSpring2011Shamatha/~4/D0rQgI5weAs\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "41669516",
            "sourceUrl": "http://podcasts.sbinstitute.com/spring2011/podcast-audio/33afternoon.mp3",
            "categories": [
                {
                    "_": "Uncategorized",
                    "$": {
                        "domain": "http://podcasts.sbinstitute.com/spring2011/?cat=1"
                    }
                }
            ]
        },
        {
            "title": "65 Vivid Mindfulness of Breathing",
            "datePublished": "Wed, 18 May 2011 09:43:28 +0700",
            "description": "<p>This morning, Alan first reviews the instructions for the third phase of mindfulness of breathing, with the attention placed on the sensations of the breath at the aperture of the nostrils. We then share a 24-minute unguided meditation. Enjoy!</p>\n\n<p>Unguided meditation begins at 8:45 in the recording.</p>",
            "length": "16383490",
            "sourceUrl": "http://podcasts.sbinstitute.com/spring2011/podcast-audio/33morning.mp3"
        },
        {
            "title": "64 Loving-Kindness and Q&A",
            "datePublished": "Tue, 17 May 2011 18:22:00 +0700",
            "description": "<p>This afternoon we continue with unguided meditations. Alan first reviews the meditation on loving-kindness for others in the tradition of Buddhaghosa, first for oneself, then a dearly loved friend, then a neutral person, and finally a difficult person. Alan also invites us to hold space to see who else might arise and attend to them with loving-kindness.</p>\n\n<p>The unguided meditation begins at 17:40 in the recording, and Q&A begins at 45:30.</p>\n\n<p>This is followed by these practical questions from the group:</p>\n\n<p>1. We have been using the visualization of the orb of light at the heart center. I'm finding that my heart is becoming tender and actually physically sore. I'm wondering if this happens, and whether I might be trying too hard?</p>\n\n<p>2. When balancing earth and sky or earth and wind, do we have to use the infirmary for the earth element, or can we use breathing at the abdomen?</p>\n\n<p>3. Regarding attending to more than one thing at a time. I notice, during meditation, it seems like I am attending to two things at the same time, for example, the breath and a thought. However, I know that it isn't possible to attend to two things at the same time. So I am curious about the nature of attention, and how it is that I feel like I am both with the breath and with the thought.</p>",
            "length": "44811621",
            "sourceUrl": "http://podcasts.sbinstitute.com/spring2011/podcast-audio/32afternoon.mp3"
        },
        {
            "title": "63 Mindfulness of Breathing, Phase Two",
            "datePublished": "Tue, 17 May 2011 09:44:48 +0700",
            "description": "<p>This morning, Alan first reviews the practice of mindfulness of breathing, the second phase, with its emphasis on the somatic sensations of the breath in the abdomen, while maintaining relaxation and increasing stability. This is followed by an unguided 24-minute meditation, and then Alan reminds us to maintain our mindfulness between sessions by bringing our awareness to the breath and the tactile sensations of the body, releasing the flow of conceptual thinking associated with obsessive-compulsive-delusional-disorder.</p>\n\n<p>The unguided meditation begins at 8:40 in the recording.</p>",
            "length": "17583331",
            "sourceUrl": "http://podcasts.sbinstitute.com/spring2011/podcast-audio/32morning.mp3"
        },
        {
            "title": "62 Sleepitation, Loving-Kindness, and Q&A",
            "datePublished": "Mon, 16 May 2011 18:19:17 +0700",
            "description": "<p>In this afternoon's session, Alan first gives advice on the sleep imbalances that can arise during retreat (or outside of retreat) and introduces us to the practice of \"sleepitation\" to ground oneself in the earth element and relax deeply when trying to sleep. He then reviews the instructions of loving-kindness for oneself in detail, after which we share an unguided 24-minute meditation on loving-kindness.</p>\n\n<p>The unguided meditation begins at 18:40.\n<br />Q&A begins at 47:15.</p>\n\n<p>Alan then answers questions from this morning's practice of mindfulness of breathing, the first stage:</p>\n\n<p>1. In the part of the practice when you feel the breath where it is strongest, for me it is the abdomen. This means the practice feels just like stage two of mindfulness of breathing. Is this right?</p>\n\n<p>2. I've been getting headaches for a few days. I know they are being caused by tension, but I can't find the source of the tension, and meditating in the infirmary does not help. </p>\n\n<p>3. In \"The Attention Revolution\" you say you should notice if the breath is long or short. Is this like counting the breaths, something you drop after some time?</p>\n\n<p>4. When I do mindfulness of breathing, I usually keep my eyes closed. This morning, they kept opening -- I have no idea why -- but it was very distracting.</p>\n\n<p>5. When I experience medium excitation during mindfulness of breathing, usually the third stage (attending to the breath at the nostrils), and I am in the flow of the practice, and only medium excitation sets in, the thoughts still take me away, but in the background I am aware of the breath. When this happens, I feel that the experience of this medium excitation is the same as course excitation -- the volume and intensity of the thought is the same, although I still have some peripheral awareness of the breath.</p>",
            "length": "44825395",
            "sourceUrl": "http://podcasts.sbinstitute.com/spring2011/podcast-audio/31afternoon.mp3"
        },
        {
            "title": "61 The Cultivation of Relaxation",
            "datePublished": "Mon, 16 May 2011 10:05:40 +0700",
            "description": "<p>The next three morning sessions will be unguided meditations on the first three stages of mindfulness of breathing. This morning, Alan first speaks briefly about the importance of the cultivation of relaxation. </p>\n\n<p>The unguided meditation (included) begins at 8:00 in the recording. Recording quality improves significantly at 2:00.</p>",
            "length": "16342195",
            "sourceUrl": "http://podcasts.sbinstitute.com/spring2011/podcast-audio/31morning.mp3"
        },
        {
            "title": "60 Even-Heartedness for All Sentient Beings",
            "datePublished": "Sat, 14 May 2011 18:20:11 +0700",
            "description": "<p>In this session, we approach the immeasurable of equanimity from a Mahayana perspective, using the practice of tonglen (sending and receiving) to attend to individual sentient beings.</p>\n\n<p>The guided meditation begins at 7:10 in the recording.</p>\n\n<p>Alan then answers these questions from the group:</p>\n\n<p>1. What is the relationship between the four immeasurable and bodhicitta?</p>\n\n<p>2. What about dedicating the merit? Do you have any special recommendations in the context of retreat? After each session? At the end of the day?</p>\n\n<p>3. Sometimes I fall asleep lucidly without dreams. Is there a difference between being in a lucid dream, and being asleep lucidly without dreams? Also, last night I became aware of being asleep -- I had my senses, could feel myself breathing, see myself sleeping in my mind's eye. What was happening?</p>\n\n<p>4. You mentioned earlier about how the four immeasurable can balance and complement each other. I love that weaving together. For example, during a meditation on equanimity, I saw indifference coming up, so I arose the immeasurable of compassion for some time before returning to equanimity. Can you say more about this balance, and how you work with segways between the four immeasurable, as well as the sources of these segways?</p>\n\n<p>5. Can you talk about the relativity of space and time? I know, for me, these last five weeks have gone by very quickly, while for others, they have not.</p>",
            "length": "43327938",
            "sourceUrl": "http://podcasts.sbinstitute.com/spring2011/podcast-audio/30afternoon.mp3"
        },
        {
            "title": "59 Expanding One's Awareness of Awareness",
            "datePublished": "Sat, 14 May 2011 09:43:19 +0700",
            "description": "<p>In this morning session, Alan Wallace guides a meditation on the awareness of awareness practice. Today, we intentionally send our awareness above, to the right, to the left, below, to the heart center, and then out into space.</p>\n\n<p>The guided meditation begins at 4:22 in the recording.</p>",
            "length": "14104412",
            "sourceUrl": "http://podcasts.sbinstitute.com/spring2011/podcast-audio/30morning.mp3"
        },
        {
            "title": "58 Emotional Equilibrium and Mental Imperturbability ",
            "datePublished": "Fri, 13 May 2011 18:28:53 +0700",
            "description": "<p>Alan Wallace begins this afternoon's session with the question, \"When a desire arises, how does one know whether it is desire (wholesome) or craving (unwholesome)?\" He explores practical answers to this question, then proceeds to a guided meditation on the immeasurable of uppekha, or equanimity, focusing on a Theravaden approach, cultivating an evenness of mental imperturbability, a mind unaffected by mental afflictions.</p>\n\n<p>The guided meditation begins at 14:37 in the recording.</p>\n\n<p>Afterwards, Alan gives an interesting and engaging answer to this question from the group:</p>\n\n<p>1. Any time I've heard the question, \"How or why did ignorance-marigpa begin?\" the answer given is that, \"It never began; time is beginningless, and the dharmakaya and ignorance have just always existed, neither came first.\" And then, from the teacher, \"And why do you want a beginning or first moment anyway?!\" </p>\n\n<p>I can accept the notion of beginningless time - ie: present moment arising from the previous ad infinitum, and that from the perspective of Rigpa, its not really happening anyway - at least, that it IS a dream, but I still have difficulty with how marigpa ever happened at all, and if self-grasping is \"prior\" to the objectification of appearances, how did \"karma's stirring\" give rise to Substrate Consciousness?</p>\n\n<p>Do you have any insight, or is there insight from psychology perhaps as to why we \"want\" a beginning?</p>\n\n<p>PS: Do these questions really matter, or should I just sit down, shut up, and watch my breath?</p>",
            "length": "45247969",
            "sourceUrl": "http://podcasts.sbinstitute.com/spring2011/podcast-audio/29afternoon.mp3"
        },
        {
            "title": "57 The Witness of Awareness (of Awareness)",
            "datePublished": "Fri, 13 May 2011 09:51:15 +0700",
            "description": "<p>In this morning session, Alan Wallace guides a meditation of awareness of awareness, focusing on the lived sense, the actual sense one has, of being the witness, or observer, of all that is 'over there' while one feels oneself is 'over here.'</p>\n\n<p>The guided meditation begins at 7:26 in the recording.</p>",
            "length": "16483574",
            "sourceUrl": "http://podcasts.sbinstitute.com/spring2011/podcast-audio/29morning.mp3"
        },
        {
            "title": "56 Empathetic Joy for the Causes and Fruits of Happiness",
            "datePublished": "Thu, 12 May 2011 18:21:51 +0700",
            "description": "<p>In this session, Alan Wallace guides a meditation on empathetic joy, emphasizing taking delight and joy in both the causes of genuine happiness and the material fruits of this happiness. In his introduction, he also speaks about the importance and meaning of path, and the question of how to develop a deep enough aspiration to clarify this path.</p>\n\n<p>The guided meditation begins at 22:45 in the recording.</p>\n\n<p>Alan then answers these questions from the group:</p>\n\n<p>1. In the awareness of awareness practice, you asked us questions this morning, such as, \"who do you think you are?\" Should I be taking these questions into a contemplation on the spot?</p>\n\n<p>2. When we meditate on an object for a while, and then after some time we fall away from it, should we use effort to bring the object back, or instead relax and trust that the object will return on its own?</p>\n\n<p>3. The Bodhisattva's commitment to stay in this world until all beings achieve enlightenment seems like a kamikaze mission… [This question becomes more of a dialogue.]</p>\n\n<p>4. In shamatha, with respect to vipassana, and particularly stream entry, for vipassana to be fully effective, shamatha is required. What does the first jhana bring for more benefit to stream entry, and can stream entry be accomplished without shamatha?</p>\n\n<p>5. At the point of achieving shamatha, what is the heaviness on the head?</p>",
            "length": "44384278",
            "sourceUrl": "http://podcasts.sbinstitute.com/spring2011/podcast-audio/28afternoon.mp3"
        },
        {
            "title": "55 The Second Phase of Awareness of Awareness",
            "datePublished": "Thu, 12 May 2011 10:02:22 +0700",
            "description": "<p>In this morning session, we follow Padmasambhava's teachings in this second phase of the awareness of awareness practice. Our quest is not to look and find nothing, but rather to look for something that does exist: the \"lived sense\" of \"I am the agent.\" We then scrutinize this sense. Is it authentic or delusional? Does it correspond to an actual agent?</p>\n\n<p>The guided meditation begins at 26:10 in the recording.</p>",
            "length": "24876463",
            "sourceUrl": "http://podcasts.sbinstitute.com/spring2011/podcast-audio/28morning.mp3"
        },
        {
            "title": "54 Taking Delight in Good Fortune",
            "datePublished": "Wed, 11 May 2011 18:39:46 +0700",
            "description": "<p>In this session, Alan Wallace guides a meditation on mudita, or empathetic joy. He first speaks for some time about the opportunity of a precious human birth, and the power contemplating this opportunity has to shift the mind towards gratitude and delight.</p>\n\n<p>The guided meditation begins at 21:55 in the recording.</p>\n\n<p>Alan then answers these questions from the group:</p>\n\n<p>1. When we are practicing settling the mind in its natural state, thoughts always come. Do them come from the substrate consciousness or the space of the mind? </p>\n\n<p>and</p>\n\n<p>In awareness of awareness, is this awareness from rigpa or substrate?</p>\n\n<p>2. Is awareness of awareness equivalent to the skandha of consciousness?</p>\n\n<p>Is it essentially rigpa?</p>\n\n<p>If so, do other phenomena manifest rigpa differently?</p>\n\n<p>Is that which concentrates equivalent to or associated with volition?</p>\n\n<p>3. In awareness of awareness, I find it difficult to divorce the physical from what I'm doing. When releasing, I feel my body relaxing, and then when withdrawing, I feel my body tensing up. I don't know how to separate from these physical feelings.</p>",
            "length": "46798133",
            "sourceUrl": "http://podcasts.sbinstitute.com/spring2011/podcast-audio/27afternoon.mp3"
        },
        {
            "title": "53 Awareness of Awareness",
            "datePublished": "Wed, 11 May 2011 10:04:47 +0700",
            "description": "<p>We again begin to explore the practice of awareness of awareness in this teaching and guided meditation with Alan Wallace. He speaks for a short while before the guided meditation about the significance of this practice.</p>\n\n<p>The guided meditation begins at 13:50 in the recording.</p>",
            "length": "19226001",
            "sourceUrl": "http://podcasts.sbinstitute.com/spring2011/podcast-audio/27morning.mp3"
        },
        {
            "title": "52 Wisdom and Compassion",
            "datePublished": "Tue, 10 May 2011 18:37:09 +0700",
            "description": "<p>In this teaching, Alan Wallace guides a meditation on compassion for the deepest kind of suffering: the suffering of conditioned existence. He informs us that the cultivation of wisdom from insight is a prerequisite for this compassion; the sense that it is possible to wake up, to realize true freedom. </p>\n\n<p>The guided meditation begins 29:08 at in the recording.</p>\n\n<p>Editor's Note: The first three minutes of this session may be difficult for some to hear due to a recording error.</p>\n\n<p>Alan then answers these questions:</p>\n\n<p>1. When in awareness of awareness, we withdraw from all appearances and objectifications of our mind dissolve into the substrate consciousness. But only achieving shamatha, at the end of the shamatha trek, our mind has dissolved into a more essential and less configured consciousness. Can you please be more specific about the different \"stages of dissolution\" along this trek to destination?</p>\n\n<p>2. In this morning's meditation, we were instructed to observe the space of the mind and the objects that arise in it without alteration. I know that quantum physics has discovered that inherent in observation itself is a changing of the observed, and some scientists today are questioning the scientific method itself, wondering if we do not alter experiments by observation. If this is true, is it really possible to observer ourselves without alteration?</p>",
            "length": "44198050",
            "sourceUrl": "http://podcasts.sbinstitute.com/spring2011/podcast-audio/26afternoon.mp3"
        },
        {
            "title": "51 Observing the Space of the Mind",
            "datePublished": "Tue, 10 May 2011 09:49:07 +0700",
            "description": "<p>We continue to practice setting the mind in its natural state, today focusing on observing the space of the mind without alteration.</p>\n\n<p>The guided meditation begins at 9:20 in the recording.</p>",
            "length": "17494734",
            "sourceUrl": "http://podcasts.sbinstitute.com/spring2011/podcast-audio/26morning.mp3"
        },
        {
            "title": "50 Attachment and Compassion",
            "datePublished": "Mon, 09 May 2011 18:33:33 +0700",
            "description": "<p>Today's session begins with an inspiring and lucid twenty-minute dharma talk about the four noble truths, particularly the first three noble truths. This is followed by a guided meditation on the immeasurable of compassion, focusing on the suffering of change because of attachment to the way things are or are not.</p>\n\n<p>The guided meditation begins at 21:45 in the recording.</p>\n\n<p>Alan then answers these questions from the group:</p>\n\n<p>1. In \"The Attention Revolution\" in chapter 7, you talk about, when settling the mind, looking at craving, hostility and delusion, and being able to see the bliss, luminosity, and non-conceptuality underlying those things. I don't know how to do that.</p>\n\n<p>2. How should I use a dream journal when I'm waking up throughout the night and remembering dreams - as well as in the morning when I am supposed to keep still and relax back into the dream?</p>\n\n<p>3. In your teachings, you often cite your source for a particular idea or practice. In the book \"Destructive Emotions\" by Daniel Goleman, Goleman says in the introduction that you attended a retreat with S. N. Goenka, which inspired your devotion to practice. Can you tell us about the sources of Goenka's teachings? Is it based on the four applications of mindfulness? Is it a shamatha practice?</p>",
            "length": "47745896",
            "sourceUrl": "http://podcasts.sbinstitute.com/spring2011/podcast-audio/25afternoon.mp3"
        },
        {
            "title": "49 Settling the Mind in its Natural State",
            "datePublished": "Mon, 09 May 2011 09:56:36 +0700",
            "description": "<p>Alan Wallace guides a 24-minute guided meditation on settling the mind in its natural state. He first introduces the practice of applying this quality of awareness to our experiences engaging with others.</p>\n\n<p>The guided meditation begins at 14:17 in the recording.</p>",
            "length": "19250031",
            "sourceUrl": "http://podcasts.sbinstitute.com/spring2011/podcast-audio/25morning.mp3"
        },
        {
            "title": "48 Compassion and Freedom from Blatant Suffering",
            "datePublished": "Sat, 07 May 2011 18:29:46 +0700",
            "description": "<p>Alan Wallace begins today's teaching with a 40-minute dharma talk that could be titled, \"Retreat and Expedition Approaches to Freedom from Blatant Suffering.\" In this engaging talk, Alan surveys the history of these approaches and explores the mechanisms and effects of shamatha and vipassana.</p>\n\n<p>He then guides a meditation on compassion, first wishing ourselves freedom from blatant suffering, then on to others, working both spatially and allowing others to simply appear, \"invite themselves in,\" to our meditation.</p>\n\n<p>The guided meditation begins at 41:00 in the recording.</p>\n\n<p>He answers two questions from the group, the first of which refers to the notes available on the Santa Barbara Institute's website at http://sbinstitute.com/PodcastNotes/PodcastNotes.html and is titled \"Three New Methods.\" </p>\n\n<p>1. Could you explain the following excerpt from Buddhaghosa's commentary on Sati, especially the underlined parts.</p>\n\n<p>\"Its characteristic is not floating; its property is not losing; its manifestation is guarding or the state of being face to face with an object; its basis is strong noting or the close applications of mindfulness of the body and so on. It should be seen as like a post due to its state of being set in the object, and as like a gatekeeper because it guards the gate of the eye and so on.\"</p>\n\n<p>2. What do you mean (in Chapter 4 of Attention Revolution) by saying that, \"[Through the achievement or the power of mindfulness at stage 4] the practice comes into its own.\" Could you use a synonym for that?</p>",
            "length": "43487602",
            "sourceUrl": "http://podcasts.sbinstitute.com/spring2011/podcast-audio/24afternoon.mp3"
        },
        {
            "title": "47 In The Seen, Let There Be Just The Seen",
            "datePublished": "Sat, 07 May 2011 10:01:09 +0700",
            "description": "<p>We return to the practice of settling the mind in its natural state. In the guided meditation, we bring the quality of quiet, bare attention to the visual, auditory, tactile, and then the mental field. In each domain, we allow there to be the simplicity of \"in the heard, let there be just the heard\" and so on.</p>\n\n<p>The guided meditation begins at 7:45 in the recording.</p>\n\n<p>After the guided meditation, Alan speaks freely for a while, encouraging us not to grasp onto anything which is not in our control. He also speaks about the process of gaining mastery over one's own rigpa.</p>",
            "length": "21224739",
            "sourceUrl": "http://podcasts.sbinstitute.com/spring2011/podcast-audio/24morning.mp3"
        },
        {
            "title": "46 Boundless Loving-Kindness",
            "datePublished": "Fri, 06 May 2011 18:35:57 +0700",
            "description": "<p>This simple approach to loving-kindness was taught by the Buddha himself. We will be extending the awareness out spatially in all directions -- without bounds -- but first requesting that we be free of animosity (the distant enemy of loving-kindness).</p>\n\n<p>Alan tells us about how Matthieu Ricard once said, in the context of compassion practice (but the statement is analogous to loving-kindness practice) that one way you know the practice is working, that it's been more than an intellectual exercise, is that if you find, as a result of your meditation, when your meditation comes to a close and you venture out, engaging with other sentient beings, you're actually poised to serve the needs of others, to alleviate someone's distress, if that's a possibility.</p>\n\n<p>The guided meditation begins at 13:34 in the recording.</p>\n\n<p>Alan then answers these questions from the group:</p>\n\n<p>1. What is the acquired sign?</p>\n\n<p>2. Why, when you're meditating so quietly, does the breath become so subtle?</p>\n\n<p>3. I'm eating less to lose weight, but I feel I can't meditate as well with less food. Why?</p>\n\n<p>4. What do you think about the Amitabha Pure Land, and how does it relate to Dzog Chen?</p>\n\n<p>5. You said that one can achieve shamatha by single-pointed concentration on loving-kindness. What is the extra benefit of achieving shamatha in this way?</p>\n\n<p>and</p>\n\n<p>How do you know when you're ready to achieve shamatha?</p>\n\n<p>6. You spoke yesterday about the effervesce of the space of awareness that one notices when examining the space of the mind. Do you get this in awareness of awareness also?</p>",
            "length": "44251998",
            "sourceUrl": "http://podcasts.sbinstitute.com/spring2011/podcast-audio/23afternoon.mp3"
        },
        {
            "title": "45 Increasing Vividness with Mindfulness of Breathing",
            "datePublished": "Fri, 06 May 2011 10:06:06 +0700",
            "description": "<p>Alan Wallace guides in the third phase of mindfulness of breathing, which focuses on enhancing vividness without sacrificing stability. During this meditation, we place our awareness on the sensation of breath at the aperture of the nostrils. Alan reminds us that relaxation remains essential and to maintain a relaxed body, especially the facial muscles, during this practice.</p>\n\n<p>The guided meditation begins at 5:08 in the recording.</p>",
            "length": "15497089",
            "sourceUrl": "http://podcasts.sbinstitute.com/spring2011/podcast-audio/23morning.mp3"
        },
        {
            "title": "44 Breaking Barriers with Loving-Kindness",
            "datePublished": "Thu, 05 May 2011 18:25:21 +0700",
            "description": "<p>In this guided meditation, we follow in the footsteps of Buddhaghosa, expressing loving-kindness sequentially, from ourselves, to a very dear loved one, a more casual loved one, and then out and out until all barriers are broken down and our wish for others' well being is equally distributed. Alan also reminds us that the use of visualization during this meditation is not fundamentally required.</p>\n\n<p>The guided meditation begins at 12:05 in the recording.</p>\n\n<p>Alan then speaks freely for a short time about the skill of lucid dreaming, following up on his brief introduction on lucid dreaming that was given at the very end of yesterday evening's teaching (#42).</p>\n\n<p>Alan then answers these questions from the group:</p>\n\n<p>1. You spoke of the \"eyes of wisdom\" during this guided meditation. I find that I'm not sure I'm using the eyes of wisdom when examining others - especially neutral people - because I find it is easier to see some endearing qualities than others, and I imagine the eyes of wisdom are equanimous. Can you elaborate on the expression of the eyes of wisdom?</p>\n\n<p>2. In the awareness of awareness practice, we are focusing on the awareness that moves with the breath. If we are aware of this awareness that is moving with the breath, sometimes I have an experience of something sucking the awareness…</p>\n\n<p>3. In the phases of mindfulness of breathing, you encourage a balance of relaxation, stability and vividness. I find I'm able to maintain this balance fairly well. If I want to apply this balance to the practice of settling the mind, how would I do that?</p>\n\n<p>4. When meditating in the supine position, I feel like the ground is shaking under me - like there is an earthquake - quite often. What is this?</p>",
            "length": "44615391",
            "sourceUrl": "http://podcasts.sbinstitute.com/spring2011/podcast-audio/22afternoon.mp3"
        },
        {
            "title": "43 Grounding in Mindfulness of Breathing",
            "datePublished": "Thu, 05 May 2011 09:46:35 +0700",
            "description": "<p>In this session, Alan Wallace guides us through the second method of mindfulness of breathing, which focuses on grounding one's attention in the sensations of breath in the abdomen. He reminds us that doing this practice alone can take us through stage four in the stages of shamatha (detailed in his book, \"The Attention Revolution\").</p>\n\n<p>The guided meditation begins at 9:20 in the recording.</p>",
            "length": "16861017",
            "sourceUrl": "http://podcasts.sbinstitute.com/spring2011/podcast-audio/22morning.mp3"
        },
        {
            "title": "42 Imagining Loving-Kindness for Oneself",
            "datePublished": "Wed, 04 May 2011 18:23:47 +0700",
            "description": "<p>Alan Wallace guides us through the immeasurable of loving-kindness, leading us to imagine our own happiness both on a hedonic and a deeper level.</p>\n\n<p>The guided meditation begins at 9:50 in the recording.</p>\n\n<p>He then answers the following questions from the group:</p>\n\n<p>1. Can you elaborate on the use of imagery to stabilize meditation?</p>\n\n<p>2. Almost every evening you say \"Let your awareness descend into the body as your first act of loving-kindness.\" My question is, where is the awareness, and is it a cultural dysfunction that it isn't with us?</p>\n\n<p>3. When doing the stretching exercise in awareness of awareness, we go in many directions (left, right, up, down) but not forwards and backwards. Why?</p>\n\n<p>4. In the same practice, why, when we come back after stretching in one direction, does our awareness \"release\" instead of returning the way it came?</p>\n\n<p>5. I'm always flummoxed when we do a loving-kindness meditation like today, and you ask us to ask for what we want and need. I feel I have everything I want and need, and I see how others live with so much less, so I don't want to ask for more.</p>\n\n<p>6. Is our dreaming awareness different from our waking awareness?</p>",
            "length": "45001729",
            "sourceUrl": "http://podcasts.sbinstitute.com/spring2011/podcast-audio/21afternoon.mp3"
        },
        {
            "title": "41 Settling Body, Speech and Mind in their Natural State",
            "datePublished": "Wed, 04 May 2011 10:02:54 +0700",
            "description": "<p>We return again to the beginning of the 10-session cycle of guided meditations on shamatha with settling the body, speech and mind in their natural state.</p>\n\n<p>Guided meditation begins at 10:50 in the recording.</p>",
            "length": "17531309",
            "sourceUrl": "http://podcasts.sbinstitute.com/spring2011/podcast-audio/21morningb.mp3"
        },
        {
            "title": "40 Equanimity, Loving-Kindness, and Compassion",
            "datePublished": "Tue, 03 May 2011 18:31:50 +0700",
            "description": "<p>During the first part of this podcast, Alan Wallace guides us through a meditation on equanimity, blending the other immeasurable of loving-kindness and compassion to create a beautiful trio.</p>\n\n<p>The guided meditation begins at 9:48 in the recording.</p>\n\n<p>Following the meditation, Alan speaks freely for a short while and then answers these questions from the group:</p>\n\n<p>1. Can you please comment on forgiveness and the role for apology in the Buddhist view?</p>\n\n<p>2. I'm seeing that I need much more sleep at night here than I do in the outside world, and I'm also napping during the day. Should I go with the flow or try to cut back?</p>\n\n<p>3. Can hypnogogic imagery be useful on the path?</p>\n\n<p>4. What is the Buddhist point of view on out of body experiences?</p>",
            "length": "44449845",
            "sourceUrl": "http://podcasts.sbinstitute.com/spring2011/podcast-audio/20afternoon.mp3"
        },
        {
            "title": "39 Stretching Awareness of Awareness",
            "datePublished": "Tue, 03 May 2011 09:49:17 +0700",
            "description": "<p>This morning, Alan Wallace guides a meditation on the awareness of awareness, teaching us to expand and stretch this awareness spatially, literally increasing the space of the mind.</p>\n\n<p>The guided meditation begins at 6:50 in the recording.</p>",
            "length": "17272788",
            "sourceUrl": "http://podcasts.sbinstitute.com/spring2011/podcast-audio/20morning.mp3"
        },
        {
            "title": "38 Cultivating Equanimity Towards All",
            "datePublished": "Mon, 02 May 2011 18:37:30 +0700",
            "description": "<p>In the initial guided meditation on equanimity, Alan Wallace encourages us to use wisdom to discern the difference between behavior and the person expressing that behavior.</p>\n\n<p>The guided meditation begins at 12:50 in the recording.</p>\n\n<p>During the following Q&A, Alan answers these questions from the group:</p>\n\n<p>1. I've been wondering about Buddha Maitreya. You said he would be the 5th Buddha in this cycle of Buddhas, and you also mentioned 13 other Buddhas the other day. Why don't they count?</p>\n\n<p>2. Can you clarify the experience of resting in the space of the mind versus resting in awareness? In my own experience, they are very similar.</p>\n\n<p>3. Buddha Shakyamuni was a very educated person, yet he did not write any books or other writings. Why?</p>\n\n<p>4. In \"The Attention Revolution\", you lay out a suggestion for using the three methods in terms of progressing through the different stages. Would it be fair to call that a theory, and how have people in retreat used that method?</p>\n\n<p>5. What does \"o lasso\" mean?</p>",
            "length": "43220448",
            "sourceUrl": "http://podcasts.sbinstitute.com/spring2011/podcast-audio/19afternoon.mp3"
        },
        {
            "title": "37 The Observer and Awareness of Awareness",
            "datePublished": "Mon, 02 May 2011 09:54:51 +0700",
            "description": "<p>During this morning session with Alan Wallace, we are led in a guided meditation on awareness of awareness. Within this context, we probe deeply into our experience of being the observer, and ask the question, \"Who is observing?\"</p>\n\n<p>Guided meditation begins at 8:20 in the recording.</p>",
            "length": "18212767",
            "sourceUrl": "http://podcasts.sbinstitute.com/spring2011/podcast-audio/19morning.mp3"
        },
        {
            "title": "36 The Roots of Empathetic Joy",
            "datePublished": "Sat, 30 Apr 2011 18:24:42 +0700",
            "description": "<p>This afternoon's guided meditation on the immeasurable of empathetic joy focuses on cultivating the underlying causes of genuine happiness and flourishing. Alan Wallace reminds us that Tsongkhapa said that the easiest and most effective way to empower and energize one's practice is to take delight and satisfaction in it.</p>\n\n<p>The guided meditation begins at 12:30 in the recording.</p>\n\n<p>After the guided meditation, Alan answers these questions from the group:</p>\n\n<p>1. Can you expand on the concept of collective karma that you mentioned recently?</p>\n\n<p>2. Does Buddhism have a concept of free will, and how does this relate to non-self?</p>\n\n<p>3. When I'm dwelling in the space of the mind, suddenly I remember that I am supposed to exhale and release, and I lose the concept of dwelling in the space of the mind. Then I'll just forget about exhaling anything, and breath and maintain awareness in this space...</p>\n\n<p>4. In the practice of awareness of awareness, is there a difference in the way you release thoughts as compared to the practice of mindfulness of breathing?</p>\n\n<p>5. Can you describe a different way of doing tonglen (sending and receiving) for those who, like myself, have difficulty letting go of (or allowing the incineration of) the suffering that is drawn in on the in-breath?</p>\n\n<p>6. You've used the term \"sealing the path\" often - what does this mean and how does it relate to stream entry?</p>",
            "length": "44412330",
            "sourceUrl": "http://podcasts.sbinstitute.com/spring2011/podcast-audio/18afternoon.mp3"
        },
        {
            "title": "35 Awareness of Awareness",
            "datePublished": "Sat, 30 Apr 2011 10:07:09 +0700",
            "description": "<p>Alan Wallace guides a 24-minute meditation on awareness of awareness, teaching us to invert the awareness deeply, attending closely to the evidence of someone - an agent - in one's mind that stands apart from and somehow controls the body and mind.</p>\r\n\r\n<p>Guided meditation begins at 5:20 in the recording.</p>\r\n\r\n<p>Editor's Note: Due to a recording error, this session may be difficult to for some to hear clearly. Our sincere apologies.</p><img src=\"http://feeds.feedburner.com/~r/AlanWallaceSpring2011Shamatha/~4/lGssUr0rJn0\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "14651864",
            "sourceUrl": "http://podcasts.sbinstitute.com/spring2011/podcast-audio/18morning.mp3",
            "categories": [
                {
                    "_": "Uncategorized",
                    "$": {
                        "domain": "http://podcasts.sbinstitute.com/spring2011/?cat=1"
                    }
                }
            ]
        },
        {
            "title": "34 Effusion of Empathetic Joy and Gratitude",
            "datePublished": "Fri, 29 Apr 2011 17:15:17 +0700",
            "description": "<p>This afternoon's teaching is presented by Michelle Seaver, guest teacher and student of Alan Wallace, while Alan is out of town for 24 hours. Alan will return to his regular teaching during the next podcast. Michelle Seaver attended one of the first 100-day shamatha retreats with Alan, continued on in a private 18-month retreat, and is now responsible for bringing mindfulness-based education to the Phuket International Academy School (currently K-8, with plans to be PreK-12).</p>\n\n<p>The guided meditation is on the practice of empathetic joy, the first phase, focusing on the effusion of empathetic joy and gratitude, first for oneself, and then out to others.</p>\n\n<p>The guided meditation begins at 0:38 in the recording.</p>\n\n<p>Michelle then answers this question:</p>\n\n<p>During the mindfulness of breathing practice, I find it easy to maintain a balance of relaxation, stability, and vividness. However, during the practices of settling the mind and awareness of awareness, I find it easy to be distracted and lose by balance. How should I work with this challenge?</p>",
            "length": "16076950",
            "sourceUrl": "http://podcasts.sbinstitute.com/spring2011/podcast-audio/17afternoon.mp3"
        },
        {
            "title": "33 Awareness of Awareness: Inversion",
            "datePublished": "Fri, 29 Apr 2011 09:37:22 +0700",
            "description": "<p>This morning's teaching is presented by Michelle Seaver, guest teacher and student of Alan Wallace, while Alan is out of town for 24 hours. Alan will return to his regular teaching schedule Saturday morning. Michelle Seaver attended one of the first 100-day shamatha retreats with Alan, continued on in a private 18-month retreat, and is now responsible for bringing mindfulness-based education to the Phuket International Academy School (currently K-8, with plans to be PreK-12).</p>\n\n<p>The guided meditation is on awareness of awareness, focusing on the process of inverting awareness upon itself and then releasing this awareness into space.</p>\n\n<p>Editor's Note: The first 90 seconds of the guided meditation are missing due to a recording error. During this time, an emphasis was placed on settling the body in its natural state, allowing the breath to be uncontrived and relaxing in this state.</p>",
            "length": "11106970",
            "sourceUrl": "http://podcasts.sbinstitute.com/spring2011/podcast-audio/17morning.mp3"
        },
        {
            "title": "32 Compassion at the Deepest Level",
            "datePublished": "Thu, 28 Apr 2011 17:46:19 +0700",
            "description": "<p>Today's teaching is presented by Michelle Seaver, guest teacher and student of Alan Wallace, while Alan is out of town for 24 hours. Alan will return to his regular teaching schedule Saturday morning. Michelle Seaver attended one of the first 100-day shamatha retreats with Alan, continued on in a private 18-month retreat, and is now responsible for bringing mindfulness-based education to the Phuket International Academy School (currently K-8, with plans to be PreK-12).</p>\n\n<p>The guided meditation is on compassion at the deepest level - the aspiration to be free of suffering caused by grasping.</p>\n\n<p>The meditation begins at 1:00 in the recording.</p>\n\n<p>Following the guided meditation, Michelle and Nick Seaver, her husband and CEO of the Phuket International Academy who also attended one of Alan's first 100-day shamatha retreats and followed it with an 18-month retreat, field these questions from the group:</p>\n\n<p>1. Can you tell us about your experience on a long-term shamatha retreat?</p>\n\n<p>2. About the meditation on awareness of awareness: when trying to focus on awareness, I realize that there is another awareness that is focusing on awareness, so this is no longer awareness. Can you help?</p>\n\n<p>3. What is the mission of the mind centre?</p>\n\n<p>4. Is debate, logic, and thinking included in your mindfulness based program in the school?</p>",
            "length": "23699784",
            "sourceUrl": "http://podcasts.sbinstitute.com/spring2011/podcast-audio/16afternoon.mp3"
        },
        {
            "title": "31 Settling the Mind in its Natural State",
            "datePublished": "Thu, 28 Apr 2011 09:54:03 +0700",
            "description": "<p>We explore the practice that Alan Wallace considers analogous in terms of understanding the mind to the telescope in terms of understanding what is in the heavens. We will focus on the relative dharmadatu, or the domain in which mental events take place, with mental consciousness, working towards refining this consciousness.</p>\n\n<p>Guided meditation begins at 7:50 in the recording.</p>",
            "length": "18116996",
            "sourceUrl": "http://podcasts.sbinstitute.com/spring2011/podcast-audio/16morning.mp3"
        },
        {
            "title": "30 Compassion and the Suffering of Change",
            "datePublished": "Wed, 27 Apr 2011 18:20:41 +0700",
            "description": "<p>Alan Wallace guides us in a 24-minute meditation on compassion, furthering this aspiration to recognize a deeper dimension of suffering -- the suffering of change. This type of suffering is brought about by attachment and craving.</p>\n\n<p>The meditation begins at 17:45 in the recording and is followed by a brief, silent meditation.</p>\n\n<p>Alan then speaks freely for a short while and then answers these questions:</p>\n\n<p>1. What are the minimum requirements to teach shamatha?</p>\n\n<p>2. At what point is the secularization of Buddhism skillful and useful?</p>\n\n<p>3. When you say that craving is always a seed of suffering, and I look at my own experience to examine this statement, while it is true often, sometimes it is not true. Can you help explain this?</p>",
            "length": "44371499",
            "sourceUrl": "http://podcasts.sbinstitute.com/spring2011/podcast-audio/15afternoon.mp3"
        },
        {
            "title": "29 Settling the Mind it its Natural State: Body to Mind",
            "datePublished": "Wed, 27 Apr 2011 10:28:25 +0700",
            "description": "<p>During this 24-minute guided meditation, Alan guides us in the practice of settling the mind in its natural state, beginning with the space of the body and moving to the space of the mind.</p>\n\n<p>The guided meditation begins at 10:10.</p>",
            "length": "18658663",
            "sourceUrl": "http://podcasts.sbinstitute.com/spring2011/podcast-audio/15morning.mp3"
        },
        {
            "title": "28 The Common Ground of Compassion",
            "datePublished": "Tue, 26 Apr 2011 18:45:30 +0700",
            "description": "<p>Alan Wallace guides a 24-minute meditation on compassion, asking the question, \"How can we be free from suffering?\" He teaches the use of a visualization of a radiant orb of light at one's heart, metaphorically representing one's own Buddhanature, into which one draws in one's own or others' suffering, and then observes its incineration in the blazing brilliance of the orb of light.</p>\n\n<p>The guided meditation begins at 19:40.</p>\n\n<p>After the meditation, Alan speaks freely for a while, then answers the following two questions:</p>\n\n<p>1. After hearing your story about the yogi who was totally supported in his pursuit of dharma, despite having no financial resources of his own, I am curious about the circumstances in which students of yours have been able to go into solitary retreat. How does one live a life of solitude in retreat?</p>\n\n<p>2. What is really happening in the practice we did today? Does it have any measurable effect outside of my mind? How do thoughts, feelings, and aspiration differ in their effects?</p>",
            "length": "48906352",
            "sourceUrl": "http://podcasts.sbinstitute.com/spring2011/podcast-audio/14afternoon.mp3"
        },
        {
            "title": "27 Settling the Mind in its Natural State",
            "datePublished": "Tue, 26 Apr 2011 09:54:17 +0700",
            "description": "In this 24-minute guided meditation, Alan Wallace teaches us to view our own minds, including the whole space of the mind and all of the events that arise within that, from the perspective of the substrate consciousness, as opposed to observing the conceptual mind from the perspective of the conceptual mind.",
            "length": "18131202",
            "sourceUrl": "http://podcasts.sbinstitute.com/spring2011/podcast-audio/14morning.mp3"
        },
        {
            "title": "26 Loving-Kindness Spatially",
            "datePublished": "Mon, 25 Apr 2011 18:48:05 +0700",
            "description": "<p>In this 24-minute guided meditation on loving-kindness, Alan Wallace focuses on sending this aspiration spatially, or through space in all directions, beginning with ourselves, and then out to those physically closest to us, and then further and further away.</p>\n\n<p>After the 24-minute meditation, a silent 10-minute meditation is shared by the group.</p>\n\n<p>Alan then answers the following question:</p>\n\n<p>If the substrate mind dissolves into rigpa -- which is non-conceptual -- how is the continuity of consciousness maintained through the bardo, etc., if the continuity is conceptual?</p>\n\n<p>Editor's Note: A brief (2-second) pause occurs in the beginning of the recording, due to a recording disk error.</p>",
            "length": "43280458",
            "sourceUrl": "http://podcasts.sbinstitute.com/spring2011/podcast-audio/13afternoon.mp3"
        },
        {
            "title": "25 Mindfulness of Breathing: The Classic Approach",
            "datePublished": "Mon, 25 Apr 2011 10:47:08 +0700",
            "description": "Alan Wallace guides a 24-minute meditation on mindfulness of breathing, focusing on the balance between increasing vividness and maintaining the stability of the mind, also without the loss of relaxation.",
            "length": "16637797",
            "sourceUrl": "http://podcasts.sbinstitute.com/spring2011/podcast-audio/13morning.mp3"
        },
        {
            "title": "24 Loving-kindness for Self and Others",
            "datePublished": "Sat, 23 Apr 2011 18:13:31 +0700",
            "description": "<p>Alan Wallace guides a 24-minute meditation on loving-kindness, first for oneself, and then ultimately in all directions without barriers. He discusses the catalyst for the aspiration of loving-kindness and the importance of living a life of virtue.</p>\n\n<p>He then answers the following questions from the group:</p>\n\n<p>1. While doing awareness of awareness practice, I don't see a difference between awareness and mind. What is the relationship between awareness and mind?</p>\n\n<p>2. Is it possible to achieve shamatha with the four immeasurable practices?</p>\n\n<p>3. In Dudjom Lingpa's \"Vajra Essence\", there is a shamatha practice in which you visualize a bindu at the heart center. Can you talk about that?</p>",
            "length": "43635842",
            "sourceUrl": "http://podcasts.sbinstitute.com/spring2011/podcast-audio/12afternoon.mp3"
        },
        {
            "title": "23 Mindfulness of Breathing: Grounding",
            "datePublished": "Sat, 23 Apr 2011 09:58:55 +0700",
            "description": "This 24-minute guided meditation on mindfulness of breathing focuses on the tactile sensation of the breath in the abdomen, balancing stability and relaxation.<img src=\"http://feeds.feedburner.com/~r/AlanWallaceSpring2011Shamatha/~4/9fItO8mWcCg\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "16236444",
            "sourceUrl": "http://podcasts.sbinstitute.com/spring2011/podcast-audio/12morning.mp3",
            "categories": [
                {
                    "_": "Uncategorized",
                    "$": {
                        "domain": "http://podcasts.sbinstitute.com/spring2011/?cat=1"
                    }
                }
            ]
        },
        {
            "title": "22 Loving-Kindness: Visualizing One's own Happiness",
            "datePublished": "Fri, 22 Apr 2011 18:00:02 +0700",
            "description": "<p>The immeasurable of loving-kindness is guided through a 24-minute meditation which focuses on envisioning the causes and conditions for one's own happiness, achieving this happiness, and then sharing this happiness with others.</p>\n\n<p>Alan then answers the following questions:</p>\n\n<p>1. How do we decide what length breaks to take between sessions? Also, I am getting sleepy after a few sessions - am I doing it wrong?</p>\n\n<p>2. How do you say awareness in Tibetan?</p>\n\n<p>3. When settling the mind in its natural state, where is awareness when I am thinking?</p>\n\n<p>4. Is it possible to think without awareness?</p>\n\n<p>5. A comment on diet and vegetarianism.</p>\n\n<p>6. I noticed that when practicing the stretching exercise during awareness of awareness, I sensed my whole energetic body was stretching out. What was that?</p>\n\n<p>7. What are your reasons for not using a Buddha image [a visualization practice] as a focus for meditation?</p>\n\n<p>8. Please point out if and how agitation [excitation] and dullness [laxity] differ for the three shamatha practices.</p>\n\n<p>9. In so far as overcoming excitation and laxity indicates achieving different stages of shamatha, must one do so in every type of shamatha to achieve that level?</p>",
            "length": "43599070",
            "sourceUrl": "http://podcasts.sbinstitute.com/spring2011/podcast-audio/11afternoon.mp3"
        },
        {
            "title": "21 Back to Basics: Mindfulness of Breathing",
            "datePublished": "Fri, 22 Apr 2011 09:44:16 +0700",
            "description": "We return to the beginning of our 10-day cycle, starting again with mindfulness of breathing. Going to what Alan Wallace refers to as 'the infirmary,' this 24-minute guided meditation on the breath encourages deep relaxation and a gentle but attentive letting go.<img src=\"http://feeds.feedburner.com/~r/AlanWallaceSpring2011Shamatha/~4/AtxvzfKDuqc\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "15578664",
            "sourceUrl": "http://podcasts.sbinstitute.com/spring2011/podcast-audio/11morning.mp3",
            "categories": [
                {
                    "_": "Uncategorized",
                    "$": {
                        "domain": "http://podcasts.sbinstitute.com/spring2011/?cat=1"
                    }
                }
            ]
        },
        {
            "title": "20 Equanimity Focused on Sentient Beings",
            "datePublished": "Thu, 21 Apr 2011 18:00:38 +0700",
            "description": "<p>In this afternoon session, Alan Wallace guides a 24-minute meditation on equanimity, focusing on the expression of equanimity for oneself and other sentient beings, including a dear friend, neutral person, and enemy. </p>\n\n<p>During the following question and answer period, Alan answers these questions:</p>\n\n<p>1. What is the thing shooting out of the head of the Buddhas here?</p>\n\n<p>2. When doing shamatha without a sign I tend to tense up and close my eyes. How can I release this tension?</p>\n\n<p>3. Regarding the four applications of mindfulness, how do they vary among the different schools of Buddhism?</p>\n\n<p>4. On what basis should I choose my main practice for the retreat?</p>\n\n<p>5. Should loving-kindness practice lead us to be vegetarians?</p>\n\n<p>6. What is happening with the energies in the body during shamatha, and what types of natural healing take place?</p>\n\n<p>7. During the meditation of settling the mind, we are supposed to meditate without distraction and attachment -- but why not without aversion?</p>\n\n<p>8. In awareness of awareness practice, is the point of the practice to hold the inquiry of who is being aware, without releasing awareness back into itself?</p>\n\n<p>9. While practicing bodhicitta, I understand that it is important to think that all sentient beings have been my mother. This is difficult for me.</p>",
            "length": "44614622",
            "sourceUrl": "http://podcasts.sbinstitute.com/spring2011/podcast-audio/10afternoon.mp3"
        },
        {
            "title": "19 Awareness of Awareness: Stretching",
            "datePublished": "Thu, 21 Apr 2011 10:00:41 +0700",
            "description": "In this morning session, Alan Wallace guides us in a 24-mintute meditation on shamatha without a sign, or awareness of awareness, focusing on stretching this awareness in different directions: left, right, up, down, and to the heart center.",
            "length": "17748525",
            "sourceUrl": "http://podcasts.sbinstitute.com/spring2011/podcast-audio/10morning.mp3"
        },
        {
            "title": "18 Equanimity: A Theravaden Perspective",
            "datePublished": "Wed, 20 Apr 2011 18:00:20 +0700",
            "description": "<p>Alan Wallace teaches on the immeasurable of equanimity, or uppekha, focusing on a Theravaden perspective. This can be described as even-mindedness or emotional equilibrium.</p>\n\n<p>During the following question and answer period, Alan answers these questions:</p>\n\n<p>1. When and how should I begin to lengthen my meditation sessions?</p>\n\n<p>2. Sometimes I seem to make progress in my practice, but almost inevitably what follows this is a fresh wave of distractions. Is this something in the early stages of shamatha practice? Why does this happen?</p>\n\n<p>3. I am having trouble sleeping through the night while on retreat - how to deal with this challenge?</p>\n\n<p>4. During awareness of awareness practice, I find that while inverting awareness I create a subtle tension in my mind. How can I release this tension?</p>\n\n<p>5. Must I first achieve shamatha before moving on to vipassana or other practices?</p>\n\n<p>6. When I'm practicing awareness of awareness, my awareness is going out to some space in front of me...</p>\n\n<p>7. Can you speak about the differences and similarities between practice during a meditation session and practice between meditation sessions?</p>",
            "length": "43920048",
            "sourceUrl": "http://podcasts.sbinstitute.com/spring2011/podcast-audio/09afternoon.mp3"
        },
        {
            "title": "17 Shamatha without a Sign: Awareness of Awareness",
            "datePublished": "Wed, 20 Apr 2011 10:00:05 +0700",
            "description": "In this morning session, Alan Wallace guides a 24-minute session of shamatha without a sign, or the awareness of awareness. During the introduction, he speaks about the clear light of death, the bardos, and the clear light of conception.",
            "length": "18282700",
            "sourceUrl": "http://podcasts.sbinstitute.com/spring2011/podcast-audio/09morning.mp3"
        },
        {
            "title": "16 Empathetic Joy as an Aspiration",
            "datePublished": "Tue, 19 Apr 2011 18:00:33 +0700",
            "description": "<p>In this afternoon session, Alan Wallace guides us in a 24-minute meditation on mudita, or empathetic joy, from the perspective of mudita as an aspiration that all sentient beings never be parted from happiness free of suffering.</p>\n\n<p>During the following question and answer, Alan addresses these questions:</p>\n\n<p>1. I wonder why the monks at the dharma center where I teach a version of shamatha do not come to my teachings.</p>\n\n<p>2. How has the Shamatha Project study been received by the scientific community?</p>\n\n<p>3. Where to from here, now that the Shamatha Project is over?</p>\n\n<p>4. What is the definition of sentient beings?</p>",
            "length": "45012121",
            "sourceUrl": "http://podcasts.sbinstitute.com/spring2011/podcast-audio/08afternoon.mp3"
        },
        {
            "title": "15 Shamatha without a Sign: The Next Phase",
            "datePublished": "Tue, 19 Apr 2011 10:00:58 +0700",
            "description": "In this morning session, Alan Wallace guides a 24-minute meditation on shamatha without a sign, focusing on probing into the nature of the mind and looking for the referent of the mind.",
            "length": "14475710",
            "sourceUrl": "http://podcasts.sbinstitute.com/spring2011/podcast-audio/08morning.mp3"
        },
        {
            "title": "14 Empathetic Joy",
            "datePublished": "Mon, 18 Apr 2011 18:00:09 +0700",
            "description": "<p>Alan Wallace guides a 24-minute meditation on mudita, or empathetic joy, focusing first on oneself, then spreading outwards to others.</p>\n\n<p>During the following question and answer period, Alan answers these questions:</p>\n\n<p>1. During shamatha, do we target the kind of focused attention that doesn't notice outside sensations such as sound, tactile sensations, etc.?</p>\n\n<p>2. How do I know the difference between foreground and background when I am primarily attending to the breath, my attention is with the breath, and at the same time some other thought or feeling arises?</p>\n\n<p>3. Is it okay to generate mental images while practicing in order to become familiar and mindful of these arisings?</p>\n\n<p>4. Where is the place for labeling such as \"thinking\", \"planning\", \"hearing\" etc.?</p>\n\n<p>5. Lama Yeshe says that reincarnation happens between a few moments and seven weeks after one's death. What say you?</p>\n\n<p>6. If one is single pointedly focusing on tactile sensations while eating, can taste fade away?</p>\n\n<p>7. How does one best practice awareness of awareness while in the supine position?</p>",
            "length": "43729464",
            "sourceUrl": "http://podcasts.sbinstitute.com/spring2011/podcast-audio/07afternoon.mp3"
        },
        {
            "title": "13 Shamatha without a Sign",
            "datePublished": "Mon, 18 Apr 2011 09:44:07 +0700",
            "description": "In this 24-minute guided meditation, Alan Wallace teaches the third method of shamatha, awareness of awareness, or shamatha without a sign.",
            "length": "14609023",
            "sourceUrl": "http://podcasts.sbinstitute.com/spring2011/podcast-audio/07morning.mp3"
        },
        {
            "title": "12 Compassion and the Suffering of Conditioned Existence",
            "datePublished": "Sat, 16 Apr 2011 18:00:46 +0700",
            "description": "<p>After a brief introduction, Alan Wallace guides us in a 24-minute meditation on compassion, focusing on the suffering of conditioned existence and our fundamental vulnerability to suffering.</p>\r\n\r\n<p>During the following question and answer period, Alan answers the questions:</p>\r\n\r\n<p>1. While watching the breath, where should the attention be -- with the feeling and sensation of the breath, or with the observer who is watching the breath?</p>\r\n\r\n<p>2. What is the power of thought in terms of the aspiration for all beings to be free from suffering during the meditation on compassion?</p>\r\n\r\n<p>3. What is one-taste?</p>\r\n\r\n<p>4. How do I know I am progressing with the practice of shamatha? Are there signs?</p>\r\n\r\n<p>5. Why must the eyes be open during the practice of settling the mind in its natural state?</p>\r\n\r\n<p>6. How do the five jhana factors arise -- linearly, or more organically? When do they reach culmination?</p>\r\n\r\n<p>7. How are 'coarse examination' and 'precise investigation' related to shamatha?</p><img src=\"http://feeds.feedburner.com/~r/AlanWallaceSpring2011Shamatha/~4/5eU7mhTTA7w\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "45061305",
            "sourceUrl": "http://podcasts.sbinstitute.com/spring2011/podcast-audio/06afternoon.mp3",
            "categories": [
                {
                    "_": "Uncategorized",
                    "$": {
                        "domain": "http://podcasts.sbinstitute.com/spring2011/?cat=1"
                    }
                }
            ]
        },
        {
            "title": "11 Settling the Mind in its Natural State: The Background",
            "datePublished": "Sat, 16 Apr 2011 10:00:40 +0700",
            "description": "In this morning session, Alan Wallace guides a 24-minute meditation on settling the mind in its natural state, highlighting the background of the space of the mind, paying attention to the intervals between thoughts.",
            "length": "18366704",
            "sourceUrl": "http://podcasts.sbinstitute.com/spring2011/podcast-audio/06morning.mp3"
        },
        {
            "title": "10A Compassion and the Suffering of Change",
            "datePublished": "Fri, 15 Apr 2011 18:00:43 +0700",
            "description": "This is a 20 minute introduction to the practice of compassion that follows in the next podcast, \"10B Compassion and the Suffering of Change\". Alan Wallace describes the second type of suffering, the suffering of change, including its source.",
            "length": "10001801",
            "sourceUrl": "http://podcasts.sbinstitute.com/spring2011/podcast-audio/05a-afternoon.mp3"
        },
        {
            "title": "10B Compassion and the Suffering of Change",
            "datePublished": "Fri, 15 Apr 2011 18:15:24 +0700",
            "description": "<p>This session is the continuation of \"10A Compassion and the Suffering of Change\" and includes the 24-minute guided meditation on compassion, focusing on the suffering of change. </p>\n\n<p>During the following question and answer with the group, Alan answers the following questions.</p>\n\n<p>1. What is the difference between desire without attachment and motivation?\n<br />2. In the context of the practice of settling the mind in its natural state, what is the mind?\n<br />3. What happens to an arhat after death?\n<br />4. What are the internal causes for shamatha?</p>",
            "length": "35064102",
            "sourceUrl": "http://podcasts.sbinstitute.com/spring2011/podcast-audio/05b-afternoon.mp3"
        },
        {
            "title": "09 Settling the Mind in its Natural State: The Foreground",
            "datePublished": "Fri, 15 Apr 2011 10:00:05 +0700",
            "description": "This morning session includes a guided meditation on the practice of settling the mind in its natural state, focusing on the foreground and the distinct events that are arising within the mind.",
            "length": "17283993",
            "sourceUrl": "http://podcasts.sbinstitute.com/spring2011/podcast-audio/05morning.mp3"
        },
        {
            "title": "08 Compassion",
            "datePublished": "Thu, 14 Apr 2011 18:00:28 +0700",
            "description": "<p>This afternoon session is a guided meditation on the second of the four immeasurables: compassion.</p>\n\n<p>In following question and answer period, Alan answers the following questions:</p>\n\n<p>1. What should one do with strong emotions that well up during shamatha practice?\n<br />2. What should one do with the natural arising of compassion or loving-kindness during shamatha practice?\n<br />3. Recognizing the importance placed on lights and signs from within the contemplative traditions, does neuroscience offer any insight into the biology underpinning these experiences?\n<br />4. What are the mechanisms and role of purification practices within the context of shamatha?\n<br />5. Knowing that consciousness and the self are both impermanent, is the observer also impermanent?</p>",
            "length": "45559319",
            "sourceUrl": "http://podcasts.sbinstitute.com/spring2011/podcast-audio/04afternoon.mp3"
        },
        {
            "title": "07 Settling the Mind in its Natural State",
            "datePublished": "Thu, 14 Apr 2011 10:00:46 +0700",
            "description": "In this morning session, Alan Wallace guides us in a 24-minute meditation on 'settling the mind in its natural state' using the domain of phenomena, or the space of the mind, as the object of meditation.",
            "length": "16241243",
            "sourceUrl": "http://podcasts.sbinstitute.com/spring2011/podcast-audio/04morning.mp3"
        },
        {
            "title": "06 Loving-Kindness in All Directions",
            "datePublished": "Wed, 13 Apr 2011 18:00:46 +0700",
            "description": "<p>In this afternoon session, Alan Wallace gives a 24-minute guided meditation on loving-kindness as it extends out in all directions: a wave of benevolence. He also describes the distinction between self-centeredness, or self-cherishing, and loving-kindness towards oneself. Finally, he touches on the importance of imagination while attending to the realm of possibility in addition to the realm of actuality.\n<br />During the question and answer period, Alan answers the following questions:\n<br />1. Is the substrate consciousness conditioned? Is it impermanent? What are its causes and conditions? Does an Arhat realize rigpa at the time of death, and if so, does that mean they attain Buddhahood?\n<br />2. What are pointing out instructions, and what is the distinction between different types of realization?\n<br />3. What is the source of sexual energy? How does one deal with sexual energy while in retreat?\n<br />4. What is the antidote for intoxication with hedonic pleasure?\n<br />5. What is the role of walking meditation in the practice of shamatha?</p>",
            "length": "44135297",
            "sourceUrl": "http://podcasts.sbinstitute.com/spring2011/podcast-audio/03afternoon.mp3"
        },
        {
            "title": "05 Mindfulness of Breathing, the Third Stage",
            "datePublished": "Wed, 13 Apr 2011 10:00:38 +0700",
            "description": "In this morning session, Alan Wallace gives a 24-minute guided meditation on the third stage of mindfulness of breathing. He also describes the preliminary signs of progressing along the path of shamatha.",
            "length": "16051060",
            "sourceUrl": "http://podcasts.sbinstitute.com/spring2011/podcast-audio/03morning.mp3"
        },
        {
            "title": "04 Loving-Kindness for Self and Others",
            "datePublished": "Tue, 12 Apr 2011 18:00:22 +0700",
            "description": "In this afternoon session, Alan Wallace teaches a guided meditation of loving-kindness, beginning first with one's self, then moving outwards to others. He reminds us that loving-kindness is not an emotion, but rather the aspiration for others to have happiness and the causes of happiness. This is followed by question and answer. Alan answers the questions, \"From a Buddhist perspective, what is the effect of the use of hallucinogenic drugs during the teenage years, can it harm the mind, and can meditation help heal the mind, and if so, how?\" and, \"How does one cultivate joyful effort, especially during mundane tasks?\"",
            "length": "45172089",
            "sourceUrl": "http://podcasts.sbinstitute.com/spring2011/podcast-audio/02afternoon.mp3"
        },
        {
            "title": "03 Mindfulness of Breathing, the Second Stage",
            "datePublished": "Tue, 12 Apr 2011 10:00:30 +0700",
            "description": "In this morning session, Alan Wallace gives a guided meditation of mindfulness of breathing, the second stage, focusing on the balance of relaxation and stability.",
            "length": "16491429",
            "sourceUrl": "http://podcasts.sbinstitute.com/spring2011/podcast-audio/02morning.mp3"
        },
        {
            "title": "02 Introduction to Loving-Kindness",
            "datePublished": "Mon, 11 Apr 2011 18:00:11 +0700",
            "description": "This afternoon session is a 24-minute guided meditation on the practice of loving-kindness, followed by question and answer with the group.",
            "length": "44419294",
            "sourceUrl": "http://podcasts.sbinstitute.com/spring2011/podcast-audio/01afternoon.mp3"
        },
        {
            "title": "01 Introduction to Shamatha: Mindfulness of Breathing",
            "datePublished": "Mon, 11 Apr 2011 10:00:32 +0700",
            "description": "In this morning session, Alan Wallace leads a guided meditation and introduction to the practice of shamatha; the first stage of mindfulness of breathing. He teaches the cultivation of a deepening sense of relaxation.",
            "length": "15903551",
            "sourceUrl": "http://podcasts.sbinstitute.com/spring2011/podcast-audio/01morning.mp3"
        }
    ]
}