{
    "artwork": "http://is5.mzstatic.com/image/thumb/Music111/v4/79/fc/5f/79fc5f0f-b7a5-4c39-1c9a-5e101c6d3fb4/source/100x100bb.jpg",
    "description": "Statehouse Blend is one-part profile and one-part insider look at the Missouri General Assembly. Each week, host Brian Ellison welcomes a state representative or senator to the podcast to talk policy and politics, as well as their personal life. We also invite a citizen voice or journalist to round out the conversation over good coffee and donuts.",
    "feedURL": "https://feedpress.me/SHBMissouri",
    "podcastURL": "kcur.org",
    "publisher": "KCUR Studios",
    "title": "Statehouse Blend Missouri",
    "episodes": [
        {
            "title": "Guns, Gambling And The Gas Tax: Previewing The 2020 Missouri Legislative Session",
            "datePublished": "Wed, 08 Jan 2020 16:44:34 +0000",
            "description": "The 2020 session of the Missouri General Assembly, which convenes Wednesday, promises the usual array of legislative wrangling and partisan bickering — all with an election looming in November. In this episode of Statehouse Blend Missouri, we bring you a preview, which first aired on KCUR's Up to Date on Jan. 6. Host Steve Kraske spoke with Brian Hauswirth, news director of Missourinet, and Jaclyn Driscoll, the statehouse reporter for St. Louis Public Radio.<img src=\"https://feedpress.me/15564/13132572.gif\" height=\"1\" width=\"1\"/>",
            "length": "1456",
            "sourceUrl": "https://tracking.feedpress.it/link/15564/13132573/010720_SHB_LegPreview2020.mp3"
        },
        {
            "title": "The 2019 Missouri Legislative Session Recap: GOP Wins Big On Abortion, Economic Development",
            "datePublished": "Tue, 21 May 2019 21:07:48 +0000",
            "description": "In this very special episode of KCUR’s Statehouse Blend Missouri podcast, we joined forces with St. Louis Public Radio’s Politically Speaking podcast to round up the 2019 session of the Missouri General Assembly.<img src=\"https://feedpress.me/15564/11382360.gif\" height=\"1\" width=\"1\"/>",
            "length": "2167",
            "sourceUrl": "https://tracking.feedpress.it/link/15564/11382361/SHBMO.052119.web__0.mp3"
        },
        {
            "title": "Missouri Auditor Nicole Galloway Discusses The State Budget, Putnam County Hospitals",
            "datePublished": "Wed, 17 Apr 2019 08:44:51 +0000",
            "description": "Missouri Auditor Nicole Galloway ’s been busy, looking into Clay County’s finances, the attorney general’s office and raising questions about the state’s tax revenues and budget issues. She sat down with KCUR's Samuel King on April 15 (Tax Day) to discuss all of these things, as well as what it’s like to be the only Democrat holding a statewide office. Subscribe to Statehouse Blend Missouri: iTunes , Google Play , and on the NPRone app .<img src=\"https://feedpress.me/15564/11267119.gif\" height=\"1\" width=\"1\"/>",
            "length": "810",
            "sourceUrl": "https://tracking.feedpress.it/link/15564/11267120/shbmo_galloway_web_320mix.mp3"
        },
        {
            "title": "Missouri Rep. Robert Sauls On Changing Criminal Justice Laws",
            "datePublished": "Thu, 04 Apr 2019 10:30:00 +0000",
            "description": "Before getting into the Missouri House, Democrat Robert Sauls was a prosecutor, a public defender and a military lawyer. Perhaps it's no surprise, then, that he has focused on criminal justice reform in his first term, cosponsoring bills that seek to change sentencing laws and create special veterans treatment courts. Sauls spoke with Statehouse Blend Missouri host Brian Ellison about life as a newbie legislator, and where he thinks the state budget, which is advancing through the General Assembly, falls short. Subscribe to Statehouse Blend Missouri: iTunes , Google Play , and on the NPRone app .<img src=\"https://feedpress.me/15564/11221982.gif\" height=\"1\" width=\"1\"/>",
            "length": "1509",
            "sourceUrl": "https://tracking.feedpress.it/link/15564/11221983/shbmo_sauls_web.mp3"
        },
        {
            "title": "Freshman State Rep. Ashley Bland Manlove On The Budget, LGBTQ Issues",
            "datePublished": "Wed, 06 Mar 2019 11:00:00 +0000",
            "description": "Missouri state Rep. Ashley Bland Manlove is the granddaughter and niece of state lawmakers, but she’s already making her own mark two months into her first term.<img src=\"https://feedpress.me/15564/11130278.gif\" height=\"1\" width=\"1\"/>",
            "length": "1408",
            "sourceUrl": "https://tracking.feedpress.it/link/15564/11309937/SHBMO.Manlove.030619.mp3"
        },
        {
            "title": "Will Sports Betting Be Missouri's Answer To Shrinking Revenue?",
            "datePublished": "Thu, 07 Feb 2019 18:00:00 +0000",
            "description": "Missouri's budget director announced this week that revenues are down 7 percent compared to last year. While that may change as more people file their taxes, lawmakers are looking for new ways to bring in money while faced with tax cuts they instituted on top of growing expenses for health care, infrastructure and education.<img src=\"https://feedpress.me/15564/11051151.gif\" height=\"1\" width=\"1\"/>",
            "length": "1867",
            "sourceUrl": "https://tracking.feedpress.it/link/15564/11051152/020719_SHBMO_Hoskins_Podcast.mp3"
        },
        {
            "title": "Missouri Sen. Dan Hegeman On The 2019 State Budget, Transportation Funding",
            "datePublished": "Thu, 24 Jan 2019 11:30:00 +0000",
            "description": "Missouri Republicans have a firm grip on the state legislature, but among the party’s leadership roles, only one is filled by someone near Kansas City.<img src=\"https://feedpress.me/15564/11013700.gif\" height=\"1\" width=\"1\"/>",
            "length": "1692",
            "sourceUrl": "https://tracking.feedpress.it/link/15564/11013701/012419_SHBMO_Hegeman_PODCAST.mp3"
        },
        {
            "title": "Statehouse Blend Missouri: Rep. DaRon McGee On The 2019 Legislative Session",
            "datePublished": "Wed, 09 Jan 2019 20:00:00 +0000",
            "description": "The Missouri General Assembly convenes this week and Republicans are still in charge, with supermajorities largely unaffected by the 2018 election. They’re united with Gov. Mike Parson, who's a decidedly less controversial leader than predecessor Eric Greitens, who resigned in June.<img src=\"https://feedpress.me/15564/10972415.gif\" height=\"1\" width=\"1\"/>",
            "length": "1240",
            "sourceUrl": "https://tracking.feedpress.it/link/15564/10972416/SHBMO_McGee_PODCAST.mp3"
        },
        {
            "title": "An End to Gerrymandering? Missouri's 2018 Ballot Questions",
            "datePublished": "Mon, 29 Oct 2018 10:00:00 +0000",
            "description": "Midterm elections are just around the corner, but much of Missouri's ballot is covered with pot — and redistricting, ethics rules, a gas tax and a minimum wage increase. Ballot questions join the U.S. Senate race as the big-ticket items on November 6 in Missouri. Host Brian Ellison talks with KCUR's Samuel King , Clean Missouri campaign director Sean Soendker Nicholson and Kansas City Star reporter Allison Kite . Subscribe to Statehouse Blend Missouri: iTunes , Google Play , and on the NPRone app .<img src=\"https://feedpress.me/15564/10849284.gif\" height=\"1\" width=\"1\"/>",
            "length": "1968",
            "sourceUrl": "https://tracking.feedpress.it/link/15564/10681712/shb_mo_mixdown_2.mp3"
        },
        {
            "title": "'Dark Money' Pours Into Missouri",
            "datePublished": "Fri, 05 Oct 2018 18:24:31 +0000",
            "description": "The influence of money in today's politics is undeniable, in Missouri and everywhere else. We explore campaign contributions, PACs, \"dark money\" groups and more, not only in big races like the U.S. Senate race between Claire McCaskill and Josh Hawley, but also in tight local races like the fight for the Missouri Senate seat in Platte and Buchanan Counties. We talk with Republican Tony Luetkemeyer and Democrat Martin Rucker , and St. Louis Public Radio's Jo Mannies . (For more of the conversation about issues in the 34th District Senate race, visit kcur.org next week.)<img src=\"https://feedpress.me/15564/10849285.gif\" height=\"1\" width=\"1\"/>",
            "length": "1648",
            "sourceUrl": "https://tracking.feedpress.it/link/15564/10491744/SHBO_MO_MONEY_0.mp3"
        },
        {
            "title": "A Wild Political Year Races Toward November",
            "datePublished": "Fri, 24 Aug 2018 15:32:45 +0000",
            "description": "The final slog to the November elections is underway, and Missouri's already wild political year holds the possibility of getting wilder yet. As Democrat Jason Kander pivots from the state and national stage to a Kansas City mayoral run, we get his assessment of the state of Missouri politics. We recap the primary election's top story, the overwhelming defeat of the anti-union \"Right to Work\" law. And we take a closer look at November's top race: the battle between Claire McCaskill and Josh Hawley that could determine control of the U.S. Senate. Guests: Jason Kander ; Samuel King , KCUR; Bryan Lowry , the Kansas City Star.<img src=\"https://feedpress.me/15564/10849286.gif\" height=\"1\" width=\"1\"/>",
            "length": "1467",
            "sourceUrl": "https://tracking.feedpress.it/link/15564/10137384/082118_SHBMO_Final.mp3"
        },
        {
            "title": "Session Scorecard: GOP Agenda Wins",
            "datePublished": "Tue, 22 May 2018 14:24:15 +0000",
            "description": "As the 2018 legislative session careened to an end, we took stock of what legislation passed, what didn't pass, and what was allowed to quietly pass away. It turns out that with all eyes on the accusations against Gov. Eric Greitens, his fellow Republicans were fairly successful at advancing a legislative agenda. Host Brian Ellison calls on KCUR editor Erica Hunzinger to help recap the session, and Sen. Jason Holsman , a Kansas City Democrat, talks about what went wrong for his party.<img src=\"https://feedpress.me/15564/10849287.gif\" height=\"1\" width=\"1\"/>",
            "length": "1464",
            "sourceUrl": "https://tracking.feedpress.it/link/15564/9233087/SHBMO_14.mp3"
        },
        {
            "title": "Battle For A Senate Seat In A Swing District",
            "datePublished": "Mon, 14 May 2018 20:50:56 +0000",
            "description": "Missouri Reps. Lauren Arthur and Kevin Corlew are fighting over an exceedingly rare prize in Missouri politics: an open Senate seat in a district that doesn't have a clear partisan leaning. Whether voters choose the Democratic Arthur or the Republican Corlew in a June 5 special election could speak volumes about the mood of the electorate at a turbulent time. Host Brian Ellison moderated a candidate forum on May 10, co-sponsored by KCUR and the League of Women Voters. This episode provides highlights; to hear the entire unedited forum: . Music used in this episode: Warming Evening by Nameless Dancers; The Silver Hatch by Blue Dot Sessions and Sad Marimba Planet by Lee Rosevere<img src=\"https://feedpress.me/15564/10849288.gif\" height=\"1\" width=\"1\"/>",
            "length": "1470",
            "sourceUrl": "https://tracking.feedpress.it/link/15564/9152582/SHBMO_LIVE_2.mp3"
        },
        {
            "title": "The Second Greitens Report",
            "datePublished": "Tue, 08 May 2018 03:04:28 +0000",
            "description": "Another week, another raft of bad news for Missouri Gov. Eric Greitens. A new report details his use of a charity donor list for campaign fund-raising and the possibility he lied about it to the state ethics commission. We get up to speed with Bryan Lowry of the Kansas City Star. And even as legislators call a special session to consider impeachment, they march on with the state budget and other bills unrelated to gubernatorial scandals. House Democratic Caucus Secretary Rep. DaRon McGee of Kansas City helps us round up how education, taxes and transportation may fare in the session's last two weeks. Music used in this episode: Warming Evening by Nameless Dancers; What Have I Done by Lee Rosevere; Headlights/Mountain Road , Tralaga , MKNT , and Soothe by Blue Dot Sessions<img src=\"https://feedpress.me/15564/10849289.gif\" height=\"1\" width=\"1\"/>",
            "length": "1394",
            "sourceUrl": "https://tracking.feedpress.it/link/15564/9088779/SHBMO_12.mp3"
        },
        {
            "title": "How A Governor’s Scandals May Shift The U.S. Senate",
            "datePublished": "Mon, 30 Apr 2018 19:15:50 +0000",
            "description": "Missouri Attorney General Josh Hawley seems headed for the Republican nomination to challenge incumbent U.S. Senator Claire McCaskill this fall. But Hawley's path has been made rougher by his complicated relationship with Gov. Eric Greitens—fellow Republican, fellow first-time-officeholder—and subject of his investigations. In this episode, host Brian Ellison takes an early look at the 2018 race. He talks with KCUR's Erica Hunzinger about Hawley's history and present entanglement with the governor. Then KCUR's Up to Date host Steve Kraske analyzes McCaskill's chances and recalls covering that 2012 race. Subscribe to Statehouse Blend Missouri, and stay up to date with the latest news from the Missouri General Assembly: iTunes , Google Play , and on the NPRone app . Music used in this episode: Warming Evening by Nameless Dancers; Cat's Eye , In Passage , The Silver Hatch , and Soothe by Blue Dot Sessions; Am-Trans by Podington Bear<img src=\"https://feedpress.me/15564/10849290.gif\" height=\"1\" width=\"1\"/>",
            "length": "1263",
            "sourceUrl": "https://tracking.feedpress.it/link/15564/9187471/SHB_MO_11_2.mp3"
        },
        {
            "title": "The Search For Common Ground On Guns",
            "datePublished": "Tue, 24 Apr 2018 17:51:27 +0000",
            "description": "As students rally nationwide for more gun regulation, Missouri legislators are considering — and advancing — several bills to make firearms more legal, for more people, in more places. What underlies the enduring, and seemingly intractable, divide on gun laws in Missouri? Host Brian Ellison welcomed Rep. T.J. Berry, a Kearney Republican, and Rep. Jon Carpenter, a Gladstone Democrat, and an audience of 75 for a live taping of the podcast April 19 in Kansas City. Music used in this episode: Warming Evening by Nameless Dancers; Rally , The Telling and On Belay by Blue Dot Sessions<img src=\"https://feedpress.me/15564/10849291.gif\" height=\"1\" width=\"1\"/>",
            "length": "1367",
            "sourceUrl": "https://tracking.feedpress.it/link/15564/9187256/SHBMO-Live.mp3"
        },
        {
            "title": "The Greitens Report",
            "datePublished": "Thu, 12 Apr 2018 15:21:18 +0000",
            "description": "On Wednesday, a Missouri House committee released an explosive report about an affair Gov. Eric Greitens has admitted having with his former hairdresser in 2015. Many lawmakers have called the details of that report \"disturbing\" and Greitens’ future as governor may be in jeopardy. In this episode, host Brian Ellison and KCUR editor Erica Hunzinger unpack the report's details. We also hear from two lawmakers, Republican Rep. Kevin Corlew and House Democratic Floor Leader Gail McCann Beatty, who both think it's time for Greitens to go. Subscribe to Statehouse Blend Missouri, and stay up to date with the latest news from the Missouri General Assembly: iTunes , Google Play , and on the NPRone app . Music used in this episode: Warming Evening by Nameless Dancers; Cicle Vascule , Denzel Spark , Vik Fenceta , Headlights/Mountain Road and Milkwood by Blue Dot Sessions.<img src=\"https://feedpress.me/15564/10849292.gif\" height=\"1\" width=\"1\"/>",
            "length": "1168",
            "sourceUrl": "https://tracking.feedpress.it/link/15564/8837282/SHBMO_Greitens.mp3"
        },
        {
            "title": "Missouri's Constant Abortion Debate",
            "datePublished": "Mon, 09 Apr 2018 21:03:40 +0000",
            "description": "In some states, abortion is on the agenda just about every year. Missouri is one of those states, and it is one where efforts to regulate or restrict abortion are often successful. Last week, the House passed a bill banning abortions after 20 weeks of pregnancy. Host Brian Ellison talks with the bill's sponsor, Rep. Donna Lichtenegger , and KCUR's health editor, Dan Margolies , to put the legislation in the broader context of Missouri abortion law and the numerous court challenges it continues to face. Subscribe to Statehouse Blend Missouri, and stay up to date with the latest news from the Missouri General Assembly: iTunes , Google Play , and on the NPRone app . Music used in this episode: Warming Evening by Nameless Dancers; Lemon & Melon , Dopped Ticket and The Summit by Blue Dot Sessions.<img src=\"https://feedpress.me/15564/10849293.gif\" height=\"1\" width=\"1\"/>",
            "length": "1268",
            "sourceUrl": "https://tracking.feedpress.it/link/15564/8807568/SHBMO_EP_8_0.mp3"
        },
        {
            "title": "How To Spend 28 Billion Dollars",
            "datePublished": "Mon, 02 Apr 2018 20:46:05 +0000",
            "description": "The Missouri House has approved its budget for the 2018 fiscal year, and the ball is now in the Senate's court. It's no small thing getting all the numbers to add up to pay for transportation, K-12 and higher education, social services ... and everything else. But how does that work, especially when lawmakers don't share the vision of the governor, whose proposal is their starting place and who ultimately has to implement whatever priorities they set? Host Brian Ellison talks about the process and the results so far with Traci Gleason of the Missouri Budget Project and Rep. Kip Kendrick, the House Democratic Whip. Subscribe to Statehouse Blend Missouri, and stay up to date with the latest news from the Missouri General Assembly: iTunes , Google Play , and on the NPRone app . Music used in this episode: Warming Evening by Nameless Dancers; Soothe by Blue Dot Sessions; and What Have I Done by Lee Rosevere.<img src=\"https://feedpress.me/15564/10849294.gif\" height=\"1\" width=\"1\"/>",
            "length": "1221",
            "sourceUrl": "https://tracking.feedpress.it/link/15564/8739708/SHBMO_EP_7.mp3"
        },
        {
            "title": "Midterm Evaluation: Everything's Coming Up Greitens",
            "datePublished": "Mon, 26 Mar 2018 17:45:02 +0000",
            "description": "As the Missouri General Assembly takes a spring break, we take a look at the term so far and what's left to be done. But like everyone else, we have a hard time talking about anything but the indictment and investigations of Governor Eric Greitens. Joining host Brian Ellison with analysis and predictions are KCUR's Erica Hunzinger, the Kansas City Star's Bryan Lowry and Missourinet's Alisa Nelson. Subscribe to Statehouse Blend Missouri, and stay up to date with the latest news from the Missouri General Assembly: iTunes , Google Play , and on the NPRone app . Music used in this episode: Warming Evening by Nameless Dancers and What Have I Done by Lee Rosevere.<img src=\"https://feedpress.me/15564/10849295.gif\" height=\"1\" width=\"1\"/>",
            "length": "1332",
            "sourceUrl": "https://tracking.feedpress.it/link/15564/8671955/SHBMO_EP_6.mp3"
        }
    ]
}