{
    "artwork": "http://is1.mzstatic.com/image/thumb/Music/v4/31/55/c9/3155c991-9d04-2e82-c1fb-4ee94804e9f9/source/100x100bb.jpg",
    "description": "Some of the world's greatest artists, designers, photographers and architects showcase their work and visions onstage at the TED conference, TEDx events and partner events around the world. You can also download these and many other videos free on TED.com, with an interactive English transcript and subtitles in up to 80 languages. TED is a nonprofit devoted to Ideas Worth Spreading.",
    "feedURL": "http://feeds.feedburner.com/iTunesPodcastTTArts",
    "podcastURL": "https://www.ted.com/themes/itunes_podcast_tedtalks_art.html",
    "publisher": "TED",
    "title": "TEDTalks Art",
    "episodes": [
        {
            "title": "Everyday objects, tragic histories | Ziyah Gafić",
            "datePublished": "Fri, 22 Aug 2014 14:40:51 +0000",
            "description": "Ziyah Gafić photographs everyday objects—watches, shoes, glasses. But these images are deceptively simple; the items in them have been exhumed from the mass graves of the Bosnian War. Gafić, a TED Fellow and Sarajevo native, is photographing every item from these graves in order to create a living archive of the identities of those lost. <img src=\"http://feeds.feedburner.com/~r/iTunesPodcastTTArts/~4/LYaUg1afE6I\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "31743719",
            "sourceUrl": "http://feedproxy.google.com/~r/iTunesPodcastTTArts/~5/b-d7jZ4Susw/ZiyahGafic_2014U-480p.mp4",
            "categories": [
                "Higher Education"
            ]
        },
        {
            "title": "How I brought a river, and my city, back to life | Aziza Chaouni",
            "datePublished": "Tue, 19 Aug 2014 14:56:48 +0000",
            "description": "The Fez River winds through the medina of Fez, Morocco—a mazelike medieval city that's a World Heritage site. Once considered the \"soul\" of this celebrated city, the river succumbed to sewage and pollution, and in the 1950s was covered over bit by bit until nothing remained. TED Fellow Aziza Chaouni recounts her 20 year effort to restore this river to its former glory, and to transform her city in the process.<img src=\"http://feeds.feedburner.com/~r/iTunesPodcastTTArts/~4/rkp6rk7MXTA\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "40027118",
            "sourceUrl": "http://feedproxy.google.com/~r/iTunesPodcastTTArts/~5/D5ok8BCQBO4/AzizaChaouni_2014U-480p.mp4",
            "categories": [
                "Higher Education"
            ]
        },
        {
            "title": "Wry photos that turn stereotypes upside down | Uldus Bakhtiozina",
            "datePublished": "Fri, 12 Sep 2014 14:59:03 +0000",
            "description": "Artist Uldus Bakhtiozina uses photographs to poke fun at societal norms in her native Russia. A glimpse into Russian youth culture and a short, fun reminder not to take ourselves too seriously.<img src=\"http://feeds.feedburner.com/~r/iTunesPodcastTTArts/~4/rhDCyh1F4_U\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "29721635",
            "sourceUrl": "http://feedproxy.google.com/~r/iTunesPodcastTTArts/~5/fyJYA30NgqE/UldusBakhtiozina_2014U-480p.mp4",
            "categories": [
                "Higher Education"
            ]
        },
        {
            "title": "How to reinvent the apartment building | Moshe Safdie",
            "datePublished": "Fri, 26 Sep 2014 14:47:33 +0000",
            "description": "In 1967, Moshe Safdie reimagined the monolithic apartment building, creating “Habitat ’67,” which gave each unit an unprecedented sense of openness. Nearly 50 years later, he believes the need for this type of building is greater than ever. In this short talk, Safdie surveys a range of projects that do away with the high-rise and let light permeate into densely-packed cities.<img src=\"http://feeds.feedburner.com/~r/iTunesPodcastTTArts/~4/hsQ_XzFLQ54\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "42106648",
            "sourceUrl": "http://feedproxy.google.com/~r/iTunesPodcastTTArts/~5/3T_LKn05CJk/MosheSafdie_2014U-480p.mp4",
            "categories": [
                "Higher Education"
            ]
        },
        {
            "title": "My architectural philosophy? Bring the community into the process | Alejandro Aravena",
            "datePublished": "Thu, 06 Nov 2014 15:51:08 +0000",
            "description": "When asked to build housing for 100 families in Chile ten years ago, Alejandro Aravena looked to an unusual inspiration: the wisdom of favelas and slums. Rather than building a large building with small units, he built flexible half-homes that each family could expand on. It was a complex problem, but with a simple solution — one that he arrived at by working with the families themselves. With a chalkboard and beautiful images of his designs, Aravena walks us through three projects where clever rethinking led to beautiful design with great benefit.<img src=\"http://feeds.feedburner.com/~r/iTunesPodcastTTArts/~4/FdDsBN0jgVw\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "113436639",
            "sourceUrl": "http://feedproxy.google.com/~r/iTunesPodcastTTArts/~5/DP_qpOJEIjY/AlejandroAravena_2014G-480p.mp4",
            "categories": [
                "Higher Education"
            ]
        },
        {
            "title": "How painting can transform communities | Haas&Hahn",
            "datePublished": "Fri, 07 Nov 2014 16:29:52 +0000",
            "description": "Artists Jeroen Koolhaas and Dre Urhahn create community art by painting entire neighborhoods, and involving those who live there -- from the favelas of Rio to the streets of North Philadelphia. What's made their projects succeed? In this funny and inspiring talk, the artists explain their art-first approach -- and the importance of a neighborhood barbecue.<img src=\"http://feeds.feedburner.com/~r/iTunesPodcastTTArts/~4/T9aLAxgsNaE\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "82076008",
            "sourceUrl": "http://feedproxy.google.com/~r/iTunesPodcastTTArts/~5/3PTjqk1Yrp8/HaasandHahn_2014G-480p.mp4",
            "categories": [
                "Higher Education"
            ]
        },
        {
            "title": "A dance in a hurricane of paper, wind and light | Aakash Odedra",
            "datePublished": "Fri, 05 Dec 2014 16:00:35 +0000",
            "description": "Choreographer Aakash Odedra is dyslexic and has always felt that his best expression comes through movement. “Murmur” is his ode to that experience, teaming up with co-creators Lewis Major and Ars Electronica Futurelab. Watch him spin his way through the center of a storm, as pages of books take flight all around him.<img src=\"http://feeds.feedburner.com/~r/iTunesPodcastTTArts/~4/XlCAngwP8v0\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "70459507",
            "sourceUrl": "http://feedproxy.google.com/~r/iTunesPodcastTTArts/~5/3YDYVecUJZk/AakashOdedra_2014G-480p.mp4",
            "categories": [
                "Higher Education"
            ]
        },
        {
            "title": "The world's most boring television ... and why it's hilariously addictive | Thomas Hellum",
            "datePublished": "Wed, 10 Dec 2014 16:13:04 +0000",
            "description": "You've heard about slow food. Now here's slow ... TV? In this very funny talk, Norwegian television producer Thomas Hellum shares how he and his team began to broadcast long, boring events, often live -- and found a rapt audience. Shows include a 7-hour train journey, an 18-hour fishing expedition and a 5.5-day ferry voyage along the coast of Norway. The results are both beautiful and fascinating. Really.<img src=\"http://feeds.feedburner.com/~r/iTunesPodcastTTArts/~4/DXZjzC-M7gc\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "126706978",
            "sourceUrl": "http://feedproxy.google.com/~r/iTunesPodcastTTArts/~5/8fUC99qz4_M/ThomasHellum_2014X-480p.mp4",
            "categories": [
                "Higher Education"
            ]
        },
        {
            "title": "Trash cart superheroes | Mundano",
            "datePublished": "Fri, 19 Dec 2014 16:18:48 +0000",
            "description": "In Brazil, \"catadores\" collect junk and recyclables. But while they provide a vital service that benefits all, they are nearly invisible as they roam the streets. Enter graffiti artist Mundano, a TED Fellow. In a spirited talk, he describes his project \"Pimp My Carroça,\" which has transformed these heroic workers' carts into things of beauty and infused them with a sense of humor. It's a movement that is going global.<img src=\"http://feeds.feedburner.com/~r/iTunesPodcastTTArts/~4/oKd0_BHUn_k\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "39150083",
            "sourceUrl": "http://feedproxy.google.com/~r/iTunesPodcastTTArts/~5/Zdt60-oW92E/Mundano_2014U-480p.mp4",
            "categories": [
                "Higher Education"
            ]
        },
        {
            "title": "The beauty and diversity of Muslim life | Bassam Tariq",
            "datePublished": "Fri, 30 Jan 2015 16:00:04 +0000",
            "description": "Bassam Tariq is a blogger, a filmmaker, and a halal butcher -- but one thread unites his work: His joy in the diversity, the humanness of our individual experiences. In this charming talk, he shares clips from his film \"These Birds Walk\" and images from his tour of 30 mosques in 30 days -- and reminds us to consider the beautiful complexity within us all.<img src=\"http://feeds.feedburner.com/~r/iTunesPodcastTTArts/~4/UHSgSUp0PdE\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "33817475",
            "sourceUrl": "http://feedproxy.google.com/~r/iTunesPodcastTTArts/~5/5M8FTYJZhe4/BassamTariq_2014U-480p.mp4",
            "categories": [
                "Higher Education"
            ]
        },
        {
            "title": "Old books reborn as art | Brian Dettmer",
            "datePublished": "Fri, 06 Feb 2015 16:00:42 +0000",
            "description": "What do you do with an outdated encyclopedia in the information age? With X-Acto knives and an eye for a good remix, artist Brian Dettmer makes beautiful, unexpected sculptures that breathe new life into old books.<img src=\"http://feeds.feedburner.com/~r/iTunesPodcastTTArts/~4/n7qqTtzoP1A\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "44322485",
            "sourceUrl": "http://feedproxy.google.com/~r/iTunesPodcastTTArts/~5/EaP6VaLaofE/BrianDettmer_2014Y-480p.mp4",
            "categories": [
                "Higher Education"
            ]
        },
        {
            "title": "Why the buildings of the future will be shaped by ... you | Marc Kushner",
            "datePublished": "Tue, 10 Mar 2015 15:02:19 +0000",
            "description": "\"Architecture is not about math or zoning -- it's about visceral emotions,\" says Marc Kushner. In a sweeping — often funny — talk, he zooms through the past thirty years of architecture to show how the public, once disconnected, have become an essential part of the design process. With the help of social media, feedback reaches architects years before a building is even created. The result? Architecture that will do more for us than ever before.<img src=\"http://feeds.feedburner.com/~r/iTunesPodcastTTArts/~4/dNckdHlvXyg\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "129518920",
            "sourceUrl": "http://feedproxy.google.com/~r/iTunesPodcastTTArts/~5/2es-BPsupwY/MarcKushner_2014-480p.mp4",
            "categories": [
                "Higher Education"
            ]
        },
        {
            "title": "How to go to space, without having to go to space | Angelo Vermeulen",
            "datePublished": "Thu, 19 Feb 2015 16:05:29 +0000",
            "description": "\"We will start inhabiting outer space,\" says Angelo Vermeulen, crew commander of a NASA-funded Mars simulation. \"It might take 50 years or it might take 500 years, but it's going to happen.\" In this charming talk, the TED Senior Fellow describes some of his official work to make sure humans are prepared for life in deep space ... and shares a fascinating art project in which he challenged people worldwide to design homes we might live in there.<img src=\"http://feeds.feedburner.com/~r/iTunesPodcastTTArts/~4/lQDmSf39s3U\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "49924367",
            "sourceUrl": "http://feedproxy.google.com/~r/iTunesPodcastTTArts/~5/wpJUkicg3pc/AngeloVermeulen_2014U-480p.mp4",
            "categories": [
                "Higher Education"
            ]
        },
        {
            "title": "There’s a better way to die, and architecture can help | Alison Killing",
            "datePublished": "Mon, 30 Mar 2015 14:56:29 +0000",
            "description": "In this short, provocative talk, architect Alison Killing looks at buildings where death and dying happen -- cemeteries, hospitals, homes. The way we die is changing, and the way we build for dying ... well, maybe that should too. It's a surprisingly fascinating look at a hidden aspect of our cities, and our lives.<img src=\"http://feeds.feedburner.com/~r/iTunesPodcastTTArts/~4/Fe00FILUnn8\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "33868518",
            "sourceUrl": "http://feedproxy.google.com/~r/iTunesPodcastTTArts/~5/AiUh8GUPz3w/AlisonKilling_2014U-480p.mp4",
            "categories": [
                "Higher Education"
            ]
        },
        {
            "title": "How to revive a neighborhood: with imagination, beauty and art | Theaster Gates",
            "datePublished": "Thu, 26 Mar 2015 15:13:39 +0000",
            "description": "Theaster Gates, a potter by training and a social activist by calling, wanted to do something about the sorry state of his neighborhood on the south side of Chicago. So he did, transforming abandoned buildings to create community hubs that connect and inspire those who still live there (and draw in those who don't). In this passionate talk, Gates describes his efforts to build a \"miniature Versailles\" in Chicago, and he shares his fervent belief that culture can be a catalyst for social transformation in any city, anywhere.<img src=\"http://feeds.feedburner.com/~r/iTunesPodcastTTArts/~4/6kUpu-M6pbI\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "120894415",
            "sourceUrl": "http://feedproxy.google.com/~r/iTunesPodcastTTArts/~5/_ql-x7yhGyU/TheasterGates_2015-480p.mp4",
            "categories": [
                "Higher Education"
            ]
        },
        {
            "title": "The dancer, the singer, the cellist ... and a moment of creative magic | Bill T. Jones",
            "datePublished": "Wed, 06 May 2015 15:14:44 +0000",
            "description": "Legendary dance choreographer Bill T. Jones and TED Fellows Joshua Roman and Somi didn't know exactly what was going to happen when they took the stage at TED2015. They just knew they wanted to offer the audience an opportunity to witness creative collaboration in action. The result: An improvised piece they call \"The Red Circle and the Blue Curtain,\" so extraordinary it had to be shared ...<img src=\"http://feeds.feedburner.com/~r/iTunesPodcastTTArts/~4/6A2dHwzVeoQ\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "46730105",
            "sourceUrl": "http://feedproxy.google.com/~r/iTunesPodcastTTArts/~5/_GL8StNrXY0/BillTJones_2015-480p.mp4",
            "categories": [
                "Higher Education"
            ]
        },
        {
            "title": "Magical houses, made of bamboo | Elora Hardy",
            "datePublished": "Tue, 12 May 2015 14:58:22 +0000",
            "description": "You've never seen buildings like this. The stunning bamboo homes built by Elora Hardy and her team in Bali twist, curve and surprise at every turn. They defy convention because the bamboo itself is so enigmatic. No two poles of bamboo are alike, so every home, bridge and bathroom is exquisitely unique. In this beautiful, immersive talk, she shares the potential of bamboo, as both a sustainable resource and a spark for the imagination. \"We have had to invent our own rules,\" she says.<img src=\"http://feeds.feedburner.com/~r/iTunesPodcastTTArts/~4/8cAFZ-tvYBM\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "74760365",
            "sourceUrl": "http://feedproxy.google.com/~r/iTunesPodcastTTArts/~5/0CFQR9yo1TE/EloraHardy_2015-480p.mp4",
            "categories": [
                "Higher Education"
            ]
        },
        {
            "title": "Why city flags may be the worst-designed thing you've never noticed | Roman Mars",
            "datePublished": "Thu, 14 May 2015 15:12:54 +0000",
            "description": "Roman Mars is obsessed with flags -- and after you watch this talk, you might be, too. These ubiquitous symbols of civic pride are often designed, well, pretty terribly. But they don't have to be. In this surprising and hilarious talk about vexillology -- the study of flags -- Mars reveals the five basic principles of flag design and shows why he believes they can be applied to just about anything.<img src=\"http://feeds.feedburner.com/~r/iTunesPodcastTTArts/~4/0ZMenhji5Vw\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "131373348",
            "sourceUrl": "http://feedproxy.google.com/~r/iTunesPodcastTTArts/~5/OGY42YwZ6Eg/RomanMars_2015-480p.mp4",
            "categories": [
                "Higher Education"
            ]
        },
        {
            "title": "One woman, five characters, and a sex lesson from the future | Sarah Jones",
            "datePublished": "Tue, 09 Jun 2015 14:58:12 +0000",
            "description": "In this performance, Sarah Jones brings you to the front row of a classroom in the future, as a teacher plugs in different personas from the year 2016 to show their varied perspectives on sex work. As she changes props, Jones embodies an elderly homemaker, a “sex work studies” major, an escort, a nun-turned-prostitute and a guy at a strip club for his bachelor party. It’s an intriguing look at a taboo topic, that flips cultural norms around sex inside out.<img src=\"http://feeds.feedburner.com/~r/iTunesPodcastTTArts/~4/RPjbHfAdIsE\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "182105664",
            "sourceUrl": "http://feedproxy.google.com/~r/iTunesPodcastTTArts/~5/KIiAetCDTak/SarahJones_2015-480p.mp4",
            "categories": [
                "Higher Education"
            ]
        },
        {
            "title": "A powerful poem about what it feels like to be transgender | Lee Mokobe",
            "datePublished": "Fri, 12 Jun 2015 15:14:30 +0000",
            "description": "\"I was the mystery of an anatomy, a question asked but not answered,\" says poet Lee Mokobe, a TED Fellow, in this gripping and poetic exploration of identity and transition. It's a thoughtful reflection on bodies, and the meanings poured into them.<img src=\"http://feeds.feedburner.com/~r/iTunesPodcastTTArts/~4/qkSbXRQqjYw\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "31662609",
            "sourceUrl": "http://feedproxy.google.com/~r/iTunesPodcastTTArts/~5/uMOVh_JZi8I/LeeMokobe_2015W-480p.mp4",
            "categories": [
                "Higher Education"
            ]
        },
        {
            "title": "The art of first impressions -- in design and life | Chip Kidd",
            "datePublished": "Tue, 23 Jun 2015 14:59:40 +0000",
            "description": "Book designer Chip Kidd knows all too well how often we judge things by first appearances. In this hilarious, fast-paced talk, he explains the two techniques designers use to communicate instantly -- clarity and mystery -- and when, why and how they work. He celebrates beautiful, useful pieces of design, skewers less successful work, and shares the thinking behind some of his own iconic book covers.<img src=\"http://feeds.feedburner.com/~r/iTunesPodcastTTArts/~4/6aBcZ9Wc39g\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "131898879",
            "sourceUrl": "http://feedproxy.google.com/~r/iTunesPodcastTTArts/~5/ghqoJ1pr15Q/ChipKidd_2015S-480p.mp4",
            "categories": [
                "Higher Education"
            ]
        },
        {
            "title": "This is what enduring love looks like | Alec Soth and Stacey Baker",
            "datePublished": "Wed, 15 Jul 2015 14:49:51 +0000",
            "description": "Stacey Baker has always been obsessed with how couples meet. When she asked photographer Alec Soth to help her explore this topic, they found themselves at the world's largest speed-dating event, held in Las Vegas on Valentine's Day, and at the largest retirement community in Nevada — with Soth taking portraits of pairs in each locale. Between these two extremes, they unwound a beautiful through-line of how a couple goes from meeting to creating a life together. (This talk was part of a TED2015 session curated by Pop-Up Magazine: popupmagazine.com or @popupmag on Twitter.)<img src=\"http://feeds.feedburner.com/~r/iTunesPodcastTTArts/~4/Hl98F1jFs9k\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "74117876",
            "sourceUrl": "http://feedproxy.google.com/~r/iTunesPodcastTTArts/~5/t66vMC6UGyM/AlecSoth_2015-480p.mp4",
            "categories": [
                "Higher Education"
            ]
        },
        {
            "title": "Street art with a message of hope and peace | eL Seed",
            "datePublished": "Thu, 23 Jul 2015 14:58:17 +0000",
            "description": "What does this gorgeous street art say? It's Arabic poetry, inspired by bold graffiti and placed where a message of hope and peace can do the most good. In this quietly passionate talk, artist and TED Fellow eL Seed describes his ambition: to create art so beautiful it needs no translation.<img src=\"http://feeds.feedburner.com/~r/iTunesPodcastTTArts/~4/BV9CUnQasI4\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "41292822",
            "sourceUrl": "http://feedproxy.google.com/~r/iTunesPodcastTTArts/~5/ymS2MDeI8mc/eLSeed_2015U-480p.mp4",
            "categories": [
                "Higher Education"
            ]
        },
        {
            "title": "A secret memorial for civilian casualties | Matt Kenyon",
            "datePublished": "Thu, 13 Aug 2015 15:07:13 +0000",
            "description": "In the fog of war, civilian casualties often go uncounted. Artist Matt Kenyon, whose recent work memorialized the names and stories of US soldiers killed in the Iraq war, decided he should create a companion monument, to the Iraqi civilians caught in the war's crossfire. Learn how he built a secret monument to place these names in the official record.<img src=\"http://feeds.feedburner.com/~r/iTunesPodcastTTArts/~4/DRvwoPdP8gU\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "47170409",
            "sourceUrl": "http://feedproxy.google.com/~r/iTunesPodcastTTArts/~5/U_QCpUawY2E/MattKenyon_2015U-480p.mp4",
            "categories": [
                "Higher Education"
            ]
        },
        {
            "title": "A journey through the mind of an artist | Dustin Yellin",
            "datePublished": "Fri, 21 Aug 2015 15:03:55 +0000",
            "description": "Dustin Yellin makes mesmerizing artwork that tells complex, myth-inspired stories. How did he develop his style? In this disarming talk, he shares the journey of an artist -- starting from age 8 -- and his idiosyncratic way of thinking and seeing. Follow the path that leads him up to his latest major work (or two).<img src=\"http://feeds.feedburner.com/~r/iTunesPodcastTTArts/~4/Y79qccJtsIw\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "53105496",
            "sourceUrl": "http://feedproxy.google.com/~r/iTunesPodcastTTArts/~5/HqUZ8YclX4g/DustinYellin_2014S-480p.mp4",
            "categories": [
                "Higher Education"
            ]
        },
        {
            "title": "Stunning photos of the endangered Everglades | Mac Stone",
            "datePublished": "Wed, 30 Sep 2015 16:12:34 +0000",
            "description": "For centuries, people have viewed swamps and wetlands as obstacles to avoid. But for photographer Mac Stone, who documents the stories of wildlife in Florida's Everglades, the swamp isn't a hindrance — it's a national treasure. Through his stunning photographs, Stone shines a new light on a neglected, ancient and important wilderness. His message: get out and experience it for yourself. \"Just do it — put your feet in the water,\" he says. \"The swamp will change you, I promise.\"<img src=\"http://feeds.feedburner.com/~r/iTunesPodcastTTArts/~4/J9SEOd4gICI\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "134756777",
            "sourceUrl": "http://feedproxy.google.com/~r/iTunesPodcastTTArts/~5/W5nmwsfAzpg/MacStone_2015X-480p.mp4",
            "categories": [
                "Higher Education"
            ]
        },
        {
            "title": "Art that lets you talk back to NSA spies | Mathias Jud",
            "datePublished": "Thu, 29 Oct 2015 14:52:41 +0000",
            "description": "In 2013, the world learned that the NSA and its UK equivalent, GCHQ, routinely spied on the German government. Amid the outrage, artists Mathias Jud and Christoph Wachter thought: Well, if they're listening ... let's talk to them. With antennas mounted on the roof of the Swiss Embassy in Berlin's government district, they set up an open network that let the world send messages to US and UK spies listening nearby. It's one of three bold, often funny, and frankly subversive works detailed in this talk, which highlights the world's growing discontent with surveillance and closed networks.<img src=\"http://feeds.feedburner.com/~r/iTunesPodcastTTArts/~4/547Cd90vQMQ\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "93339498",
            "sourceUrl": "http://feedproxy.google.com/~r/iTunesPodcastTTArts/~5/L-9hZna2X3g/MathiasJud_2015G-480p.mp4",
            "categories": [
                "Higher Education"
            ]
        },
        {
            "title": "Why great architecture should tell a story | Ole Scheeren",
            "datePublished": "Thu, 14 Jan 2016 16:22:03 +0000",
            "description": "For architect Ole Scheeren, the people who live and work inside a building are as much a part of that building as concrete, steel and glass. He asks: Can architecture be about collaboration and storytelling instead of the isolation and hierarchy of a typical skyscraper? Visit five of Scheeren's buildings -- from a twisted tower in China to a floating cinema in the ocean in Thailand -- and learn the stories behind them.<img src=\"http://feeds.feedburner.com/~r/iTunesPodcastTTArts/~4/FBPFMRE5uRc\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "118322291",
            "sourceUrl": "http://feedproxy.google.com/~r/iTunesPodcastTTArts/~5/sUUzkx44NpI/OleScheeren_2015G-480p.mp4",
            "categories": [
                "Higher Education"
            ]
        },
        {
            "title": "An art made of trust, vulnerability and connection | Marina Abramović",
            "datePublished": "Mon, 30 Nov 2015 17:17:43 +0000",
            "description": "Marina Abramović's art pushes the boundary between audience and artist in pursuit of heightened consciousness and personal change. In her groundbreaking 2010 work, \"The Artist Is Present,\" she simply sat in a chair facing her audience, for eight hours a day ... with powerfully moving results. Her boldest work may still be yet to come -- it's taking the form of a sprawling art institute devoted to experimentation and simple acts done with mindful attention. \"Nothing happens if you always do things the same way,\" she says. \"My method is to do things I'm afraid of, the things I don't know, to go to territory that nobody's ever been.\"<img src=\"http://feeds.feedburner.com/~r/iTunesPodcastTTArts/~4/8oQkaI25neQ\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "113885434",
            "sourceUrl": "http://feedproxy.google.com/~r/iTunesPodcastTTArts/~5/vMrDAoR3mLQ/MarinaAbramovic_2015-480p.mp4",
            "categories": [
                "Higher Education"
            ]
        },
        {
            "title": "My year reading a book from every country in the world | Ann Morgan",
            "datePublished": "Mon, 23 Nov 2015 16:22:23 +0000",
            "description": "Ann Morgan considered herself well read -- until she discovered the \"massive blindspot\" on her bookshelf. Amid a multitude of English and American authors, there were very few books from beyond the English-speaking world. So she set an ambitious goal: to read one book from every country in the world over the course of a year. Now she's urging other Anglophiles to read translated works so that publishers will work harder to bring foreign literary gems back to their shores. Explore interactive maps of her reading journey here: go.ted.com/readtheworld<img src=\"http://feeds.feedburner.com/~r/iTunesPodcastTTArts/~4/s2lFuXEacGQ\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "86974821",
            "sourceUrl": "http://feedproxy.google.com/~r/iTunesPodcastTTArts/~5/e_UsZsaWWB0/AnnMorgan_2015G-480p.mp4",
            "categories": [
                "Higher Education"
            ]
        },
        {
            "title": "Forget shopping. Soon you'll download your new clothes | Danit Peleg",
            "datePublished": "Tue, 08 Dec 2015 16:28:30 +0000",
            "description": "Downloadable, printable clothing may be coming to a closet near you. What started as designer Danit Peleg's fashion school project turned into a collection of 3D-printed designs that have the strength and flexibility for everyday wear. \"Fashion is a very physical thing,\" she says. \"I wonder what our world will look like when our clothes will be digital.\"<img src=\"http://feeds.feedburner.com/~r/iTunesPodcastTTArts/~4/TwbWyyWVd6w\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "45797814",
            "sourceUrl": "http://feedproxy.google.com/~r/iTunesPodcastTTArts/~5/cbV7we7-ELg/DanitPeleg_2015Y-480p.mp4",
            "categories": [
                "Higher Education"
            ]
        },
        {
            "title": "An underwater art museum, teeming with life | Jason deCaires Taylor",
            "datePublished": "Tue, 22 Dec 2015 16:33:01 +0000",
            "description": "For sculptor Jason deCaires Taylor, the ocean is more than a muse -- it's an exhibition space and museum. Taylor creates sculptures of human forms and mundane life on land and sinks them to the ocean floor, where they are subsumed by the sea and transformed from lifeless stone into vibrant habitats for corals, crustaceans and other creatures. The result: Enigmatic, haunting and colorful commentaries about our transient existence, the sacredness of the ocean and its breathtaking power of regeneration.<img src=\"http://feeds.feedburner.com/~r/iTunesPodcastTTArts/~4/kzdeBIkh7N4\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "80042765",
            "sourceUrl": "http://feedproxy.google.com/~r/iTunesPodcastTTArts/~5/zXKsM0NZEeA/JasondeCairesTaylor_2015Z-480p.mp4",
            "categories": [
                "Higher Education"
            ]
        },
        {
            "title": "The unheard story of the Sistine Chapel | Elizabeth Lev",
            "datePublished": "Fri, 22 Jan 2016 16:26:35 +0000",
            "description": "The Sistine Chapel is one of the most iconic buildings on earth -- but there's a lot you probably don't know about it. In this tour-de-force talk, art historian Elizabeth Lev guides us across the famous building's ceiling and Michelangelo's vital depiction of traditional stories, showing how the painter reached beyond the religious iconography of the time to chart new artistic waters. Five hundred years after the artist painted it, says Lev, the Sistine Chapel forces us to look around as if it were a mirror and ask, \"Who am I, and what role do I play in this great theater of life?\"<img src=\"http://feeds.feedburner.com/~r/iTunesPodcastTTArts/~4/xpzc7b82qNQ\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "126231051",
            "sourceUrl": "http://feedproxy.google.com/~r/iTunesPodcastTTArts/~5/13yulEjxE3U/ElizabethLev_2015G-480p.mp4",
            "categories": [
                "Higher Education"
            ]
        },
        {
            "title": "How I'm discovering the secrets of ancient texts | Gregory Heyworth",
            "datePublished": "Wed, 10 Feb 2016 15:47:07 +0000",
            "description": "Gregory Heyworth is a textual scientist; he and his lab work on new ways to read ancient manuscripts and maps using spectral imaging technology. In this fascinating talk, watch as Heyworth shines a light on lost history, deciphering texts that haven't been read in thousands of years. How could these lost classics rewrite what we know about the past?<img src=\"http://feeds.feedburner.com/~r/iTunesPodcastTTArts/~4/r66jOqWYv9M\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "85034019",
            "sourceUrl": "http://feedproxy.google.com/~r/iTunesPodcastTTArts/~5/O7tchSNMR9A/GregoryHeyworth_2015X-480p.mp4",
            "categories": [
                "Higher Education"
            ]
        },
        {
            "title": "Dive into an ocean photographer's world | Thomas Peschak",
            "datePublished": "Mon, 29 Feb 2016 15:54:30 +0000",
            "description": "Somersaulting manta rays, dashing dolphins, swarming schools of fish and munching sharks inhabit a world beneath the ocean's surface that few get a chance to see. Conservation photographer Thomas Peschak visits incredible seascapes around the world, and his photos reveal these hidden ecosystems. \"You can't love something and become a champion for it if you don't know it exists,\" he says. Join Peschak in a new, immersive TED Talk format as he shares his stunning work and his dream for a future of respectful coexistence with the ocean.<img src=\"http://feeds.feedburner.com/~r/iTunesPodcastTTArts/~4/Oz136XFp6Ho\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "72909234",
            "sourceUrl": "http://feedproxy.google.com/~r/iTunesPodcastTTArts/~5/5-y_qnILyeM/ThomasPeschak_2015Z-480p.mp4",
            "categories": [
                "Higher Education"
            ]
        },
        {
            "title": "The beauty of human skin in every color | Angélica Dass",
            "datePublished": "Mon, 28 Mar 2016 15:22:30 +0000",
            "description": "Angélica Dass's photography challenges how we think about skin color and ethnic identity. In this personal talk, hear about the inspiration behind her portrait project, Humanæ, and her pursuit to document humanity's true colors rather than the untrue white, red, black and yellow associated with race.<img src=\"http://feeds.feedburner.com/~r/iTunesPodcastTTArts/~4/zDYG3zkvLLo\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "39282830",
            "sourceUrl": "http://feedproxy.google.com/~r/iTunesPodcastTTArts/~5/_8ZcUpH04tk/AngelicaDass_2016.mp4",
            "categories": [
                "Higher Education"
            ]
        },
        {
            "title": "The magic ingredient that brings Pixar movies to life | Danielle Feinberg",
            "datePublished": "Wed, 06 Apr 2016 14:42:59 +0000",
            "description": "Danielle Feinberg, Pixar's director of photography, creates stories with soul and wonder using math, science and code. Go behind the scenes of Finding Nemo, Toy Story, Brave, WALL-E and more, and discover how Pixar interweaves art and science to create fantastic worlds where the things you imagine can become real. This talk comes from the PBS special \"TED Talks: Science & Wonder.\"<img src=\"http://feeds.feedburner.com/~r/iTunesPodcastTTArts/~4/aEgGuRLlm0Q\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "86804407",
            "sourceUrl": "http://feedproxy.google.com/~r/iTunesPodcastTTArts/~5/Fs5x0ulNbl4/DanielleFeinberg_2015P-480p.mp4",
            "categories": [
                "Higher Education"
            ]
        },
        {
            "title": "Wisdom from great writers on every year of life | Joshua Prager",
            "datePublished": "Tue, 19 Apr 2016 13:08:58 +0000",
            "description": "As different as we humans are from one another, we all age along the same great sequence, and the shared patterns of our lives pass into the pages of the books we love. In this moving talk, journalist Joshua Prager explores the stages of life through quotations from Norman Mailer, Joyce Carol Oates, William Trevor and other great writers, set to visualizations by graphic designer Milton Glaser. \"Books tell us who we've been, who we are, who we will be, too,\" Prager says.<img src=\"http://feeds.feedburner.com/~r/iTunesPodcastTTArts/~4/RoFGMEUF6jM\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "43847711",
            "sourceUrl": "http://feedproxy.google.com/~r/iTunesPodcastTTArts/~5/pYkiS1VMrJ0/JoshPrager_2015A-480p.mp4",
            "categories": [
                "Higher Education"
            ]
        },
        {
            "title": "Insightful human portraits made from data | R. Luke DuBois",
            "datePublished": "Tue, 26 Apr 2016 15:06:25 +0000",
            "description": "Artist R. Luke DuBois makes unique portraits of presidents, cities, himself and even Britney Spears using data and personality. In this talk, he shares nine projects -- from maps of the country built using information taken from millions of dating profiles to a gun that fires a blank every time a shooting is reported in New Orleans. His point: the way we use technology reflects on us and our culture, and we reduce others to data points at our own peril.<img src=\"http://feeds.feedburner.com/~r/iTunesPodcastTTArts/~4/1E0CbTH2tzs\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "91895427",
            "sourceUrl": "http://feedproxy.google.com/~r/iTunesPodcastTTArts/~5/DUOniynW14Y/RLukeDuBois_2016-480p.mp4",
            "categories": [
                "Higher Education"
            ]
        },
        {
            "title": "Pirates, nurses and other rebel designers | Alice Rawsthorn",
            "datePublished": "Tue, 03 May 2016 15:08:34 +0000",
            "description": "In this ode to design renegades, Alice Rawsthorn highlights the work of unlikely heroes, from Blackbeard to Florence Nightingale. Drawing a line from these bold thinkers to some early modern visionaries like Buckminster Fuller, Rawsthorn shows how the greatest designers are often the most rebellious.<img src=\"http://feeds.feedburner.com/~r/iTunesPodcastTTArts/~4/OqV_kWRHgQI\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "84296358",
            "sourceUrl": "http://feedproxy.google.com/~r/iTunesPodcastTTArts/~5/0W8A-3tCmo8/AliceRawsthorn_2016-480p.mp4",
            "categories": [
                "Higher Education"
            ]
        },
        {
            "title": "An artist's unflinching look at racial violence | Sanford Biggers",
            "datePublished": "Wed, 11 May 2016 14:44:53 +0000",
            "description": "Conceptual artist and TED Fellow Sanford Biggers uses painting, sculpture, video and performance to spark challenging conversations about the history and trauma of black America. Join him as he details two compelling works and shares the motivation behind his art. \"Only through more thoughtful dialogue about history and race can we evolve as individuals and society,\" Biggers says.<img src=\"http://feeds.feedburner.com/~r/iTunesPodcastTTArts/~4/0gQiNXefiz4\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "31639011",
            "sourceUrl": "http://feedproxy.google.com/~r/iTunesPodcastTTArts/~5/idbmUTGpa28/SanfordBiggers_2016U-480p.mp4",
            "categories": [
                "Higher Education"
            ]
        },
        {
            "title": "Drawings that show the beauty and fragility of Earth | Zaria Forman",
            "datePublished": "Wed, 25 May 2016 15:00:38 +0000",
            "description": "Zaria Forman's large-scale compositions of melting glaciers, icebergs floating in glassy water and waves cresting with foam explore moments of transition, turbulence and tranquility. Join her as she discusses the meditative process of artistic creation and the motivation behind her work. \"My drawings celebrate the beauty of what we all stand to lose,\" she says. \"I hope they can serve as records of sublime landscapes in flux.\"<img src=\"http://feeds.feedburner.com/~r/iTunesPodcastTTArts/~4/CkGIZ4jC1Do\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "52336460",
            "sourceUrl": "http://feedproxy.google.com/~r/iTunesPodcastTTArts/~5/P7x8JEoLlxI/ZariaForman_2015P-480p.mp4",
            "categories": [
                "Higher Education"
            ]
        },
        {
            "title": "My journey from Marine to actor | Adam Driver",
            "datePublished": "Fri, 27 May 2016 15:10:29 +0000",
            "description": "Before he fought in the galactic battles of Star Wars, Adam Driver was a United States Marine with 1/1 Weapons Company. He tells the story of how and why he became a Marine, the complex transition from soldier to civilian -- and Arts in the Armed Forces, his nonprofit that brings theater to the military. Because, as he says: \"Self-expression is just as valuable a tool as a rifle on your shoulder.\" Followed by a spirited performance of Marco Ramirez's \"I am not Batman\" by Jesse J. Perez and Matt Johnson. (Adult language)<img src=\"http://feeds.feedburner.com/~r/iTunesPodcastTTArts/~4/Zs6ltrDJVEY\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "129271655",
            "sourceUrl": "http://feedproxy.google.com/~r/iTunesPodcastTTArts/~5/8o-0zzHOnBM/AdamDriver_2015P-480p.mp4",
            "categories": [
                "Higher Education"
            ]
        },
        {
            "title": "The passing of time, caught in a single photo | Stephen Wilkes",
            "datePublished": "Fri, 03 Jun 2016 14:51:37 +0000",
            "description": "Photographer Stephen Wilkes crafts stunning compositions of landscapes as they transition from day to night, exploring the space-time continuum within a two-dimensional still photograph. Journey with him to iconic locations like the Tournelle Bridge in Paris, El Capitan in Yosemite National Park and a life-giving watering hole in heart of the Serengeti in this tour of his art and process.<img src=\"http://feeds.feedburner.com/~r/iTunesPodcastTTArts/~4/UAJgyZXTC6s\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "88797591",
            "sourceUrl": "http://feedproxy.google.com/~r/iTunesPodcastTTArts/~5/C6DU4LHOlzI/StephenWilkes_2016-480p.mp4",
            "categories": [
                "Higher Education"
            ]
        },
        {
            "title": "Every piece of art you've ever wanted to see -- up close and searchable | Amit Sood",
            "datePublished": "Tue, 07 Jun 2016 15:01:43 +0000",
            "description": "What does a cultural Big Bang look like? For Amit Sood, director of Google's Cultural Institute and Art Project, it's an online platform where anyone can explore the world's greatest collections of art and artifacts in vivid, lifelike detail. Join Sood and Google artist in residence Cyril Diagne in a mind-bending demo of experiments from the Cultural Institute and glimpse the exciting future of accessibility to arts and culture.<img src=\"http://feeds.feedburner.com/~r/iTunesPodcastTTArts/~4/koocfTTg60o\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "107554646",
            "sourceUrl": "http://feedproxy.google.com/~r/iTunesPodcastTTArts/~5/d_tUUWPs9TI/AmitSood_2016-480p.mp4",
            "categories": [
                "Higher Education"
            ]
        },
        {
            "title": "Why I keep speaking up, even when people mock my accent | Safwat Saleem",
            "datePublished": "Thu, 07 Jul 2016 15:21:10 +0000",
            "description": "Artist Safwat Saleem grew up with a stutter -- but as an independent animator, he decided to do his own voiceovers to give life to his characters. When YouTube commenters started mocking his Pakistani accent, it crushed him, and his voice began to leave his work. Hear how this TED Fellow reclaimed his voice and confidence in this charming, thoughtful talk.<img src=\"http://feeds.feedburner.com/~r/iTunesPodcastTTArts/~4/7889SzC9HYA\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "77587093",
            "sourceUrl": "http://feedproxy.google.com/~r/iTunesPodcastTTArts/~5/3K2H89TFS5U/SafwatSaleem_2016U-480p.mp4",
            "categories": [
                "Higher Education"
            ]
        },
        {
            "title": "My love letter to cosplay | Adam Savage",
            "datePublished": "Fri, 15 Jul 2016 15:07:43 +0000",
            "description": "Adam Savage makes things and builds experiments, and he uses costumes to add humor, color and clarity to the stories he tells. Tracing his lifelong love of costumes -- from a childhood space helmet made of an ice cream tub to a No-Face costume he wore to Comic-Con -- Savage explores the world of cosplay and the meaning it creates for its community. \"We're connecting with something important inside of us,\" he says. \"The costumes are how we reveal ourselves to each other.\"<img src=\"http://feeds.feedburner.com/~r/iTunesPodcastTTArts/~4/5-2vaQ4yVbs\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "94214736",
            "sourceUrl": "http://feedproxy.google.com/~r/iTunesPodcastTTArts/~5/36nBeKmJg3A/AdamSavage_2016-480p.mp4",
            "categories": [
                "Higher Education"
            ]
        },
        {
            "title": "A project of peace, painted across 50 buildings | eL Seed",
            "datePublished": "Tue, 19 Jul 2016 15:07:46 +0000",
            "description": "eL Seed fuses Arabic calligraphy with graffiti to paint colorful, swirling messages of hope and peace on buildings from Tunisia to Paris. The artist and TED Fellow shares the story of his most ambitious project yet: a mural painted across 50 buildings in Manshiyat Naser, a district of Cairo, Egypt, that can only be fully seen from a nearby mountain.<img src=\"http://feeds.feedburner.com/~r/iTunesPodcastTTArts/~4/GGVeyHmiEGU\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "82193018",
            "sourceUrl": "http://feedproxy.google.com/~r/iTunesPodcastTTArts/~5/fRA916leong/eLSeed_2016T-480p.mp4",
            "categories": [
                "Higher Education"
            ]
        },
        {
            "title": "The spellbinding art of human anatomy | Vanessa Ruiz",
            "datePublished": "Fri, 26 Aug 2016 15:21:54 +0000",
            "description": "Vanessa Ruiz takes us on an illustrated journey of human anatomical art over the centuries, sharing captivating images that bring this visual science -- and the contemporary artists inspired by it -- to life. \"Anatomical art has the power to reach far beyond the pages of a medical textbook,\" she says, \"connecting our innermost selves with our bodies through art.\"<img src=\"http://feeds.feedburner.com/~r/iTunesPodcastTTArts/~4/qz5K4cuUnlM\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "82132906",
            "sourceUrl": "http://feedproxy.google.com/~r/iTunesPodcastTTArts/~5/OcYPvMrQ9Ec/VanessaRuiz_2015P-480p.mp4",
            "categories": [
                "Higher Education"
            ]
        },
        {
            "title": "How loss helped one artist find beauty in imperfection | Alyssa Monks",
            "datePublished": "Wed, 26 Oct 2016 15:05:59 +0000",
            "description": "Painter Alyssa Monks finds beauty and inspiration in the unknown, the unpredictable and even the awful. In a poetic, intimate talk, she describes the interaction of life, paint and canvas through her development as an artist, and as a human.<img src=\"http://feeds.feedburner.com/~r/iTunesPodcastTTArts/~4/jgfMwjxuwmQ\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "92689842",
            "sourceUrl": "http://feedproxy.google.com/~r/iTunesPodcastTTArts/~5/8OCJz7nqQt4/AlyssaMonks_2015X-480p.mp4",
            "categories": [
                "Higher Education"
            ]
        },
        {
            "title": "Ballroom dance that breaks gender roles | Trevor Copp and Jeff Fox",
            "datePublished": "Fri, 14 Oct 2016 14:59:07 +0000",
            "description": "Tango, waltz, foxtrot ... these classic ballroom dances quietly perpetuate an outdated idea: that the man always leads and the woman always follows. That's an idea worth changing, say Trevor Copp and Jeff Fox, as they demonstrate their \"Liquid Lead\" dance technique along with fellow dancer Alida Esmail. Watch as Copp and Fox captivate and command the stage while boldly deconstructing and transforming the art of ballroom dance.<img src=\"http://feeds.feedburner.com/~r/iTunesPodcastTTArts/~4/AdpPWwUfeig\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "111449400",
            "sourceUrl": "http://feedproxy.google.com/~r/iTunesPodcastTTArts/~5/e_yBRMzXl64/TrevorCopp_2015X-480p.mp4",
            "categories": [
                "Higher Education"
            ]
        },
        {
            "title": "Art can heal PTSD's invisible wounds | Melissa Walker",
            "datePublished": "Wed, 12 Oct 2016 15:09:02 +0000",
            "description": "Trauma silences its victims, says creative arts therapist Melissa Walker, but art can help those suffering from the psychological wounds of war begin to open up and heal. In this inspiring talk, Walker describes how mask-making, in particular, allows afflicted servicemen and women reveal what haunts them -- and, finally, start to let it go.<img src=\"http://feeds.feedburner.com/~r/iTunesPodcastTTArts/~4/_P7SfbEjVvk\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "69384601",
            "sourceUrl": "http://feedproxy.google.com/~r/iTunesPodcastTTArts/~5/tvsAFR_1goY/MelissaWalker_2015P-480p.mp4",
            "categories": [
                "Higher Education"
            ]
        },
        {
            "title": "Art made of the air we breathe | Emily Parsons-Lord",
            "datePublished": "Thu, 19 Jan 2017 15:57:51 +0000",
            "description": "Emily Parsons-Lord re-creates air from distinct moments in Earth's history -- from the clean, fresh-tasting air of the Carboniferous period to the soda-water air of the Great Dying to the heavy, toxic air of the future we're creating. By turning air into art, she invites us to know the invisible world around us. Breathe in the Earth's past and future in this imaginative, trippy talk.<img src=\"http://feeds.feedburner.com/~r/iTunesPodcastTTArts/~4/nbhlkipYpSQ\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "76683816",
            "sourceUrl": "http://feedproxy.google.com/~r/iTunesPodcastTTArts/~5/Q3n9HAQAqX0/EmilyParsonsLord_2016X-480p.mp4",
            "categories": [
                "Higher Education"
            ]
        },
        {
            "title": "Buildings that blend nature and city | Jeanne Gang",
            "datePublished": "Tue, 24 Jan 2017 16:13:03 +0000",
            "description": "A skyscraper that channels the breeze ... a building that creates community around a hearth ... Jeanne Gang uses architecture to build relationships. In this engaging tour of her work, Gang invites us into buildings large and small, from a surprising local community center to a landmark Chicago skyscraper. \"Through architecture, we can do much more than create buildings,\" she says. \"We can help steady this planet we all share.\"<img src=\"http://feeds.feedburner.com/~r/iTunesPodcastTTArts/~4/IbQvRIjKYGw\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "85878709",
            "sourceUrl": "http://feedproxy.google.com/~r/iTunesPodcastTTArts/~5/HkTIUyh73ho/JeanneGang_2016W-480p.mp4",
            "categories": [
                "Higher Education"
            ]
        },
        {
            "title": "Should we simplify spelling? | Karina Galperin",
            "datePublished": "Thu, 16 Mar 2017 15:00:10 +0000",
            "description": "How much energy and brain power do we devote to learning how to spell? Language evolves over time, and with it the way we spell -- is it worth it to spend so much time memorizing rules that are filled with endless exceptions? Literary scholar Karina Galperin suggests that it may be time for an update in the way we think about and record language. (In Spanish with English subtitles)<img src=\"http://feeds.feedburner.com/~r/iTunesPodcastTTArts/~4/FnlNdwcE9AI\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "113461264",
            "sourceUrl": "http://feedproxy.google.com/~r/iTunesPodcastTTArts/~5/i2UtNi3ECw8/KarinaGalperin_2015X-480p.mp4",
            "categories": [
                "Higher Education"
            ]
        },
        {
            "title": "The data behind Hollywood's sexism | Stacy Smith",
            "datePublished": "Fri, 24 Feb 2017 15:50:04 +0000",
            "description": "Where are all the women and girls in film? Social scientist Stacy Smith analyzes how the media underrepresents and portrays women -- and the potentially destructive effects those portrayals have on viewers. She shares hard data behind gender bias in Hollywood, where on-screen males outnumber females three to one (and behind-the-camera workers fare even worse.)<img src=\"http://feeds.feedburner.com/~r/iTunesPodcastTTArts/~4/EGZId9DTl3g\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "112863203",
            "sourceUrl": "http://feedproxy.google.com/~r/iTunesPodcastTTArts/~5/9k0eRKHGZ2A/StacySmith_2016W-480p.mp4",
            "categories": [
                "Higher Education"
            ]
        },
        {
            "title": "Beautiful new words to describe obscure emotions | John Koenig",
            "datePublished": "Fri, 10 Mar 2017 16:01:47 +0000",
            "description": "John Koenig loves finding words that express our unarticulated feelings -- like \"lachesism,\" the hunger for disaster, and \"sonder,\" the realization that everyone else's lives are as complex and unknowable as our own. Here, he meditates on the meaning we assign to words and how these meanings latch onto us.<img src=\"http://feeds.feedburner.com/~r/iTunesPodcastTTArts/~4/4qElLRA_umM\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "53200928",
            "sourceUrl": "http://feedproxy.google.com/~r/iTunesPodcastTTArts/~5/WA5LJ9VDovw/JohnKoenig_2016X-480p.mp4",
            "categories": [
                "Higher Education"
            ]
        },
        {
            "title": "A young poet tells the story of Darfur | Emtithal Mahmoud",
            "datePublished": "Fri, 31 Mar 2017 15:12:16 +0000",
            "description": "Emtithal \"Emi\" Mahmoud writes poetry of resilience, confronting her experience of escaping the genocide in Darfur in verse. She shares two stirring original poems about refugees, family, joy and sorrow, asking, \"Will you witness me?\"<img src=\"http://feeds.feedburner.com/~r/iTunesPodcastTTArts/~4/1Zx2wnQUU24\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "78352363",
            "sourceUrl": "http://feedproxy.google.com/~r/iTunesPodcastTTArts/~5/Ue71e1uSivc/EmtithalMahmoud_2016P-480p.mp4",
            "categories": [
                "Higher Education"
            ]
        },
        {
            "title": "How do you build a sacred space? | Siamak Hariri",
            "datePublished": "Mon, 17 Apr 2017 14:48:33 +0000",
            "description": "To design the Bahá'í Temple of South America, architect Siamak Hariri focused on illumination -- from the temple's form, which captures the movement of the sun throughout the day, to the iridescent, luminous stone and glass used to construct it. Join Hariri for a journey through the creative process, as he explores what makes for a sacred experience in a secular world.<img src=\"http://feeds.feedburner.com/~r/iTunesPodcastTTArts/~4/Xf8NRQ45-TM\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "91964563",
            "sourceUrl": "http://feedproxy.google.com/~r/iTunesPodcastTTArts/~5/B_Dkah0uiN8/SiamakHariri_2017S-480p.mp4",
            "categories": [
                "Higher Education"
            ]
        },
        {
            "title": "Poetry, music and identity | Jorge Drexler",
            "datePublished": "Wed, 10 May 2017 15:15:23 +0000",
            "description": "One night in 2002, a friend gave Jorge Drexler the chorus to a song and challenged him to write the rest of it using a complex, poetic form known as the \"Décima.\" In this fascinating talk, Drexler examines the blended nature of identity, weaving together the history of the Décima with his own quest to write one. He closes the talk with a performance of the resulting song, \"La Milonga del Moro Judío.\" (In Spanish with English subtitles)<img src=\"http://feeds.feedburner.com/~r/iTunesPodcastTTArts/~4/kLlLxCYR--I\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "118346086",
            "sourceUrl": "http://feedproxy.google.com/~r/iTunesPodcastTTArts/~5/1MkuWowqm-U/JorgeDrexler_2017U-480p.mp4",
            "categories": [
                "Higher Education"
            ]
        },
        {
            "title": "Why glass towers are bad for city life -- and what we need instead | Justin Davidson",
            "datePublished": "Tue, 06 Jun 2017 14:58:44 +0000",
            "description": "There's a creepy transformation taking over our cities, says architecture critic Justin Davidson. From Houston, Texas to Guangzhou, China, shiny towers of concrete and steel covered with glass are cropping up like an invasive species. Rethink your city's anatomy as Davidson explains how the exteriors of building shape the urban experience -- and what we lose when architects stop using the full range of available materials.<img src=\"http://feeds.feedburner.com/~r/iTunesPodcastTTArts/~4/lIG5L32Y-CI\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "91459989",
            "sourceUrl": "http://feedproxy.google.com/~r/iTunesPodcastTTArts/~5/JQkMd-_WkQw/JustinDavidson_2017S-480p.mp4",
            "categories": [
                "Higher Education"
            ]
        },
        {
            "title": "12 truths I learned from life and writing | Anne Lamott",
            "datePublished": "Fri, 09 Jun 2017 15:06:36 +0000",
            "description": "A few days before she turned 61, writer Anne Lamott decided to write down everything she knew for sure. She dives into the nuances of being a human who lives in a confusing, beautiful, emotional world, offering her characteristic life-affirming wisdom and humor on family, writing, the meaning of God, death and more.<img src=\"http://feeds.feedburner.com/~r/iTunesPodcastTTArts/~4/Zp98BNNUWKg\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "113916804",
            "sourceUrl": "http://feedproxy.google.com/~r/iTunesPodcastTTArts/~5/wY3ZWr-hyAU/AnneLamott_2017-480p.mp4",
            "categories": [
                "Higher Education"
            ]
        },
        {
            "title": "Why design should include everyone | Sinéad Burke",
            "datePublished": "Wed, 21 Jun 2017 15:03:28 +0000",
            "description": "Sinéad Burke is acutely aware of details that are practically invisible to many of us. At 105 centimeters (or 3' 5\") tall, the designed world -- from the height of a lock to the range of available shoe sizes -- often inhibits her ability to do things for herself. Here she tells us what it's like to navigate the world as a little person and asks: \"Who are we not designing for?\"<img src=\"http://feeds.feedburner.com/~r/iTunesPodcastTTArts/~4/8PVfE7foJv0\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "72044045",
            "sourceUrl": "http://feedproxy.google.com/~r/iTunesPodcastTTArts/~5/ED4XtPmm_40/SineadBurke_2017S-480p.mp4",
            "categories": [
                "Higher Education"
            ]
        },
        {
            "title": "Can art amend history? | Titus Kaphar",
            "datePublished": "Tue, 01 Aug 2017 15:01:50 +0000",
            "description": "Artist Titus Kaphar makes paintings and sculptures that wrestle with the struggles of the past while speaking to the diversity and advances of the present. In an unforgettable live workshop, Kaphar takes a brush full of white paint to a replica of a 17th-century Frans Hals painting, obscuring parts of the composition and bringing its hidden story into view. There's a narrative coded in art like this, Kaphar says. What happens when we shift our focus and confront unspoken truths?<img src=\"http://feeds.feedburner.com/~r/iTunesPodcastTTArts/~4/v3SsyFvFtIw\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "92489322",
            "sourceUrl": "http://feedproxy.google.com/~r/iTunesPodcastTTArts/~5/7l1fLGlcsuU/TitusKaphar_2017-480p.mp4",
            "categories": [
                "Higher Education"
            ]
        },
        {
            "title": "How cohousing can make us happier (and live longer) | Grace Kim",
            "datePublished": "Mon, 24 Jul 2017 14:52:37 +0000",
            "description": "Loneliness doesn't always stem from being alone. For architect Grace Kim, loneliness is a function of how socially connected we feel to the people around us -- and it's often the result of the homes we live in. She shares an age-old antidote to isolation: cohousing, a way of living where people choose to share space with their neighbors, get to know them, and look after them. Rethink your home and how you live in it with this eye-opening talk.<img src=\"http://feeds.feedburner.com/~r/iTunesPodcastTTArts/~4/ms4F9eDN9v4\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "73961245",
            "sourceUrl": "http://feedproxy.google.com/~r/iTunesPodcastTTArts/~5/XqgAzn0WuqU/GraceKim_2017-480p.mp4",
            "categories": [
                "Higher Education"
            ]
        },
        {
            "title": "The stories behind The New Yorker's iconic covers | Françoise Mouly",
            "datePublished": "Thu, 03 Aug 2017 14:24:04 +0000",
            "description": "Meet Françoise Mouly, The New Yorker's art director. For the past 24 years, she's helped decide what appears on the magazine's famous cover, from the black-on-black depiction of the Twin Towers the week after 9/11 to a recent, Russia-influenced riff on the magazine's mascot, Eustace Tilley. In this visual retrospective, Mouly considers how a simple drawing can cut through the torrent of images that we see every day and elegantly capture the feeling (and the sensibility) of a moment in time.<img src=\"http://feeds.feedburner.com/~r/iTunesPodcastTTArts/~4/16foux6U-cE\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "61523169",
            "sourceUrl": "http://feedproxy.google.com/~r/iTunesPodcastTTArts/~5/Dc9hRqw5DwI/FrancoiseMouly_2017S-480p.mp4",
            "categories": [
                "Higher Education"
            ]
        },
        {
            "title": "How your brain decides what is beautiful | Anjan Chatterjee",
            "datePublished": "Tue, 08 Aug 2017 14:40:37 +0000",
            "description": "Anjan Chatterjee uses tools from evolutionary psychology and cognitive neuroscience to study one of nature's most captivating concepts: beauty. Learn more about the science behind why certain configurations of line, color and form excite us in this fascinating, deep look inside your brain.<img src=\"http://feeds.feedburner.com/~r/iTunesPodcastTTArts/~4/XIMwyqDX69k\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "106416802",
            "sourceUrl": "http://feedproxy.google.com/~r/iTunesPodcastTTArts/~5/SUogvHkXwVs/AnjanChatterjee_2016P-480p.mp4",
            "categories": [
                "Higher Education"
            ]
        },
        {
            "title": "How artists can (finally) get paid in the digital age  | Jack Conte",
            "datePublished": "Wed, 16 Aug 2017 15:00:17 +0000",
            "description": "It's been a weird 100 years for artists and creators, says musician and entrepreneur Jack Conte. The traditional ways we've turned art into money (like record sales) have been broken by the internet, leaving musicians, writers and artists wondering how to make a living. With Patreon, Conte has created a way for artists on the internet to get paid by their fans. Could payment platforms like this change what it means to be an artist in the digital age?<img src=\"http://feeds.feedburner.com/~r/iTunesPodcastTTArts/~4/zQNkfG2yWcs\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "75706573",
            "sourceUrl": "http://feedproxy.google.com/~r/iTunesPodcastTTArts/~5/yVpBLskTK3A/JackConte_2017-480p.mp4",
            "categories": [
                "Higher Education"
            ]
        },
        {
            "title": "7 principles for building better cities | Peter Calthorpe",
            "datePublished": "Thu, 17 Aug 2017 14:53:23 +0000",
            "description": "More than half of the world's population already lives in cities, and another 2.5 billion people are projected to move to urban areas by 2050. The way we build new cities will be at the heart of so much that matters, from climate change to economic vitality to our very well-being and sense of connectedness. Peter Calthorpe is already at work planning the cities of the future and advocating for community design that's focused on human interaction. He shares seven universal principles for solving sprawl and building smarter, more sustainable cities.<img src=\"http://feeds.feedburner.com/~r/iTunesPodcastTTArts/~4/W7kU5-St3RA\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "103039161",
            "sourceUrl": "http://feedproxy.google.com/~r/iTunesPodcastTTArts/~5/hN-gsBrdXAw/PeterCalthorpe_2017-480p.mp4",
            "categories": [
                "Higher Education"
            ]
        },
        {
            "title": "A lyrical bridge between past, present and future | David Whyte",
            "datePublished": "Wed, 23 Aug 2017 14:55:47 +0000",
            "description": "With his signature charm and searching insight, David Whyte meditates on the frontiers of the past, present and future, sharing two poems inspired by his niece's hike along El Camino de Santiago de Compostela in Spain.<img src=\"http://feeds.feedburner.com/~r/iTunesPodcastTTArts/~4/Qu4vpHnGhI4\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "145142735",
            "sourceUrl": "http://feedproxy.google.com/~r/iTunesPodcastTTArts/~5/9O1p_DfOBk0/DavidWhyte_2017-480p.mp4",
            "categories": [
                "Higher Education"
            ]
        },
        {
            "title": "A dance to honor Mother Earth | Jon Boogz and Lil Buck",
            "datePublished": "Fri, 11 Aug 2017 10:56:02 +0000",
            "description": "Movement artists Jon Boogz and Lil Buck debut \"Honor thy mother,\" a delicate, powerful performance of spoken word, violin and dance that draws on the tormented relationship between nature and humanity.<img src=\"http://feeds.feedburner.com/~r/iTunesPodcastTTArts/~4/HdXHYIRoIsE\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "69100719",
            "sourceUrl": "http://feedproxy.google.com/~r/iTunesPodcastTTArts/~5/if9Am_GMr7c/JonBoogzandLilBuck_2017-480p.mp4",
            "categories": [
                "Higher Education"
            ]
        },
        {
            "title": "How your pictures can help reclaim lost history | Chance Coughenour",
            "datePublished": "Thu, 31 Aug 2017 19:23:56 +0000",
            "description": "Digital archaeologist Chance Coughenour is using pictures -- your pictures -- to reclaim antiquities that have been lost to conflict and disaster. After crowdsourcing photographs of destroyed monuments, museums and artifacts, Coughenour uses advanced technology called photogrammetry to create 3D reconstructions, preserving the memory of our global, shared, human heritage. Find out more about how you can help celebrate and safeguard history that's being lost.<img src=\"http://feeds.feedburner.com/~r/iTunesPodcastTTArts/~4/yop6PU1QddI\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "85868298",
            "sourceUrl": "http://feedproxy.google.com/~r/iTunesPodcastTTArts/~5/e_PgSNNnOLs/ChanceCoughenour_2016X-480p.mp4",
            "categories": [
                "Higher Education"
            ]
        },
        {
            "title": "Fun, fierce and fantastical African art | Wanuri Kahiu",
            "datePublished": "Tue, 29 Aug 2017 14:36:36 +0000",
            "description": "We're so used to narratives out of Africa being about war, poverty and devastation, says TED Fellow Wanuri Kahiu. Where's the fun? Introducing \"AfroBubbleGum\" -- African art that's vibrant, lighthearted and without a political agenda. Rethink the value of all that is unserious as Kahiu explains why we need art that captures the full range of human experiences to tell the stories of Africa.<img src=\"http://feeds.feedburner.com/~r/iTunesPodcastTTArts/~4/4oxE5Opo88k\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "37816919",
            "sourceUrl": "http://feedproxy.google.com/~r/iTunesPodcastTTArts/~5/dMaNkKEDT_4/WanuriKahiu_2017U-480p.mp4",
            "categories": [
                "Higher Education"
            ]
        },
        {
            "title": "\"The Sacred Art of the Ori\" | Laolu Senbanjo",
            "datePublished": "Fri, 25 Aug 2017 14:57:57 +0000",
            "description": "Every artist has a name, and every artist has a story. Laolu Senbanjo's story started in Nigeria, where he was surrounded by the culture and mythology of the Yoruba, and brought him to law school, to New York and eventually to work on Beyoncé's \"Lemonade.\" He shares what he calls \"The Sacred Art of the Ori,\" art that uses skin as canvas and connects artist and muse through mind, body and soul.<img src=\"http://feeds.feedburner.com/~r/iTunesPodcastTTArts/~4/4PJ-R5SAsNI\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "63840293",
            "sourceUrl": "http://feedproxy.google.com/~r/iTunesPodcastTTArts/~5/vN9WwKBuc-Q/LaoluSenbanjo_2017-480p.mp4",
            "categories": [
                "Higher Education"
            ]
        },
        {
            "title": "Living sculptures that stand for history's truths | Sethembile Msezane",
            "datePublished": "Fri, 15 Sep 2017 15:08:13 +0000",
            "description": "In the century-old statues that occupy Cape Town, Sethembile Mzesane didn't see anything that looked like her own reality. So she became a living sculpture herself, standing for hours on end in public spaces dressed in symbolic costumes, to reclaim the city and its public spaces for her community. In this powerful, tour-de-force talk, she shares the stories and motivation behind her mesmerizing performance art.<img src=\"http://feeds.feedburner.com/~r/iTunesPodcastTTArts/~4/cZKhJmxWcwE\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "95687578",
            "sourceUrl": "http://feedproxy.google.com/~r/iTunesPodcastTTArts/~5/zmvY90LBDN4/SethembileMsezane_2017G-480p.mp4",
            "categories": [
                "Higher Education"
            ]
        },
        {
            "title": "The forgotten art of the zoetrope | Eric Dyer",
            "datePublished": "Tue, 10 Oct 2017 19:59:52 +0000",
            "description": "Artist Eric Dyer spent years working at a computer to produce images for the screen. Longing to get his hands back on his work, he began exploring the zoetrope, a popular 19th-century device that was used to create the illusion of motion long before the arrival of film. In this vibrant talk, he showcases his resulting art inventions: spinning sculptures and that evoke beautiful, dreamlike scenes. (Warning: This talk includes flashing images and lights. Those who are photosensitive or have seizures trigged by strobes are advised to avoid.)<img src=\"http://feeds.feedburner.com/~r/iTunesPodcastTTArts/~4/2YR_bgVxXxI\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "62969120",
            "sourceUrl": "http://feedproxy.google.com/~r/iTunesPodcastTTArts/~5/S5r3-CDTCY0/EricDyer_2016X-480p.mp4",
            "categories": [
                "Higher Education"
            ]
        },
        {
            "title": "Portraits that transform people into whatever they want to be | Uldus Bakhtiozina",
            "datePublished": "Thu, 19 Oct 2017 14:54:18 +0000",
            "description": "With her gorgeous, haunting photographs, artist Uldus Bakhtiozina documents dreams, working with daily life as she imagines it could be. She creates everything in her work by hand -- from costumes to stages -- without digital manipulation, bringing us images from the land of escapism, where anyone can become something else.<img src=\"http://feeds.feedburner.com/~r/iTunesPodcastTTArts/~4/ijlrW4Jr4_g\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "52970331",
            "sourceUrl": "http://feedproxy.google.com/~r/iTunesPodcastTTArts/~5/L38uM9Po16w/UldusBakhtiozina_2017U-480p.mp4",
            "categories": [
                "Higher Education"
            ]
        },
        {
            "title": "Sci-fi stories that imagine a future Africa | Nnedi Okorafor",
            "datePublished": "Wed, 01 Nov 2017 15:14:36 +0000",
            "description": "\"My science fiction has different ancestors -- African ones,\" says writer Nnedi Okorafor. In between excerpts from her \"Binti\" series and her novel \"Lagoon,\" Okorafor discusses the inspiration and roots of her work -- and how she opens strange doors through her Afrofuturist writing.<img src=\"http://feeds.feedburner.com/~r/iTunesPodcastTTArts/~4/PXu1Gkb9R6I\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "67753949",
            "sourceUrl": "http://feedproxy.google.com/~r/iTunesPodcastTTArts/~5/F8gSBP6aiMU/NnediOkorafor_2017G-480p.mp4",
            "categories": [
                "Higher Education"
            ]
        },
        {
            "title": "Why do I make art? To build time capsules for my heritage | Kayla Briët",
            "datePublished": "Fri, 17 Nov 2017 16:04:20 +0000",
            "description": "Kayla Briët creates art that explores identity and self-discovery -- and the fear that her culture may someday be forgotten. She shares how she found her creative voice and reclaimed the stories of her Dutch-Indonesian, Chinese and Native American heritage by infusing them into film and music time capsules.<img src=\"http://feeds.feedburner.com/~r/iTunesPodcastTTArts/~4/weda6dPlSgY\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "43169724",
            "sourceUrl": "http://feedproxy.google.com/~r/iTunesPodcastTTArts/~5/kawrfhrr-nU/KaylaBriet_2017U-480p.mp4",
            "categories": [
                "Higher Education"
            ]
        },
        {
            "title": "Why must artists be poor? | Hadi Eldebek",
            "datePublished": "Thu, 15 Mar 2018 19:47:51 +0000",
            "description": "The arts bring meaning to our lives and spirit to our culture -- so why do we expect artists to struggle to make a living?  Hadi Eldebek is working to create a society where artists are valued through an online platform that matches artists with grants and funding opportunities -- so they can focus on their craft instead of their side hustle.<img src=\"http://feeds.feedburner.com/~r/iTunesPodcastTTArts/~4/IMYRA9HN8l4\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "48580402",
            "sourceUrl": "http://feedproxy.google.com/~r/iTunesPodcastTTArts/~5/oKWXyjvUDb4/HadiEldebek_2016S-480p.mp4",
            "categories": [
                "Higher Education"
            ]
        },
        {
            "title": "The future of storytelling | Shonda Rhimes and Cyndi Stivers",
            "datePublished": "Mon, 30 Oct 2017 15:09:38 +0000",
            "description": "\"We all feel a compelling need to watch stories, to tell stories ... to discuss the things that tell each one of us that we are not alone in the world,\" says TV titan Shonda Rhimes. A dominant force in television since \"Grey's Anatomy\" hit the airwaves, Rhimes discusses the future of media networks, how she's using her narrative-building skills as a force for good, an intriguing concept known as \"Amish summers\" and much more, in conversation with Cyndi Stivers, director of the TED Residency.<img src=\"http://feeds.feedburner.com/~r/iTunesPodcastTTArts/~4/3IKHQL4XIws\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "157267878",
            "sourceUrl": "http://feedproxy.google.com/~r/iTunesPodcastTTArts/~5/vJLZqn_EUc4/ShondaRhimesandCyndiStivers_2017U-480p.mp4",
            "categories": [
                "Higher Education"
            ]
        },
        {
            "title": "The secret language of letter design | Martina Flor",
            "datePublished": "Tue, 05 Dec 2017 20:55:24 +0000",
            "description": "Look at the letters around you: on street signs, stores, restaurant menus, the covers of books. Whether you realize it or not, the letters are speaking to you, telling you something beyond the literal text -- that whatever they represent is modern or finely crafted or fantastical or zany. Learn to decode this secret language with lettering designer Martina Flor as she explains how altering the shapes, colors and textures of letters changes how we perceive them. (In Spanish with English subtitles)<img src=\"http://feeds.feedburner.com/~r/iTunesPodcastTTArts/~4/i9x5K7p6NaE\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "86954448",
            "sourceUrl": "http://feedproxy.google.com/~r/iTunesPodcastTTArts/~5/5mTXQdphw1E/MartinaFlor_2016X-480p.mp4",
            "categories": [
                "Higher Education"
            ]
        },
        {
            "title": "What makes something go viral? | Dao Nguyen",
            "datePublished": "Thu, 07 Dec 2017 16:01:43 +0000",
            "description": "What's the secret to making content people love? Join BuzzFeed's Publisher Dao Nguyen for a glimpse at how her team creates their tempting quizzes, lists and videos -- and learn more about how they've developed a system to understand how people use content to connect and create culture.<img src=\"http://feeds.feedburner.com/~r/iTunesPodcastTTArts/~4/gLHGp4dFodw\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "75660685",
            "sourceUrl": "http://feedproxy.google.com/~r/iTunesPodcastTTArts/~5/nwc_s6rEfsc/DaoNguyen_2017S-480p.mp4",
            "categories": [
                "Higher Education"
            ]
        },
        {
            "title": "The gift of words | Javed Akhtar",
            "datePublished": "Mon, 18 Dec 2017 15:42:15 +0000",
            "description": "\"Do you know what I mean?\" Legendary poet, lyricist and screenwriter Javed Akhtar asks why we seem to be losing our power to use words -- and inspires us to better understand and communicate with one another using this near-magical tool that carries our culture across generations. (In Hindi with English subtitles)<img src=\"http://feeds.feedburner.com/~r/iTunesPodcastTTArts/~4/gjh_BTD1cRQ\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "71543954",
            "sourceUrl": "http://feedproxy.google.com/~r/iTunesPodcastTTArts/~5/QZlEEaDB43Y/JavedAkhtar_2017I-480p.mp4",
            "categories": [
                "Higher Education"
            ]
        },
        {
            "title": "The next generation of African architects and designers | Christian Benimana",
            "datePublished": "Thu, 21 Dec 2017 15:23:26 +0000",
            "description": "Christian Benimana wants to build a network of architects who can help Africa's booming cities flourish in sustainable, equitable ways -- balancing growth with values that are uniquely African. From Nigeria to Burkina Faso and beyond, he shares examples of architecture bringing communities together. A pan-African movement of architects, designers and engineers on the continent and in diaspora are learning from and inspiring each other, and Benimana invites us to imagine future African cities as the most resilient, socially inclusive places on earth.<img src=\"http://feeds.feedburner.com/~r/iTunesPodcastTTArts/~4/rMGGIAa7Nck\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "93644859",
            "sourceUrl": "http://feedproxy.google.com/~r/iTunesPodcastTTArts/~5/FKBWCVofGpA/ChristianBenimana_2017G-480p.mp4",
            "categories": [
                "Higher Education"
            ]
        },
        {
            "title": " Inside Africa's thriving art scene | Touria El Glaoui",
            "datePublished": "Mon, 08 Jan 2018 15:54:16 +0000",
            "description": "Art fair curator Touria El Glaoui is on a mission to showcase vital new art from African nations and the diaspora. She shares beautiful, inspiring, thrilling contemporary art that tells powerful stories of African identity and history -- including works by Senegalese photographer Omar Victor Diop, Moroccan artist Hassan Hajjaj and Zimbabwean painter Kudzanai-Violet Hwami. \"It is really through art that we can regain our sense of agency and empowerment,\" El Glaoui says. \"It is through art that we can really tell our own story.\"<img src=\"http://feeds.feedburner.com/~r/iTunesPodcastTTArts/~4/A7oZtTY8UJE\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "58002995",
            "sourceUrl": "http://feedproxy.google.com/~r/iTunesPodcastTTArts/~5/Nnn1uguDboo/TouriaElGlaoui_2017G-480p.mp4",
            "categories": [
                "Higher Education"
            ]
        },
        {
            "title": "How adaptive clothing empowers people with disabilities | Mindy Scheier",
            "datePublished": "Tue, 09 Jan 2018 15:58:23 +0000",
            "description": "Do you have a favorite T-shirt or pair of jeans that transforms you and makes you feel confident -- makes you feel like you? That's because what you wear can affect your mood, your health and your self-esteem, says fashion designer Mindy Scheier. Inspired by her son, who was born with a degenerative disorder that makes it hard for him to dress himself or wear clothing with buttons or zippers, Scheier set out to make clothing that works for everyone, including the differently abled. Learn more about how she's made fashion history by producing the world's first mainstream adaptive clothing line.<img src=\"http://feeds.feedburner.com/~r/iTunesPodcastTTArts/~4/yYNH10uG6dU\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "98616740",
            "sourceUrl": "http://feedproxy.google.com/~r/iTunesPodcastTTArts/~5/Gw7T_44WFIc/MindyScheier_2017S-480p.mp4",
            "categories": [
                "Higher Education"
            ]
        },
        {
            "title": "Photos of Africa, taken from a flying lawn chair | George Steinmetz",
            "datePublished": "Wed, 24 Jan 2018 15:54:31 +0000",
            "description": "George Steinmetz's spectacular photos show Africa from the air, taken from the world's slowest, lightest aircraft. Join Steinmetz to discover the surprising historical, ecological and sociopolitical patterns that emerge when you go low and slow in a flying lawn chair.<img src=\"http://feeds.feedburner.com/~r/iTunesPodcastTTArts/~4/5pKHM4RyCjI\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "77701299",
            "sourceUrl": "http://feedproxy.google.com/~r/iTunesPodcastTTArts/~5/9aoAR59lU0k/GeorgeSteinmetz_2017G-480p.mp4",
            "categories": [
                "Higher Education"
            ]
        },
        {
            "title": "Want to change the world? Start by being brave enough to care | Cleo Wade",
            "datePublished": "Fri, 19 Jan 2018 15:52:00 +0000",
            "description": "Artist and poet Cleo Wade recites a moving poem about being an advocate for love and acceptance in a time when both seem in short supply. Woven between stories of people at the beginning and end of their lives, she shares some truths about growing up (and speaking up) and reflects on the wisdom of a life well-lived, leaving us with a simple yet enduring takeaway: be good to yourself, be good to others, be good to the earth. \"The world will say to you, 'Be a better person,'\" Wade says. \"Do not be afraid to say, 'Yes.'\"<img src=\"http://feeds.feedburner.com/~r/iTunesPodcastTTArts/~4/rzamfihO1dc\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "79341192",
            "sourceUrl": "http://feedproxy.google.com/~r/iTunesPodcastTTArts/~5/8vO9-_qjuCY/CleoWade_2017W-480p.mp4",
            "categories": [
                "Higher Education"
            ]
        },
        {
            "title": "The search for \"aha!\" moments | Matt Goldman",
            "datePublished": "Tue, 16 Jan 2018 15:53:49 +0000",
            "description": "In 1988, Matt Goldman co-founded Blue Man Group, an off-Broadway production that became a sensation known for its humor, blue body paint and wild stunts. The show works on the premise that certain conditions can create \"aha moments\" -- moments of surprise, learning and exuberance -- frequent and intentional rather than random and occasional. Now Goldman is working to apply the lessons learned from Blue Man Group to education, creating Blue School, a school that balances academic mastery, creative thinking and self and social intelligence. \"We need to cultivate safe and conducive conditions for new and innovative ideas to evolve and thrive,\" Goldman says.<img src=\"http://feeds.feedburner.com/~r/iTunesPodcastTTArts/~4/Fk7w8g8_1No\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "102186832",
            "sourceUrl": "http://feedproxy.google.com/~r/iTunesPodcastTTArts/~5/gYbbyQzzyiI/MattGoldman_2017S-480p.mp4",
            "categories": [
                "Higher Education"
            ]
        },
        {
            "title": "How architecture can create dignity for all | John Cary",
            "datePublished": "Wed, 07 Feb 2018 15:54:42 +0000",
            "description": "If architect and writer John Cary has his way, women will never need to stand in pointlessly long bathroom lines again. Lines like these are representative of a more serious issue, Cary says: the lack of diversity in design that leads to thoughtless, compassionless spaces. Design has a unique ability to dignify and make people feel valued, respected, honored and seen -- but the flip side is also true. Cary calls for architects and designers to expand their ranks and commit to serving the public good, not just the privileged few. \"Well-designed spaces are not just a matter of taste or a questions of aesthetics,\" he says. \"They literally shape our ideas about who we are in the world and what we deserve.\" And we all deserve better.<img src=\"http://feeds.feedburner.com/~r/iTunesPodcastTTArts/~4/9xgYjtIt8vU\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "97519926",
            "sourceUrl": "http://feedproxy.google.com/~r/iTunesPodcastTTArts/~5/L0bWbQqzUmY/JohnCary_2017W-480p.mp4",
            "categories": [
                "Higher Education"
            ]
        },
        {
            "title": "Fashion that celebrates African strength and spirit | Walé Oyéjidé",
            "datePublished": "Thu, 15 Feb 2018 15:58:18 +0000",
            "description": "\"To be African is to be inspired by culture and to be filled with undying hope for the future,\" says designer and TED Fellow Walé Oyéjidé. With his label Ikiré Jones (you'll see their work in Marvel's \"Black Panther\"), he uses classic design to showcase the elegance and grace of often-marginalized groups, in beautifully cut clothing that tells a story.<img src=\"http://feeds.feedburner.com/~r/iTunesPodcastTTArts/~4/ULKnZc-u8hU\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "36427467",
            "sourceUrl": "http://feedproxy.google.com/~r/iTunesPodcastTTArts/~5/25BSGMrbDBc/WaleOyejide_2017G-480p.mp4",
            "categories": [
                "Higher Education"
            ]
        },
        {
            "title": "3 creative ways to fix fashion's waste problem | Amit Kalra",
            "datePublished": "Thu, 15 Feb 2018 20:55:22 +0000",
            "description": "What happens to the clothes we don't buy? You might think that last season's coats, trousers and turtlenecks end up being put to use, but most of it (nearly 13 million tons each year in the United States alone) ends up in landfills. Fashion has a waste problem, and Amit Kalra wants to fix it. He shares some creative ways the industry can evolve to be more conscientious about the environment -- and gain a competitive advantage at the same time.<img src=\"http://feeds.feedburner.com/~r/iTunesPodcastTTArts/~4/oo0P1qwM8OA\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "71064211",
            "sourceUrl": "http://feedproxy.google.com/~r/iTunesPodcastTTArts/~5/82DmZOjK2GQ/AmitKalra_2017S-480p.mp4",
            "categories": [
                "Higher Education"
            ]
        },
        {
            "title": "How fashion helps us express who we are -- and what we stand for | Kaustav Dey",
            "datePublished": "Tue, 06 Mar 2018 20:53:47 +0000",
            "description": "No one thinks twice about a woman wearing blue jeans in New York City -- but when Nobel laureate Malala wears them, it's a political act. Around the globe, individuality can be a crime, and clothing can be a form of protest. In a talk about the power of what we wear, Kaustav Dey examines how fashion gives us a nonverbal language of dissent and encourages us to embrace our authentic selves.<img src=\"http://feeds.feedburner.com/~r/iTunesPodcastTTArts/~4/tqJ4yzBQA1M\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "90843511",
            "sourceUrl": "http://feedproxy.google.com/~r/iTunesPodcastTTArts/~5/Lo11BohufMs/KaustavDey_2017S-480p.mp4",
            "categories": [
                "Higher Education"
            ]
        },
        {
            "title": "The radical beauty of Africa, in portraits | Iké Udé",
            "datePublished": "Mon, 12 Mar 2018 14:33:38 +0000",
            "description": "Throughout his colorful career and bodies of work, Iké Udé has found creative ways to reject the negative portrayal of Africans rampant in Western media. In this tour of his work, he shares evocative portraits that blend clothing, props and poses from many cultures at once into sharp takes on the varied, complex beauty of Africa.<img src=\"http://feeds.feedburner.com/~r/iTunesPodcastTTArts/~4/F5crDkm6JxQ\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "97167359",
            "sourceUrl": "http://feedproxy.google.com/~r/iTunesPodcastTTArts/~5/UoS_PhwIXFU/IkeUde_2017G-480p.mp4",
            "categories": [
                "Higher Education"
            ]
        },
        {
            "title": "What soccer can teach us about freedom | Marc Bamuthi Joseph",
            "datePublished": "Mon, 05 Mar 2018 20:56:19 +0000",
            "description": "\"Soccer is the only thing on this planet that we can all agree to do together,\" says theater maker and TED Fellow Marc Bamuthi Joseph. Through his performances and an engagement initiative called \"Moving and Passing,\" Joseph combines music, dance and soccer to reveal accessible, joyful connections between the arts and sports. Learn more about how he's using the beautiful game to foster community and highlight issues facing immigrants.<img src=\"http://feeds.feedburner.com/~r/iTunesPodcastTTArts/~4/wAxcoD8Kgr0\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "41921899",
            "sourceUrl": "http://feedproxy.google.com/~r/iTunesPodcastTTArts/~5/fFBbS0krIyI/MarcBamuthiJoseph_2017G-480p.mp4",
            "categories": [
                "Higher Education"
            ]
        },
        {
            "title": "How I use art to bridge misunderstanding | Adong Judith",
            "datePublished": "Mon, 19 Mar 2018 20:03:55 +0000",
            "description": "Director and playwright Adong Judith creates provocative art that sparks dialogue on issues from LGBTQ rights to war crimes. In this quick but powerful talk, the TED Fellow details her work -- including the play \"Silent Voices,\" which brought victims of the Northern Ugandan war against Joseph Kony's rebel group together with political, religious and cultural leaders for transformative talks. \"Listening to one another will not magically solve all problems,\" Judith says. \"But it will give a chance to create avenues to start to work together to solve many of humanity's problems.\"<img src=\"http://feeds.feedburner.com/~r/iTunesPodcastTTArts/~4/HqN5bgIezOE\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "37002364",
            "sourceUrl": "http://feedproxy.google.com/~r/iTunesPodcastTTArts/~5/kf6lueXpAiI/AdongJudith_2017G-480p.mp4",
            "categories": [
                "Higher Education"
            ]
        },
        {
            "title": "How the arts help homeless youth heal and build | Malika Whitley",
            "datePublished": "Wed, 11 Apr 2018 20:49:12 +0000",
            "description": "Malika Whitley is the founder of ChopArt, an organization for homeless teens focused on mentorship, dignity and opportunity through the arts. In this moving, personal talk, she shares her story of homelessness and finding her voice through arts -- and her mission to provide a creative outlet for others who have been pushed to the margins of society.<img src=\"http://feeds.feedburner.com/~r/iTunesPodcastTTArts/~4/05osUwV8-OQ\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "47216754",
            "sourceUrl": "http://feedproxy.google.com/~r/iTunesPodcastTTArts/~5/40df6qdK71E/MalikaWhitley_2017S-480p.mp4",
            "categories": [
                "Higher Education"
            ]
        },
        {
            "title": "Visions of Africa's future, from African filmmakers | Dayo Ogunyemi",
            "datePublished": "Tue, 24 Apr 2018 19:58:42 +0000",
            "description": "By expanding boundaries, exploring possibilities and conveying truth, films have helped change Africa's reality (even before \"Black Panther\"). Dayo Ogunyemi invites us to imagine Africa's future through the lens of inspiring filmmakers from across the continent, showing us how they can inspire Africa to make a hundred-year leap.<img src=\"http://feeds.feedburner.com/~r/iTunesPodcastTTArts/~4/M1SpPG1R74s\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "85325091",
            "sourceUrl": "http://feedproxy.google.com/~r/iTunesPodcastTTArts/~5/uN0Gyr8L8JM/DayoOgunyemi_2017G-480p.mp4",
            "categories": [
                "Higher Education"
            ]
        },
        {
            "title": "3 ways to create a space that moves you, from a Broadway set designer | David Korins",
            "datePublished": "Tue, 09 Oct 2018 19:53:56 +0000",
            "description": "You don't have to work on Broadway to design a set, says creative director David Korins -- you can be the set designer of any space in your life. Sharing insights from his work on hits like \"Hamilton\" and \"Dear Evan Hansen,\" Korins offers a three-step process to start creating the world you want to live in.<img src=\"http://feeds.feedburner.com/~r/iTunesPodcastTTArts/~4/DzYbDHniYgA\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "76494023",
            "sourceUrl": "http://feedproxy.google.com/~r/iTunesPodcastTTArts/~5/mFE9-Tic-34/DavidKorins_2018X-480p.mp4",
            "categories": [
                "Higher Education"
            ]
        },
        {
            "title": "Why theater is essential to democracy | Oskar Eustis",
            "datePublished": "Mon, 04 Jun 2018 15:01:12 +0000",
            "description": "Truth comes from the collision of different ideas, and theater plays an essential role in showing us that truth, says legendary artistic director Oskar Eustis. In this powerful talk, Eustis outlines his plan to reach (and listen to) people in places across the US where the theater, like many other institutions, has turned its back -- like the deindustrialized Rust Belt. \"Our job is to try to hold up a vision to America that shows not only who all of us are individually, but that welds us back into the commonality that we need to be,\" Eustis says. \"That's what the theater is supposed to do.\"<img src=\"http://feeds.feedburner.com/~r/iTunesPodcastTTArts/~4/Dr97iCjn1ZQ\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "94654584",
            "sourceUrl": "http://feedproxy.google.com/~r/iTunesPodcastTTArts/~5/5kzJA3HLkno/OskarEustis_2018-480p.mp4",
            "categories": [
                "Higher Education"
            ]
        },
        {
            "title": "How to build a thriving music scene in your city | Elizabeth Cawein",
            "datePublished": "Thu, 27 Sep 2018 14:58:45 +0000",
            "description": "How does a city become known as a \"music city\"? Publicist Elizabeth Cawein explains how thriving music scenes make cities healthier and happier and shares ideas for bolstering your local music scene -- and showing off your city's talent to the world.<img src=\"http://feeds.feedburner.com/~r/iTunesPodcastTTArts/~4/2vwOfrfWH6g\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "70259742",
            "sourceUrl": "http://feedproxy.google.com/~r/iTunesPodcastTTArts/~5/fN4Bq7Veejo/ElizabethCawein_2018X-480p.mp4",
            "categories": [
                "Higher Education"
            ]
        },
        {
            "title": "The symbols of systemic racism -- and how to take away their power | Paul Rucker",
            "datePublished": "Tue, 26 Jun 2018 19:55:21 +0000",
            "description": "Multidisciplinary artist and TED Fellow Paul Rucker is unstitching the legacy of systemic racism in the United States. A collector of artifacts connected to the history of slavery -- from branding irons and shackles to postcards depicting lynchings -- Rucker couldn't find an undamaged Ku Klux Klan robe for his collection, so he began making his own. The result: striking garments in non-traditional fabrics like kente cloth, camouflage and silk that confront the normalization of systemic racism in the US. \"If we as a people collectively look at these objects and realize that they are part of our history, we can find a way to where they have no more power over us,\" Rucker says. (This talk contains graphic images.)<img src=\"http://feeds.feedburner.com/~r/iTunesPodcastTTArts/~4/EQvqft6obXA\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "50838695",
            "sourceUrl": "http://feedproxy.google.com/~r/iTunesPodcastTTArts/~5/IR1F8AM0XLs/PaulRucker_2018U-480p.mp4",
            "categories": [
                "Higher Education"
            ]
        },
        {
            "title": "You are fluent in this language (and don't even know it) | Christoph Niemann",
            "datePublished": "Fri, 27 Jul 2018 14:43:04 +0000",
            "description": "Without realizing it, we're fluent in the language of pictures, says illustrator Christoph Niemann. In a charming talk packed with witty, whimsical drawings, Niemann takes us on a hilarious visual tour that shows how artists tap into our emotions and minds -- all without words.<img src=\"http://feeds.feedburner.com/~r/iTunesPodcastTTArts/~4/mAFwSrhv9kQ\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "91325739",
            "sourceUrl": "http://feedproxy.google.com/~r/iTunesPodcastTTArts/~5/MqhcrpFypaQ/ChristophNiemann_2018-480p.mp4",
            "categories": [
                "Higher Education"
            ]
        },
        {
            "title": "\"Chasms\" | Asali DeVan Ecclesiastes",
            "datePublished": "Fri, 28 Sep 2018 12:37:56 +0000",
            "description": "Writer and activist Asali DeVan Ecclesiastes lights up the stage with a powerful poem about hope, truth and the space between who we are and who we want to be.<img src=\"http://feeds.feedburner.com/~r/iTunesPodcastTTArts/~4/FI0orYygZS8\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "46342463",
            "sourceUrl": "http://feedproxy.google.com/~r/iTunesPodcastTTArts/~5/cK1a3VaStcM/AsaliDeVanEcclesiastes_2017W-480p.mp4",
            "categories": [
                "Higher Education"
            ]
        },
        {
            "title": "\"Wild Women\" | Sunni Patterson",
            "datePublished": "Fri, 31 Aug 2018 12:57:57 +0000",
            "description": "With lightning on her tongue, Sunni Patterson performs her powerful poem, \"Wild Women,\" accompanied by the entrancing moves of dancer Chanice Holmes.<img src=\"http://feeds.feedburner.com/~r/iTunesPodcastTTArts/~4/dpBST83RtKA\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "33628773",
            "sourceUrl": "http://feedproxy.google.com/~r/iTunesPodcastTTArts/~5/eoH6XkO0wpc/SunniPatterson_2017W-480p.mp4",
            "categories": [
                "Higher Education"
            ]
        },
        {
            "title": "The genius behind some of the world's most famous buildings | Renzo Piano",
            "datePublished": "Fri, 13 Jul 2018 15:27:42 +0000",
            "description": "Legendary architect Renzo Piano -- the mind behind such indelible buildings as The Shard in London, the Centre Pompidou in Paris and the new Whitney Museum of Art in New York City -- takes us on a stunning tour through his life's work. With the aid of gorgeous imagery, Piano makes an eloquent case for architecture as the answer to our dreams, aspirations and desire for beauty. \"Universal beauty is one of the few things that can change the world,\" he says. \"This beauty will save the world. One person at a time, but it will do it.\"<img src=\"http://feeds.feedburner.com/~r/iTunesPodcastTTArts/~4/YZWATyo7Q7A\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "108306157",
            "sourceUrl": "http://feedproxy.google.com/~r/iTunesPodcastTTArts/~5/dq-h2c0xGIQ/RenzoPiano_2018-480p.mp4",
            "categories": [
                "Higher Education"
            ]
        },
        {
            "title": "Why art thrives at Burning Man | Nora Atkinson",
            "datePublished": "Tue, 28 Aug 2018 14:47:54 +0000",
            "description": "Craft curator Nora Atkinson takes us on a trip to Nevada's Black Rock Desert to see the beautifully designed and participatory art of Burning Man, revealing how she discovered there what's often missing from museums: curiosity and engagement. \"What is art for in our contemporary world if not this?\" she asks.<img src=\"http://feeds.feedburner.com/~r/iTunesPodcastTTArts/~4/kfTUXWNEt2w\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "74676402",
            "sourceUrl": "http://feedproxy.google.com/~r/iTunesPodcastTTArts/~5/fPp388fhvCs/NoraAtkinson_2018-480p.mp4",
            "categories": [
                "Higher Education"
            ]
        },
        {
            "title": "My quest to defy gravity and fly | Elizabeth Streb",
            "datePublished": "Thu, 25 Oct 2018 14:50:14 +0000",
            "description": "Over the course of her fearless career, extreme action specialist Elizabeth Streb has pushed the limits of the human body. She's jumped through broken glass, toppled from great heights and built gizmos to provide a boost along the way. Backed by footage of her work, Streb reflects on her lifelong quest to defy gravity and fly the only way a human can -- by mastering the landing.<img src=\"http://feeds.feedburner.com/~r/iTunesPodcastTTArts/~4/tNnzJP1Lv8o\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "66595966",
            "sourceUrl": "http://feedproxy.google.com/~r/iTunesPodcastTTArts/~5/SUYVK4flC5E/ElizabethStreb_2018-480p.mp4",
            "categories": [
                "Higher Education"
            ]
        },
        {
            "title": "How art can shape America's conversation about freedom | Dread Scott",
            "datePublished": "Mon, 27 Aug 2018 14:54:26 +0000",
            "description": "In this quick talk, visual artist Dread Scott tells the story of one of his most transgressive art installations, which drew national attention for its controversial use of the American flag and led to a landmark First Amendment case in the US Supreme Court.<img src=\"http://feeds.feedburner.com/~r/iTunesPodcastTTArts/~4/L7iaPfgJa6Y\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "33565289",
            "sourceUrl": "http://feedproxy.google.com/~r/iTunesPodcastTTArts/~5/FrrYn6_BVhM/DreadScott_2018U-480p.mp4",
            "categories": [
                "Higher Education"
            ]
        },
        {
            "title": "\"Interpassion\" / \"Ba$$in\" |  Yelle",
            "datePublished": "Mon, 20 Aug 2018 12:53:28 +0000",
            "description": "Yelle and GrandMarnier bring their danceable electropop hits to the TED stage in an energizing performance of two songs, \"Interpassion\" and \"Ba$$in.\"<img src=\"http://feeds.feedburner.com/~r/iTunesPodcastTTArts/~4/qYYfulNUHS8\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "53331405",
            "sourceUrl": "http://feedproxy.google.com/~r/iTunesPodcastTTArts/~5/LtevqFgcGf0/Yelle_2018S-480p.mp4",
            "categories": [
                "Higher Education"
            ]
        },
        {
            "title": "Intimate photos of a senior love triangle | Isadora Kosofsky",
            "datePublished": "Fri, 28 Sep 2018 14:53:15 +0000",
            "description": "Photographer and TED Fellow Isadora Kosofsky is a chronicler of love, loss and loneliness. In this searching talk, she shares photos from her four years documenting the lives of a senior citizen love triangle -- and reveals what they can teach us about the universal search for identity and belonging.<img src=\"http://feeds.feedburner.com/~r/iTunesPodcastTTArts/~4/bYAyM96on-E\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "39046004",
            "sourceUrl": "http://feedproxy.google.com/~r/iTunesPodcastTTArts/~5/zvVLZAk0Vew/IsadoraKosofsky_2018U-480p.mp4",
            "categories": [
                "Higher Education"
            ]
        },
        {
            "title": "How I accidentally changed the way movies get made | Franklin Leonard",
            "datePublished": "Wed, 07 Nov 2018 15:48:23 +0000",
            "description": "How does Hollywood choose what stories get told on-screen? Too often, it's groupthink informed by a narrow set of ideas about what sells at the box office. As a producer, Franklin Leonard saw too many great screenplays never get made because they didn't fit the mold. So he started the Black List, an anonymous email that shared his favorite screenplays and asked: Why aren't we making these movies? Learn the origin story of some of your favorite films with this fascinating insider view of the movie business.<img src=\"http://feeds.feedburner.com/~r/iTunesPodcastTTArts/~4/lw73T9Hj4OU\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "117306136",
            "sourceUrl": "http://feedproxy.google.com/~r/iTunesPodcastTTArts/~5/-CK5CVQtkv4/FranklinLeonard_2017X-480p.mp4",
            "categories": [
                "Higher Education"
            ]
        },
        {
            "title": "A lesson on looking | Amy Herman",
            "datePublished": "Thu, 06 Dec 2018 15:40:55 +0000",
            "description": "Are you looking closely? Visual educator Amy Herman explains how to use art to enhance your powers of perception and find connections where they may not be apparent. Learn the techniques Herman uses to train Navy SEALs, doctors and crime scene investigators to convert observable details into actionable knowledge with this insightful talk.<img src=\"http://feeds.feedburner.com/~r/iTunesPodcastTTArts/~4/JXUhhV5uZ5s\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "93572671",
            "sourceUrl": "http://feedproxy.google.com/~r/iTunesPodcastTTArts/~5/CfdoGMbEt9s/AmyHerman_2018S-480p.mp4",
            "categories": [
                "Higher Education"
            ]
        },
        {
            "title": "The story of Marvel's first queer Latina superhero | Gabby Rivera",
            "datePublished": "Thu, 29 Nov 2018 15:56:18 +0000",
            "description": "With Marvel's \"America Chavez,\" Gabby Rivera wrote a new kind of superhero -- one who can punch portals into other dimensions while also embracing her gentle, goofy, soft side. In a funny, personal talk, Rivera shares how her own childhood as a queer Puerto Rican in the Bronx informed this new narrative -- and shows images from the comic book that reveal what happens when a superhero embraces her humanity. As she says: \"That myth of having to go it alone and be tough is not serving us.\"<img src=\"http://feeds.feedburner.com/~r/iTunesPodcastTTArts/~4/2MKyFqJWrW4\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "81250273",
            "sourceUrl": "http://feedproxy.google.com/~r/iTunesPodcastTTArts/~5/6Fx2j_fPLSc/GabbyRivera_2018S-480p.mp4",
            "categories": [
                "Higher Education"
            ]
        },
        {
            "title": "Museums should honor the everyday, not just the extraordinary | Ariana Curtis",
            "datePublished": "Fri, 21 Dec 2018 15:46:35 +0000",
            "description": "Who deserves to be in a museum? For too long, the answer has been \"the extraordinary\" -- those aspirational historymakers who inspire us with their successes. But those stories are limiting, says museum curator Ariana Curtis. In a visionary talk, she imagines how museums can more accurately represent history by honoring the lives of people both extraordinary and everyday, prominent and hidden -- and amplify diverse perspectives that should have always been included.<img src=\"http://feeds.feedburner.com/~r/iTunesPodcastTTArts/~4/TaPZaKLrg74\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "88630861",
            "sourceUrl": "http://feedproxy.google.com/~r/iTunesPodcastTTArts/~5/IZZ7ijlmOTo/ArianaCurtis_2018W-480p.mp4",
            "categories": [
                "Higher Education"
            ]
        },
        {
            "title": "Stunning buildings made from raw, imperfect materials | Débora Mesa Molina",
            "datePublished": "Thu, 24 Jan 2019 18:35:52 +0000",
            "description": "What would it take to reimagine the limits of architecture? Débora Mesa Molina offers some answers in this breathtaking, visual tour of her work, showing how structures can be made with overlooked materials and unconventional methods -- or even extracted from the guts of the earth. \"The world around us is an infinite source of inspiration if we are curious enough to see beneath the surface of things,\" she says.<img src=\"http://feeds.feedburner.com/~r/iTunesPodcastTTArts/~4/6wRnZuZeTe8\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "87068540",
            "sourceUrl": "http://feedproxy.google.com/~r/iTunesPodcastTTArts/~5/EoUFYUUvqnU/DeboraMesaMolina_2018S-480p.mp4",
            "categories": [
                "Higher Education"
            ]
        },
        {
            "title": "Why I turned Chicago's abandoned homes into art | Amanda Williams",
            "datePublished": "Tue, 19 Mar 2019 14:40:47 +0000",
            "description": "Amanda Williams shares her lifelong fascination with the complexity of color: from her experiences with race and redlining to her discovery of color theory to her work as a visual artist. Journey with Williams to Chicago's South Side and explore \"Color(ed) Theory,\" a two-year art project in which she painted soon-to-be-demolished houses bold, monochromatic colors infused with local meaning -- catalyzing conversations and making the hidden visible.<img src=\"http://feeds.feedburner.com/~r/iTunesPodcastTTArts/~4/8izFXURUb7o\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "97059972",
            "sourceUrl": "http://feedproxy.google.com/~r/iTunesPodcastTTArts/~5/-OHYbEGBiPM/AmandaWilliams_2018W-480p.mp4",
            "categories": [
                "Higher Education"
            ]
        },
        {
            "title": "Public art that turns cities into playgrounds of the imagination | Helen Marriage",
            "datePublished": "Wed, 03 Apr 2019 14:53:47 +0000",
            "description": "Visual artist Helen Marriage stages astonishing, large-scale public art events that expand the boundaries of what's possible. In this visual tour of her work, she tells the story of three cities she transformed into playgrounds of the imagination -- picture London with a giant mechanical elephant marching through it -- and shows what happens when people stop to marvel and experience a moment together.<img src=\"http://feeds.feedburner.com/~r/iTunesPodcastTTArts/~4/VlwzMQ9rjjU\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "87366705",
            "sourceUrl": "http://feedproxy.google.com/~r/iTunesPodcastTTArts/~5/AjbahbgWSS8/HelenMarriage_2018W-480p.mp4",
            "categories": [
                "Higher Education"
            ]
        },
        {
            "title": "Three ideas. Three contradictions. Or not. | Hannah Gadsby",
            "datePublished": "Mon, 29 Apr 2019 18:39:15 +0000",
            "description": "Hannah Gadsby's groundbreaking special \"Nanette\" broke comedy. In a talk about truth and purpose, she shares three ideas and three contradictions. Or not.<img src=\"http://feeds.feedburner.com/~r/iTunesPodcastTTArts/~4/HiFVKRtpUxg\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "132942518",
            "sourceUrl": "http://feedproxy.google.com/~r/iTunesPodcastTTArts/~5/vFMJXZJR768/HannahGadsby_2019-480p.mp4",
            "categories": [
                "Higher Education"
            ]
        },
        {
            "title": "Mind-blowing stage sculptures that fuse music and technology | Es Devlin",
            "datePublished": "Fri, 03 May 2019 14:49:35 +0000",
            "description": "It starts with a sketch. Then it evolves into a larger-than-life visual masterpiece, a celebration of human connection. Follow along as legendary artist and designer Es Devlin takes us on a visual tour of her work -- including iconic stage sculptures she's created for Beyoncé, Adele, Kanye West, U2 and more -- and previews her design for the upcoming World Expo 2020 in Dubai.<img src=\"http://feeds.feedburner.com/~r/iTunesPodcastTTArts/~4/16kM6wyAgaY\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "121077216",
            "sourceUrl": "http://feedproxy.google.com/~r/iTunesPodcastTTArts/~5/Co6cyvIkyP0/EsDevlin_2019-480p.mp4",
            "categories": [
                "Higher Education"
            ]
        },
        {
            "title": "Floating cities, the LEGO House and other architectural forms of the future | Bjarke Ingels",
            "datePublished": "Mon, 03 Jun 2019 14:44:20 +0000",
            "description": "Design gives form to the future, says architect Bjarke Ingels. In this worldwide tour of his team's projects, journey to a waste-to-energy power plant (that doubles as an alpine ski slope) and the LEGO Home of the Brick in Denmark -- and catch a glimpse of cutting-edge flood resilience infrastructure in New York City as well as an ambitious plan to create floating, sustainable cities that are adapted to climate change.<img src=\"http://feeds.feedburner.com/~r/iTunesPodcastTTArts/~4/IEiyGALKgLA\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "110563403",
            "sourceUrl": "http://feedproxy.google.com/~r/iTunesPodcastTTArts/~5/XA5KBLXtx6Q/BjarkeIngels_2019-480p.mp4",
            "categories": [
                "Higher Education"
            ]
        },
        {
            "title": "Architectural secrets of the world's ancient wonders | Brandon Clifford",
            "datePublished": "Fri, 21 Jun 2019 14:55:54 +0000",
            "description": "How did ancient civilizations move massive stones to build Stonehenge, the Pyramids and the Easter Island statues? In this quick, delightful talk, TED Fellow Brandon Clifford reveals some architectural secrets of the past and shows how we can use these ingenious techniques to build today. \"In an era where we design buildings to last 30, maybe 60 years, I would love to learn how to create something that could entertain for an eternity,\" he says.<img src=\"http://feeds.feedburner.com/~r/iTunesPodcastTTArts/~4/Deui_FLYiBc\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "31972524",
            "sourceUrl": "http://feedproxy.google.com/~r/iTunesPodcastTTArts/~5/dvZUPKDdkf8/BrandonClifford_2019U-480p.mp4",
            "categories": [
                "Higher Education"
            ]
        },
        {
            "title": "\"A Bird Made of Birds\" | Sarah Kay",
            "datePublished": "Fri, 21 Jun 2019 12:44:12 +0000",
            "description": "\"The universe has already written the poem you were planning on writing,\" says Sarah Kay, quoting her friend, poet Kaveh Akbar. Performing \"A Bird Made of Birds,\" she shares how and where she finds poetry. (Kay is also the host of TED's podcast \"Sincerely, X.\" Listen on the Luminary podcast app at luminary.link/ted)<img src=\"http://feeds.feedburner.com/~r/iTunesPodcastTTArts/~4/tZl58R1OON0\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "35668821",
            "sourceUrl": "http://feedproxy.google.com/~r/iTunesPodcastTTArts/~5/CvtXO2ZnTys/SarahKay_2019-480p.mp4",
            "categories": [
                "Higher Education"
            ]
        },
        {
            "title": "Mentalism, mind reading and the art of getting inside your head | Derren Brown",
            "datePublished": "Tue, 16 Jul 2019 14:47:36 +0000",
            "description": "\"Magic is a great analogy for how we edit reality and form a story -- and then mistake that story for the truth,\" says psychological illusionist Derren Brown. In a clever talk wrapped around a dazzling mind-reading performance, Brown explores the seductive appeal of finding simple answers to life's complex and subtle questions.<img src=\"http://feeds.feedburner.com/~r/iTunesPodcastTTArts/~4/ea6Fbt-WXtg\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "103557570",
            "sourceUrl": "http://feedproxy.google.com/~r/iTunesPodcastTTArts/~5/6Gie9IIJX54/DerrenBrown_2019-480p.mp4",
            "categories": [
                "Higher Education"
            ]
        },
        {
            "title": "How film transforms the way we see the world | Sharmeen Obaid-Chinoy",
            "datePublished": "Fri, 12 Jul 2019 14:50:38 +0000",
            "description": "Film has the power to change the way we think about ourselves and our culture. Documentarian and TED Fellow Sharmeen Obaid-Chinoy uses it to fight violence against women, turning her camera on the tradition of honor killings in Pakistan. In a stirring talk, she shares how she took her Oscar-winning film on the road in a mobile cinema, visiting small towns and villages across Pakistan -- and shifting the dynamics between women, men and society, one screening at a time.<img src=\"http://feeds.feedburner.com/~r/iTunesPodcastTTArts/~4/-vmggmFy3No\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "88695411",
            "sourceUrl": "http://feedproxy.google.com/~r/iTunesPodcastTTArts/~5/O3SEaXGG6b8/SharmeenObaidChinoy_2019-480p.mp4",
            "categories": [
                "Higher Education"
            ]
        },
        {
            "title": "The architectural wonder of impermanent cities | Rahul Mehrotra",
            "datePublished": "Mon, 22 Jul 2019 14:52:10 +0000",
            "description": "Every 12 years, a megacity springs up in India for the Kumbh Mela religious festival -- what's built in ten weeks is completely disassembled in one. What can we learn from this fully functioning, temporary settlement? In a visionary talk, urban designer Rahul Mehrotra explores the benefits of building impermanent cities that can travel, adapt or even disappear, leaving the lightest possible footprint on the planet.<img src=\"http://feeds.feedburner.com/~r/iTunesPodcastTTArts/~4/fgYqOz7XN2A\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "97951879",
            "sourceUrl": "http://feedproxy.google.com/~r/iTunesPodcastTTArts/~5/Lq7zEGA-yXY/RahulMehrotra_2019-480p.mp4",
            "categories": [
                "Higher Education"
            ]
        },
        {
            "title": "How a typeface helped launch Apollo | Douglas Thomas",
            "datePublished": "Fri, 19 Jul 2019 14:52:48 +0000",
            "description": "When humanity first landed on the moon in 1969, the typeface Futura was right there with them. In this fascinating history of typography, designer Douglas Thomas shares Futura's role in launching the Apollo 11 spacecraft -- and how it became one of the most used fonts in the world.<img src=\"http://feeds.feedburner.com/~r/iTunesPodcastTTArts/~4/GsiTU43dk4U\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "102084591",
            "sourceUrl": "http://feedproxy.google.com/~r/iTunesPodcastTTArts/~5/iKi0LvrEuf0/DouglasThomas_2018X-480p.mp4",
            "categories": [
                "Higher Education"
            ]
        },
        {
            "title": "How craving attention makes you less creative | Joseph Gordon-Levitt",
            "datePublished": "Tue, 20 Aug 2019 14:49:42 +0000",
            "description": "Joseph Gordon-Levitt has gotten more than his fair share of attention from his acting career. But as social media exploded over the past decade, he got addicted like the rest of us -- trying to gain followers and likes only to be left feeling inadequate and less creative. In a refreshingly honest talk, he explores how the attention-driven model of big tech companies impacts our creativity -- and shares a more powerful feeling than getting attention: paying attention.<img src=\"http://feeds.feedburner.com/~r/iTunesPodcastTTArts/~4/VNMDG1LjuDY\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "95204546",
            "sourceUrl": "http://feedproxy.google.com/~r/iTunesPodcastTTArts/~5/qhf-AHn6qoc/JosephGordonLevitt_2019-480p.mp4",
            "categories": [
                "Higher Education"
            ]
        },
        {
            "title": "Can we choose to fall out of love? | Dessa",
            "datePublished": "Thu, 29 Aug 2019 14:51:04 +0000",
            "description": "What's the best way to get over heartbreak? Rapper and writer Dessa came up with an unconventional approach after a chance viewing of Helen Fisher's TED Talk about the brains of the lovestruck. In a wryly funny talk, she describes how she worked with a neuroscientist to try to get her brain to fall out of love with her ex -- and shares wisdom about romance that she gained along the way.<img src=\"http://feeds.feedburner.com/~r/iTunesPodcastTTArts/~4/DUoLEC-kQmw\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "82612494",
            "sourceUrl": "http://feedproxy.google.com/~r/iTunesPodcastTTArts/~5/Azq27OFe2IA/Dessa_2018X-480p.mp4",
            "categories": [
                "Higher Education"
            ]
        },
        {
            "title": "\"Stumbling towards intimacy\": An improvised TED Talk | Anthony Veneziale",
            "datePublished": "Wed, 04 Sep 2019 19:52:41 +0000",
            "description": "In a hilarious, completely improvised talk, improv master Anthony Veneziale takes to the TED stage for a truly one-of-a-kind performance. Armed with an audience-suggested topic (\"stumbling towards intimacy\") and a deck of slides he's never seen before, Veneziale crafts a meditation on the intersection of love, language and ... avocados?<img src=\"http://feeds.feedburner.com/~r/iTunesPodcastTTArts/~4/MkMkBB6m4eE\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "80509014",
            "sourceUrl": "http://feedproxy.google.com/~r/iTunesPodcastTTArts/~5/30ZUwIdBJ1I/AnthonyVeneziale_2019-480p.mp4",
            "categories": [
                "Higher Education"
            ]
        },
        {
            "title": "What streaming means for the future of entertainment | Emmett Shear",
            "datePublished": "Mon, 16 Sep 2019 14:56:07 +0000",
            "description": "In a talk and demo, Twitch cofounder Emmett Shear shares his vision for the future of interactive entertainment -- and explains how video game streaming is helping people build communities online. \"I am excited for a world where our entertainment could connect us instead of isolating us -- a world where we can bond with each other over our shared interests and create real, strong communities,\" Shear says.<img src=\"http://feeds.feedburner.com/~r/iTunesPodcastTTArts/~4/k7JPCnM59Rk\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "107142407",
            "sourceUrl": "http://feedproxy.google.com/~r/iTunesPodcastTTArts/~5/fFuruPrbK9U/EmmettShear_2019-480p.mp4",
            "categories": [
                "Higher Education"
            ]
        },
        {
            "title": "How we experience time and memory through art | Sarah Sze",
            "datePublished": "Mon, 30 Sep 2019 14:52:14 +0000",
            "description": "Artist Sarah Sze takes us on a kaleidoscopic journey through her work: immersive installations as tall as buildings, splashed across walls, orbiting through galleries -- blurring the lines between time, memory and space. Explore how we give meaning to objects in this beautiful tour of Sze's experiential, multimedia art.<img src=\"http://feeds.feedburner.com/~r/iTunesPodcastTTArts/~4/h8w-gZ4EUcs\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "99575663",
            "sourceUrl": "http://feedproxy.google.com/~r/iTunesPodcastTTArts/~5/rCAivMddTPA/SarahSze_2019-480p.mp4",
            "categories": [
                "Higher Education"
            ]
        },
        {
            "title": "Fashion that celebrates all body types -- boldly and unapologetically | Becca McCharen-Tran",
            "datePublished": "Tue, 22 Oct 2019 14:49:19 +0000",
            "description": "Fashion designers have the power to change culture -- and Becca McCharen-Tran is using her platform to expand the industry's narrow definition of beauty. Sharing highlights of her work, McCharen-Tran discusses the inspiration behind her norm-shattering designs and shows how she's celebrating beauty in all forms. \"I want the consumer to know that it's not your body that needs to change -- it's the clothes,\" she says.<img src=\"http://feeds.feedburner.com/~r/iTunesPodcastTTArts/~4/zFg3L1Z2Rm0\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "61449930",
            "sourceUrl": "http://feedproxy.google.com/~r/iTunesPodcastTTArts/~5/r8k6f8VXuyM/BeccaMcCharenTran_2019S-480p.mp4",
            "categories": [
                "Higher Education"
            ]
        },
        {
            "title": "The pride and power of representation in film | Jon M. Chu",
            "datePublished": "Wed, 23 Oct 2019 19:49:08 +0000",
            "description": "On the heels of the breakout success of his film \"Crazy Rich Asians,\" director Jon M. Chu reflects on what drives him to create -- and makes a resounding case for the power of connection and on-screen representation.<img src=\"http://feeds.feedburner.com/~r/iTunesPodcastTTArts/~4/HbEH9BdSxKo\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "103175586",
            "sourceUrl": "http://feedproxy.google.com/~r/iTunesPodcastTTArts/~5/gsg6YmnasIw/JonMChu_2019-480p.mp4",
            "categories": [
                "Higher Education"
            ]
        },
        {
            "title": "How we experience awe -- and why it matters | Beau Lotto and Cirque du Soleil",
            "datePublished": "Fri, 25 Oct 2019 14:56:04 +0000",
            "description": "Neuroscientist Beau Lotto conducted an ambitious study with Cirque du Soleil on the emotion of awe and its psychological and behavioral benefits. In this talk and live performance, he shares some of their findings -- and stands back as Cirque du Soleil dancers create their own awe-inducing spectacle.<img src=\"http://feeds.feedburner.com/~r/iTunesPodcastTTArts/~4/PX69aSUFroU\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "106332324",
            "sourceUrl": "http://feedproxy.google.com/~r/iTunesPodcastTTArts/~5/LTa4Sls9RhI/BeauLottoandCirqueduSoleil_2019-480p.mp4",
            "categories": [
                "Higher Education"
            ]
        },
        {
            "title": "Urban architecture inspired by mountains, clouds and volcanoes | Ma Yansong",
            "datePublished": "Thu, 07 Nov 2019 20:51:46 +0000",
            "description": "Taking inspiration from nature, architect Ma Yansong designs breathtaking buildings that break free from the boxy symmetry of so many modern cities. His exuberant and graceful work -- from a pair of curvy skyscrapers that \"dance\" with each other to an opera house that looks like a snow-capped mountain -- shows us the beauty of architecture that defies norms.<img src=\"http://feeds.feedburner.com/~r/iTunesPodcastTTArts/~4/lZr2avB1RHM\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "92897987",
            "sourceUrl": "http://feedproxy.google.com/~r/iTunesPodcastTTArts/~5/vpIpBT4GFhQ/MaYansong_2019T-480p.mp4",
            "categories": [
                "Higher Education"
            ]
        },
        {
            "title": "A historical musical that examines black identity in the 1901 World's Fair | Amma Y. Ghartey-Tagoe Kootin",
            "datePublished": "Fri, 08 Nov 2019 16:03:09 +0000",
            "description": "In this lively talk and performance, artist and TED Fellow Amma Y. Ghartey-Tagoe Kootin offers a sneak peek of her forthcoming musical \"At Buffalo.\" Drawing on archival material from the 1901 Pan-American Exhibition, a world's fair held in Buffalo, New York, the show examines conflicting representations of black identity exhibited at the fair -- highlighting unsettlingly familiar parallels between American society at the turn of the century and today, and asking: Are we all still part of the show?<img src=\"http://feeds.feedburner.com/~r/iTunesPodcastTTArts/~4/-PCFoZKha3w\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "76846176",
            "sourceUrl": "http://feedproxy.google.com/~r/iTunesPodcastTTArts/~5/K7AC8WT8c3A/AmmaYGharteyTagoeKootin_2019U-480p.mp4",
            "categories": [
                "Higher Education"
            ]
        },
        {
            "title": "Why I draw with robots | Sougwen Chung",
            "datePublished": "Mon, 25 Nov 2019 15:50:53 +0000",
            "description": "What happens when humans and robots make art together? In this awe-inspiring talk, artist Sougwen Chung shows how she \"taught\" her artistic style to a machine -- and shares the results of their collaboration after making an unexpected discovery: robots make mistakes, too. \"Part of the beauty of human and machine systems is their inherent, shared fallibility,\" she says.<img src=\"http://feeds.feedburner.com/~r/iTunesPodcastTTArts/~4/oiuIgNsLmb0\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "61715340",
            "sourceUrl": "http://feedproxy.google.com/~r/iTunesPodcastTTArts/~5/q06A1BYl25w/SougwenChung_2019S-480p.mp4",
            "categories": [
                "Higher Education"
            ]
        },
        {
            "title": "How I use art to tackle plastic pollution in our oceans | Alejandro Durán",
            "datePublished": "Mon, 02 Dec 2019 15:54:42 +0000",
            "description": "Alejandro Durán uses art to spotlight the ongoing destruction of our oceans' ecosystems. In this breathtaking talk, he shows how he meticulously organizes and reuses plastic waste from around the world that washes up on the Caribbean coast of Mexico -- everything from water bottles to prosthetic legs -- to create vivid, environmental artworks that may leave you mesmerized and shocked.<img src=\"http://feeds.feedburner.com/~r/iTunesPodcastTTArts/~4/ZsZxJUq2NrY\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "53320788",
            "sourceUrl": "http://feedproxy.google.com/~r/iTunesPodcastTTArts/~5/Ya5KDrttQcU/AlejandroDuran_2019S-480p.mp4",
            "categories": [
                "Higher Education"
            ]
        },
        {
            "title": "A swarm of mini drones makes ... magic! | Marco Tempest",
            "datePublished": "Fri, 10 Jan 2020 20:46:26 +0000",
            "description": "Leading a swarm of small, buzzing flying machines, techno-magician Marco Tempest orchestrates a \"cyber illusion\" that will have you asking yourself: Was that science or magic?<img src=\"http://feeds.feedburner.com/~r/iTunesPodcastTTArts/~4/mYTgO5glU78\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "25037355",
            "sourceUrl": "http://feedproxy.google.com/~r/iTunesPodcastTTArts/~5/tnyBnRmXHjE/MarcoTempest_2019T-480p.mp4",
            "categories": [
                "Higher Education"
            ]
        },
        {
            "title": "Does photographing a moment steal the experience from you? | Erin Sullivan",
            "datePublished": "Thu, 23 Jan 2020 15:58:39 +0000",
            "description": "When we witness something amazing, many of us instinctively pull out our phones and snap pictures. Is this obsession with photographing everything impacting our experiences? In a meditative talk, Erin Sullivan reflects on how being more intentional with her lens enhanced her ability to enjoy the moment -- and could help you do the same, too.<img src=\"http://feeds.feedburner.com/~r/iTunesPodcastTTArts/~4/10OTACTRIN8\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "60700798",
            "sourceUrl": "http://feedproxy.google.com/~r/iTunesPodcastTTArts/~5/sfrFjktWbvY/ErinSullivan_2019S-480p.mp4",
            "categories": [
                "Higher Education"
            ]
        },
        {
            "title": "Imaginative sculptures that explore how we perceive reality | Alicia Eggert",
            "datePublished": "Mon, 10 Feb 2020 16:00:18 +0000",
            "description": "TED Fellow Alicia Eggert takes us on a visual tour of her work -- from a giant sculpture on an uninhabited island in Maine to an installation that inflates only when people hold hands to complete an electric current. Her work explores the power of art to inspire wonder and foster hope in dark times. As she puts it: \"A brighter, more sustainable, more equitable future depends first on our ability to imagine it.\"<img src=\"http://feeds.feedburner.com/~r/iTunesPodcastTTArts/~4/aM8t2x-Bbnc\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "75901662",
            "sourceUrl": "http://feedproxy.google.com/~r/iTunesPodcastTTArts/~5/qizgZdj-coc/AliciaEggert_2019T-480p.mp4",
            "categories": [
                "Higher Education"
            ]
        },
        {
            "title": "How symbols and brands shape our humanity | Debbie Millman",
            "datePublished": "Fri, 14 Feb 2020 15:57:52 +0000",
            "description": "\"Branding is the profound manifestation of the human spirit,\" says designer and podcaster Debbie Millman. In a historical odyssey that she illustrated herself, Millman traces the evolution of branding, from cave paintings to flags to beer labels and beyond. She explores the power of symbols to unite people, beginning with prehistoric communities who used them to represent beliefs and identify affiliations to modern companies that adopt logos and trademarks to market their products -- and explains how branding reflects the state of humanity.<img src=\"http://feeds.feedburner.com/~r/iTunesPodcastTTArts/~4/diB58rUowZo\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "102259541",
            "sourceUrl": "http://feedproxy.google.com/~r/iTunesPodcastTTArts/~5/kLIOt2ntFBM/DebbieMillman_2019W-480p.mp4",
            "categories": [
                "Higher Education"
            ]
        },
        {
            "title": "How volumetric video brings a new dimension to filmmaking | Diego Prilusky",
            "datePublished": "Fri, 21 Feb 2020 15:53:11 +0000",
            "description": "In this talk and tech demo, filmmaker Diego Prilusky introduces the next chapter in moviemaking: volumetric video, a 360-degree experience powered by hundreds of cameras that capture light and motion from every angle. Check out how this technology creates a new type of immersive storytelling -- and catch Prilusky's reshoot of an iconic dance number from \"Grease\" captured with volumetric video.<img src=\"http://feeds.feedburner.com/~r/iTunesPodcastTTArts/~4/yX_DfUDaU8s\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "84974248",
            "sourceUrl": "http://feedproxy.google.com/~r/iTunesPodcastTTArts/~5/HOr3Fw3lLjM/DiegoPrilusky_2019T-480p.mp4",
            "categories": [
                "Higher Education"
            ]
        },
        {
            "title": "How bumble bees inspired a network of tiny museums | Amanda Schochet",
            "datePublished": "Thu, 27 Feb 2020 15:55:22 +0000",
            "description": "Sometimes, small things make a huge impact. After studying how bees in urban environments can survive by navigating small land patches, ecologist Amanda Schochet was inspired to build MICRO, a network of portable science museums the size of vending machines. Learn how these tiny museums are being deployed in libraries, community centers, transit hubs and elsewhere to increase public access to science.<img src=\"http://feeds.feedburner.com/~r/iTunesPodcastTTArts/~4/QcUerBbjcYc\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "80105002",
            "sourceUrl": "http://feedproxy.google.com/~r/iTunesPodcastTTArts/~5/gypDkNeGUf4/AmandaSchochet_2019S-480p.mp4",
            "categories": [
                "Higher Education"
            ]
        },
        {
            "title": "Go ahead, dream about the future | Charlie Jane Anders",
            "datePublished": "Fri, 20 Mar 2020 14:50:16 +0000",
            "description": "\"You don't predict the future -- you imagine the future,\" says sci-fi writer Charlie Jane Anders. In a talk that's part dream, part research-based extrapolation, she takes us on a wild, speculative tour of the delights and challenges the future may hold -- and shows how dreaming up weird, futuristic possibilities empowers us to construct a better tomorrow.<img src=\"http://feeds.feedburner.com/~r/iTunesPodcastTTArts/~4/MEyk7wlxr_I\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "85814069",
            "sourceUrl": "http://feedproxy.google.com/~r/iTunesPodcastTTArts/~5/zh2GXxHnTPo/CharlieJaneAnders_2019W-480p.mp4",
            "categories": [
                "Higher Education"
            ]
        },
        {
            "title": "An ode to living on Earth | Oliver Jeffers",
            "datePublished": "Wed, 22 Apr 2020 17:03:40 +0000",
            "description": "If you had to explain to a newborn what it means to be a human being living on Earth in the 21st century, what would you say? Visual artist Oliver Jeffers put his answer in a letter to his son, sharing pearls of wisdom on existence and the diversity of life. He offers observations of the \"beautiful, fragile drama of human civilization\" in this poetic talk paired with his original illustrations and animations.<img src=\"http://feeds.feedburner.com/~r/iTunesPodcastTTArts/~4/_qrc1AqA6qU\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "76452581",
            "sourceUrl": "http://feedproxy.google.com/~r/iTunesPodcastTTArts/~5/dhMXy6daVoE/OliverJeffers_2020S-480p.mp4",
            "categories": [
                "Higher Education"
            ]
        },
        {
            "title": "How drawing can set you free | Shantell Martin",
            "datePublished": "Fri, 12 Jun 2020 14:55:36 +0000",
            "description": "Who are you? To answer this question, artist Shantell Martin followed her pen. In this brilliantly visual talk featuring her signature freestyle line work -- drawn across everything from the screens of Times Square to the bodies of New York City Ballet dancers -- Martin shares how she found freedom and a new perspective through art. See how drawing can connect your hand to your heart and deepen your connection with the world.<img src=\"http://feeds.feedburner.com/~r/iTunesPodcastTTArts/~4/jPIAWDyk8wM\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "55716906",
            "sourceUrl": "http://feedproxy.google.com/~r/iTunesPodcastTTArts/~5/m9pZtj-VJPg/ShantellMartin_2020-480p.mp4",
            "categories": [
                "Higher Education"
            ]
        },
        {
            "title": "How to support and celebrate living artists | Swizz Beatz",
            "datePublished": "Wed, 24 Jun 2020 18:55:01 +0000",
            "description": "Legendary hip-hop producer Swizz Beatz is on a mission to revolutionize the way artists do business. In this glorious talk, he shares some of the ways he's helping fellow creatives thrive, including a roving art fair that gives artists 100 percent of their sales, a new commission system for galleries to fund living visual artists and Verzuz, online musical celebrations that bring joy to fans -- and sales to musicians. \"If we're not protecting the arts, we're not protecting our future,\" he says.<img src=\"http://feeds.feedburner.com/~r/iTunesPodcastTTArts/~4/I4kUI99SD84\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "58707103",
            "sourceUrl": "http://feedproxy.google.com/~r/iTunesPodcastTTArts/~5/OQa2RCwPkfo/SwizzBeatz_2020-480p.mp4",
            "categories": [
                "Higher Education"
            ]
        },
        {
            "title": "How Dolly Parton led me to an epiphany | Jad Abumrad",
            "datePublished": "Thu, 25 Jun 2020 19:51:44 +0000",
            "description": "How do you end a story? Host of \"Radiolab\" Jad Abumrad tells how his search for an answer led him home to the mountains of Tennessee, where he met an unexpected teacher: Dolly Parton.<img src=\"http://feeds.feedburner.com/~r/iTunesPodcastTTArts/~4/wXVkxT7abJA\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "94389575",
            "sourceUrl": "http://feedproxy.google.com/~r/iTunesPodcastTTArts/~5/R7EIXsYUf68/JadAbumrad_2020-480p.mp4",
            "categories": [
                "Higher Education"
            ]
        }
    ]
}