{
    "artwork": "http://is4.mzstatic.com/image/thumb/Music4/v4/a8/42/8f/a8428f99-109a-3500-5dd7-eaee704657fa/source/100x100bb.jpg",
    "description": "Seeing the world beyond news headlines: politicians, journalists and researchers share their insights onstage at the TED conference, TEDx events and partner events around the world. You can also download these and many other videos free on TED.com, with an interactive English transcript and subtitles in up to 80 languages. TED is a nonprofit devoted to Ideas Worth Spreading.",
    "feedURL": "http://feeds.feedburner.com/iTunesPodcastTTNewsPolitics",
    "podcastURL": "https://www.ted.com/themes/itunes_podcasts_new_politics.html",
    "publisher": "TED",
    "title": "TEDTalks News and Politics",
    "episodes": [
        {
            "title": "The deadly legacy of cluster bombs | Laura Boushnak",
            "datePublished": "Wed, 24 Aug 2016 15:07:16 +0000",
            "description": "The destruction of war doesn't stop when the fighting is over. Photographer and TED Fellow Laura Boushnak shares a powerful photo essay about the survivors of cluster bombs, people who encountered these deadly submunitions years after the end of conflict. With her haunting photos, Boushnak asks those who still produce and condone the use of these weapons to abandon them.<img src=\"http://feeds.feedburner.com/~r/iTunesPodcastTTNewsPolitics/~4/yokHQmAkmCA\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "83563792",
            "sourceUrl": "https://download.ted.com/talks/LauraBoushnak_2016T-480p.mp4?apikey=172BB350-0010",
            "categories": [
                "Higher Education"
            ]
        },
        {
            "title": "The risky politics of progress | Jonathan Tepperman",
            "datePublished": "Thu, 01 Sep 2016 14:56:44 +0000",
            "description": "Global problems such as terrorism, inequality and political dysfunction aren't easy to solve, but that doesn't mean we should stop trying. In fact, suggests journalist Jonathan Tepperman, we might even want to think riskier. He traveled the world to ask global leaders how they're tackling hard problems -- and unearthed surprisingly hopeful stories that he's distilled into three tools for problem-solving.<img src=\"http://feeds.feedburner.com/~r/iTunesPodcastTTNewsPolitics/~4/_uRUjmHu7Ko\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "131144483",
            "sourceUrl": "https://download.ted.com/talks/JonathanTepperman_2016T-480p.mp4?apikey=172BB350-0010",
            "categories": [
                "Higher Education"
            ]
        },
        {
            "title": "How women wage conflict without violence | Julia Bacha",
            "datePublished": "Mon, 29 Aug 2016 15:34:06 +0000",
            "description": "Are you setting out to change the world? Here's a stat you should know: nonviolent campaigns are 100 percent more likely to succeed than violent ones. So why don't more groups use nonviolence when faced with conflict? Filmmaker Julia Bacha shares stories of effective nonviolent resistance, including eye-opening research on the crucial leadership role that women play.<img src=\"http://feeds.feedburner.com/~r/iTunesPodcastTTNewsPolitics/~4/21ztKYMPHGU\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "89388899",
            "sourceUrl": "https://download.ted.com/talks/JuliaBacha_2016T-480p.mp4?apikey=172BB350-0010",
            "categories": [
                "Higher Education"
            ]
        },
        {
            "title": "There's no such thing as not voting | Eric Liu",
            "datePublished": "Mon, 19 Sep 2016 15:03:54 +0000",
            "description": "Many people like to talk about how important voting is, how it's your civic duty and responsibility as an adult. Eric Liu agrees with all that, but he also thinks it's time to bring joy back to the ballot box. The former political speechwriter details how he and his team are fostering the culture around voting in the 2016 US presidential election -- and closes with a powerful analysis of why anyone eligible should show up on Election Day.<img src=\"http://feeds.feedburner.com/~r/iTunesPodcastTTNewsPolitics/~4/iOWvFQw03sg\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "94890291",
            "sourceUrl": "https://download.ted.com/talks/EricLiu_2016S-480p.mp4?apikey=172BB350-0010",
            "categories": [
                "Higher Education"
            ]
        },
        {
            "title": "America's forgotten working class | J.D. Vance",
            "datePublished": "Mon, 26 Sep 2016 15:22:05 +0000",
            "description": "J.D. Vance grew up in a small, poor city in the Rust Belt of southern Ohio, where he had a front-row seat to many of the social ills plaguing America: a heroin epidemic, failing schools, families torn apart by divorce and sometimes violence. In a searching talk that will echo throughout the country's working-class towns, the author details what the loss of the American Dream feels like and raises an important question that everyone from community leaders to policy makers needs to ask: How can we help kids from America's forgotten places break free from hopelessness and live better lives?<img src=\"http://feeds.feedburner.com/~r/iTunesPodcastTTNewsPolitics/~4/39p9xsnuJX8\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "105398584",
            "sourceUrl": "https://download.ted.com/talks/JDVance_2016S-480p.mp4?apikey=172BB350-0010",
            "categories": [
                "Higher Education"
            ]
        },
        {
            "title": "Immigrant voices make democracy stronger | Sayu Bhojwani",
            "datePublished": "Tue, 04 Oct 2016 15:01:06 +0000",
            "description": "In politics, representation matters -- and that's why we should elect leaders who reflect their country's diversity and embrace its multicultural tapestry, says Sayu Bhojwani. Through her own story of becoming an American citizen, the immigration scholar reveals how her love and dedication to her country turned into a driving force for political change. \"We have fought to be here,\" she says, calling immigrant voices to action. \"It's our country, too.\"<img src=\"http://feeds.feedburner.com/~r/iTunesPodcastTTNewsPolitics/~4/zlBaXFH3C2U\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "91156467",
            "sourceUrl": "https://download.ted.com/talks/SayuBhojwani_2016S-480p.mp4?apikey=172BB350-0010",
            "categories": [
                "Higher Education"
            ]
        },
        {
            "title": "Inside the mind of a former radical jihadist | Manwar Ali",
            "datePublished": "Thu, 20 Oct 2016 15:17:43 +0000",
            "description": "\"For a long time, I lived for death,\" says Manwar Ali, a former radical jihadist who participated in violent, armed campaigns in the Middle East and Asia in the 1980s. In this moving talk, he reflects on his experience with radicalization and makes a powerful, direct appeal to anyone drawn to Islamist groups that claim violence and brutality are noble and virtuous: let go of anger and hatred, he says, and instead cultivate your heart to see goodness, beauty and truth in others.<img src=\"http://feeds.feedburner.com/~r/iTunesPodcastTTNewsPolitics/~4/AikUQD3_L7o\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "122080742",
            "sourceUrl": "https://download.ted.com/talks/ManwarAli_2016X-480p.mp4?apikey=172BB350-0010",
            "categories": [
                "Higher Education"
            ]
        },
        {
            "title": "What a driverless world could look like | Wanis Kabbaj",
            "datePublished": "Mon, 24 Oct 2016 15:15:37 +0000",
            "description": "What if traffic flowed through our streets as smoothly and efficiently as blood flows through our veins? Transportation geek Wanis Kabbaj thinks we can find inspiration in the genius of our biology to design the transit systems of the future. In this forward-thinking talk, preview exciting concepts like modular, detachable buses, flying taxis and networks of suspended magnetic pods that could help make the dream of a dynamic, driverless world into a reality.<img src=\"http://feeds.feedburner.com/~r/iTunesPodcastTTNewsPolitics/~4/4u932MpIZ0c\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "83018606",
            "sourceUrl": "https://download.ted.com/talks/WanisKabbaj_2016S-480p.mp4?apikey=172BB350-0010",
            "categories": [
                "Higher Education"
            ]
        },
        {
            "title": "How the US should use its superpower status | Ian Bremmer",
            "datePublished": "Tue, 25 Oct 2016 15:17:19 +0000",
            "description": "Americanization and globalization have basically been the same thing for the last several generations. But the US's view of the world -- and the world's view of the US -- is changing. In a fast-paced tour of the current state of international politics, Ian Bremmer discusses the challenges of a world where no single country or alliance can meet the challenges of global leadership and asks if the US is ready to lead by example, not by force.<img src=\"http://feeds.feedburner.com/~r/iTunesPodcastTTNewsPolitics/~4/--AmkR6xI_o\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "112006795",
            "sourceUrl": "https://download.ted.com/talks/IanBremmer_2016X-480p.mp4?apikey=172BB350-0010",
            "categories": [
                "Higher Education"
            ]
        },
        {
            "title": "It's time for women to run for office | Halla T贸masd贸ttir",
            "datePublished": "Fri, 04 Nov 2016 15:49:23 +0000",
            "description": "With warmth and wit, Halla T贸masd贸ttir shares how she overcame media bias, changed the tone of the political debate and surprised her entire nation when she ran for president of Iceland -- inspiring the next generation of leaders along the way. \"What we see, we can be,\" she says. \"It matters that women run.\"<img src=\"http://feeds.feedburner.com/~r/iTunesPodcastTTNewsPolitics/~4/88qSgzcj4Xc\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "138524396",
            "sourceUrl": "https://download.ted.com/talks/HallaTomasdottir_2016W-480p.mp4?apikey=172BB350-0010",
            "categories": [
                "Higher Education"
            ]
        },
        {
            "title": "We train soldiers for war. Let's train them to come home, too | Hector Garcia",
            "datePublished": "Fri, 11 Nov 2016 15:54:03 +0000",
            "description": "Before soldiers are sent into combat, they're trained on how to function in an immensely dangerous environment. But they also need training on how to return from the battlefield to civilian life, says psychologist Hector Garcia. Applying the same principles used to prepare soldiers for war, Garcia is helping veterans suffering from PTSD get their lives back.<img src=\"http://feeds.feedburner.com/~r/iTunesPodcastTTNewsPolitics/~4/aZBHqCnLakg\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "75980904",
            "sourceUrl": "https://download.ted.com/talks/HectorGarcia_2015P-480p.mp4?apikey=172BB350-0010",
            "categories": [
                "Higher Education"
            ]
        },
        {
            "title": "A political party for women's equality | Sandi Toksvig",
            "datePublished": "Mon, 21 Nov 2016 16:09:32 +0000",
            "description": "Women's equality won't just happen -- not unless more women are put in positions of power, says Sandi Toksvig. In a disarmingly hilarious talk, Toksvig tells the story of how she helped start a new political party in Britain, the Women's Equality Party, with the express purpose of putting equality on the ballot. Now she hopes people around the world will copy her party's model and mobilize for equality.<img src=\"http://feeds.feedburner.com/~r/iTunesPodcastTTNewsPolitics/~4/p8JILjpa8IU\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "139917338",
            "sourceUrl": "https://download.ted.com/talks/SandiToksvig_2016W-480p.mp4?apikey=172BB350-0010",
            "categories": [
                "Higher Education"
            ]
        },
        {
            "title": "An interview with the founders of Black Lives Matter | Alicia Garza, Patrisse Cullors and Opal Tometi",
            "datePublished": "Tue, 29 Nov 2016 15:50:19 +0000",
            "description": "Born out of a social media post, the Black Lives Matter movement has sparked discussion about race and inequality across the world. In this spirited conversation with Mia Birdsong, the movement's three founders share what they've learned about leadership and what provides them with hope and inspiration in the face of painful realities. Their advice on how to participate in ensuring freedom for everybody: join something, start something and \"sharpen each other, so that we all can rise.\"<img src=\"http://feeds.feedburner.com/~r/iTunesPodcastTTNewsPolitics/~4/wR_tdi6dm_M\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "115412047",
            "sourceUrl": "https://download.ted.com/talks/AliciaGarzaandPatrisseCullorsandOpalTometi_2016W-480p.mp4?apikey=172BB350-0010",
            "categories": [
                "Higher Education"
            ]
        },
        {
            "title": "It's time to reclaim religion | Sharon Brous",
            "datePublished": "Wed, 21 Dec 2016 16:05:04 +0000",
            "description": "At a moment when the world seems to be spinning out of control, religion might feel irrelevant -- or like part of the problem. But Rabbi Sharon Brous believes we can reinvent religion to meet the needs of modern life. In this impassioned talk, Brous shares four principles of a revitalized religious practice and offers faith of all kinds as a hopeful counter-narrative to the numbing realities of violence, extremism and pessimism.<img src=\"http://feeds.feedburner.com/~r/iTunesPodcastTTNewsPolitics/~4/aGubOqHagG0\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "118038791",
            "sourceUrl": "https://download.ted.com/talks/SharonBrous_2016W-480p.mp4?apikey=172BB350-0010",
            "categories": [
                "Higher Education"
            ]
        },
        {
            "title": "The world doesn't need more nuclear weapons | Erika Gregory",
            "datePublished": "Wed, 04 Jan 2017 16:10:26 +0000",
            "description": "Today nine nations collectively control more than 15,000 nuclear weapons, each hundreds of times more powerful than those dropped on Hiroshima and Nagasaki. We don't need more nuclear weapons; we need a new generation to face the unfinished challenge of disarmament started decades ago. Nuclear reformer Erika Gregory calls on today's rising leaders -- those born in a time without Cold War fears and duck-and-cover training -- to pursue an ambitious goal: ridding the world of nuclear weapons by 2045.<img src=\"http://feeds.feedburner.com/~r/iTunesPodcastTTNewsPolitics/~4/5bFZeOujEr8\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "107837934",
            "sourceUrl": "https://download.ted.com/talks/ErikaGregory_2016W-480p.mp4?apikey=172BB350-0010",
            "categories": [
                "Higher Education"
            ]
        },
        {
            "title": "If a story moves you, act on it | Sisonke Msimang",
            "datePublished": "Fri, 13 Jan 2017 16:19:34 +0000",
            "description": "Stories are necessary, but they're not as magical as they seem, says writer Sisonke Msimang. In this funny and thoughtful talk, Msimang questions our emphasis on storytelling and spotlights the decline of facts. During a critical time when listening has been confused for action, Msimang asks us to switch off our phones, step away from our screens and step out into the real world to create a plan for justice.<img src=\"http://feeds.feedburner.com/~r/iTunesPodcastTTNewsPolitics/~4/2clV6lddXtM\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "91677991",
            "sourceUrl": "https://download.ted.com/talks/SisonkeMsimang_2016W-480p.mp4?apikey=172BB350-0010",
            "categories": [
                "Higher Education"
            ]
        },
        {
            "title": "How to have better political conversations | Robb Willer",
            "datePublished": "Fri, 20 Jan 2017 16:07:08 +0000",
            "description": "Robb Willer studies the forces that unite and divide us. As a social psychologist, he researches how moral values -- typically a source of division -- can also be used to bring people together. Willer shares compelling insights on how we might bridge the ideological divide and offers some intuitive advice on ways to be more persuasive when talking politics.<img src=\"http://feeds.feedburner.com/~r/iTunesPodcastTTNewsPolitics/~4/QDTyG5FnqOA\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "84610090",
            "sourceUrl": "https://download.ted.com/talks/RobbWiller_2016X-480p.mp4?apikey=172BB350-0010",
            "categories": [
                "Higher Education"
            ]
        },
        {
            "title": "How jails extort the poor | Salil Dudani",
            "datePublished": "Thu, 16 Feb 2017 16:05:36 +0000",
            "description": "Why do we jail people for being poor? Today, half a million Americans are in jail only because they can't afford to post bail, and still more are locked up because they can't pay their debt to the court, sometimes for things as minor as unpaid parking tickets. Salil Dudani shares stories from individuals who have experienced debtors' prison in Ferguson, Missouri, challenging us to think differently about how we punish the poor and marginalized.<img src=\"http://feeds.feedburner.com/~r/iTunesPodcastTTNewsPolitics/~4/o1JrEWjon0U\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "91634116",
            "sourceUrl": "https://download.ted.com/talks/SalilDudani_2016X-480p.mp4?apikey=172BB350-0010",
            "categories": [
                "Higher Education"
            ]
        },
        {
            "title": "My son was a Columbine shooter. This is my story | Sue Klebold",
            "datePublished": "Thu, 02 Feb 2017 16:02:52 +0000",
            "description": "Sue Klebold is the mother of Dylan Klebold, one of the two shooters who committed the Columbine High School massacre, murdering 12 students and a teacher. She's spent years excavating every detail of her family life, trying to understand what she could have done to prevent her son's violence. In this difficult, jarring talk, Klebold explores the intersection between mental health and violence, advocating for parents and professionals to continue to examine the link between suicidal and homicidal thinking.<img src=\"http://feeds.feedburner.com/~r/iTunesPodcastTTNewsPolitics/~4/uQ2eKwBJ_VY\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "108228708",
            "sourceUrl": "https://download.ted.com/talks/SueKlebold_2016P-480p.mp4?apikey=172BB350-0010",
            "categories": [
                "Higher Education"
            ]
        },
        {
            "title": "3 ways to fix a broken news industry | Lara Setrakian",
            "datePublished": "Wed, 15 Feb 2017 16:07:49 +0000",
            "description": "Something is very wrong with the news industry. Trust in the media has hit an all-time low; we're inundated with sensationalist stories, and consistent, high-quality reporting is scarce, says journalist Lara Setrakian. She shares three ways we can fix the news to better inform all of us about the complex issues of our time.<img src=\"http://feeds.feedburner.com/~r/iTunesPodcastTTNewsPolitics/~4/Y_csKTIB9GY\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "62491612",
            "sourceUrl": "https://download.ted.com/talks/LaraSetrakian_2017S-480p.mp4?apikey=172BB350-0010",
            "categories": [
                "Higher Education"
            ]
        },
        {
            "title": "Why civilians suffer more once a war is over | Margaret Bourdeaux",
            "datePublished": "Wed, 22 Mar 2017 15:17:38 +0000",
            "description": "In a war, it turns out that violence isn't the biggest killer of civilians. What is? Illness, hunger, poverty -- because war destroys the institutions that keep society running, like utilities, banks, food systems and hospitals. Physician Margaret Bourdeaux proposes a bold approach to post-conflict recovery, setting priorities on what to fix first<img src=\"http://feeds.feedburner.com/~r/iTunesPodcastTTNewsPolitics/~4/xdTiRvBOw0w\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "103125638",
            "sourceUrl": "https://download.ted.com/talks/MargaretBourdeaux_2015X-480p.mp4?apikey=172BB350-0010",
            "categories": [
                "Higher Education"
            ]
        },
        {
            "title": "The racial politics of time | Brittney Cooper",
            "datePublished": "Tue, 21 Feb 2017 16:08:54 +0000",
            "description": "Cultural theorist Brittney Cooper examines racism through the lens of time, showing us how historically it has been stolen from people of color, resulting in lost moments of joy and connection, lost years of healthy quality of life and the delay of progress. A candid, thought-provoking take on history and race that may make you reconsider your understanding of time, and your place in it.<img src=\"http://feeds.feedburner.com/~r/iTunesPodcastTTNewsPolitics/~4/We5zGpARTHg\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "90027056",
            "sourceUrl": "https://download.ted.com/talks/BrittneyCooper_2016W-480p.mp4?apikey=172BB350-0010",
            "categories": [
                "Higher Education"
            ]
        },
        {
            "title": "Nationalism vs. globalism: the new political divide | Yuval Noah Harari",
            "datePublished": "Mon, 20 Feb 2017 15:35:24 +0000",
            "description": "How do we make sense of today's political divisions? In a wide-ranging conversation full of insight, historian Yuval Harari places our current turmoil in a broader context, against the ongoing disruption of our technology, climate, media -- even our notion of what humanity is for. This is the first of a series of TED Dialogues, seeking a thoughtful response to escalating political divisiveness. Make time (just over an hour) for this fascinating discussion between Harari and TED curator Chris Anderson.<img src=\"http://feeds.feedburner.com/~r/iTunesPodcastTTNewsPolitics/~4/6nV6T0ACclQ\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "428991000",
            "sourceUrl": "https://download.ted.com/talks/YuvalNoahHarari_2017S-480p.mp4?apikey=172BB350-0010",
            "categories": [
                "Higher Education"
            ]
        },
        {
            "title": "I grew up in the Westboro Baptist Church. Here's why I left | Megan Phelps-Roper",
            "datePublished": "Mon, 06 Mar 2017 16:05:06 +0000",
            "description": "What's it like to grow up within a group of people who exult in demonizing ... everyone else? Megan Phelps-Roper shares details of life inside America's most controversial church and describes how conversations on Twitter were key to her decision to leave it. In this extraordinary talk, she shares her personal experience of extreme polarization, along with some sharp ways we can learn to successfully engage across ideological lines.<img src=\"http://feeds.feedburner.com/~r/iTunesPodcastTTNewsPolitics/~4/OCU39elk1mg\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "110064992",
            "sourceUrl": "https://download.ted.com/talks/MeganPhelpsRoper_2017S-480p.mp4?apikey=172BB350-0010",
            "categories": [
                "Higher Education"
            ]
        },
        {
            "title": "Who would the rest of the world vote for in your country's election? | Simon Anholt",
            "datePublished": "Thu, 23 Mar 2017 15:19:43 +0000",
            "description": "Wish you could vote in another country's election? Simon Anholt unveils the Global Vote, an online platform that lets anybody, anywhere in the world, \"vote\" in the election of any country on earth (with surprising results).<img src=\"http://feeds.feedburner.com/~r/iTunesPodcastTTNewsPolitics/~4/Jq5YplUda5g\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "105177297",
            "sourceUrl": "https://download.ted.com/talks/SimonAnholt_2016X-480p.mp4?apikey=172BB350-0010",
            "categories": [
                "Higher Education"
            ]
        },
        {
            "title": "Political common ground in a polarized United States | Gretchen Carlson, David Brooks",
            "datePublished": "Mon, 03 Apr 2017 21:50:55 +0000",
            "description": "How can we bridge the gap between left and right to have a wiser, more connected political conversation? Journalist Gretchen Carlson and op-ed columnist David Brooks share insights on the tensions at the heart of American politics today -- and where we can find common ground. Followed by a rousing performance of \"America the Beautiful\" by Vy Higginsen's Gospel Choir of Harlem.<img src=\"http://feeds.feedburner.com/~r/iTunesPodcastTTNewsPolitics/~4/dhDqYn8jqgY\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "339983859",
            "sourceUrl": "https://download.ted.com/talks/GretchenCarlsonandDavidBrooks_2017S-480p.mp4?apikey=172BB350-0010",
            "categories": [
                "Higher Education"
            ]
        },
        {
            "title": "How fake news does real harm | Stephanie Busari",
            "datePublished": "Mon, 24 Apr 2017 15:12:07 +0000",
            "description": "On April 14, 2014, the terrorist organization Boko Haram kidnapped more than 200 schoolgirls from the town of Chibok, Nigeria. Around the world, the crime became epitomized by the slogan #BringBackOurGirls -- but in Nigeria, government officials called the crime a hoax, confusing and delaying efforts to rescue the girls. In this powerful talk, journalist Stephanie Busari points to the Chibok tragedy to explain the deadly danger of fake news and what we can do to stop it.<img src=\"http://feeds.feedburner.com/~r/iTunesPodcastTTNewsPolitics/~4/jjMIA_DU45I\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "46803033",
            "sourceUrl": "https://download.ted.com/talks/StephanieBusari_2017S-480p.mp4?apikey=172BB350-0010",
            "categories": [
                "Higher Education"
            ]
        },
        {
            "title": "Behind the lies of Holocaust denial | Deborah Lipstadt",
            "datePublished": "Tue, 02 May 2017 15:15:50 +0000",
            "description": "\"There are facts, there are opinions, and there are lies,\" says historian Deborah Lipstadt, telling the remarkable story of her research into Holocaust deniers -- and their deliberate distortion of history. Lipstadt encourages us all to go on the offensive against those who assault the truth and facts. \"Truth is not relative,\" she says.<img src=\"http://feeds.feedburner.com/~r/iTunesPodcastTTNewsPolitics/~4/cqn_4NCCl6w\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "111738790",
            "sourceUrl": "https://download.ted.com/talks/DeborahLipstadt_2017X-480p.mp4?apikey=172BB350-0010",
            "categories": [
                "Higher Education"
            ]
        },
        {
            "title": "How (and why) Russia hacked the US election | Laura Galante",
            "datePublished": "Wed, 03 May 2017 14:56:04 +0000",
            "description": "Hacking, fake news, information bubbles ... all these and more have become part of the vernacular in recent years. But as cyberspace analyst Laura Galante describes in this alarming talk, the real target of anyone looking to influence geopolitics is dastardly simple: it's you.<img src=\"http://feeds.feedburner.com/~r/iTunesPodcastTTNewsPolitics/~4/9eGqx-OmuvI\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "68936615",
            "sourceUrl": "https://download.ted.com/talks/LauraGalante_2017-480p.mp4?apikey=172BB350-0010",
            "categories": [
                "Higher Education"
            ]
        },
        {
            "title": "This is what democracy looks like | Anthony D. Romero",
            "datePublished": "Wed, 24 May 2017 14:51:03 +0000",
            "description": "In a quest to make sense of the political environment in the United States in 2017, lawyer and ACLU executive director Anthony D. Romero turned to a surprising place -- a 14th-century fresco by Italian Renaissance master Ambrogio Lorenzetti. What could a 700-year-old painting possibly teach us about life today? Turns out, a lot. Romero explains all in a talk that's as striking as the painting itself.<img src=\"http://feeds.feedburner.com/~r/iTunesPodcastTTNewsPolitics/~4/Akfp9Hsm6fo\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "91916504",
            "sourceUrl": "https://download.ted.com/talks/AnthonyDRomero_2017-480p.mp4?apikey=172BB350-0010",
            "categories": [
                "Higher Education"
            ]
        },
        {
            "title": "Am I not human? A call for criminal justice reform | Marlon Peterson",
            "datePublished": "Wed, 31 May 2017 14:48:12 +0000",
            "description": "For a crime he committed in his early twenties, the courts sentenced Marlon Peterson to 10 years in prison -- and, as he says, a lifetime of irrelevance. While behind bars, Peterson found redemption through a penpal mentorship program with students from Brooklyn. In this brave talk, he reminds us why we should invest in the humanity of those people society would like to disregard and discard.<img src=\"http://feeds.feedburner.com/~r/iTunesPodcastTTNewsPolitics/~4/UmexpCdAzy4\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "54498655",
            "sourceUrl": "https://download.ted.com/talks/MarlonPeterson_2016S-480p.mp4?apikey=172BB350-0010",
            "categories": [
                "Higher Education"
            ]
        },
        {
            "title": "The refugee crisis is a test of our character | David Miliband",
            "datePublished": "Tue, 20 Jun 2017 03:39:41 +0000",
            "description": "Sixty-five million people were displaced from their homes by conflict and disaster in 2016. It's not just a crisis; it's a test of who we are and what we stand for, says David Miliband -- and each of us has a personal responsibility to help solve it. In this must-watch talk, Miliband gives us specific, tangible ways to help refugees and turn empathy and altruism into action.<img src=\"http://feeds.feedburner.com/~r/iTunesPodcastTTNewsPolitics/~4/3Ktex9-PUXE\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "133563280",
            "sourceUrl": "https://download.ted.com/talks/DavidMiliband_2017-480p.mp4?apikey=172BB350-0010",
            "categories": [
                "Higher Education"
            ]
        },
        {
            "title": "Doesn't everyone deserve a chance at a good life? | Jim Yong Kim",
            "datePublished": "Fri, 16 Jun 2017 14:55:58 +0000",
            "description": "Aspirations are rising as never before across the world, thanks in large part to smartphones and the internet -- will they be met with opportunity or frustration? Former President of the World Bank Group Jim Yong Kim shares how the institution is working to improve the health and financial futures of people in the poorest countries by boosting investment and de-risking development.<img src=\"http://feeds.feedburner.com/~r/iTunesPodcastTTNewsPolitics/~4/NTGyAZDpJAU\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "159029925",
            "sourceUrl": "https://download.ted.com/talks/JimYongKim_2017-480p.mp4?apikey=172BB350-0010",
            "categories": [
                "Higher Education"
            ]
        },
        {
            "title": "Don't feel sorry for refugees -- believe in them | Luma Mufleh",
            "datePublished": "Fri, 23 Jun 2017 14:40:07 +0000",
            "description": "\"We have seen advances in every aspect of our lives -- except our humanity,\" says Luma Mufleh, a Jordanian immigrant and Muslim of Syrian descent who founded the first accredited school for refugees in the United States. Mufleh shares stories of hope and resilience, explaining how she's helping young people from war-torn countries navigate the difficult process of building new homes. Get inspired to make a personal difference in the lives of refugees with this powerful talk.<img src=\"http://feeds.feedburner.com/~r/iTunesPodcastTTNewsPolitics/~4/Vnj--604KVc\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "102581126",
            "sourceUrl": "https://download.ted.com/talks/LumaMufleh_2017-480p.mp4?apikey=172BB350-0010",
            "categories": [
                "Higher Education"
            ]
        },
        {
            "title": "Why journalists have an obligation to challenge power | Jorge Ramos",
            "datePublished": "Wed, 12 Jul 2017 14:56:59 +0000",
            "description": "You can kick Jorge Ramos out of your press conference (as Donald Trump infamously did in 2015), but you can never silence him. A reporter for more than 30 years, Ramos believes that a journalist's responsibility is to question and challenge those in power. In this compelling talk -- which earned him a standing ovation midway through -- Ramos explains why, in certain circumstances, he believes journalists must take sides. (In Spanish with English subtitles)<img src=\"http://feeds.feedburner.com/~r/iTunesPodcastTTNewsPolitics/~4/y0KaniXbLw8\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "104171149",
            "sourceUrl": "https://download.ted.com/talks/JorgeRamos_2017U-480p.mp4?apikey=172BB350-0010",
            "categories": [
                "Higher Education"
            ]
        },
        {
            "title": "What six years in captivity taught me about fear and faith | Ingrid Betancourt",
            "datePublished": "Wed, 02 Aug 2017 15:17:50 +0000",
            "description": "In 2002, the Colombian guerrilla movement known as the FARC (Revolutionary Armed Forces of Colombia) kidnapped Ingrid Betancourt in the middle of her presidential campaign. For the next six years, Betancourt was held hostage in jungle prison camps where she was ravaged by malaria, fleas, hunger and human cruelty until her rescue by the Colombian government. In this deeply personal talk, the politician turned writer explains what it's like to live in a perpetual state of fear -- and how her faith sustained her. (In Spanish with English subtitles)<img src=\"http://feeds.feedburner.com/~r/iTunesPodcastTTNewsPolitics/~4/QC0XFfapJjk\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "141046657",
            "sourceUrl": "https://download.ted.com/talks/IngridBetancourt_2017U-480p.mp4?apikey=172BB350-0010",
            "categories": [
                "Higher Education"
            ]
        },
        {
            "title": "How I help free innocent people from prison | Ronald Sullivan",
            "datePublished": "Tue, 15 Aug 2017 19:36:14 +0000",
            "description": "Harvard Law professor Ronald Sullivan fights to free wrongfully convicted people from jail -- in fact, he has freed some 6,000 innocent people over the course of his career. He shares heartbreaking stories of how (and why) people end up being put in jail for something they didn't do, and the consequences in their lives and the lives of others. Watch this essential talk about the duty we all have to make the world a bit more fair every day, however we can.<img src=\"http://feeds.feedburner.com/~r/iTunesPodcastTTNewsPolitics/~4/LnfTIEmZKAU\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "83876581",
            "sourceUrl": "https://download.ted.com/talks/RonaldSullivan_2016X-480p.mp4?apikey=172BB350-0010",
            "categories": [
                "Higher Education"
            ]
        },
        {
            "title": "Courage is contagious | Damon Davis",
            "datePublished": "Mon, 14 Aug 2017 14:59:24 +0000",
            "description": "When artist Damon Davis went to join the protests in Ferguson, Missouri, after police killed Michael Brown in 2014, he found not only anger but also a sense of love for self and community. His documentary \"Whose Streets?\" tells the story of the protests from the perspective of the activists who showed up to challenge those who use power to spread fear and hate.<img src=\"http://feeds.feedburner.com/~r/iTunesPodcastTTNewsPolitics/~4/LHuLducqPIg\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "39648344",
            "sourceUrl": "https://download.ted.com/talks/DamonDavis_2017U-480p.mp4?apikey=172BB350-0010",
            "categories": [
                "Higher Education"
            ]
        },
        {
            "title": "Why we need to end the era of orphanages | Tara Winkler",
            "datePublished": "Tue, 29 Aug 2017 19:39:04 +0000",
            "description": "Could it be wrong to help children in need by starting an orphanage? In this eye-opening talk about the bad consequences of good intentions, Tara Winkler speaks out against the spread of orphanages in developing countries, caused in part by foreign donors, and details the harm done to children when they are separated from their families and left to grow up in institutions.<img src=\"http://feeds.feedburner.com/~r/iTunesPodcastTTNewsPolitics/~4/1Eru8R-tNP0\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "93329999",
            "sourceUrl": "https://download.ted.com/talks/TaraWinkler_2016X-480p.mp4?apikey=172BB350-0010",
            "categories": [
                "Higher Education"
            ]
        },
        {
            "title": "How young people join violent extremist groups -- and how to stop them | Erin Marie Saltman",
            "datePublished": "Tue, 05 Sep 2017 19:54:28 +0000",
            "description": "Terrorists and extremists aren't all naturally violent sociopaths -- they're deliberately recruited and radicalized in a process that doesn't fit into a neat pattern. Erin Marie Saltman discusses the push and pull factors that cause people to join extremist groups and explains innovative ways of preventing and countering radicalization.<img src=\"http://feeds.feedburner.com/~r/iTunesPodcastTTNewsPolitics/~4/ownX8eir_Qw\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "82463532",
            "sourceUrl": "https://download.ted.com/talks/ErinMarieSaltman_2016X-480p.mp4?apikey=172BB350-0010",
            "categories": [
                "Higher Education"
            ]
        },
        {
            "title": "How the US government spies on people who protest -- including you | Jennifer Granick",
            "datePublished": "Thu, 31 Aug 2017 14:49:04 +0000",
            "description": "What's stopping the American government from recording your phone calls, reading your emails and monitoring your location? Very little, says surveillance and cybersecurity counsel Jennifer Granick. The government collects all kinds of information about you easily, cheaply and without a warrant -- and if you've ever participated in a protest or attended a gun show, you're likely a person of interest. Learn more about your rights, your risks and how to protect yourself in the golden age of surveillance.<img src=\"http://feeds.feedburner.com/~r/iTunesPodcastTTNewsPolitics/~4/koUWrRJSE_g\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "101596215",
            "sourceUrl": "https://download.ted.com/talks/JenniferGranick_2017X-480p.mp4?apikey=172BB350-0010",
            "categories": [
                "Higher Education"
            ]
        },
        {
            "title": "Who belongs in a city? | OluTimehin Adegbeye",
            "datePublished": "Fri, 08 Sep 2017 14:51:06 +0000",
            "description": "Underneath every shiny new megacity, there's often a story of communities displaced. In this moving, poetic talk, OluTimehin Adegbeye details how government land grabs are destroying the lives of thousands who live in the coastal communities of Lagos, Nigeria, to make way for a \"new Dubai.\" She compels us to hold our governments and ourselves accountable for keeping our cities safe for everyone. \"The only cities worth building, indeed the only futures worth dreaming of, are those that include all of us, no matter who we are or how we make homes for ourselves,\" she says.<img src=\"http://feeds.feedburner.com/~r/iTunesPodcastTTNewsPolitics/~4/atFr6QuRzZM\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "87606238",
            "sourceUrl": "https://download.ted.com/talks/OluTimehinAdegbeye_2017G-480p.mp4?apikey=172BB350-0010",
            "categories": [
                "Higher Education"
            ]
        },
        {
            "title": "How our friendship survives our opposing politics | Caitlin Quattromani and Lauran Arledge",
            "datePublished": "Mon, 11 Sep 2017 15:01:00 +0000",
            "description": "Can you still be friends with someone who doesn't vote the same way as you? For Caitlin Quattromani and Lauran Arledge, two best friends who think very differently about politics, the outcome of the 2016 US presidential election could have resulted in hostility and disrespect. Hear about how they chose to engage in dialogue instead -- and learn some simple tactics they're using to maintain their bipartisan friendship.<img src=\"http://feeds.feedburner.com/~r/iTunesPodcastTTNewsPolitics/~4/9ZnSZ4lJKiE\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "101161826",
            "sourceUrl": "https://download.ted.com/talks/CaitlinQuattromaniandLauranArledge_2017X-480p.mp4?apikey=172BB350-0010",
            "categories": [
                "Higher Education"
            ]
        },
        {
            "title": "What we're missing in the debate about immigration | Duarte Geraldino",
            "datePublished": "Tue, 19 Sep 2017 20:17:18 +0000",
            "description": "Between 2008 and 2016, the United States deported more than three million people. What happens to those left behind? Journalist Duarte Geraldino picks up the story of deportation where the state leaves off. Learn more about the wider impact of forced removal as Geraldino explains how the sudden absence of a mother, a local business owner or a high school student ripples outward and wreaks havoc on the relationships that hold our communities together.<img src=\"http://feeds.feedburner.com/~r/iTunesPodcastTTNewsPolitics/~4/wbLr-ziQHJE\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "57617988",
            "sourceUrl": "https://download.ted.com/talks/DuarteGeraldino_2017S-480p.mp4?apikey=172BB350-0010",
            "categories": [
                "Higher Education"
            ]
        },
        {
            "title": "A black man goes undercover in the alt-right | Theo E.J. Wilson",
            "datePublished": "Thu, 21 Sep 2017 20:00:59 +0000",
            "description": "In an unmissable talk about race and politics in America, Theo E.J. Wilson tells the story of becoming Lucius25, white supremacist lurker, and the unexpected compassion and surprising perspective he found from engaging with people he disagrees with. He encourages us to let go of fear, embrace curiosity and have courageous conversations with people who think differently from us. \"Conversations stop violence, conversations start countries and build bridges,\" he says.<img src=\"http://feeds.feedburner.com/~r/iTunesPodcastTTNewsPolitics/~4/8TnIJfSXabM\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "131879410",
            "sourceUrl": "https://download.ted.com/talks/TheoEJWilson_2017X-480p.mp4?apikey=172BB350-0010",
            "categories": [
                "Higher Education"
            ]
        },
        {
            "title": "What I learned as a prisoner in North Korea | Euna Lee",
            "datePublished": "Fri, 29 Sep 2017 15:08:35 +0000",
            "description": "In March 2009, North Korean soldiers captured journalist Euna Lee and her colleague Laura Ling while they were shooting a documentary on the border with China. The courts sentenced them to 12 years of hard labor, but American diplomats eventually negotiated their release. In this surprising, deeply human talk, Lee shares her experience living as the enemy in a detention center for 140 days -- and the tiny gestures of humanity from her guards that sustained her.<img src=\"http://feeds.feedburner.com/~r/iTunesPodcastTTNewsPolitics/~4/WXyYUiGUR8Y\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "84726252",
            "sourceUrl": "https://download.ted.com/talks/EunaLee_2016X-480p.mp4?apikey=172BB350-0010",
            "categories": [
                "Higher Education"
            ]
        },
        {
            "title": "How to seek truth in the era of fake news | Christiane Amanpour",
            "datePublished": "Fri, 06 Oct 2017 14:30:30 +0000",
            "description": "Known worldwide for her courage and clarity, Christiane Amanpour has spent the past three decades interviewing business, cultural and political leaders who have shaped history. In conversation with TED Curator Chris Anderson, Amanpour discusses fake news, objectivity in journalism, the leadership vacuum in global politics and more, sharing her wisdom along the way. \"Be careful where you get information from,\" she says. \"Unless we are all engaged as global citizens who appreciate the truth, who understand science, empirical evidence and facts, then we are going to be wandering around -- to a potential catastrophe.\"<img src=\"http://feeds.feedburner.com/~r/iTunesPodcastTTNewsPolitics/~4/EgaUellX6Z8\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "128848566",
            "sourceUrl": "https://download.ted.com/talks/ChristianeAmanpour_2017G-480p.mp4?apikey=172BB350-0010",
            "categories": [
                "Higher Education"
            ]
        },
        {
            "title": "Why I risked my life to expose a government massacre | Anjan Sundaram",
            "datePublished": "Tue, 24 Oct 2017 19:38:27 +0000",
            "description": "A war zone can pass for a mostly peaceful place when no one is watching, says investigative journalist and TED Fellow Anjan Sundaram. In this short, incisive talk, he takes us inside the conflict in the Central African Republic, where he saw the methodical preparation for ethnic cleansing, and shares a lesson about why it's important to bear witness to other people's suffering. \"Ignored people in all our communities tell us something important about who we are,\" Sundaram says. \"A witness can become precious, and their gaze most necessary, when violence passes silently, unseen and unheard.\"<img src=\"http://feeds.feedburner.com/~r/iTunesPodcastTTNewsPolitics/~4/Cq40qrXdnyA\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "54910494",
            "sourceUrl": "https://download.ted.com/talks/AnjanSundaram_2017U-480p.mp4?apikey=172BB350-0010",
            "categories": [
                "Higher Education"
            ]
        },
        {
            "title": "A Republican mayor's plan to replace partisanship with policy | G.T. Bynum",
            "datePublished": "Thu, 30 Nov 2017 20:39:27 +0000",
            "description": "Conventional wisdom says that to win an election, you need to play to your constituencies' basest, most divisive instincts. But as a candidate for mayor of Tulsa, Oklahoma, G.T. Bynum decided to skip the smear campaigns, tell voters what he wanted to accomplish and give them ways to measure his success -- and it led him to win the election. In a hopeful, funny talk, Bynum shares how he's tackling his city's most pressing issues and says that we need to set aside philosophical disagreements and focus on the aspirations that unite us.<img src=\"http://feeds.feedburner.com/~r/iTunesPodcastTTNewsPolitics/~4/rI3i0iqDxNc\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "95413900",
            "sourceUrl": "https://download.ted.com/talks/GTBynum_2017X-480p.mp4?apikey=172BB350-0010",
            "categories": [
                "Higher Education"
            ]
        },
        {
            "title": "How judges can show respect | Victoria Pratt",
            "datePublished": "Fri, 10 Nov 2017 15:57:11 +0000",
            "description": "In halls of justice around the world, how can we ensure everyone is treated with dignity and respect? A pioneering judge in New Jersey, Victoria Pratt shares her principles of \"procedural justice\" -- four simple, thoughtful steps that redefined the everyday business of her courtroom in Newark, changing lives along the way. \"When the court behaves differently, naturally people respond differently,\" Pratt says. \"We want people to enter our halls of justice ... and know that justice will be served there.\"<img src=\"http://feeds.feedburner.com/~r/iTunesPodcastTTNewsPolitics/~4/eoiIPR_6usI\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "115446026",
            "sourceUrl": "https://download.ted.com/talks/VictoriaPratt_2017S-480p.mp4?apikey=172BB350-0010",
            "categories": [
                "Higher Education"
            ]
        },
        {
            "title": "Activism needs introverts | Sarah Corbett",
            "datePublished": "Tue, 21 Nov 2017 20:53:16 +0000",
            "description": "For the introverts among us, traditional forms activism like marches, protests and door-to-door canvassing can be intimidating and stressful. Take it from Sarah Corbett, a former professional campaigner and self-proclaimed introvert. She introduces us to \"craftivism,\" a quieter form of activism that uses handicrafts as a way to get people to slow down and think deeply about the issues they're facing, all while engaging the public more gently. Who says an embroidered handkerchief can't change the world?<img src=\"http://feeds.feedburner.com/~r/iTunesPodcastTTNewsPolitics/~4/JNoFS-nMlno\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "97863417",
            "sourceUrl": "https://download.ted.com/talks/SarahCorbett_2016X-480p.mp4?apikey=172BB350-0010",
            "categories": [
                "Higher Education"
            ]
        },
        {
            "title": "An interview with Mauritius's first female president | Ameenah Gurib-Fakim and Stephanie Busari",
            "datePublished": "Wed, 08 Nov 2017 16:01:57 +0000",
            "description": "(NOTE: Ameenah Gurib-Fakim stepped down as president of Mauritius in March 2018, following accusations that she misused a credit card given to her by a nonprofit. Read \"Criticisms & Updates\" below for more details.) Ameenah Gurib-Fakim was an academic and entrepreneur before being appointed president of Mauritius -- the first Muslim female head of state in Africa. In a wide-ranging conversation with journalist Stephanie Busari, Gurib-Fakim discusses the humble beginnings of her political career, what it's like to be both a person of faith and a scientist and why we need to value traditional African knowledge, among much more. \"I don't think you should take yourself seriously,\" she says. \"You need to have trust in what you can do, have confidence in yourself and give yourself a set of goals and just work towards them.\"<img src=\"http://feeds.feedburner.com/~r/iTunesPodcastTTNewsPolitics/~4/0-pqdzYWlBY\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "123680359",
            "sourceUrl": "https://download.ted.com/talks/AmeenahGuribFakim_2017G-480p.mp4?apikey=172BB350-0010",
            "categories": [
                "Higher Education"
            ]
        },
        {
            "title": "What I learned serving time for a crime I didn't commit | Teresa Njoroge",
            "datePublished": "Mon, 13 Nov 2017 15:52:00 +0000",
            "description": "In 2011, Teresa Njoroge was convicted of a financial crime she didn't commit -- the result of a long string of false accusations, increasing bribe attempts and the corrupt justice system in her home in Kenya. Once incarcerated, she discovered that most of the women and girls locked up with her were also victims of the same broken system, caught in a revolving door of life in and out of prison due to poor education and lack of economic opportunity. Now free and cleared by the courts of appeal, Njoroge shares how she's giving women in prison the skills, tools and support they need to break the cycle of poverty and crime and build a better life.<img src=\"http://feeds.feedburner.com/~r/iTunesPodcastTTNewsPolitics/~4/vVRxw6a6qAQ\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "89173778",
            "sourceUrl": "https://download.ted.com/talks/TeresaNjoroge_2017W-480p.mp4?apikey=172BB350-0010",
            "categories": [
                "Higher Education"
            ]
        },
        {
            "title": "How to transform apocalypse fatigue into action on global warming | Per Espen Stoknes",
            "datePublished": "Fri, 17 Nov 2017 21:08:05 +0000",
            "description": "The biggest obstacle to dealing with climate disruptions lies between your ears, says psychologist and economist Per Espen Stokes. He's spent years studying the defenses we use to avoid thinking about the demise of our planet -- and figuring out a new way of talking about global warming that keeps us from shutting down. Step away from the doomsday narratives and learn how to make caring for the earth feel personable, do-able and empowering with this fun, informative talk.<img src=\"http://feeds.feedburner.com/~r/iTunesPodcastTTNewsPolitics/~4/DAzsCUClr00\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "107784251",
            "sourceUrl": "https://download.ted.com/talks/PerEspenStoknes_2017G-480p.mp4?apikey=172BB350-0010",
            "categories": [
                "Higher Education"
            ]
        },
        {
            "title": "How adoption worked for me | Christopher Ategeka",
            "datePublished": "Tue, 02 Jan 2018 15:42:55 +0000",
            "description": "Talent is universal, but opportunity isn't, says TED Fellow Christopher Ategeka. In this charming, hopeful talk, Ategeka tells his story of being orphaned at a young age -- and how being adopted gave him the chance to experience a new culture, acquire an education and live up to his full potential. \"We may not be able to solve the bigotry and the racism of this world today,\" Ategeka says, \"But certainly we can raise children to create a positive, inclusive, connected world full of empathy, love and compassion.\"<img src=\"http://feeds.feedburner.com/~r/iTunesPodcastTTNewsPolitics/~4/oQHYPSqiqX0\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "58177803",
            "sourceUrl": "https://download.ted.com/talks/ChristopherAtegeka_2017G-480p.mp4?apikey=172BB350-0010",
            "categories": [
                "Higher Education"
            ]
        },
        {
            "title": "From death row to law graduate | Peter Ouko",
            "datePublished": "Fri, 02 Feb 2018 16:00:07 +0000",
            "description": "Peter Ouko spent 18 years in Kamiti Prison in Kenya, sometimes locked up in a cell with 13 other grown men for 23 and a half hours a day. In a moving talk, he tells the story of how he was freed -- and his current mission with the African Prisons Project: to set up the first law school behind bars and empower people in prison to drive positive change.<img src=\"http://feeds.feedburner.com/~r/iTunesPodcastTTNewsPolitics/~4/Ek0hmNZpiqQ\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "64286677",
            "sourceUrl": "https://download.ted.com/talks/PeterOuko_2017G-480p.mp4?apikey=172BB350-0010",
            "categories": [
                "Higher Education"
            ]
        },
        {
            "title": "My descent into America's neo-Nazi movement -- and how I got out | Christian Picciolini",
            "datePublished": "Wed, 28 Mar 2018 19:56:49 +0000",
            "description": "At 14, Christian Picciolini went from na茂ve teenager to white supremacist -- and soon, the leader of the first neo-Nazi skinhead gang in the United States. How was he radicalized, and how did he ultimately get out of the movement? In this courageous talk, Picciolini shares the surprising and counterintuitive solution to hate in all forms.<img src=\"http://feeds.feedburner.com/~r/iTunesPodcastTTNewsPolitics/~4/ck_jA1Qrg6k\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "145437529",
            "sourceUrl": "https://download.ted.com/talks/ChristianPicciolini_2017X-480p.mp4?apikey=172BB350-0010",
            "categories": [
                "Higher Education"
            ]
        },
        {
            "title": "3 thoughtful ways to conserve water | Lana Mazahreh",
            "datePublished": "Wed, 03 Jan 2018 15:58:32 +0000",
            "description": "According to the UN, nearly one in three people worldwide live in a country facing a water crisis, and less than five percent of the world lives in a country that has more water today than it did 20 years ago. Lana Mazahreh grew up in Jordan, a state that has experienced absolute water scarcity since 1973, where she learned how to conserve water as soon as she was old enough to learn how to write her name. In this practical talk, she shares three lessons from water-poor countries on how to save water and address what's fast becoming a global crisis.<img src=\"http://feeds.feedburner.com/~r/iTunesPodcastTTNewsPolitics/~4/U_08iJ6DBVI\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "82200153",
            "sourceUrl": "https://download.ted.com/talks/LanaMazahreh_2017S-480p.mp4?apikey=172BB350-0010",
            "categories": [
                "Higher Education"
            ]
        },
        {
            "title": "How to put the power of law in people's hands | Vivek Maru",
            "datePublished": "Fri, 12 Jan 2018 15:56:43 +0000",
            "description": "What can you do when the wheels of justice don't turn fast enough? Or when they don't turn at all? Vivek Maru is working to transform the relationship between people and law, turning law from an abstraction or threat into something that everyone can understand, use and shape. Instead of relying solely on lawyers, Maru started a global network of community paralegals, or barefoot lawyers, who serve in their own communities and break the law down into simple terms to help people find solutions. Learn more about how this innovative approach to using the law is helping socially excluded people claim their rights. \"A little bit of legal empowerment can go a long way,\" Maru says.<img src=\"http://feeds.feedburner.com/~r/iTunesPodcastTTNewsPolitics/~4/2Ihen0pc3ww\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "141675383",
            "sourceUrl": "https://download.ted.com/talks/VivekMaru_2017G-480p.mp4?apikey=172BB350-0010",
            "categories": [
                "Higher Education"
            ]
        },
        {
            "title": "What comes after tragedy? Forgiveness | Azim Khamisa and Ples Felix",
            "datePublished": "Fri, 19 Jan 2018 20:46:15 +0000",
            "description": "On one awful night in 1995, Ples Felix's 14-year-old grandson murdered Azim Khamisa's son in a gang initiation fueled by drugs, alcohol and a false sense of belonging. The deadly encounter sent Khamisa and Felix down paths of deep meditation, to forgive and to be forgiven -- and in an act of bravery and reconciliation, the two men met and forged a lasting bond. Together, they've used their story as an outline for a better, more merciful society, where victims of tragedy can grow and heal. Prepare to be moved by their unimaginable story. \"Peace is possible,\" Khamisa says. \"How do I know that? Because I am at peace.\"<img src=\"http://feeds.feedburner.com/~r/iTunesPodcastTTNewsPolitics/~4/mDG6MwnWaZc\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "94339908",
            "sourceUrl": "https://download.ted.com/talks/AzimKhamisaandPlesFelix_2017W-480p.mp4?apikey=172BB350-0010",
            "categories": [
                "Higher Education"
            ]
        },
        {
            "title": "American bipartisan politics can be saved -- here's how | Bob Inglis",
            "datePublished": "Thu, 18 Jan 2018 16:01:45 +0000",
            "description": "Former Republican member of the U.S. Congress Bob Inglis shares an optimistic message about how conservatives can lead on climate change and other pressing problems -- and how free enterprise (and working together across ideologies) hold the solutions. \"The United States was not built by those who waited and wished to look behind them,\" Inglis says. \"Lead now ... Tell the American people that we still have moon shots in us.\"<img src=\"http://feeds.feedburner.com/~r/iTunesPodcastTTNewsPolitics/~4/3hl4mzPqjnM\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "76272175",
            "sourceUrl": "https://download.ted.com/talks/BobInglis_2017X-480p.mp4?apikey=172BB350-0010",
            "categories": [
                "Higher Education"
            ]
        },
        {
            "title": "How protest is redefining democracy around the world | Zachariah Mampilly",
            "datePublished": "Thu, 08 Feb 2018 20:44:12 +0000",
            "description": "The democratic process is messy, complicated and often inefficient -- but across Africa, activists are redefining democracy by putting protest at its center. In an illuminating talk, political scientist Zachariah Mampilly gives us a primer on the current wave of protests reshaping countries like Tunisia, Malawi and Zimbabwe -- and explains how this form of political dissension expands our political imaginations beyond what we're told is possible.<img src=\"http://feeds.feedburner.com/~r/iTunesPodcastTTNewsPolitics/~4/atrvV7cWzZk\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "74400377",
            "sourceUrl": "https://download.ted.com/talks/ZachariahMampilly_2017G-480p.mp4?apikey=172BB350-0010",
            "categories": [
                "Higher Education"
            ]
        },
        {
            "title": "3 lessons of revolutionary love in a time of rage | Valarie Kaur",
            "datePublished": "Fri, 09 Feb 2018 15:49:10 +0000",
            "description": "What's the antidote to rising nationalism, polarization and hate? In this inspiring, poetic talk, Valarie Kaur asks us to reclaim love as a revolutionary act. As she journeys from the birthing room to tragic sites of bloodshed, Kaur shows us how the choice to love can be a force for justice.<img src=\"http://feeds.feedburner.com/~r/iTunesPodcastTTNewsPolitics/~4/2C8PMClcotk\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "159020796",
            "sourceUrl": "https://download.ted.com/talks/ValarieKaur_2017W-480p.mp4?apikey=172BB350-0010",
            "categories": [
                "Higher Education"
            ]
        },
        {
            "title": "Capitalism isn't an ideology -- it's an operating system | Bhu Srinivasan",
            "datePublished": "Mon, 12 Feb 2018 15:43:09 +0000",
            "description": "Bhu Srinivasan researches the intersection of capitalism and technological progress. Instead of thinking about capitalism as a firm, unchanging ideology, he suggests that we should think of it as an operating system -- one that needs upgrades to keep up with innovation, like the impending take-off of drone delivery services. Learn more about the past and future of the free market (and a potential coming identity crisis for the United States' version of capitalism) with this quick, forward-thinking talk.<img src=\"http://feeds.feedburner.com/~r/iTunesPodcastTTNewsPolitics/~4/yCL12RqI1xU\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "45024388",
            "sourceUrl": "https://download.ted.com/talks/BhuSrinivasan_2017S-480p.mp4?apikey=172BB350-0010",
            "categories": [
                "Higher Education"
            ]
        },
        {
            "title": "Refugees want empowerment, not handouts | Robert Hakiza",
            "datePublished": "Thu, 22 Feb 2018 20:58:33 +0000",
            "description": "The prevailing image of where refugees live is of temporary camps in isolated areas -- but in reality, nearly 60 percent of them worldwide end up in urban areas. TED Fellow Robert Hakiza takes us inside the lives of urban refugees -- and shows us how organizations like the one that he started can provide them with the skills they need to ultimately become self-sufficient.<img src=\"http://feeds.feedburner.com/~r/iTunesPodcastTTNewsPolitics/~4/86Oe9RRBSCI\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "49594870",
            "sourceUrl": "https://download.ted.com/talks/RobertHakiza_2017G-480p.mp4?apikey=172BB350-0010",
            "categories": [
                "Higher Education"
            ]
        },
        {
            "title": "How to resolve racially stressful situations | Howard C. Stevenson",
            "datePublished": "Wed, 21 Feb 2018 15:38:00 +0000",
            "description": "If we hope to heal the racial tensions that threaten to tear the fabric of society apart, we're going to need the skills to openly express ourselves in racially stressful situations. Through racial literacy -- the ability to read, recast and resolve these situations -- psychologist Howard C. Stevenson helps children and parents reduce and manage stress and trauma. In this inspiring, quietly awesome talk, learn more about how this approach to decoding racial threat can help youth build confidence and stand up for themselves in productive ways.<img src=\"http://feeds.feedburner.com/~r/iTunesPodcastTTNewsPolitics/~4/Vozx0MK3qnk\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "126265887",
            "sourceUrl": "https://download.ted.com/talks/HowardStevenson_2017P-480p.mp4?apikey=172BB350-0010",
            "categories": [
                "Higher Education"
            ]
        },
        {
            "title": "How shocking events can spark positive change | Naomi Klein",
            "datePublished": "Wed, 07 Mar 2018 15:55:53 +0000",
            "description": "Things are pretty shocking out there right now -- record-breaking storms, deadly terror attacks, thousands of migrants disappearing beneath the waves and openly supremacist movements rising. Are we responding with the urgency that these overlapping crises demand from us? Journalist and activist Naomi Klein studies how governments use large-scale shocks to push societies backward. She shares a few propositions from \"The Leap\" -- a manifesto she wrote alongside indigenous elders, climate change activists, union leaders and others from different backgrounds -- which envisions a world after we've already made the transition to a clean economy and a much fairer society. \"The shocking events that fill us with dread today can transform us, and they can transform the world for the better,\" Klein says. \"But first we need to picture the world that we're fighting for. And we have to dream it up together.\"<img src=\"http://feeds.feedburner.com/~r/iTunesPodcastTTNewsPolitics/~4/xTPgROHv5yI\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "111622529",
            "sourceUrl": "https://download.ted.com/talks/NaomiKlein_2017G-480p.mp4?apikey=172BB350-0010",
            "categories": [
                "Higher Education"
            ]
        },
        {
            "title": "How Baltimore called a ceasefire | Erricka Bridgeford",
            "datePublished": "Tue, 08 May 2018 14:44:29 +0000",
            "description": "In one day, in one city, in one neighborhood -- what if everyone put their guns down? Erricka Bridgeford is a peacemaker who wants to stop the murders and violence in her hometown of Baltimore. So she helped organize the Baltimore Ceasefire, a grassroots campaign to keep the peace. In a passionate, personal talk, Bridgeford tells the story of the Ceasefire movement and their bigger vision for zero murders in Baltimore.<img src=\"http://feeds.feedburner.com/~r/iTunesPodcastTTNewsPolitics/~4/wcThiOShBDk\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "80830516",
            "sourceUrl": "https://download.ted.com/talks/ErrickaBridgeford_2017X-480p.mp4?apikey=172BB350-0010",
            "categories": [
                "Higher Education"
            ]
        },
        {
            "title": "The human stories behind mass incarceration | Eve Abrams",
            "datePublished": "Thu, 22 Mar 2018 19:48:49 +0000",
            "description": "The United States locks up more people than any other country in the world, says documentarian Eve Abrams, and somewhere between one and four percent of those in prison are likely innocent. That's 87,000 brothers, sisters, mothers and fathers -- predominantly African American -- unnecessarily separated from their families, their lives and dreams put on hold. Using audio from her interviews with incarcerated people and their families, Abrams shares touching stories of those impacted by mass incarceration and calls on us all to take a stand and ensure that the justice system works for everyone.<img src=\"http://feeds.feedburner.com/~r/iTunesPodcastTTNewsPolitics/~4/KSD90ZsuVHY\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "98137329",
            "sourceUrl": "https://download.ted.com/talks/EveAbrams_2017W-480p.mp4?apikey=172BB350-0010",
            "categories": [
                "Higher Education"
            ]
        },
        {
            "title": "What if we replaced politicians with randomly selected people? | Brett Hennig",
            "datePublished": "Tue, 05 Jun 2018 20:03:56 +0000",
            "description": "If you think democracy is broken, here's an idea: let's replace politicians with randomly selected people. Author and activist Brett Hennig presents a compelling case for sortition democracy, or random selection of government officials -- a system with roots in ancient Athens that taps into the wisdom of the crowd and entrusts ordinary people with making balanced decisions for the greater good of everyone. Sound crazy? Learn more about how it could work to create a world free of partisan politics.<img src=\"http://feeds.feedburner.com/~r/iTunesPodcastTTNewsPolitics/~4/4T0Y990jGSs\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "69142358",
            "sourceUrl": "https://download.ted.com/talks/BrettHennig_2017X-480p.mp4?apikey=172BB350-0010",
            "categories": [
                "Higher Education"
            ]
        },
        {
            "title": "War and what comes after | Clemantine Wamariya",
            "datePublished": "Tue, 24 Apr 2018 14:55:14 +0000",
            "description": "Clemantine Wamariya was six years old when the Rwandan Civil War forced her and her sister to flee their home in Kigali, leaving their parents and everything they knew behind. In this deeply personal talk, she tells the story of how she became a refugee, living in camps in seven countries over the next six years -- and how she's tried to make sense of what came after.<img src=\"http://feeds.feedburner.com/~r/iTunesPodcastTTNewsPolitics/~4/iKCCBkkH4KI\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "91418153",
            "sourceUrl": "https://download.ted.com/talks/ClemantineWamariya_2017W-480p.mp4?apikey=172BB350-0010",
            "categories": [
                "Higher Education"
            ]
        },
        {
            "title": "What's missing in the global debate over refugees | Yasin Kakande",
            "datePublished": "Mon, 16 Apr 2018 14:54:15 +0000",
            "description": "In the ongoing debate over refugees, we hear from everyone -- from politicians who pledge border controls to citizens who fear they'll lose their jobs -- everyone, that is, except migrants themselves. Why are they coming? Journalist and TED Fellow Yasin Kakande explains what compelled him and many others to flee their homelands, urging a more open discussion and a new perspective. Because humanity's story, he reminds us, is a story of migration: \"There are no restrictions that could ever be so rigorous to stop the wave of migration that has determined our human history,\" he says.<img src=\"http://feeds.feedburner.com/~r/iTunesPodcastTTNewsPolitics/~4/xHATlCBE4DE\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "31941060",
            "sourceUrl": "https://download.ted.com/talks/YasinKakande_2018U-480p.mp4?apikey=172BB350-0010",
            "categories": [
                "Higher Education"
            ]
        },
        {
            "title": "What if we ended the injustice of bail? | Robin Steinberg",
            "datePublished": "Thu, 12 Apr 2018 22:41:22 +0000",
            "description": "On any given night, more than 450,000 people in the United States are locked up in jail simply because they don't have enough money to pay bail. The sums in question are often around $500: easy for some to pay, impossible for others. This has real human consequences -- people lose jobs, homes and lives, and it drives racial disparities in the legal system. Robin Steinberg has a bold idea to change this. In this powerful talk, she outlines the plan for The Bail Project -- an unprecedented national revolving bail fund to fight mass incarceration. (This ambitious idea is part of the Audacious Project, TED's initiative to inspire and fund global change.)<img src=\"http://feeds.feedburner.com/~r/iTunesPodcastTTNewsPolitics/~4/fcPzt0WcFKA\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "103468903",
            "sourceUrl": "https://download.ted.com/talks/RobinSteinberg_2018-480p.mp4?apikey=172BB350-0010",
            "categories": [
                "Higher Education"
            ]
        },
        {
            "title": "A Parkland teacher's homework for us all | Diane Wolk-Rogers",
            "datePublished": "Fri, 20 Apr 2018 14:02:17 +0000",
            "description": "Diane Wolk-Rogers teaches history at Marjory Stoneman Douglas High School in Parkland, Florida, site of a horrific school shooting on Valentine's Day 2018. How can we end this senseless violence? In a stirring talk, Wolk-Rogers offers three ways Americans can move forward to create more safety and responsibility around guns -- and invites people to come up with their own answers, too. Above all, she asks us to take a cue from the student activists at her school, survivors whose work for change has moved millions to action. \"They shouldn't have to do this on their own,\" Wolk-Rogers says. \"They're asking you to get involved.\"<img src=\"http://feeds.feedburner.com/~r/iTunesPodcastTTNewsPolitics/~4/DlBcJ-uJcYg\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "113151316",
            "sourceUrl": "https://download.ted.com/talks/DianeWolkRogers_2018-480p.mp4?apikey=172BB350-0010",
            "categories": [
                "Higher Education"
            ]
        },
        {
            "title": "A woman's fury holds lifetimes of wisdom | Tracee Ellis Ross",
            "datePublished": "Wed, 25 Apr 2018 14:58:33 +0000",
            "description": "The global collection of women's experiences can no longer be ignored, says actress and activist Tracee Ellis Ross. In a candid, fearless talk, she delivers invitations to a better future to both men and women.<img src=\"http://feeds.feedburner.com/~r/iTunesPodcastTTNewsPolitics/~4/Fr9xmj4Z5Kg\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "76252775",
            "sourceUrl": "https://download.ted.com/talks/TraceeEllisRoss_2018-480p.mp4?apikey=172BB350-0010",
            "categories": [
                "Higher Education"
            ]
        },
        {
            "title": "It's time for the law to protect victims of gender violence | Laura L. Dunn",
            "datePublished": "Wed, 02 May 2018 14:52:07 +0000",
            "description": "To make accountability the norm after gender violence in the United States, we need to change tactics, says victims' rights attorney and TED Fellow Laura L. Dunn. Instead of going institution by institution, fighting for reform, we need to go to the Constitution and finally pass the Equal Rights Amendment, which would require states to address gender inequality and violence. By ushering in sweeping change, Dunn says, \"our legal system can become a system of justice, and #MeToo can finally become 'no more.'\"<img src=\"http://feeds.feedburner.com/~r/iTunesPodcastTTNewsPolitics/~4/RXjXao2jn6E\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "45170111",
            "sourceUrl": "https://download.ted.com/talks/LauraLDunn_2018U-480p.mp4?apikey=172BB350-0010",
            "categories": [
                "Higher Education"
            ]
        },
        {
            "title": "Is the world getting better or worse? A look at the numbers | Steven Pinker",
            "datePublished": "Mon, 30 Apr 2018 15:02:00 +0000",
            "description": "Was 2017 really the \"worst year ever,\" as some would have us believe? In his analysis of recent data on homicide, war, poverty, pollution and more, psychologist Steven Pinker finds that we're doing better now in every one of them when compared with 30 years ago. But progress isn't inevitable, and it doesn't mean everything gets better for everyone all the time, Pinker says. Instead, progress is problem-solving, and we should look at things like climate change and nuclear war as problems to be solved, not apocalypses in waiting. \"We will never have a perfect world, and it would be dangerous to seek one,\" he says. \"But there's no limit to the betterments we can attain if we continue to apply knowledge to enhance human flourishing.\"<img src=\"http://feeds.feedburner.com/~r/iTunesPodcastTTNewsPolitics/~4/4i1gKm4DFww\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "132894450",
            "sourceUrl": "https://download.ted.com/talks/StevenPinker_2018-480p.mp4?apikey=172BB350-0010",
            "categories": [
                "Higher Education"
            ]
        },
        {
            "title": "What it's like to be the child of immigrants | Michael Rain",
            "datePublished": "Tue, 22 May 2018 14:51:26 +0000",
            "description": "Michael Rain is on a mission to tell the stories of first-generation immigrants, who have strong ties both to the countries they grew up in and their countries of origin. In a personal talk, he breaks down the mischaracterizations and limited narratives of immigrants and shares the stories of the worlds they belong to. \"We're walking melting pots of culture,\" Rain says. \"If something in that pot smells new or different to you, don't turn up your nose. Ask us to share.\"<img src=\"http://feeds.feedburner.com/~r/iTunesPodcastTTNewsPolitics/~4/iRascJJwQVo\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "58248575",
            "sourceUrl": "https://download.ted.com/talks/MichaelRain_2017S-480p.mp4?apikey=172BB350-0010",
            "categories": [
                "Higher Education"
            ]
        },
        {
            "title": "Why teens confess to crimes they didn't commit | Lindsay Malloy",
            "datePublished": "Tue, 03 Jul 2018 16:01:06 +0000",
            "description": "Why do juveniles falsely confess to crimes? What makes them more vulnerable than adults to this shocking, counterintuitive phenomenon? Through the lens of Brendan Dassey's interrogation and confession (as featured in Netflix's \"Making a Murderer\" documentary), developmental psychology professor and researcher Lindsay Malloy breaks down the science underlying false confessions and calls for change in the way kids are treated by a legal system designed for adults.<img src=\"http://feeds.feedburner.com/~r/iTunesPodcastTTNewsPolitics/~4/1oySooHpfSg\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "103436750",
            "sourceUrl": "https://download.ted.com/talks/LindsayMalloy_2016X-480p.mp4?apikey=172BB350-0010",
            "categories": [
                "Higher Education"
            ]
        },
        {
            "title": "What the Russian Revolution would have looked like on social media | Mikhail Zygar",
            "datePublished": "Wed, 18 Jul 2018 20:05:11 +0000",
            "description": "History is written by the victors, as the saying goes -- but what would it look like if it was written by everyone? Journalist and TED Fellow Mikhail Zygar is on a mission to show us with Project1917, a \"social network for dead people\" that posts the real diaries and letters of more than 3,000 people who lived during the Russian Revolution. By showing the daily thoughts of the likes of Lenin, Trotsky and many less celebrated figures, the project sheds new light on history as it once was -- and as it could have been. Learn more about this digital retelling of the past as well as Zygar's latest project about the transformative year of 1968.<img src=\"http://feeds.feedburner.com/~r/iTunesPodcastTTNewsPolitics/~4/pSbwBxYiPFU\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "35262964",
            "sourceUrl": "https://download.ted.com/talks/MikhailZygar_2018U-480p.mp4?apikey=172BB350-0010",
            "categories": [
                "Higher Education"
            ]
        },
        {
            "title": "Did the global response to 9/11 make us safer? | Benedetta Berti",
            "datePublished": "Tue, 11 Sep 2018 14:50:56 +0000",
            "description": "If we want sustainable, long-term security to be the norm in the world, it's time to radically rethink how we can achieve it, says TED Fellow and conflict researcher Benedetta Berti. In an eye-opening talk, Berti explains how building a safer world has a lot less to do with crushing enemies on the battlefield and a lot more to do with protecting civilians -- no matter where they're from or where they live.<img src=\"http://feeds.feedburner.com/~r/iTunesPodcastTTNewsPolitics/~4/uA35Fcy8OT4\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "56338399",
            "sourceUrl": "https://download.ted.com/talks/BenedettaBerti_2018U-480p.mp4?apikey=172BB350-0010",
            "categories": [
                "Higher Education"
            ]
        },
        {
            "title": "How police and the public can create safer neighborhoods together | Tracie Keesee",
            "datePublished": "Tue, 25 Sep 2018 14:46:17 +0000",
            "description": "We all want to be safe, and our safety is intertwined, says Tracie Keesee, cofounder of the Center for Policing Equity. Sharing lessons she's learned from 25 years as a police officer, Keesee reflects on the public safety challenges faced by both the police and local neighborhoods, especially in the African American community, as well as the opportunities we all have to preserve dignity and guarantee justice. \"We must move forward together. There's no more us versus them,\" Keesee says.<img src=\"http://feeds.feedburner.com/~r/iTunesPodcastTTNewsPolitics/~4/6ShK8Lnn-8M\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "71680833",
            "sourceUrl": "https://download.ted.com/talks/TracieKeesee_2018S-480p.mp4?apikey=172BB350-0010",
            "categories": [
                "Higher Education"
            ]
        },
        {
            "title": "How whistle-blowers shape history | Kelly Richmond Pope",
            "datePublished": "Fri, 12 Oct 2018 14:41:22 +0000",
            "description": "Fraud researcher and documentary filmmaker Kelly Richmond Pope shares lessons from some of the most high-profile whistle-blowers of the past, explaining how they've shared information that has shaped society -- and why they need our trust and protection.<img src=\"http://feeds.feedburner.com/~r/iTunesPodcastTTNewsPolitics/~4/g1apRE7AQrk\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "86295058",
            "sourceUrl": "https://download.ted.com/talks/KellyRichmondPope_2017X-480p.mp4?apikey=172BB350-0010",
            "categories": [
                "Higher Education"
            ]
        },
        {
            "title": "What to trust in a \"post-truth\" world | Alex Edmans",
            "datePublished": "Mon, 12 Nov 2018 15:50:10 +0000",
            "description": "Only if you are truly open to the possibility of being wrong can you ever learn, says researcher Alex Edmans. In an insightful talk, he explores how confirmation bias -- the tendency to only accept information that supports your personal beliefs -- can lead you astray on social media, in politics and beyond, and offers three practical tools for finding evidence you can actually trust. (Hint: appoint someone to be the devil's advocate in your life.)<img src=\"http://feeds.feedburner.com/~r/iTunesPodcastTTNewsPolitics/~4/H4lmxdGi7oE\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "126309702",
            "sourceUrl": "https://download.ted.com/talks/AlexEdmans_2017X-480p.mp4?apikey=172BB350-0010",
            "categories": [
                "Higher Education"
            ]
        },
        {
            "title": "Is war between China and the US inevitable? | Graham Allison",
            "datePublished": "Tue, 30 Oct 2018 20:03:00 +0000",
            "description": "Taking lessons from a historical pattern called \"Thucydides's Trap,\" political scientist Graham Allison shows why a rising China and a dominant United States could be headed towards a violent collision no one wants -- and how we can summon the common sense and courage to avoid it.<img src=\"http://feeds.feedburner.com/~r/iTunesPodcastTTNewsPolitics/~4/V49GMb7Y5iE\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "134188967",
            "sourceUrl": "https://download.ted.com/talks/GrahamAllison_2018S-480p.mp4?apikey=172BB350-0010",
            "categories": [
                "Higher Education"
            ]
        },
        {
            "title": "The global goals we've made progress on -- and the ones we haven't | Michael Green",
            "datePublished": "Thu, 08 Nov 2018 15:45:03 +0000",
            "description": "\"We are living in a world that is tantalizingly close to ensuring that no one need die of hunger or malaria or diarrhea,\" says economist Michael Green. To help spur progress, back in 2015 the United Nations drew up a set of 17 goals around important factors like health, education and equality. In this data-packed talk, Green shares his analysis on the steps each country has (or hasn't) made toward these Sustainable Development Goals -- and offers new ideas on what needs to change so we can achieve them.<img src=\"http://feeds.feedburner.com/~r/iTunesPodcastTTNewsPolitics/~4/EjLNzdE7z58\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "101933202",
            "sourceUrl": "https://download.ted.com/talks/MichaelGreen_2018S-480p.mp4?apikey=172BB350-0010",
            "categories": [
                "Higher Education"
            ]
        },
        {
            "title": "Is civility a sham? | Teresa Bejan",
            "datePublished": "Wed, 14 Nov 2018 15:56:26 +0000",
            "description": "What exactly is civility, and what does it require? In a talk packed with historical insights, political theorist Teresa Bejan explains how civility has been used as both the foundation of tolerant societies and as a way for political partisans to silence and dismiss opposing views. Bejan suggests that we should instead try for \"mere civility\": the virtue of being able to disagree fundamentally with others without destroying the possibility of a common life tomorrow. (This talk contains mature language.)<img src=\"http://feeds.feedburner.com/~r/iTunesPodcastTTNewsPolitics/~4/LTQGRDBn2Sk\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "99833503",
            "sourceUrl": "https://download.ted.com/talks/TeresaBejan_2018S-480p.mp4?apikey=172BB350-0010",
            "categories": [
                "Higher Education"
            ]
        },
        {
            "title": "3 questions to ask yourself about everything you do | Stacey Abrams",
            "datePublished": "Tue, 04 Dec 2018 16:05:41 +0000",
            "description": "How you respond to setbacks is what defines your character, says Stacey Abrams, the first Black woman in the history of the United States to be nominated by a major party for governor. In an electrifying talk, she shares the lessons she learned from her campaign for governor of Georgia -- and some advice on how to change the world. \"Be aggressive about your ambition,\" Abrams says.<img src=\"http://feeds.feedburner.com/~r/iTunesPodcastTTNewsPolitics/~4/foYqy5V8tXA\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "90774249",
            "sourceUrl": "https://download.ted.com/talks/StaceyAbrams_2018W-480p.mp4?apikey=172BB350-0010",
            "categories": [
                "Higher Education"
            ]
        },
        {
            "title": "The political progress women have made -- and what's next | Cecile Richards",
            "datePublished": "Fri, 18 Jan 2019 16:08:42 +0000",
            "description": "Women have made enormous progress over the last century -- challenging the status quo, busting old taboos and changing business from the inside out. But when it comes to political representation, there's still a long way to go, says activist Cecile Richards. In this visionary talk, Richards calls for a global political revolution for women's equality and offers her ideas for how we can build it.<img src=\"http://feeds.feedburner.com/~r/iTunesPodcastTTNewsPolitics/~4/Pl1G33ItEp8\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "122367459",
            "sourceUrl": "https://download.ted.com/talks/CecileRichards_2018W-480p.mp4?apikey=172BB350-0010",
            "categories": [
                "Higher Education"
            ]
        },
        {
            "title": "This country isn't just carbon neutral -- it's carbon negative | Tshering Tobgay",
            "datePublished": "Fri, 11 Mar 2016 12:03:45 +0000",
            "description": "Deep in the Himalayas, on the border between China and India, lies the Kingdom of Bhutan, which has pledged to remain carbon neutral for all time. In this illuminating talk, Bhutan's Prime Minister Tshering Tobgay shares his country's mission to put happiness before economic growth and set a world standard for environmental preservation.<img src=\"http://feeds.feedburner.com/~r/iTunesPodcastTTNewsPolitics/~4/8rEsDZBNL0Q\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "135319878",
            "sourceUrl": "https://download.ted.com/talks/TsheringTobgay_2016-480p.mp4?apikey=172BB350-0010",
            "categories": [
                "Higher Education"
            ]
        },
        {
            "title": "What's needed to bring the US voting system into the 21st century | Tiana Epps-Johnson",
            "datePublished": "Wed, 23 Jan 2019 15:47:34 +0000",
            "description": "The American election system is complicated, to say the least -- but voting is one of the most tangible ways that each of us can shape our communities. How can we make the system more modern, inclusive and secure? Civic engagement champion Tiana Epps-Johnson shares what's needed to bring voting in the US into the 21st century -- and to get every person to the polls.<img src=\"http://feeds.feedburner.com/~r/iTunesPodcastTTNewsPolitics/~4/6MbdUNDSjsA\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "82638797",
            "sourceUrl": "https://download.ted.com/talks/TianaEppsJohnson_2018S-480p.mp4?apikey=172BB350-0010",
            "categories": [
                "Higher Education"
            ]
        },
        {
            "title": "How we can start to heal the pain of racial division | Ruby Sales",
            "datePublished": "Fri, 01 Feb 2019 16:02:02 +0000",
            "description": "\"Where does it hurt?\" It's a question that activist and educator Ruby Sales has traveled the US asking, looking deeply at the country's legacy of racism and searching for sources of healing. In this moving talk, she shares what she's learned, reflecting on her time as a freedom fighter in the civil rights movement and offering new thinking on pathways to racial justice.<img src=\"http://feeds.feedburner.com/~r/iTunesPodcastTTNewsPolitics/~4/W59MGpEcUkQ\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "146613827",
            "sourceUrl": "https://download.ted.com/talks/RubySales_2018S-480p.mp4?apikey=172BB350-0010",
            "categories": [
                "Higher Education"
            ]
        },
        {
            "title": "How women in Pakistan are creating political change | Shad Begum",
            "datePublished": "Mon, 11 Feb 2019 15:44:26 +0000",
            "description": "Activist Shad Begum has spent her life empowering women to live up to their full potential. In a personal talk, she shares her determined struggle to improve the lives of women in her deeply religious and conservative community in northwest Pakistan -- and calls for women around the world to find their political voice. \"We must stand up for our own rights -- and not wait for someone else to come and help us,\" Begum says.<img src=\"http://feeds.feedburner.com/~r/iTunesPodcastTTNewsPolitics/~4/-nzmMhqjLT4\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "99919744",
            "sourceUrl": "https://download.ted.com/talks/ShadBegum_2018W-480p.mp4?apikey=172BB350-0010",
            "categories": [
                "Higher Education"
            ]
        },
        {
            "title": "A juror's reflections on the death penalty | Lindy Lou Isonhood",
            "datePublished": "Tue, 26 Feb 2019 15:48:55 +0000",
            "description": "Lindy Lou Isonhood grew up in a town where the death penalty was a fact of life, part of the unspoken culture. But after she served as a juror in a capital murder trial -- and voted \"yes\" to sentencing a guilty man to death -- something inside her changed. In this engaging and personal talk, Isonhood reflects on the question she's been asking herself in the 25 years since the trial: Am I a murderer?<img src=\"http://feeds.feedburner.com/~r/iTunesPodcastTTNewsPolitics/~4/u2jzHPeKCPk\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "114809242",
            "sourceUrl": "https://download.ted.com/talks/LindyLouIsonhood_2018W-480p.mp4?apikey=172BB350-0010",
            "categories": [
                "Higher Education"
            ]
        },
        {
            "title": "A bold idea to replace politicians | C茅sar Hidalgo",
            "datePublished": "Tue, 05 Mar 2019 15:56:28 +0000",
            "description": "C茅sar Hidalgo has a radical suggestion for fixing our broken political system: automate it! In this provocative talk, he outlines a bold idea to bypass politicians by empowering citizens to create personalized AI representatives that participate directly in democratic decisions. Explore a new way to make collective decisions and expand your understanding of democracy.<img src=\"http://feeds.feedburner.com/~r/iTunesPodcastTTNewsPolitics/~4/OpIXhHdQqUI\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "94373188",
            "sourceUrl": "https://download.ted.com/talks/CesarHidalgo_2018-480p.mp4?apikey=172BB350-0010",
            "categories": [
                "Higher Education"
            ]
        },
        {
            "title": "An architect's subversive reimagining of the US-Mexico border wall | Ronald Rael",
            "datePublished": "Mon, 25 Feb 2019 16:00:15 +0000",
            "description": "What is a border? It's a line on a map, a place where cultures mix and merge in beautiful, sometimes violent and occasionally ridiculous ways. And a border wall? An overly simplistic response to that complexity, says architect Ronald Rael. In a moving, visual talk, Rael reimagines the physical barrier that divides the United States and Mexico -- sharing satirical, serious works of art inspired by the borderlands and showing us the border we don't see in the news. \"There are not two sides defined by a wall. This is one landscape, divided,\" Rael says.<img src=\"http://feeds.feedburner.com/~r/iTunesPodcastTTNewsPolitics/~4/f3Jqaepp7AU\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "82664987",
            "sourceUrl": "https://download.ted.com/talks/RonaldRael_2018S-480p.mp4?apikey=172BB350-0010",
            "categories": [
                "Higher Education"
            ]
        },
        {
            "title": "Is your country at risk of becoming a dictatorship? Here's how to know | Farida Nabourema",
            "datePublished": "Thu, 28 Feb 2019 15:48:59 +0000",
            "description": "Farida Nabourema has dedicated her life to fighting the military regime in Togo, Africa's oldest autocracy. She's learned two truths along the way: no country is destined to be oppressed -- and no country is immune to dictatorship. But how can you tell if you're at risk before it happens? In a stirring talk, Nabourema shares the four key signs of a dictatorship, along with the secret to defiance for those living within an oppressive system.<img src=\"http://feeds.feedburner.com/~r/iTunesPodcastTTNewsPolitics/~4/UKqHbtO1Xbo\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "81390252",
            "sourceUrl": "https://download.ted.com/talks/FaridaNabourema_2018W-480p.mp4?apikey=172BB350-0010",
            "categories": [
                "Higher Education"
            ]
        },
        {
            "title": "How I'm making bricks out of ashes and rubble in Gaza | Majd Mashharawi",
            "datePublished": "Mon, 04 Mar 2019 15:52:57 +0000",
            "description": "Majd Mashharawi was walking through her war-torn neighborhood in Gaza when an idea flashed in her mind: What if she could take the rubble and transform it into building materials? See how she designed a brick made out of ashes that's helping people rebuild their homes -- and learn about her new project: bringing solar-powered energy to families living in darkness.<img src=\"http://feeds.feedburner.com/~r/iTunesPodcastTTNewsPolitics/~4/zH0H9p1B-1g\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "77464952",
            "sourceUrl": "https://download.ted.com/talks/MajdMashharawi_2018W-480p.mp4?apikey=172BB350-0010",
            "categories": [
                "Higher Education"
            ]
        },
        {
            "title": "What refugees need to start new lives | Muhammed Idris",
            "datePublished": "Thu, 04 Apr 2019 14:51:39 +0000",
            "description": "Every minute, 20 people are newly displaced by climate change, economic crisis and political instability, according to the UNHCR. How can we help them overcome the barriers to starting new lives? TED Resident Muhammed Idris is leading a team of technologists, researchers and refugees to develop Atar, the first-ever AI-powered virtual advocate that guides displaced people through resettlement, helping restore their rights and dignity. \"Getting access to the right resources and information can be the difference between life and death,\" Idris says.<img src=\"http://feeds.feedburner.com/~r/iTunesPodcastTTNewsPolitics/~4/QExR2GQU7Uk\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "44642594",
            "sourceUrl": "https://download.ted.com/talks/MuhammedIdris_2018S-480p.mp4?apikey=172BB350-0010",
            "categories": [
                "Higher Education"
            ]
        },
        {
            "title": "Why we ignore obvious problems -- and how to act on them | Michele Wucker",
            "datePublished": "Wed, 01 May 2019 14:48:24 +0000",
            "description": "Why do we often neglect big problems, like the financial crisis and climate change, until it's too late? Policy strategist Michele Wucker urges us to replace the myth of the \"black swan\" -- that rare, unforeseeable, unavoidable catastrophe -- with the reality of the \"gray rhino,\" the preventable danger that we choose to ignore. She shows why predictable crises catch us by surprise -- and lays out some signs that there may be a charging rhino in your life right now.<img src=\"http://feeds.feedburner.com/~r/iTunesPodcastTTNewsPolitics/~4/P_-ndKnpnxU\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "72711151",
            "sourceUrl": "https://download.ted.com/talks/MicheleWucker_2019S-480p.mp4?apikey=172BB350-0010",
            "categories": [
                "Higher Education"
            ]
        },
        {
            "title": "What prosecutors and incarcerated people can learn from each other | Jarrell Daniels",
            "datePublished": "Fri, 24 May 2019 14:45:19 +0000",
            "description": "A few weeks before his release from prison, Jarrell Daniels took a class where incarcerated men learned alongside prosecutors. By simply sitting together and talking, they uncovered surprising truths about the criminal justice system and ideas for how real change happens. Now a scholar and activist, Daniels reflects on how collaborative education could transform the justice system and unlock solutions to social problems.<img src=\"http://feeds.feedburner.com/~r/iTunesPodcastTTNewsPolitics/~4/hHYPaCTMSf8\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "86786558",
            "sourceUrl": "https://download.ted.com/talks/JarrellDaniels_2019S-480p.mp4?apikey=172BB350-0010",
            "categories": [
                "Higher Education"
            ]
        },
        {
            "title": "Facebook's role in Brexit -- and the threat to democracy | Carole Cadwalladr",
            "datePublished": "Tue, 16 Apr 2019 20:09:00 +0000",
            "description": "In an unmissable talk, journalist Carole Cadwalladr digs into one of the most perplexing events in recent times: the UK's super-close 2016 vote to leave the European Union. Tracking the result to a barrage of misleading Facebook ads targeted at vulnerable Brexit swing voters -- and linking the same players and tactics to the 2016 US presidential election -- Cadwalladr calls out the \"gods of Silicon Valley\" for being on the wrong side of history and asks: Are free and fair elections a thing of the past?<img src=\"http://feeds.feedburner.com/~r/iTunesPodcastTTNewsPolitics/~4/qzHR69w0N_A\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "109453648",
            "sourceUrl": "https://download.ted.com/talks/CaroleCadwalladr_2019-480p.mp4?apikey=172BB350-0010",
            "categories": [
                "Higher Education"
            ]
        },
        {
            "title": "How to revive your belief in democracy | Eric Liu",
            "datePublished": "Tue, 07 May 2019 14:55:23 +0000",
            "description": "Civic evangelist Eric Liu shares a powerful way to rekindle the spirit of citizenship and the belief that democracy still works. Join him for a trip to \"Civic Saturday\" and learn more about how making civic engagement a weekly habit can help build communities based on shared values and a path to belonging.<img src=\"http://feeds.feedburner.com/~r/iTunesPodcastTTNewsPolitics/~4/1WiRuaOuvjQ\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "104588090",
            "sourceUrl": "https://download.ted.com/talks/EricLiu_2019-480p.mp4?apikey=172BB350-0010",
            "categories": [
                "Higher Education"
            ]
        },
        {
            "title": "How to deconstruct racism, one headline at a time | Baratunde Thurston",
            "datePublished": "Wed, 29 May 2019 14:52:45 +0000",
            "description": "Baratunde Thurston explores the phenomenon of white Americans calling the police on black Americans who have committed the crimes of ... eating, walking or generally \"living while black.\" In this profound, thought-provoking and often hilarious talk, he reveals the power of language to change stories of trauma into stories of healing -- while challenging us all to level up.<img src=\"http://feeds.feedburner.com/~r/iTunesPodcastTTNewsPolitics/~4/T2VHH7qOk24\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "120899814",
            "sourceUrl": "https://download.ted.com/talks/BaratundeThurston_2019-480p.mp4?apikey=172BB350-0010",
            "categories": [
                "Higher Education"
            ]
        },
        {
            "title": "The political power of being a good neighbor | Michael Tubbs",
            "datePublished": "Fri, 14 Jun 2019 14:49:29 +0000",
            "description": "Michael Tubbs is the youngest mayor in American history to represent a city with more than 100,000 people -- and his policies are sparking national conversations. In this rousing talk, he shares how growing up amid poverty and violence in Stockton, California shaped his bold vision for change and his commitment to govern as a neighbor, not a politician. \"When we see someone different from us, they should not reflect our fears, our anxieties, our insecurities,\" he says. \"We should see our common humanity.\"<img src=\"http://feeds.feedburner.com/~r/iTunesPodcastTTNewsPolitics/~4/YZt5JR4xNPI\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "125048722",
            "sourceUrl": "https://download.ted.com/talks/MichaelTubbs_2019-480p.mp4?apikey=172BB350-0010",
            "categories": [
                "Higher Education"
            ]
        },
        {
            "title": "A vision for the future of Sierra Leone | Julius Maada Bio",
            "datePublished": "Wed, 03 Jul 2019 14:44:49 +0000",
            "description": "When Julius Maada Bio first seized political power in Sierra Leone in 1996, he did so to improve the lives of its citizens. But he soon realized that for democracy to flourish, its foundation needs to be built on the will of the people. After arranging an election, he voluntarily gave up power and left Africa. Twenty years later, after being democratically elected president of Sierra Leone, he reflects on the slow path to democracy, the importance of education for all and his focus on helping young Sierra Leoneans thrive.<img src=\"http://feeds.feedburner.com/~r/iTunesPodcastTTNewsPolitics/~4/reniColtbSU\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "116514005",
            "sourceUrl": "https://download.ted.com/talks/JuliusMaadaBio_2019-480p.mp4?apikey=172BB350-0010",
            "categories": [
                "Higher Education"
            ]
        },
        {
            "title": "How policewomen make communities safer | Ivonne Roman",
            "datePublished": "Tue, 30 Jul 2019 14:51:16 +0000",
            "description": "Less than 13 percent of police officers in the United States are women -- despite their proven effectiveness in diffusing violent situations and reducing the use of force. Drawing on more than two decades of experience as a police officer and chief, TED Fellow Ivonne Roman shares how a simple change to police academy physical fitness tests could help build a more balanced force that benefits communities and officers alike.<img src=\"http://feeds.feedburner.com/~r/iTunesPodcastTTNewsPolitics/~4/PQJrOEdt_z8\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "42574262",
            "sourceUrl": "https://download.ted.com/talks/IvonneRoman_2019U-480p.mp4?apikey=172BB350-0010",
            "categories": [
                "Higher Education"
            ]
        },
        {
            "title": "What it was like to grow up under China's one-child policy | Nanfu Wang",
            "datePublished": "Wed, 31 Jul 2019 14:52:29 +0000",
            "description": "China's one-child policy ended in 2015, but we're just beginning to understand what it was like to live under the program, says TED Fellow and documentary filmmaker Nanfu Wang. With footage from her film \"One Child Nation,\" she shares untold stories that reveal the policy's complex consequences and expose the creeping power of propaganda.<img src=\"http://feeds.feedburner.com/~r/iTunesPodcastTTNewsPolitics/~4/KfC_rzetyPs\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "43180155",
            "sourceUrl": "https://download.ted.com/talks/NanfuWang_2019U-480p.mp4?apikey=172BB350-0010",
            "categories": [
                "Higher Education"
            ]
        },
        {
            "title": "The fundamental right to seek asylum | Melanie Nezer",
            "datePublished": "Tue, 16 Jul 2019 19:53:55 +0000",
            "description": "Refugee and immigrants rights attorney Melanie Nezer shares an urgently needed historical perspective on the crisis at the southern US border, showing how citizens can hold their governments accountable for protecting the vulnerable. \"A country shows strength through compassion and pragmatism, not through force and through fear,\" she says.<img src=\"http://feeds.feedburner.com/~r/iTunesPodcastTTNewsPolitics/~4/eOeFs3NW9R4\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "77339861",
            "sourceUrl": "https://download.ted.com/talks/MelanieNezer_2019X-480p.mp4?apikey=172BB350-0010",
            "categories": [
                "Higher Education"
            ]
        },
        {
            "title": "The new political story that could change everything | George Monbiot",
            "datePublished": "Fri, 26 Jul 2019 14:56:37 +0000",
            "description": "To get out of the mess we're in, we need a new story that explains the present and guides the future, says author George Monbiot. Drawing on findings from psychology, neuroscience and evolutionary biology, he offers a new vision for society built around our fundamental capacity for altruism and cooperation. This contagiously optimistic talk will make you rethink the possibilities for our shared future.<img src=\"http://feeds.feedburner.com/~r/iTunesPodcastTTNewsPolitics/~4/hci7ssqyUQ0\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "109807606",
            "sourceUrl": "https://download.ted.com/talks/GeorgeMonbiot_2019T-480p.mp4?apikey=172BB350-0010",
            "categories": [
                "Higher Education"
            ]
        },
        {
            "title": "Why governments should prioritize well-being | Nicola Sturgeon",
            "datePublished": "Mon, 29 Jul 2019 14:49:47 +0000",
            "description": "In 2018, Scotland, Iceland and New Zealand established the network of Wellbeing Economy Governments to challenge the acceptance of GDP as the ultimate measure of a country's success. In this visionary talk, First Minister of Scotland Nicola Sturgeon explains the far-reaching implications of a \"well-being economy\" -- which places factors like equal pay, childcare, mental health and access to green space at its heart -- and shows how this new focus could help build resolve to confront global challenges.<img src=\"http://feeds.feedburner.com/~r/iTunesPodcastTTNewsPolitics/~4/a15gUaDBqV0\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "72528514",
            "sourceUrl": "https://download.ted.com/talks/NicolaSturgeon_2019T-480p.mp4?apikey=172BB350-0010",
            "categories": [
                "Higher Education"
            ]
        },
        {
            "title": "How the West can adapt to a rising Asia | Kishore Mahbubani",
            "datePublished": "Mon, 26 Aug 2019 14:54:10 +0000",
            "description": "As Asian economies and governments continue to gain power, the West needs to find ways to adapt to the new global order, says author and diplomat Kishore Mahbubani. In an insightful look at international politics, Mahbubani shares a three-part strategy that Western governments can use to recover power and improve relations with the rest of the world.<img src=\"http://feeds.feedburner.com/~r/iTunesPodcastTTNewsPolitics/~4/Dghao_DsElw\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "128142206",
            "sourceUrl": "https://download.ted.com/talks/KishoreMahbubani_2019-480p.mp4?apikey=172BB350-0010",
            "categories": [
                "Higher Education"
            ]
        },
        {
            "title": "What I learned about freedom after escaping North Korea | Yeonmi Park",
            "datePublished": "Fri, 30 Aug 2019 14:55:51 +0000",
            "description": "\"North Korea is unimaginable,\" says human rights activist Yeonmi Park, who escaped the country at the age of 13. Sharing the harrowing story of her childhood, she reflects on the fragility of freedom -- and shows how change can be achieved even in the world's darkest places.<img src=\"http://feeds.feedburner.com/~r/iTunesPodcastTTNewsPolitics/~4/icQoYZOOVPw\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "77870245",
            "sourceUrl": "https://download.ted.com/talks/YeonmiPark_2019-480p.mp4?apikey=172BB350-0010",
            "categories": [
                "Higher Education"
            ]
        },
        {
            "title": "What happened when we paired up thousands of strangers to talk politics | Jochen Wegner",
            "datePublished": "Tue, 03 Sep 2019 17:00:56 +0000",
            "description": "In spring 2019, more than 17,000 Europeans from 33 countries signed up to have a political argument with a complete stranger. They were part of \"Europe Talks,\" a project that organizes one-on-one conversations between people who disagree -- sort of like a Tinder for politics. Editor Jochen Wegner shares the unexpected things that happened when people met up to talk -- and shows how face-to-face discussions could get a divided world to rethink itself.<img src=\"http://feeds.feedburner.com/~r/iTunesPodcastTTNewsPolitics/~4/bYEs-9nHWIE\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "99550561",
            "sourceUrl": "https://download.ted.com/talks/JochenWegner_2019T-480p.mp4?apikey=172BB350-0010",
            "categories": [
                "Higher Education"
            ]
        },
        {
            "title": "How we can make racism a solvable problem -- and improve policing | Dr. Phillip Atiba Goff",
            "datePublished": "Mon, 09 Sep 2019 14:50:49 +0000",
            "description": "When we define racism as behaviors instead of feelings, we can measure it -- and transform it from an impossible problem into a solvable one, says justice scientist Dr. Phillip Atiba Goff. In an actionable talk, he shares his work at the Center for Policing Equity, an organization that helps police departments diagnose and track racial gaps in policing in order to eliminate them. Learn more about their data-driven approach -- and how you can get involved with the work that still needs to be done. (This ambitious plan is part of the Audacious Project, TED's initiative to inspire and fund global change.)<img src=\"http://feeds.feedburner.com/~r/iTunesPodcastTTNewsPolitics/~4/c0x5nyLn9f8\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "87925999",
            "sourceUrl": "https://download.ted.com/talks/PhillipAtibaGoff_2019-480p.mp4?apikey=172BB350-0010",
            "categories": [
                "Higher Education"
            ]
        },
        {
            "title": "Community-powered criminal justice reform | Raj Jayadev",
            "datePublished": "Thu, 12 Sep 2019 19:57:22 +0000",
            "description": "Community organizer Raj Jayadev wants to transform the US court system through \"participatory defense\" -- a growing movement that empowers families and community members to impact their loved ones' court cases. He shares the remarkable results of their work -- including more than 4,000 years of \"time saved\" from incarceration -- and shows how this new model could shift the landscape of power in the courts.<img src=\"http://feeds.feedburner.com/~r/iTunesPodcastTTNewsPolitics/~4/D397Md2DbKU\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "90842619",
            "sourceUrl": "https://download.ted.com/talks/RajJayadev_2018X-480p.mp4?apikey=172BB350-0010",
            "categories": [
                "Higher Education"
            ]
        },
        {
            "title": "A wall won't solve America's border problems | Will Hurd",
            "datePublished": "Thu, 26 Sep 2019 14:59:26 +0000",
            "description": "\"Building a 30-foot-high concrete structure from sea to shining sea is the most expensive and least effective way to do border security,\" says Congressman Will Hurd, a Republican from Texas whose district encompasses two times zones and shares an 820-mile border with Mexico. Speaking from Washington, DC in a video interview with former state attorney general Anne Milgram, Hurd discusses the US government's border policy and its controversial detention and child separation practices -- and lays out steps toward a better future at the border. (Recorded at the TED World Theater in New York on September 10, 2019)<img src=\"http://feeds.feedburner.com/~r/iTunesPodcastTTNewsPolitics/~4/GaeHtObtO7E\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "124630609",
            "sourceUrl": "https://download.ted.com/talks/WillHurd_2019S-480p.mp4?apikey=172BB350-0010",
            "categories": [
                "Higher Education"
            ]
        },
        {
            "title": "Creativity builds nations | Muthoni Drummer Queen",
            "datePublished": "Fri, 27 Sep 2019 16:16:40 +0000",
            "description": "In a hopeful talk followed by an empowering performance, musician and TED Fellow Muthoni Drummer Queen shares how industries like music, film and fashion provide a platform for Africans to broadcast their rich and diverse talents -- and explains how the shared experience of creativity can replace attitudes of exclusionism and othering with acceptance and self-love.<img src=\"http://feeds.feedburner.com/~r/iTunesPodcastTTNewsPolitics/~4/KoXdVAVltag\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "85846637",
            "sourceUrl": "https://download.ted.com/talks/MuthoniDrummerQueen_2019U-480p.mp4?apikey=172BB350-0010",
            "categories": [
                "Higher Education"
            ]
        },
        {
            "title": "How we're helping local reporters turn important stories into national news | Gangadhar Patil",
            "datePublished": "Tue, 08 Oct 2019 19:51:20 +0000",
            "description": "Local reporters are on the front lines of important stories, but their work often goes unnoticed by national and international news outlets. TED Fellow and journalist Gangadhar Patil is working to change that. In this quick talk, he shows how he's connecting grassroots reporters in India with major news outlets worldwide -- and helping elevate and expose stories that might never get covered otherwise.<img src=\"http://feeds.feedburner.com/~r/iTunesPodcastTTNewsPolitics/~4/FlKhZgxVTuw\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "34721361",
            "sourceUrl": "https://download.ted.com/talks/GangadharPatil_2019U-480p.mp4?apikey=172BB350-0010",
            "categories": [
                "Higher Education"
            ]
        },
        {
            "title": "A circular economy for salt that keeps rivers clean | Tina Arrowood",
            "datePublished": "Wed, 16 Oct 2019 19:53:42 +0000",
            "description": "During the winter of 2018-2019, one million tons of salt were applied to icy roads in the state of Pennsylvania alone. The salt from industrial uses like this often ends up in freshwater rivers, making their water undrinkable and contributing to a growing global crisis. How can we better protect these precious natural resources? Physical organic chemist Tina Arrowood shares a three-step plan to keep salt out of rivers -- and create a circular salt economy that turns industrial byproducts into valuable resources.<img src=\"http://feeds.feedburner.com/~r/iTunesPodcastTTNewsPolitics/~4/ySrve2cVRY0\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "95883711",
            "sourceUrl": "https://download.ted.com/talks/TinaArrowood_2019S-480p.mp4?apikey=172BB350-0010",
            "categories": [
                "Higher Education"
            ]
        },
        {
            "title": "The Amazon belongs to humanity -- let's protect it together | Tashka and Laura Yawanaw谩",
            "datePublished": "Tue, 05 Nov 2019 15:49:49 +0000",
            "description": "Tashka and Laura Yawanawa lead the Yawanaw谩 people in Acre, Brazil -- a tribe that stewards almost 500,000 acres of Amazon rainforest. As footage of the Amazon burning shocks the world's consciousness, Tashka and Laura call for us to transform this moment into an opportunity to support indigenous people who have the experience, knowledge and tools needed to protect the land.<img src=\"http://feeds.feedburner.com/~r/iTunesPodcastTTNewsPolitics/~4/qr48XanoJpc\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "42656533",
            "sourceUrl": "https://download.ted.com/talks/TashkaYawanawa_2019S-480p.mp4?apikey=172BB350-0010",
            "categories": [
                "Higher Education"
            ]
        },
        {
            "title": "What happens to people in solitary confinement | Laura Rovner",
            "datePublished": "Tue, 05 Nov 2019 20:24:18 +0000",
            "description": "Imagine living with no significant human contact for years, even decades, in a cell the size of a small bathroom. This is the reality for those in long-term solitary confinement, a form of imprisonment regularly imposed in US prisons. In this eye-opening talk, civil rights lawyer Laura Rovner takes us to ADX, the US federal government's only supermax prison, and describes the dehumanizing effects of long-term solitude on the mind, personality and sense of self. What emerges is an urgent case for abolishing solitary confinement -- and evidence for how our tax dollars, public safety and values are implicated in it. \"Prisons are administered in our name and on our behalf,\" she says. \"We have an obligation to bear witness.\"<img src=\"http://feeds.feedburner.com/~r/iTunesPodcastTTNewsPolitics/~4/LU1UkZhgXdY\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "87335005",
            "sourceUrl": "https://download.ted.com/talks/LauraRovner_2018X-480p.mp4?apikey=172BB350-0010",
            "categories": [
                "Higher Education"
            ]
        },
        {
            "title": "Our immigration conversation is broken -- here's how to have a better one | Paul A. Kramer",
            "datePublished": "Wed, 06 Nov 2019 15:58:30 +0000",
            "description": "How did the US immigration debate get to be so divisive? In this informative talk, historian and writer Paul A. Kramer shows how an \"insider vs. outsider\" framing has come to dominate the way people in the US talk about immigration -- and suggests a set of new questions that could reshape the conversation around whose life, rights and thriving matters.<img src=\"http://feeds.feedburner.com/~r/iTunesPodcastTTNewsPolitics/~4/VsKy6RrO61A\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "118515829",
            "sourceUrl": "https://download.ted.com/talks/PaulAKramer_2019S-480p.mp4?apikey=172BB350-0010",
            "categories": [
                "Higher Education"
            ]
        },
        {
            "title": "Hope and justice for women who've survived ISIS | Rabiaa El Garani",
            "datePublished": "Mon, 11 Nov 2019 16:01:29 +0000",
            "description": "Human rights protector Rabiaa El Garani shares the challenging, heartbreaking story of sexual violence committed against Yazidi women and girls in Iraq by ISIS -- and her work seeking justice for the survivors. \"These victims have been through unimaginable pain. But with a little help, they show how resilient they are,\" she says. \"It is an honor to bear witness; it is a privilege to seek justice.\" (This talk contains mature content.)<img src=\"http://feeds.feedburner.com/~r/iTunesPodcastTTNewsPolitics/~4/tBTc9aNTOAM\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "107985574",
            "sourceUrl": "https://download.ted.com/talks/RabiaaElGarani_2018P-480p.mp4?apikey=172BB350-0010",
            "categories": [
                "Higher Education"
            ]
        },
        {
            "title": "What's really happening at the US-Mexico border -- and how we can do better | Erika Pinheiro",
            "datePublished": "Thu, 14 Nov 2019 15:57:22 +0000",
            "description": "At the US-Mexico border, policies of prolonged detention and family separation have made seeking asylum in the United States difficult and dangerous. In this raw and heartfelt talk, immigration attorney Erika Pinheiro offers a glimpse into her daily work on both sides of the border and shares some of the stories behind the statistics -- including her own story of being detained and separated from her son. It's a clear-eyed call to remember the humanity that's impacted by policy -- and a warning: \"History shows us that the first population to be vilified and stripped of their rights is rarely the last,\" she says.<img src=\"http://feeds.feedburner.com/~r/iTunesPodcastTTNewsPolitics/~4/x-aFR3BpkBE\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "100817535",
            "sourceUrl": "https://download.ted.com/talks/ErikaPinheiro_2019S-480p.mp4?apikey=172BB350-0010",
            "categories": [
                "Higher Education"
            ]
        },
        {
            "title": "5 steps for clean air in India | Arunabha Ghosh",
            "datePublished": "Mon, 18 Nov 2019 20:58:28 +0000",
            "description": "India's big cities have some of the worst air quality in the world. How can we fix this public health crisis? In an actionable talk, social entrepreneur Arunabha Ghosh lays out a five-step plan to put India on the path to cleaner, safer air -- and shows how every citizen can play an active role in getting there.<img src=\"http://feeds.feedburner.com/~r/iTunesPodcastTTNewsPolitics/~4/tNKo-XGM2PU\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "64711367",
            "sourceUrl": "https://download.ted.com/talks/ArunabhaGhosh_2019I-480p.mp4?apikey=172BB350-0010",
            "categories": [
                "Higher Education"
            ]
        },
        {
            "title": "A creative solution for the water crisis in Flint, Michigan | LaToya Ruby Frazier",
            "datePublished": "Wed, 20 Nov 2019 15:57:52 +0000",
            "description": "Artist LaToya Ruby Frazier spent five months living in Flint, Michigan, documenting the lives of those affected by the city's water crisis for her photo essay \"Flint is Family.\" As the crisis dragged on, she realized it was going to take more than a series of photos to bring relief. In this inspiring, surprising talk, she shares the creative lengths she went to in order to bring free, clean water to the people of Flint.<img src=\"http://feeds.feedburner.com/~r/iTunesPodcastTTNewsPolitics/~4/43w6RCV6Iwk\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "85200826",
            "sourceUrl": "https://download.ted.com/talks/LaToyaRubyFrazier_2019S-480p.mp4?apikey=172BB350-0010",
            "categories": [
                "Higher Education"
            ]
        },
        {
            "title": "The problem of light pollution -- and 5 ridiculously easy ways to fix it | Kelsey Johnson",
            "datePublished": "Wed, 04 Dec 2019 16:18:48 +0000",
            "description": "Ever gaze up at the starry night sky? This stunning view is at risk of disappearing -- unless we act now, says astrophysicist Kelsey Johnson. In this fascinating, unexpectedly funny talk, she explains how light pollution affects almost every species on earth (including us) and shares five \"stupidly simple\" things you can do to help solve the problem.<img src=\"http://feeds.feedburner.com/~r/iTunesPodcastTTNewsPolitics/~4/ldizwEcpVVU\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "96724227",
            "sourceUrl": "https://download.ted.com/talks/KelseyJohnson_2019S-480p.mp4?apikey=172BB350-0010",
            "categories": [
                "Higher Education"
            ]
        },
        {
            "title": "To help solve global problems, look to developing countries | Bright Simons",
            "datePublished": "Thu, 12 Dec 2019 20:51:19 +0000",
            "description": "To address the problem of counterfeit goods, African entrepreneurs like Bright Simons have come up with innovative and effective ways to confirm products are genuine. Now he asks: Why aren't these solutions everywhere? From password-protected medicines to digitally certified crops, Simons demonstrates the power of local ideas -- and calls on the rest of the world to listen up.<img src=\"http://feeds.feedburner.com/~r/iTunesPodcastTTNewsPolitics/~4/ALfBmpPG_IQ\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "70669990",
            "sourceUrl": "https://download.ted.com/talks/BrightSimons_2019S-480p.mp4?apikey=172BB350-0010",
            "categories": [
                "Higher Education"
            ]
        },
        {
            "title": "Why lakes and rivers should have the same rights as humans | Kelsey Leonard",
            "datePublished": "Fri, 13 Dec 2019 15:58:24 +0000",
            "description": "Water is essential to life. Yet in the eyes of the law, it remains largely unprotected -- leaving many communities without access to safe drinking water, says legal scholar Kelsey Leonard. In this powerful talk, she shows why granting lakes and rivers legal \"personhood\" -- giving them the same legal rights as humans -- is the first step to protecting our bodies of water and fundamentally transforming how we value this vital resource.<img src=\"http://feeds.feedburner.com/~r/iTunesPodcastTTNewsPolitics/~4/O4wkI4Jv32o\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "96020240",
            "sourceUrl": "https://download.ted.com/talks/KelseyLeonard_2019W-480p.mp4?apikey=172BB350-0010",
            "categories": [
                "Higher Education"
            ]
        },
        {
            "title": "How civilization could destroy itself -- and 4 ways we could prevent it | Nick Bostrom",
            "datePublished": "Thu, 19 Dec 2019 15:58:22 +0000",
            "description": "Humanity is on its way to creating a \"black ball\": a technological breakthrough that could destroy us all, says philosopher Nick Bostrom. In this incisive, surprisingly light-hearted conversation with Head of TED Chris Anderson, Bostrom outlines the vulnerabilities we could face if (or when) our inventions spiral beyond our control -- and explores how we can prevent our future demise.<img src=\"http://feeds.feedburner.com/~r/iTunesPodcastTTNewsPolitics/~4/5drJ-nC1KAE\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "151528749",
            "sourceUrl": "https://download.ted.com/talks/NickBostrom_2019-480p.mp4?apikey=172BB350-0010",
            "categories": [
                "Higher Education"
            ]
        },
        {
            "title": "How supply chain transparency can help the planet | Markus Mutz",
            "datePublished": "Wed, 15 Jan 2020 15:55:57 +0000",
            "description": "Given the option, few would choose to buy products that harm the earth -- yet it's nearly impossible to know how most consumer goods are made or where they're sourced from. That's about to change, says supply chain innovator Markus Mutz. He shares how he used blockchain technology to track Patagonian toothfish on their journey from ocean to dinner plate -- and proved it's possible to offer consumers a product they can trust.<img src=\"http://feeds.feedburner.com/~r/iTunesPodcastTTNewsPolitics/~4/6JLGSmT48n4\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "97281707",
            "sourceUrl": "https://download.ted.com/talks/MarkusMutz_2019S-480p.mp4?apikey=172BB350-0010",
            "categories": [
                "Higher Education"
            ]
        },
        {
            "title": "A path to security for the world's deadliest countries | Rachel Kleinfeld",
            "datePublished": "Thu, 16 Jan 2020 20:49:33 +0000",
            "description": "You are more likely to die violently if you live in a middle-income democracy with high levels of inequality and political polarization than if you live in a country at war, says democracy advisor Rachel Kleinfeld. This historical shift in the nature of violence presents an opportunity for everyday voters to act as a great force for change in their unbalanced societies. In this eye-opening talk, Kleinfeld unravels the causes of violence and offers a path to security for the world's deadliest countries.<img src=\"http://feeds.feedburner.com/~r/iTunesPodcastTTNewsPolitics/~4/Q6dxGU5mWho\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "112797254",
            "sourceUrl": "https://download.ted.com/talks/RachelKleinfeld_2019T-480p.mp4?apikey=172BB350-0010",
            "categories": [
                "Higher Education"
            ]
        },
        {
            "title": "The unpaid work that GDP ignores -- and why it really counts | Marilyn Waring",
            "datePublished": "Thu, 23 Jan 2020 21:01:15 +0000",
            "description": "If you: do laundry, are (or have been) pregnant, tidy up, shop for your household or do similar labor, then by GDP standards, you're unproductive. In this visionary talk, economist Marilyn Waring seeks to correct the failures of this narrow-minded system, detailing why we deserve a better way to measure growth that values not just our own livelihood but the planet's as well.<img src=\"http://feeds.feedburner.com/~r/iTunesPodcastTTNewsPolitics/~4/L6L7I4KH5lY\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "124627364",
            "sourceUrl": "https://download.ted.com/talks/MarilynWaring_2019X-480p.mp4?apikey=172BB350-0010",
            "categories": [
                "Higher Education"
            ]
        },
        {
            "title": "Dictators hate political cartoons -- so I keep drawing them | Rayma Suprani",
            "datePublished": "Fri, 31 Jan 2020 16:15:37 +0000",
            "description": "\"A political cartoon is a barometer of freedom,\" says Rayma Suprani, who was exiled from her native Venezuela for publishing work critical of the government. \"That's why dictators hate cartoonists.\" In a talk illustrated with highlights from a career spent railing against totalitarianism, Suprani explores how cartoons hold a mirror to society and reveal hidden truths -- and discusses why she keeps drawing even when it comes at a high personal cost. (In Spanish with consecutive English translation)<img src=\"http://feeds.feedburner.com/~r/iTunesPodcastTTNewsPolitics/~4/QZn5e6P_mdo\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "120138820",
            "sourceUrl": "https://download.ted.com/talks/RaymaSuprani_2019W-480p.mp4?apikey=172BB350-0010",
            "categories": [
                "Higher Education"
            ]
        },
        {
            "title": "What if the poor were part of city planning? | Smruti Jukur Johari",
            "datePublished": "Thu, 06 Feb 2020 15:51:10 +0000",
            "description": "Almost a billion people worldwide live in informal communities and slums, often without basic infrastructure like clean water, toilets or adequate roads. Urban planner Smruti Jukur Johari breaks down myths about these communities and shares examples of simple, common-sense solutions that arise when governments and architects work together with the residents -- instead of around them.<img src=\"http://feeds.feedburner.com/~r/iTunesPodcastTTNewsPolitics/~4/ngb-Ux1BxVo\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "96833486",
            "sourceUrl": "https://download.ted.com/talks/SmrutiJukurJohari_2019W-480p.mp4?apikey=172BB350-0010",
            "categories": [
                "Higher Education"
            ]
        },
        {
            "title": "What if a single human right could change the world? | Kristen Wenz",
            "datePublished": "Mon, 24 Feb 2020 15:59:53 +0000",
            "description": "More than a billion people worldwide, mostly children, do not have a legal identity. In many countries, this means they can't get access to vital services like health care and education, says legal identity expert Kristen Wenz. She discusses why this problem is one of the greatest human rights violations of our time -- and shares five strategies to ensure everyone can get registered and protected.<img src=\"http://feeds.feedburner.com/~r/iTunesPodcastTTNewsPolitics/~4/cQcaA19QaUI\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "59547028",
            "sourceUrl": "https://download.ted.com/talks/KristenWenz_2019S-480p.mp4?apikey=172BB350-0010",
            "categories": [
                "Higher Education"
            ]
        },
        {
            "title": "When local news dies, so does democracy | Chuck Plunkett",
            "datePublished": "Tue, 03 Mar 2020 16:18:10 +0000",
            "description": "Nearly 1,800 newsrooms have shuttered across the US since 2004, leaving many communities unseen, unheard and in the dark. In this passionate talk and rallying cry, journalist Chuck Plunkett explains why he rebelled against his employer to raise awareness for an industry under threat of extinction -- and makes the case for local news as an essential part of any healthy democracy.<img src=\"http://feeds.feedburner.com/~r/iTunesPodcastTTNewsPolitics/~4/3ENsDiZ-TaE\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "80518877",
            "sourceUrl": "https://download.ted.com/talks/ChuckPlunkett_2019X-480p.mp4?apikey=172BB350-0010",
            "categories": [
                "Higher Education"
            ]
        },
        {
            "title": "What we do (and don't) know about the coronavirus | David Heymann",
            "datePublished": "Tue, 03 Mar 2020 20:48:02 +0000",
            "description": "What happens if you get infected with the coronavirus? Who's most at risk? How can you protect yourself? Public health expert David Heymann, who led the global response to the SARS outbreak in 2003, shares the latest findings about COVID-19 and what the future may hold. (Recorded February 27, 2020)<img src=\"http://feeds.feedburner.com/~r/iTunesPodcastTTNewsPolitics/~4/gSeg3FKH54I\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "56777478",
            "sourceUrl": "https://download.ted.com/talks/DavidHeymann_2020S-480p.mp4?apikey=172BB350-0010",
            "categories": [
                "Higher Education"
            ]
        },
        {
            "title": "How repaying loans with social service transforms communities | Angie Murimirwa",
            "datePublished": "Thu, 19 Mar 2020 14:48:40 +0000",
            "description": "What if you could repay loans through volunteering and mentorship instead of money? Activist Angie Murimirwa shares how a game-changing economic tool known as \"social interest\" is reinvigorating sub-Saharan communities once trapped in cycles of poverty. Join her as she explains how this approach to lending is creating opportunities for thousands of African women and girls -- and shows why this model can be replicated anywhere with lasting effects.<img src=\"http://feeds.feedburner.com/~r/iTunesPodcastTTNewsPolitics/~4/SD1rfT3wrOM\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "79641345",
            "sourceUrl": "https://download.ted.com/talks/AngieMurimirwa_2019W-480p.mp4?apikey=172BB350-0010",
            "categories": [
                "Higher Education"
            ]
        },
        {
            "title": "How we must respond to the coronavirus pandemic | Bill Gates",
            "datePublished": "Wed, 25 Mar 2020 15:17:52 +0000",
            "description": "Philanthropist and Microsoft cofounder Bill Gates offers insights into the COVID-19 pandemic, discussing why testing and self-isolation are essential, which medical advancements show promise and what it will take for the world to endure this crisis. (This virtual conversation is part of the TED Connects series, hosted by head of TED Chris Anderson and current affairs curator Whitney Pennington Rodgers. Recorded March 24, 2020)<img src=\"http://feeds.feedburner.com/~r/iTunesPodcastTTNewsPolitics/~4/Xk8Epk09MKU\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "361125703",
            "sourceUrl": "https://download.ted.com/talks/BillGates_2020S-480p.mp4?apikey=172BB350-0010",
            "categories": [
                "Higher Education"
            ]
        },
        {
            "title": "What the world can learn from China's response to the coronavirus | Gary Liu",
            "datePublished": "Fri, 27 Mar 2020 16:55:50 +0000",
            "description": "From Hong Kong, South China Morning Post CEO Gary Liu tracks China's response to the coronavirus pandemic -- from the initial outbreak in Wuhan to the shutdown of Hubei province and the containment measures taken across its major cities. Sharing insights into how the culture in places like Hong Kong and South Korea contributed to fast action against the virus, Liu identifies lessons people across the world can use to stop its spread. (This virtual conversation is part of the TED Connects series, hosted by head of TED Chris Anderson and current affairs curator Whitney Pennington Rodgers. Recorded March 25, 2020)<img src=\"http://feeds.feedburner.com/~r/iTunesPodcastTTNewsPolitics/~4/kSyMGvJTx7I\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "407445105",
            "sourceUrl": "https://download.ted.com/talks/GaryLiu_2020S-480p.mp4?apikey=172BB350-0010",
            "categories": [
                "Higher Education"
            ]
        },
        {
            "title": "How forgiveness can create a more just legal system | Martha Minow",
            "datePublished": "Mon, 30 Mar 2020 19:57:59 +0000",
            "description": "Pardons, commutations and bankruptcy laws are all tools of forgiveness within the US legal system. Are we using them frequently enough, and with fairness? Law professor Martha Minow outlines how these merciful measures can reinforce racial and economic inequality -- and makes the case for creating a system of restorative justice that focuses on accountability and reconciliation rather than punishment.<img src=\"http://feeds.feedburner.com/~r/iTunesPodcastTTNewsPolitics/~4/0nbRfF2C3GI\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "106973153",
            "sourceUrl": "https://download.ted.com/talks/MarthaMinow_2019W-480p.mp4?apikey=172BB350-0010",
            "categories": [
                "Higher Education"
            ]
        },
        {
            "title": "How to spark your curiosity, scientifically | Nadya Mason",
            "datePublished": "Wed, 15 Apr 2020 14:47:27 +0000",
            "description": "Curious how stuff works? Do a hands-on experiment at home, says physicist Nadya Mason. She shows how you can demystify the world around you by tapping into your scientific curiosity -- and performs a few onstage experiments of her own using magnets, dollar bills, dry ice and more.<img src=\"http://feeds.feedburner.com/~r/iTunesPodcastTTNewsPolitics/~4/0sCdYVRRt0U\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "81243360",
            "sourceUrl": "https://download.ted.com/talks/NadyaMason_2019S-480p.mp4?apikey=172BB350-0010",
            "categories": [
                "Higher Education"
            ]
        },
        {
            "title": "How the coronavirus pandemic is changing the world | Fareed Zakaria",
            "datePublished": "Fri, 10 Apr 2020 16:57:35 +0000",
            "description": "The coronavirus pandemic is more global, dramatic and unusual than any crisis we've seen in a long time, says journalist Fareed Zakaria. Listen as he shares his perspective on how we can recover from the economic fallout, why certain countries were able to avoid major outbreaks and what this might mean for the balance of global power. (This virtual conversation is part of the TED Connects series, hosted by head of TED Chris Anderson and current affairs curator Whitney Pennington Rodgers. Recorded April 9, 2020)<img src=\"http://feeds.feedburner.com/~r/iTunesPodcastTTNewsPolitics/~4/kORFjxEMBYc\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "230075909",
            "sourceUrl": "https://download.ted.com/talks/FareedZakaria_2020S-480p.mp4?apikey=172BB350-0010",
            "categories": [
                "Higher Education"
            ]
        },
        {
            "title": "How the coronavirus is impacting India -- and what needs to happen next | Gayathri Vasudevan",
            "datePublished": "Fri, 10 Apr 2020 14:49:11 +0000",
            "description": "The coronavirus pandemic put India's population of 1.3 billion into an extreme and sudden lockdown. Social entrepreneur Gayathri Vasudevan explains how the situation is impacting the country's migrant workers, who are stuck far from home with limited access to food and shelter, and calls for an overhaul of India's social infrastructure in order to get people the essentials they need right now. (This virtual conversation is part of the TED Connects series, hosted by current affairs curator Whitney Pennington Rodgers. Recorded April 9, 2020)<img src=\"http://feeds.feedburner.com/~r/iTunesPodcastTTNewsPolitics/~4/5WeNadxqc3Y\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "144427342",
            "sourceUrl": "https://download.ted.com/talks/GayathriVasudevan_2020S-480p.mp4?apikey=172BB350-0010",
            "categories": [
                "Higher Education"
            ]
        },
        {
            "title": "The intangible effects of walls | Alexandra Auer",
            "datePublished": "Fri, 03 Apr 2020 20:18:10 +0000",
            "description": "More barriers exist now than at the end of World War II, says designer Alexandra Auer. And when you erect one wall, you unwittingly create a second -- an \"us\" versus \"them\" partition in the mind that compromises our collective safety. With intriguing results from her social design project focused on two elementary schools separated by a fence, Auer encourages us to dismantle our biases and regain perspective on all the things we have in common.<img src=\"http://feeds.feedburner.com/~r/iTunesPodcastTTNewsPolitics/~4/gHy0rySpRKE\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "85583946",
            "sourceUrl": "https://download.ted.com/talks/AlexandraAuer_2019X-480p.mp4?apikey=172BB350-0010",
            "categories": [
                "Higher Education"
            ]
        },
        {
            "title": "What's missing from the American immigrant narrative | Elizabeth Camarillo Gutierrez",
            "datePublished": "Tue, 21 Apr 2020 14:55:25 +0000",
            "description": "Recounting her story of finding opportunity and stability in the US, Elizabeth Camarillo Gutierrez examines the flaws in narratives that simplify and idealize the immigrant experience -- and shares hard-earned wisdom on the best way to help those around us. \"Our world is one that flourishes when different voices come together,\" she says.<img src=\"http://feeds.feedburner.com/~r/iTunesPodcastTTNewsPolitics/~4/kuCGnTB0coM\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "78441255",
            "sourceUrl": "https://download.ted.com/talks/ElizabethCamarilloGutierrez_2020S-480p.mp4?apikey=172BB350-0010",
            "categories": [
                "Higher Education"
            ]
        },
        {
            "title": "How to shift your mindset and choose your future | Tom Rivett-Carnac",
            "datePublished": "Wed, 22 Apr 2020 19:54:31 +0000",
            "description": "When it comes to big life problems, we often stand at a crossroads: either believe we're powerless against great change, or we rise to meet the challenge. In an urgent call to action, political strategist Tom Rivett-Carnac makes the case for adopting a mindset of \"stubborn optimism\" to confront climate change -- or whatever crisis may come our way -- and sustain the action needed to build a regenerative future. As he puts it: \"Stubborn optimism can fill our lives with meaning and purpose.\"<img src=\"http://feeds.feedburner.com/~r/iTunesPodcastTTNewsPolitics/~4/ZfNsKzcKh3c\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "111923437",
            "sourceUrl": "https://download.ted.com/talks/TomRivettCarnac_2020S-480p.mp4?apikey=172BB350-0010",
            "categories": [
                "Higher Education"
            ]
        },
        {
            "title": "A global pandemic calls for global solutions | Larry Brilliant",
            "datePublished": "Fri, 24 Apr 2020 15:14:12 +0000",
            "description": "Examining the facts and figures of the coronavirus outbreak, epidemiologist Larry Brilliant evaluates the global response in a candid interview with head of TED Chris Anderson. Brilliant lays out a clear plan to end the pandemic -- and shows why, to achieve it, we'll have to work together across political and geographical divides. \"This is not the zombie apocalypse; this is not a mass extinction event,\" he says. \"We need to be the best version of ourselves.\" (Recorded April 22, 2020)<img src=\"http://feeds.feedburner.com/~r/iTunesPodcastTTNewsPolitics/~4/RLr1fe5DeuU\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "109787318",
            "sourceUrl": "https://download.ted.com/talks/LarryBrilliant_2020S-480p.mp4?apikey=172BB350-0010",
            "categories": [
                "Higher Education"
            ]
        },
        {
            "title": "A new way to \"grow\" islands and coastlines | Skylar Tibbits",
            "datePublished": "Mon, 04 May 2020 15:06:46 +0000",
            "description": "What if we could harness the ocean's movement to protect coastal communities from rising sea levels? Designer and TED Fellow Skylar Tibbits shows how his lab is creating a dynamic, adaptable system of underwater structures that uses energy from ocean waves to accumulate sand and restore eroding shorelines -- working with the forces of nature to build rather than destroy.<img src=\"http://feeds.feedburner.com/~r/iTunesPodcastTTNewsPolitics/~4/9m5Ji-5sRCs\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "53895357",
            "sourceUrl": "https://download.ted.com/talks/SkylarTibbits_2019U-480p.mp4?apikey=172BB350-0010",
            "categories": [
                "Higher Education"
            ]
        },
        {
            "title": "What you need to know about face surveillance | Kade Crockford",
            "datePublished": "Thu, 07 May 2020 15:54:08 +0000",
            "description": "Privacy isn't dead, but face surveillance technology might kill it, says civil rights advocate Kade Crockford. In an eye-opening talk, Kade outlines the startling reasons why this invasive technology -- powered by often-flawed facial recognition databases that track people without their knowledge -- poses unprecedented threats to your fundamental rights. Learn what can be done to ban government use before it's too late.<img src=\"http://feeds.feedburner.com/~r/iTunesPodcastTTNewsPolitics/~4/9BuUvqEy4bc\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "92098825",
            "sourceUrl": "https://download.ted.com/talks/KadeCrockford_2019X-480p.mp4?apikey=172BB350-0010",
            "categories": [
                "Higher Education"
            ]
        },
        {
            "title": "How American and Chinese values shaped the coronavirus response | Huang Hung",
            "datePublished": "Fri, 08 May 2020 14:56:02 +0000",
            "description": "To combat COVID-19, countries have enforced city-wide shutdowns, stay-at-home orders and mask mandates -- but the reaction (and adherence) to these rules has differed markedly in the East and West. In conversation with TED's head of curation Helen Walters, writer and publisher Huang Hung sheds light on how Chinese and American cultural values shaped their responses to the outbreak -- and provides perspective on why everyone needs to come together to end the pandemic. (Recorded April 16, 2020)<img src=\"http://feeds.feedburner.com/~r/iTunesPodcastTTNewsPolitics/~4/A3RfvS7SEbM\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "82572680",
            "sourceUrl": "https://download.ted.com/talks/HuangHung_2020S-480p.mp4?apikey=172BB350-0010",
            "categories": [
                "Higher Education"
            ]
        },
        {
            "title": "A virus detection network to stop the next pandemic | Pardis Sabeti and Christian Happi",
            "datePublished": "Mon, 11 May 2020 15:04:26 +0000",
            "description": "How can we stop the next pandemic before it starts? Disease researchers Pardis Sabeti and Christian Happi introduce Sentinel, an early warning system that detects and tracks viral threats in real time -- and could help stop them before they spread. Learn more about the cutting-edge technology that powers the system and how the Sentinel team is helping scientists and health workers during the coronavirus pandemic. (This ambitious plan is part of the Audacious Project, TED's initiative to inspire and fund global change.)<img src=\"http://feeds.feedburner.com/~r/iTunesPodcastTTNewsPolitics/~4/c2LHNcuhGi0\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "42326964",
            "sourceUrl": "https://download.ted.com/talks/ChristianHappiandPardisSabeti_2020S-480p.mp4?apikey=172BB350-0010",
            "categories": [
                "Higher Education"
            ]
        },
        {
            "title": "The US is addicted to incarceration. Here's how to break the cycle | Robin Steinberg and Manoush Zomorodi",
            "datePublished": "Tue, 12 May 2020 14:54:27 +0000",
            "description": "Nearly half a million people in the US are in jail right now without being convicted of a crime, simply because they can't come up with the money to pay cash bail. To try and fix this system, public defender and activist Robin Steinberg asked a straightforward question: What if we paid bail for them? In conversation with TED Radio Hour host Manoush Zomorodi, Steinberg shares how her nonprofit The Bail Project -- which uses a revolving fund to post bail for those who can't afford it -- is scaling up their efforts across the country and rolling out a new community-based model to fight mass incarceration. (This ambitious plan is part of the Audacious Project, TED's initiative to inspire and fund global change.)<img src=\"http://feeds.feedburner.com/~r/iTunesPodcastTTNewsPolitics/~4/dUIc0FEGgIE\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "126378200",
            "sourceUrl": "https://download.ted.com/talks/RobinSteinberg_2019W-480p.mp4?apikey=172BB350-0010",
            "categories": [
                "Higher Education"
            ]
        },
        {
            "title": "Restoring human dignity at the US southern border | Norma Pimentel",
            "datePublished": "Thu, 14 May 2020 14:55:54 +0000",
            "description": "After seeing the conditions in which children were held at a detention center on the US-Mexico border, Sister Norma Pimentel established a humanitarian respite center in Texas where people can get clean clothing, a warm shower and a hot meal. In this powerful talk, Sister Pimentel discusses her lifelong work restoring human dignity at the border -- and calls on us all to put aside prejudice and lead with compassion.<img src=\"http://feeds.feedburner.com/~r/iTunesPodcastTTNewsPolitics/~4/kDiLk4BfF4I\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "89658584",
            "sourceUrl": "https://download.ted.com/talks/NormaPimentel_2019W-480p.mp4?apikey=172BB350-0010",
            "categories": [
                "Higher Education"
            ]
        },
        {
            "title": "How to rebuild the global economy | Kristalina Georgieva",
            "datePublished": "Tue, 19 May 2020 19:57:17 +0000",
            "description": "The coronavirus pandemic shattered the global economy. To put the pieces back together, we need to make sure money is going to the countries that need it the most -- and that we rebuild financial systems that are resilient to shocks, says Kristalina Georgieva, managing director of the International Monetary Fund. She takes us inside the massive economic stimulus efforts leading the world toward recovery and renewal and discusses what it will take for countries to emerge from this \"great transformation\" even stronger than before. (This virtual conversation, hosted by head of TED Chris Anderson and current affairs curator Whitney Pennington Rodgers, was recorded on May 18, 2020.)<img src=\"http://feeds.feedburner.com/~r/iTunesPodcastTTNewsPolitics/~4/MSs-GqDHdK8\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "300778558",
            "sourceUrl": "https://download.ted.com/talks/KristalinaGeorgieva_2020-480p.mp4?apikey=172BB350-0010",
            "categories": [
                "Higher Education"
            ]
        },
        {
            "title": "The link between climate change, health and poverty | Cheryl Holder",
            "datePublished": "Wed, 03 Jun 2020 14:51:31 +0000",
            "description": "For the poor and vulnerable, the health impacts of climate change are already here, says physician Cheryl Holder. Unseasonably hot temperatures, disease-carrying mosquitoes and climate gentrification threaten those with existing health conditions, while wealthier people move to higher ground. In an impassioned talk, Holder proposes impactful ways clinicians can protect their patients from climate-related health challenges -- and calls on doctors, politicians and others to build a care system that incorporates economic and social justice.<img src=\"http://feeds.feedburner.com/~r/iTunesPodcastTTNewsPolitics/~4/QLuRokjcBLg\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "87966310",
            "sourceUrl": "https://download.ted.com/talks/CherylHolder_2020P-480p.mp4?apikey=172BB350-0010",
            "categories": [
                "Higher Education"
            ]
        },
        {
            "title": "The US needs a radical revolution of values | Dr. Bernice King",
            "datePublished": "Mon, 08 Jun 2020 21:55:35 +0000",
            "description": "To cultivate a society grounded in equity and love, we must uproot systems of oppression and violence towards Black communities, says Dr. Bernice Albertine King, community builder and daughter of Dr. Martin Luther King Jr. In a time of mourning and protest, King calls for a revolution of values, allies that engage and a world where anger is channeled into social and economic change. \"Freedom is never really won. You earn it and win it in every generation,\" King says. \"Every generation is called to this freedom struggle.\" (This video, excerpted from a panel featuring Dr. Phillip Atiba Goff, Rashad Robinson and Anthony D. Romero, was recorded June 3, 2020. Watch the full discussion at go.ted.com/endingracism)<img src=\"http://feeds.feedburner.com/~r/iTunesPodcastTTNewsPolitics/~4/XONGk9jhHP0\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "52383076",
            "sourceUrl": "https://download.ted.com/talks/BerniceKing_2020-480p.mp4?apikey=172BB350-0010",
            "categories": [
                "Higher Education"
            ]
        },
        {
            "title": "The ACLU's call to defund the police | Anthony D. Romero",
            "datePublished": "Mon, 08 Jun 2020 22:02:48 +0000",
            "description": "\"We need to defund the budgets of police departments. It's the only way we're going to take power back,\" says Anthony D. Romero, executive director of the American Civil Liberties Union (ACLU). Calling for allies to get involved in the efforts to dismantle systemic racism, Romero explains why police reform isn't enough anymore -- and shows why it's time to take money from militarized law enforcement and reinvest it in the community. (This video, excerpted from a panel discussion featuring Dr. Phillip Atiba Goff, Rashad Robinson and Dr. Bernice King, was recorded June 3, 2020. Watch the full discussion at go.ted.com/endingracism)<img src=\"http://feeds.feedburner.com/~r/iTunesPodcastTTNewsPolitics/~4/WSU1akdx2bg\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "61735738",
            "sourceUrl": "https://download.ted.com/talks/AnthonyDRomero_2020-480p.mp4?apikey=172BB350-0010",
            "categories": [
                "Higher Education"
            ]
        },
        {
            "title": "The alliances needed to rebuild the developing world | Achim Steiner",
            "datePublished": "Wed, 17 Jun 2020 14:54:16 +0000",
            "description": "Developing countries need strong alliances between the public and private sectors to rebuild after COVID-19, says Achim Steiner, administrator for the United Nations Development Programme (UNDP). From building virus tracking systems to supporting clean energy projects and expanding health care, hear how the UNDP is creating partnerships between states and the financial, communications, technology and insurance sectors to rebuild stronger, greener economies post-pandemic. (This virtual conversation, hosted by political commentator Sally Kohn and TED global curator Bruno Giussani, was recorded June 8, 2020.)<img src=\"http://feeds.feedburner.com/~r/iTunesPodcastTTNewsPolitics/~4/RkmT3UJDdiU\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "320017612",
            "sourceUrl": "https://download.ted.com/talks/AchimSteiner_2020-480p.mp4?apikey=172BB350-0010",
            "categories": [
                "Higher Education"
            ]
        }
    ]
}