{
    "artwork": "http://is5.mzstatic.com/image/thumb/Music/v4/2c/42/dd/2c42dd14-788a-ceee-6a12-6e2fd6fc1ea3/source/100x100bb.jpg",
    "description": "Listen to lectures by—and discussions with—the University of Chicago Law School's eminent faculty, as well as some very special guests.",
    "feedURL": "http://feeds.feedburner.com/UChicagoLawFacultyPodcast",
    "podcastURL": "http://www.law.uchicago.edu",
    "publisher": "UChicagoLaw",
    "title": "The University of Chicago Law School Faculty Podcast",
    "episodes": [
        {
            "title": "Supreme Court Preview 2020: Highlights and Perspectives",
            "datePublished": "Fri, 18 Sep 2020 18:09:27 +0000",
            "description": "On the first Monday in October, the Supreme Court session opens. Each fall, the University of Chicago Law School invites faculty members to offer insight into some of the issues the Court will hear in the upcoming year.\r\n\r\nThis event was recorded on September 15, 2020, and features Aziz Huq, Frank and Bernice J. Greenberg Professor of Law, and Jennifer Nou, Professor of Law.<img src=\"http://feeds.feedburner.com/~r/UChicagoLawFacultyPodcast/~4/MsHs1VpC2xI\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "46079374",
            "sourceUrl": "http://feedproxy.google.com/~r/UChicagoLawFacultyPodcast/~5/Ss_rrYu9vPM/895563709-uchicagolaw-supreme-court-preview-2020-highlights-and-perspectives.mp3"
        },
        {
            "title": "M. Todd Henderson, \"The Trust Revolution: How the Digitization of Trust Will Revolutionize...\"",
            "datePublished": "Wed, 05 Feb 2020 23:01:54 +0000",
            "description": "\"The Trust Revolution: How the Digitization of Trust Will Revolutionize Business & Government\"\r\n\r\nIn this CBI, Professor Henderson will examine how Internet platforms--eBay, Uber, AirBnB--relate to the Code of Hammurabi, Medieval guilds, the New York Stock Exchange, and corporate brands. All of these institutions, along with religions and governments and families, are in large part about providing trust to enable human cooperation. By undertaking a genealogy of trust, we can illuminate modern debates about the role and scope of government in regulating the daily lives of citizens.\r\n\r\nM. Todd Henderson is the Michael J. Marks Professor of Law. This Chicago's Best Ideas talk was presented on January 27, 2020.<img src=\"http://feeds.feedburner.com/~r/UChicagoLawFacultyPodcast/~4/H-998AhjjVM\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "31069332",
            "sourceUrl": "http://feedproxy.google.com/~r/UChicagoLawFacultyPodcast/~5/tcVnhylpiMY/755749123-uchicagolaw-m-todd-henderson-the-trust-revolution-how-the-digitization-of-trust-will-revolutionize.mp3"
        },
        {
            "title": "Seyla Benhabib, \"The End of the 1951 Refugee Convention?\"",
            "datePublished": "Mon, 27 Jan 2020 18:59:55 +0000",
            "description": "The 1951 Refugee Convention and its 1967 Protocol are among the most important human rights documents of the post-WW II period. Yet the universalization of the refugee status after the 1967 Protocol has given rise to a series of discrepancies between the letter of the Convention and the purposes it is being asked to serve. In particular, the five-protected categories specified by the Convention have come under criticism. There are also tensions between the Eurocentric discourse and jurisprudence of refugee protection and the fact that the largest numbers of the world’s refugees are housed in Third World Countries.\r\n\r\nWith globalization of the refugee condition, new trends have also emerged: States seek to create measures of “non-entrée”—no access—to their territories by various modes of outsourcing monitoring and enforcement. These range from the installation of refugee processing centers in bordering countries and along the Mediterranean seacoast in particular, to the signing of special bilateral agreements to prevent refugees from accessing the states’ territory (as between the US and Mexico) and  to the more radical measure of simply “excising” territory, that is, declaring it outside the bounds of the jurisdiction of that state. These trends, along with criminalization of the refugee status, have undermined the universal human promise of the “right to have rights” (Hannah Arendt).\r\n\r\nIn conclusion I ask why cruelty is spreading in liberal democracies and discuss three normative responses to the current predicament: liberal nationalist, liberal internationalist and cosmopolitan interdependence. I suggest a fourth alternative which synthesizes elements of each.\r\n\r\nSeyla Benhabib is the Eugene Meyer Professor of Political Science and Professor of Philosophy at Yale University. This Dewey Lecture in Law and Philosophy was presented on January 15, 2020.<img src=\"http://feeds.feedburner.com/~r/UChicagoLawFacultyPodcast/~4/LoSXrWT7U50\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "32573149",
            "sourceUrl": "http://feedproxy.google.com/~r/UChicagoLawFacultyPodcast/~5/Za7SRblZ8BU/750511078-uchicagolaw-seyla-benhabib-the-end-of-the-1951-refugee-convention.mp3"
        },
        {
            "title": "Joan Biskupic, \"Chief Justice John Roberts: Defining the Supreme Court...\"",
            "datePublished": "Mon, 02 Dec 2019 21:59:05 +0000",
            "description": "\"Chief Justice John Roberts: Defining the Supreme Court as its Leader and at the Center\"\r\n\r\nJoan Biskupic is a full-time CNN legal analyst and author of a 2019 biography of Chief Justice John Roberts. Before joining CNN in 2017, Biskupic was an editor-in-charge for Legal Affairs at Reuters and, previously, the Supreme Court correspondent for the Washington Post and for USA Today.\r\n\r\nThis Ulysses and Marguerite Schwartz Memorial Lecture was presented on November 19, 2019.<img src=\"http://feeds.feedburner.com/~r/UChicagoLawFacultyPodcast/~4/Kv2H8NO7N7E\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "30156509",
            "sourceUrl": "http://feedproxy.google.com/~r/UChicagoLawFacultyPodcast/~5/3VWWux64TPk/721831363-uchicagolaw-joan-biskupic-chief-justice-john-roberts-defining-the-supreme-court.mp3"
        },
        {
            "title": "Saul Levmore, \"Addictive Law\"",
            "datePublished": "Fri, 15 Nov 2019 16:06:25 +0000",
            "description": "One of Chicago’s Best Ideas was the Coase Theorem, which reminds us daily that people can bargain around law or even before legal intervention is sought. But do we have too much law and too little bargaining around it? The number of cases and judges has grown dramatically over time and many problems are outsourced to the legal system, rather than being handled person-to-person. In this talk, I will consider conventional explanations for the astonishing growth of the legal system, and then suggest that it is not entirely good news. We have become addicted to law, and like most addictions, this one is difficult to undo and likely to grow.\r\n\r\nSaul Levmore is William B. Graham Distinguished Service Professor of Law. This Chicago's Best Ideas talk was presented on November 5, 2019.<img src=\"http://feeds.feedburner.com/~r/UChicagoLawFacultyPodcast/~4/cZhaBqillY0\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "32324672",
            "sourceUrl": "http://feedproxy.google.com/~r/UChicagoLawFacultyPodcast/~5/Ran3sEhJhZw/713289370-uchicagolaw-saul-levmore-addictive-law.mp3"
        },
        {
            "title": "William Baude and Anthony J. Casey, \"Supreme Court Preview 2019: Highlights and Perspectives\"",
            "datePublished": "Mon, 21 Oct 2019 19:52:37 +0000",
            "description": "On the first Monday in October, the Supreme Court session opens. Each fall, the University of Chicago Law School invites faculty members to offer insight into some of the issues the Court will hear in the upcoming year. This year we heard from William Baude, Professor of Law and Aaron Director Research Scholar, and Anthony J. Casey, Professor of Law.\r\n\r\nRecorded on October 15, 2019, at The Standard Club in Chicago.<img src=\"http://feeds.feedburner.com/~r/UChicagoLawFacultyPodcast/~4/6BfUktJOxUc\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "23560695",
            "sourceUrl": "http://feedproxy.google.com/~r/UChicagoLawFacultyPodcast/~5/8UwaDzcAc7I/699709357-uchicagolaw-william-baude-and-anthony-j-casey-supreme-court-preview-2019-highlights-and-perspectives.mp3"
        },
        {
            "title": "Law in the Era of #MeToo: A Conversation with Valerie Jarrett",
            "datePublished": "Mon, 17 Dec 2018 22:34:56 +0000",
            "description": "This keynote for the 2018 Legal Forum Symposium was recorded on November 2, 2018.\r\n\r\nValerie B. Jarrett is a Distinguished Senior Fellow at the Law School and former senior advisor to President Barack Obama. Emily Buss is the Mark and Barbara Fried Professor of Law at the Law School.<img src=\"http://feeds.feedburner.com/~r/UChicagoLawFacultyPodcast/~4/epLn8KH10Eg\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "30242191",
            "sourceUrl": "http://feedproxy.google.com/~r/UChicagoLawFacultyPodcast/~5/OCtIkwrxe_4/546446790-uchicagolaw-law-in-the-era-of-metoo-a-conversation-with-valerie-jarrett.mp3"
        },
        {
            "title": "Saul Levmore, \"If the Common Law was Efficient, Why Did It Decline?\"",
            "datePublished": "Tue, 23 Oct 2018 21:09:26 +0000",
            "description": "One of the University of Chicago Law School’s best known ideas or outputs over the last fifty years is that the common law (made by judges and often passed down and adapted over many years) is efficient. It was an idea advanced by Richard Posner, with respect to tort law, in his time as a professor here, but it is also reflected in his and other judicial opinions which students across the country meet in almost every non-constitutional course. What does this idea really mean, and is it plausible or even correct? If yes, why did the common law decline in influence? Statutes and regulations have far more impact on our present-day lives than does the common law. Judges are now known and evaluated for their constitutional decisions rather than for what they do in contracts and torts and other areas that are often described as common-law subjects. Could the common law solve our current concerns about climate change and autonomous vehicles?\r\n\r\nSaul Levmore is the William B. Graham Distinguished Service Professor of Law.\r\n\r\nThis Chicago's Best Ideas lecture was presented on October 15, 2018.<img src=\"http://feeds.feedburner.com/~r/UChicagoLawFacultyPodcast/~4/tInIsccwe4w\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "30456813",
            "sourceUrl": "http://feedproxy.google.com/~r/UChicagoLawFacultyPodcast/~5/o6x4uFwnD3o/518857206-uchicagolaw-saul-levmore-if-the-common-law-was-efficient-why-did-it-decline.mp3"
        },
        {
            "title": "Justin Driver, \"The Future of the Supreme Court: The Constitution of Public Schools\"",
            "datePublished": "Tue, 16 Oct 2018 19:50:35 +0000",
            "description": "Supreme Court decisions affecting the constitutional rights of students in the nation's public schools have consistently generated bitter controversy. From racial segregation to unauthorized immigration, from antiwar protests to compulsory flag salutes, from economic inequality to teacher-led prayer: these are among the defining cultural issues that the Court has addressed in elementary and secondary schools. Drawing from his provocative new book, The Schoolhouse Gate, Justin Driver discusses the historic legal battles waged over education that continue to threaten our basic constitutional order.\r\n\r\nThis talk was recorded on October 4, 2018, as part of the Law School's annual First Monday lecture series.<img src=\"http://feeds.feedburner.com/~r/UChicagoLawFacultyPodcast/~4/TzKlbXcKUbM\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "23082550",
            "sourceUrl": "http://feedproxy.google.com/~r/UChicagoLawFacultyPodcast/~5/7OTLMgFYf7o/515296914-uchicagolaw-justin-driver-the-future-of-the-supreme-court-the-constitution-of-public-schools.mp3"
        },
        {
            "title": "M. Todd Henderson, \"Lawyer CEOs\"",
            "datePublished": "Wed, 30 May 2018 21:01:03 +0000",
            "description": "Does legal education matter? In this lecture, Professor Todd Henderson presents some data on this question, using the behavior of corporate executives as an instrument. Looking at the 10% of large, public company CEOs who are lawyers, the talk tries to determine whether CEOs trained as lawyers act differently than CEOs trained in other ways. Do lawyer CEO firms get sued more or less or the same as other firms? Do they manage litigation differently? And, if they do, what is the impact on the bottom line? There is a burgeoning literature on how personal characteristics, from physical traits to birth order to education, impact CEO decision making. The lecture discusses this literature as well, and situates legal education in it.\r\n\r\nThis Loop Luncheon talk was presented on May 4, 2018.\r\n\r\nDownload the slides (PDF): https://www.law.uchicago.edu/files/2018-05/loop_luncheon_2018_slides.pdf<img src=\"http://feeds.feedburner.com/~r/UChicagoLawFacultyPodcast/~4/ajlu8ws0ohs\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "29481087",
            "sourceUrl": "http://feedproxy.google.com/~r/UChicagoLawFacultyPodcast/~5/hnXdLfiScZs/451417290-uchicagolaw-m-todd-henderson-lawyer-ceos.mp3"
        },
        {
            "title": "David Bowman, \"Alternative Reference Rates: SOFR, LIBOR, and Issues for Transitions\"",
            "datePublished": "Tue, 10 Apr 2018 21:21:03 +0000",
            "description": "The choice of new benchmark interest rate should be of special importance to practitioners as well as academics that study law and economics. As new alternative rates are being considered in the United States, this half day conference, co-sponsored by the University of Chicago Law School, brought together leading academics, as well as representatives from banks, law firms, swap dealers, regulators and others to share their views on design and implementation of new indexes in loan documents, swap agreements and other financial contracts.\r\n\r\nDr. David Bowman, Special Adviser to the Board, Federal Reserve Board, delivers the keynote for the conference \"Transition to New Interest Rate Benchmarks: SOFR, Ameribor and Beyond\" on April 3, 2018.\r\n\r\nIntroductory remarks by:\r\n\r\nDr. Richard L. Sandor, CEO, American Financial Exchange and Aaron Director Lecturer in Law and Economics, University of Chicago Law School\r\n\r\nRobert S. Rivkin, Deputy Mayor of the City of Chicago\r\n\r\nThomas J. Miles, Dean and Clifton R. Musser Professor of Law and Economics, University of Chicago Law School<img src=\"http://feeds.feedburner.com/~r/UChicagoLawFacultyPodcast/~4/KzU-F8fqq5o\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "36448049",
            "sourceUrl": "http://feedproxy.google.com/~r/UChicagoLawFacultyPodcast/~5/8NvGGko3zm0/427856142-uchicagolaw-david-bowman-alternative-reference-rates-sofr-libor-and-issues-for-transitions.mp3"
        },
        {
            "title": "John G. Malcolm, \"Current Topics in Criminal Justice Reform\"",
            "datePublished": "Wed, 28 Mar 2018 20:53:24 +0000",
            "description": "With commentary by Professor Jonathan Masur\r\n\r\nJohn G. Malcolm oversees The Heritage Foundation’s work to increase understanding of the Constitution and the rule of law as director of the think tank’s Edwin Meese III Center for Legal and Judicial Studies. In addition to his duties at Heritage, Malcolm is chairman of the Criminal Law Practice Group of the Federalist Society. Malcolm has previously served in both the public and private sectors. Among other positions, he has worked as general counsel at the U.S. Commission on International Religious Freedom, as executive vice president and director of worldwide anti-piracy operations for the Motion Picture Association of America, as a deputy assistant attorney general in the Department of Justice’s Criminal Division, as a partner in the Atlanta law firm of Malcolm & Schroeder, and as an assistant U.S. attorney in the Atlanta fraud and public corruption section. Malcolm began his law career clerking for Judge James C. Hill on the Eleventh Circuit and for Chief Judge Charles A. Moye, Jr. on the Northern District of Georgia. Malcolm is a graduate of Harvard Law School and holds a bachelor’s degree in economics from Columbia College.\r\n\r\nJonathan Masur received a BS in physics and an AB in political science from Stanford University in 1999 and his JD from Harvard Law School in 2003. After graduating from law school, he clerked for Chief Judge Marilyn Hall Patel of the United States District Court for the Northern District of California and for Judge Richard Posner of the United States Court of Appeals for the Seventh Circuit. He joined the Law School faculty in 2007 and received tenure in 2012. He served as Deputy Dean from 2012 to 2014 and was named the John P. Wilson Professor of Law in 2014. He won the Graduating Students Award for Teaching Excellence in 2014 and 2017 and the Class of 2016 Award. He has served as director of the Wachtell, Lipton, Rosen & Katz Program in Behavioral Law, Finance and Economics since its founding.<img src=\"http://feeds.feedburner.com/~r/UChicagoLawFacultyPodcast/~4/jGB0eYK8vkY\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "28283425",
            "sourceUrl": "http://feedproxy.google.com/~r/UChicagoLawFacultyPodcast/~5/WE4blA3fOC0/421512018-uchicagolaw-john-g-malcolm-current-topics-in-criminal-justice-reform.mp3"
        },
        {
            "title": "Mary Anne Case, \"Cultivating an Incest Taboo in the Workplace\"",
            "datePublished": "Tue, 27 Feb 2018 20:19:28 +0000",
            "description": "The idea that workplaces could benefit from an incest taboo is not one of Chicago’s best, but one of Margaret Mead’s. Professor Mary Anne Case has been promoting it and explaining its relevance to Title VII enforcement long before Harvey Weinstein and the #MeToo movement gave it new relevance and visibility.\r\n\r\nMary Anne Case is the Arnold I. Shure Professor of Law. This Chicago's Best Ideas lecture was presented on February 21, 2018.<img src=\"http://feeds.feedburner.com/~r/UChicagoLawFacultyPodcast/~4/CqxQPDaJwZ0\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "28235986",
            "sourceUrl": "http://feedproxy.google.com/~r/UChicagoLawFacultyPodcast/~5/eCAO3hr6z6E/406118976-uchicagolaw-mary-anne-case-cultivating-an-incest-taboo-in-the-workplace.mp3"
        },
        {
            "title": "Jonathan S. Masur, \"The Behavioral Law & Economics of Happiness\"",
            "datePublished": "Mon, 19 Feb 2018 20:21:24 +0000",
            "description": "A central question in law and economics is how people will behave in the presence of legal rules. An essential part of that inquiry is what makes people happy or unhappy – what increases or decreases their “subjective well-being.” There is ample evidence that individuals make decisions based in part on what they believe will improve their well-being. In order to understand how legal rules will influence behavior, it is thus vital to understand how those rules will affect happiness. More generally, viewing law through a hedonic lens can help legal policymakers determine whether (or not) a given law or policy will be beneficial for the individuals affected by it.\r\n\r\nJonathan S. Masur is John P. Wilson Professor of Law, David and Celia Hilliard Research Scholar, and Director of the Wachtell, Lipton, Rosen & Katz Program in Behavioral Law, Finance and Economics. The 2018 Coase Lecture in Law and Economics was presented on February 6, 2018.<img src=\"http://feeds.feedburner.com/~r/UChicagoLawFacultyPodcast/~4/YY-5DErSXeE\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "27025368",
            "sourceUrl": "http://feedproxy.google.com/~r/UChicagoLawFacultyPodcast/~5/LTKeWpGyMqs/402114597-uchicagolaw-jonathan-s-masur-the-behavioral-law-economics-of-happiness.mp3"
        },
        {
            "title": "Lior Jacob Strahilevitz, “Interpreting Contracts via Surveys and Experiments”",
            "datePublished": "Mon, 12 Feb 2018 22:35:22 +0000",
            "description": "Interpreting the language of contracts is the most common and least satisfactory task courts perform in contract disputes. In this Chicago’s Best Ideas lecture Professor Strahilevitz proposes to take much of this task out of the hands of lawyers and judges, entrusting it instead to the public. Strahilevitz’s research (written jointly with Professor Ben-Shahar) develops and tests a novel regime — the “survey interpretation method” — in which interpretation disputes are resolved though large surveys of representative respondents, by choosing the meaning that a majority supports. This method has rich potential to examine variations of contractual language that could have made an intended meaning clearer. A similar survey regime has been applied successfully in trademark and unfair competition law to interpret precontractual messages. To demonstrate the technique, Professor Strahilevitz applies the survey interpretation method to several real cases in which courts struggled to interpret contracts.\r\n\r\nLior Jacob Strahilevitz is Sidley Austin Professor of Law. This Chicago's Best Ideas lecture was presented on January 31, 2018.<img src=\"http://feeds.feedburner.com/~r/UChicagoLawFacultyPodcast/~4/8BeegDOcAJk\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "29679409",
            "sourceUrl": "http://feedproxy.google.com/~r/UChicagoLawFacultyPodcast/~5/2vNxQ-osaW4/398667207-uchicagolaw-lior-jacob-strahilevitz-interpreting-contracts-via-surveys-and-experiments.mp3"
        },
        {
            "title": "Henry Shue, \"Gambling with Their Climate: Future Generations, Negative Emissions, & Risk Transfers\"",
            "datePublished": "Tue, 21 Nov 2017 17:12:57 +0000",
            "description": "This lecture defends three main theses: (I) that all decisions about the degree of ambition for emissions mitigation are unavoidably also decisions about how to distribute risk across generations and, more specifically, (II) that the less ambitious the mitigation is, the more inherently objectionable the resulting inter-generational risk distribution is, and (III) that mitigation that is so lacking in ambition that it bequeaths risks that remain unlimited, when the risks could have been limited without inordinate sacrifice, is especially objectionable and constitutes a failure to seize a glorious historic opportunity.\r\n\r\nThis Dewey Lecture in Law and Philosophy was presented on November 8, 2017, by Henry Shue, Senior Research Fellow, Centre for International Studies, and Merton College, University of Oxford.<img src=\"http://feeds.feedburner.com/~r/UChicagoLawFacultyPodcast/~4/24b0PQdnOwc\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "44539321",
            "sourceUrl": "http://feedproxy.google.com/~r/UChicagoLawFacultyPodcast/~5/pZOt1TjELwk/358979924-uchicagolaw-henry-shue-gambling-with-their-climate-future-generations-negative-emissions-risk-transfers.mp3"
        },
        {
            "title": "Supreme Court Preview 2017: Highlights and Perspectives",
            "datePublished": "Wed, 20 Sep 2017 21:40:35 +0000",
            "description": "On the first Monday in October, the Supreme Court session opens. Professors Adam Chilton, Aziz Huq, and Daniel Hemel offer insight into some of the issues the Court will hear in the upcoming year.\r\n\r\nRecorded on September 18, 2017, in Washington, DC.<img src=\"http://feeds.feedburner.com/~r/UChicagoLawFacultyPodcast/~4/9i6j1nXDJfA\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "32682654",
            "sourceUrl": "http://feedproxy.google.com/~r/UChicagoLawFacultyPodcast/~5/x97j3egFGdM/343293095-uchicagolaw-supreme-court-preview-2017-highlights-and-perspectives.mp3"
        },
        {
            "title": "Aaron Nielson, \"The Past and Future of Deference: From Justice Scalia to Justice Gorsuch\"",
            "datePublished": "Tue, 02 May 2017 20:25:59 +0000",
            "description": "With commentary by Professor Daniel Hemel\r\n\r\nProfessor Nielson is a law professor at Brigham Young University and teaches/writes in the areas of administrative law, civil procedure, federal courts, and antitrust. Before joining the faculty, Professor Nielson was a partner in the Washington, D.C. office of Kirkland & Ellis LLP. He also has served as a law clerk to Justice Samuel A. Alito, Jr. of the U.S. Supreme Court, Judge Janice Rogers Brown of the U.S. Court of Appeals for the D.C. Circuit, and Judge Jerry E. Smith of the U.S. Court of Appeals for the Fifth Circuit. Professor Nielson received his J.D. from Harvard Law School. Following graduation, he was awarded a Harvard Law School Post-Graduate Research Fellowship. Professor Nielson also received an LL.M from the University of Cambridge, where he focused his studies on the institutions that regulate global competition and commerce. He received his undergraduate degree from the University of Pennsylvania, majoring in economics and political science.\r\n\r\nDaniel Hemel’s research focuses on taxation, risk regulation, and innovation law. His current projects examine the effect of tax expenditures on inequality; the role of cost-benefit analysis in tax administration; and the use of tax incentives to encourage knowledge production. As an assistant professor at the University of Chicago Law School, he teaches tax, administrative law, and torts. Daniel graduated summa cum laude from Harvard College and received an M.Phil with distinction from Oxford University, where he was a Marshall Scholar.  He then earned his J.D. from Yale Law School, where he was editor-in-chief of the Yale Law Journal.  Prior to his appointment, he was a law clerk to Associate Justice Elena Kagan on the U.S. Supreme Court.  He also clerked for Judge Michael Boudin on the U.S. Court of Appeals for the First Circuit and Judge Sri Srinivasan on the U.S. Court of Appeals for the District of Columbia Circuit, and served as visiting counsel at the Joint Committee on Taxation.\r\n\r\nPresented on April 26, 2017, by the Federalist Society.<img src=\"http://feeds.feedburner.com/~r/UChicagoLawFacultyPodcast/~4/7GdPawc9Ei0\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "28992702",
            "sourceUrl": "http://feedproxy.google.com/~r/UChicagoLawFacultyPodcast/~5/tn1LSoDYcRY/320554826-uchicagolaw-aaron-nielson-the-past-and-future-of-deference-from-justice-scalia-to-justice-gorsuch.mp3"
        },
        {
            "title": "To POE or Not to POE: The Proper Evidentiary Standard for Campus Sexual Misconduct (A Debate)",
            "datePublished": "Fri, 21 Apr 2017 21:26:30 +0000",
            "description": "Featuring Professors Nancy Chi Cantalupo, Katharine Baker, Daniel Hemel, and Richard Epstein. Moderated by Professor Emily Buss. Presented by the Domestic and Sexual Violence Project, Defenders, Law Women's Caucus, Education and Child Advocacy Society, and UChicago Assault Awareness and Prevention Committee, and funded in part by Student Government.<img src=\"http://feeds.feedburner.com/~r/UChicagoLawFacultyPodcast/~4/iPdIEO4_ZF8\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "29369283",
            "sourceUrl": "http://feedproxy.google.com/~r/UChicagoLawFacultyPodcast/~5/e1VZ6y8lw10/318859179-uchicagolaw-to-poe-or-not-to-poe-the-proper-evidentiary-standard-for-campus-sexual-misconduct-a-debate.mp3"
        },
        {
            "title": "Gillian Thomas, \"Title VII and Women in the Workplace\"",
            "datePublished": "Tue, 07 Mar 2017 19:19:32 +0000",
            "description": "Gillian Thomas, staff attorney at the ACLU Women's Rights Project, will discuss issues in her recently-published book, Because of Sex: One Law, Ten Cases, and Fifty Years about Title VII and its effects for women in the workplace. The book details ten important Supreme Court cases for women's equality, and spends as much time on the personal details as the legal ones for an extremely compelling read. As Title VII is one of the most important safeguards for women and helps ensure gender diversity in the workplace, we believe it will be a valuable addition to the Law School's Diversity Month.\r\n\r\nPresented on January 25, 2017, by If/When/How: Lawyering for Reproductive Justice, Labor and Employment Law Society, Public Interest Law Society, Employment Law Clinic, and Law Women's Caucus.<img src=\"http://feeds.feedburner.com/~r/UChicagoLawFacultyPodcast/~4/bKT8uhIZhv0\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "28296591",
            "sourceUrl": "http://feedproxy.google.com/~r/UChicagoLawFacultyPodcast/~5/YVsern4ALxk/311220745-uchicagolaw-gillian-thomas-title-vii-and-women-in-the-workplace.mp3"
        },
        {
            "title": "Anthony J. Casey, \"The Short Happy Life of Rules and Standards\"",
            "datePublished": "Tue, 28 Feb 2017 16:17:06 +0000",
            "description": "The choice between rules and standards in lawmaking is a central question. But the line between the two forms is not as clear as most scholars presume. This talk argues that the lack of a coherent  unifying principle in the rules-and-standards distinction is becoming more evident as technologies behind lawmaking evolve. It will explore the leading accounts of rules and standards, the insights they have provided into the process and meaning of law, and why the distinction may be reaching the end of its useful life. The talk will conclude with thoughts on how we should think about forms of law going forward.\r\n\r\nThis lecture is in honor of Ronald Coase. Coase, who spent most of his academic career at the University of Chicago Law School, helped create the field of law and economics through groundbreaking scholarship that earned him the 1991 Nobel Memorial Prize in Economic Sciences and through his far-reaching influence as a journal editor.\r\n\r\nAnthony J. Casey is Professor of Law and Mark Claster Mamolen Teaching Scholar. This Coase Lecture was presented on February 21, 2017.<img src=\"http://feeds.feedburner.com/~r/UChicagoLawFacultyPodcast/~4/1StFYgByR3o\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "37579046",
            "sourceUrl": "http://feedproxy.google.com/~r/UChicagoLawFacultyPodcast/~5/Gbz2jy0J5R4/309978903-uchicagolaw-anthony-j-casey-the-short-happy-life-of-rules-and-standards.mp3"
        },
        {
            "title": "Kurt Lash & Alan Gura, \"Does the Fourteenth Amendment Protect Unenumerated Rights?\"",
            "datePublished": "Fri, 03 Feb 2017 21:07:30 +0000",
            "description": "Professor Lash graduated from Yale Law School and served as law clerk to the Honorable Robert R. Beezer of the United States Court of Appeals for the Ninth Circuit. Afterward, he joined the University of Illinois from Loyola Law School Los Angeles, where he served as the James P. Bradley Chair of Constitutional Law. His recent book, The Lost History of the Ninth Amendment, was published in 2009 by Oxford University Press. Cambridge University Press will publish his second book, American Privileges and Immunities: Federalism, The Fourteenth Amendment and the Rights of American Citizenship.\r\n\r\nAlan Gura’s practice focuses primarily on constitutional law. Prior to founding Gura & Possessky, PLLC, Mr. Gura began his career by serving as a law clerk to the Honorable Terrence W. Boyle, United States District Judge for the Eastern District of North Carolina. Subsequently, as a Deputy Attorney General for the State of California, Mr. Gura defended the State of California and its employees from all manner of lawsuits, in state and federal courts, at trial and on appeal. Thereafter, Mr. Gura entered the private practice of law with the Washington, D.C. offices of Sidley & Austin. In February 2000, he left the firm to serve for a year as Counsel to the United States Senate Judiciary Committee, Subcommittee on Criminal Justice Oversight.\r\n\r\nPresented by the Federalist Society on January 25, 2017.<img src=\"http://feeds.feedburner.com/~r/UChicagoLawFacultyPodcast/~4/P6u1Qu3tOKw\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "33065923",
            "sourceUrl": "http://feedproxy.google.com/~r/UChicagoLawFacultyPodcast/~5/iQVv8HDVFuk/305990079-uchicagolaw-kurt-lash-alan-gura-does-the-fourteenth-amendment-protect-unenumerated-rights.mp3"
        },
        {
            "title": "William H. J. Hubbard, \"Empirical Study of the Supreme Court of India\"",
            "datePublished": "Thu, 26 Jan 2017 22:34:18 +0000",
            "description": "\"A Different Kind of Supreme Court? Empirical Study of the Supreme Court of India\"\r\n\r\nPart of Chicago's intellectual tradition is a willingness to take nothing for granted. Comparative study of legal institutions often reveals to us exactly how much we take for granted in the design of our legal institutions. Take the US Supreme Court: Why nine justices? Why does the president, and not the current justices, appoint new justices? Why do they sit en banc in every case, rather than sitting in panels of, say, two justices? Why do they decide 80 cases per year--why not 800, or 8,000? Why do the justices wait for cases raising important issues, rather than just filing their own cases?\r\n\r\nIn this talk, I'll describe current empirical work on the Supreme Court of India, considered by many to be the most powerful court in the world. I'll present data on how the Court operates, which cases it decides, and how it decides them. This leads to two lines of inquiry: First, what does an apex court so radically unlike our own teach us about the possibilities for institutional design for courts? And second, how can empirical study of one court (such as the Supreme Court of India) inform our understanding of judicial behavior in very different courts (such as our own)?\r\n\r\nWilliam H. J. Hubbard is Professor of Law and Ronald H. Coase Teaching Scholar. This Chicago's Best Ideas talk was presented on January 17, 2017.<img src=\"http://feeds.feedburner.com/~r/UChicagoLawFacultyPodcast/~4/B2GHSgpoij0\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "31103187",
            "sourceUrl": "http://feedproxy.google.com/~r/UChicagoLawFacultyPodcast/~5/lTwMHJjbiyw/304699119-uchicagolaw-william-h-j-hubbard-empirical-study-of-the-supreme-court-of-india.mp3"
        },
        {
            "title": "Saul Levmore, \"Carrots and Sticks in Law (and Life)\"",
            "datePublished": "Thu, 05 Jan 2017 21:33:26 +0000",
            "description": "One of the great Chicago Ideas is the equivalence of positive and negative incentives. The government can motivate you by rewarding some behavior or by penalizing your failure to behave in the preferred manner. Private parties rarely have the authority to hit you with sticks, so they must usually begin with carrots, or positive inducements, unless law offers torts or other negative inducements in the background. But things quickly get more complicated. Rewards might draw people to an activity, and penalties might cause them to stay away, so that the carrots and sticks are not equivalent. How does law reflect these secondary effects? When is it a good idea to mix positive and negative rewards? Should we pay people not to commit crimes? Why didn’t any lawmakers try to pay people not to enter into same-sex marriages? Why not just impose higher taxes on people who do not engage in public service? This first lecture of the year in our Chicago’s Best Ideas series introduces some of these ideas and then takes them in surprising directions.\r\n\r\nSaul Levmore is the William B. Graham Distinguished Service Professor of Law.<img src=\"http://feeds.feedburner.com/~r/UChicagoLawFacultyPodcast/~4/M2CBzXyyknU\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "31305270",
            "sourceUrl": "http://feedproxy.google.com/~r/UChicagoLawFacultyPodcast/~5/hr8uVoBfTec/301114135-uchicagolaw-saul-levmore-carrots-and-sticks-in-law-and-life.mp3"
        },
        {
            "title": "Jim Zirin & William Baude, \"The Post-Election Future of the Supreme Court after Scalia\"",
            "datePublished": "Thu, 29 Dec 2016 20:56:44 +0000",
            "description": "Jim Zirin graduated from Princeton University with honors and received his law degree from the University of Michigan Law School where he was an editor of the Michigan Law Review and a member of the Order of the Coif. For three years, he was an Assistant United States Attorney for the Southern District of New York and served in the criminal division under Robert M. Morgenthau.\r\n\r\nWilliam Baude is Neubauer Family Assistant Professor of Law at the University of Chicago Law School, where he teaches federal courts and constitutional law. His current research projects include papers on originalism, historical practice in constitutional law, federalism, the Supreme Court, and conflicts of law.\r\n\r\nPresented on November 28, 2016, by the American Constitution Society and the Federalist Society.<img src=\"http://feeds.feedburner.com/~r/UChicagoLawFacultyPodcast/~4/JTq7sQQHsL4\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "24845710",
            "sourceUrl": "http://feedproxy.google.com/~r/UChicagoLawFacultyPodcast/~5/CF5d6GXoMx0/300099473-uchicagolaw-jim-zirin-william-baude-the-post-election-future-of-the-supreme-court-after-scalia.mp3"
        },
        {
            "title": "Michael McConnell, \"Religion and Law: Is There a Connection?\"",
            "datePublished": "Fri, 18 Nov 2016 22:06:29 +0000",
            "description": "With commentary by Professor William Hubbard.\r\n\r\nMichael W. McConnell is the Richard and Frances Mallery Professor and director of the Constitutional Law Center at Stanford Law School, as well as Senior Fellow at the Hoover Institution. He is a leading authority on freedom of speech and religion, the relation of individual rights to government structure, originalism, and various other aspects of constitutional history and constitutional law. He is author of numerous articles and co-author of two casebooks: The Constitution of the United States (Foundation Press) and Religion and the Constitution (Aspen). He is co-editor of Christian Perspectives on Legal Thought (Yale Univ. Press). Since 1996, he has been a fellow of the American Academy of Arts and Sciences.\r\n\r\nPresented on November 15, 2016, by the Christian Legal Society, the St. Thomas More Society, and the Federalist Society.<img src=\"http://feeds.feedburner.com/~r/UChicagoLawFacultyPodcast/~4/o0uCIFZ1F7c\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "32068254",
            "sourceUrl": "http://feedproxy.google.com/~r/UChicagoLawFacultyPodcast/~5/FFN1lwVOaBQ/293706180-uchicagolaw-michael-mcconnell-religion-and-law-is-there-a-connection.mp3"
        },
        {
            "title": "October Term 2016: Highlights & Perspectives",
            "datePublished": "Tue, 04 Oct 2016 18:04:31 +0000",
            "description": "In this First Monday event, Law School faculty discuss their insight and opinions on upcoming United States Supreme Court cases and the issues currently facing the Court.\r\n\r\nFeaturing:\r\n\r\nAnthony J. Casey, '02, Professor of Law and Mark Claster Mamolen Teaching Scholar\r\n\r\nNicholas Stephanopoulos, Assistant Professor of Law\r\n\r\nDavid Strauss, the Gerald Ratner Distinguished Service Professor of Law.\r\n\r\nModerated by Sarah M. Konsky, Assistant Clinical Professor of Law and Director of the Jenner & Block Supreme Court and Appellate Clinic.\r\n\r\nIntroduced by Dean Thomas J. Miles.<img src=\"http://feeds.feedburner.com/~r/UChicagoLawFacultyPodcast/~4/4oq7luLZ7oU\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "40502044",
            "sourceUrl": "http://feedproxy.google.com/~r/UChicagoLawFacultyPodcast/~5/5iD0uoAtMPM/286033686-uchicagolaw-october-term-2016-highlights-perspectives.mp3"
        },
        {
            "title": "John Tasioulas, \"Minimum Core Obligations: Human Rights in the Here and Now\"",
            "datePublished": "Fri, 29 Jul 2016 15:55:23 +0000",
            "description": "Professor Tasioulas discusses the notion of the ‘minimum core obligations’ associated with economic, social and cultural human rights, such as the rights to education and health. The idea of minimum core obligations, which is a nascent doctrine in international human rights law, is heavily contested both as to its meaning and utility.\r\n\r\nJohn Tasioulas is Visiting Professor of Law and the Charles J. Merriam Scholar at the University of Chicago Law School; Yeoh Professor of Politics, Philosophy, and Law at the Dickson Poon School of Law, King’s College London; and Director of the Yeoh Tiong Lay Centre for Politics, Philosophy, and Law.\r\n\r\nPresented by the International Human Rights Clinics and the Human Rights Law Society on May 5, 2016.<img src=\"http://feeds.feedburner.com/~r/UChicagoLawFacultyPodcast/~4/JiqR2q5RrtE\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "27497662",
            "sourceUrl": "http://feedproxy.google.com/~r/UChicagoLawFacultyPodcast/~5/8Py8RvTEkm4/275931313-uchicagolaw-john-tasioulas-minimum-core-obligations-human-rights-in-the-here-and-now.mp3"
        },
        {
            "title": "Martha Nussbaum, \"Long Long Lives: Should We Want Them?\"",
            "datePublished": "Fri, 13 May 2016 21:11:10 +0000",
            "description": "Today, as our capacity to prolong life increases, people dispute whether indefinite prolongation could possibly be good.  A leading bioethicist, Ezekiel Emanuel (brother of Rahm) has written that we should all want to die at 75!  I'll approach this question by drawing on ancient Greek arguments about why immortal life is undesirable -- arguments that I find fatally flawed.  I then turn to two more recent philosophers who try to reconcile us to finite and reasonably short mortal lives: \"Younger Martha\" (i.e. me in 1994), and my teacher Bernard Williams, who wrote about the \"tedium of immortality.\"  I find those consolatory arguments flawed too.  But a better argument is found in the Roman philosopher Lucretius, and it applies to indefinite prolongation as well as to outright immortality.\r\n\r\nMartha Nussbaum is the Ernst Freund Distinguished Service Professor of Law and Ethics.\r\n\r\nPresented on April 5, 2016, at the University of Chicago Law School.<img src=\"http://feeds.feedburner.com/~r/UChicagoLawFacultyPodcast/~4/ewSwx6lVsQU\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "31306942",
            "sourceUrl": "http://feedproxy.google.com/~r/UChicagoLawFacultyPodcast/~5/9ntLdQNpFDQ/264005095-uchicagolaw-martha-nussbaum-long-long-lives-should-we-want-them.mp3"
        },
        {
            "title": "Michael Kirby, \"North Korea and our Dilemma\"",
            "datePublished": "Thu, 12 May 2016 18:21:28 +0000",
            "description": "Michael Kirby, \"North Korea and our Dilemma: How to Secure Accountability for Crimes Against Humanity by a Recalcitrant Nuclear State?\"\r\n\r\nMichael Kirby was a Justice of the High Court of Australia (1996-2009), the nation's highest appellate and constitutional Court. In 2013-14 he served as chair of the Commission of Inquiry of the UN Human Rights Council investigating crimes against humanity in the Democratic People's Republic of Korea (North Korea). The commission found grave and long-standing crimes against humanity and called for referral of its report to the Security Council of the United Nations. That body has the power to refer matters to the jurisdiction of the International Criminal Court (ICC) in the Hague. He warned the Supreme Leader of North Korea that, under international law, he was potentially personally accountable for failing to use his power to prevent and redress such crimes. Although the commission's report was duly sent to the Security Council by the UN Human Rights Council and the General Assembly, so far the Security Council as failed to enliven the jurisdiction of the ICC. In recent weeks, the Council has imposed new and stronger sanctions against North Korea following the conduct of a fourth nuclear weapons test and missile tests. The report of the commission has been widely praised for its powerful description of great wrongs. But how do we move beyond another UN report into effective subjection of this dangerous state and its leadership to compulsory accountability before an international tribunal responding to the deep concerns of humanity? The speaker will outline our dilemma. He will also answer questions and suggest possible future developments.\r\n\r\nThe Ulysses and Marguerite Schwartz Memorial Lectureship at the University of Chicago Law School is held by a distinguished lawyer or teacher whose experience is in the academic field or practice of public service.\r\n\r\nPresented on March 29, 2016, at the University of Chicago Law School.<img src=\"http://feeds.feedburner.com/~r/UChicagoLawFacultyPodcast/~4/i4TVnRT-XXE\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "39508137",
            "sourceUrl": "http://feedproxy.google.com/~r/UChicagoLawFacultyPodcast/~5/b569i6maJSw/263811523-uchicagolaw-michael-kirby-north-korea-and-our-dilemma.mp3"
        },
        {
            "title": "Justin Driver, \"The Southern Manifesto in Myth and Memory\"",
            "datePublished": "Mon, 02 May 2016 21:30:55 +0000",
            "description": "Justin Driver is Harry N. Wyatt Professor of Law and Herbert and Marjorie Fried Research Scholar. His principal research interests include constitutional law, constitutional theory, and the intersection of race with legal institutions. Prior to joining the University of Chicago Law School faculty, Driver was a visiting professor at Harvard, Stanford, and the University of Virginia. He began his career in legal academia at the University of Texas in 2009.\r\n\r\nThis Loop Luncheon was presented on April 29, 2016, as part of reunion weekend.<img src=\"http://feeds.feedburner.com/~r/UChicagoLawFacultyPodcast/~4/7tjHuXPpMTM\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "24685423",
            "sourceUrl": "http://feedproxy.google.com/~r/UChicagoLawFacultyPodcast/~5/cSk8ynIx1Q0/262191025-uchicagolaw-justin-driver-the-southern-manifesto-in-myth-and-memory.mp3"
        },
        {
            "title": "Laura Weinrib, “Freedom of Conscience and the Civil Liberties Path Not Taken”",
            "datePublished": "Wed, 09 Mar 2016 14:54:43 +0000",
            "description": "Recent efforts by opponents of same-sex marriage and reproductive rights to reorient their agenda around religious freedom have sparked an explosion of scholarship on religious claims for exemption from generally applicable laws. Professor Weinrib will discuss an early antecedent of this strategy: the campaign by the National Civil Liberties Bureau, the organizational precursor of the ACLU, to secure exemptions from military service for conscientious objectors during the First World War. The conception of liberty of conscience that the ACLU’s founders advanced, which they linked to an “Anglo-Saxon tradition” of individual rights, clashed with Progressive understandings of democratic citizenship and failed to gain broad-based traction. Civil liberties advocates consequently reframed their wartime work in terms that foregrounded democratic dissent rather than individual autonomy. By the Second World War, the new emphasis on expressive freedom had worked its way into American constitutional law. Even then, however, most Americans rejected a court-centered and constitutional right to exemption from generally applicable laws.\r\n\r\nLaura Weinrib is Assistant Professor of Law and Herbert and Marjorie Fried Teaching Scholar at the University of Chicago Law School.\r\n\r\nThis Chicago’s Best Ideas talked was recorded on February 17, 2016.<img src=\"http://feeds.feedburner.com/~r/UChicagoLawFacultyPodcast/~4/U6YZWej8uQs\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "27984166",
            "sourceUrl": "http://feedproxy.google.com/~r/UChicagoLawFacultyPodcast/~5/IefiIOTpvtc/251010974-uchicagolaw-laura-weinrib-freedom-of-conscience-and-the-civil-liberties-path-not-taken.mp3"
        },
        {
            "title": "Dhammika Dharmapala, \"The 'Credibility Revolution' in Empirical Law and Economics\"",
            "datePublished": "Tue, 08 Mar 2016 16:22:09 +0000",
            "description": "Dhammika Dharmapala is the Julius Kreeger Professor of Law at the University of Chicago Law School.\r\n\r\nThe 2016 Coase Lecture was presented on February 16, 2016.<img src=\"http://feeds.feedburner.com/~r/UChicagoLawFacultyPodcast/~4/pONF4I9hGTQ\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "35660196",
            "sourceUrl": "http://feedproxy.google.com/~r/UChicagoLawFacultyPodcast/~5/ftYsu7vew5o/250847775-uchicagolaw-dhammika-dharmapala-the-credibility-revolution-in-empirical-law-and-economics.mp3"
        },
        {
            "title": "Chief Judge Diane Wood, \"Making Your Voice Heard\"",
            "datePublished": "Fri, 19 Feb 2016 23:03:56 +0000",
            "description": "Chief Judge Diane Wood presents \"Making Your Voice Heard\" and speaks on issues related to women's professional development and the difficulties they face. \r\n\r\nJudge Diane Wood is the Chief Judge of the United States Court of Appeals for the Seventh Circuit and a senior lecturer here at the Law School. She earned her B.A. in 1971 and J.D. in 1975 from the University of Texas at Austin, and went on to clerk for Judge Irving L. Goldberg of the Fifth Circuit and for Justice Harry A. Blackmun of the U.S. Supreme Court. After spending time in private practice and in government, she began teaching, first at Georgetown University Law Center, and ultimately at The University of Chicago Law School, where she was the third woman to join the faculty. She was nominated to the Seventh Circuit by President Bill Clinton in 1995, and became Chief Judge on Oct. 1, 2013. She is the second woman to serve on the Seventh Circuit and the first woman to serve as Chief Judge of the Seventh Circuit.\r\n\r\nThis program was presented on January 14, 2016, by Law Women's Caucus, and sponsored by the Office of the Dean of Students as part of Diversity Month.<img src=\"http://feeds.feedburner.com/~r/UChicagoLawFacultyPodcast/~4/mDIdTp92brw\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "25618517",
            "sourceUrl": "http://feedproxy.google.com/~r/UChicagoLawFacultyPodcast/~5/fuvrkxlgD0E/247928759-uchicagolaw-chief-judge-diane-wood-making-your-voice-heard.mp3"
        },
        {
            "title": "Jonathan Masur, \"Deference Mistakes\"",
            "datePublished": "Fri, 22 Jan 2016 17:47:32 +0000",
            "description": "Suppose a court holds in the context of a habeas petition that a constitutional right is not yet “clearly established.”  Can we conclude from this that the right does not exist?  The answer, of course, is “no”—it would be error to treat this case as having held that there is no such right.  Yet in case after case, across multiple areas of law, judges (and their clerks) make precisely these types of “deference mistakes”: they rely on precedent without understanding the standard of review or burden of proof that governed that precedent.  That includes the particular mistake described here: courts regularly rely on precedents holding that a constitutional right was not “clearly established” to conclude that the right does not exist.  Nor is the problem confined to individual cases.  Deference mistakes can propagate over time, leading to systematic shifts in legal doctrine.\r\n\r\nJonathan Masur is the John P. Wilson Professor of Law, David and Celia Hilliard Research Scholar, and Director of the Wachtell, Lipton, Rosen & Katz Program in Behavioral Law, Finance and Economics.\r\n\r\nPresented on January 12, 2016, as part of the Chicago’s Best Ideas lecture series.<img src=\"http://feeds.feedburner.com/~r/UChicagoLawFacultyPodcast/~4/MgEynMuRaUk\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "26609289",
            "sourceUrl": "http://feedproxy.google.com/~r/UChicagoLawFacultyPodcast/~5/TJn6yCKPCUs/243256417-uchicagolaw-jonathan-masur-deference-mistakes.mp3"
        },
        {
            "title": "Tracey L. Meares, \"Police Reform and Public Security\"",
            "datePublished": "Thu, 31 Dec 2015 18:44:39 +0000",
            "description": "Keynote address for the University of Chicago Law School Legal Forum Symposium 2015: Policing the Police\r\n\r\nFirst published in 1985, the University of Chicago Legal Forum is the Law School’s second-oldest journal. The Legal Forum is a student-edited journal that focuses on a single cutting-edge legal issue every year, presenting an authoritative and timely approach to a particular topic.\r\n\r\nTracey L. Meares is the Walton Hale Hamilton Professor of Law at Yale Law School\r\n\r\nRecorded on November 6, 2015.\r\n\r\nAlso see the C-SPAN coverage: http://www.c-span.org/video/?400047-1/discussion-police-reform-public-security<img src=\"http://feeds.feedburner.com/~r/UChicagoLawFacultyPodcast/~4/pdb106hPG9M\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "27430579",
            "sourceUrl": "http://feedproxy.google.com/~r/UChicagoLawFacultyPodcast/~5/22zm4fX6rb4/239865698-uchicagolaw-tracey-l-meares-police-reform-and-public-security.mp3"
        },
        {
            "title": "Douglas Hallward-Driemeier & Daniel Hemel, \"Insights from the Obergefell Supreme Court Arguments\"",
            "datePublished": "Wed, 09 Dec 2015 20:12:07 +0000",
            "description": "\"Standing Up for Marriage Equality: Insights from the Obergefell Supreme Court Arguments\"\r\n\r\nDoug Hallward-Driemeier leads Ropes & Gray’s Appellate and Supreme Court practice. He has presented more than 60 appellate arguments, including before the U.S. Supreme Court and every federal circuit court of appeals. In the 2014-2015 Supreme Court Term, he argued two cases, including the landmark Obergefell case.\r\n\r\nDaniel Hemel’s research focuses on taxation, risk regulation, and innovation law. His current projects examine the taxation of risk-based returns; the application of cost-benefit analysis to tax administration; and the role of international law in providing innovation incentives.  As an assistant professor at the University of Chicago Law School, he teaches tax, administrative law, and torts.\r\n\r\nThis event was organized by the Office of the Dean of Students and sponsored by OutLaw. It was recorded on November 4, 2015.<img src=\"http://feeds.feedburner.com/~r/UChicagoLawFacultyPodcast/~4/yv3r7FNWme0\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "28223866",
            "sourceUrl": "http://feedproxy.google.com/~r/UChicagoLawFacultyPodcast/~5/_NGxLhsYeng/236831012-uchicagolaw-douglas-hallward-driemeier-daniel-hemel-insights-from-the-obergefell-supreme-court-arguments.mp3"
        },
        {
            "title": "Moshe Halbertal, \"Three Concepts of Human Dignity\"",
            "datePublished": "Thu, 03 Dec 2015 22:29:17 +0000",
            "description": "Human Dignity has become a central value in political and constitutional thought. Yet its meaning and scope, and its relation to other moral and political values such as autonomy and rights have been elusive. The lecture will explicate the value of Human Dignity through the exploration of three distinct ways in which dignity is violated.\r\n\r\nMoshe Halbertal is the Gruss Professor of Law at NYU and Professor of Philosophy Hebrew University of Jerusalem, Israel.\r\n\r\nThe 2015 Dewey Lecture was recorded on November 11 at the University of Chicago Law School.<img src=\"http://feeds.feedburner.com/~r/UChicagoLawFacultyPodcast/~4/YAiEKMbZZa8\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "41340679",
            "sourceUrl": "http://feedproxy.google.com/~r/UChicagoLawFacultyPodcast/~5/x7k8Ob_Yp8M/235963753-uchicagolaw-moshe-halbertal-three-concepts-of-human-dignity.mp3"
        },
        {
            "title": "Mary Anne Case, “Fifty Years of Griswold v. Connecticut\"",
            "datePublished": "Tue, 17 Nov 2015 16:27:32 +0000",
            "description": "It's birth control's fiftieth birthday! Professor Case will be discussing what Griswold—the landmark case that began the process of invalidating legal prohibitions on the use of birth control—looks like in the aftermath of Hobby Lobby and Obergefell.\r\n\r\nMary Anne Case is the Arnold I. Shure Professor of Law and convener of the Workshop on Regulating Family, Sex and Gender.\r\n\r\nPresented by the Law Students for Reproductive Justice and the American Constitution Society on November 11, 2015.<img src=\"http://feeds.feedburner.com/~r/UChicagoLawFacultyPodcast/~4/xBMcmnnhyQs\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "24292123",
            "sourceUrl": "http://feedproxy.google.com/~r/UChicagoLawFacultyPodcast/~5/ia119CvSsmU/233475559-uchicagolaw-mary-anne-case-fifty-years-of-griswold-v-connecticut.mp3"
        },
        {
            "title": "Panel: Theory Meets Practice: Dynamic Changes in the Election Law Landscape",
            "datePublished": "Tue, 10 Nov 2015 21:11:50 +0000",
            "description": "Panelists:\r\n\r\n- Don Harmon, JD’95, Illinois State Senator\r\n- Dan Johnson, JD’00, Progressive Public Affairs\r\n- Blake Sercye, JD'11, Associate, Jenner & Block\r\n- Nicholas Stephanopoulos, Assistant Professor of Law\r\n\r\nHosted by the University of Chicago Law School’s Regional Alumni Committee at Skadden Arps in Chicago. Recorded October 13, 2015.<img src=\"http://feeds.feedburner.com/~r/UChicagoLawFacultyPodcast/~4/RVv7HfP8Muw\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "30133939",
            "sourceUrl": "http://feedproxy.google.com/~r/UChicagoLawFacultyPodcast/~5/u_ICxA27dAs/232488469-uchicagolaw-panel-theory-meets-practice-dynamic-changes-in-the-election-law-landscape.mp3"
        },
        {
            "title": "Saul Levmore, \"What Do Lawmakers Do?\"",
            "datePublished": "Thu, 05 Nov 2015 16:50:39 +0000",
            "description": "Lawmakers respond to constituents, seek higher office, have lofty goals, and even learn from their mistakes. But do they actually make the world a better place? In this lecture, the first of this year’s Chicago’s Best Ideas series, Professor Levmore examines some aspects of lawmaking that do not make their way into the law school curriculum. First, lawmakers may be forward-looking, but they have tools that are backward looking, or retroactive, and this combination can help us understand why some lawmaking is quite durable, while some of it falls apart both physically (like crumbling bridges) and conceptually (like conventional views about sex and marriage). Second, lawmakers might be rewarded when they innovate successfully, but they are penalized harshly for making changes that backfire. This trade-off helps us understand where we do or do not observe experiments and progress, ranging from Uber to health-care.\r\n\r\nSaul Levmore is the William B. Graham Distinguished Service Professor of Law.\r\n\r\nThis Chicago's Best Ideas lecture was recorded on October 13, 2015.<img src=\"http://feeds.feedburner.com/~r/UChicagoLawFacultyPodcast/~4/VHZrzAB6zMs\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "30190991",
            "sourceUrl": "http://feedproxy.google.com/~r/UChicagoLawFacultyPodcast/~5/-6ayVkVUoak/231691387-uchicagolaw-saul-levmore-what-do-lawmakers-do.mp3"
        },
        {
            "title": "James B. Comey, '85: \"Law Enforcement and the Communities We Serve\"",
            "datePublished": "Tue, 27 Oct 2015 14:47:05 +0000",
            "description": "James B. Comey, class of 1985, is the Director of the Federal Bureau of Investigation.\r\n\r\nRecorded on October 23, 2015, at the University of Chicago Law School.<img src=\"http://feeds.feedburner.com/~r/UChicagoLawFacultyPodcast/~4/m2Gk4p2RhbM\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "35484026",
            "sourceUrl": "http://feedproxy.google.com/~r/UChicagoLawFacultyPodcast/~5/xRj_VXl8bjs/230316924-uchicagolaw-james-b-comey-85-law-enforcement-and-the-communities-we-serve.mp3"
        },
        {
            "title": "Laura ​Weinrib, ​“Labor, ​Lochner, ​and ​the ​First ​Amendment”",
            "datePublished": "Fri, 23 Oct 2015 18:49:47 +0000",
            "description": "Laura Weinrib, Assistant ​Professor ​of ​Law ​and ​Herbert ​and ​Marjorie ​Fried ​Teaching ​Scholar,  is a 2003 graduate of Harvard Law School. She completed her PhD in history at Princeton University in 2011. In 2000, she received an AB in literature and an AM in comparative literature from Harvard University. After law school, Weinrib clerked for Judge Thomas L. Ambro of the United States Court of Appeals for the Third Circuit. From 2009 to 2010, she was a Samuel I. Golieb Fellow in Legal History at the New York University School of Law.\r\n\r\nRecorded October 5, 2015, as part of the Law School’s First Mondays luncheon series.<img src=\"http://feeds.feedburner.com/~r/UChicagoLawFacultyPodcast/~4/3Mv5zzdV2HM\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "25464499",
            "sourceUrl": "http://feedproxy.google.com/~r/UChicagoLawFacultyPodcast/~5/AuKDipGlP8A/229769633-uchicagolaw-laura-weinrib-labor-lochner-and-the-first-amendment.mp3"
        },
        {
            "title": "Axel Honneth, “Three, Not Two, Concepts of Liberty”",
            "datePublished": "Fri, 17 Jul 2015 17:09:28 +0000",
            "description": "Even for those among us who are not altogether convinced by Isaiah Berlin's famous essay \"Two Concepts of Liberty,\" it has by now become commonplace to adopt a distinction between \"negative\" and \"positive\" liberties that largely coincides with the one he offered. In my lecture I defend the thesis that this bifurcation of the concept of freedom is incomplete in a significant respect, because it omits a third type, which I will call \"social freedom.\" I proceed first by illustrating with some well-known examples how we must understand this third form of freedom, which cannot be performed by one subject alone, but rather requires the cooperation of others. In the second step I want to recall briefly the philosophical tradition in which this idea of \"social freedom\" has always had a central place. Finally, I delve into the systematic question of whether the suggested model of freedom in fact designates a third concept, which does not conform to the traditional bifurcated understanding.\r\n\r\nAxel Honneth is a professor of philosophy at the University of Frankfurt and Columbia University, and the director of the Institute for Social Research in Frankfurt.\r\n\r\nThis talk, the Dewey Lecture in Law and Philosophy, was recorded on November 12, 2014.<img src=\"http://feeds.feedburner.com/~r/UChicagoLawFacultyPodcast/~4/cJ6Zj7y1SS0\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "47528565",
            "sourceUrl": "http://feedproxy.google.com/~r/UChicagoLawFacultyPodcast/~5/9nR6Nm9VmOs/215157327-uchicagolaw-axel-honneth-three-not-two-concepts-of-liberty.mp3"
        },
        {
            "title": "William H. J. Hubbard, “Newtonian Law and Economics, Quantum Law and Economics, and ...”",
            "datePublished": "Mon, 29 Jun 2015 16:23:47 +0000",
            "description": "“Newtonian Law and Economics, Quantum Law and Economics, and the Search for a Theory of Relativity”\r\n\r\nAt this law school, “law and economics” is a mantra. But what is the “economics” in “law and economics”? There is a tendency to see research on cognitive biases and bounded rationality (“behavioral economics”) as challenging or even overturning an approach using models of rational behavior (“neo-classical economics”). With the help of an analogy to physics, I argue that such a view disserves both the enterprise of neo-classical economics and the promise of behavioral economics, and I define present and future challenges for the economic analysis of law.\r\n\r\nWilliam H. J. Hubbard is Assistant Professor of Law at the University of Chicago Law School.\r\n\r\nThis talk, the 2015 Coase Lecture in Law and Economics, was recorded on April 14, 2015.<img src=\"http://feeds.feedburner.com/~r/UChicagoLawFacultyPodcast/~4/KWbG6W21Jaw\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "43528696",
            "sourceUrl": "http://feedproxy.google.com/~r/UChicagoLawFacultyPodcast/~5/CJFhM9wER4Q/212503932-uchicagolaw-william-h-j-hubbard-newtonian-law-and-economics-quantum-law-and-economics-and.mp3"
        },
        {
            "title": "Aziz Huq, “Hobby Lobby and the Psychology of Corporate Rights”",
            "datePublished": "Thu, 11 Jun 2015 20:03:23 +0000",
            "description": "After the Hobby Lobby and Citizens United decisions, a robust public debate has emerged over corporate constitutional rights. Prof. Huq discusses ongoing empirical research about how the Hobby Lobby case has influenced public perceptions not just of those rights, but also of the Court itself.\r\n\r\nAziz Z. Huq teaches and conducts research in constitutional law, criminal procedure, and federal courts. A 1996 summa cum laude graduate of the University of North Carolina at Chapel Hill, he received his law degree from Columbia Law School in 2001. At Columbia, he was awarded the John Ordronaux Prize, the Emil Schlesinger Prize, and the Charles Bathgate Beck Prize. Upon graduating, he clerked for Judge Robert D. Sack of the U.S. Court of Appeals for the Second Circuit from 2001 to 2002 and then for Justice Ruth Bader Ginsburg of the Supreme Court of the United States from 2003 to 2004.\r\n\r\nRecorded on May 5, 2015, as part of the Chicago’s Best Ideas lecture series.<img src=\"http://feeds.feedburner.com/~r/UChicagoLawFacultyPodcast/~4/pzJw8b0hxp8\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "31520519",
            "sourceUrl": "http://feedproxy.google.com/~r/UChicagoLawFacultyPodcast/~5/EH2rJuE8K8w/209902406-uchicagolaw-aziz-huq-hobby-lobby-and-the-psychology-of-corporate-rights.mp3"
        },
        {
            "title": "Richard A. Epstein, “Reasonable and Unreasonable Expectations in Property Law and Beyond”",
            "datePublished": "Fri, 05 Jun 2015 19:58:19 +0000",
            "description": "The notion of reasonable expectations filters in and out of many given areas of law.  It is often derided as circular claim in which reasonable expectations are shaped by the law that they are supposed to shape.  On the other hand, it is often treated, most notably under the Supreme Court’s now pivotal decision in Penn Central Transportation Co v. City of New York, as the linchpin of modern real property law, and has been used as well in other areas, including financial regulation and the law of searches and seizures.  Both of these views are incorrect.  Reasonable expectations can never be banned from the law, but they must be domesticated, where their primary role is to facilitate cooperation between people who otherwise are unable to coordinate their social behaviors.\r\n\r\nRichard A. Epstein is the James Parker Hall Distinguished Service Professor Emeritus of Law and Senior Lecturer at the University of Chicago Law School. Epstein started his legal career at the University of Southern California, where he taught from 1968 to 1972. He served as Interim Dean of the Law School from February to June 2001. He is also the Laurence A. Tisch Professor of Law at New York University, and the Peter and Kirsten Bedford Senior Fellow at the Hoover Institution.\r\n\r\nRecorded April 22, 2015, as part of the Chicago’s Best Ideas lecture series.<img src=\"http://feeds.feedburner.com/~r/UChicagoLawFacultyPodcast/~4/mu7ewtiaVC4\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "33351389",
            "sourceUrl": "http://feedproxy.google.com/~r/UChicagoLawFacultyPodcast/~5/OGCCmK--P84/208982527-uchicagolaw-richard-a-epstein-reasonable-and-unreasonable-expectations-in-property-law-and-beyond.mp3"
        },
        {
            "title": "Alison Siegler, “The Courts of Appeals’ Latest Sentencing Rebellion”",
            "datePublished": "Thu, 28 May 2015 15:42:38 +0000",
            "description": "For over twenty-five years, federal courts of appeals have rebelled against every Supreme Court mandate that weakens the federal sentencing Guidelines. That rebellion has intensified since the Court dealt a blow to the Guidelines a decade ago by making them advisory, rather than mandatory. This ruling dramatically limited the courts of appeals’ authority to reverse district court sentences that deviate from the Guidelines. Rather than accepting this limitation on their power, the courts of appeals fought against it by overpolicing sentences that deviated from the Guidelines and underpolicing sentences that fell within the Guidelines. The Supreme Court has responded to these mutinies with stinging reversals that emphasize the district courts’ significant discretion and the advisory nature of the Guidelines. This talk discusses these ongoing battles between the courts of appeals and the Supreme Court, including a new revolt the courts of appeals are staging that violates not only Supreme Court precedent, but the federal sentencing statute and the Constitution as well. Because the courts of appeals are unlikely to back down, Professor Siegler calls on the Supreme Court to step in and stop this latest rebellion.\r\n\r\nAlison Siegler is Clinical Professor of Law and Director of the Federal Criminal Justice Clinic at the University of Chicago Law School.\r\n\r\nRecorded on April 13, 2015, as part of the Chicago’s Best Ideas lecture series.<img src=\"http://feeds.feedburner.com/~r/UChicagoLawFacultyPodcast/~4/gTCa2Tu71Tk\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "27184610",
            "sourceUrl": "http://feedproxy.google.com/~r/UChicagoLawFacultyPodcast/~5/aUkI5eHwRmo/207658418-uchicagolaw-alison-siegler-the-courts-of-appeals-latest-sentencing-rebellion.mp3"
        },
        {
            "title": "Rising Storm: Ways of Addressing Climate Change's Impacts on Infrastructure and Housing",
            "datePublished": "Wed, 06 May 2015 18:49:20 +0000",
            "description": "A Kreisman Housing Breakfast Series event\r\nco-sponsored by the Energy Policy Institute at Chicago  \r\nand the Coase-Sandor Institute for Law and Economics\r\n\r\nLed by University of Chicago environmental lawyer Mark Templeton, an expert panel will discuss the advantages and disadvantages of different public and private approaches for addressing the impacts of climate change on infrastructure and housing.\r\n\r\nFeaturing panelists: \r\n- Henry Henderson, Midwest Director, Natural Resource Defense Council\r\n- Bill Abolt, Vice President, AECOM\r\n- Omri Ben-Shahar, Leo and Eileen Herzel Professor of Law and Kearney Director of the Coase-Sandor Institute for Law and Economics\r\n\r\nIn conversation with Mark Templeton, Associate Clinical Professor of Law and Director of the Abrams Environmental Law Clinic.\r\n\r\nRecorded on April 21, 2015.<img src=\"http://feeds.feedburner.com/~r/UChicagoLawFacultyPodcast/~4/FCohz81CK68\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "43934534",
            "sourceUrl": "http://feedproxy.google.com/~r/UChicagoLawFacultyPodcast/~5/DVg0LjyvmIo/204224538-uchicagolaw-rising-storm-ways-of-addressing-climate-changes-impacts-on-infrastructure-and-housing.mp3"
        },
        {
            "title": "Youth/Police Conference: They Have All The Power",
            "datePublished": "Sat, 02 May 2015 21:25:09 +0000",
            "description": "Why does police accountability matter in this context? How does the knowledge that severe abuses—brutality, sexual assault, false arrest, even death—have gone unpunished inform and shape encounters between youth and police? What are the costs and harms of the absence of accountability? How does the lack of accountability affect the relationships between youth and police? How does it impact our effectiveness in addressing crime and violence? How could improved transparency and accountability affect youth/police relations?\r\n\r\nCathy Cohen, David and Mary Winton Green Professor of Political Science, University of Chicago\r\n\r\nCraig Futterman, Clinical Professor of Law, University of Chicago Law School\r\n\r\nDelores Jones-Brown, Professor of Law, Police Science and Criminal Justice Administration, John Jay College of Criminal Justice\r\n\r\nChris King, Managing Editor, The St. Louis American\r\n\r\nModerator: Jamie Kalven, Invisible Institute\r\n\r\nThis panel discussion was recorded at the Youth/Police Conference at the University of Chicago Law School in April 2015.<img src=\"http://feeds.feedburner.com/~r/UChicagoLawFacultyPodcast/~4/zEtcIvdQ910\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "49534560",
            "sourceUrl": "http://feedproxy.google.com/~r/UChicagoLawFacultyPodcast/~5/_1g92Y6Evgg/203635903-uchicagolaw-they-have-all-the-power.mp3"
        },
        {
            "title": "Federalist Society Student Symposium: Innovation And The Administrative State",
            "datePublished": "Thu, 16 Apr 2015 21:45:35 +0000",
            "description": "Regulation can be a significant barrier to innovation, protecting incumbents and making it harder to bring new goods and services to market. Determining the appropriate regulation is all the more difficult when accelerating technology is creating many new opportunities as well as potential dangers. Can the administrative state itself innovate to promote beneficial innovation? Topics to be considered here will be the nature and scope of cost-benefit analysis, the use of experiments to guide regulation and prizes as an alternative to top-down regulation.\r\n\r\nProf. William Baude, University of Chicago Law School\r\n\r\nMr. Jon Dudas, Senior Associate to the President, University of Arizona and former Under Secretary of Commerce for Intellectual Property and Director of the United States Patent and Trademark Office\r\n\r\nMr. Steve Lehotsky, Deputy Chief Counsel for Litigation, U.S. Chamber Litigation Center\r\n\r\nProf. Jennifer Nou, University of Chicago Law School\r\n\r\nModerator: Hon. Stephen Markman, Michigan Supreme Court\r\n\r\nThis program was presented on February 20, 2015, as part of the 2015 Federalist Society National Student Symposium.<img src=\"http://feeds.feedburner.com/~r/UChicagoLawFacultyPodcast/~4/WiEQdrXUZnY\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "50490642",
            "sourceUrl": "http://feedproxy.google.com/~r/UChicagoLawFacultyPodcast/~5/A9M8W8JgYww/201151483-uchicagolaw-innovation-and-the-administrative-state.mp3"
        },
        {
            "title": "Alison LaCroix, \"The Shadow Powers of Article I\"",
            "datePublished": "Mon, 06 Apr 2015 17:29:49 +0000",
            "description": "The Supreme Court's federalism battleground has recently shifted from the Commerce Clause to two textually marginal but substantively important domains: the Necessary and Proper Clause and, to a lesser extent, the General Welfare Clause. For nearly a decade, these quieter, more structurally ambiguous federal powers – the “shadow powers” – have steadily increased in prominence. Paradoxically, the growth of shadow powers analysis has tended to narrow the permissible scope of congressional regulatory power. The invocation of the shadow powers has helped the Court find room to maneuver within its federalism analysis, while also appearing to maintain its commitment to an apparently unmoving baseline of a narrow commerce power. This maneuvering might be productive if it were carried out explicitly, with some discussion by the Court of the reasons for preferring to adjudicate federalism at its doctrinal and textual periphery rather than at its center. But the result of the growth of shadow powers analysis has in fact been to obscure the outlines of federalism’s map.\r\n\r\nAlison LaCroix is Professor of Law and Ludwig and Hilde Wolf Teaching Scholar at the Law School. She is also an associate member of the University of Chicago Department of History. LaCroix received her BA summa cum laude in history from Yale University in 1996 and her JD from Yale Law School in 1999. She received her PhD in history from Harvard University in 2007 after earning an AM in history from Harvard in 2003. While in law school, LaCroix served as essays editor of the Yale Law Journal and managing editor of the Yale Journal of Law & the Humanities. From 1999 to 2001, she practiced in the litigation department at Debevoise & Plimpton in New York. Before joining the Law School faculty in 2006, she was a Samuel I. Golieb Fellow in Legal History at New York University School of Law.\r\n\r\nThis talk was recorded on January 28, 2015, as part of the Chicago’s Best Ideas lecture series.<img src=\"http://feeds.feedburner.com/~r/UChicagoLawFacultyPodcast/~4/1hFXl1WraC4\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "25142670",
            "sourceUrl": "http://feedproxy.google.com/~r/UChicagoLawFacultyPodcast/~5/HNUj668SorU/199530154-uchicagolaw-alison-lacroix-the-shadow-powers-of-article-i.mp3"
        },
        {
            "title": "Omri Ben-Shahar, \"The Unintended Effects of Access Justice Laws\"",
            "datePublished": "Thu, 19 Mar 2015 17:10:34 +0000",
            "description": "Access Justice laws give people equal opportunity to enjoy primary goods, ensuring that access to these goods is not allocated by markets and is not tilted in favor of wealth and privilege. But Access Justice often fails to meet its egalitarian aspirations, because access and its benefits are deployed disproportionately by elites, yet paid for directly by public budgets and indirectly by weaker groups. In this lecture, Professor Ben-Shahar explains why Access Justice law can unintentionally hurt weak groups in a variety of areas — access to courts, information, insurance, internet, and many more.\r\n\r\nOmri Ben-Shahar earned his PhD in Economics and SJD from Harvard in 1995 and his BA and LLB from the Hebrew University in 1990. Before coming to Chicago, he was the Kirkland & Ellis Professor of Law and Economics at the University of Michigan. Prior to that, he taught at Tel-Aviv University, was a member of Israel's Antitrust Court and clerked at the Supreme Court of Israel. He teaches contracts, sales, insurance Law,  consumer law, e-commerce, food and drug law, law and economics, and game theory and the law. He writes in the fields of contract law and consumer protection. He is the co-author of More Than You Wanted to Know: The Failure of Mandated Disclosure (Princeton 2014). Ben-Shahar is the Kearny Director of the Coase-Sandor Institute for Law and Economics, and the Editor of the Journal of Legal Studies. He is also the Co-Reporter with Oren Bar-Gill for the Restatement Third of Consumer Contracts.\r\n\r\nThis lecture was recorded on March 3, 2015, as part of the Chicago's Best Ideas lecture series.<img src=\"http://feeds.feedburner.com/~r/UChicagoLawFacultyPodcast/~4/hmu-X35ntCg\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "28478194",
            "sourceUrl": "http://feedproxy.google.com/~r/UChicagoLawFacultyPodcast/~5/pfbWl0TMFxA/196674868-uchicagolaw-omri-ben-shahar-the-unintended-effects-of-access-justice-laws.mp3"
        },
        {
            "title": "William Baude, \"Is Originalism Our Law?\"",
            "datePublished": "Mon, 16 Mar 2015 18:51:53 +0000",
            "description": "At her confirmation hearing, Supreme Court Justice Elena Kagan said that \"we are all originalists.\" Is that true, and what would it mean for it to be true?  In Is Originalism Our Law?, I argue that there is an important sense in which Justice Kagan was right. And if originalism is our law, it provides a new and better explanation for why judges today are bound to follow the decisions of the framers.\r\n\r\nWilliam Baude is Neubauer Family Assistant Professor of Law at the University of Chicago Law School, where he teaches federal courts and constitutional law. His current research projects include papers on originalism, historical practice in constitutional law, federalism, the Supreme Court, and conflicts of law. His recent publications include \"Rethinking the Federal Eminent Domain Power,\" and \"Beyond DOMA: State Choice of Law in Federal Statutes.\" He also contributes to two legal blogs, the Volokh Conspiracy and SCOTUSBlog.\r\n\r\nThis lecture was recorded on February 13, 2015, at the University of Chicago Law School.<img src=\"http://feeds.feedburner.com/~r/UChicagoLawFacultyPodcast/~4/Lfcdt45Og14\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "22992688",
            "sourceUrl": "http://feedproxy.google.com/~r/UChicagoLawFacultyPodcast/~5/XscoETSyTYs/196184560-uchicagolaw-william-baude-is-originalism-our-law.mp3"
        },
        {
            "title": "Panel: \"Ferguson and Beyond: Criminal Procedure and Police Killings\"",
            "datePublished": "Tue, 03 Mar 2015 18:34:01 +0000",
            "description": "This panel was moderated by Professor Siegler and included Deputy Dean Ginsburg and Professors Huq, McAdams, and Randolph Stone.\r\n\r\nThe event took place on February 4, 2015. It was presented by BLSA in partnership with the Law School and cosponsored by ACS, APALSA, Criminal Law Society, Defenders, Human Rights Law Society, LLSA, LSRJ, LWC, PILS, and SALSA.<img src=\"http://feeds.feedburner.com/~r/UChicagoLawFacultyPodcast/~4/9HpWrfXh4KU\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "27684698",
            "sourceUrl": "http://feedproxy.google.com/~r/UChicagoLawFacultyPodcast/~5/VDcWVpvnYsw/194049195-uchicagolaw-panel-ferguson-and-beyond-criminal-procedure-and-police-killings.mp3"
        },
        {
            "title": "A Conversation With Elena Kagan",
            "datePublished": "Wed, 11 Feb 2015 19:43:50 +0000",
            "description": "In a conversation with David A. Strauss, Gerald Ratner Distinguished Service Professor of Law, US Supreme Court Justice Elena Kagan reflects on decision-making, persuasion, and hunting with Scalia.\r\n\r\nThis event took place on February 2, 2015, at the University of Chicago Law School.<img src=\"http://feeds.feedburner.com/~r/UChicagoLawFacultyPodcast/~4/ooiJaAKP_h8\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "35554870",
            "sourceUrl": "http://feedproxy.google.com/~r/UChicagoLawFacultyPodcast/~5/0cwQ40oRg6w/190639373-uchicagolaw-a-conversation-with-elena-kagan.mp3"
        },
        {
            "title": "Will the Supreme Court Make Disparate Impact Disappear?",
            "datePublished": "Wed, 04 Feb 2015 17:48:17 +0000",
            "description": "A panel discussion with John Relman, Jeff Leslie, Lee Fennell, and Tara Ramchandani\r\n\r\nAs part of the Law School's Diversity Month, the panelists discuss the pending Supreme Court Case, \"Texas Department of Housing and Community Affairs v. The Inclusive Communities Project.\"\r\n\r\nPresented on January 21, 2015, by ACS, ACLU, BLSA and APALSA with the Kreisman Initiative on Housing Law and Policy.<img src=\"http://feeds.feedburner.com/~r/UChicagoLawFacultyPodcast/~4/SiRf6BxloIw\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "25515699",
            "sourceUrl": "http://feedproxy.google.com/~r/UChicagoLawFacultyPodcast/~5/X4oGuPSTY9M/189477324-uchicagolaw-will-the-supreme-court-make-disparate-impact-disappear.mp3"
        },
        {
            "title": "Martha Minow, \"Forgiveness, Law and Justice\"",
            "datePublished": "Thu, 29 Jan 2015 17:38:00 +0000",
            "description": "Martha Minow, Morgan and Helen Chu Dean and Professor of Law, Harvard Law School\r\nwith comments by Martha Nussbaum, Aziz Huq, and Michael Schill\r\n\r\nWhat role if any should forgiveness play in law and legal systems? By forgiveness, I mean: a conscious, deliberate decision to forgo rightful grounds for whoever has committed a wrong or harm. Law may penalize those who apologize and in so doing make forgiveness by the victim less likely. Law may construct adversarial processes that render forgiveness less likely than it would otherwise be. Or law can give people chances to meet together, in spaces where they may apologize and forgive.\r\n\r\nThis lecture was presented on January 8, 2015, at the University of Chicago Law School as part of the Brennan Center Jorde Symposium.<img src=\"http://feeds.feedburner.com/~r/UChicagoLawFacultyPodcast/~4/Yc8ewz5NYQA\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "47546537",
            "sourceUrl": "http://feedproxy.google.com/~r/UChicagoLawFacultyPodcast/~5/SDYxGMhKv4U/188496454-uchicagolaw-martha-minow-forgiveness-law-and-justice.mp3"
        },
        {
            "title": "Richard McAdams, \"How Law Works  Expressively\"",
            "datePublished": "Thu, 08 Jan 2015 21:11:01 +0000",
            "description": "Although people sometimes violate the law, there is more legal compliance than we can explain by ordinary economic theory – that legal sanctions deter noncompliance. In some domains of international law and constitutional law, there is no credible threat of legal sanctions, yet there is compliance. In some historic examples, “courts” lacking any sanctioning power resolved disputes arising in medieval Iceland, among 18th century pirates, and among 19th century gold-rushers. Professor McAdams explains these and other historic and contemporary examples of compliance by focusing attention on law’s expressive power. First, legal expression provides a salient means of coordinating behavior. Second, law reveals information about risks and attitudes. These two expressive powers are distinct from law’s coercive power.\r\n\r\nRichard H. McAdams is Bernard D. Meltzer Professor of Law and Aaron Director Research Scholar at the University of Chicago Law School. This talk was recorded on January 6, 2015, as part of the Chicago's Best Ideas lecture series.<img src=\"http://feeds.feedburner.com/~r/UChicagoLawFacultyPodcast/~4/ewWfImZoxUo\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "26677208",
            "sourceUrl": "http://feedproxy.google.com/~r/UChicagoLawFacultyPodcast/~5/rmU7ar25-B8/185111319-uchicagolaw-richard-mcadams-how-law-works-expressively.mp3"
        },
        {
            "title": "Baude, Harel, & McAdams, \"How Should We Interpret our Constitutions?\"",
            "datePublished": "Thu, 04 Dec 2014 19:32:25 +0000",
            "description": "How Should We Interpret our Constitutions? \r\nA Debate between Professors Baude and Harel\r\n\r\nModerated by Professor McAdams\r\n\r\nWilliam Baude is Neubauer Family Assistant Professor of Law at the University of Chicago Law School, where he teaches federal courts and constitutional law. His current research projects include papers on originalism, historical practice in constitutional law, federalism, the Supreme Court, and conflicts of law. His recent publications include \"Rethinking the Federal Eminent Domain Power,\" and \"Beyond DOMA: State Choice of Law in Federal Statutes.\" He also contributes to two legal blogs, the Volokh Conspiracy and SCOTUSBlog.\r\n\r\nAlon Harel is Mizock Professor of Law at the Hebrew University of Jerusalem. He is the author of Why Law Matters (2014) where he argues that (some) legal institutions and legal procedures are valuable and matter as such, irrespective of their instrumental value. His areas of expertise include legal and political theory, criminal law theory, constitutional law theory, human rights, and law and economics.\r\n\r\nRichard H. McAdams is the Bernard D. Meltzer Professor of Law and Aaron Director Research Scholar. He writes on criminal law and procedure, social norms, the expressive function of law, inequality, and law and literature. He is co-editor of the 2013 volume on Fairness in Law and Economics and the author of the forthcoming book, The Expressive Powers of Law. He has served as a member of the National Science Foundation Advisory Panel for Law & Social Sciences, the editorial board of the Annual Review of Law and Social Science, and the Board of Directors of the American Law and Economics Association.\r\n\r\nThis event was sponsored by the American Constitution Society and the Federalist Society and was recorded on November 25, 2014.<img src=\"http://feeds.feedburner.com/~r/UChicagoLawFacultyPodcast/~4/idugM-9pQ6s\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "29449322",
            "sourceUrl": "http://feedproxy.google.com/~r/UChicagoLawFacultyPodcast/~5/2tVRo5LcAyU/179980915-uchicagolaw-baude-harel-mcadams-how-should-we-interpret-our-constitutions.mp3"
        },
        {
            "title": "Adam Chilton, \"Why We Know Very Little About the Effectiveness of International Law\"",
            "datePublished": "Tue, 18 Nov 2014 22:54:48 +0000",
            "description": "While scholars in most fields argue about how laws can be changed to maximize their effectiveness, scholars of international law still regularly debate whether many of the most prominent international agreements have any effect on state behavior. Part of the reason that this foundational question is still being debated is that answering it with observational data has proven to be all but impossible. This talk will explain why research on international law has made so little progress determining whether two core areas of international law—human rights law and the laws of war—help to improve people’s lives, and then will explore how researchers are starting to use experimental methods to gain traction on the topic.\r\n\r\nAdam Chilton is Assistant Professor of Law at the University of Chicago Law School. This talk was recorded on November 4, 2014, as part of the Chicago's Best Ideas lecture series.<img src=\"http://feeds.feedburner.com/~r/UChicagoLawFacultyPodcast/~4/i4k1SNLO40k\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "27692639",
            "sourceUrl": "http://feedproxy.google.com/~r/UChicagoLawFacultyPodcast/~5/rXoR8CzQNEg/177564310-uchicagolaw-adam-chilton-why-we-know-very-little-about-the-effectiveness-of-international-law.mp3"
        },
        {
            "title": "Richard Posner, Empirical Legal Studies Conference keynote",
            "datePublished": "Thu, 13 Nov 2014 16:57:22 +0000",
            "description": "Richard A. Posner, Senior Lecturer in Law and a judge on the Seventh Circuit Court of Appeals, devoted a lunchtime keynote to discussing how judges might receive and view empirical research.\r\n\r\nRichard A. Posner is a Senior Lecturer in Law at the University of Chicago Law School. Following his graduation from Harvard Law School, Judge Posner clerked for Justice William J. Brennan, Jr. From 1963 to 1965, he was assistant to Commissioner Philip Elman of the Federal Trade Commission. For the next two years, he was assistant to the solicitor general of the United States. Prior to going to Stanford Law School in 1968 as Associate Professor, Judge Posner served as general counsel of the President's Task Force on Communications Policy. He first came to the University of Chicago Law School in 1969, and was Lee and Brena Freeman Professor of Law prior to his appointment in 1981 as a judge of the U.S. Court of Appeals for the Seventh Circuit. He was the chief judge of the court from 1993 to 2000.\r\n\r\nThis talk was recorded on October 23, 2014.<img src=\"http://feeds.feedburner.com/~r/UChicagoLawFacultyPodcast/~4/6uoIPfS9fqk\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "22758631",
            "sourceUrl": "http://feedproxy.google.com/~r/UChicagoLawFacultyPodcast/~5/2bX_2AJILPw/176743410-uchicagolaw-richard-posner-empirical-legal-studies-conference-keynote.mp3"
        },
        {
            "title": "Saul Levmore, \"How Does Law Work? Concentration and Distribution Strategies\"",
            "datePublished": "Fri, 07 Nov 2014 17:18:57 +0000",
            "description": "Two of the best ideas of the last half-century describe strategies for using legal remedies to solve social problems. One is the concentration of liability on a well-situated problem solver, or “least cost-avoider,” who can always contract out the work to be done (thus reflecting Chicago’s Very Best and Biggest Idea, the Coase Theorem). But another is the opposite of the first, for it involves the distribution, or spreading, of legal responsibility across many potential problem solvers, who might cooperate or work alone. Comparative negligence and Superfund liability for environmental harms reflect this strategy.  \r\n\r\nThis Chicago’s Best Ideas talk explores this tug-of-war, or evolutionary pattern, involving the two opposing strategies. How does law know which to use? Most important, what is the likely evolution of law as citizens call on Big Government to solve their big problems, like climate change or access to health care, and how does technological change alter the likely balance between these two strategies?\r\n\r\nSaul Levmore is the William B. Graham Distinguished Service Professor of Law at the University of Chicago Law School. This talk was recorded on October 21, 2014, as part of the Chicago's Best Ideas lecture series.<img src=\"http://feeds.feedburner.com/~r/UChicagoLawFacultyPodcast/~4/J6w84q3G1VA\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "27081374",
            "sourceUrl": "http://feedproxy.google.com/~r/UChicagoLawFacultyPodcast/~5/SOSReEPaz_U/175814492-uchicagolaw-saul-levmore-how-does-law-work-concentration-and-distribution-strategies.mp3"
        },
        {
            "title": "Driver, Nou & Strauss, \"Constitutional ​Interpretation ​at ​the ​Roberts ​Court\"",
            "datePublished": "Mon, 13 Oct 2014 19:37:20 +0000",
            "description": "Supreme ​Court ​Preview: ​ Constitutional ​Interpretation ​at ​the ​Roberts ​Court \r\n\r\nHear Professors ​Justin ​Driver, ​Jennifer ​Nou, ​and ​David ​Strauss​discuss ​what ​divides ​the ​current ​Court ​and ​what ​unites ​it. ​Their ​lecture ​will ​be ​followed ​by ​a ​lively ​Q&A ​session ​with ​alumni ​and ​guests ​in ​attendance.\r\n\r\nThis First Monday alumni event was recorded on October 1, 2014 in Washington, DC.<img src=\"http://feeds.feedburner.com/~r/UChicagoLawFacultyPodcast/~4/L7WL116zDF4\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "36152343",
            "sourceUrl": "http://feedproxy.google.com/~r/UChicagoLawFacultyPodcast/~5/P39hZ82wbIM/171984979-uchicagolaw-driver-nou-strauss-constitutional-interpretation-at-the-roberts-court.mp3"
        },
        {
            "title": "Tomiko Brown-Nagin, \"The Honor and Burden of Being First: Judge Constance Baker Motley\"",
            "datePublished": "Thu, 05 Jun 2014 16:14:02 +0000",
            "description": "Professor Brown-Nagin's talk examines the legacy of The Honorable Constance Baker Motley—and break new ground in the study of civil rights, women's rights, and the legal profession. A protégée of Thurgood Marshall, Motley litigated in southern courtrooms during the 1940s and 1950s, when women lawyers scarcely appeared before the bar.  She captivated onlookers who had rarely seen a woman or a black lawyer, much less the extraordinary combination—a black woman lawyer. \r\nIn 1966 Motley then became the first African-American woman appointed to the federal judiciary.  After a long confirmation battle, she ascended to the United States District Court in New York.  In her new post, Motley sometimes ruled as segregationists had feared and as liberals had hoped. Typically, Motley deferred to constraints of the judicial role. Therefore, Professor Brown-Nagin  concludes, Motley's judicial career demonstrates that—more often than not and regardless of who presides—courts preserve hierarchy.  \r\n\r\nTomiko Brown-Nagin is Daniel P.S. Paul Professor of Constitutional Law at Harvard Law School, Professor of History at Harvard Graduate School of Arts & Sciences, and Co-Director, Program in Law and History at Harvard University.\r\n\r\nThis talk, the 2014 Fulton Lecture in Legal History, was recorded on May 8, 2014.<img src=\"http://feeds.feedburner.com/~r/UChicagoLawFacultyPodcast/~4/5oiFpx4BfBw\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "79447770",
            "sourceUrl": "http://feedproxy.google.com/~r/UChicagoLawFacultyPodcast/~5/BB0vw5DSzzw/152967227-uchicagolaw-tomiko-brown-nagin-the-honor.mp3"
        },
        {
            "title": "M. Todd Henderson, \"Do Judges Follow the Law?\"",
            "datePublished": "Tue, 03 Jun 2014 16:27:40 +0000",
            "description": "In a naïve model of judging, Congress writes statutes, which courts know about and then slavishly apply. But a Chicago lawyer might doubt this model, believing judges are maximizing something other than compliance with the law. In this CBI, Professor Henderson examines judicial compliance with a mandatory Congressional command, and uses it to offer a richer and more nuanced model of judicial behavior.\r\n\r\nM. Todd Henderson is Professor of Law and Aaron Director Teaching Scholar at the University of Chicago Law School. This talk was recorded on April 15, 2014, as part of the Chicago's Best Ideas lecture series.<img src=\"http://feeds.feedburner.com/~r/UChicagoLawFacultyPodcast/~4/Xb7AJa2392o\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "62016364",
            "sourceUrl": "http://feedproxy.google.com/~r/UChicagoLawFacultyPodcast/~5/mXqp-TGTYHI/152631465-uchicagolaw-m-todd-henderson-do-judges.mp3"
        },
        {
            "title": "A Fireside Chat with David Sacks '98, Founder and CEO of Yammer",
            "datePublished": "Thu, 29 May 2014 21:52:49 +0000",
            "description": "Professor Todd Henderson leads an engaging discussion with Yammer Founder and CEO, David Sacks. \r\n\r\nDavid has been involved in the Internet space more than 10 years as an entrepreneur, executive and investor, starting with PayPal in 1999. He was PayPal's chief operating officer and product leader, taking the company from startup to IPO and eventual sale to eBay for $1.5 billion. Subsequently, he founded Geni.com, a genealogy website that enables millions of family members to collaboratively build an online family tree. Geni was acquired by MyHeritage in 2012. He also produced and financed the movie \"Thank You For Smoking.\" Also in 2012, David sold Yammer to Microsoft for $1.2 billion.\r\nDavid holds a B.A. in Economics from Stanford University and a J.D. from the University of Chicago Law School.\r\n\r\nThis talk was recorded on May 2, 2014.<img src=\"http://feeds.feedburner.com/~r/UChicagoLawFacultyPodcast/~4/F74AN6mfpEU\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "65481246",
            "sourceUrl": "http://feedproxy.google.com/~r/UChicagoLawFacultyPodcast/~5/T2ICAL8YfFI/151908178-uchicagolaw-a-fireside-chat-with-david.mp3"
        },
        {
            "title": "Laws Prohibiting Sex-Selective Abortion in the United States",
            "datePublished": "Tue, 20 May 2014 22:21:03 +0000",
            "description": "As part of the anti-abortion movement's legislative campaign, seven states have passed bans on sex-selective abortion and many more are pending, including in Congress. Advocates of the bans argue that they are needed to prevent widespread elimination of female fetuses by Asians in the United States. They argue that the United States is contributing to the global pandemic of \"missing women\" and that sex-selective abortion must be banned to promote women's equality. Opponents of these bills point out that they are a \"wolf in sheep's clothes\" couched in the language of women's equality, but restricting women's autonomy and unfairly stigmatizing minorities.\r\n\r\nStudents in the International Human Rights Clinic at the University of Chicago Law School have been working with economists and the National Asian Pacific Women's Forum to draft a report that will bring empirical data to bear on these policy debates.\r\n\r\nThis panel was recorded on April 24, 2014 and was sponsored by: International Human Rights Clinic, Law Students for Reproductive Justice (LSRJ), Asian Pacific Law Students Association (APALSA), and South Asian Law Students Association (SALSA).\r\n\r\nPanelists included Sital Kalantry (UChicago Law), Sujatha Jesudason (University of California, San Francisco), Arindam Nandi (Center for Disease Dynamics, Economics and Policy), Alexander Persaud (University of Michigan), Kelsey Stricker (3L), Miriam Yeung (NAPAWF), and Brian Citro (UChicago Law).<img src=\"http://feeds.feedburner.com/~r/UChicagoLawFacultyPodcast/~4/4OxSZ4C8p0A\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "45638573",
            "sourceUrl": "http://feedproxy.google.com/~r/UChicagoLawFacultyPodcast/~5/rk0WS8flA8o/150486792-uchicagolaw-laws-prohibiting-sex-selective.mp3"
        },
        {
            "title": "R.H. Helmholz, \"Magna Carta: A European Perspective\"",
            "datePublished": "Thu, 15 May 2014 18:48:02 +0000",
            "description": "This talk was recorded on April 25, 2014, as the Law School's annual Loop Luncheon.<img src=\"http://feeds.feedburner.com/~r/UChicagoLawFacultyPodcast/~4/D5Wc65q_Ocg\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "41057383",
            "sourceUrl": "http://feedproxy.google.com/~r/UChicagoLawFacultyPodcast/~5/b5zNwK4qVio/149705786-uchicagolaw-r-h-helmholz-magna-carta-a.mp3"
        },
        {
            "title": "David Strauss, \"Does the Constitution Always Mean What It Says?\"",
            "datePublished": "Tue, 13 May 2014 16:28:18 +0000",
            "description": "The U.S. Constitution is \"the supreme Law of the Land.\" Of course some of its provisions are vague and must be interpreted. But when the Constitution says something clearly, we follow it. Don't we?\r\n\r\nActually things are not that simple. There are several important examples of clear language in the Constitution that we do not follow. (For an example, look at the first word of the First Amendment.) Sometimes, in fact, it would be essentially unthinkable to follow themost obvious meaning of apparently clear language.\r\n\r\nThese are not just slips of the pen by the Framers of the Constitution.Things are more interesting than that: the Framers made deliberate choices that we do not always accept, even though those choices are reflected in the text. The ways in which we ignore apparently clear language in the Constitution can teach us a lot about how American constitutional law actually works.\r\n\r\nThis talk was recorded on February 26, 2014, as part of the Chicago's Best Ideas Lecture Series. David Strauss is Gerald Ratner Distinguished Service Professor of Law at the University of Chicago Law School.<img src=\"http://feeds.feedburner.com/~r/UChicagoLawFacultyPodcast/~4/x48K8xS1-rw\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "54007848",
            "sourceUrl": "http://feedproxy.google.com/~r/UChicagoLawFacultyPodcast/~5/Tl769CrvNkE/149344142-uchicagolaw-david-strauss-does-the.mp3"
        },
        {
            "title": "Richard McAdams, \"The Expressive Powers of Law\"",
            "datePublished": "Thu, 08 May 2014 18:13:12 +0000",
            "description": "Economics explains legal compliance via sanctions, particularly by the ability of legal sanctions to change the cost of behavior and deter noncompliance. Yet rational choice tools predict other ways in which law influences behavior: by suggesting a means of coordination and by informing beliefs. First, when people seek to order their behavior with others, law provides a salient means of coordinating. Second, law reveals information about risks and attitudes, which prompts individuals to update their beliefs and alter their behavior. The coordination and information powers are law's expressive powers, as distinguished from its coercive powers. They explain the law's sometimes puzzling efficacy, such as when tribunals are able to arbitrate disputes without the power of sanctions or legitimacy.\r\n\r\nRichard McAdams is Bernard D. Meltzer Professor of Law and Aaron Director Research Scholar at the University of Chicago Law School. This talk, the 2014 Coase Lecture in Law and Economics, was recorded on April 15, 2014.<img src=\"http://feeds.feedburner.com/~r/UChicagoLawFacultyPodcast/~4/hM3MJYwBQXE\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "109107773",
            "sourceUrl": "http://feedproxy.google.com/~r/UChicagoLawFacultyPodcast/~5/gnFSdIJd6DA/148552502-uchicagolaw-richard-mcadams-the-expressive.mp3"
        },
        {
            "title": "Lior Strahilevitz, \"Personalizing Default Rules and Disclosure with Big Data\"",
            "datePublished": "Thu, 24 Apr 2014 19:59:35 +0000",
            "description": "The laws of intestacy are the same for men and women even though preferences for how one's estate should be divided differ by gender. Peanut-allergic octogenarian men and gluten-allergic pregnant women see the same warnings on consumer products even though they are interested in seeing information that is much better tailored to them. Companies have made enormous strides in studying and classifying groups of consumers, and yet almost none of this information is put to use by providing consumers with contractual default terms or disclosures that are tailored to their preferences and attributes. This lecture will explore the costs and benefits of personalizing various parts of American law and business practices. This talk was recorded on April 7, 2014. Lior Strahilevitz is Sidley Austin Professor of Law at the University of Chicago Law School.<img src=\"http://feeds.feedburner.com/~r/UChicagoLawFacultyPodcast/~4/1cY6ki9lSpE\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "47178395",
            "sourceUrl": "http://feedproxy.google.com/~r/UChicagoLawFacultyPodcast/~5/LUNO389Y7zU/146303122-uchicagolaw-lior-strahilevitz.mp3"
        },
        {
            "title": "Barbara Herman, \"The Moral Side of Non-Negligence\"",
            "datePublished": "Thu, 10 Apr 2014 21:47:18 +0000",
            "description": "Legal discussions of negligence focus on issues of harm, fault, and remedy in the context of failure to exercise reasonable care.  The point of orientation is the negligent event.  In this talk I want to investigate a related moral duty, the duty of due care.  Its orientation is ex ante; it is an imperfect duty that ranges across private and public morality; its content is not restricted to injury and loss.  The wrongful failure of due care need not increase the risk of a negligent event.  An agent acting negligently in the moral sense has failed to take on the full burden of some other duty.  The argument for this view of due care will lend support to three more general theses: about the nature and importance of imperfect duties, about the primacy of non-negligence, and about the rationale for different schemes of remedy on the legal side.\r\n\r\nBarbara Herman is Griffin Professor of Philosophy and Professor of Law at UCLA. This talk was recorded on February 26, 2014, as the Dewey Lecture in Law and Philosophy.<img src=\"http://feeds.feedburner.com/~r/UChicagoLawFacultyPodcast/~4/UGafblOOZCk\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "96943959",
            "sourceUrl": "http://feedproxy.google.com/~r/UChicagoLawFacultyPodcast/~5/vXX2ihkTYqo/144101709-uchicagolaw-barbara-herman-the-moral-side.mp3"
        },
        {
            "title": "Tom Ginsburg, Jonathan Masur, and Richard McAdams, \"Temporary Law: The Case of Smoking Bans\"",
            "datePublished": "Thu, 27 Mar 2014 19:30:36 +0000",
            "description": "Libertarians often assert that regulation is unnecessary because the market will meet any existing consumer demand.  The issue of smoking in bars is a paradigmatic context in which this argument arises.  Libertarians argue that bar patrons (and employees) are free to patronize or work in whichever bars they choose.  Accordingly, if workers or patrons want smoke-free bars, the market will provide smoke-free bars.  For the libertarian, the fact that nearly every bar in every city allowed smoking prior to the enactment of smoking bans is proof that this is what employees and patrons really want.  The market equilibrium is the efficient equilibrium.\r\n\r\nOur work calls this conclusion into question.  We suggest that in many contexts there are many possible equilibria, not just one equilibrium.  The fact that we live in one equilibrium rather than another might be merely a product of path dependence.  For instance, the vast majority of bars might allow smoking (absent smoking bans) simply because behavior has evolved from a time when smoking was always allowed and not even viewed as harmful.  If smoking had been banned until recently, and then the ban were repealed, a very different equilibrium might have emerged.\r\n\r\nIf this is the case, then what follows?  The recent wave of behavioral economics has led some theorists to advocate the possibility of \"libertarian paternalism,\" where regulators designing institutions permit significant individual choice but nonetheless use default rules to \"nudge\" individuals toward informed or salutary choices.  Here, we propose a type of libertarian paternalist intervention aimed directly at the question of multiple equilibria: temporary law.  If an equilibrium exists only because of path dependence, there is no need for a permanent restriction on liberty.  A state or city could simply pass a temporary law, allow the law to expire, and then examine the state of affairs that emerges.  We thus propose imagining regulations that include an expiration date, and we will describe the many advantages of that approach. \r\n\r\nThis talk was recorded on February 25, 2014. Tom Ginsburg is Leo Spitz Professor of International Law, Ludwig and Hilde Wolf Research Scholar and Professor of Political Science at the University of Chicago Law School. Jonathan Masur is Deputy Dean and Professor of Law at the University of Chicago Law School. Richard McAdams is Bernard D. Meltzer Professor of Law and Aaron Director Research Scholar at the University of Chicago Law School.<img src=\"http://feeds.feedburner.com/~r/UChicagoLawFacultyPodcast/~4/ds935LzlaZA\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "60449853",
            "sourceUrl": "http://feedproxy.google.com/~r/UChicagoLawFacultyPodcast/~5/w0YRTfVaEc8/141734920-uchicagolaw-tom-ginsburg-jonathan-masur.mp3"
        },
        {
            "title": "Emily Buss, \"Court Reform in the Juvenile Justice System\"",
            "datePublished": "Thu, 13 Mar 2014 18:32:04 +0000",
            "description": "Over 100 years ago, Chicago led the way in establishing separate courts for young people who committed crimes.  These Juvenile Courts, soon in operation in every state, had two interrelated aims:  The first was to separate adolescent offenders from adult criminals.  The second aim was to help young offenders to grow up to become law-abiding citizens, although we knew much less than we thought we did about how to do this.  In recent years, we have learned a great deal from psychologists and brain scientists about how young people develop and what affects that development, and that knowledge has increasingly been reflected in law and practice within the juvenile justice system.  These insights have not, however, been brought to bear on the court process itself.  The focus of my research is on young people's experience with the court process, and how that experience can foster or impair their development.\r\n\r\nA substantial body of social science focused on adults suggests that their experience in court had an important impact on their attitude about the law, generally, and their obligation to obey the law.  Stated very simply, if adults believe they have been shown respect in court and have had an opportunity to participate meaningfully in a fair process, they are more likely to think of the law and law enforcement as legitimate, and are more likely to feel obligated to obey the law.  Our understanding of child development, in general, and children's social development, in particular, predict that these \"procedural justice\" effects should be even stronger in children, and the limited studies looking at this effect, to date, offer some support for this prediction. If a court experience can have any developmental impact on young people, however, we should be very concerned about young people's current experience in juvenile court.  Even in courtrooms filled with conscientious professionals, the juvenile court process conveys a disregard for young people and prevents their meaningful engagement in a process purportedly designed to address their needs.  I bring together the optimism created by the procedural justice literature with a pessimistic portrayal of the current juvenile court process to argue for some experimentation with substantial reforms.\r\n\r\nEmily Buss is Mark and Barbara Fried Professor of Law at the University of Chicago Law School. This talk was recorded February 28, 2014, as part of the Chicago's Best Ideas lecture series.<img src=\"http://feeds.feedburner.com/~r/UChicagoLawFacultyPodcast/~4/35jVS66Hirw\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "51741256",
            "sourceUrl": "http://feedproxy.google.com/~r/UChicagoLawFacultyPodcast/~5/LGEkSAskOaw/139412483-uchicagolaw-emily-buss-court-reform-in-the.mp3"
        },
        {
            "title": "Geoffrey Stone, \"The President's Review Group on NSA Surveillance\"",
            "datePublished": "Thu, 27 Feb 2014 19:39:46 +0000",
            "description": "Edward H. Levi Distinguished Service Professor Geoffrey Stone talks about his involvement in the President's Review Group on Intelligence and Communications Technology. Organized by the Office of the Dean of Students and recorded on February 4, 2014.<img src=\"http://feeds.feedburner.com/~r/UChicagoLawFacultyPodcast/~4/k9S19VZ-5Ow\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "64803734",
            "sourceUrl": "http://feedproxy.google.com/~r/UChicagoLawFacultyPodcast/~5/XC6jq2qTpN0/137076105-uchicagolaw-geoffrey-stone-the-presidents.mp3"
        },
        {
            "title": "Martha Nussbaum, \"What Is Anger, and Why Should We Care?\"",
            "datePublished": "Thu, 20 Feb 2014 18:36:05 +0000",
            "description": "\"Although everyone is familiar with the damage anger can do in both personal and public life, people tend to think that it is necessary for the pursuit of justice.  People who don't get angry when they are wronged seem weird to many people, lacking spine and self-respect.  And isn't it servile not to react with anger to great injustice, whether toward oneself or toward others?  On the other hand, recent years have seen three noble and successful freedom movements conducted in a spirit of non-anger: those of Mohandas Gandhi, Martin Luther King, Jr., and Nelson Mandela -- surely people who stood up for their self-respect and that of others, and who did not acquiesce in injustice.  My lecture argues that a close philosophical analysis of the emotion of anger can help us to see why it is fatally flawed from a normative viewpoint -- sometimes incoherent and sometimes based on bad values. In either case it is of dubious value in both life and the law.  I'll present my general view, and then show its relevance to thinking well about the criminal law and about transformational justice.\"\r\n\r\nMartha Nussbaum is Ernst Freund Distinguished Service Professor of Law and Ethics at the University of Chicago Law School. This talk was recorded January 14, 2014 as part of the Chicago's Best Ideas lecture series.<img src=\"http://feeds.feedburner.com/~r/UChicagoLawFacultyPodcast/~4/cGylddoYnGA\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "62724805",
            "sourceUrl": "http://feedproxy.google.com/~r/UChicagoLawFacultyPodcast/~5/WPx_uQ-JiUI/135858685-uchicagolaw-martha-nussbaum-what-is-anger.mp3"
        },
        {
            "title": "Brian Leiter, \"Why Tolerate Religion?\"",
            "datePublished": "Thu, 20 Feb 2014 18:06:22 +0000",
            "description": "Is there a principled reason why religious obligations that conflict with the law are accorded special toleration while other obligations of conscience are not? In Why Tolerate Religion? (Princeton, 2013), Professor Leiter argues there are no good reasons for doing so, that the reasons for tolerating religion are not specific to religion but apply to all claims of conscience. He also argues that a government committed to liberty of conscience is not required by the principal of toleration to grant burden-shifting exemptions to laws that promote the general welfare.\r\n\r\nBrian Leiter is Karl N. Llewellyn Professor of Jurisprudence and Director, Center for Law, Philosophy, and Human Values at the University of Chicago Law School.\r\n\r\nThis talk was recorded on November 19, 2013, as part of the Chicago's Best Ideas lecture series.<img src=\"http://feeds.feedburner.com/~r/UChicagoLawFacultyPodcast/~4/TnG3Uhn4Yew\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "54806150",
            "sourceUrl": "http://feedproxy.google.com/~r/UChicagoLawFacultyPodcast/~5/ljprJ6NLWIE/135853963-uchicagolaw-leiter111913.mp3"
        },
        {
            "title": "Nicholas Stephanopoulos, \"The South After Shelby County\"",
            "datePublished": "Thu, 20 Feb 2014 17:07:26 +0000",
            "description": "In Shelby County v. Holder, the Supreme Court dismantled one of the two pillars of the Voting Rights Act: Section 5, which had barred southern jurisdictions from changing their election laws unless they first received federal approval. The burning question now is what will happen to minority representation in the South in the absence of Section 5. In this talk, Prof. Stephanopoulos explores the differences between the defunct Section 5 and Section 2 of the VRA, which continues to apply nationwide. His sobering conclusion is that Section 2 provides substantially less protection with respect to both redistricting and franchise restrictions. The demise of Section 5 is therefore likely to reverse decades of progress for voting rights in the South.\r\n\r\nNicholas Stephanopoulos is Assistant Professor of Law at the University of Chicago Law School. This Chicago's Best Ideas talk was recorded on November 13, 2013.<img src=\"http://feeds.feedburner.com/~r/UChicagoLawFacultyPodcast/~4/RVL1WA3Xjkc\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "50841808",
            "sourceUrl": "http://feedproxy.google.com/~r/UChicagoLawFacultyPodcast/~5/bmT5WV5HB3E/135845101-uchicagolaw-nicholas-stephanopoulos-the-1.mp3"
        },
        {
            "title": "Panel on \"Reconstructing Contracts: The Contracts Scholarship of Douglas Baird\"",
            "datePublished": "Thu, 20 Feb 2014 16:49:13 +0000",
            "description": "A panel of leading scholars discuss Douglas Baird's pathbreaking work on Contract Law published in his new book Reconstructing Contracts.\r\n\r\nAvery Katz, Vice Dean and Milton Handler Professor of Law, Columbia Law School\r\nStewart Macaulay, Malcolm Pitman Sharp Professor & Theodore W. Brazeau Professor, University of Wisconsin Madison Law School\r\nAriel Porat, The Alain Poher Chair in Private Law, Faculty of Law, Tel Aviv University\r\nModerated by Omri Ben-Shahar, Leo and Eileen Herzel Professor of Law and Economics and Kearney Director of the Coase-Sandor Institute for Law & Economics, University of Chicago Law School.\r\n\r\nThis panel was recorded on October 23, 2013.<img src=\"http://feeds.feedburner.com/~r/UChicagoLawFacultyPodcast/~4/dBeqrvgTb84\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "62894914",
            "sourceUrl": "http://feedproxy.google.com/~r/UChicagoLawFacultyPodcast/~5/6NggXKMmKIM/135842502-uchicagolaw-panel-on-reconstructing.mp3"
        },
        {
            "title": "Crime in Law and Literature Conference Plenary Talk and Panel, featuring Scott Turow",
            "datePublished": "Wed, 12 Feb 2014 21:21:00 +0000",
            "description": "Recorded on February 7, 2014, at the University of Chicago Law School, this session featured author Scott Turow as Plenary Speaker and Law School faculty Alison LaCroix, Judge Diane Wood, and Richard McAdams.<img src=\"http://feeds.feedburner.com/~r/UChicagoLawFacultyPodcast/~4/cTWaWOv48RM\" height=\"1\" width=\"1\" alt=\"\"/>",
            "length": "76158431",
            "sourceUrl": "http://feedproxy.google.com/~r/UChicagoLawFacultyPodcast/~5/XfXkxi1KwqQ/134479661-uchicagolaw-turow020714.mp3"
        }
    ]
}