{
    "artwork": "http://is4.mzstatic.com/image/thumb/Music91/v4/7c/58/6e/7c586e15-3cc8-47c2-146f-847ad70a7092/source/100x100bb.jpg",
    "description": "A weekly news show where your favorite Engadget editors tear themselves away from their crippling technology addiction, to discuss our collective crippling technology addiction.",
    "feedURL": "http://feeds.soundcloud.com/users/soundcloud:users:245220958/sounds.rss",
    "podcastURL": "https://www.engadget.com/",
    "title": "The Engadget Podcast",
    "episodes": [
        {
            "title": "Xbox Series X and S Reviews! Tech on the Ballot!",
            "datePublished": "Fri, 06 Nov 2020 12:29:59 +0000",
            "description": "This week, Devindra and Jessica Conditt dive deep into their Xbox Series X and S reviews. Do Microsoft’s next-gen systems live up to the hype? Also, Tech on the Ballot! A few important tech-related ballot initiatives were decided in California, Massachusetts, and Maine.\n\nXbox Series X and S: The Full Review – 1:42\nTech on the Ballot – 30:21\nWorking On – 41:36\nPicks – 43:16",
            "length": "45296092",
            "sourceUrl": "http://media.blubrry.com/the_engadget/http://feeds.soundcloud.com/stream/924186037-engadget-podcast-xbox-series-x-and-s-reviews-tech-on-the-ballot.mp3"
        },
        {
            "title": "PS5 vs Xbox Series X Early Impressions",
            "datePublished": "Fri, 30 Oct 2020 11:30:04 +0000",
            "description": "This week, Devindra and Cherlynn are joined by Jess Conditt to talk about both new consoles -- well, as much as they can say anyway. Jess chats about her PlayStation 5 preview, and we can finally compare it to the Xbox Series X and S final hardware. Also, they dive into what’s up with AMD and NVIDIA’s latest GPUs, the RTX 3070 and Radeon RX 6000 series.\n\nPS5 vs. Xbox Series S: case and controller overview – 1:41\nOther gaming news (RTX 3070, switch game streaming) – 21:51\nSocial media takes steps against US election misinformation – 27:45\nWorking on – 36:42\nListener mail – 44:10\nOur favorite dead gadgets – 48:36\nPicks – 56:09",
            "length": "62176618",
            "sourceUrl": "http://media.blubrry.com/the_engadget/http://feeds.soundcloud.com/stream/920111407-engadget-podcast-ps5-vs-xbox-series-x-early-impressions.mp3"
        },
        {
            "title": "iPhone 12 and 12 Pro review: Are they worth it?",
            "datePublished": "Fri, 23 Oct 2020 11:30:06 +0000",
            "description": "This week, Devindra chats with Senior Mobile Editor Chris Velazco about his iPhone 12 and 12 Pro reviews. Do they live up to the hype? Are they a decent upgrade over last year? And does 5G matter? Also, they dive into Alexandria Ocasio-Cortez’s brilliant Among Us Twitch stream, as well as the (wholly unsurprising) death of Quibi\n\nDo you really need to upgrade to an iPhone 12? – 1:46\nTwitch might be the new frontier for political promotion – 35:56\nRIP Quibi, Lifespan: Six Months – 45:44\nWorking On – 56:09\nPicks – 59:04",
            "length": "61794136",
            "sourceUrl": "http://media.blubrry.com/the_engadget/http://feeds.soundcloud.com/stream/916375490-engadget-podcast-iphone-12-and-12-pro-review-are-they-worth-it.mp3"
        },
        {
            "title": "iPhone 12, Pixel reviews and Xbox Series X preview",
            "datePublished": "Fri, 16 Oct 2020 11:30:04 +0000",
            "description": "It’s been a hardware-heavy week, with Apple’s iPhone 12 event delivering four new iPhones to gawk at. Devindra and Cherlynn take a look at some of the more controversial and outstanding discussions about Apple’s latest and greatest. Then, we talk about Cherlynn’s experience reviewing the Pixel 4a 5G and Pixel 5, and Jessica Conditt joins our hosts to talk about the Xbox Series X after having spent three weeks with the console.\n\nApple finally unveils the iPhone 12 (pro and mini, too!) – 1:23\nFinal review of the Pixel 5 and 4a5G – 28:06\nXbox Series X and S preview with Jess Conditt – 45:02\nWorking On – 59:21\nPicks – 1:05:10",
            "length": "69595411",
            "sourceUrl": "http://media.blubrry.com/the_engadget/http://feeds.soundcloud.com/stream/911402203-engadget-podcast-iphone-12-event-pixel-reviews-and-xbox-series-x-preview.mp3"
        },
        {
            "title": "Bill Nye discusses VR learning, science and climate change",
            "datePublished": "Fri, 09 Oct 2020 11:30:07 +0000",
            "description": "The legendary Bill Nye joins our hosts Cherlynn and Devindra on this week’s episode to discuss his new VR Science Kit, as well as climate change, the postal service and the Trump administration’s stance on science. “Uncle Bill,” as we’re allowed to call him (sparingly) also talked about TikTok as a learning platform and the internet as a public service. Then, commerce editor Valentina Palladino shares some advice on how to prepare for Amazon’s upcoming Prime Day on October 13th and 14th.\n\nBill Nye (The Science Guy!) joins us to talk about VR learning, science leadership, and climate change – 1:05\n\nA Prime Day primer with commerce editor Valentina Palladino – 23:24\n\nWorking On – 36:08\n\nPicks – 41:22",
            "length": "49201931",
            "sourceUrl": "http://media.blubrry.com/the_engadget/http://feeds.soundcloud.com/stream/907483789-engadget-podcast-bill-nye-discusses-vr-learning-science-and-climate-change.mp3"
        },
        {
            "title": "Google Pixel 5, Surface Laptop Go and our iOS 14 review",
            "datePublished": "Fri, 02 Oct 2020 11:30:07 +0000",
            "description": "Google’s finally shown off the Pixel 5, and people are not too impressed. At its Launch Night In event this week, the company revealed details on its latest phones as well as the new Chromecast and Nest Audio speaker. Not to be outdone, Microsoft dropped some new Surface news the next morning, launching the Surface Laptop Go and updated Surface Pro X. Cherlynn and UK bureau chief Mat Smith break down all the news on this week’s podcast, before going over some takeaways from our iOS 14 review.\n\nGoogle unveils its Pixel 5 and Pixel 4a5G – 1:39\nNew Chromecast – 18:24\nNest Audio – 25:22\nLaptop Go and Surface Pro X from Microsoft – 34:00\nMat Smith’s iOS 14 review – 43:03\nWorking On – 59:19\nPicks – 1:01:47",
            "length": "49448838",
            "sourceUrl": "http://media.blubrry.com/the_engadget/http://feeds.soundcloud.com/stream/903166861-engadget-podcast-google-pixel-5-surface-laptop-go-and-our-ios-14-review.mp3"
        },
        {
            "title": "Microsoft buys Bethesda! And we review the Apple Watch SE",
            "datePublished": "Fri, 25 Sep 2020 11:30:04 +0000",
            "description": "This week, Devindra and Cherlynn dive into Microsoft’s massive (and surprising!) acquisition of Bethesda, and all of the other ZeniMax Media studios. Also, Cherlynn dives into her experience with the Apple Watch SE — is it enough to tempt her away from Android? \n\nMicrosoft shakes the gaming industry with huge studio buy – 1:42\nTikTok is now partly owned by Oracle and [checks notes] …Walmart? – 13:51\nApple Watch SE in depth review – 17:39\nSamsung Unpacked (Fan Edition) – 33:29\nBaseless speculation on the Amazon product event – 40:31\nWorking On – 44:19\nPicks – 46:51",
            "length": "39430665",
            "sourceUrl": "http://media.blubrry.com/the_engadget/http://feeds.soundcloud.com/stream/899184982-engadget-podcast-micsoft-and-bethesda-deal-apple-watch-se-in-depth.mp3"
        },
        {
            "title": "Apple Watch Series 6, Oculus Quest 2, RTX 3080 and more!",
            "datePublished": "Fri, 18 Sep 2020 11:30:08 +0000",
            "description": "This week, it’s (almost) all about Apple as Cherlynn and Devindra are joined by Valentina Palladino to dive into Apple’s event on Tuesday. Is the new Apple Watch Series 6 impressive? Is $279 for the Watch SE a good price? Then, Devindra tells us about his review of the Oculus Quest 2 and NVIDIA’s RTX 3080. Then, we look at the crazy LG Wing before catching you up on the flood of news in tech this week.\n\nThere was an Apple event, but no iPhones (yet) – 1:50\nApple Watch Series 6 (and Watch SE and Fitness +) – 5:25\niPads 8 get and Air – 30:11\nOculus Quest 2 Review – 39:27\nOther news: PS5 price announced, LG Wing – 51:58\nWorking On/RTX 3080 review preview – 1:03:49\nPicks – 1:10:04",
            "length": "56315386",
            "sourceUrl": "http://media.blubrry.com/the_engadget/http://feeds.soundcloud.com/stream/895210870-engadget-podcast-apple-watch-series-6-oculus-quest-2-rtx-3080-and-more.mp3"
        },
        {
            "title": "Surface Duo review, Xbox Series S and Apple's upcoming event",
            "datePublished": "Fri, 11 Sep 2020 11:30:03 +0000",
            "description": "The Surface Duo reviews are in and the verdict is a resounding meh. Devindra and Cherlynn talk about what excited them about Microsoft’s dual-screen debut, and explain why using it in the real world was frustrating. Then, UK bureau chief Mat Smith joins our hosts to discuss the Xbox Series S and X versus Sony’s Playstation options, as well as what Apple might have in store for the September 15th event it announced this week.\n\nFinally, we can talk about what the Microsoft Duo is actually like – 1:38\nXbox Series S, what a surprise – 24:09\nA timely Apple announcement – 40:30\nWorking On – 50:44\nPicks – 54:01",
            "length": "44029898",
            "sourceUrl": "http://media.blubrry.com/the_engadget/http://feeds.soundcloud.com/stream/891314371-engadget-podcast-surface-duo-review-xbox-series-s-and-apples-upcoming-event.mp3"
        },
        {
            "title": "Galaxy Z Fold 2, NVIDIA RTX 3000 and Intel's 11th-gen CPUs",
            "datePublished": "Fri, 04 Sep 2020 11:30:00 +0000",
            "description": "As if Samsung unveiling the Z Fold 2 plus an NVIDIA event weren’t enough to keep us busy this week, we also got a slew of news from companies all over the consumer electronics industry thanks to IFA 2020. Cherlynn and Devindra are joined by senior mobile editor Chris Velazco to discuss his impressions of the Galaxy Z Fold 2 after spending a day and a half with it. Then, our hosts geek out over NVIDIA and Intel’s latest processors, before blazing through the plethora of IFA news from companies like TCL, Qualcomm, Lenovo and Samsung (again).\n\nGalaxy Z Fold 2 first impression – 1:40\nNVIDIA makes a huge step forward – 23:17\nDispatch from Intel – 29:05\nSo many new things at IFA – 37:05\nWorking On – 56:51\nPicks – 58:54",
            "length": "47830085",
            "sourceUrl": "http://media.blubrry.com/the_engadget/http://feeds.soundcloud.com/stream/887174128-engadget-podcast-galaxy-z-fold-2-nvidia-rtx-3000-and-intels-11th-gen-cpus.mp3"
        },
        {
            "title": "Galaxy Note 20 Ultra Review + Fortnite v. Apple",
            "datePublished": "Fri, 21 Aug 2020 11:30:05 +0000",
            "description": "This week, Cherlynn and Devindra chat about what it’s like to live with the Galaxy Note 20 Ultra, plus they dive into Epic’s war with Apple over the App Store. Also, they’ll discuss how Facebook is still trying (and failing) to make Instagram a Tiktok killer.\n\nNotes from the Galaxy Note 20 review – 1:52\nFortnite v. Apple’s app store – 17:34\nOculus will soon require Facebook login – 28:23\nFacebook tries Reels, but can it stand up to TikTok? – 33:12\nWorking On – 39:14\nPicks – 47:26",
            "length": "42030577",
            "sourceUrl": "http://media.blubrry.com/the_engadget/http://feeds.soundcloud.com/stream/879382648-engadget-podcast-galaxy-note-20-ultra-review-fortnite-v-apple.mp3"
        },
        {
            "title": "All about the Surface Duo and Galaxy Watch Active 3",
            "datePublished": "Fri, 14 Aug 2020 11:30:05 +0000",
            "description": "This week was dominated by Microsoft’s Surface Duo news, with the company finally unveiling full details and availability info for its dual-screen device since it was first showed off last year. Cherlynn and Devindra discuss why this is such a compelling product and spell out some concerns that could hold the Duo back. How can Microsoft justify the controversial price tag and is the software any better than previous efforts? Our hosts also take a deeper look at Cherlynn’s experience reviewing the Galaxy Watch Active 3 and provide updates on some Intel and Avatar news that came out this week.",
            "length": "44386617",
            "sourceUrl": "http://media.blubrry.com/the_engadget/http://feeds.soundcloud.com/stream/875493268-engadget-podcast-all-about-the-surface-duo-and-galaxy-watch-active-3.mp3"
        },
        {
            "title": "Samsung! Pixel 4a! A New Gadget Bonanza!",
            "datePublished": "Fri, 07 Aug 2020 11:30:02 +0000",
            "description": "t’s a jam-packed week of news thanks to Samsung’s Galaxy Unpacked event. Cherlynn and Devindra chat about the Galaxy Note (and Ultra!), the Z Fold 2, Tab S7 and S7+, Watch 3 and Buds Live. Whew. And they still find time to go into Cherlynn’s glowing Pixel 4a review, and the crazy Microsoft/Tiktok deal and Trump’s latest attempt to block Chinese companies.\n\nSamsung announces so many things – 2:00\nZFold2 – 6:07\nGalaxy Note 20 – 16:47\nGalaxy Tab – 26:10\nWatch 3 – 35:06\nBuds Live – 40:38\nGoogle’s Pixel 4a might be the best midrange smartphone – 44:01\nApple refreshes the 27-inch iMac – 55:50\nWhite House tries to block Chinese companies/Working on – 59:10\nPop Culture Picks – 1:09:01",
            "length": "55136411",
            "sourceUrl": "http://media.blubrry.com/the_engadget/http://feeds.soundcloud.com/stream/871620634-engadget-podcast-samsung-pixel-4a-a-new-gadget-bonanza.mp3"
        },
        {
            "title": "Big Tech Goes to Washington",
            "datePublished": "Fri, 31 Jul 2020 11:30:06 +0000",
            "description": "This week on the show, Devindra and Cherlynn chat about Facebook, Apple, Google and Amazon’s congressional antitrust hearing. Are they too big to compete fairly? Or is the tech industry being overly criticized? (It’s most likely the former.) Also, we dive into Garmin’s lackluster response to its widespread system outage, Quibi’s surprising Emmy noms, and Tenet’s international opening.\n\nFacebook, Amazon, Apple, and Google Testify in Anti-Trust Hearings – 2:05\nGarmin Gets Hacked, Tries to Play it Cool – 25:46\nQuibi was Nominated for [checks notes] 10 Emmys?? – 31:39\nWorking On – 40:20\nPicks – 44:56",
            "length": "37776464",
            "sourceUrl": "http://media.blubrry.com/the_engadget/http://feeds.soundcloud.com/stream/867540397-engadget-podcast-big-tech-goes-to-washington.mp3"
        },
        {
            "title": "OnePlus Nord and a gaming phone party",
            "datePublished": "Fri, 24 Jul 2020 11:29:59 +0000",
            "description": "This has been a gadget-and-gaming heavy week for Team Engadget, and it’s right in our comfort zone. As Devindra was busy hosting Engadget’s Xbox livestream event, Cherlynn is joined by UK Bureau Chief Mat Smith. They dive into the OnePlus Nord, which was launched this week, and has been hyped up by the company and its fans. The Nord is a return to good affordable phones for OnePlus, and Mat shares his impressions after playing with it for a bit. Our hosts also go over the OnePlus Buds, Xiaomi’s Mi Smart Band 5 (and other products), the ASUS ROG Phone 3 and other gaming phones. And since we’re talking to someone in the UK, we also discuss the differences in attitude towards Chinese-made gadgets in America and Europe.",
            "length": "32635576",
            "sourceUrl": "http://media.blubrry.com/the_engadget/http://feeds.soundcloud.com/stream/863511379-engadget-podcast-oneplus-nord-and-a-gaming-phone-party.mp3"
        },
        {
            "title": "Understanding Windows on ARM and Apple Silicon",
            "datePublished": "Fri, 17 Jul 2020 11:30:00 +0000",
            "description": "After Cherlynn’s review of the Snapdragon-powered Lenovo Flex 5G laptop was published this week, our hosts decided to take a deeper look at Windows on ARM. Between buggy performance and confusion over app compatibility, there’s a lot to unpack. Then, Devindra and Cherlynn look at Apple Silicon and the challenges that might be in the company’s way as it makes its two-year transition to ARM. Will an ARM-based Macbook be powerful enough for the most demanding users? Then, as usual, we share what we’ve been working on and relaxing with, and offer entertainment recommendations you should check out.\n\nWhat’s up With Wednesday’s Big Twitter Hack? – 1:32\nLenovo Flex 5G/Windows on ARM – 6:51\nWhat Does This Mean for MacOS on ARM? – 23:13\nIn Other News…– 32:39\nWorking On – 39:19\nPicks – 43:37",
            "length": "37312862",
            "sourceUrl": "http://media.blubrry.com/the_engadget/http://feeds.soundcloud.com/stream/859420045-engadget-podcast-understanding-windows-on-arm-and-apple-silicon.mp3"
        },
        {
            "title": "Thunderbolt 4, Snapdragon 865 Plus and Facebook's Latest Mess",
            "datePublished": "Fri, 10 Jul 2020 11:30:04 +0000",
            "description": "We’re back from the July 4th break and we’re ready to dive into some seriously nerdy news. This week, Devindra and Cherlynn chat about Intel’s Thunderbolt 4 standard, and what it means for your next PC. We also dive into Qualcomm’s latest announcements, including the gaming-focused Snapdragon 865 Plus. And finally, we explore why Facebook just can’t seem to do much right these days, especially when it comes to appeasing civil rights groups.\n\nThunderbolt 4 – 5:09\nQualcomm Announces 865 Plus – 14:00\nFacebook Disappoints Ad Boycotters – 28:33\nWorking On – 38:12\nPicks – 45:06",
            "length": "40510892",
            "sourceUrl": "http://media.blubrry.com/the_engadget/http://feeds.soundcloud.com/stream/855343996-engadget-podcast-thunderbolt-4-snapdragon-865-plus-and-facebooks-latest-mess.mp3"
        },
        {
            "title": "WWDC Breakdown and a Health-Tech Check-In",
            "datePublished": "Fri, 26 Jun 2020 11:30:05 +0000",
            "description": "The biggest news event of the week was Apple’s virtual WWDC keynote, during which the company showed off a ton of upcoming features to its various software products. In Devindra’s absence, Cherlynn is joined by Dan Cooper as guest co-host, as well as senior mobile editor Chris Velazco to rip into Apple’s latest updates. From iOS 14 vs Android, to watchOS 7, to macOS and Apple’s transition to ARM chips, there’s plenty to discuss.\n\nThen, our hosts are joined by CNBC’s health and health-tech reporter Chrissy Farr to talk about the latest developments in healthcare and telemedicine. Do wearable companies have the right idea when it comes to developing products for COVID-19? What is Apple’s approach to this burgeoning industry?\n\nThis Was Maybe the Biggest WWDC in Years? – 1:41\nSiri, Maps, and App Clips – 13:38\niPadOS Gets an Update – 24:03\nNew Horizons in Telehealth with CNBC’s Chrissy Farr – 42:17\nCan Wearables Help Predict COVID-19 (Don’t Bet on It) – 45:44",
            "length": "44753366",
            "sourceUrl": "http://media.blubrry.com/the_engadget/http://feeds.soundcloud.com/stream/847073275-engadget-podcast-wwdc-breakdown-and-a-health-tech-check-in.mp3"
        },
        {
            "title": "PlayStation 5 Details and Hesitation Over Facial Recognition",
            "datePublished": "Fri, 19 Jun 2020 11:30:02 +0000",
            "description": "Sony unveiled the PlayStation 5 last week, sharing with the world the console’s design, specs, games and accessories. One question remains in everyone’s mind: How much will it cost? Devindra and Cherlynn are joined by deputy managing editor Nathan Ingraham to discuss this device’s eye-catching appearance, size and speculate how much it will cost. Nate also tells us why The Last Of Us II is a heartbreaking game worth the emotional investment. Then, our hosts take a look at the latest developments in major tech companies’ facial recognition systems, as well as Twitter’s new voice message format.\n\nWe finally know what the PS5 looks like! – 1:10\n…but it’s going to be pretty expensive – 5:13\nGames announced for PS5 (Spiderman, Stray) – 8:05\nNathan Ingraham reviews The Last of Us, Part II – 13:57\nNintendo announces a bunch of Pokemon games – 24:47\nBig tech pauses work on facial recognition – 26:56\nOther News – 33:58\nPicks – 40:43",
            "length": "35144597",
            "sourceUrl": "http://media.blubrry.com/the_engadget/http://feeds.soundcloud.com/stream/842866369-engadget-podcast-playstation-5-details-and-facial-recognition-woes.mp3"
        },
        {
            "title": "Diving into the Android 11 Beta with Florence Ion",
            "datePublished": "Fri, 12 Jun 2020 11:30:00 +0000",
            "description": "It’s all about Android this week as we dive deep into Google’s just-released beta for the upcoming version of its mobile OS. Devindra and Cherlynn are joined by seasoned Android and smart home reporter Florence Ion to discuss their feelings about the preview. What are Bubbles? Is getting more controls and drawers better for organization or is it more clutter? Then, our hosts go over what they’ve been working on, explaining why they are excited for developments in the processor world. As usual, we’ve also got quite a few entertainment recommendations to share.\n\nWhat’s new with the Android 11 beta? – 1:59\nWhat's iOS doing this year? – 28:52\nWorking On – 33:08\nPicks – 43:48",
            "length": "38546036",
            "sourceUrl": "http://media.blubrry.com/the_engadget/http://feeds.soundcloud.com/stream/838643536-engadget-podcast-diving-into-the-android-11-beta.mp3"
        },
        {
            "title": "Twitter and Facebook's Showdown with Trump",
            "datePublished": "Fri, 05 Jun 2020 11:30:08 +0000",
            "description": "What a year this past week has been. While protesters were hitting the streets to combat police violence, most of us were left watching the events unfold on social media. And even without those historic demonstrations, it was a pretty momentous week for Twitter and Facebook, both of which were faced with challenging decisions on handling Donald Trump’s more explosive posts. Devindra and Cherlynn chat with Karissa Bell, Engadget’s Senior Editor focusing on social media, about how Twitter and Facebook approached the occasion very differently.\n\nWhat a Week in Social Media (with Senior Editor Karissa Bell) – 4:17\nPersonal Safety Tools (for protesting and every day) – 38:01\nWorking On – 44:32\nPicks – 54:41",
            "length": "40644411",
            "sourceUrl": "http://media.blubrry.com/the_engadget/http://feeds.soundcloud.com/stream/834413023-engadget-podcast-twitter-and-facebooks-showdown-with-trump.mp3"
        },
        {
            "title": "Why Do People Think 5G Makes Them Sick?",
            "datePublished": "Fri, 29 May 2020 10:30:07 +0000",
            "description": "No, 5G didn’t start the coronavirus pandemic. But that’s not stopping the current wave of conspiracy theories and anti-5G protests. And despite the science saying otherwise, plenty of people are convinced that 5G is actually hurting them. To figure out why, Cherlynn and Devindra chat with Omer van den Bergh, a tenured professor of Health Psychology at the University of Leuven in Belgium. \n\nHe’s extensively researched idiopathic environmental intolerance, genuine physical symptoms that arise when some people encounter electromagnetic fields, chemical substances (like fragrances), and even vibroacoustic sources like wind mills. While tests prove that these factors don’t genuinely cause illnesses, the mere belief that they do is enough to cause physical reactions. Instead of just telling people it’s all in their head, he argues, Western medicine might need to take these symptoms more seriously.\n\nAdditionally, Devindra and Cherlynn discuss the surprisingly confusing launch of HBO Max. It’s basically a rebrand of HBO Now, but somehow HBO managed to bungle it. (And maybe we just have too many streaming services to manage now.)\n\nTimestamps: \nHere’s One Reason Why the 5G Harm Myth Won’t Go Away – 1:02\nInterview with Prof. Omer van den Bergh – 4:17\nHBO Max is Very Confusing – 24:49\nWorking On – 31:00\nPicks – 36:22",
            "length": "30495216",
            "sourceUrl": "http://media.blubrry.com/the_engadget/http://feeds.soundcloud.com/stream/830202190-engadget-podcast-why-people-think-5g-will-hurt-them-and-hbo-max.mp3"
        },
        {
            "title": "Dell's New XPS Laptops and Zocdoc's Telehealth Play",
            "datePublished": "Fri, 15 May 2020 11:30:03 +0000",
            "description": "We’re back to a somewhat regular week of news on this episode of the Engadget Podcast. Devindra and Cherlynn tackle the good and bad of Dell’s new XPS and Alienware laptops, before diving into Zocdoc’s telehealth play and what that could mean for our healthcare infrastructure in the future. We also contemplate the utility of VR meetings and therapy sessions, as well as the appeal of a quirky pair of wireless earbuds promising to tailor audio to the shape of your ears.\n\nDell XPS 15, 17 – 1:18\nAlienware R51 – 6:36\nZocDoc transitions to telehealth – 11:37\nSpatial VR Meetings – 18:08\nNuraloop Headphones – 27:14\nWorking On – 29:11\nPicks – 32:40",
            "length": "26948315",
            "sourceUrl": "http://media.blubrry.com/the_engadget/http://feeds.soundcloud.com/stream/820763182-engadget-podcast-dells-new-xps-laptops-and-zocdocs-telehealth-play.mp3"
        },
        {
            "title": "Microsoft's Surface Bonanza!",
            "datePublished": "Fri, 08 May 2020 11:30:04 +0000",
            "description": "It’s a Microsoft heavy week! This week, Devindra and Cherlynn are joined by Alex Cranz, Gizmodo’s Senior Consumer Tech Editor, to chat about the bevy of new Surface devices. In particular, they explore why the Surface Go 2 and Book 3 are a bit disappointing — it turns out a slight spec bump might not be enough to make them competitive. But hey, at least the Headphones 2 and Earbuds are cheaper than we expected.\n\nSurface Go – 1:56\nSurface Book 3 – 16:05\nSurface Buds/Surface Headphones 2 – 31:47\nListener Mail – 37:53\nWorking On – 42:39\nPicks – 43:53",
            "length": "34743022",
            "sourceUrl": "http://media.blubrry.com/the_engadget/http://feeds.soundcloud.com/stream/815975095-engadget-podcast-microsofts-surface-bonanza.mp3"
        },
        {
            "title": "Reviewing the Pixel Buds and Amazon's 'Upload'",
            "datePublished": "Fri, 01 May 2020 10:30:08 +0000",
            "description": "At long last, the new Pixel Buds are here. Two years after the original’s underwhelming debut, Google finally released its true wireless earbuds this week. Engadget senior news editor (and resident audio expert) Billy Steele joined Cherlynn and Devindra to explain why he called these “a revelation compared to the previous model.” The trio also analyze how Google’s earbuds compare to rivals like the AirPods, Jabra Elite 75t and Sony WF-1000XM3, and Billy highlights what we can expect from true wireless earbuds in 2020.\n\nThen, Devindra and Cherlynn discuss Amazon’s new show Upload, with snippets from a talk with creator Greg Daniels. In short, the comedy series should be a fun, engaging and welcome distraction. Upload premieres today on Prime Video.\n\nPixel Buds: Google’s First True Wireless Headphones – 1:27\nWorking On [MSI GS66, ZenBook Duo coming soon] – 31:41\nUpload Review: An Amazon sitcom from Greg Daniels (The Office, King of the Hill, Parks and Rec) – 33:17",
            "length": "33730220",
            "sourceUrl": "http://media.blubrry.com/the_engadget/http://feeds.soundcloud.com/stream/811008703-engadget-podcast-reviewing-the-pixel-buds-and-amazons-upload.mp3"
        },
        {
            "title": "What the Heck is a Planetary Computer? Microsoft Explains",
            "datePublished": "Fri, 24 Apr 2020 09:30:03 +0000",
            "description": "What if we could track everything happening on Earth in real time? And — even better — what if all of that data was readily accessible? This week, Devindra chats with Lucas Joppa, Microsoft’s Chief Environmental Officer, about the company’s “Planetary Computer” concept, which aims to accomplish just that. Cherlynn also helps break down how other companies like Amazon, Google and Facebook are approaching their own environmental initiatives. While it’s nice to see many tech firms cleaning up their businesses, do they have a moral responsibility to go further?\n\nWhat Even Is a Planetary Computer? – 2:29\nInterview with Microsoft Environmental Officer Lucas Joppa – 3:05\nOther Tech Companies’ Sustainability Efforts – 27:05\nWorking On [MSI GS66, VR Exercise app Supernatural] – 38:55\nPicks – 44:47",
            "length": "36707250",
            "sourceUrl": "http://media.blubrry.com/the_engadget/http://feeds.soundcloud.com/stream/805826974-engadget-podcast-what-the-heck-is-a-planetary-computer-microsoft-explains.mp3"
        },
        {
            "title": "iPhone SE, OnePlus 8 Pro and a Ton of New Phones",
            "datePublished": "Fri, 17 Apr 2020 11:00:43 +0000",
            "description": "Gadget nerds, iPhone diehards and OnePlus fans — lend me your ears. This has been a big week for you. Apple launched a new version of the iPhone SE on Wednesday, while OnePlus unveiled its latest flagships on Tuesday. LG also teased the unexpected name for its upcoming flagship, while Motorola declared April 22nd the day it will show off its first high-end phone in years. \n\nOn this episode, Devindra and Cherlynn are joined by senior mobile editor Chris Velazco to rip into the glorious phone news that’s been bombarding us these past two weeks. Is it time to take OnePlus seriously as a flagship maker? Can LG save itself with a rebranding campaign or should it pivot to making baked goods? We tackle all these searing questions, and recommend some fun entertainment options as always.\n\nStay tuned to the end of the episode for an interview with Nathaniel Halpern, writer and creator of the new show Tales from the Loop, which is available on Amazon’s Prime Video.\n\niPhone SE Returns – 2:14\nOnePlus 8 stands up to the competition – 13:06\nLG Velvet…that name – 22:50\nA Bunch of other phones! – 28:50\nWorking On – 42:20\nPicks – 46:18\nTales from the Loop Interview – 54:27",
            "length": "48581149",
            "sourceUrl": "http://media.blubrry.com/the_engadget/http://feeds.soundcloud.com/stream/800517949-engadget-podcast-iphone-se-oneplus-8-pro-and-a-ton-of-new-phones.mp3"
        },
        {
            "title": "Quibi and a chat with Devs creator Alex Garland",
            "datePublished": "Fri, 10 Apr 2020 11:30:03 +0000",
            "description": "Do you even Quibi, bro? This week, Devindra chats with TechCrunch’s Anthony Ha about Quibi, the mobile video startup from Hollywood producer Jeffrey Katzenberg. Is it any good? (Spoiler: Not really.) And what does it mean for the future of mobile only video? Also, Devindra interviews Alex Garland, the director of Annihilation and Ex Machina, about his new FX series Devs.\n\n2:07 – Quibi is here,  but who is it for and does anyone want it?\n15:58 – Interview with Alex Garland on his new show Devs\n33:20 – Working On\n35:49 – Picks",
            "length": "29631271",
            "sourceUrl": "http://media.blubrry.com/the_engadget/http://feeds.soundcloud.com/stream/795034321-engadget-podcast-quibi-and-alex-garland.mp3"
        },
        {
            "title": "Keeping Fit With Tech at Home",
            "datePublished": "Fri, 03 Apr 2020 09:30:02 +0000",
            "description": "We’re weeks into stay-at-home life, and some of us are atrophying. Devindra and Cherlynn have spent the last few weeks looking into how tech has enabled us to work, get medicine, see doctors, find sanity and sustain our mental health from home. This week, our hosts are joined by our brand new commerce editor Valentina Palladino as we discuss the ways tech can help us keep physically active.\n\nFrom home exercise machines to the best activity trackers to places offering free workout tutorials and streams, Devindra, Cherlynn and Valentina have plenty of tips to offer. We also go over the importance of nutrition and eating well, and some of the tech that can help you in that mission. And as always, we have many great entertainment recommendations for those looking for something fresh to enjoy.",
            "length": "41667875",
            "sourceUrl": "http://media.blubrry.com/the_engadget/http://feeds.soundcloud.com/stream/789660016-engadget-podcast-keeping-fit-with-tech-at-home.mp3"
        },
        {
            "title": "Half-Life: Alyx Devs On the Leap Into VR",
            "datePublished": "Mon, 30 Mar 2020 17:00:32 +0000",
            "description": "Half-Life is back! In this episode, Devindra chats with Valve's Kerry Davis and Dario Casali about developing Half-Life: Alyx, and their approach to bringing the beloved franchise into virtual reality.",
            "length": "18489664",
            "sourceUrl": "http://media.blubrry.com/the_engadget/http://feeds.soundcloud.com/stream/784865554-engadget-podcast-kerry-davis-and-dario-casali-on-developing-half-life-alyx.mp3"
        },
        {
            "title": "How games (and Animal Crossing!) are keeping us sane",
            "datePublished": "Fri, 27 Mar 2020 09:30:02 +0000",
            "description": "This week on the show, Devindra and Cherlynn dive into the deserted island life of Animal Crossing and how games can help us all survive being stuck at home. Also, Senior Editor Jessica Conditt describes how Doom Eternal -- a literal romp through hell on Earth -- serves a similarly relaxing roll for her. And producer Ben Ellman nerds out about Cities Skylines. Don't ever say we don't have varied tastes.",
            "length": "39709013",
            "sourceUrl": "http://media.blubrry.com/the_engadget/http://feeds.soundcloud.com/stream/784299103-engadget-podcast-how-we-stay-sane-while-staying-inside.mp3"
        },
        {
            "title": "Can Telehealth Save Us?",
            "datePublished": "Fri, 20 Mar 2020 09:30:00 +0000",
            "description": "On this week's episode, Cherlynn and Devindra explore the rise of telehealth during the global coronavirus pandemic. With Medicare expanding coverage to include telehealth, as well as the attention around Verily's efforts to launch a screening site, the industry is gaining momentum. This outbreak could make telehealth mainstream, and we need to understand its limits and challenges so that proper legislation can be drawn up in a timely manner.\n\nIt's not all serious conversation; our hosts also dive into the gaming hardware news from this week, as well as fun recommendations on how to retain your sanity in these trying times\n\n1:16 – Coronavirus puts telehealth in the spotlight\n25:29 – Social Media is our society for now\n38:04 – In other news…we have hardware specs for the Playstation 5!\n44:40 – Picks",
            "length": "49682549",
            "sourceUrl": "http://media.blubrry.com/the_engadget/http://feeds.soundcloud.com/stream/779377819-engadget-podcast-can-telehealth-save-us.mp3"
        },
        {
            "title": "Coronavirus And Our Remote Work Future",
            "datePublished": "Fri, 13 Mar 2020 09:00:38 +0000",
            "description": "Well, we're officially living through a global pandemic, folks. This week, Devindra and Cherlynn chat about how coronavirus is pushing many companies towards remote work and better employee support. (It's just too bad it took a widespread illness to make those things happen.) Will this be the norm moving forward for white-collar jobs? And for a change of pace, they chat about the tech world's war on bezels and the state of software in folding phones. Be sure to stay tuned for some quarantine viewing recommendations too!",
            "length": "36946935",
            "sourceUrl": "http://media.blubrry.com/the_engadget/http://feeds.soundcloud.com/stream/775248565-engadget-podcast-coronavirus-distancing-shows-us-our-remote-work-future.mp3"
        },
        {
            "title": "Coronavirus Hits Tech + Finding Hope With Cosmos Co-Creator Ann Druyan",
            "datePublished": "Fri, 06 Mar 2020 10:00:30 +0000",
            "description": "This week on the Engadget Podcast, we dive into the many ways the coronavirus is affecting the tech industry, all the while remembering to wash our hands and not touch our faces. It's not quite a pandemic yet, but there's some hope on the horizon, now that social media companies like Facebook are actually trying to fight coronavirus disinformation. And for something completely different, Devindra chats with Ann Druyan (starting at 26:59), the co-creator of Cosmos, on the show's incredible new season.\n\nLinks:\n\nFacebook will run free WHO ads to counter coronavirus misinformation: https://www.engadget.com/2020/03/04/facebook-free-who-ads-coronavirus/\n\nFake cures and other coronavirus conspiracy theories are flooding WhatsApp, leaving governments and users with a ‘sense of panic’: https://www.washingtonpost.com/technology/2020/03/02/whatsapp-coronavirus-misinformation/\n\nPandemic film Contagion becomes one of iTunes' most-watched movies:\nhttps://www.cnet.com/news/pandemic-film-contagion-becomes-one-of-itunes-most-watched-movies/?TheTime=2020-03-05T02%3A31%3A27&ftag=COS-05-10aaa0b&PostType=link&UniqueID=6A8E23A6-5E89-11EA-B599-CCC6C28169F1&ServiceType=twitter\n\nTCL's concept device folds twice to fit a 10-inch screen in your pocket: https://www.engadget.com/2020/03/05/tcl-tri-fold-rollable-extendable-concept-hands-on/\n\nDoes the Xbox Series X make gaming PCs obsolete?:\nhttps://www.engadget.com/2020/03/05/xbox-series-x-vs-gaming-pcs/",
            "length": "40982776",
            "sourceUrl": "http://media.blubrry.com/the_engadget/http://feeds.soundcloud.com/stream/771543244-engadget-podcast-coronavirus-tech-cosmos-ann-druyan.mp3"
        },
        {
            "title": "Samsung’s Galaxy S20 Ultra: Is This Your 5G King?",
            "datePublished": "Fri, 28 Feb 2020 10:00:30 +0000",
            "description": "Samsung’s Galaxy S20 Ultra: Is This Your 5G King? by Engadget",
            "length": "34288815",
            "sourceUrl": "http://media.blubrry.com/the_engadget/http://feeds.soundcloud.com/stream/767792254-engadget-podcast-reviewing-samsungs-galaxy-s20-ultra.mp3"
        },
        {
            "title": "Breaking down the Samsung Fest and MWC Mess",
            "datePublished": "Fri, 14 Feb 2020 10:00:40 +0000",
            "description": "A bunch of things in tech got the proverbial nails slammed into their coffins this week. Andy Rubin's Essential phone company shut down, MWC got canceled due to fears over coronavirus and the Motorola Razr folding flip phone is pretty likely dead on arrival thanks to Samsung's new Galaxy Z Flip. \n\nCherlynn is joined by senior mobile editor Chris Velazco (Devindra is off on vacation, yay!) to talk about their Galaxy phone coverage and commiserate over no longer going to Barcelona.",
            "length": "29544148",
            "sourceUrl": "http://media.blubrry.com/the_engadget/http://feeds.soundcloud.com/stream/760370014-engadget-podcast-breaking-down-the-samsung-fest-and-mwc-mess.mp3"
        },
        {
            "title": "How Tech (And Humans) Failed the Iowa Caucus",
            "datePublished": "Fri, 07 Feb 2020 10:00:20 +0000",
            "description": "The logistical and technical debacle of the Iowa Democratic Caucus is exactly why we're not hopeful about online voting in America. This week on the Engadget Podcast, Devindra and Cherlynn chat about what exactly went wrong for Iowa's Democratic Party. The mysterious app from an unknown progressive tech firm was mostly to blame, but it was also helped by some good old fashioned human error.\n\nLinks: \nIowa Democrats say sloppy code led to app failure:\nhttps://www.engadget.com/2020/02/04/iowa-democrats-caucus-app-delay/\n\nIowa caucus results delayed due to app issues: https://www.engadget.com/2020-02-03-iowa-caucus-mobile-app-problems.html\n\nLG pulls out of Mobile World Congress due to Coronavirus fears:\nhttps://www.engadget.com/2020/02/04/lg-pulls-out-of-mobile-world-congress-2020-coronavirus/\n\nSpotify buys The Ringer: https://www.engadget.com/2020/02/05/spotify-buys-the-ringer/",
            "length": "22988249",
            "sourceUrl": "http://media.blubrry.com/the_engadget/http://feeds.soundcloud.com/stream/756440110-engadget-podcast-how-tech-and-humans-failed-the-iowa-caucus.mp3"
        },
        {
            "title": "Why Clearview AI's Facial Recognition is a Privacy Nightmare",
            "datePublished": "Fri, 31 Jan 2020 10:00:30 +0000",
            "description": "All of our fears around facial recognition technology are coming true thanks to a little known startup called ClearView AI. This week, Devindra and Cherlynn dive into how ClearView works, and what unchecked access to powerful facial recognition means for the future of privacy. (It's good for cops, not so much everybody else!) \n\nAlso, managing editor Terrence O'Brien joins to break down how Billy Eilish recorded a Grammy-winning album in a spare bedroom. It's all yet another milestone for DIY home audio production.\n\nLinks: \n- NYT: The secretive company that might end privacy as we know it: https://www.nytimes.com/2020/01/18/technology/clearview-privacy-facial-recognition.html?auth=login-email&login=email\n- Billy Eilish proved anyone can have Grammy-winning gear: https://www.engadget.com/2020/01/27/billie-eilish-grammy-2020-bedroom-studio-logic-pro-x/\n-What to buy if you want to start producing music at home: https://www.engadget.com/2020/01/29/beginner-home-music-studio-bedroom-producer-guide/",
            "length": "30648203",
            "sourceUrl": "http://media.blubrry.com/the_engadget/http://feeds.soundcloud.com/stream/752479468-engadget-podcast-why-clearview-ais-facial-recognition-is-a-privacy-nightmare.mp3"
        },
        {
            "title": "Sonos and The Inevitable Death of Connected Gadgets",
            "datePublished": "Fri, 24 Jan 2020 10:00:30 +0000",
            "description": "Sonos announced that it'll be killing off several of its older devices this week, and its loyal customers aren't taking very kindly to that. This week, Devindra, Cherlynn and Deputy Managing Editor Nathan Ingraham dive into Sonos' plans, and what it says about the future of every connected device. (How's that Pebble treating you?) Also, they discuss how Saudi Arabia hacked Jeff Bezos's phone via WhatsApp. Yes, it's as crazy as it sounds.",
            "length": "41785792",
            "sourceUrl": "http://media.blubrry.com/the_engadget/http://feeds.soundcloud.com/stream/748551835-engadget-podcast-sonos-and-the-inevitable-death-of-connected-gadgets.mp3"
        },
        {
            "title": "Super Nintendo World, Here We Go!",
            "datePublished": "Fri, 17 Jan 2020 10:00:20 +0000",
            "description": "This week, Devindra, Cherlynn and Senior Editor Nick Summers take a relaxing break from the madness of CES by diving into some of this week's news, like the trailer for Japan's Super Nintendo World park. They also question the wisdom of Sony abandoning E3 (yet again), and welcome Microsoft's new Chromium-infused Edge browser.",
            "length": "33936784",
            "sourceUrl": "http://media.blubrry.com/the_engadget/http://feeds.soundcloud.com/stream/744749530-engadget-podcast-super-nintendo-world-here-we-go.mp3"
        },
        {
            "title": "Quibi and Lioness Founders on the Future of Streaming Video and Sex Tech",
            "datePublished": "Sat, 11 Jan 2020 13:00:16 +0000",
            "description": "In this special interview episode from CES 2020, Devindra chats with the minds behind Quibi -- founder Jeffrey Katzenberg, CEO Meg Whitman, Chief Product Officer Tom Conrad and CTO Ben Post -- to see how it's attempting to disrupt streaming mobile video. Meanwhile, Cherlynn speaks with Lioness founder Liz Klinger about the vibrator that finally got to officially display at CES after years of controversy.",
            "length": "21744431",
            "sourceUrl": "http://media.blubrry.com/the_engadget/http://feeds.soundcloud.com/stream/741618559-engadget-podcast-quibi-and-lioness-founders-on-the-future-of-streaming-video-and-sex-tech.mp3"
        },
        {
            "title": "CES 2020 and a Chat With Technologist John Maeda",
            "datePublished": "Fri, 10 Jan 2020 10:00:46 +0000",
            "description": "It's that time of the year again, CES! This week, Devindra and Cherlynn discuss some of the best (and worst) things they've seen at the show, including ultraportables, cars and a variety of truly weird stuff. Plus, you'll hear about a strange Westworld dinner that freaked them both out. And be sure to stay tuned for our chat with the noted designer and technologist John Maeda, who gave his thoughts on CES, the bad design choices companies like Samsung make, and discussed his new book, How to Speak Machine: Computational Thinking for the Rest of Us.",
            "length": "50003649",
            "sourceUrl": "http://media.blubrry.com/the_engadget/http://feeds.soundcloud.com/stream/741138340-engadget-podcast-first-takes-from-ces-2020.mp3"
        },
        {
            "title": "CES 2020 Preview!",
            "datePublished": "Fri, 03 Jan 2020 10:00:23 +0000",
            "description": "To celebrate the arrival of 2020, Devindra and Cherlynn are doing what they do every year: Prepping like crazy for CES. This week, we chat about how the infamous tradeshow has evolved over the years, and the new innovations we're actually looking forward to. And we can't help but dive into the products (and celebrity guests) we're already dreading.",
            "length": "30524339",
            "sourceUrl": "http://media.blubrry.com/the_engadget/http://feeds.soundcloud.com/stream/737674330-engadget-podcast-ces-2020-preview.mp3"
        },
        {
            "title": "The Tech That Made 2019",
            "datePublished": "Sat, 21 Dec 2019 12:00:23 +0000",
            "description": "This week, Devindra and Cherlynn tackle the best and worst tech of 2019. Among the winners: Wireless earbuds and premium ultraportables. As for the losers well.... There's a lot to cover. If anything, it seems like this year is a stepping stone towards some real innovation in 2020.",
            "length": "36977740",
            "sourceUrl": "http://media.blubrry.com/the_engadget/http://feeds.soundcloud.com/stream/731742670-engadget-podcast-the-tech-that-made-2019.mp3"
        },
        {
            "title": "The Mac Pro and Apple's Return to Great Hardware",
            "datePublished": "Fri, 13 Dec 2019 10:00:23 +0000",
            "description": "This week, Senior Editor Devindra Hardawar and UK Bureau Chief Mat Smith explore who may need a $52,000 Mac Pro (it's not as crazy as you think!). And when taken together with the 16-inch MacBook Pro and the AirPods Pro, they discuss what this means for Apple's hardware prospects. Is this a sign that Apple is doing a better job of listening to its users?",
            "length": "17058040",
            "sourceUrl": "http://media.blubrry.com/the_engadget/http://feeds.soundcloud.com/stream/727141426-engadget-podcast-the-mac-pro-and-apples-return-to-great-hardware.mp3"
        },
        {
            "title": "What Qualcomm's New Chips Tell Us About Next Year's Gadgets",
            "datePublished": "Fri, 06 Dec 2019 10:00:33 +0000",
            "description": "Another year, another round of Snapdragon processors from Qualcomm. This week, Cherlynn and Devindra dive into the Snapdragon 865 and 765 to see what they tell us about next year's devices. They're faster than before, of course, but they'll also come with a slew of useful new features for smartphones, tablets and even laptops. Of course, they're also built with 5G support in mind -- though not in the way you'd expect.",
            "length": "28596232",
            "sourceUrl": "http://media.blubrry.com/the_engadget/http://feeds.soundcloud.com/stream/723458701-engadget-podcast-what-qualcomms-new-chips-tell-us-about-next-years-gadgets.mp3"
        },
        {
            "title": "Google Stadia and the Future of Game Streaming",
            "datePublished": "Fri, 22 Nov 2019 10:00:23 +0000",
            "description": "This week, we discuss the problematic launch of Google's Stadia cloud-based games service. Our senior editor and resident games expert Jessica Conditt joins us to share what she thought of the service, how it fares against Microsoft's Xcloud and what she thinks of streaming games in general. Also, as we head into Thanksgiving, it's time to think about your holiday shopping and the deals you might be able to score for you and your loved ones on Black Friday. We have some tips for that. Plus, the recent, old-school, and straight up old games that we've been playing.\n\nWe'll be taking a break for Thanksgiving, so come back in two weeks for a new post-food coma episode.",
            "length": "31672921",
            "sourceUrl": "http://media.blubrry.com/the_engadget/http://feeds.soundcloud.com/stream/716731807-engadget-podcast-google-stadia-and-the-future-of-game-streaming.mp3"
        },
        {
            "title": "Apple’s 16” MacBook Pro is Here (and so is Engadget’s Gift Guide)!",
            "datePublished": "Fri, 15 Nov 2019 10:00:23 +0000",
            "description": "Get ready for the holidays with an in depth look at Engadget’s gift guide! This week, editor in chief Dana Wollman joins Devindra to chat about how we pick the best gadget gifts and some of the wildest choices we’ve made. And of course, we find time to dive into the new 16” MacBook Pro.",
            "length": "43897626",
            "sourceUrl": "http://media.blubrry.com/the_engadget/http://feeds.soundcloud.com/stream/713077477-engadget-podcast-apples-16-macbook-pro-is-here-and-so-is-engadgets-gift-guide.mp3"
        },
        {
            "title": "The Streaming Wars Have Begun",
            "datePublished": "Fri, 08 Nov 2019 10:00:34 +0000",
            "description": "Apple TV+ just launched, Disney+ is on the way, and HBO Max is coming next year. This week on the Engadget Podcast, Devindra and Cherlynn explore why these companies are launching their own streaming services and what it all means for consumers. Are they actually worth subscribing to? Is there simply too much to watch?",
            "length": "34513144",
            "sourceUrl": "http://media.blubrry.com/the_engadget/http://feeds.soundcloud.com/stream/709546381-engadget-podcast-the-streaming-wars-have-begun.mp3"
        },
        {
            "title": "Do you need the AirPods Pro?",
            "datePublished": "Fri, 01 Nov 2019 15:17:56 +0000",
            "description": "This week it's all about computers in our ears, or hearables, if you prefer. Apple announced the long-awaited AirPods Pro on Tuesday, but even though they helped popularize wireless earbuds, now just about every tech company has their own pair as well. We chat about what's new with the AirPods Pro, as well as how to find the perfect pair of earbuds for you. Plus, we talk about the state of smartwatches. (Note: This episode was recorded before Google's Fitbit acquisition was confirmed.)",
            "length": "55129599",
            "sourceUrl": "http://media.blubrry.com/the_engadget/http://feeds.soundcloud.com/stream/706435465-engadget-podcast-do-you-need-the-airpods-pro.mp3"
        },
        {
            "title": "Reviewing the Pixel 4, Surface Pro 7 and More",
            "datePublished": "Fri, 25 Oct 2019 12:57:09 +0000",
            "description": "This week, we dive into some of our latest reviews: Google's Pixel 4, Microsoft's Surface Pro 7, HTC's Vive Cosmos and Dell's XPS 13 2-in-1.",
            "length": "60655671",
            "sourceUrl": "http://media.blubrry.com/the_engadget/http://feeds.soundcloud.com/stream/701545081-engadget-podcast-reviewing-the-pixel-4-surface-pro-7-and-more.mp3"
        },
        {
            "title": "What Do We Lose If Google Is Everywhere?",
            "datePublished": "Fri, 18 Oct 2019 09:00:22 +0000",
            "description": "Google is all about ambient computing. That much was made clear at the company's launch event this week. Its products were leaked so thoroughly that there were barely any surprises left. Yet, finally getting to see Google's full portfolio of devices makes it clear: the company is very serious about getting into every facet of your life.\n \nThis week, Cherlynn is joined by senior mobile editor Chris Velazco in Devindra's absence, and the two take a long hard look at Google's hardware, software, as well as its experiments to see how it all fits into the concept of ambient computing. And the question is: How concerned do we need to be about all the data Google continues to glean about us?",
            "length": "48116861",
            "sourceUrl": "http://media.blubrry.com/the_engadget/http://feeds.soundcloud.com/stream/698048026-engadget-podcast-what-do-we-lose-if-google-is-everywhere.mp3"
        },
        {
            "title": "Is MacOS Catalina Apple's Vista Moment?",
            "datePublished": "Fri, 11 Oct 2019 15:42:08 +0000",
            "description": "MacOS Catalina is here, and it's... kind of a mess. In this episode, Devindra and Cherlynn are joined by Engadget Editor-in-Chief Dana Wollman to discuss Apple's latest desktop OS. The big question: Is Catalina Apple's Vista? (Pro-tip: Don't rush to upgrade.) We also ponder what Google will show off at next week's Pixel event; chat about PG&E's widespread power outages in California; and dive into the weirdness of Andy's Rubin's latest Essential phone, Project Gem.",
            "length": "45051130",
            "sourceUrl": "http://media.blubrry.com/the_engadget/http://feeds.soundcloud.com/stream/694286689-engadget-podcast-is-macos-catalina-apples-vista-moment.mp3"
        },
        {
            "title": "Is Microsoft Making Better PCs than Apple?",
            "datePublished": "Mon, 07 Oct 2019 17:34:19 +0000",
            "description": "Microsoft dropped a load of Surfaces on us last week, each impressive in their own right. We were wowed by the Surface Pro X, Pro 7 and Laptop 3 -- and of course, we can't wait to hear more about the dual-screen Surface Neo and Duo. It's hard not to compare all of those computers to Apple and its relatively straightforward lineup of Macbooks. This week on the Engadget podcast, reviews editor Cherlynn Low and I dive into one big question: Is Microsoft making better PCs than Apple?\n\nIf you've got suggestions or topics you'd like covered on the show, be sure to email us (podcast@engadget.com) or drop a note in the comments! (Apologies in advance for the the Skype audio quality on Cherlynn's side. We'll be in a studio next week!)",
            "length": "65537439",
            "sourceUrl": "http://media.blubrry.com/the_engadget/http://feeds.soundcloud.com/stream/692328730-engadget-podcast-is-microsoft-making-better-pcs-than-apple.mp3"
        },
        {
            "title": "We're back!",
            "datePublished": "Sat, 05 Oct 2019 03:47:50 +0000",
            "description": "Get your headphones ready, the Engadget Podcast is back in action and headed your way soon!",
            "length": "1323171",
            "sourceUrl": "http://media.blubrry.com/the_engadget/http://feeds.soundcloud.com/stream/691268560-engadget-podcast-the-engadget-podcast-returns.mp3"
        },
        {
            "title": "The Engadget Podcast Ep 44: Amazon announces all the things",
            "datePublished": "Fri, 29 Sep 2017 14:03:19 +0000",
            "description": "This week, we discuss Amazon's sprawling new product lineup, ranked from \"useful\" to \"weird.\" Also, we have some thoughts on Twitter's 280-character experiment",
            "length": "27920789",
            "sourceUrl": "http://media.blubrry.com/the_engadget/http://feeds.soundcloud.com/stream/344446852-engadget-podcast-the-engadget-podcast-ep-44-amazon-announces-all-the-things.mp3"
        },
        {
            "title": "The Engadget Podcast Ep 43: Hits, misses and leaks",
            "datePublished": "Fri, 22 Sep 2017 13:14:20 +0000",
            "description": "This week on the Engadget Podcast, we discuss our impressions of the iPhone 8, 8 Plus and Apple Watch Series 3, plus our take on the big Google-HTC deal.",
            "length": "30920435",
            "sourceUrl": "http://media.blubrry.com/the_engadget/http://feeds.soundcloud.com/stream/343468178-engadget-podcast-the-engadget-podcast-ep-43-hits-misses-and-leaks.mp3"
        },
        {
            "title": "The Engadget Podcast Ep 42: Everything Apple",
            "datePublished": "Fri, 15 Sep 2017 13:26:50 +0000",
            "description": "This week senior editor Chris Velazco and Executive Editor Dana Wollman are talking everything Apple! The iPhone X, iPhone 8 and 8 Plus, and the Apple Watch Series 3... plus more!",
            "length": "28222462",
            "sourceUrl": "http://media.blubrry.com/the_engadget/http://feeds.soundcloud.com/stream/342413853-engadget-podcast-engadget-podcast-20170914.mp3"
        },
        {
            "title": "The Engadget Podcast Ep 41: High Hopes",
            "datePublished": "Fri, 08 Sep 2017 13:15:40 +0000",
            "description": "This week senior editor Chris Velazco and Executive Editor Dana Wollman meant to recap Chris's review of the Galaxy Note 8, but this quickly devolved into speculation about next week's Apple event and opining about the crowded smartphone space in general.",
            "length": "33812713",
            "sourceUrl": "http://media.blubrry.com/the_engadget/http://feeds.soundcloud.com/stream/341381560-engadget-podcast-the-engadget-podcast-ep-41-high-hopes.mp3"
        },
        {
            "title": "Engadget Podcast: Ep 40: This is Your Night",
            "datePublished": "Fri, 01 Sep 2017 18:00:58 +0000",
            "description": "Executive Editor, Dana Wollman, and Senior Mobile Editor, Chris Velazco, sit down to discuss the best of IFA, as well as Google ARCore",
            "length": "26712236",
            "sourceUrl": "http://media.blubrry.com/the_engadget/http://feeds.soundcloud.com/stream/340486789-engadget-podcast-engadget-podcast-ep-40-this-is-the-night.mp3"
        },
        {
            "title": "Engadget Podcast Ep 39: Rip Off",
            "datePublished": "Mon, 15 May 2017 09:00:22 +0000",
            "description": "On this episode hosts Dana Wollman and Terrence O'Brien talk about the massive ransomware attack spreading across the globe and Caddyshack. Edgar Alvarez stops by to fills everyone in on all the drama around Fyre Festival, Instagram influencers and the FTC. Then Cherlynn Low and Devindra Hardawar check in from Build to give us the low down on Microsoft's plans for the future.",
            "length": "62691249",
            "sourceUrl": "http://media.blubrry.com/the_engadget/http://feeds.soundcloud.com/stream/322454306-engadget-podcast-engadget-podcast-ep-39.m4a"
        },
        {
            "title": "The Engadget Podcast Ep 37:  Modern Things",
            "datePublished": "Fri, 21 Apr 2017 08:55:30 +0000",
            "description": "On this episode senior editor Chris Velazco and social media manager Evan Rodgers join host Terrence O’Brien for the last ever video edition of The Engadget Podcast. From here on out the show is going audio only, which will allow the show to bring you a wider variety of guests from all over the country and the globe. But those aren’t the only changes at the site. Engadget has a new editor chief and a renewed focus on doing what it does best: Bringing you the best and most important stories in tech. \n\nFor example, on this week’s show the panel discusses Facebook’s ongoing problem with violent videos and livestreamed crimes. They’ll even try to figure out who, ultimately, should be responsible for policing such content, if anyone. Then they’ll dig deep… real deep on the Galaxy S8 and S8 Plus. TL;DR: They’re amazing phones that should be on your shortlist and might even make you forget about the Note 7 debacle.\n\nRelevant links:\nhttps://www.engadget.com/2017/04/20/a-letter-from-your-editor-changes-ahead/\nhttps://www.engadget.com/2017/04/18/facebook-video-steve-stephens/\nhttps://www.engadget.com/2017/04/18/samsung-galaxy-s8-and-s8-plus-review/\n\n\nThe Wind Down:\nKendrick Lamar - Damn : http://amzn.to/2oroLpZ\nThe Jetzons - Hard Times: http://amzn.to/2pjTBF8\n2 Mello - Chrono Jigga: https://2mellomakes.bandcamp.com/album/chrono-jigga\nDJ 8-Bit Mullet - Metroid Remixes: https://soundcloud.com/8bitmullet/metroid-remix-mashup-beat-hip-hop-mix-theme",
            "length": "63700322",
            "sourceUrl": "http://media.blubrry.com/the_engadget/http://feeds.soundcloud.com/stream/318713924-engadget-podcast-the-engadget-podcast-ep-37-modern-things.mp3"
        },
        {
            "title": "The Engadget Podcast Ep 36:  Bad and Boujee",
            "datePublished": "Fri, 14 Apr 2017 09:37:46 +0000",
            "description": "On this episode of the Engadget Podcast senior editor Cherlynn Low and executive editor Dana Wollman join host Terrence O’Brien to talk about some recent examples of bad corporate behavior. First the trio look the most recent developments at Uber, where days without controversy are increasingly rare. After that, they turn their attention to another perennial punching bag (and soon to be newest member of the Verizon family) Yahoo. The company’s troubles aren’t new. In fact the panel will be discussing just the latest fallout from a scandal surrounding political prisoners in China that dates back to 2007.\n\nFinally, on the Wind Down, Cherlynn reveals that gratuitous nudity isn’t what makes an HBO show and Terrence wholeheartedly endorses the chaotic and experimental “pop.” Then Dana offers her review of 1986’s Little Shop of Horrors. \n\nRelevant links:\nhttps://www.engadget.com/2017/04/11/yahoo-lawsuit-human-rights-trust-chinese-dissidents/\nhttps://www.engadget.com/2017/04/13/uber-hell-program-lyft-drivers/\n\n\nThe Wind Down:\nArca - Arca: http://amzn.to/2orz4Lz\nLittle Shop of Horrors: http://amzn.to/2py77Rk\nBig Little Lies: http://amzn.to/2orAzcx\nCriminal: http://thisiscriminal.com/",
            "length": "45652844",
            "sourceUrl": "http://media.blubrry.com/the_engadget/http://feeds.soundcloud.com/stream/317536547-engadget-podcast-podcast-ep36-soundcloud.mp3"
        },
        {
            "title": "The Engadget Podcast Ep 35:  TV Party",
            "datePublished": "Fri, 07 Apr 2017 14:41:17 +0000",
            "description": "On this episode host Terrence O’Brien is joined by executive editor Dana Wollman and (eventually) senior editor Chris Velazco. They start by looking at the current state of cord cutting and weigh the value of YouTube’s new live streaming TV package. Then they’ll try to figure out what the benefit is of Netflix ditching its five star rating system for a simplified option of just thumbs up or thumbs down. Obviously you can watch YouTube and Netflix on an actual television, but portable screens are an increasingly important part of the media market. How does the new 2017 iPad stack up in that world of mobile media machines? Well, pretty good if you ask Chris -- at $329 it doesn’t seem to have too many competitors.\n\nLastly the trio sign off by recommending an album that will make you cry, a movie that will make you pee your pants and book you’ll die before finishing.\n\nRelevant links:\nhttps://www.engadget.com/2017/04/05/netflix-thumbs/\nhttps://www.engadget.com/2017/04/05/youtube-tv-now-available/\nhttps://www.engadget.com/2017/04/06/apple-ipad-2017-review/\n\n\nThe Wind Down:\nMount Eerie - A Crow Looked at Me: http://amzn.to/2oeGi7r\nJaws: http://amzn.to/2oeFaAy\nRafik Schami - Dark Side of Love: http://amzn.to/2nIVMgf",
            "length": "39999528",
            "sourceUrl": "http://media.blubrry.com/the_engadget/http://feeds.soundcloud.com/stream/316572601-engadget-podcast-the-engadget-podcast-ep-35-tv-party.mp3"
        },
        {
            "title": "The Engadget Podcast Ep 34:  Intergalactic",
            "datePublished": "Fri, 31 Mar 2017 09:12:59 +0000",
            "description": "On this special all Samsung edition of the Engadget Podcast host Terrence O’Brien is joined by executive editor Dana Wollman and senior editor Chris Velazco. First all three will debate some of the most burning questions surrounding South Korea’s biggest phone manufacturer. Should Samsung be using resources to build yet another virtual assistant? Is there anyone who wants to use their phone as a desktop? And, most importantly, can the Galaxy S8 save Samsung from itself? Then Chris Velazco will paint a picture of the event on the ground, before the crew dives deep on the finer point of the S8’s design, interface and audio pedigree. \n\nRelevant links:\nhttps://www.engadget.com/2017/03/29/samsung-gs8-unbox-your-phone-event-hyperbole/\nhttps://www.engadget.com/2017/03/29/samsung-galaxy-s8-akg-earbuds/\nhttps://www.engadget.com/2017/03/29/meet-galaxy-s8-and-s8-plus-hands-on/\nhttps://www.engadget.com/2017/03/29/samsung-connect-home-router/\nhttps://www.engadget.com/2017/03/29/does-anyone-actually-want-to-use-a-phone-as-a-desktop/\nhttps://www.engadget.com/2017/03/29/samsung-dex-hands-on/\nhttps://www.engadget.com/2017/03/29/samsungs-bixby-ai-assistant-can-see-as-well-as-talk/\nhttps://www.engadget.com/2017/03/29/samsung-galaxy-s8-unpacked-liveblog/\n\nThe Wind Down:\nSpoon -- Hot Thoughts: http://amzn.to/2npfHBx\nMissing Richard Simmons: https://www.missingrichardsimmons.com/\nThe Adventure Zone: http://www.maximumfun.org/shows/adventure-zone",
            "length": "66025847",
            "sourceUrl": "http://media.blubrry.com/the_engadget/http://feeds.soundcloud.com/stream/315278890-engadget-podcast-podcast-ep34-soundcloud.mp3"
        },
        {
            "title": "The Engadget Podcast Ep 33:  Losing My Edge",
            "datePublished": "Fri, 24 Mar 2017 13:38:51 +0000",
            "description": "Managing editor Dana Wollman and host Terrence O’Brien are joined by a new face on this week’s episode: social media manager Evan Rodgers. They’ll talk about Engadget’s Adult Week -- a collection of articles about growing up in the digital age. Sure, we all know that what you say on social media can really come back to bite you in the ass (and possibly cost you a job). But, the internet is both an obstacle that needs to be navigated and a powerful tool that can teach you to be an independent and self sufficient adult. Without it Terrence and Evan would have never learned how to properly invoice companies during their freelancing days. And Dana has turned to the web to learn how to cook. They grow up so fast… sniff.\n\nRelevant links:\nhttps://www.engadget.com/2017/03/20/do-good-online/\nhttps://www.engadget.com/2017/03/21/the-life-changing-magic-of-tidying-your-computer/\nhttps://www.engadget.com/2017/03/21/nocar-nolicense-noproblem/\nhttps://www.engadget.com/2017/03/22/i-love-my-child-too-much-to-put-her-on-the-internet/\nhttps://www.engadget.com/2017/03/22/digital-chill/\nhttps://www.engadget.com/2017/03/23/what-the-internet-taught-me-about-dressing-like-an-adult/\nhttps://www.engadget.com/2017/03/23/the-panic-and-pleasure-of-online-dating-as-a-woman-in-her-40s/\n\nThe Wind Down:\nBaseball: A Film by Ken Burns -- http://amzn.to/2neouXr\nFrank Ocean: Slide -- http://amzn.to/2mYg2Km\nJurassic Park -- http://amzn.to/2nejsu5",
            "length": "80393194",
            "sourceUrl": "http://media.blubrry.com/the_engadget/http://feeds.soundcloud.com/stream/314249872-engadget-podcast-the-engadget-podcast-ep-33-losing-my-edge.mp3"
        },
        {
            "title": "The Engadget Podcast Ep 32:  North and South of the River",
            "datePublished": "Thu, 16 Mar 2017 20:25:43 +0000",
            "description": "Senior editors Devindra Hardawar and Nathan Ingraham were among the Engadget team in Austin for SXSW this week. They sit down to talk about what they’ve seen, from movies to VR experiences to former Vice President Joe Biden. They also discuss how covering SXSW differs from the other big events Engadget typically covers and also decide whether or not the show is losing its cool. Also, BBQ. Lots and lots of BBQ.\n\nRelevant links:\nhttps://www.engadget.com/tag/sxsw2017/\nhttps://www.engadget.com/2017/03/14/sony-motion-sonic-wristband-makes-sound-with-a-wave-of-your-ar/\nhttps://www.engadget.com/2017/03/13/sony-put-four-perspectives-in-one-vr-headset/\nhttps://www.engadget.com/2017/03/13/joe-biden-sxsw-cancer-initiative/\nhttps://www.engadget.com/2017/03/12/what-its-like-playing-rez-infinite-strapped-into-a-synesthesi/\nhttps://www.engadget.com/2017/03/12/meta-2-ar-headset/\nhttps://www.engadget.com/2017/03/16/ron-howard-on-his-einstein-show-and-digital-filmmaking/",
            "length": "33131623",
            "sourceUrl": "http://media.blubrry.com/the_engadget/http://feeds.soundcloud.com/stream/312807683-engadget-podcast-the-engadget-podcast-ep-32-north-and-south-of-the-river.mp3"
        },
        {
            "title": "The Engadget Podcast Ep 31:  Look Inside America",
            "datePublished": "Fri, 10 Mar 2017 08:57:19 +0000",
            "description": "On this episode a trio of out-of-towners -- managing editor James Trew, senior editor Aaron Souppouris and senior editor Mat Smith -- join host Terrence O’Brien to talk about the latest tech news. First they’ll discuss Consumer Reports decision to start considering security and privacy in their ratings. Then try to figure out just what the hell the New York Times is thinking by putting tweets in the print edition of the paper. Then lastly they’ll talk about the latest out of Wikileaks and yell a whole lot about what a terrible person Julian Assange is.\n\nRelevant links:\nhttps://www.engadget.com/2017/03/07/consumer-reports-now-rates-product-privacy-and-security/\nhttps://www.engadget.com/2017/03/07/new-york-times-reporters-tweets-will-appear-in-its-paper-editio/\nhttps://www.engadget.com/2017/03/08/apple-ios-wikileaks-cia-exploits/\nhttps://www.engadget.com/2017/03/07/wikileaks-reveals-cia-hacking-toolkit/",
            "length": "49976632",
            "sourceUrl": "http://media.blubrry.com/the_engadget/http://feeds.soundcloud.com/stream/311464056-engadget-podcast-the-engadget-podcast-ep-31-look-inside-america.mp3"
        },
        {
            "title": "The Engadget Podcast Ep 30:  I Can Change",
            "datePublished": "Fri, 03 Mar 2017 14:44:15 +0000",
            "description": "After surviving The Great AWS Outage of 2017, managing editor Dana Wollman and senior editor Devindra Hardawar rejoin host Terrence O’Brien to talk about Nintendo’s Switch. But before they get to that, they’ll take on YouTube’s live TV offering and Twitter’s new tools for fighting harassment. Plus they’ll address the latest controversy surrounding Uber CEO Travis Kalanick.\n\nRelevant links:\nhttps://www.engadget.com/2017/02/28/youtube-tv-is-googles-live-tv-service/\nhttps://www.engadget.com/2017/03/01/twitter-improves-mute-controls-for-abuse/\nhttps://www.engadget.com/2017/02/28/uber-ceo-argues-with-driver/\nhttps://www.engadget.com/2017/03/01/nintendo-switch-review/\nhttps://www.engadget.com/2017/03/02/nintendo-switch-day-one-patch/\nhttps://www.engadget.com/2017/03/02/zelda-breath-of-the-wild-switch-review/\n\n\nThe Wind Down:\nCode Switch - http://www.npr.org/podcasts/510312/codeswitch\nThe Good Fight - https://www.engadget.com/2017/01/09/watch-the-first-trailer-for-the-cbs-all-access-good-wife-spino/\nThe Night of the Gun - http://amzn.to/2lEGMjc",
            "length": "41338670",
            "sourceUrl": "http://media.blubrry.com/the_engadget/http://feeds.soundcloud.com/stream/310410974-engadget-podcast-the-engadget-podcast-ep-30-i-can-change.mp3"
        },
        {
            "title": "The Engadget Podcast Ep 29:  Re-Offender",
            "datePublished": "Fri, 24 Feb 2017 10:04:11 +0000",
            "description": "Managing editor Dana Wollman and senior editor Nathan Ingraham join host Terrence O’Brien to talk about the biggest tech stories of the week. Of course, that means Uber and the growing controversy around its corporate culture -- including allegations of rampant sexism. They’ll also address Samsung’s plans to sell refurbished Note 7s, Bill Gate’s endorsement of a robot tax and PewDiePie’s most recent controversy. Then it’s time to unwind a bit, and the group has some reading and listening suggestions. Plus, Dana wants your recipes.\n\nRelevant links:\nhttps://www.engadget.com/2017/02/21/samsung-will-reportedly-sell-refurbished-galaxy-note-7s/\nhttps://www.engadget.com/2017/02/19/bill-gates-calls-for-robot-tax/\nhttps://www.engadget.com/2017/02/22/youtube-pewdiepie-wont-break-up-anytime-soon\nhttps://www.engadget.com/2017/02/21/uber-has-a-sexism-problem-and-so-does-silicon-valley/\nhttps://www.engadget.com/2017/02/20/uber-ceo-memo-sexual-harassment-allegations/\nhttps://www.engadget.com/2017/02/20/uber-reportedly-ignored-repeated-sexual-harassment-by-manager/\nhttp://www.recode.net/2017/2/22/14696824/bernard-coleman-iii-uber-diversity\nhttps://www.nytimes.com/2017/02/22/technology/uber-workplace-culture.html?_r=0\nhttps://www.susanjfowler.com/blog/2017/2/19/reflecting-on-one-very-strange-year-at-uber\nhttps://techcrunch.com/2017/02/21/how-uber-can-permanently-regain-trust/",
            "length": "46393050",
            "sourceUrl": "http://media.blubrry.com/the_engadget/http://feeds.soundcloud.com/stream/309274941-engadget-podcast-the-engadget-podcast-ep-29-re-offender.mp3"
        },
        {
            "title": "The Engadget Podcast Ep 28:  Disconnection Notice",
            "datePublished": "Fri, 17 Feb 2017 10:02:03 +0000",
            "description": "On this episode, managing editor Dana Wollman and senior editor Devindra Hardawar join host Terrence O’Brien on to debate the value of reviving dead products and really dig deep on the value of unplugging. First they’ll look at three things primed to come back from the dead: Verizon’s unlimited data plans, nudity in Playboy and the Nokia 3310. Then, fresh from a weekend reading by a fireplace and drinking whiskey in the woods, Terrence talks about the importance of unplugging -- even if only for a few hours -- every week. We’re more connected than ever and that’s a good thing. But even too much of a good thing can be bad for you.\n\nRelevant links:\nhttps://www.engadget.com/2017/02/13/playboy-goes-full-frontal-again/\nhttps://www.engadget.com/2017/02/15/why-is-verizon-offering-unlimited-data-again/\nhttps://www.engadget.com/2017/02/14/the-nokia-3310-will-reportedly-return-this-month/",
            "length": "51971551",
            "sourceUrl": "http://media.blubrry.com/the_engadget/http://feeds.soundcloud.com/stream/308108223-engadget-podcast-podcast-ep28soundcloud.mp3"
        },
        {
            "title": "The Engadget Podcast Ep 27:  American Tune",
            "datePublished": "Fri, 03 Feb 2017 13:24:23 +0000",
            "description": "Managing editor Dana Wollman and reviews editor Cherlynn Low join host Terrence O’Brien to discuss the biggest tech news of the week. FIrst they’ll debate OnePlus’ benchmark scandal, then try to sort out why the ACLU is partnering with startup incubator Y Combinator and take the “artists” behind the Tinder for baby adoption Kickstarter to task. Finally it’s another week of Trump talk as the panel addresses the impact of the recent immigration ban on the tech industry and how the political climate is impacting our social media habits.",
            "length": "50455613",
            "sourceUrl": "http://media.blubrry.com/the_engadget/http://feeds.soundcloud.com/stream/305838137-engadget-podcast-the-engadget-podcast-ep-27.mp3"
        },
        {
            "title": "The Engadget Podcast Ep 26:  The Sounds of Science",
            "datePublished": "Fri, 27 Jan 2017 09:57:21 +0000",
            "description": "Managing editor Dana Wollman and senior editor Nathan Ingraham join host Terrence O’Brien on the latest episode. First Dana and Nathan face off in the latest installment of Flame Wars, tackling the latest news around Google Voice, struggling streaming service Tidal and the Note 7. Then all three will try to unravel the first week of Donald Trump’s presidency and what it means for science in particular.",
            "length": "50490722",
            "sourceUrl": "http://media.blubrry.com/the_engadget/http://feeds.soundcloud.com/stream/304700819-engadget-podcast-the-engadget-podcast-ep-26-the-sounds-of-science.mp3"
        },
        {
            "title": "The Engadget Podcast Ep 25:  Black Hole Sun",
            "datePublished": "Fri, 20 Jan 2017 10:14:55 +0000",
            "description": "Senior editor Chris Velazco, reviews editor Cherlynn Low and Social Media Editor Mallory Johns join host Devindra Hardawar to chat about the biggest stories of the week, including HTC U Ultra phone, which may or may not save the company. Moving on, they dive into the Nintendo Switch’s launch, and discuss President Obama’s commutation of Chelsea Manning’s prison sentence.",
            "length": "52322219",
            "sourceUrl": "http://media.blubrry.com/the_engadget/http://feeds.soundcloud.com/stream/303622912-engadget-podcast-the-engadget-podcast-ep-25-black-hole-sun.mp3"
        },
        {
            "title": "The Engadget Podcast Ep 24:  The Biggest Lie",
            "datePublished": "Fri, 13 Jan 2017 10:38:10 +0000",
            "description": "Senior editors Edgar Alvarez and Devindra Hardawar join host Terrence O’Brien to discuss the biggest stories of the week, including Facebook’s Journalism Project and the Emoji takeover of Monopoly. Then they’ll talk about Volkswagen’s massive settlement and pending indictments. Plus they’ll try to recap Dieselgate without messing up the timeline.",
            "length": "42186291",
            "sourceUrl": "http://media.blubrry.com/the_engadget/http://feeds.soundcloud.com/stream/302418591-engadget-podcast-the-engadget-podcast-ep-24-the-biggest-lie.mp3"
        },
        {
            "title": "The Engadget Podcast Ep 23: Leaving Las Vegas",
            "datePublished": "Sun, 08 Jan 2017 02:20:57 +0000",
            "description": "Editor in chief Michael Gorman, executive editor Chris Trout and managing editor Dana Wollman join host Terrence O’Brien to give you one last update from the ground in Las Vegas. They talk about the history of sex at CES, it’s quiet reemergence and all the most absurd gadgets from the show floor. Plus they settle once and for all who is the Flame Wars champion, and who will have something to prove in 2017.",
            "length": "22888497",
            "sourceUrl": "http://media.blubrry.com/the_engadget/http://feeds.soundcloud.com/stream/301464772-engadget-podcast-the-engadget-podcast-ep-23-leaving-las-vegas.mp3"
        },
        {
            "title": "The Engadget Podcast Ep 22: Filmore Jive",
            "datePublished": "Sat, 07 Jan 2017 00:47:01 +0000",
            "description": "Senior editor Aaron Souppouris, senior HD editor Richard Lawler and senior editor Mat Smith join host Terrence O’Brien to talk about the tech announcements at CES that will shape 2017. Just like every year, it’s a big TV show. LG, Samsung, Sony and plenty others came with their biggest and brightest sets. But it was LG that stole Lawler’s heart with it’s crazy thin W-series OLEDs. The group also chats about how OLEDs are quickly becoming cheaper and more readily available.",
            "length": "18251730",
            "sourceUrl": "http://media.blubrry.com/the_engadget/http://feeds.soundcloud.com/stream/301307093-engadget-podcast-the-engadget-podcast-ep-22-filmore-jive.mp3"
        },
        {
            "title": "The Engadget Podcast Ep 21: Ooh Las Vegas",
            "datePublished": "Fri, 06 Jan 2017 03:36:40 +0000",
            "description": "Associate editor Billy Steele, senior editor Nicole Lee and deputy managing editor James Trew join host Terrence O’Brien to talk about the early trends emerging from CES. It’s only the first day of the show, but there’s already been plenty of announcements, press conferences and lots of lost sleep. One of the most immediate things you’ll notice on the show floor is that everything has voice control this year, even garbage cans. And tons of companies are rushing to integrate Alexa into cars, washing machines and refrigerators. The panel will also talk about the best and worst things they’ve seen so far.",
            "length": "27283043",
            "sourceUrl": "http://media.blubrry.com/the_engadget/http://feeds.soundcloud.com/stream/301158318-engadget-podcast-the-engadget-podcast-ep-21-ooh-las-vegas.mp3"
        },
        {
            "title": "The Engadget Podcast Ep 20: I Can’t Stand Up For Falling Down",
            "datePublished": "Fri, 30 Dec 2016 14:25:06 +0000",
            "description": "It’s the last episode of the year and host Terrence O’Brien is closing things out with managing editor Dana Wollman and reviews editor Cherlynn Low. After looking at the biggest winners of 2016 last week, the crew is taking on the biggest losers. That means exploding phones, shady medical startups and trolls galore. Plus the standings for Flame Wars are finalized ahead of CES, so get ready ‘cause things might get real weird next week.",
            "length": "63922258",
            "sourceUrl": "http://media.blubrry.com/the_engadget/http://feeds.soundcloud.com/stream/300111641-engadget-podcast-the-engadget-podcast-ep-20-i-cant-stand-up-for-falling-down.mp3"
        },
        {
            "title": "The Engadget Podcast Ep 19: Simply the Best",
            "datePublished": "Fri, 23 Dec 2016 09:57:24 +0000",
            "description": "In this week’s episode guest host Devindra Hardawar is joined by Managing Editor Dana Wollman and Senior Editor Chris Velazco as they run through the biggest winners of 2016. While it might have been a rough year for our musical legends, it was a pretty solid one for Netflix and Tesla. Heck, even in the throes of a growing fake news crisis, Facebook managed to have more wins than loses. And, once they’ve finished listing off all the ways emoji are taking over the world, they’ll look at some of the best gadgets of 2016.",
            "length": "48083695",
            "sourceUrl": "http://media.blubrry.com/the_engadget/http://feeds.soundcloud.com/stream/299226711-engadget-podcast-the-engadget-podcast-ep-19-simply-the-best.mp3"
        },
        {
            "title": "The Engadget Podcast Ep 18: We Both Go Down Together",
            "datePublished": "Fri, 16 Dec 2016 09:55:28 +0000",
            "description": "Managing Editor Dana Wollman and Senior Editor Devindra Hardawar join host Terrence O’Brien to talk about the biggest tech stories of the week. First Dana and Devindra debate the value of Amazon’s delivery drones and Google’s… I mean Alphabet’s new self-driving car company, Waymo. Plus they discuss the privacy freakout surrounding Evernote. Then all three will dig into the never ending security failures of Yahoo. Now that the company has admitted that over 1.5 billion user accounts were compromised -- and didn’t say a word about it for over 2 years -- will Verizon still go through with its planned buy out? The panel certainly hopes not.",
            "length": "51755884",
            "sourceUrl": "http://media.blubrry.com/the_engadget/http://feeds.soundcloud.com/stream/298086910-engadget-podcast-the-engadget-podcast-ep-18-we-both-go-down-together.mp3"
        },
        {
            "title": "The Engadget Podcast Ep 17: Mansion on the Hill",
            "datePublished": "Fri, 09 Dec 2016 09:56:58 +0000",
            "description": "Executive editor Christopher Trout and reviews editor Cherlynn Low join host Terrence O’Brien to talk about the week’s biggest news, including: Pandora Premium, Fitbit’s purchase of Pebble and the gaming industry’s nostalgia overload. Then Chris will tell the panel about his investigation into a failed gaming accessory that’s found a second life as a sex toy -- clearly things get a little NSFW. Then all three will talk about what Amazon Go and other advancements in automation and mean for low-skill and low-wage jobs.",
            "length": "63861236",
            "sourceUrl": "http://media.blubrry.com/the_engadget/http://feeds.soundcloud.com/stream/296896896-engadget-podcast-the-engadget-podcast-ep-17-mansion-on-the-hill.mp3"
        },
        {
            "title": "The Engadget Podcast Ep 16: Feds Watching",
            "datePublished": "Fri, 02 Dec 2016 14:30:25 +0000",
            "description": "Managing editor Dana Wollman and senior editor Devindra Hardawar join host Terrence O’Brien to talk about the week’s biggest tech news, including Nike’s new self-lacing shoes, Netlix’s offline mode and “yelfies.” Then they’ll rant about what’s been bother them this week, whether that’s DirecTV, crappy touchpads or Amazon’s convoluted pile of apps. Lastly they’ll try to unravel the complicated mess that is Rule 41 and what it means for privacy in America.\n\nRelevant links:\nhttps://www.engadget.com/2016/11/30/yelp-wants-you-to-add-a-yelfie-to-your-restaurant-reviews/\nhttps://www.engadget.com/2016/11/30/nike-hyperadapt-first-look/\nhttps://www.engadget.com/2016/11/30/netflixs-offline-viewing-mode-was-inevitable/\nhttps://www.engadget.com/2016/04/20/amazon-needs-to-simplify-prime-video-to-compete-with-netflix/\nhttps://www.engadget.com/2016/11/28/att-directv-now-streaming/\nhttps://www.engadget.com/2016/11/30/directv-now-hands-on/\nhttps://www.engadget.com/2016/12/01/rule-41-fbi-doj-hacking-power-expand-search-seizure/",
            "length": "51959848",
            "sourceUrl": "http://media.blubrry.com/the_engadget/http://feeds.soundcloud.com/stream/295869502-engadget-podcast-podcast-ep16-soundcloud.mp3"
        },
        {
            "title": "The Engadget Podcast Ep. 15: Everything But the Truth",
            "datePublished": "Fri, 18 Nov 2016 09:56:19 +0000",
            "description": "Senior editor Devindra Hardawar and reviews editor Cherlynn Low join host Terrence O’Brien to dig through the week’s biggest news. First they’ll talk about two of the biggest new products on the market: the Macbook Pro and the Surface Studio. Then they’ll try to figure out what posses a Ubisoft employee to hide a rather graphic image of a vagina in Watch Dogs 2. Lastly the panel will talk about the growing problem of fake news on the internet and what giants like Facebook can do to combat it.\n\nRelevant links: \nhttps://www.engadget.com/2016/11/14/macbook-pro-review-2016/\nhttps://www.engadget.com/2016/11/15/watch-dogs-2-player-finds-sex-organ/\nhttps://www.engadget.com/2016/11/17/microsoft-surface-studio-review/\nhttps://www.engadget.com/2016/11/14/google-is-restricting-adsense-ads-on-fake-news-sites/\nhttps://www.engadget.com/2016/11/14/facebook-ad-network-bans-fake-news-websites/\nhttps://www.engadget.com/2016/11/14/facebook-didnt-stop-fake-news-because-its-afraid-of-conservati/\nhttps://www.engadget.com/2016/11/13/mark-zuckerberg-says-99-percent-of-facebook-is-authentic/\nhttps://docs.google.com/document/d/10eA5-mCZLSS4MQY5QGb5ewC3VAL6pLkT53V_81ZyitM/preview",
            "length": "48826408",
            "sourceUrl": "http://media.blubrry.com/the_engadget/http://feeds.soundcloud.com/stream/293545499-engadget-podcast-the-engadget-podcast-ep-15-everything-but-the-truth.mp3"
        },
        {
            "title": "The Engadget Podcast Ep 14: Welcome to the Terrordome",
            "datePublished": "Fri, 11 Nov 2016 09:56:40 +0000",
            "description": "Trigger warning: This episode in a solid hour of Donald Trump talk.\n\nIf you're still with us, strap in. Dana Wollman, Nathan Ingraham and Devindra Hardawar join host Terrence O'Brien to talk about how social media traps us in echo chambers. The they'll envision what the world of tech and science looks like under a President Donald Trump. Hint: Things are a little bleak.\n\nhttps://www.engadget.com/2016/11/09/under-trump-the-future-of-net-neutrality-and-broadband-is-uncert/\n\nhttps://www.engadget.com/2016/11/09/planet-earth-might-be-the-biggest-loser-under-president-trump/\n\nhttps://www.engadget.com/2016/11/09/this-is-happening/",
            "length": "58747923",
            "sourceUrl": "http://media.blubrry.com/the_engadget/http://feeds.soundcloud.com/stream/292473296-engadget-podcast-the-engadget-podcast-ep-14-welcome-to-the-terrordome.mp3"
        },
        {
            "title": "The Engadget Podcast Ep 13: A Chicken with its Head Cut Off",
            "datePublished": "Fri, 04 Nov 2016 09:58:53 +0000",
            "description": "Editor in chief Michael Gorman and executive editor Christopher Trout are in town this week and stop by to talk Peter Thiel, Vine and online voting with host Terrence O’Brien and reviews editor Cherlynn Low. Then, after they’ve had their fill of beating up on Thiel, the four will explore how dating and sex have changed in the age of apps. Warning, things get a little NSFW.",
            "length": "52829621",
            "sourceUrl": "http://media.blubrry.com/the_engadget/http://feeds.soundcloud.com/stream/291347541-engadget-podcast-the-engadget-podcast-ep-13-a-chicken-with-its-head-cut-off.mp3"
        },
        {
            "title": "The Engadget Podcast Ep 12: Surface Envy",
            "datePublished": "Fri, 28 Oct 2016 08:57:17 +0000",
            "description": "Managing editor Dana Wollman and senior editor Devindra Hardawar join host Terrence O’Brien to talk about the value of the Esc key, the Nintendo Switch and the impeding Gilmore Girls resurrection. Then they’ll relive Microsoft’s big Surface event and dig in on future of Twitter… and whether or not it even has one.",
            "length": "49464632",
            "sourceUrl": "http://media.blubrry.com/the_engadget/http://feeds.soundcloud.com/stream/290305584-engadget-podcast-the-engadget-podcast-ep-12-surface-envy.mp3"
        },
        {
            "title": "The Engadget Podcast Ep. 11: Everybody Hurts",
            "datePublished": "Fri, 21 Oct 2016 09:02:37 +0000",
            "description": "Managing editor Dana Wollman and senior editor Mona Lalwani  join host Terrence O’Brien to talk Macbook rumors, Amazon ISP ambitions and Julian Assange. Then they’ll talk about all the work that went into Engadget’s five part series covering the world’s first cyborg games, Superhumans and look at VR’s ability generate empathy.",
            "length": "50801683",
            "sourceUrl": "http://media.blubrry.com/the_engadget/http://feeds.soundcloud.com/stream/289202221-engadget-podcast-the-engadget-podcast-ep-11.mp3"
        },
        {
            "title": "The Engadget Podcast Ep 10: Survivor",
            "datePublished": "Fri, 14 Oct 2016 08:58:07 +0000",
            "description": "Managing editor Dana Wollman and senior editor Chris Velazco join host Terrence O’Brien to debate Facebook’s trending new problem and the true purpose of Twitter. Then they’ll dig through the ashes of the Galaxy Note 7 for insight and discuss how hashtags actually can change the world.",
            "length": "70507808",
            "sourceUrl": "http://media.blubrry.com/the_engadget/http://feeds.soundcloud.com/stream/287543475-engadget-podcast-the-engadget-podcast-ep-8-hes-simple-hes-dumb-hes-the-pilot.mp3"
        },
        {
            "title": "The Engadget Podcast Ep 9: What’s he building in there",
            "datePublished": "Fri, 07 Oct 2016 14:08:30 +0000",
            "description": "Managing editor Dana Wollman and senior editor Devindra Hardawar join host Terrence O’Brien to dig through all the big Google news from the week, including the launch of the Pixel phones. Plus they take a brief detour to talk about what makes the PlayStation VR better than its competitors.",
            "length": "72821150",
            "sourceUrl": "http://media.blubrry.com/the_engadget/http://feeds.soundcloud.com/stream/286408559-engadget-podcast-the-engadget-podcast-episode-9.mp3"
        },
        {
            "title": "The Engadget Podcast Ep 8: He's Simple, He's Dumb, He's the Pilot",
            "datePublished": "Fri, 30 Sep 2016 12:48:26 +0000",
            "description": "Managing editor Dana Wollman, reviews editor Cherlynn Low and senior editor Devindra Hardawar join host Terrence O’Brien to discuss Elon Musk’s plans to colonize Mars, racing 3D boats in Red Hook and the over-simplification of “the cyber” at the first presidential debate.",
            "length": "45688789",
            "sourceUrl": "http://media.blubrry.com/the_engadget/http://feeds.soundcloud.com/stream/285319119-engadget-podcast-the-engadget-podcast-ep-8.mp3"
        },
        {
            "title": "The Engadget Podcast Ep 7: Firestarter",
            "datePublished": "Fri, 23 Sep 2016 10:03:30 +0000",
            "description": "Managing editor Dana Wollman, senior editor Nathan Ingraham and reviews editor Cherlynn Low join guest host Devindra Hardawar to discuss Samsung’s Galaxy Note 7 recall, Uber’s self-driving cars and why the heck Google is making another messaging app.  \n",
            "length": "39756694",
            "sourceUrl": "http://media.blubrry.com/the_engadget/http://feeds.soundcloud.com/stream/284193931-engadget-podcast-the-engadget-podcast-ep-7-i-firestarter.mp3"
        },
        {
            "title": "The Engadget Podcast Ep 6: I Beg Your Pardon (I Never Promised You A Rose Garden)",
            "datePublished": "Fri, 16 Sep 2016 09:00:22 +0000",
            "description": "Managing Editor Dana Wollman and Reviews Editor Cherlynn Low join host Terrence O’Brien to discuss all the latest Apple goodies. Plus they’ll talk about Samsung’s software bandaid for your exploding Note 7 and debate whether or not Edward Snowden deserves a Presidential pardon.\n",
            "length": "69191096",
            "sourceUrl": "http://media.blubrry.com/the_engadget/http://feeds.soundcloud.com/stream/283086236-engadget-podcast-the-engadget-podcast-ep-6-i-beg-your-pardon-i-never-promised-you-a-rose-garden.mp3"
        },
        {
            "title": "The Engadget Podcast Ep 5: Applesauce",
            "datePublished": "Fri, 09 Sep 2016 08:58:51 +0000",
            "description": "Editor-in-Chief Michael Gorman, Executive Editor Christopher Trout and Managing Editor Dana Wollman join host Terrence O’Brien for a special all Apple edition of the podcast from San Francisco. On the show they’ll search for the definition of courage, tell you what it’s really like on the floor of an major press event and give a state of the Apple union.\n",
            "length": "62483970",
            "sourceUrl": "http://media.blubrry.com/the_engadget/http://feeds.soundcloud.com/stream/282060311-engadget-podcast-the-engadget-podcast-ep-5-applesauce.mp3"
        },
        {
            "title": "The Engadget Podcast Ep 4: All Eyez On Me",
            "datePublished": "Fri, 02 Sep 2016 08:59:15 +0000",
            "description": "Editors Cherlynn Low and Devindra Hardawar join host Terrence O’Brien to talk about Intel’s latest CPUs, Dead or Alive’s controversial VR feature and Lenovo’s “innovative” take on the keyboard. Then the panel takes a look at Chris Brown’s standoff and how Instagram videos and Facebook Live fit into our modern media landscape.",
            "length": "67533817",
            "sourceUrl": "http://media.blubrry.com/the_engadget/http://feeds.soundcloud.com/stream/280987765-engadget-podcast-the-engadget-podcast-ep-4-all-eyez-on-me.mp3"
        },
        {
            "title": "The Engadget Podcast Ep 3: Scary Monsters (And Super Creeps)",
            "datePublished": "Thu, 25 Aug 2016 19:54:28 +0000",
            "description": "Editors Nathan Ingraham and Devindra Hardawar join host Terrence O’Brien to talk about Android Nougat, PlayStation 4 rumors and why Amazon would create an Echo-exclusive music service. Then the panel addresses the endless harassment faced by Leslie Jones, and use the word “garbage”... a lot.",
            "length": "35123617",
            "sourceUrl": "http://media.blubrry.com/the_engadget/http://feeds.soundcloud.com/stream/279882384-engadget-podcast-podcast-ep3-longform-v1.mp3"
        },
        {
            "title": "The Engadget Podcast Ep 2: One More Robot",
            "datePublished": "Fri, 19 Aug 2016 08:51:43 +0000",
            "description": "Editors Cherlynn Low, Dana Wollman and Chris Velazco join host Terrence O’Brien to talk about how fitness trackers ruined Happy Meals, the true potential of AI and try to figure out what monster would want the backspace key to navigate back a page in Chrome.",
            "length": "47854235",
            "sourceUrl": "http://media.blubrry.com/the_engadget/http://feeds.soundcloud.com/stream/278870516-engadget-podcast-the-engadget-podcast-ep-2-one-more-robot.mp3"
        },
        {
            "title": "The Engadget Podcast Ep 1: Your Racist Friend",
            "datePublished": "Fri, 12 Aug 2016 14:01:39 +0000",
            "description": "Editors Cherlynn Low, Devindra Hardawar and Nathan Ingraham join host Terrence O’Brien to debate iPhone rumors, explore the perks of renting gadgets, and express their utter exasperation at Snapchat’s racist filters.",
            "length": "36129644",
            "sourceUrl": "http://media.blubrry.com/the_engadget/http://feeds.soundcloud.com/stream/277889969-engadget-podcast-the-engadget-podcast-ep-1-your-racist-friend.mp3"
        },
        {
            "title": "The Engadget Podcast Ep 0: Re-make / Re-model",
            "datePublished": "Fri, 05 Aug 2016 23:04:16 +0000",
            "description": "Editors Dana Wollman, Cherlynn Low and Devindra Hardawar join host Terrence O’Brien to debate Apple’s new water gun emoji, talk about what it’s like to be harassed on Instagram, try to figure out who owns the code that powers our government. \n",
            "length": "36886292",
            "sourceUrl": "http://media.blubrry.com/the_engadget/http://feeds.soundcloud.com/stream/277020341-engadget-podcast-podcast-ep1-v1.mp3"
        }
    ]
}