{
    "artwork": "http://is5.mzstatic.com/image/thumb/Music71/v4/64/ac/2f/64ac2f52-9ecc-2fc1-90c5-d412fb0bb2b6/source/100x100bb.jpg",
    "description": "The Story Of Wrestling is a podcast that examines the world of pro wrasslin through the lens of storytelling. The A.V. Club's crack team of wrestling writers (plus hanger-on Alasdair Wilkins) break down the week in wrestling by focusing on the stories WWE is trying to tell, why those stories work, and why they sometimes don't. Plus, we do our level best to keep it positive (in as non-obnoxious a way as possible), just to mix things up.",
    "feedURL": "http://feeds.feedburner.com/thestoryofwrestling",
    "podcastURL": "https://storyofwrestlingpodcast.wordpress.com",
    "publisher": "Alasdair Wilkins, Kyle Fowle, and LaToya Ferguson",
    "title": "The Story of Wrestling",
    "episodes": [
        {
            "title": "2.4: Wrestling meets Dungeons & Dragons and Batista appreciation with Gideon Bautista",
            "datePublished": "Fri, 13 Dec 2019 00:57:46 +0000",
            "description": "Alasdair takes another sidestep out of the usual discussion to explore how wrestling compares with other kinds of collaborative performance like improv and Dungeons and Dragons. And who better to do that with his own Dungeon Master? Gideon Bautista is a writer, actor, wrestling fan, and longtime D&#38;D player, and he joins Alasdair to discuss how putting together a campaign is like booking a wrestling show. Is playing Dungeons and Dragons like being a wrestler, or is it like being an audience member, liable to take over the show at any point? All that plus plenty of love for WWE's newest Hall of Fame inductee, Dave \"The Animal\" Batista, or Hollywood star Dave Bautista, if you prefer. Is he the most talented actor to ever come out of a wrestling ring? Gideon explains how his fellow Bautista made use of classic Meisner technique in his famous promo on the road to this year's WrestleMania, which Shakespeare character the Animal most reminds him of, and how his 2009 heel turn on Rey Mysterio is absolutely chilling. It's a fun, free-ranging conversation about the mechanics of acting and storytelling in wrestling, so come listen!",
            "length": "41067573",
            "sourceUrl": "http://alasdairwilkins.com/storyofwrestling/Story.Of.Wrestling.12.12.19.mp3",
            "categories": [
                "Uncategorized"
            ]
        },
        {
            "title": "2.3: Local Indy Wrestling and a Kenny Omega Hot Take with Rob Blatt",
            "datePublished": "Wed, 04 Dec 2019 04:49:20 +0000",
            "description": "Alasdair is back in the podcast studio this week joined by Rob Blatt, the \"management representative\" for the Queens-based promotion House of Glory Wrestling and senior referee for Dropkick Depression in New Jersey. That's right, we got a worker on the podcast! Rob details how he got into both wrestling and wrassling as a kid, including his dad's Valentine's Day present (!?) of tickets for the whole family to go see Flair vs. Piper in Nassau Coliseum. We discuss what led him to make the leap that probably more than a few wrestling fans have contemplated by actually going to wrestling school, albeit to become a despicable heel manager... and how he ended up having his first ever match with Homicide. Then we interrupt all that pleasantness to discuss Rob's hot take about All Elite Wrestling, which is that it's one big problem is, well, Kenny Omega. As hot takes go, it's calm, well-considered, and lets us dig into something AEW, which we're both basically in love with, could stand to improve on. Be sure to learn more about both upcoming shows Rob is taking part in by checking out @HOGwrestling for House of Glory and @OperationDD for Dropkick Depression!",
            "length": "55571016",
            "sourceUrl": "http://alasdairwilkins.com/storyofwrestling/Story.Of.Wrestling.12.03.19.mp3",
            "categories": [
                "Uncategorized"
            ]
        },
        {
            "title": "2.2: Kyle Fowle returns to talk WarGames and Dynamite",
            "datePublished": "Wed, 27 Nov 2019 05:41:39 +0000",
            "description": "The team reunites this week, as Kyle rejoins Alasdair for a look back at a fun week in wrestling. Uh, except Survivor Series. We didn't get to that. But my goodness, is there still a ton to talk about! We look at the two explosive WarGames matches from the latest NXT TakeOver, then segue to a look at the latest episode of Dynamite. Are we all ready for Nick Jackson, singles star? Does Darby Allin have a ceiling? Why do we hate MJF so damn much? All that plus an extended look at how AEW is slowly building up its women's division, even as that remains the area where Dynamite is still the farthest behind what WWE is doing...",
            "length": "39274113",
            "sourceUrl": "http://alasdairwilkins.com/storyofwrestling/Story.Of.Wrestling.11.26.19.mp3",
            "categories": [
                "Uncategorized"
            ]
        },
        {
            "title": "2.1: CM Punk and Full Gear with Luis Paez-Pumar",
            "datePublished": "Wed, 20 Nov 2019 17:39:25 +0000",
            "description": "For the first official episode of the podcast's bold new era, Alasdair is joined in by Luis Paez-Pumar, late of Deadspin, a good website. We were planning on really only talking about AEW and Full Gear, but then C.M. Punk had to... well, not technically rejoin WWE, but do the next closest thing. Also, AEW head Tony Khan may not be stepping into the ring anytime soon, but he's proved himself quite happy to hit some serious moves on Twitter, and this simply must be addressed. Then we do look at what worked and what didn't about AEW's first pay-per-view now that Dynamite is up and running. (Spoiler alert: Emi Sakura, please listen to this. Scorpio Sky... maybe less so.) Be sure to check out what Luis and all his former colleagues are up to by following @UnDeadspin on Twitter!",
            "length": "65009771",
            "sourceUrl": "http://alasdairwilkins.com/storyofwrestling/Story.Of.Wrestling.11.19.19.mp3",
            "categories": [
                "Uncategorized"
            ]
        },
        {
            "title": "2.0: PODCAST BACK",
            "datePublished": "Mon, 18 Nov 2019 21:29:23 +0000",
            "description": "From out of nowhere, the podcast lives! After more than a year's hiatus, Alasdair has dusted off the podcast, with plans to start talking wrestling again now that there's so much (mostly outside WWE, we'll get into that) to talk about. As is typically customary for podcasts, there are plans to, uh, have *other* people on as well, but some last-minute scheduling snafus means Alasdair is by himself for this one, channeling his best heel-era Seth Rollins in the first segment of Raw to cut a 40-minute promo about why the podcast went away, why it's back, and what's next. Consider this a little reintroduction before the fun really starts back up again.",
            "length": "39559417",
            "sourceUrl": "http://alasdairwilkins.com/storyofwrestling/Story.Of.Wrestling.11.17.19.mp3",
            "categories": [
                "Uncategorized"
            ]
        },
        {
            "title": "Episode 75: April 14, 2018",
            "datePublished": "Sat, 14 Apr 2018 21:57:41 +0000",
            "description": "It was a massive WrestleMania weekend, and Alasdair and Kyle are here to work through all of it. We save the perfection that was NXT TakeOver: New Orleans for the end of the show, especially since the brilliance of that ladder match and that unsanctioned match have our brains still melted days later. In the meantime, we talk about what worked and what didn't from WrestleMania 34. We're here for the wrestling goodness of the Intercontinental Championship match, the great storytelling and even greater followup for the SmackDown Women's Championship match, and the shocking brilliance of the mixed tag. Plus we try to figure out what was the deal with the increasingly bizarre main event matches. ",
            "length": "79300068",
            "sourceUrl": "http://alasdairwilkins.com/storyofwrestling/Story.Of.Wrestling.04.14.18.mp3",
            "categories": [
                "Uncategorized"
            ]
        },
        {
            "title": "Episode 74: April 7, 2018",
            "datePublished": "Sat, 07 Apr 2018 20:38:21 +0000",
            "description": "Just in time for NXT TakeOver comes our big look at WrestleMania weekend! Alasdair has been going through a whole bunch of stuff lately and is fighting off a cold, so Kyle steps up to carry him much like we assume John Cena would carry the Undertaker if that matches actually happens. (It's going to happen, right? Right!?) We talk through all the matches for both TakeOver and Mania, and why Rusev should win all of them. Well, except the NXT North American Championship, where literally any of the contestants are great picks. Also, seriously, should Rusev just wrestle Cena as the Bulgarian Badass? That and other, non-Rusev questions are all answered within!",
            "length": "53876863",
            "sourceUrl": "http://alasdairwilkins.com/storyofwrestling/Story.Of.Wrestling.04.07.18.mp3",
            "categories": [
                "Uncategorized"
            ]
        },
        {
            "title": "Episode 73: March 24, 2018",
            "datePublished": "Sat, 24 Mar 2018 19:49:09 +0000",
            "description": "Yes! Yes! Yes! That chant can mean only one thing: EC3 got fired on TNA! (What? There were three yeses.) FINE, let's talk Daniel Bryan and his big return to in-ring action. Kyle especially is over the moon about this, and we consider just what it means for WWE to suddenly have another bona fide main eventer at its disposal and the potential stories it can tell. Plus we talk about the Ultimate Deletion and what the future could hold for Bray Wyatt, which Alasdair is pretty convinced will involve a whole lot of Bo Dallas. Plus we pay homage to Johnny Gargano and Tomasso Ciampa, the wrestling-loving grandmother who stood up to that bully Ciampa, and the glorious British shithead that is Zack Sabre Jr.",
            "length": "0",
            "sourceUrl": "http://alasdairwilkins.com/storyofwrestling/Story.Of.Wrestling.03.24.18.mp3",
            "categories": [
                "Uncategorized"
            ]
        },
        {
            "title": "Episode 72: March 10, 2018",
            "datePublished": "Sun, 11 Mar 2018 01:51:20 +0000",
            "description": "It's Fastlane time! And... Alasdair and Kyle try to bring their trademark positivity and optimism to this, but even we have our limits. We discuss just why this whole main event feels like such a mess, throw out an alternative or two, and then try to drag ourselves away from Sunday's action as soon as possible. We talk NXT and future callups, and Alasdair checks in with a report from last weekend's Manhattan Mayhem event from Ring of Honor!",
            "length": "65107010",
            "sourceUrl": "http://alasdairwilkins.com/storyofwrestling/Story.Of.Wrestling.03.08.18.mp3",
            "categories": [
                "Uncategorized"
            ]
        },
        {
            "title": "Episode 71: March 2, 2018",
            "datePublished": "Fri, 02 Mar 2018 20:13:20 +0000",
            "description": "Alasdair and Kyle do something they have been putting off for far too long and turn their attention to SmackDown Live, whether SmackDown Live wants it or not. We start positive by looking at the fiery promo battle between the Usos and the New Day, and we're still insistent that, whatever else you might say about it, the actual match between Charlotte and Ruby Riott ought to be pretty good. Bobby Roode vs. Randy Orton is the rare bout where somehow both faces need to turn heel. Is Shinsuke Nakamura doing anything before WrestleMania? And don't worry, we have plenty to say about the six-pack challenge for the WWE Championship, with a little side conversation about the Elimination Chamber thrown in!",
            "length": "39632814",
            "sourceUrl": "http://alasdairwilkins.com/storyofwrestling/Story.Of.Wrestling.03.02.18.mp3",
            "categories": [
                "Uncategorized"
            ]
        },
        {
            "title": "Episode 70: February 25, 2018",
            "datePublished": "Sun, 25 Feb 2018 17:19:50 +0000",
            "description": "We're back from a week off to get you ready for this evening's Elimination Chamber. Kyle pays tribute to the glory of Seth Rollins, while Alasdair nods along sagely. We consider how that incredible gauntlet match has set things up for tonight, plus where Rollins can go from here on the road to WrestleMania. Honestly, we try to figure out where about half the roster could go on the road to WrestleMania, and it feels weirdly difficult at this point. At least Alasdair remains absolutely convinced we're getting A.J. Styles vs. Shinsuke Nakamura. Don't you dare take this away from him. Plus we have some thoughts on the latest developments in Johnny Gargano's story in NXT!",
            "length": "57995022",
            "sourceUrl": "http://alasdairwilkins.com/storyofwrestling/Story.Of.Wrestling.02.25.18.mp3",
            "categories": [
                "Uncategorized"
            ]
        },
        {
            "title": "Episode 69: February 11, 2018",
            "datePublished": "Sun, 11 Feb 2018 23:46:39 +0000",
            "description": "Alasdair and Kyle dive back into a couple classic Elimination Chamber matches to get ready for the big pay-per-view in two weeks. We look at the first ever such match at Survivor Series 2002, and how so much of it feels like a rough draft for what later iterations would perfect. Then we consider the match from 2014 featuring Randy Orton at his best defending the title against Daniel Bryan, John Cena, and more. When the matches feature 12 wrestlers, 11 of them are former world champions, and the odd man out is Cesaro, we're in for a seriously fun week of talking classic wrestling.",
            "length": "47404697",
            "sourceUrl": "http://alasdairwilkins.com/storyofwrestling/Story.Of.Wrestling.02.11.18.mp3",
            "categories": [
                "Uncategorized"
            ]
        },
        {
            "title": "Quick Preview for Episode 69",
            "datePublished": "Fri, 09 Feb 2018 13:42:36 +0000",
            "description": "Kyle and I will be recording later this weekend, and we will be looking at a pair of past classic Elimination Chamber matches to get ready for the upcoming pay-per-view. If you want to watch ahead of time, they are the 2002 match for the World Heavyweight Championship at Survivor Series and the 2014 match from the Elimination Chamber pay-per-view featuring Daniel Bryan, Randy Orton, and more!",
            "length": "2115049",
            "sourceUrl": "http://alasdairwilkins.com/storyofwrestling/Story.Of.Wrestling.Preview.02.09.18.mp3",
            "categories": [
                "Uncategorized"
            ]
        },
        {
            "title": "Episode 68: February 3, 2018",
            "datePublished": "Sat, 03 Feb 2018 18:42:54 +0000",
            "description": "With an incredible Royal Rumble weekend behind us, Alasdair and Kyle start preparing for the Elimination Chamber and Fastlane. But first, we try to figure out what's realistcally next for Kane, what could ideally be next for Kane, and just generally what purpose Kane could usefully serve in 2018. We feel like we owe him that much. We consider what the Miz and the Intercontinental Championship could be doing, as well as who else is likely to fill out the slots in the men's Elimination Chamber match. Plus we discuss the SmackDown titles scenes with plenty of talk about Rusev, Sami Zayn, the Bludgeon Brothers, and more!",
            "length": "49123837",
            "sourceUrl": "http://alasdairwilkins.com/storyofwrestling/Story.Of.Wrestling.02.03.18.mp3",
            "categories": [
                "Uncategorized"
            ]
        },
        {
            "title": "Royal Rumble Weekend, Part IV: Royal Rumble Reactions",
            "datePublished": "Mon, 29 Jan 2018 07:52:23 +0000",
            "description": "We wrap up our weekend in Philadelphia with our emotionally spent, frequently hoarse reactions to Sunday night's Royal Rumble pay-per-view. The handicap match was better and way more simply booked than we had expected, and the Raw tag team match furthered Jason Jordan's story in spectacular fashion. Beyond that, well, the other two non-Rumble matches didn't do a whole lot for us. But the Rumble matches, my goodness, those were both something very special. We try to break down all the stories and little moments of awesomeness from both Rumbles, all while celebrating just who emerged victorious from each contest. What a weekend...",
            "length": "58150551",
            "sourceUrl": "http://alasdairwilkins.com/storyofwrestling/Story.Of.Wrestling.Royal.Rumble.2018.P4.mp3",
            "categories": [
                "Uncategorized"
            ]
        },
        {
            "title": "Royal Rumble Weekend, Part III: NXT TakeOver: Philadelphia Reactions",
            "datePublished": "Sun, 28 Jan 2018 19:35:01 +0000",
            "description": "Alasdair and Kyle are recovered from the incredible, emotionally exhausting draining experience of going to NXT TakeOver: Philadelphia! We have some spoiler-free praise for the pre-show matches set to air on next Wednesday's show that feature Roderick Strong, Tyler Bate, TM-61, and more. We then break down a card that has some all-time great stuff and some wonky stuff, with more of the latter early on. We look at how injuries affected the storytelling in the tag and women's title matches. We praise Velveteen Dream and his limitless potential, even if he still has things to figure out (which, you know, he's 23 years old, so that's fine). And then we have nothing but praise for Aleister Black and Adam Cole, which would be the match of the night if not for Andrade \"Cien\" Almas and Johnny Gargano melting our minds and our hearts with pure wrestling perfection.",
            "length": "36432168",
            "sourceUrl": "http://alasdairwilkins.com/storyofwrestling/Story.Of.Wrestling.Royal.Rumble.2018.P3.mp3",
            "categories": [
                "Uncategorized"
            ]
        },
        {
            "title": "Royal Rumble Weekend, Part II: Royal Rumble Preview",
            "datePublished": "Sat, 27 Jan 2018 23:31:10 +0000",
            "description": "We're coming at you live from Philly! Alasdair and Kyle are together in the same room at last to break down the Royal Rumble before they head off to NXT TakeOver: Philadelphia! We're excited about the tag title matches, confused about the heavyweight championships, and just generally prepared to be watching the two Rumble matches for hours upon hours. With so many open spots, who might show up? Who will emerge victorious, and why is it Rusev? We've got all your answers as we give you the second of our Royal Rumble weekend episodes!",
            "length": "38922238",
            "sourceUrl": "http://alasdairwilkins.com/storyofwrestling/Story.Of.Wrestling.Royal.Rumble.2018.P2.mp3",
            "categories": [
                "Uncategorized"
            ]
        },
        {
            "title": "Royal Rumble Weekend, Part I: NXT TakeOver Preview",
            "datePublished": "Sat, 27 Jan 2018 00:56:11 +0000",
            "description": "\nIt's Royal Rumble weekend, and Alasdair and Kyle are headed to Philadelphia! We'll have a bunch of episodes coming at you from our trip, and we run down the entire bonkers schedule that we have ahead of us. First up though we have to struggle through technical difficulties one more time to bring you this preview of NXT TakeOver: Philadelphia, which might be the first TakeOver we can recall in which we're most excited about the championship match. But there's plenty to like about the other four matches, and we break it all down as we get ready for the likes of Ember Moon and the Undisputed Era to defend their titles. Plus we take a few minutes at the end to discuss the all-important question of 205 Live's General Manager. Oh and thanks for giving us so little to talk about, Raw 25, we owe you one!",
            "length": "29170925",
            "sourceUrl": "http://alasdairwilkins.com/storyofwrestling/Story.Of.Wrestling.Royal.Rumble.2018.P1.mp3",
            "categories": [
                "Uncategorized"
            ]
        },
        {
            "title": "Episode 62: January 21, 2018",
            "datePublished": "Mon, 22 Jan 2018 03:19:20 +0000",
            "description": "Kyle and Alasdair have another round of awesome listener questions. We consider whether the returns on Raw 25 will throw off the thrill of the legends who might be in the Royal Rumble. We look at just who we want to see show up in the first ever Women's Royal Rumble. We try to work out just how the WWE Championship match can work out that isn't just all Shane McMahon all the time. And we have take a look at what else we're getting excited about for NXT Takeover: Philly and the Royal Rumble!",
            "length": "64546531",
            "sourceUrl": "http://alasdairwilkins.com/storyofwrestling/Story.Of.Wrestling.01.21.18.mp3",
            "categories": [
                "Uncategorized"
            ]
        },
        {
            "title": "Episode 61: January 14, 2018",
            "datePublished": "Sun, 14 Jan 2018 21:50:52 +0000",
            "description": "Alasdair and Kyle are here to answer your questions as we continue on the Road to the Road to Wrestlemania, otherwise known as the build to the Royal Rumble. But first, we discuss the all-over brilliance of Jason Jordan, the most wonderfully annoying wannabe in WWE, and the incredible coolness of the Balor Club. We're asked to pay our respects to the Miztourage, all-time great stable. We debate who should win the inaugural Women's Royal Rumble. We wonder what Braun Strowman could do at WrestleMania if he's not involved with the Universal Championship. And we look at the women of NXT and who has us most excited about their potential.",
            "length": "59188712",
            "sourceUrl": "http://alasdairwilkins.com/storyofwrestling/Story.Of.Wrestling.01.14.18.mp3",
            "categories": [
                "Uncategorized"
            ]
        },
        {
            "title": "Episode 60: January 6, 2018",
            "datePublished": "Sat, 06 Jan 2018 21:51:15 +0000",
            "description": "\nWe keep it simple for our first episode of 2018. Recording the night after New Japan's Wrestle Kingdom, we look at the most Canadian match ever (give or take the Harts, Edge and Christian, and Kevin Owens and Sami Zayn), as the twin toasts of Winnipeg Chris Jericho and Kenny Omega went at it for 36 glorious minutes. Check out this match if you haven't, or give us a chance to explain why this is worth watching, as it fuses the best of WWE and New Japan, with a bit of old-school Ric Flair-style psychology thrown in. Then we look at the bizarrely muddled main event scene on SmackDown and try to figure out who to root for other than Alasdair's beloved adult son A.J. Styles. We also are all-in on Jason Jordan, proto-heel.",
            "length": "57019084",
            "sourceUrl": "http://alasdairwilkins.com/storyofwrestling/Story.Of.Wrestling.01.06.18.mp3",
            "categories": [
                "Uncategorized"
            ]
        },
        {
            "title": "Episode 59: December 31, 2017",
            "datePublished": "Sun, 31 Dec 2017 21:02:22 +0000",
            "description": "We look back at the year in wrestling in 2017, which somehow -- because we're idiots -- means looking back on the Fastlane card and trying to convince ourselves that the Club and Bayley were champs on the road to WrestleMania. Then we look ahead to what's coming in 2018, including who we think could be a Braun Strowman-like breakout star next year, how ridiculously good the build for the next TakeOver is looking, what story it would take to push WWE back into the mainstream, how to fix both women's divisions in time for Mania, and more! Thanks to everyone for listening this year, and we'll be right back at it in 2018!",
            "length": "79975496",
            "sourceUrl": "http://alasdairwilkins.com/storyofwrestling/Story.Of.Wrestling.12.31.17.mp3",
            "categories": [
                "Uncategorized"
            ]
        },
        {
            "title": "Episode 58: December 23, 2017",
            "datePublished": "Sun, 24 Dec 2017 01:12:10 +0000",
            "description": "Never fear, listeners, Kyle is back to stop Alasdair from just talking to himself for another 42 minutes. We talk all things \"Clash of Champions,\" including the shocker that was the United States Championship match being maybe the best of the night. Possibly? Kyle is ready to say so, but Alasdair doesn't want anyone discounting how Jinder Mahal (and A.J. Styles) wrestled a damn mat classic. We also grapple with the psychology of the tag team and women's matches, and segue into some discussion of the women's Royal Rumble match, which is awesome, but also how it highlights the lack of individual storytelling in the division, which is less awesome. Also... yeah, let's talk about Kane.",
            "length": "64828237",
            "sourceUrl": "http://alasdairwilkins.com/storyofwrestling/Story.Of.Wrestling.12.23.17.mp3",
            "categories": [
                "Uncategorized"
            ]
        },
        {
            "title": "Episode 57: December 17, 2017",
            "datePublished": "Sun, 17 Dec 2017 08:16:21 +0000",
            "description": "With Kyle busy on a special project, Alasdair podcasts with a broomstick for a ridiculous 42 minutes of solo talking on Clash of Champions. He breaks down the title matches, including a lengthy discussion of the SmackDown women's division, whether Baron Corbin can continue his streak of shockingly good triple threat matches, how pretty much all the teams in the tag title match feel like fleshed-out people beyond how they function as faces or heels, and just what the story is with the Yep Movement and the show's authority figures. Also, let's just take a moment and recognize the brilliance of Roman Reigns and Cesaro. Don't worry, Kyle will be back soon.",
            "length": "40993249",
            "sourceUrl": "http://alasdairwilkins.com/storyofwrestling/Story.Of.Wrestling.12.17.17.mp3",
            "categories": [
                "Uncategorized"
            ]
        },
        {
            "title": "Episode 56: December 10, 2017",
            "datePublished": "Sun, 10 Dec 2017 22:00:11 +0000",
            "description": "We're back after a week off with plenty to talk about, thanks to another fantastic round of listener questions. We look at the two new women's factions on Raw and SmackDown and how they look in their first few weeks. We're optimistic about Absolution and think the Riott Squad could be good, but the general state of SmackDown's women's division is so weird it's hard to say for sure. We take a closer look at NXT stars Velveteen Dream and Kassius Ohno and consider what their potential is in WWE. And, of course, we take plenty of time to appreciate the woken brilliance of Matt Hardy.",
            "length": "77472756",
            "sourceUrl": "http://alasdairwilkins.com/storyofwrestling/Story.Of.Wrestling.12.10.17.mp3",
            "categories": [
                "Uncategorized"
            ]
        },
        {
            "title": "Episode 55: November 25, 2017",
            "datePublished": "Sat, 25 Nov 2017 18:14:44 +0000",
            "description": "\nAlasdair and Kyle look back on the many joys and occasional frustrations of NXT Takeover: War Games and Survivor Series. Wait, that's ambiguous: Takeover was just joys. The weirdness was all on Survivor Series, though we did legitimately have to struggle with which was the better show because both had some classic matches and stories. We start small with how the likes of Miz-Corbin were way better than they had any right to be, before talking about how Velveteen Dream-Aleister Black was pretty much perfect. We pay our respects to the next NXT champions coming out of Takeover, and we revel in the tag team glory of this week, with a special shout-out to the Bar and the Usos. Also, that War Games match... my goodness. And Brock Lesnar-AJ Styles... double my goodness.",
            "length": "82228714",
            "sourceUrl": "http://alasdairwilkins.com/storyofwrestling/Story.Of.Wrestling.11.25.17.mp3",
            "categories": [
                "Uncategorized"
            ]
        },
        {
            "title": "Episode 54: November 18, 2017",
            "datePublished": "Sun, 19 Nov 2017 03:29:53 +0000",
            "description": "It's a Big Four weekend, and Alasdair and Kyle are here to talk Survivor Series and -- thanks to a delay in editing -- preview an NXT Takeover that has already, you know, happened. Never mind, though, as the main focus is on Survivor Series and which matches have us most excited. There are at least four incredible-looking matches on the card, but we also consider the lesser lights of, say, the Miz vs. Baron Corbin and the trickiness of heel vs. heel storytelling. Then we devote the back half of the episode to three matches that offer a hint of what to expect from Brock Lesnar vs. AJ Styles, as we look at Brock's matches against Eddie Guerrero at No Way Out 2004, CM Punk at SummerSlam 2013, and Seth Rollins at Battleground 2015.",
            "length": "65053860",
            "sourceUrl": "http://alasdairwilkins.com/storyofwrestling/Story.Of.Wrestling.11.18.17.mp3",
            "categories": [
                "Uncategorized"
            ]
        },
        {
            "title": "Episode 53: November 11, 2017",
            "datePublished": "Sun, 12 Nov 2017 03:24:07 +0000",
            "description": "Happy Rusev Day, everyone! But before we get to the most gloriously ludicrous yet strangely perfect Rusev fantasy booking ever -- seriously, Kyle got chills from Alasdair's latest idea -- we talk about everything else that's happened this week. We consider how Chris Jericho built a feud with Kenny Omega for New Japan's Wrestle Kingdom 12. We talk about the storytelling in the match between A.J. Styles and Jinder Mahal, and after all these months we make as much of an effort as we are ever will to say nice things about Jinder. We try to talk friend of the show Jim DeCoyote off the proverbial WWE ledge. And then... again, happy Rusev Day, everyone.",
            "length": "68668864",
            "sourceUrl": "http://alasdairwilkins.com/storyofwrestling/Story.Of.Wrestling.11.11.17.mp3",
            "categories": [
                "Uncategorized"
            ]
        },
        {
            "title": "Episode 52: November 5, 2017",
            "datePublished": "Sun, 05 Nov 2017 22:43:22 +0000",
            "description": "Another amazing batch of questions means Alasdair and Kyle have plenty to talk about without even bothering to worry too much about what's been going on in WWE this week. We consider which wrestlers early in their careers could be huge breakout stars. We ponder managers and who could benefit most from having one. Special attention is paid to Sami Zayn, Samoa Joe, and Asuka, because they demand it. Plus Alasdair unleashes some truly bonkers booking to get Rusev, Tye Dillinger, and A.J. Styles (naturally) where they belong on the SmackDown card!",
            "length": "75787125",
            "sourceUrl": "http://alasdairwilkins.com/storyofwrestling/Story.Of.Wrestling.11.05.17.mp3",
            "categories": [
                "Uncategorized"
            ]
        },
        {
            "title": "Episode 51: October 28, 2017",
            "datePublished": "Sun, 29 Oct 2017 01:24:49 +0000",
            "description": "The best round of listener questions ever means we mostly spend this week's episode talking about what you all want us to talk about. We kick off with some general discussion of the two-match affair (apologies, Asuka-Emma) that was TLC, with Alasdair asking Kyle the all-important question about the bonkers main event. Alasdair is also finally willing to get on board with a Finn Balor main event push after that match with A.J. Styles, because Alasdair keeps finding new and creative ways to stan for A.J. Styles. Then we take listener questions about Sami Zayn's new direction, the hottest new tag team in NXT, the secret of a great heel turn, the recent mini-exodus of WWE talent, the best spot in WWE for indie sensation Ricochet, and a secondary women's belt. Most importantly, we spend a solid 10 minutes breaking down a gif (https://twitter.com/WWEtriviaTO/status/923619338992701441) of the newly formed Zo Train doing Enzo Amore's trademark dance, and Drew Gulak has never been more incredible in our eyes. ",
            "length": "89974332",
            "sourceUrl": "http://alasdairwilkins.com/storyofwrestling/Story.Of.Wrestling.10.28.17.mp3",
            "categories": [
                "Uncategorized"
            ]
        },
        {
            "title": "Episode 50: October 21, 2017",
            "datePublished": "Sat, 21 Oct 2017 16:38:29 +0000",
            "description": "It's our landmark 50th episode, which Alasdair, in true WWE at WrestleMania 25 fashion, keeps wrongly calling the 50th anniversary show. Seriously, where to begin with this one? To mark the milestone, we asked original cohost and much cooler person LaToya Ferguson to make a one-off return, which she did! She talks about the book she's working on and the state of Impact Wrestling and helps us answer some questions about TLC. But that's the thing: We recorded the main episode before the last-minute reshuffling of the TLC card, so Kyle and Alasdair jumped back on to record a special prologue segment in which we discuss Kurt Angle's in-ring return and A.J. Styles taking on Finn Balor in a battle of the Bullet Club. You're getting a lot from this one, basically. Here's to 50 more!",
            "length": "79490279",
            "sourceUrl": "http://alasdairwilkins.com/storyofwrestling/Story.Of.Wrestling.10.21.17.mp3",
            "categories": [
                "Uncategorized"
            ]
        },
        {
            "title": "Episode 49: October 15, 2017",
            "datePublished": "Sun, 15 Oct 2017 17:50:43 +0000",
            "description": "Alasdair and Kyle talk about Hell in a Cell, which we pretty much just confine to those two Hell in a Cell matches, because (with apologies to that triple threat, maybe) what else is there really to talk about? We consider the future of the tag team division and the New Day's place in it (or elsewhere?), along with plenty of discussion of one Mr. Sami Zayn. We then talk all about the Shield reuniting and the absolute mind-melting 4-on-3 TLC match we're headed toward. Plus we consider the state of the women's divisions and why they so frequently feel like a mess. And then we chase it all with lots of well-deserved praise for the perfection that is NXT right now.",
            "length": "65149228",
            "sourceUrl": "http://alasdairwilkins.com/storyofwrestling/Story.Of.Wrestling.10.15.17.mp3",
            "categories": [
                "Uncategorized"
            ]
        },
        {
            "title": "Episode 48: October 7, 2017",
            "datePublished": "Sat, 07 Oct 2017 17:33:41 +0000",
            "description": "We were too busy to get in a podcast last week, but we're back! Alasdair and Kyle take a look at the baffling storytelling of the Braun-Brock match at No Mercy, then move on as swiftly as WWE has. We take a look at most of the non-Jinder stuff to be excited about from Hell in a Cell. Alasdair goes fully mental with a ringing endorsement of 205 Live, and Kyle finds himself in worrying levels of agreement. Then there's some Canadian Thanksgiving discussion, where Alasdair keeps emphasizing the \"Canadian\" part to the point of mild violence against Kyle.",
            "length": "36086876",
            "sourceUrl": "http://alasdairwilkins.com/storyofwrestling/Story.Of.Wrestling.10.07.17.mp3",
            "categories": [
                "Uncategorized"
            ]
        },
        {
            "title": "Episode 47: September 24, 2017",
            "datePublished": "Sun, 24 Sep 2017 16:52:07 +0000",
            "description": "Just in time for tonight's No Mercy, Kyle and Alasdair weigh in on the card. We're so, so ready for Lesnar-Strowman and Cena-Reigns, but we've also been weirdly run over by all things Jason Jordan, though maybe that's just a continued tribute to the Miz. And Alasdair seriously wants nothing more than Neville to hit the Empire Elbow on Enzo. All that plus we kind of have no choice but to look at Jinder Mahal's horrendous, racist promo. We get back on track by answering some of your great questions, so thanks for sustaining us in these trying times!",
            "length": "70318133",
            "sourceUrl": "http://alasdairwilkins.com/storyofwrestling/Story.Of.Wrestling.09.24.17.mp3",
            "categories": [
                "Uncategorized"
            ]
        },
        {
            "title": "Episode 46: September 17, 2017",
            "datePublished": "Sun, 17 Sep 2017 18:21:48 +0000",
            "description": "Warning: Alasdair is wrong and confused all over the place in this episode. He apparently thinks Shelton Benjamin's tag team partner is Kurt Angle, and he totally launches into the wrap-up forgetting we hadn't yet talked about the Mae Young Classic. Hopefully these momentary lapses make all his other takes all the more brilliant and trenchant? Or maybe it's just up to Kyle to carry Alasdair to a great episode this week, as he returns after a week away to talk Kevin Owens pummeling Vince McMahon, Jason Jordan raising his stock against Roman Reigns and John Cena, the Usos and the New Day reaching tag team perfection, and more!",
            "length": "72645330",
            "sourceUrl": "http://alasdairwilkins.com/storyofwrestling/Story.Of.Wrestling.09.17.17.mp3",
            "categories": [
                "Uncategorized"
            ]
        },
        {
            "title": "Episode 45: September 9, 2017",
            "datePublished": "Sun, 10 Sep 2017 03:09:55 +0000",
            "description": "Kyle is otherwise busy this week, but that's not going to stop Alasdair from being you your weekly podcast fix. He and his Inverse coworker Eric Francisco grab 30 minutes to talk all things Asuka after the Empress of Tomorrow officially vacated the NXT Women's Championship on this week's episode. We discuss what stories Asuka could get into on the main roster, what's the future of her former championship, and who would be the best and/or worst person to get that very first pinfall or submission victory. We should be back to normal next week, but hope you enjoy this little impromptu episode!",
            "length": "25652513",
            "sourceUrl": "http://alasdairwilkins.com/storyofwrestling/Story.Of.Wrestling.09.09.17.mp3",
            "categories": [
                "Uncategorized"
            ]
        },
        {
            "title": "Episode 44: September 3, 2017",
            "datePublished": "Sun, 03 Sep 2017 13:15:19 +0000",
            "description": "We spend the first hour talking nothing but women's wrestling, which makes perfect sense given the Mae Young Classic began this week. That said, Kyle wanted to talk about Nia Jax, so that's where we actually begin. Seriously, what's going on with the Raw women's division, and what's the best way to cure what ails it? Then we do indeed turn to the big women's tournament, naming our favorite matches from the first round and which wrestlers impressed us most in the early going. Then we spend the final 15 minutes surveying the NXT landscape, especially how Drew McIntyre could prove to be a perfectly versatile champion. Oh, right, and John Cena and Roman Reigns had some sort of promo together. We'll get to that too.",
            "length": "79544580",
            "sourceUrl": "http://alasdairwilkins.com/storyofwrestling/Story.Of.Wrestling.09.03.17.mp3",
            "categories": [
                "Uncategorized"
            ]
        },
        {
            "title": "Episode 43: August 26, 2017",
            "datePublished": "Sat, 26 Aug 2017 16:11:37 +0000",
            "description": "We open with what was, at the time of recording, breaking news about Asuka's status in WWE. It's a nice distraction from a largely disappointing SummerSlam weekend, though we do find plenty of post-Takeover goodies to dig into, at least once you get past how weird John Cena has been lately. There's the ascendancy of Braun Strowman, the continued renaissance of tag team wrestling in WWE, SmackDown becoming glorious, and even 205 Live getting an unexpected shot in the arm with the arrival of a certain Certified G. (Which Alasdair was in Brooklyn to see happen live, otherwise there's a good chance we wouldn't have mentioned it.) All that plus we tackle two important questions: What the hell is going on with Rusev? And, seriously, what the hell is going on with Rusev?",
            "length": "66242189",
            "sourceUrl": "http://alasdairwilkins.com/storyofwrestling/Story.Of.Wrestling.08.26.17.mp3",
            "categories": [
                "Uncategorized"
            ]
        },
        {
            "title": "Episode 42: August 20, 2017",
            "datePublished": "Sun, 20 Aug 2017 19:23:42 +0000",
            "description": "The latest NXT Takeover was so good that we just had to talk about it the next day! Alasdair was in the building in Brooklyn for the second straight year, while Kyle was following along on the network. We go match by match through the card. We revel in the awesomeness of Gargano-Almas. We explain why Sanity-AoP worked as well as it did, and why this was the wholly unexpected but most welcome Alexander Wolfe coming out party. We have more complicated feelings about Black-Itami, but we've got nothing but the highest praise for Asuka-Ember II. And let's not forget the main event of Roode-McIntyre, and how it sets up a whole new faction BAY BAY.",
            "length": "57149487",
            "sourceUrl": "http://alasdairwilkins.com/storyofwrestling/Story.Of.Wrestling.08.20.17.mp3",
            "categories": [
                "Uncategorized"
            ]
        },
        {
            "title": "Episode 41: August 18, 2017",
            "datePublished": "Fri, 18 Aug 2017 06:58:50 +0000",
            "description": "It's SummerSlam week! And, more importantly, it's \"What the hell is going on with Baron Corbin?\" week! We look at Tuesday's failed cash-in from every possible storytelling angle we can figure, as we try to work out what the Lone Wolf has to offer after this insane development. In happier news, we take a look at this weekend's activities, with a particular focus on the truly excellent NXT Takeover card. Plus we consider when Carmella should cash in and what a return to the Attitude Era would mean for modern-day WWE!",
            "length": "73254024",
            "sourceUrl": "http://alasdairwilkins.com/storyofwrestling/Story.Of.Wrestling.08.18.17.mp3",
            "categories": [
                "Uncategorized"
            ]
        },
        {
            "title": "Episode 40: August 12, 2017",
            "datePublished": "Sat, 12 Aug 2017 16:05:43 +0000",
            "description": "We kick off with a couple announcements! Alasdair is looking to enlist some of you lovely wrestling fans to help predict the event of SummerSlam for Inverse, while Kyle is getting back in the WWE reviewing game at Real Sport 101! We've got all the details on both of those at the top of the episode. Next up, Kyle was in the building for SmackDown Live, and we discuss the rare thrill of being live in the building for Mahal-Orton IV. We also discuss some Wyatt Family members and what kinds of stories would best bring out their characters. Finally we run down the card for Progress Wrestling's New York show this Saturday night (which, incidentally, we recorded before the late-breaking news that Pete Dunne is out of action for the show).",
            "length": "62409085",
            "sourceUrl": "http://alasdairwilkins.com/storyofwrestling/Story.Of.Wrestling.08.12.17.mp3",
            "categories": [
                "Uncategorized"
            ]
        },
        {
            "title": "Episode 39: August 5, 2017",
            "datePublished": "Sat, 05 Aug 2017 19:51:26 +0000",
            "description": "We take a quick look at the state of the SummerSlam card after an exciting SmackDown, wondering just what the future holds for new number one contender Shinsuke Nakamura. (We're really feeling the Baron Corbin cash-in, but maybe we're getting ahead of ourselves.) But the real focus of today's episode is a look back at two recent classic matches, both of which involve your pal and mine, the Big Dog himself, Mr. Roman Reigns. First up, we look at the contemporary match that cemented Alasdair as a fan forever, Reigns vs. A.J. Styles at Extreme Rules 2017. Then Kyle tries to show Alasdair just why he can't give up on Bray Wyatt with the Elimination Chamber 2014 six-man tag between the Shield and the Wyatt Family. It's very, very good... but Alasdair might just mark for Luke Harper anyway.",
            "length": "62017874",
            "sourceUrl": "http://alasdairwilkins.com/storyofwrestling/Story.Of.Wrestling.08.05.17.mp3",
            "categories": [
                "Uncategorized"
            ]
        },
        {
            "title": "Episode 39: August 5, 2017",
            "datePublished": "Sat, 05 Aug 2017 19:33:52 +0000",
            "description": "We take a quick look at the state of the SummerSlam card after an exciting SmackDown, wondering just what the future holds for new number one contender Shinsuke Nakamura. (We're really feeling the Baron Corbin cash-in, but maybe we're getting ahead of ourselves.) But the real focus of today's episode is a look back at two recent classic matches, both of which involve your pal and mine, the Big Dog himself, Mr. Roman Reigns. First up, we look at the contemporary match that cemented Alasdair as a fan forever, Reigns vs. A.J. Styles at Extreme Rules 2017. Then Kyle tries to show Alasdair just why he can't give up on Bray Wyatt with the Elimination Chamber 2014 six-man tag between the Shield and the Wyatt Family. It's very, very good... but Alasdair might just mark for Luke Harper anyway.",
            "length": "62017874",
            "sourceUrl": "http://alasdairwilkins.com/storyofwrestling/Story.Of.Wrestling.08.05.17.mp3",
            "categories": [
                "Uncategorized"
            ]
        },
        {
            "title": "Episode 38: July 29, 2017",
            "datePublished": "Sat, 29 Jul 2017 15:01:26 +0000",
            "description": "Kyle returns for a late-night recording, which is always way crazier and sillier (and, yeah, probably better) than our morning recordings. Battleground was very mean and rude to all of us, but then SmackDown Live went ahead and completely redeemed itself. Alasdair tries to discuss this without just being a shameless A.J. Styles mark, but, come on... you know he's not going to manage it. We also take a bit of time to recognize the beefy majesty of Raw's contribution to the SummerSlam main event. It's just... so damn beautiful. We also consider what the worst pay-per-views have been since we started watching, which leads us down a weird, Battleground 2013-related rabbit hole.",
            "length": "66419400",
            "sourceUrl": "http://alasdairwilkins.com/storyofwrestling/Story.Of.Wrestling.07.29.17.mp3",
            "categories": [
                "Uncategorized"
            ]
        },
        {
            "title": "Episode 37: July 22, 2017",
            "datePublished": "Sat, 22 Jul 2017 21:18:32 +0000",
            "description": "Kyle is on vacation this week, but Alasdair decides that's no reason not to talk wrestling, especially when the deeply strange Battleground pay-per-view is tomorrow. So he's joined by Jim (@MrDeCoyote), fan of the podcast, reactor from the Fine Brothers web series, and creator of his own YouTube series \"The Theory of Wrestling.\" He recently cut a promo in which he gave WWE an intervention for its reliance on xenophobic tropes, which the Cena-Rusev and Orton-Mahal angles are just marinated in. Alasdair and Jim analyze why WWE loves this kind of story so much and why some wrestlers are able to be interesting despite it (Kevin Owens!) while others aren't (sigh... Jinder). All that plus some general thoughts on Battleground, where legit the most intriguing thing might be who on earth could be behind the Breezango attacks. For lack of a better option, we're rooting for the Club.",
            "length": "43607610",
            "sourceUrl": "http://alasdairwilkins.com/storyofwrestling/Story.Of.Wrestling.07.22.17.mp3",
            "categories": [
                "Uncategorized"
            ]
        },
        {
            "title": "Episode 36: July 15, 2017",
            "datePublished": "Sat, 15 Jul 2017 23:58:11 +0000",
            "description": "Great Balls of Fire was a really great pay-per-view, and Alasdair and Kyle are here to discuss it. We're mostly focusing on the fire that is the (hopefully continuing) Brock and Joe feud, which we're very ready to have include Roman Reigns and Braun Strowman as well. Could SummerSlam give us the beefiest fatal four-way of all time with those competitors? Please, tell us it's possible. We also consider the latest iteration of Reigns's ever curious characterization, and talk up the 30-minute iron man match between the Hardyz and Sheamus and Cesaro. Then Alasdair toasts his last week at the A.V. Club (but don't worry, he's not going anywhere as far as the podcast is concerned) by talking about how incredible AJ Styles is. You know, the way he always does.",
            "length": "57363896",
            "sourceUrl": "http://alasdairwilkins.com/storyofwrestling/Story.Of.Wrestling.07.14.17.mp3",
            "categories": [
                "Uncategorized"
            ]
        },
        {
            "title": "Episode 35: July 8, 2017",
            "datePublished": "Sat, 08 Jul 2017 16:31:43 +0000",
            "description": "We offer our preview of Sunday's big pay-per-view Great Balls of Fire, which we're just stupidly excited about. Damn near every match on the card looks super fun, as long as you don't ask us to say much about Seth Rollins vs. Bray Wyatt. (We still do, because we're gluttons for punishment.) But mostly we look at the beefiest of all main events, as Brock Lesnar and Samoa Joe look to pay off their white-hot build with a seriously badass match, while Braun Strowman and Roman Reigns run it back one more time in an Ambulance Match. Also, we realize there's literally nobody left for Sheamus and Cesaro to feud with, unless you're really into Heath Slater and Rhyno. Which we are, but still. Also, Alasdair marks for Emma, as he is wont to do.",
            "length": "64357187",
            "sourceUrl": "http://alasdairwilkins.com/storyofwrestling/Story.Of.Wrestling.07.07.17.mp3",
            "categories": [
                "Uncategorized"
            ]
        },
        {
            "title": "Episode 34: July 1, 2017",
            "datePublished": "Sat, 01 Jul 2017 21:27:37 +0000",
            "description": "Not going to lie: Money in the Bank was so brutal we just needed to take last week off. (Also, there was some wedding-related scheduling issues. But mostly that PPV was not very good, main event excepted.) Anyway, we get right back into the swing of things with a lot of Raw talk ahead of Great Balls of Fire, with some praise for Enzo, Samoa Joe, and the actual, honest-to-goodness meta-booking brilliance of Roman and Braun's feud. Also, we try not to talk about the women's Money in the Bank brouhaha, but then we totally talk about it for like 10 minutes. All that and a look at a brilliantly hard-hitting NXT episode, featuring a historic main event between Asuka and Nikki Cross and the return of your friend and mine Mauro Ranallo to the broadcast booth!",
            "length": "59784714",
            "sourceUrl": "http://alasdairwilkins.com/storyofwrestling/Story.Of.Wrestling.07.01.17.mp3",
            "categories": [
                "Uncategorized"
            ]
        },
        {
            "title": "Episode 33: July 16, 2017",
            "datePublished": "Fri, 16 Jun 2017 21:52:18 +0000",
            "description": "We look ahead to Money in the Bank and try to figure out what holding the briefcase means when Jinder Mahal is champion. These times remain exquisitely weird. A listener managed to leave us a comment through the Wordpress site where we host these podcasts, which we didn't even realize was possible, and Alasdair wastes some amazingly British turns of phrase by reading it in his coarse American accent. Plus we take some Twitter questions on what to do with Rusev, how to deal with so much wrestling content out there, and what new kinds of stories WWE could be looking to tell.",
            "length": "63204876",
            "sourceUrl": "http://alasdairwilkins.com/storyofwrestling/Story.Of.Wrestling.06.16.17.mp3",
            "categories": [
                "Uncategorized"
            ]
        },
        {
            "title": "Episode 32: June 11, 2017",
            "datePublished": "Sun, 11 Jun 2017 21:14:56 +0000",
            "description": "We look back on Extreme Rules and its dynamite main event, which mostly turns into a lengthy homage to the greatness of Samoa Joe. Also, it turns out most of the stories we're most interested in on Raw weren't even on the pay-per-view. What's the future of the Titus Brand? Who is beating up Enzo, and why is it probably that dastardly faker Big Cass?  Is the main event of WrestleMania big enough to contain R-Truth and Goldust? All that plus Alasdair and Kyle run down the longest-reigning IC champs of all time, for some reason!",
            "length": "65916177",
            "sourceUrl": "http://alasdairwilkins.com/storyofwrestling/Story.Of.Wrestling.06.11.17.mp3",
            "categories": [
                "Uncategorized"
            ]
        },
        {
            "title": "Episode 31: June 3, 2017",
            "datePublished": "Sat, 03 Jun 2017 18:28:08 +0000",
            "description": "Alasdair and Kyle check in with an Extreme Rules preview after a generally strong go-home show for Monday Night Raw. They consider why the two matches between the five competitors showcased all at their best, then turn their attention to the rest of the card. Sure, that business with Bayley and Alexa Bliss was pretty terrible, but most other things are ticking along nicely. Alasdair wonders whether Dean Ambrose and the Miz's match can aspire to the same heights of \"title changes on a DQ\" nonsense as Randy Orton and Christian at Money in the Bank 2011, while Kyle recognizes the simple fun of Rich Swann and Sasha Banks hanging out. Plus we look at Tomasso Ciampa's brutal heel promo on NXT, and Alasdair answers a reader question by putting together a super card of dream matches featuring all active (and retired but not permanently injured) wrestlers across all promotions!",
            "length": "70296805",
            "sourceUrl": "http://alasdairwilkins.com/storyofwrestling/Story.Of.Wrestling.06.03.17.mp3",
            "categories": [
                "Uncategorized"
            ]
        },
        {
            "title": "Episode 30: May 28, 2017",
            "datePublished": "Sun, 28 May 2017 19:49:44 +0000",
            "description": "Much to Kyle's delight, we completely skip Raw this week and focus our attentions on NXT Takeover: Chicago, which was great, and Backlash, which was... hey, did you all see NXT Takeover: Chicago? We jump straight in with huge praise for all things UK Championship, with Tyler Bate and Pete Dunne putting on a damn match of the year candidate. We consider what kind of match would best showcase Shinsuke Nakamura, then look at the improving state of the tag division in this beautiful Breezango-driven world. But then we have to mourn the end of DIY, and a week later we're still not really ready to face it. Oh, and Jinder Mahal is champion. Um. Yeah. So, you see NXT Takeover: Chicago?",
            "length": "67517421",
            "sourceUrl": "http://alasdairwilkins.com/storyofwrestling/Story.Of.Wrestling.05.28.17.mp3",
            "categories": [
                "Uncategorized"
            ]
        },
        {
            "title": "Episode 29: May 20, 2017",
            "datePublished": "Sat, 20 May 2017 21:04:27 +0000",
            "description": "Kyle and Alasdair compare and contrast what it was like to watch Raw on TV versus actually being there in the Prudential Center. Kyle found Raw roughly sledding from the comfort of home, but maybe Alasdair enjoyed it more live? (Well... yeah, but only a little.) If nothing else, we're both really getting into the mad magic of the Titus Brand. Then we check in on the SmackDown feuds with Backlash set for tomorrow. Alasdair drops his boldest take ever by suggesting Randy Orton and Jinder Mahal might actually have a sneakily okay match and he already regrets it. Plus he offers a quick breakdown of Friday's UK Championship special, with another round of praise for his favorite flippy Welshman, Mark Andrews!",
            "length": "77641602",
            "sourceUrl": "http://alasdairwilkins.com/storyofwrestling/Story.Of.Wrestling.05.20.17.mp3",
            "categories": [
                "Uncategorized"
            ]
        },
        {
            "title": "Episode 28: May 13, 2017",
            "datePublished": "Sat, 13 May 2017 21:18:52 +0000",
            "description": "We've got something super special in store for you today! We take a much-needed break from the week-to-week grind of WWE. Both Kyle and Alasdair attended shows for Ring of Honor and New Japan's War of the Worlds tour, with Kyle offering his thoughts on a Kenny Omega-headlined show in Toronto. Alasdair has a few thoughts on the New York show in the Hammerstein Ballroom, but mostly he's here to turn over the microphone to his girlfriend Rebekah, who literally had never watched any wrestling live or on TV before going to a joint ROH/New Japan pay-per-view. She shares her newcomer's perspective on the show, and let's just say Will Ospreay and Jay White will be very happy with what she has to say. Then Alasdair and Kyle answer some questions from listeners, including a whole lot on the various goings-on in WWE's women's divisions.",
            "length": "92214201",
            "sourceUrl": "http://alasdairwilkins.com/storyofwrestling/Story.Of.Wrestling.05.13.17.mp3",
            "categories": [
                "Uncategorized"
            ]
        },
        {
            "title": "Episode 27: May 5, 2017",
            "datePublished": "Fri, 05 May 2017 13:00:30 +0000",
            "description": "\nYeah, we both liked the House of Horrors match. Don't worry, this is (probably!) still worth listening to. We explain why we enjoyed the glorious trainwreck of Bray Wyatt and Randy Orton's final (surely, right?) encounter, then get into why A.J. Styles and Sami Zayn connect with us more consistently than similarly talented dudes of roughly similar stature like Seth Rollins and Finn Balor. We pay tribute to the last chapter of the JeriKO saga, then take a moment to recognize the brilliance of Breezango and the Fashion Files. All that and Kyle's preview of his upcoming trip to Ring of Honor and New Japan's joint War of the Worlds show in Toronto, featuring Kenny Omega!",
            "length": "59995363",
            "sourceUrl": "http://alasdairwilkins.com/storyofwrestling/Story.Of.Wrestling.05.05.17.mp3",
            "categories": [
                "Uncategorized"
            ]
        },
        {
            "title": "Episode 26: April 29, 2017",
            "datePublished": "Sat, 29 Apr 2017 14:35:29 +0000",
            "description": "Alasdair and Kyle talk about the upcoming PPVs Payback and Backlash, assuming they can tell the difference. (There's one point in which Alasdair legitimately can't.) Kyle discusses how WWE could go about building a better go-home show, then we take a bunch of questions from listeners on Twitter. We discuss the best and worst possible visions of the House of Horrors match, how to keep Braun strong even if he loses to Roman, and the awesome hilarity that is WWE actually naming a PPV Great Balls of Fire. That's amazing. Plus we pay tribute to Breezango, number one contenders!",
            "length": "58715319",
            "sourceUrl": "http://alasdairwilkins.com/storyofwrestling/Story.Of.Wrestling.04.29.17.mp3",
            "categories": [
                "Uncategorized"
            ]
        },
        {
            "title": "Episode 25: April 24, 2017",
            "datePublished": "Mon, 24 Apr 2017 22:37:53 +0000",
            "description": "We're dropping this podcast on a Monday, so we'll save the instantly dated Raw discussion. (All hail Braun, basically.) Instead, we discuss just what it means to have Jinder Mahal as the new number one contender to the WWE Championship, and whether either of us really has the courage to hinder Jinder in his quest for gold. Also, we talk about the lovely end to Tye Dillinger's NXT story with his steel cage match against Eric Young. All that and Alasdair checks in with an indie wrestling report about the greatness of Limitless Keith Lee!",
            "length": "48849478",
            "sourceUrl": "http://alasdairwilkins.com/storyofwrestling/Story.Of.Wrestling.04.24.17.mp3",
            "categories": [
                "Uncategorized"
            ]
        },
        {
            "title": "Episode 24: The Superstar Shake-up",
            "datePublished": "Sun, 16 Apr 2017 14:02:34 +0000",
            "description": "Alasdair and Kyle record early one morning (Alasdair even has birds chirping in the background, just to set the mood) to discuss the results of the Superstar Shake-up! Or, at least they get to that eventually, once they are done paying all due homage to Braun Strowman flipping over a damn ambulance. Seriously, that happened and was amazing and Braun is our hero now. Plus we take a look at an exciting new era for SmackDown (and, uh, we guess Raw as well) with A.J. Styles getting monster babyface pops as the officially recognized heart and soul of the blue brand. And Alasdair checks in with a quickie NXT report, because why not?",
            "length": "66925132",
            "sourceUrl": "http://alasdairwilkins.com/storyofwrestling/Story.Of.Wrestling.04.16.17.mp3",
            "categories": [
                "Uncategorized"
            ]
        },
        {
            "title": "Episode 23: WrestleMania 33, Part Two",
            "datePublished": "Tue, 11 Apr 2017 00:47:39 +0000",
            "description": "A bunch of truly bizarre and maddening technical difficulties mean we're only just getting this out, but no matter! Come join the rest of our massive discussion of all things WrestleMania 33 here, as we look at Kevin Owens and Chris Jericho, the debut of Shinsuke Nakamura (and why Alasdair is way higher on those Roode-Nakamura matches than he probably ought to be), and whether the man who wants to be introduced as the face that runs the place is actually, you know, turning face. After these two episodes, we can officially lay WrestleMania weekend to rest, just in time for the superstar shake-up. (Which, by the way, we'll probably have to get to sometime next week, as Alasdair has some travel coming up this weekend. Till then, thanks for listening!)",
            "length": "106874107",
            "sourceUrl": "http://alasdairwilkins.com/storyofwrestling/Story.Of.Wrestling.Mania33b.mp3",
            "categories": [
                "Uncategorized"
            ]
        },
        {
            "title": "Episode 22: WrestleMania 33, Part One",
            "datePublished": "Sun, 09 Apr 2017 23:14:37 +0000",
            "description": "Alasdair and Kyle look at the entire WrestleMania week experience (well, half of it anyway, considering this is just part one of a two-part episode), touching on everything from the Hall of Fame last Friday to the most recent SmackDown Live! We connect the matches on Saturday and Sunday to the shifting storylines on Monday and Tuesday. We start with Roman Reigns discussion, because there's really no way around it, but we segue into Alasdair unapologetically marking out over Tye Dillinger and Emma, as is only proper. Plus we discuss the return of Matt and Jeff Hardy, the cruiserweights, and the Raw women's championship match. Stay tuned for the second half of our massive, three-hour WrestleMania fallout discussion, coming very soon.",
            "length": "71496370",
            "sourceUrl": "http://alasdairwilkins.com/storyofwrestling/Story.Of.Wrestling.Mania33a.mp3",
            "categories": [
                "Uncategorized"
            ]
        },
        {
            "title": "Episode 21: April 1, 2017",
            "datePublished": "Sat, 01 Apr 2017 23:44:20 +0000",
            "description": "It's time for WrestleMania! Alasdair and Kyle are here to break down all the action on Sunday's card, looking at the good (Seth Rollins vs. Triple H! Chris Jericho vs. Kevin Owens! John Cena and Nikki Bella vs. the Miz and Maryse!), the not so good (Dean Ambrose vs. Baron Corbin! A fairly lifeless tag team ladder match! Intriguing but unfocused women's matches!), and the just kind of confusing (Roman Reigns vs. the Undertaker! Brock Lesnar vs. Goldberg! A.J. Styles vs. Shane McMahon in a traditional wrestling match!). All in all, it's actually a pretty exciting card, especially when you keep in mind neither Samoa Joe nor Luke Harper is anywhere on the card, and they figure to get involved somehow. All that and some Mania-level fantasy-booking, with Alasdair suggesting Styles vs. Nakamura for the Intercontinental title (have they ever done something like that?), Braun vs. Big Show for the U.S. title while Jericho and Owens go for the big belt, and an absurdly detailed pitch for a women's Money in the Bank match to open Mania.",
            "length": "86517572",
            "sourceUrl": "http://alasdairwilkins.com/storyofwrestling/Story.Of.Wrestling.04.01.17.mp3",
            "categories": [
                "Uncategorized"
            ]
        },
        {
            "title": "Episode 20: March 20, 2017",
            "datePublished": "Mon, 20 Mar 2017 14:15:58 +0000",
            "description": "Who's your pick to win it all at Lethal Leap Year? Alasdair and Kyle break down the matches heading into Southpaw Regional Wrestling's big main event, including the possibility of a trilogy of matches as Big Bartholomew tries to reclaim his farm from the villainous banker. Before all that, we take a look at the latest bit of business on Raw and SmackDown, including a damn good Mick Foley segment and the technically well-done but not especially satisfying build to that match between A.J. Styles and Shane McMahon. But really, we're a Southpaw Regional Wrestling mark podcast at this point.",
            "length": "76729719",
            "sourceUrl": "http://alasdairwilkins.com/storyofwrestling/Story.Of.Wrestling.03.20.17.mp3",
            "categories": [
                "Uncategorized"
            ]
        },
        {
            "title": "Episode 19: March 15, 2017",
            "datePublished": "Wed, 15 Mar 2017 15:25:35 +0000",
            "description": "We're back! Our unexpectedly extended hiatus ends with a look back at all we've missed and what's ahead for WrestleMania. Kyle and Alasdair have some issues to work through with Fastlane, and this isn't just Kyle's undying love of all things Canadian talking. (That said, an Owens-Jericho-Zayn Mania triple threat was mooted, and we can only imagine how happy this made Kyle.) We also consider what's going on in SmackDown, and whether the Orton-Wyatt story is worthy of one of the three or four Mania main event spots. And we take some questions as we wonder how to salvage the tag division (either of them, doesn't matter) and rebook from the Royal Rumble to get the kind of main event worthy of Mania. We'll be back soon with a look at this week's Raw and SmackDown, but until then, get caught up on everything else with this extra-length episode!",
            "length": "127885315",
            "sourceUrl": "http://alasdairwilkins.com/storyofwrestling/Story.Of.Wrestling.03.15.17.mp3",
            "categories": [
                "Uncategorized"
            ]
        },
        {
            "title": "Episode 18: February 3, 2017",
            "datePublished": "Sat, 04 Feb 2017 16:12:31 +0000",
            "description": "Alasdair and Kyle offer an in-depth review of the Royal Rumble and a less than in-depth review of Styles-Cena III (though really, what more is there to say than \"holy crap, that was incredible?\"). They also open with some thoughts on Seth Rollins' injury, which is that it really, really, really sucks, even if reports after we recorded this now indicate he could maybe make it back for Wrestlemania. Plus we discuss Roman Reigns' surprising, deflating entry at #30 in the Royal Rumble, along with why the Big Dog should pretty much exclusively fight in no-DQ brawls from now on. Scheduling note: Alasdair is on vacation next week, so we'll see you in two weeks!",
            "length": "57343754",
            "sourceUrl": "http://alasdairwilkins.com/storyofwrestling/Story.Of.Wrestling.02.03.17.mp3",
            "categories": [
                "Uncategorized"
            ]
        },
        {
            "title": "Episode 17: January 28, 2017",
            "datePublished": "Sat, 28 Jan 2017 21:11:53 +0000",
            "description": "We struggled through the most ludicrous run of technical difficulties to bring you an exhaustive Royal Rumble preview! We break down each of the 22 announced competitors (plus a few potential surprise entrants) and look at what would be the best story for each of them. Alasdair is weirdly high on Mojo! Kyle's favorite to win isn't necessarily even in the Rumble! And check out what has to be our most diabolical booking ever with a proposed Rumble finish that is about five flavors of horrendous. (You better believe it involves the Miz.)",
            "length": "90811504",
            "sourceUrl": "http://alasdairwilkins.com/storyofwrestling/Story.Of.Wrestling.01.28.17.mp3",
            "categories": [
                "Uncategorized"
            ]
        },
        {
            "title": "Episode 16: January 20, 2017",
            "datePublished": "Fri, 20 Jan 2017 15:29:59 +0000",
            "description": "Nothing else important is going on today, so why not check out what might just be our best episode ever? We go deep on the rather splendid United Kingdom Championship Tournament, with a close look at just how this tournament told a brilliant, self-contained story. Alasdair reveals his equal love for high flyers and hosses with plenty of praise for Mark Andrews and Tyson T-Bone. Kyle breaks down the heelish brilliance of Pete Dunne. We look at when a botch isn't a botch with the brilliantly handled finish of the Jordan Devlin-Danny Burch match. All that and a completely necessary Bad News Barrett digression!",
            "length": "70414922",
            "sourceUrl": "http://alasdairwilkins.com/storyofwrestling/Story.Of.Wrestling.01.20.17.mp3",
            "categories": [
                "Uncategorized"
            ]
        },
        {
            "title": "Episode 15: January 9, 2017",
            "datePublished": "Mon, 09 Jan 2017 21:15:24 +0000",
            "description": "It's been a minute, but we're back (and possibly better than ever, maybe)! Alasdair and Kyle look back on the best that 2016 had to offer, naming some of their favorite matches and the stories surrounding them. They then preview 2017 in damn near the most random way possible, with Alasdair asking a couple questions he was just curious to hear Kyle's thoughts on and then proposing a rule change for the cruiserweight division. It's a freewheeling return, so get it while it's hot!",
            "length": "48484061",
            "sourceUrl": "http://alasdairwilkins.com/storyofwrestling/Story.Of.Wrestling.01.09.17.mp3",
            "categories": [
                "Uncategorized"
            ]
        },
        {
            "title": "Episode 14: December 11, 2016",
            "datePublished": "Mon, 12 Dec 2016 06:07:42 +0000",
            "description": "We're back! Alasdair and Kyle have plenty to say on all things WWE and non-WWE, including a big recap of all the championship matches at TLC, a preview of what's ahead at Roadblock, a pondering of what lies ahead in the NXT main event scene, and on-scene reports from Ring of Honor's Final Battle and this weekend's Evolve 74. We're making up for our long absence with an extra-length look at all this, including plenty of positive takes on... well, pretty much everything other than how Raw is handling its titles. Well, that and Becky Lynch losing. Alasdair is still grumpy about that one. Plus check out our controversial take: Ricochet... he's pretty good!",
            "length": "108585220",
            "sourceUrl": "http://alasdairwilkins.com/storyofwrestling/Story.Of.Wrestling.12.12.16.mp3",
            "categories": [
                "Uncategorized"
            ]
        },
        {
            "title": "Episode 13: November 29, 2016",
            "datePublished": "Wed, 30 Nov 2016 16:11:02 +0000",
            "description": "http://alasdairwilkins.com/storyofwrestling/Story.Of.Wrestling.11.29.16.mp3 Coming in a few days late, we realize, but that&#8217;s the post-U.S. Thanksgiving malaise for you. Our Canadian cohost Kyle is unaffected by such things, and he offers his in-person experiences from NXT Takeover: Toronto and Survivor Series. We focus on the match of the year with the Revival and DIY&#8217;s tag team match, &#8230; <a href=\"https://storyofwrestlingpodcast.wordpress.com/2016/11/30/episode-13-october-29-2016/\" class=\"more-link\">Continue reading <span class=\"screen-reader-text\">Episode 13: November 29, 2016</span> <span class=\"meta-nav\">&#8594;</span></a>",
            "length": "63673996",
            "sourceUrl": "http://alasdairwilkins.com/storyofwrestling/Story.Of.Wrestling.11.29.16.mp3",
            "categories": [
                "Uncategorized"
            ]
        },
        {
            "title": "Episode 12: November 19, 2016",
            "datePublished": "Sat, 19 Nov 2016 18:38:20 +0000",
            "description": "We're back after an unplanned week's break! And, in not totally unrelated news, we get political for a few minutes at the top of the show before diving into this weekend's big events in Toronto. Kyle will be in attendance at both shows, and he's ready to scream his Canadian heart out for Tye Dillinger, Bobby Roode, Sami Zayn, Kevin Owens, and Mr. Toronto himself, Chris Jericho. (He's from Winnipeg, you idiot!) Alasdair gets pumped about the fact that the Undertaker-Styles match he fantasy-booked way back when might actually, seroiusly happen. We consider what stakes or stipulations could have worked well for the Survivor Series matches. Plus we barely remembered to talk about Goldberg-Brock, but really, we're just hoping it's an okay match.",
            "length": "68215796",
            "sourceUrl": "http://alasdairwilkins.com/storyofwrestling/Story.Of.Wrestling.11.19.16.mp3",
            "categories": [
                "Uncategorized"
            ]
        },
        {
            "title": "Episode 11: November 6, 2016",
            "datePublished": "Mon, 07 Nov 2016 19:44:37 +0000",
            "description": "Coming in a little late this week (i.e. it's now next week), but no matter! Alasdair and Kyle have some fun breaking down the possibilities for the Survivor Series teams, but not before Alasdair assures everyone that Slater and Rhyno wrestled a PPV-worthy match against Breezango on the last Main Event taping. Are the world's two most beautiful wrestlers going to fill out the SmackDown tag team side, and who on earth is even going to join the New Day on the Raw side? What is Baron Corbin doing in the main match, and which combination of wrestlers are we most excited to see face off? (The answer must surely be A.J. Styles vs. Seth Rollins, if we're going strictly by in-ring stuff.) Plus we just barely remember to talk about Hell in a Cell, with Kyle going to bat for the women's main event, wonky ending be damned.",
            "length": "85112714",
            "sourceUrl": "http://alasdairwilkins.com/storyofwrestling/Story.Of.Wrestling.11.06.16.mp3",
            "categories": [
                "Uncategorized"
            ]
        },
        {
            "title": "Episode 10: October 30, 2016",
            "datePublished": "Sun, 30 Oct 2016 18:11:51 +0000",
            "description": "Alasdair and Kyle check in with a preview of \"Hell in a Cell\" that's mostly just a deep dive on why Monday Night Raw feels like such a mess these days. We try not to be unnecessarily negative, but this was a rough week on the Red Brand, everyone. Some highlights: Kyle dressed as Enzo for Halloween, and we discuss wrestler costumes! Alasdair wonders whether the only way to keep Brock Lesnar heel (other than, you know, not have him come out in front of his hometown in Minnesota Vikings colors) is to keep him off TV until Survivor Series! Kyle gives his pick for the best story and the best in-ring action of tonight's five title matches! Alasdair slips into Stone Cold mode and explains why there was some good old-school storytelling in that Dana-Bayley arm wrestling match! Plus we take a moment to revel in the possibilities of Randy Wyatt!",
            "length": "77935178",
            "sourceUrl": "http://alasdairwilkins.com/storyofwrestling/Story.Of.Wrestling.10.30.16.mp3",
            "categories": [
                "Uncategorized"
            ]
        },
        {
            "title": "Episode 9: October 21, 2016",
            "datePublished": "Fri, 21 Oct 2016 12:03:17 +0000",
            "description": "Alasdair and Kyle are amped this week after one of the best weeks in wrestling in ages. We go 30 minutes on the glory that was Styles-Ellsworth II on SmackDown Live and then another 30 minutes on Bill Goldberg's amazing return to Raw. We break down just what about those two epic main events made them so special, particularly in terms of the stories being told. (Which, you know, is kind of the point of this podcast, if we're getting all technical about it.) This ought to be a good one!",
            "length": "65693447",
            "sourceUrl": "http://alasdairwilkins.com/storyofwrestling/Story.Of.Wrestling.10.21.16.mp3",
            "categories": [
                "Uncategorized"
            ]
        },
        {
            "title": "Episode 8: October 14, 2016",
            "datePublished": "Fri, 14 Oct 2016 16:41:07 +0000",
            "description": "Authority figures: What are they good for? Alasdair and Kyle ponder the criticisms of Shane McMahon and Daniel Bryan from this week's SmackDown, with Alasdair inadvertently pointing out the possibility of a Shane/A.J. Styles match at some point. They also look at the slate of Hell in a Cell matches coming up and how really none of them seem to need that stipulation, for whatever that's worse. They look at the meta quality of Sasha Banks' promos and wonder whether that's actually the thing keeping Sasha a face. (Well, that and the adoration of the masses.) Plus some entirely unnecessary praise for JBL and a whole lot of excitement for the upcoming Tye Dillinger/Bobby Roode feud!",
            "length": "68157575",
            "sourceUrl": "http://alasdairwilkins.com/storyofwrestling/Story.Of.Wrestling.10.14.16.mp3",
            "categories": [
                "Uncategorized"
            ]
        },
        {
            "title": "Episode 7: October 8, 2016",
            "datePublished": "Sat, 08 Oct 2016 18:36:37 +0000",
            "description": "Kyle takes time out of a busy Canadian Thanksgiving weekend to talk wrestling with Alasdair. We consider the joys of JeriKO vs the New  Day and the future of Raw's women's division, even as we express our trepidations about the newly rebranded Emmalina. We look ahead to No Mercy and wonder just who might be able to take on the Miz if indeed he retires Dolph Ziggler tomorrow night. Then we do a little bracketology with NXT's Dusty Rhodes Tag Team Classic tournament, and Austin Aries comes out of this looking very good. Finally, Alasdair offers another indie show review with his account of Beyond Wrestling's Midas Touch show, which he was a part of for like five seconds!",
            "length": "83596677",
            "sourceUrl": "http://alasdairwilkins.com/storyofwrestling/Story.Of.Wrestling.10.08.16.mp3",
            "categories": [
                "Uncategorized"
            ]
        },
        {
            "title": "Episode 6: October 1, 2016",
            "datePublished": "Sat, 01 Oct 2016 15:27:11 +0000",
            "description": "Kyle and Alasdair check in on the world of WWE and make at least a half-hearted effort to not constantly say how much better SmackDown is than Raw. They... don't do an amazing job, as they pay homage to all the feuds bubbling up on the road to No Mercy, with particular emphasis on the Talking Smack promo skills of Becky Lynch, Alexa Bliss, John Cena, and Dean Ambrose. But they do check in on Clash of Champions, pondering what the future holds for the uneasy allies of Sheamus and Cesaro. Plus they consider the different roles of the authority figures on the two shows, and why they loved the role Shane McMahon and Daniel Bryan played on SmackDown this week. (Hint: None whatsoever.) Come join us!",
            "length": "60765029",
            "sourceUrl": "http://alasdairwilkins.com/storyofwrestling/Story.Of.Wrestling.10.01.16.mp3",
            "categories": [
                "Uncategorized"
            ]
        },
        {
            "title": "Episode 5: September 25, 2016",
            "datePublished": "Mon, 26 Sep 2016 00:20:57 +0000",
            "description": "Just as \"Clash of Champions\" gets under way, Alasdair and Kyle check in for an abbreviated episode. Busy travel schedules mean we're not caught up on the week's wrestling, so the two offer some general thoughts on the state of SmackDown and Raw and what they hope tonight's (or yesterday's, depending on when you see this) PPV accomplishes. Then Kyle shares a couple stories from his time at the WWE 2K17 event in San Francisco, and Alasdair breaks down the card at last weekend's House of Hardcore show on Long Island.",
            "length": "51170782",
            "sourceUrl": "http://alasdairwilkins.com/storyofwrestling/Story.Of.Wrestling.09.25.16.mp3",
            "categories": [
                "Uncategorized"
            ]
        },
        {
            "title": "Episode 4: September 18, 2016",
            "datePublished": "Sun, 18 Sep 2016 17:09:09 +0000",
            "description": "We once again fail to book the triple threat as it's just Alasdair and LaToya breaking down the week in wrestling. They reflect on an immensely satisfying Backlash, ponder the ongoing ballad of jobber extraordinaire James Ellsworth, and maybe mention Raw at one point, we're not sure. Plus, Alasdair lays down the most demented Miz fantasy-booking you're ever likely to hear, and it doesn't even involve Daniel Bryan wrestling again! Then we get our indie on with some discussion of the conclusion of the Cruiserweight Classic, the recent Evolve 69 event, and Alasdair's jaunt to Long Island for a House of Hardcore show.",
            "length": "92490449",
            "sourceUrl": "http://alasdairwilkins.com/storyofwrestling/Story.Of.Wrestling.09.16.16.mp3",
            "categories": [
                "Uncategorized"
            ]
        },
        {
            "title": "Episode 3: September 10, 2016",
            "datePublished": "Sun, 11 Sep 2016 01:09:16 +0000",
            "description": "Alasdair and Kyle look back at the week in WWE while also getting you ready for Backlash. (We don't do any predictions. We're not about that life.) They consider Raw's difficulties in building stories out beyond the main event, with the ongoing (un)funny business between New Day and Gallows &#38; Anderson being a particularly frustrating example. Alasdair outs himself as not the biggest Sasha Banks fan while also heaping praise on Big Match Roman, because he's a stupid idiot with bad opinions. Kyle makes an unexpected case for Naomi as the SmackDown Women's Champion. Then we both close with some big praise for the glory that is the Cruiserweight Classic. Akira Tozawa is life! Also, why not drop us a line at storyofwrestling@gmail.com?",
            "length": "110620875",
            "sourceUrl": "http://alasdairwilkins.com/storyofwrestling/Story.Of.Wrestling.09.10.16.mp3",
            "categories": [
                "Uncategorized"
            ]
        },
        {
            "title": "Episode 2: September 5, 2016",
            "datePublished": "Mon, 05 Sep 2016 17:54:39 +0000",
            "description": "Just in time for Monday Night Raw comes our story-focused recap of the past week in wrestling. While week one cohost Kyle Fowle completed his Roman Reigns cosplay by getting popped for a wellness violation, fellow A.V. Club wrestling writer LaToya Ferguson ably steps in. We look at the fallout of Kevin Owens's big Universal Championship win, why 2016 really is the year of Heath Slater (baybay!), and Alasdair possibly breaks LaToya's brain forever when suggesting one of last week's intergender tag teams should just straight-up rename themselves the Dana Club. The Dana Club! Plus our hosts accidentally get into a game of indie wrestling can-you-top-this, which Alasdair should have known going in that he damn well can't.",
            "length": "117434875",
            "sourceUrl": "http://alasdairwilkins.com/storyofwrestling/Story.Of.Wrestling.09.05.16.mp3",
            "categories": [
                "Uncategorized"
            ]
        },
        {
            "title": "Episode 1: August 26, 2016",
            "datePublished": "Fri, 26 Aug 2016 14:37:00 +0000",
            "description": "The Story Of Wrestling is a podcast that examines the world of pro wrasslin through the lens of storytelling. In the debut episode, A.V. Club writers Alasdair Wilkins and Kyle Fowle discuss five ridiculously packed days of wrestling, including NXT TakeOver: Brooklyn II and the beauty of tag team wrestling, where AJ Styles goes after his big SummerSlam win over John Cena, and how Smackdown! Live is crafting a story where every character matters. All that plus some in-ring thoughts on the future of Brock Lesnar, a weird bit of trivia about all the NXT champions, Alasdair's ridiculously implausible dream opponent for prospective WWE champion AJ Styles, the Miz's promo of the year, and an amazing bit of inter-brand continuity between the Cruiserweight Classic and NXT. We're just scratching the surface here, honestly. Come join us!",
            "length": "110527250",
            "sourceUrl": "http://alasdairwilkins.com/storyofwrestling/Story.Of.Wrestling.08.25.16.mp3",
            "categories": [
                "Uncategorized"
            ]
        }
    ]
}