{
    "artwork": "http://is3.mzstatic.com/image/thumb/Music62/v4/a5/a6/1c/a5a61c33-a03a-a222-17a3-b321e01bbcb9/source/100x100bb.jpg",
    "description": "Podcast by Voice Teacher and author of the FULL VOICE Workbook series, Nikki Loney talks with talented Voice Professionals about issues and challenges voice teachers and choral directors face when working with young singers.",
    "feedURL": "http://feeds.soundcloud.com/users/soundcloud:users:173336448/sounds.rss",
    "podcastURL": "http://www.thefullvoice.com/",
    "title": "The Full Voice Podcast With Nikki Loney",
    "episodes": [
        {
            "title": "Live Virtual Recitals, Guidelines for posting on SM, Defining your studio offers",
            "datePublished": "Fri, 06 Nov 2020 13:52:36 +0000",
            "description": "Studio owner Jessica Saunders shares details about her successful LIVE virtual recitals. Social Media Expert Karen Michaels is helping us with graphic and copy guidelines for our social media posting. Vocologist Heather Nelson discusses the cricothyroid muscle, and our Business Expert Michelle Markwart Deveaux is discussing how to define your studio offerings. Pedagogy and business strategies for you and your voice teaching studio, right here on episode 130 of the FULL VOICE Podcast.\n\nEpisode 130\nwww.thefullvoice.com/fvpodcasts/130\n\nLive Virtual Recitals with Dr. Jessica Saunders (2:00)\nJessica Saunders is the owner of Saunders Vocal Studios, a private voice studio based in Iowa, where her studio motto is \"Building Confidence One Note at a Time!\". She also serves as an adjunct professor of voice at Kirkwood Community College. Jessica has been teaching for 7 years and works with students ages 8 to adult. She is passionate about working with young singers because she was in voice lessons at the age of seven and believes that children make amazing voice students. She just wished The Full Voice workbooks had been around when she was a child. Jessica is a member of NATS and currently serves as the Central Region Audition Coordinator Co-Chair; she is also a member of the Speakeasy Cooperative.\n\nWarm-Up of the Week: Falling Leaves Legato Study\n\n\n\n\n\n\nSocial Media best practices with Graphics and Copy with Karen Michaels - (26:05)\nSocial media expert Karen Michaels discusses best practices for using graphics and copy on your Facebook, IG, and LinkedIn posts.\n\nLinks mentioned in this episode:\nCanva.com https://www.canva.com/\nWord Swag  http://wordswag.co/\nLumyer app  https://apps.apple.com/us/app/lumyer-photo-animator-editor/id949876643\nBazaart Photo Editor https://apps.apple.com/us/app/bazaart-photo-editor-design/id515094775\n\n\n\n\n\nThe Cricothyroid Muscle - Dr. Heather Nelson (36:35)\nVocologist Dr. Heather Nelson gives an overview of the cricothyroid muscle. You can find Heather Nelson at drheathernelson.com.\nIG @drheathernelson The Cricothyroid Muscle\n\n\n\n\n\n\nYour Voice Studio Offers (part three) - With Michelle Markwart Deveaux (42:30)\nLessons, workshops, audition prep, and small group classes are just some of the offerings teachers may consider as part of their business services. Michelle continues this mini-series by discussing how to develop, package, and market your studio offerings.\n\nLink for SpeakEasy Coop (A Voice Teacher mastermind/co-learning group) www.thespeakeasycoop.com\n\nLink for Michelle’s site www.faithculturekiss.com",
            "length": "97744435",
            "sourceUrl": "http://feeds.soundcloud.com/stream/924416659-thefullvoice-live-virtual-recitals-guidelines-for-posting-on-sm-defining-your-studio-offers.mp3"
        },
        {
            "title": "FVPC #129 Virtual Recitals",
            "datePublished": "Fri, 23 Oct 2020 13:11:34 +0000",
            "description": "Episode 129 is all about VIRTUAL RECITALS. Our tech expert, Takenya Battle, breaks down the FIVE details we need to consider when hosting a virtual recital. Nikki shares experiences in streaming self-tape videos on a Facebook Watch Party and using a zoom to share recorded videos. Executive Director Allen Henderson sharing details about the NATS Intern program. Voice teacher Aimee woods shares her experience streaming content on YouTube. This episode offers fantastic teacher takeaways, essential best practices that you MUST abide by, and timely advice so you can avoid online disasters and celebrate your singing students.\n\n\nEpisode 129\n\nVirtual Recital Overview - Takenya Battle (5:00)\n\nTakenya Battle is a master musician, teacher, and entrepreneur who helps children and adults arrange, articulate, and amplify their inner musician with online voice and piano lessons.  She teaches music educators how to keep time with today’s technologies while still leveraging their traditional musical knowledge.  \nFind her at @kenyaskeys\nhttps://kenyaskeys.com/virtual-recitals-made-easy-guide/\n\nSelf-Tape Recitals with Nikki  (11:49)\n\nLights, camera, action? Self-tape recordings are now a thing, and they will be a thing for the foreseeable future. Nikki shares her experience helping students with self-tape submission and how they leveled up in work ethic and ability. A Facebook watch party recital is an option for sharing your recital; however, there are essential guidelines for sharing copyrighted music.\n\nhttps://www.backstage.com/magazine/article/guide-perfect-self-tape-1758/\n\nFacebook copyright FAQ\nhttps://www.facebook.com/help/1020633957973118/\n\n\n\nNATS Intern Program with Allen Henderson (27:25)\n\nThe NATS Intern Program is an exceptional training experience that seeks to pair expert and recognized master teachers with talented early career members of NATS. Within an intensive format designed to promote the dynamic exchange of ideas and techniques, the goal is to substantially improve the studio teaching skills of voice interns and collaborative piano interns' coaching skills. \nDeadline for submission: Dec 15th, 2020.\n\nNATS Intern Program Submissions: https://www.nats.org/nats-intern-program.html\n\n\n\nStreaming on YouTube with Aimee Woods (38:45)\n\nAimee became director of Magnolia Music Studio Northern Colorado in 2017 and brings a wealth of teaching and performing experience, almost 20 years of teaching, performing, and directing. Aimee offers educational clinics and masterclasses and is Vice President of the Colorado/Wyoming Chapter of the National Association of Teachers of Singing. She has performed professional opera and music theater along the Colorado front range. She is Music Director of Fort Collins Children's Theatre in Fort Collins, CO. Aimee teaches all ages and styles, including classical and contemporary vocal styles. \n\nRestream  https://restream.io/\nAimee’s recommended link for setting up your zoom stream. \nhttps://it.umn.edu/services-technologies/how-tos/zoom-live-stream-youtube-or-custom",
            "length": "89975923",
            "sourceUrl": "http://feeds.soundcloud.com/stream/916578869-thefullvoice-129-virtual-recitals.mp3"
        },
        {
            "title": "FVPC #128 Song Study, COVID Resources, Restorative Vocal Exercises and Finding your Ideal Client",
            "datePublished": "Fri, 09 Oct 2020 14:48:08 +0000",
            "description": "In episode 128, Nikki shares strategies for using your student’s current repertoire to focus on technical and warm-up exercises. Allen Henderson shares the NATS COVID-19 resources so teachers can stay informed and stay safe. Dr. Heather Nelson shares the science of restorative vocal exercises for tired voices, and Michelle Markwart Deveaux talks about the whys and hows of finding your ideal client in your teaching studio.\n\nEpisode #128\nwww.thefullvoice.com/fvpodcasts/128\n\n\nSong Study for technical and warm-up exercises - Nikki (1:00)\nUsing musical fragments from a student’s repertoire can provide effective technical studies and make lessons more productive. Nikki offers endless ideas to shake up your vocal warm-up routine this season!\n\n\n\nCOVID Resources with Allen Henderson (15:15)\n\nVersatile artist, teacher, arts administrator, and baritone Allen Henderson is currently Executive Director of the National Association of Teachers of Singing (NATS), the world’s largest professional voice teacher association. Allen shares new initiatives and COVID resources available through the NATS organization.\n\nNATS COVID Resource Page\nhttps://www.nats.org/cgi/page.cgi/_article.html/Featured_Stories_/NATS_COVID_Resources_Page\n\nVoices of COVID Project\nhttps://www.nats.org/Voices_of_COVID.html\n\n\n\nRestorative Vocal Exercises - Dr. Heather Nelson (28:55)\nVocologist Dr. Heather Nelson offers restorative warm-up and cool down vocal exercises and explains the science behind them. You can find Heather Nelson at https://www.drheathernelson.com/\n\nFinding your Ideal Client {Part Two} with Michelle Markwart Deveaux (38:48)\nVoice teacher and business expert Michelle Markwart Deveaux shares the power of finding your ideal client. \nLink for SpeakEasy Coop (A Voice Teacher mastermind/co-learning group) www.thespeakeasycoop.com\nLink for Michelle’s site www.faithculturekiss.com",
            "length": "104909885",
            "sourceUrl": "http://feeds.soundcloud.com/stream/907739089-thefullvoice-fvpc-128-song-study.mp3"
        },
        {
            "title": "FVPC #127 Low Latency Technology, Music Ed Apps, Live Video Tips, and Starting Your Studio Business",
            "datePublished": "Fri, 25 Sep 2020 15:51:45 +0000",
            "description": "Eden Casteel and Wendy Jones discuss low latency technologies and how they collaborated to test and conquer these new platforms. Takenya Battle shares her all-time favorite music education apps.   Social Media expert Karen Michaels inspires us to use live video on our social media channels. We start a five-part series with business expert Michelle Markwart Deveaux about starting your own voice studio business. \nwww.thefullvoice.com/fvpodcasts/127\n\nEpisode 127\n\nLow Latency Technology - Eden Casteel and Wendy Jones (1:36)\n\nEden Casteel\nThough she wanted to be Karen Carpenter AND Beverly Sills when she was little, Eden Casteel has grown up to be a multifaceted performer, pianist, producer, and independent studio owner based in Wakefield, Rhode Island. A native of Dublin, Ohio, who moved to Rhode Island in 2010, Eden holds a Bachelor of Music Degree from The University Of Cincinnati College-Conservatory Of Music and a Master of Music degree from The University of Maryland. She is a past president of the Rhode Island chapter of NATS and a charter member of The Speakeasy Cooperative. If you would like to work with Eden, please visit her website:  www.edencasteel.com \nhttps://edencasteelmusicstudio.as.me/OnlineMusicTechSupport\n\nWendy Jones resides in the Asheville area and runs her private voice studio: One World Voice Studio. She also serves on the faculty of Western Carolina University, where she teaches Contemporary and Commercial Voice and the faculty Brevard College where she teaches voice and directs the opera workshop. Wendy is an active member of NATS and is also a member of the Speakeasy Cooperative, PAVA, the National Association of Recording Arts and Sciences, the Jazz Educator's Network, and the Association for Popular Music Education.  https://www.wljonesoneworldvoice.com/\n\nLinks mentioned in this interview:\nIan Howell's presentation from NATS https://www.ianhowellcountertenor.com/technology-enabled-music-lessons?fbclid=IwAR3-ULDyGayymM3HiXXYyw0F_o_g84DJi113Ks7ZP-T83387IaOWlXA51B0\nSoundjack https://www.soundjack.eu/index.php/howto\nCleanfeed https://cleanfeed.net/\nSoundtrap https://www.soundtrap.com/\njamkazam https://www.jamkazam.com/\n\n\nBest Music Education Apps with Takenya Battle (49:58)\n\nTakenya shares her all-time favorite music education apps that she uses with students of all ages. \n\nPiano Maestro https://www.joytunes.com/apps\nhttps://apps.apple.com/ca/app/the-most-amazing-sheep-game/id550921301\nhttps://www.noterushapp.com/\nhttps://www.meludia.com/en/\n\n\nLive Video Tips with Karen Michaels (55:46)\n\nSocial Media Expert Karen Michaels shares tips and best practices for using live video on your social media channels. \n\nKaren has turned her passion for technology and building her music studio and solo career, into a thriving social media business. From Instagram to Facebook to Google My Business, Karen will get you up and running with a smile. Work with Karen:\nKaren's Free Social Butterfly Facebook Group\nhttps://thesocialbutterflygurusocialmedia.as.me/FullVoicePodcast\n\n\nStarting Your Voice Studio Business {Part One}\nwith Michelle Markwart Deveaux (1:05:51)\n\nVoice teacher and business expert Michelle Markwart Deveaux outlines the three things you need to start a music studio business. \n\nLink for SpeakEasy Coop (A Voice Teacher mastermind/co-learning group) www.thespeakeasycoop.com\nLink for Michelle's site www.faithculturekiss.com",
            "length": "123997919",
            "sourceUrl": "http://feeds.soundcloud.com/stream/899480446-thefullvoice-127-technology.mp3"
        },
        {
            "title": "FVPC #126 Teaching the Child Singer, Lesson Pacing, Studio Technology and Less Talking, More Singing",
            "datePublished": "Fri, 11 Sep 2020 02:45:09 +0000",
            "description": "Episode 126 \n\nSoprano, voice teacher and author Dana Lentini shares her new book: Teaching the Child Singer. Vocologist, Dr. Heather Nelson discusses neuroscience and how we can apply this knowledge to better lesson pacing. Music teacher and tech expert Takenya Battle outlines how teachers can rock their online studio technology (without spending money). Dr. Shannon Coates inspires teachers to talk less and let our students sing more. \n\nVisit our website: www.thefullvoice.com/fvpodcasts/126\n\n\nTeaching the Child Singing- Dana Lentini (3:24)\n\nAs a voice teacher and pedagogue with expertise in developing teaching techniques for the young singer, Dana is an advocate for young singers. She is passionate about teaching prepubescent voices in the private studio.\n\nDana is the founder of Born 2 Sing Kids, a voice program designed to meet the needs of children ages 5-13 in the development of beginning singing and performing techniques. Her new book, Teaching the Child Singer, can be found on Amazon and Sheet Music Plus\nYou can find Dana here:\nwebsite:  http://www.born2singkids.com\n\nNeuroscience and Lesson Pacing - Dr. Heather Nelson (29:17)\n\nVocologist, Dr. Heather Nelson is unpacking some neuroscience and helping us to understand how we can apply this knowledge in our teaching studios and classrooms for effective lesson pacing. You can find Heather Nelson at drheathernelson.com\n\nMeet our Studio Technology Expert - Takenya Battle (39:10)\n\nTakenya Battle is a master musician, teacher, and entrepreneur who helps children and adults arrange, articulate, and amplify their inner musician with online voice and piano lessons.  She teaches music educators how to keep time with today’s technologies while still leveraging their traditional musical knowledge.  Find her at @kenyaskeys\n\nTalk Less - Sing More - Dr. Shannon Coates (1:02:00)\n\nShannon Coates teaches undergraduate vocal pedagogy in several universities and runs a successful private teaching studio. She is most passionate about sharing all aspects of the voice and singing and cultivating the art of teaching with professional teachers. \n\nJoin her mailing list for 10% savings on courses (such as The Vocal Instrument 101) and classes (such as Formant-Free Pedagogy).\n\nMailing list link and product links all on her website: www.shannon-coates.com",
            "length": "118117247",
            "sourceUrl": "http://feeds.soundcloud.com/stream/891322531-thefullvoice-126-pedagogy.mp3"
        },
        {
            "title": "FVPC #125 Crafting Responsive Emails, Studio Props, Using LinkedIn, and Composer Mentorship Program",
            "datePublished": "Fri, 28 Aug 2020 16:02:59 +0000",
            "description": "Episode 125\n\nLearn how to write professional emails that get opened and read with a quick reply. Voice Teacher and Author, Dana Lentini shares her top 3 props she uses in her teaching studio. Social media expert, Karen Michaels shares Linkedin best practices and how NOT to use hashtags. Executive Director of NATS, Allen Henderson, shares details about the Composer Mentorship Program.\n\nVisit our website:  www.thefullvoice.com/fvpodcasts/125\n\n\nCrafting Responsive Emails (3:48)\n\nNikki shares tips and best practices for professional email communications. Common-sense and straightforward rules that will get your emails opened and read with a quick reply. \nLinks mentioned:\nwww.grammarly.com/\nwww.wisestamp.com/\n\nFavorite Studio Props - Dana Lentini (28:46)\n\nAs a voice teacher and pedagogue with expertise in developing teaching techniques for the young singer, Dana is an advocate for young singers. She is passionate about teaching prepubescent voices in the private studio. Dana is the founder of Born 2 Sing Kids, a voice program designed to meet the needs of children ages 5-13 in the development of beginning singing and performing techniques. For more info about her book, Teaching the Child Singer, or her studio and blog, please visit her website:  http://www.born2singkids.com\n\nBest Practices for LinkedIn and Hashtags - Karen Michaels (37:36)\n\nKaren has turned her passion for technology and building her music studio and solo career, into a thriving social media business. From Instagram to Facebook to Google My Business, Karen will get you up and running with a smile.\n\nWork with Karen:\nhttps://thesocialbutterflygurusocialmedia.as.me/FullVoicePodcast\n\nNATS Composer Mentorship Program - Allen Henderson (53:23)\n\nVersatile artist, teacher, arts administrator, and baritone Allen Henderson is currently Executive Director of the National Association of Teachers of Singing (NATS), the world’s largest professional association of voice teachers. Allen shares new initiatives and programs within the NATS organization.  \n\nDiscover NATS:\nwww.nats.orghttps://www.nats.org/Mentoring_Program_for_Composers.html",
            "length": "90432259",
            "sourceUrl": "http://feeds.soundcloud.com/stream/883602301-thefullvoice-125-season-5.mp3"
        },
        {
            "title": "FVPC #124 Moving Forward and Getting your Studio Back on Track",
            "datePublished": "Fri, 10 Jul 2020 18:53:17 +0000",
            "description": "We wrap up season four of the FULL VOICE podcast by reflecting on one HECK of a year. Thank you to our global audience of vocal music education experts for tuning in. As of this episode, we now have over 150,000 listens. Thank you for making this podcast part of your professional development. Where are the opportunities for your teaching studio now? Everywhere. See you in September for Season Five! \n\nwww.thefullvoice.com/fvpodcasts/124\n\nCheck out Wendy Steven's lesson policy resources.\nhttps://composecreate.com/?s=tuition+payments",
            "length": "67822977",
            "sourceUrl": "http://feeds.soundcloud.com/stream/855740200-thefullvoice-124movingforward.mp3"
        },
        {
            "title": "FVPC #123 Navigating NATS 2020 Virtual Conference with Karen Michaels",
            "datePublished": "Sat, 13 Jun 2020 12:52:54 +0000",
            "description": "NATS Virtual 2020 Conference begins June 24th, 2020, Kicking off over 150 presentations about the key topics in our industry today. With the convenience of learning in the comfort of your home and one affordable price, this is a fantastic opportunity to level up your teaching and business skills for your voice teaching business. Social Media Manager, Karen Michaels joins us on the podcast to help us navigate this online learning using the Guidebook app and office hours.\n\nFor more information about NATS Virtual 2020:\n\nhttps://www.nats.org/virtual2020.html\n\nhttps://www.nats.org/Virtual_2020_-_Schedule.html\n\nGuidebook can be downloaded on any phone or tablet, or accessed from any desktop or laptop computer. \nhttps://guidebook.com/getit/\n\nCheck out this video for help with downloading the Guide and navigating the app https://youtu.be/C7MdWh5hLNA",
            "length": "58513529",
            "sourceUrl": "http://feeds.soundcloud.com/stream/839457175-thefullvoice-123-virtual-conference.mp3"
        },
        {
            "title": "FVPC #122 Voice Care for Transgender Singers: Interview with Liz Jackson Hearns",
            "datePublished": "Mon, 25 May 2020 16:36:29 +0000",
            "description": "Our special guest, Liz Jackson Hearns, is a voice instructor and author specializing in transgender Voice. Liz shares her passion for creating a “gender-affirming voice studio.”\n\n“Voice is such an integral expression of our identity. I am passionate about offering ways for people to explore and develop gender expression through Voice that helps them feel confident and anchored. More and more folks, especially young people, are feeling safe to come out as trans or non-binary, and as voice teachers, we have a wonderful opportunity to provide knowledgeable and affirming voice care.”\n\nFor more information about Liz and The Voice Lab, please visit:\nhttps://www.thevoicelabinc.com/\n\nFor more information about Liz Jackson Hearns' books and other transgender voice resources, please visit:\nhttps://www.thevoicelabinc.com/resources-transgender-voice-chicago.html\n\nJune 2020 \nLiz is part of the NATS Virtual Conference and will be presenting: Feminization and Masculinization of Singing Voices: Practical Tools to Shift Gender Perception.\n\nTo register for NATS Virtual 2020, please visit here:https://www.nats.org/virtual2020.html",
            "length": "40506594",
            "sourceUrl": "http://feeds.soundcloud.com/stream/827726296-thefullvoice-122-liz-jackson-hearns.mp3"
        },
        {
            "title": "FVPC #121 NATS 2020 Virtual Conference: Interview with Allen Henderson",
            "datePublished": "Sat, 16 May 2020 00:35:20 +0000",
            "description": "The 2020 NATS National conference has been moved from Knoxville, Tennessee, to a computer screen in the comfort of your home. This event will be live June 24th through June 30th with access to all the presentations for six months after the live event.\n\nExecutive Director, Allen Henderson shares all the details and opportunities for all voice teachers who “attend” the virtual conference.\n\nRegistration is now open! \n\nhttps://www.nats.org/Virtual_2020_-_Registration.html",
            "length": "70125062",
            "sourceUrl": "http://feeds.soundcloud.com/stream/821439574-thefullvoice-121-virtual-convention.mp3"
        },
        {
            "title": "FVPC #120 Singing, the Church and COVID-19: Interview with Dr. Heather Nelson",
            "datePublished": "Mon, 11 May 2020 15:11:28 +0000",
            "description": "Vocologist and church music director, Heather Nelson, returns to the podcast to discuss her article, Singing, The Church, and COVID-19: A caution for moving forward in our current pandemic. As we are eagerly moving towards lifting the stay at home orders, there are many serious concerns for those of us who make a living from singing. Heather shares her research and some recommendations for consideration for all singing professionals.\n\nTo read Heather's full article, click here:\n\nhttps://www.drheathernelson.com/singingandcovid19\n\nTo read her letter to all Church Musician's here:\nhttps://www.drheathernelson.com/post/dear-church-musician",
            "length": "56569392",
            "sourceUrl": "http://feeds.soundcloud.com/stream/818232193-thefullvoice-120-singingcovid-19.mp3"
        },
        {
            "title": "FVPC #119 Vocal Studies for Kids: Interview with Donna Rhodenizer",
            "datePublished": "Fri, 01 May 2020 20:27:15 +0000",
            "description": "Composer and music education specialist Donna Rhodenizer shares her passion and her expertise for writing vocal \"studies\" for young singers. We discuss the unique challenges in private lessons and in the classroom when helping young singers develop their singing skills and how all music teachers can help students who struggle with pitch. Donna shares many kid-friendly teaching strategies including music writing activities for your youngest students.",
            "length": "94389497",
            "sourceUrl": "http://feeds.soundcloud.com/stream/811567993-thefullvoice-119-vocalstudies.mp3"
        },
        {
            "title": "FVPC #118 Mindful Online Lessons Strategies",
            "datePublished": "Tue, 14 Apr 2020 00:22:09 +0000",
            "description": "It has been almost a month since many brave teachers transitioned their studios to online teaching platforms. Many have settled into what is now the “new normal” with online lessons... But WAIT! Before you ramp up your lesson plans, create even MORE online classes, and prepare everyone for your new and exciting online recital, be sure to check in with your students and families. How are they managing? How can we best serve them?",
            "length": "58265262",
            "sourceUrl": "http://feeds.soundcloud.com/stream/797955415-thefullvoice-118-mindfulonline.mp3"
        },
        {
            "title": "FVPC #117 Navigating Uncertain Times: Interview with Michelle Markwart Deveaux",
            "datePublished": "Mon, 06 Apr 2020 13:55:51 +0000",
            "description": "Podcast guest Michelle Markwart Deveaux shares strategies for voice teachers navigating the uncertainty and challenges as we all move to online singing lessons.",
            "length": "94754502",
            "sourceUrl": "http://feeds.soundcloud.com/stream/792186637-thefullvoice-117-uncertaintimes.mp3"
        },
        {
            "title": "FVPC #116 Online Voice Lessons for Younger Students: Interview with Nate Plummer",
            "datePublished": "Wed, 18 Mar 2020 16:33:42 +0000",
            "description": "Nate Plummer returns to the podcast to help teachers transitioning to online vocal lessons. After years of teaching online, he shares the do’s and don’ts and some preventative measure that can help lessons go smoothly. \n\nVisit our podcast page for more details. https://thefullvoice.com/fvpodcasts/116\n\nTo see Nate's List of 25 TIPS AND TRICKS FOR TEACHING ONLINE post, please go here:\nhttps://www.facebook.com/nate.plummer.3/posts/2739061276180202\n\nhttps://www.stagedoorunlocked.com/",
            "length": "84255636",
            "sourceUrl": "http://feeds.soundcloud.com/stream/778380121-thefullvoice-116-online.mp3"
        },
        {
            "title": "FVPC #115 Stress Resiliency: Interview with Elizabeth Rotoff",
            "datePublished": "Sat, 07 Mar 2020 00:44:19 +0000",
            "description": "Elizabeth Rotoff returns to the FULL VOICE podcast to discuss stress resiliency for teachers and their students. From breathing and meditation exercises to growth mindset techniques, Elizabeth offers great teacher strategies in mindfulness on and off the stage.\n\nVisit our website: https://www.thefullvoice.com/fvpodcasts/115 \n\nMy Music Staff Minute: Composing professional emails\n\nLinks mentioned in our podcast:\n\nRegister for NATS Knoxville: www.nats.org/knoxville2020\n\nThe Big Life Journal: https://biglifejournal.com/ \n\nMore about Elizabeth: https://www.thefitsinger.com/",
            "length": "56313010",
            "sourceUrl": "http://feeds.soundcloud.com/stream/772018930-thefullvoice-115-stress.mp3"
        },
        {
            "title": "FVPC #114 Women's Voices in Midlife, Menopause and Beyond",
            "datePublished": "Fri, 21 Feb 2020 01:55:49 +0000",
            "description": "Co-Author Cate Frazier-Neely discusses her upcoming book,   \"Singing Through Change: Women's Voices in Midlife, Menopause and Beyond\" (with Nancy Bos and Joanne Bozeman). Through her health and vocal rehabilitation journey, Cate has become an advocate for connecting health and wellness with singing. \n\nFor more information, please visit our podcast page:\nwww.thefullvoice.com/fvpodcasts/114\n\nMy Music Staff Minute: Payment Processing Fees\n\nAbout our Guest: Cate is a veteran voice teacher, vocologist, singing voice rehabilitation specialist, accomplished musician, and author. She is a former classical singer who toured in regional and national markets in contemporary chamber music and opera, premiering over 300 works by American composers. She works with all styles of music in an organic, heart-centered, and dynamic manner. \n\nCate is a co-author of the upcoming \"Singing Through Change: Women's Voices in Midlife, Menopause and Beyond\" with Nancy Bos and Joanne Bozeman.\n\nWays to work with Cate:\nhttps://www.catefnstudios.com/alchemy-teaching-singing\nhttps://www.catefnstudios.com/collegial-consults\nhttps://www.catefnstudios.com/singing-voice-rehabilitation\nhttps://www.catefnstudios.com/vocal-conditioning\n\n\nPublications and Educational Resources: Publisher's Updates for Book: https://studiobos.com/womens-changing-voicesBlog: https://catefnstudiosblog.com\n\nNATS Knoxville 2020: Singing Through Change: Women's Voices in Midlife, Menopause and Beyond with Nancy Bos, Joanne Bozeman, and Cate Frazier-Neely; Sunday, June 28, early morning session at the NATS convention.",
            "length": "88338328",
            "sourceUrl": "http://feeds.soundcloud.com/stream/764088085-thefullvoice-114-womensvoices.mp3"
        },
        {
            "title": "FVPC #113 Managing Expectations",
            "datePublished": "Fri, 14 Feb 2020 03:56:43 +0000",
            "description": "Managing Expectations is a vastly underutilized communication skill that helps us avoid pain and suffering in our business. With better communication, we can avoid conflict and disappointment with our families, not to mention saving us time and money! But communication is a two-way street. Perhaps we need to check in with our expectations and make sure they align with the busy modern family.\n\nMy Music Staff Minute: Finding your Teaching Niche\n\nDeadline reminder: Register for the 2020 NATS in Knoxville Convention June 24th to 30th. Earlybird deadline: April 1st, 2020\nhttps://www.nats.org/Knoxville2020.html\n\n\nVisit our website for more information:\nwww.thefullvoice.com/fvpodcasts/113",
            "length": "62933492",
            "sourceUrl": "http://feeds.soundcloud.com/stream/760366627-thefullvoice-113-managingexpectations.mp3"
        },
        {
            "title": "FVPC #112 Interview with Dr. Nicholas Perna of Vocal Fri Podcast",
            "datePublished": "Fri, 07 Feb 2020 23:29:51 +0000",
            "description": "Dr. Nicholas Perna is our special guest with an insightful discussion about his research in  Laryngeal Manipulation and the potential benefit it has for the singing profession. The creator and the co-host of the Vocal Fri Podcast, Nicholas, shares his passion for vocal pedagogy,  a fantastic vocal warm-up of the week, and his appreciation of nerdy pop culture.\n\n\nVisit our podcast page for more information:\nwww.thefullvoice.com/fvpodcasts/112\n\n\nLinks mentioned in this podcast:\n\nMy Music Staff Minute: Productivity tips for busy teachers. https://www.mymusicstaff.com/\n\n http://www.vocalfri.com \nYour weekly dash of voice science, pedagogy, and nerd pop culture.\n\nMore information about the 2020 NATS National Convention in Knoxville https://www.nats.org/Knoxville2020.html\nEarly bird registration deadline is April 1st\n\nAt the convention: Singers and Self Laryngeal Manipulation: What Singing Teachers Need to Know. Sunday, June 28, • 7:45 a.m. to 8:45 a.m.\n\nFull Voice Podcast and the Vocal Fri Podcast are part of the new NATSCast network.",
            "length": "72170831",
            "sourceUrl": "http://feeds.soundcloud.com/stream/756921955-thefullvoice-112vocalfri.mp3"
        },
        {
            "title": "FVPC #111 The Fortune in Parental Feedback",
            "datePublished": "Fri, 31 Jan 2020 03:25:20 +0000",
            "description": "What do you do when your singers are not enjoying their lessons anymore? You reconnect with families and open the lines of communication! (The sooner, the better!)\n\nOnly parents can help us understand what is happening academically, socially, and emotionally in our students' lives. This vital feedback can help us support our students and prevent them from giving up on their lessons.\n\nVisit our podcast page for more information. please visit www.thefullvoice.com/fvpodcasts/111\n\n\nLinks mentioned in this episode.\n\nIt is FREEBIE FRIDAY! Check out Sing & Swing! A fun exercise to explore swing eighths and scat syllables. www.thefullvoice.com/freeresources\n\nHooray! Full Voice Podcast is part of the NATSCast Network. \n\nCome to the NATS convention! Knoxville 2020\n\nCheck out Sara Campbell's Facebook live about better communication. \n\nBlog Article: Getting Parents' Feedback Early Helps Teachers All Year",
            "length": "46105784",
            "sourceUrl": "http://feeds.soundcloud.com/stream/752509903-thefullvoice-parentfeedback.mp3"
        },
        {
            "title": "FVPC #110 Social Media 2020: Interview with Karen Michaels",
            "datePublished": "Sat, 11 Jan 2020 03:13:50 +0000",
            "description": "Social Media expert, Karen Michaels shares the latest trends and strategies for music educators using social platforms to promote their businesses. From geo-tagging to using \"stories\" to share appropriate content. Karen has best practice advice for all of us.\n\nVisit the website to download Karen's 20 Social Media Tips for 2020",
            "length": "78988096",
            "sourceUrl": "http://feeds.soundcloud.com/stream/741636076-thefullvoice-110-socialmedia.mp3"
        },
        {
            "title": "FVPC #109 New Year Intentions for Your Music Studio: Interview with Michelle Markwart Deveaux",
            "datePublished": "Fri, 03 Jan 2020 14:51:39 +0000",
            "description": "Happy New Year! Most of us reflect on making a clean start personally in January, but what about in our music studios? Michelle Markwart Deveaux shares four effective intentions for savvy studio owners to reflect upon to ensure a successful year of teaching.\n\nFreebie Friday Download: Get Michelle's Worksheet and plan your 2020 business strategies! \n\nhttps://www.thefullvoice.com/freeresources\n\nVisit the podcast show page:\nhttps://www.thefullvoice.com/fvpodcasts/109\n\nVisit Michelle's Websites:\n\nLink for SpeakEasy Coop (A Voice Teacher mastermind/co-learning group) \nwww.thespeakeasycoop.com\n\nLink for Michelle’s site \nwww.faithculturekiss.com",
            "length": "68396732",
            "sourceUrl": "http://feeds.soundcloud.com/stream/737849752-thefullvoice-109-intentions.mp3"
        },
        {
            "title": "FVPC #108 Spotlight on Multi-Teacher Studios: Interview with Cynthia Vaughn of Magnolia Music Studio",
            "datePublished": "Fri, 27 Dec 2019 03:26:03 +0000",
            "description": "Teaching artist, author, and presenter, Cynthia Vaughn shares her journey from academia to founding her highly successful Magnolia Music Studio. Through her extensive entrepreneurial journey, she has discovered the importance of hiring the right teachers and discusses why this is crucial for the success of any teaching studio.\n\nFor complete show notes visit our website:\nhttps://www.thefullvoice.com/fvpodcasts/108\n\nLinks Mentioned in this podcast:\n\n\nPrivate Music Teacher Planner and Agenda\nhttps://www.amazon.com/Private-Music-Teacher-Planner-Agenda/dp/1731003439\n\nhttps://www.magnoliamusicstudio.com/\n\nhttps://wwnorton.com/books/the-singing-book\n\nhttps://www.nats.org/",
            "length": "90843508",
            "sourceUrl": "http://feeds.soundcloud.com/stream/734414191-thefullvoice-108-magnoliamusicstudio.mp3"
        },
        {
            "title": "FVPC #107 Inclusion in the Music Lesson Studio: Interview with Dianna Swenson",
            "datePublished": "Fri, 20 Dec 2019 02:26:47 +0000",
            "description": "Dianna Swenson is well known in our industry for her advocacy and expertise in working with students of all abilities. Her successful home studio is called Vocal Inclusion, and in this interview, she shares her teaching strategies, resources, and her students' success stories. \n\nFor more information, please visit our podcast page:\nwww.thefullvoice.com/fvpodcasts/107\n\nMy Music Staff Minute: Never ending professional development for teachers.\n\nWarm-Up of the Week: Humming/lip bubble along to your favorite song! \n\nLinks mentioned in this podcast:\n\nDianna’s Website www.vocalinclusion.weebly.com \n\nJust Songs Warm-Up for Kids by Susan Anders\n\n4thwallbackstage.com",
            "length": "60945425",
            "sourceUrl": "http://feeds.soundcloud.com/stream/731198239-thefullvoice-107-inclusion.mp3"
        },
        {
            "title": "FVPC #106 Spotlight on Multi-Teacher Studios: Sand Dollar Music",
            "datePublished": "Fri, 13 Dec 2019 23:32:12 +0000",
            "description": "There are many different business models for the multi-teacher studio. Voice Teacher, Christin Coffee Rondeau, and Flute teacher, Sarah Robertson have created a unique teaching partnership with their studio Sand Dollar Music. Using modern online tools they share administrative and marketing efforts without the overhead of a brick and mortar location.",
            "length": "88836677",
            "sourceUrl": "http://feeds.soundcloud.com/stream/727537405-thefullvoice-106sanddollarmusic.mp3"
        },
        {
            "title": "FVPC #105 The National Association of Teachers of Singing: Interview with Allen Henderson",
            "datePublished": "Fri, 06 Dec 2019 14:55:54 +0000",
            "description": "With over 7000 members, the National Association of Teachers of Singing (NATS) is the largest professional organization for the voice professional. Today on the podcast, we are talking to Allen Henderson, the current executive director of NATS, about the opportunities in networking and continuing education that the organization offers its diverse membership. Allen also gives us a sneak peek of some of the events at the upcoming Knoxville convention in 2020.\n\nWarm-up of the Week:\nVisit our podcast page to download Allen's Uses of the Straw sheet for his favorite SOVT exercises.\nhttps://www.thefullvoice.com/fvpodcasts/105\n\n\nMy Music Staff Minute: Setting goals for your teaching studio.\n\nLinks mentioned in this podcast:\nNATS Live Learning Center https://nats.sclivelearningcenter.com/MVSite/default.aspx\n\nNATS Membership  https://www.nats.org/nats-membership.html\n\nNATS National Conference https://www.nats.org/Knoxville",
            "length": "107508202",
            "sourceUrl": "http://feeds.soundcloud.com/stream/723657208-thefullvoice-105-nats.mp3"
        },
        {
            "title": "FVPC #104 From Rote to Score: Teaching Young Singers New Songs.",
            "datePublished": "Sat, 30 Nov 2019 00:57:34 +0000",
            "description": "There are many ways to introduce a new song to a young student. However, without a slowly paced, careful sequence, even a short, simple melody taught by rote can be a challenge for our young singers. And, teaching by rote is difficult if our students are not engaged. One of our goals in the lesson studio is to gradually move our students from learning by rote to following a score. This takes time and dedication in every lesson or vocal class, but the reward is students who are confident in discovering new music.\n\nVisit the podcast page: https://www.thefullvoice.com/fvpodcasts/104\n\nLInks mentioned in this podcast:\n\nNew Music for Young Singers with Donna Rhodenizer\nhttps://www.thefullvoice.com/fvpodcasts/87\n\nThe Curse of Knowledge\nhttps://www.thefullvoice.com/fvpodcasts/73\n\nTeaching New Languages with Tracey Ford\nhttps://www.thefullvoice.com/fvpodcasts/71\n\nFirst, We Sing! 100 Litte Songs and Rhymes (Hal Leonard) https://www.amazon.com/First-Little-Rhymes-primary-Collection/dp/1540027104\n\nDonna’s New Song “It’s Snowing (Oh, Yes!)/It’s Snowing, (Oh, No!)\nhttps://www.thefullvoice.com/registered-reproducible-master\n\nFree Resources for Your Teaching Studio {Freebie Friday Downloads}\nhttps://www.thefullvoice.com/freeresources",
            "length": "76228387",
            "sourceUrl": "http://feeds.soundcloud.com/stream/720549112-thefullvoice-104-rote-to-score.mp3"
        },
        {
            "title": "FVPC #103 Step Away From the Piano: Unaccompanied Singing Activities",
            "datePublished": "Fri, 22 Nov 2019 01:25:09 +0000",
            "description": "How much are you relying on the piano to teach voice? Do you play every note of every exercise your students sing? Are you sitting at the piano bench for the entire vocal lesson?\n\nThis podcast is about honoring the unique challenges of the human voice and sharing simple, productive singing activities that can help our students develop independent singing skills and confidence in their voices!\n\nMy Music Staff Minute: Keeping great lesson notes\n\nLinks mentioned in this episode:\n\nSane Singing by Brian Lee\nhttps://www.amazon.com/Sane-Singing-Guide-Vocal-Progress-ebook/dp/B07D95GC3Y \n\nThe Human Nature of the Singing Voice - Peter T. Harrison\nhttps://www.amazon.com/Human-Nature-Singing-Voice-Exploring/dp/1903765544\n\nFirst We Sing, by Susan Brumfield. (Kodaly inspired singing resources for the classroom) There are many levels available and a very helpful teacher guide!\n\n100 Little Songs and Rhymes by Susan Brumfield\nhttps://www.amazon.com/gp/product/1540027104\n\nKodály Links\n\n2020 Kodály Training at Western University, London, Ontario, Canada https://music.uwo.ca/outreach/music-education/kodaly-certification-program.html\n\nOrganization of American Kodály Educators https://www.oake.org/\nKodály Society of Canada https://www.kodalysocietyofcanada.ca/\n\nFree Tonic sol-fa wall cards and flashcards for your teaching studio or classroom \nhttps://www.thefullvoice.com/free-resources/flashcards\nVocal exploration activity: \nSinging Spaceships (exploring lip and tongue trills)\nhttps://www.thefullvoice.com/free-resources/singingspaceships\n\nNOW AVAILABLE:\n\nThe Private Music Teacher Planner and Agenda - Newly updated with a 2020/21 calendar and 200 pages of organizational bliss for the busy professional music teacher.\nhttps://www.amazon.com/gp/product/1897539274",
            "length": "65800439",
            "sourceUrl": "http://feeds.soundcloud.com/stream/716665258-thefullvoice-103-nopiano.mp3"
        },
        {
            "title": "FVPC #102 Practicing Challenges and Strategies",
            "datePublished": "Fri, 15 Nov 2019 15:13:45 +0000",
            "description": "The forever challenge of getting students to practice is universal. Fear not!  There are simple strategies and tools we can use to help inspire students (and families) to enjoy singing activities at home.\n\nMy Music Staff Minute: Connecting with your families\n\nLinks mentioned in this podcast:\n\nThe 2020/21 Private Music Teacher Planner and Agenda NOW available on Amazon. 200 pages of Private Teacher Planning bliss! https://www.amazon.com/Private-Music-Teacher-Planner-Agenda/dp/1897539274\n\nNancy Bos Singer’s Practice Planner, Log and Journals - Perfect for older students and adults\nhttps://www.amazon.com/Singers-Practice-Plan-Log-Journal/dp/1981681310\n\nSuper-Cute Singing Lesson Practice Planner and Journal (Three cute animal themes for your young students!) https://www.amazon.com/Singing-Lesson-Practice-Planner-Journal/dp/1897539258\n\nFree practice templates by Wendy Stevens at composecreate.com\nhttps://composecreate.com/students/wendys-piano-studio/teaching-resources/motivational-charts/\n\nCheck out our free resources page for more fun achievement pages, lyric discovery sheets, active listening sheets and MORE! https://www.thefullvoice.com/freeresources",
            "length": "57581954",
            "sourceUrl": "http://feeds.soundcloud.com/stream/713268682-thefullvoice-102-practicing.mp3"
        },
        {
            "title": "FVPC #101 Balancing Performing and Teaching: Interview with Jennifer Cooper",
            "datePublished": "Fri, 08 Nov 2019 03:12:30 +0000",
            "description": "Voice teachers wear many hats. Many of us are ‘Teaching Artists,’ trying to balance our performance schedules with the responsibilities of running our teaching studios. Jennifer Cooper shares her passion for both performing and teaching and how she mindfully maintains her busy schedule. Bonus conversation: Jennifer performs an extremely wide variety of music and discusses how she transitioned from a classical background into contemporary genres.\n\nWarm-Up of the Week: Jennifer shares exercises for helping singers with registration. \n\nMy Music Staff Minute: Celebrating your studio successes! \n\nFor more information please visit our website: www.thefullvoice.com/fvpodcasts/101",
            "length": "88082470",
            "sourceUrl": "http://feeds.soundcloud.com/stream/709536811-thefullvoice-101-balance.mp3"
        },
        {
            "title": "FVPC #100 Episode Recap AND FREEBIE FRIDAY",
            "datePublished": "Fri, 01 Nov 2019 00:00:00 +0000",
            "description": "Episode 100 recaps fantastic conversations from the seasons one, two, and three, celebrating the incredible guests who have shared their expertise on our podcast.\n\nAND\n\nIt is FREEBIE FRIDAY at Full Voice Music, and our new download is a seasonal singing activity from our new book, O Christmas Tree.\n\nWe are exploring beat, rhythm, and introducing rhythmic improvisation with the holiday classic: Jingle Bells.\n\nYou can download your copy of our FREEBIE FRIDAY at www.thefullvoice.com/freeresources\n\nPodcasts mentioned in the episode:\n\nFVPC #8 Repertoire Recommendations with Anne Barnshaw\n\nFVPC #19 Strategies for Students Struggling with Stillness with Shannon Coates\n\nFVPC #37 The Young Singing Larynx with Dana Lentini\n\nFVPC #43 Movement in the Voice Lesson: Interview with Christin Coffee Rondeau\n\nFVPC #85 Mindful Instruction: Interview with Steve Ferrell\n\nFVPC #89 Money Mindset: Interview with Michelle Markwart Deveaux",
            "length": "83303316",
            "sourceUrl": "http://feeds.soundcloud.com/stream/706384705-thefullvoice-100-recap.mp3"
        },
        {
            "title": "FVPC #99 Branding Your Business: Interview with Sara Campbell",
            "datePublished": "Fri, 25 Oct 2019 04:07:15 +0000",
            "description": "Returning to the podcast is private music teacher and business coach, Sara Campbell. Our conversation is about branding your business. (Don’t let that marketing term make you uncomfortable.) In this fun conversation, Sara discusses why discovering what makes us unique as teachers and as individuals can change our client messaging in a positive way and then explains how it influences our website copy, social media marketing, and inquiry/onboarding processes.\n\n{October 25th, 2019} Special offer for FULL VOICE Podcast listeners: Use the discount code: THANKSFULLVOICE and get $100 off Sara’s Branding Boot camp course. (Hurry spaces are VERY limited!) Click here to get all the details   https://sarasmusicstudio.com/biz-branding-bootcamp/\n\nMy Music Staff Minute: Group Music Classes\n\nAbout our Guest: \n\nSara Campbell is a biz coach who works with music entrepreneurs to enhance their studios and online businesses. She helps music creatives refine their work practices and systems so that their businesses are not just successful, but fun to run. You can find her offering up business, mindset, and awesometicity tips on FB Live every Wednesday on her coaching page at 12 pm ET.\n\nYou can find Sara here:\n\nhttps://sarasmusicstudio.com/businesscoaching/ \n\n https://www.facebook.com/saracampbellbizcoach/",
            "length": "92109925",
            "sourceUrl": "http://feeds.soundcloud.com/stream/701405581-thefullvoice-99-branding.mp3"
        },
        {
            "title": "FVPC #98 Marketing Your Teaching Studio: Interview with Michelle Markwart Deveaux",
            "datePublished": "Fri, 18 Oct 2019 18:59:33 +0000",
            "description": "Voice Teacher and business strategist, Michelle Markwart Deveaux returns to the podcast to inspire business-minded teachers to  “share their story.”  She explains the critical difference between marketing, advertising, and selling and offers insight into why your Facebook ads may not be performing well as they could.\n\nMy Music Staff Minute: Basic SEO for your business website\n\nNew Holiday Resource: O Christmas Tree: Seasonal Singing Activities and Holiday Music for Intermediate Singers\n\nhttps://www.thefullvoice.com/ochristmastree\n\nMichelle Markwart Deveaux is a Voice Teacher and business coach with a passion for helping other teachers run a business that they love. Link for SpeakEasy Coop (A Voice Teacher mastermind/co-learning group) www.thespeakeasycoop.com\n\nLink for Michelle’s site www.faithculturekiss.com",
            "length": "63142218",
            "sourceUrl": "http://feeds.soundcloud.com/stream/698361478-thefullvoice-98-marketing.mp3"
        },
        {
            "title": "FVPC #97 Building Community in Your Studio: Interview with Kelli Barham",
            "datePublished": "Fri, 11 Oct 2019 17:48:37 +0000",
            "description": "Voice Teacher, Kelli Barham, shares her studio success story and her creative strategies for building a supportive community in her teaching studio. \n\nMy Music Staff Minute: Using effective keywords on your website.\n\nAbout our Guest: Kelli is an independent voice teacher in the beautiful Palouse at the border of Washington and Idaho. Though her studio is located in rural wheat fields, she believes that small-town singers deserve professional training just as much as singers in a bigger city. A big focus of her teaching is fostering positive and encouraging relationships between singers and other music professionals while helping them develop the tools to keep singing in their lives beyond their formal training during their adolescent years.\n\nLinks mentioned in the podcast: New resource for voice teachers\n\nhttps://www.thefullvoice.com/ochristmastree",
            "length": "69501258",
            "sourceUrl": "http://feeds.soundcloud.com/stream/694340182-thefullvoice-97-community.mp3"
        },
        {
            "title": "FVPC #96 When you have to cancel students for an emergency",
            "datePublished": "Fri, 04 Oct 2019 11:29:55 +0000",
            "description": "I was teaching my first student on Monday when I learned of my father's sudden passing. We don't like to think about emergencies, but they are a part of life. Are you set up to handle emergencies in your teaching studio? \n\nLinks mentioned in this podcast:\n\nUpdating Your Studio Policy\nhttps://www.thefullvoice.com/fvpodcasts/2016/6/14/updatingpolicies\nMind Your Business: Interview with Michelle Markwart Deveaux\nhttps://www.thefullvoice.com/fvpodcasts/90\n\nMoney Mindset\nhttps://www.thefullvoice.com/fvpodcasts/89\n\nLesson Fee Structures\nhttps://www.thefullvoice.com/fvpodcasts/74",
            "length": "19611351",
            "sourceUrl": "http://feeds.soundcloud.com/stream/690914014-thefullvoice-96-emergencies.mp3"
        },
        {
            "title": "FVPC #95 Teaching Contemporary Singing: Interview with John Henny",
            "datePublished": "Thu, 26 Sep 2019 18:55:34 +0000",
            "description": "Voice teacher, podcaster, vocal pedagogy course creator AND author, John Henny returns to the podcast to discuss his new book, Teaching Contemporary Singing.\n\n\n\nVisit our show page:\nwww.thefullvoice.com/fvpodcasts/95\n\nLinks mentioned in this podcast.\n\nYou can find more about John and his training programs at https://johnhenny.com/\n\nYou can purchase John’s new book, Teaching Contemporary Singing on Amazon.\n\nAbout our Guest:\n\nJohn Henny is a celebrity voice teacher who has helped train hundreds of successful voice teachers around the world. John has created powerful online education courses for teachers and singers, including The New Science of Singing and Contemporary Voice Teacher Academy.\n\nJohn hosts one of the top podcasts for singers, The Intelligent Vocalist, where he breaks down the complex issues of singing and performing in a friendly, easy-to-understand style. He also works with singers around the world via webcam lessons.",
            "length": "71363267",
            "sourceUrl": "http://feeds.soundcloud.com/stream/687248614-thefullvoice-95-contemporarysinging.mp3"
        },
        {
            "title": "FVPC #94 Historical Vocal Pedagogy: Interview with Justin Petersen",
            "datePublished": "Fri, 20 Sep 2019 17:51:46 +0000",
            "description": "We continue our conversation with Justin Petersen about historical vocal pedagogy. Justin shares teaching philosophies and technical exercises from the past and how they have an essential place in the voice studios of today.\n\nVisit our podcast page for more information: www.thefullvoice.com/fvpodcasts/94\n\nLinks mentioned in this Podcast:\n\nwebsite www.petersenvoicestudio.comfacebook: www.facebook.com/petersenvoicestudio,  \nInstagram @petersenvoice\n\n\nBooks mentioned in this podcast:\n\nTosi, Pier Francesco, and John Ernest Galliard. Observations on the Florid Song, Or, Sentiments on the Ancient and Modern Singers. \nWilliam Reeves, 1743\n\nMancini, Giambattista. Practical reflections on the figurative art of singing. RG Badger, 1912.\n\nCeloni, Anna Maria Pellegrini. Grammar, Or, Rules for Singing Well. Ed. Edward Foreman. Pro Musica Press, 2001.\n\nWitherspoon, Herbert. Singing. New York: G Schirmer, 1925.\n\nBrian Lee’s blog about aging voice:https://vocalability.com/no-voice-stays-the-same-forever/\n\nMy Music Staff Minute: \nMaking your teaching studio stand out locally.",
            "length": "72247250",
            "sourceUrl": "http://feeds.soundcloud.com/stream/684150897-thefullvoice-94-historical-pedagogy2.mp3"
        },
        {
            "title": "FVPC #93 Historical Vocal Pedagogy: Interview with Justin Petersen (Part One)",
            "datePublished": "Fri, 13 Sep 2019 00:47:40 +0000",
            "description": "“Understanding the trajectory of ideas on singing and teaching singing gives one the ability to stand on the shoulders of giants and learn from their successes and their mistakes.. .“ Justin Petersen shares his passion for historical vocal teaching and why it holds an essential place in the modern voice studio.  (Part One)\n\nLinks from this podcast:\nhttps://www.thefullvoice.com/fvpodcasts/93\n\nwebsite www.petersenvoicestudio.com\nfacebook: www.facebook.com/petersenvoicestudio,  \nInstagram @petersenvoice\n\nMy Music Staff Minute: \nAutomating lesson reminders and using the student portal.",
            "length": "64942160",
            "sourceUrl": "http://feeds.soundcloud.com/stream/680333660-thefullvoice-93-historical-pedagogy.mp3"
        },
        {
            "title": "FVPC #92 Social Media Update with Karen Michaels",
            "datePublished": "Fri, 06 Sep 2019 01:18:35 +0000",
            "description": "Social media expert, Karen Michaels shares tips and trends for using social media channels for promoting your teaching studio. Savvy music teachers striving to keep things up to date will learn:\n\n~ New features in Instagram and Facebook stories\n~ How to use the platforms properly to get maximum exposure\n~ How to use Facebook Groups vs. Facebook Business Pages \n~ Why you CAN NOT post lessons in the Facebook Marketplace\n~ Best practices so your Facebook page does not get shut down. (it happens!)\n\n\nWork with Karen: If you are looking for help with your social media account for your business check out Karen’s special offer for FULL VOICE Podcast listeners:  https://thesocialbutterfly.as.me/fullvoicepodcastlisteners\n\n\nMy Music Staff Minute:  Reminding students about lessons and recitals and keeping emails out of the spam folder. \n\n\nWarm-Up of the Week: Singing ME-OH moving in half steps.\n\nFor more information, visit the podcast page:\nwww.thefullvoice.com/fvpodcasts/92",
            "length": "86210431",
            "sourceUrl": "http://feeds.soundcloud.com/stream/676986687-thefullvoice-92-socialmedia.mp3"
        },
        {
            "title": "FVPC #91 Active Listening (Freebie Friday)",
            "datePublished": "Fri, 30 Aug 2019 09:00:16 +0000",
            "description": "The 4th Season of the FULL VOICE Podcast is here with a discussion about active listening.  Active listening is when we give the music our full attention and focus on the subtle details of the sounds we hear. Listening with intention is the ultimate ear-training exercise for singers of all ages. Nikki shares simple and practical exercises to inspire our students to expand their ears (and their music skills) in every vocal lesson.\n\nCheck out this month’s FREEBIE FRIDAY download - Active Listening Challenge. https://www.thefullvoice.com/freeresources\n\nThe My Music Staff Minute: Why you need to simplify your pricing. \n\nThe FULL VOICE Podcast is for you, the private voice teacher navigating the challenges and opportunities in the private voice studio. We share fantastic teaching tips, business strategies, new resources, and fun. Weekly episodes feature:\n\nInterviews with expert guests\n\nMy Music Staff Minute\n\nWarm-up of the Week\n\nExclusive offers from our podcast sponsors.\n\nThis episode is sponsored by the Social Butterfly Guru.  You can take advantage of her exclusive offer for Full Voice Podcast listeners here: https://thesocialbutterfly.as.me/fullvoicepodcastlisteners\n\nSubscribe on iTunes, Google Play, or your favorite podcast app.",
            "length": "59195012",
            "sourceUrl": "http://feeds.soundcloud.com/stream/672860924-thefullvoice-91-activelistening.mp3"
        },
        {
            "title": "FVPC #90 Mind Your Business: Interview with Michelle Markwart Deveaux",
            "datePublished": "Thu, 20 Jun 2019 22:39:34 +0000",
            "description": "We finish the third season of the FULL VOICE Podcast with our friend and business strategist, Michelle Markwart Deveaux. She outlines savvy business strategies for looking at and (most importantly,) understanding your studio numbers. Cash flow sheets, KPI, and projecting for next year -  Michelle will help you “GET WITH YOUR NUMBERS.\" \n\n\nFor more information, please visit our website: www.thefullvoice.com/fvpodcasts/90\n\nA special thank you to the fine folks at My Music Staff for the My Music Staff Minute: www.mymusicstaff.com\n\n\n\nHappy Singing Teacher Box\nhttps://www.thefullvoice.com/usstore/happy-singing-teacher-welcome-box\n\n{Season Four of the FULL VOICE Podcast will debut Friday, August 30th, 2019}",
            "length": "94659058",
            "sourceUrl": "http://feeds.soundcloud.com/stream/639799866-thefullvoice-90-mindyourbusiness.mp3"
        },
        {
            "title": "FVPC #89 Money Mindset: Interview with Michelle Markwart Deveaux",
            "datePublished": "Fri, 14 Jun 2019 17:03:39 +0000",
            "description": "Our relationship with money has a direct impact on how we run our teaching studios. Special guest, Michelle Markwart Deveaux returns to the podcast to discuss “money mindset” and the struggles that creatives often have with the business side of running a private voice studio. Michelle shares great resources and simple exercises to address the uncomfortable conversations about (whisper) money.\n\nMy Music Staff Minute: Keeping your business website updated.\n\nFor more information and links to resources mentioned, visit our website: www.thefullvoice.com/fvpodcasts/89",
            "length": "86900063",
            "sourceUrl": "http://feeds.soundcloud.com/stream/636673308-thefullvoice-89-moneymindset.mp3"
        },
        {
            "title": "FVPC #88 New Music for Young Singers: Interview with Donna Rhodenizer (part two)",
            "datePublished": "Fri, 07 Jun 2019 11:28:12 +0000",
            "description": "In episode 88. we continue our conversation with music education specialist and composer, Donna Rhodenizer. Donna shares her passion for writing music for young singers and how she thoughtfully creates music that both girls and boys will appreciate and enjoy singing. \nDonna Rhodenizer song samples in this episode include: \n1.) It's a Pirate's Life for me\n2.) Bedtime Tango\n3.) Best Friends\n4.) Cool Bob\n\nConnect with Donna\n\nwww.elementarymusicwithdonna.com\nSign up for the newsletter! For elementary music classroom teaching strategies and resources. \n\nwww.redcastlepublishing.com  \nfor printed music: Registered Reproducible Masters, and fantastic song collections  \n\nhttps://www.facebook.com/ElementaryMusicWithDonna/  Follow Donna’s Facebook page and watch the fun videos she shares! \n\nThe Happy Singing Teacher Box\nhttps://www.thefullvoice.com/happysingingbox",
            "length": "51619711",
            "sourceUrl": "http://feeds.soundcloud.com/stream/633120804-thefullvoice-88-donnarhodenizer2.mp3"
        },
        {
            "title": "FVPC #87 New Music for Young Singers: Interview with Donna Rhodenizer (Part One)",
            "datePublished": "Fri, 31 May 2019 16:21:50 +0000",
            "description": "If you have been working with young singers, you have most likely enjoyed teaching a Donna Rhodenizer song (or two, or three) to your vocal students or choir. Donna is celebrating 35 years of teaching and 40 years of composing music for singers of all ages. BONUS! \n\nDebuting on this podcast is a fun and fantastic new song for your young singers called “It’s Raining Cats and Dogs” This is available as a Freebie Friday download for your teaching studio!  \n\n*** Don’t forget to listen to the Outtake at the end.\n\nFor more information about the songs and resources included in this interview, please visit: www.thefullvoice.com/fvpodcasts/87\n\nTo get your free download and backing track, visit:\nwww.thefullvoice.com/freeresources",
            "length": "60804991",
            "sourceUrl": "http://feeds.soundcloud.com/stream/629598717-thefullvoice-87donnarhodenizer.mp3"
        },
        {
            "title": "FVPC #86 Interview with Vocologist Dr. Heather Nelson",
            "datePublished": "Fri, 24 May 2019 18:55:32 +0000",
            "description": "Vocology is the science and practice of vocal habilitation, or vocal training and therapy. For voice teachers interested in learning more about a Singing Voice Specialist, our special guest, Dr. Heather Nelson shares her educational background and how she works with voice clients and partners with medical teams and voice teachers in person and online. A fantastic conversation on the FULL VOICE Podcast.\n\nVisit our website for great teaching resources for your studio. \nwww.thefullvoice.com\n\nThe Happy Singing Teacher Box\nwww.thefullvoice.com/happysingingbox",
            "length": "57422029",
            "sourceUrl": "http://feeds.soundcloud.com/stream/626038923-thefullvoice-86vocology.mp3"
        },
        {
            "title": "FVPC #85 Mindful Instruction: Interview with Steve Ferrell",
            "datePublished": "Fri, 17 May 2019 10:51:23 +0000",
            "description": "Yoga and Meditation teacher, Steve Ferrell returns to the FULL VOICE Podcast to discuss, the mindful language within our instruction, encouraging our students to explore and how to better deal with difficult people.  A fun conversation with insightful teaching strategies that can be used right away in your teaching studio!\n\nMy Music Staff Minute: Using Technology in the Teaching Studio\n\nVisit our website:\nhttps://www.thefullvoice.com/fvpodcasts/85",
            "length": "79709076",
            "sourceUrl": "http://feeds.soundcloud.com/stream/622040034-thefullvoice-85-mindfulinstruction.mp3"
        },
        {
            "title": "FVPC #84 Recitals: Showcasing your students and your teaching studio",
            "datePublished": "Thu, 09 May 2019 20:27:33 +0000",
            "description": "Recitals are opportunities to celebrate your students’ musical efforts AND a fantastic opportunity to showcase and promote your teaching studio. Public performances can also give teachers the chance to connect with families and build community support within your music business.  Big or small, your recital is an essential part of your teaching studio, and Nikki has strategies to make it fun and fabulous.\n\n\nWarm-Up of the Week: \nPhyllis Horridge (@phyllis.sings) shares a cute round that is a perfect warm-up for your students before the recital. She also talks about her end of year Karaoke party for her students! \n\nMy Music Staff Minute: \nMaking your studio visible on all business platforms.",
            "length": "57400086",
            "sourceUrl": "http://feeds.soundcloud.com/stream/618243972-thefullvoice-84-recitals.mp3"
        },
        {
            "title": "FVPC #83 Productivity Tips for Teachers: Interview with Glory St. Germain",
            "datePublished": "Fri, 03 May 2019 01:13:55 +0000",
            "description": "Private Music teachers wear many hats and often struggle to find the balance between teaching, performing, learning, running a business, and caring for our families. Glory St. Germain is a successful private music teacher and the CEO of Ultimate Music Theory. Glory has authored over 50 music theory books and created an excellent online certification course for music teachers. She knows a thing or two about being productive! In this fun conversation, she is sharing her top productivity tips and the 3 time thieves that prevent us from meeting our goals.\n\n\n\n**Affiliate disclosure: This post contains an affiliate link. This means I may receive referral fees if you make a purchase through this site without any additional cost to you. This helps us to continue producing podcasts, and resources for you. Thank you for your support. \n\n\nGlory's FREE WEBINAR:\n\n https://my.ultimatemusictheory.com/a/13709/YHK7XCPU\n\n\nVisit our Webpage for more information: \n\nhttps://www.thefullvoice.com/fvpodcasts/83",
            "length": "76444605",
            "sourceUrl": "http://feeds.soundcloud.com/stream/614931060-thefullvoice-83-productivity.mp3"
        },
        {
            "title": "FVPC #82 Traveling Teacher: Interview with Libby Wiebel",
            "datePublished": "Fri, 26 Apr 2019 12:22:09 +0000",
            "description": "Private music teacher, Libby Wiebel shares the pros, cons, and things-I-wish-had-known-when-I-got-started about teaching in students' homes. Discover how she set her fee structure and has created an incredibly successful business model by creating a community in her \"conceptual music studio.\"\nFor more information visit our website:\nhttps://www.thefullvoice.com/fvpodcasts/82\n\nMy Music Staff Minute: Accepting Online Payments\n\nWarm-Up of the Week: Going back to the ABC's",
            "length": "76080981",
            "sourceUrl": "http://feeds.soundcloud.com/stream/611714685-thefullvoice-82travelingteacher.mp3"
        },
        {
            "title": "FVPC #81 First Lessons",
            "datePublished": "Sat, 20 Apr 2019 15:14:50 +0000",
            "description": "First Lessons with new students (and their parents)can be awkward as everyone is trying to get to know each other and understand the routine of your studio. Take care; a well planned first lesson can make or break your business relationship. Nikki shares simple strategies to get everyone started on the right note.\n\nFor Links to resources mentioned please visit the podcast page:\nhttps://www.thefullvoice.com/fvpodcasts/81\n\nMy Music Staff Minute: Forecasting in your Music Teaching Business\nWarm-Up of the Week: Using favorite foods to make your teens smile.",
            "length": "63803012",
            "sourceUrl": "http://feeds.soundcloud.com/stream/608870817-thefullvoice-81-first-lessons.mp3"
        },
        {
            "title": "FVPC #80 Pinterest & Instagram for Voice Teachers: Interview with Karen Michaels",
            "datePublished": "Fri, 12 Apr 2019 17:38:30 +0000",
            "description": "Voice Teacher and Social Media expert, Karen Michaels returns to the FULL VOICE Podcast to answer questions about new Pinterest, and Instagram features that (would most definitely) benefit voice teachers and teaching studios.\n\nFor more information, please visit the podcast page:\nhttps://www.thefullvoice.com/fvpodcasts/80\n\n\nThe My Music Staff Minute: How to make tax time easier.\n\nFeature product: The Singing Lesson Practice Planner and Journal (for kids) now available.\nhttps://www.thefullvoice.com/singing-lesson-planner-journal",
            "length": "54397049",
            "sourceUrl": "http://feeds.soundcloud.com/stream/605039799-thefullvoice-fvpc-80-pinterest-instagram-for-voice-teachers-interview-with-karen-michaels.mp3"
        },
        {
            "title": "FVPC #79 Know Your Rights: Interview with Liz Craig",
            "datePublished": "Fri, 05 Apr 2019 13:45:42 +0000",
            "description": "Liz Craig is a professional private music teacher and an in-demand performing artist. Our conversation is about understanding employment rights. Are you an independent contractor or an employee? What does this mean for you when you accept work for your time and talent? Liz shares some important information for all artists, whether you are teaching, performing, or hiring for your company.\n\nFor links mentioned in the show, please visit our podcast page:\nhttps://www.thefullvoice.com/fvpodcasts/79\n\nMy Music Staff Minute: Your website Call To Action (CTA)",
            "length": "56070976",
            "sourceUrl": "http://feeds.soundcloud.com/stream/601393083-thefullvoice-fvpc-79.mp3"
        },
        {
            "title": "FVPC #78 Adaptive Music Lessons: Interview with Becca Sampson",
            "datePublished": "Fri, 29 Mar 2019 00:27:57 +0000",
            "description": "Being creative and flexible in your teaching approach is essential in the private teaching studio. Facilitating adaptive lessons is teaching to the students’ individual learning needs. Special guest, Becca Samson is a board certified Music Therapist and a private voice teacher who specializes in adaptive music lessons. Becca shares fantastic teaching strategies for all teachers working with young musicians.\n\nFor more information and links to resources mentioned in this interview please visit our website: https://www.thefullvoice.com/fvpodcasts/78\n\nMy Music Staff Minute: Document Disconnect in your business",
            "length": "51797134",
            "sourceUrl": "http://feeds.soundcloud.com/stream/597606951-thefullvoice-78-adaptivelessons.mp3"
        },
        {
            "title": "FVPC #77 Lyric Discovery (Freebie Friday)",
            "datePublished": "Fri, 22 Mar 2019 01:17:02 +0000",
            "description": "Do your voice students TRULY understand the story behind their song? Probably not as much as you would think.🤔 Many of our students struggle with reading skills, and lyrical prose is tricky! (Even our teen and adults can struggle with reading comprehension skills.) Perhaps some time exploring the text of the song could lead to more expressive singing?\n\nThis podcast ties in with our recent freebie Friday - LYRIC DISCOVERY download. This simple two-page lyric discovery activity encourages students to dig a little deeper into the meaning of their song. \n\nMy Music Staff Minute: Making your business accessible.\n\nFor more information and links mentioned in this episode, please visit",
            "length": "52410280",
            "sourceUrl": "http://feeds.soundcloud.com/stream/593876601-thefullvoice-fvpc-77-lyric-discovery.mp3"
        },
        {
            "title": "FVPC #76 Money Matters for Self-Employed Teachers: Interview with Jeremiah Johnson",
            "datePublished": "Fri, 15 Mar 2019 13:39:33 +0000",
            "description": "Jeremiah Johnson is an opera singer turned financial expert with a passion for helping musicians make peace with their finances. In episode 76, we are talking about money mindset(for self-employed creatives who just want to make music) and simple strategies for preparing for retirement. \n\nFor more information about Jeremiah and links mentioned in this episode, please visit our podcast page:\n\nhttps://www.thefullvoice.com/fvpodcasts/76 \n\nMy Music Staff Minute: Your Business Logo",
            "length": "74623348",
            "sourceUrl": "http://feeds.soundcloud.com/stream/590493705-thefullvoice-76money.mp3"
        },
        {
            "title": "FVPV #75 Social Media Check-in: Interview with Karen Michaels",
            "datePublished": "Fri, 08 Mar 2019 02:19:23 +0000",
            "description": "Social media expert, Karen Michaels returns to the podcast to keep us up to date with fantastic opportunities to promote our teaching studios on social platforms. In this episode, she talks about Google My Business and the updates to the Linkedin platform. Karen also shares inspiration and best practices for keeping our social media accounts up to date.\n\nMy Music Staff Minute: Writing your story into your business\n\nFor links mentioned in this podcast, visit our podcast page\nwww.thefullvoice.com/fvpodcasts/75",
            "length": "60460801",
            "sourceUrl": "http://feeds.soundcloud.com/stream/586684491-thefullvoice-fvpv-75-social-media-check-in-interview-with-karen-michaels.mp3"
        },
        {
            "title": "FVPC #74 Lesson Fee Structures: Interview with Michelle Markwart Deveaux",
            "datePublished": "Fri, 01 Mar 2019 00:30:02 +0000",
            "description": "Voice teacher and business strategist, Michelle Markwart Deveaux discuss the different lesson fee structures that voice teachers can offer their ideal clients. Hourly rates, tuition fees, lesson packages or value-priced packaging all have pros and cons. Which fee structure is best for you? Which is best for your students? Michelle (as always) shares information and inspiration to build a rewarding business you love. \n\n\n\nMy Music Staff Minute: Outstanding Customer Service for Music Teachers. \nClick here to start your 30-day free trial today.\nhttps://www.mymusicstaff.com/?utm_source=FullVoice\n\nFor links mentioned in the podcast, please visit the podcast page:\nhttps://www.thefullvoice.com/fvpodcasts/74",
            "length": "80920321",
            "sourceUrl": "http://feeds.soundcloud.com/stream/583053810-thefullvoice-fvpc-74-lessonfeestructures.mp3"
        },
        {
            "title": "FVPC #73 The Curse of Knowledge",
            "datePublished": "Sat, 23 Feb 2019 00:27:51 +0000",
            "description": "The Curse of Knowledge is a sneaky cognitive bias that prevents YOU from being the best teacher you can be. Think you're not cursed? It trips up even the most experienced teacher.  It can also cause communication challenges when running your teaching studios. Learn about this evil challenge and simple ways you can lift the curse on this episode of the FULL VOICE Podcast. \n\nMy Music Staff Minute: Time-saving strategies for busy teachers.\nClick here to start your 30-day free trial today.\nhttps://www.mymusicstaff.com/?utm_source=FullVoice \n\nPlease visit the podcast page for more information and links to all resources mentioned in this episode.\n\nwww.thefullvoice.com/fvpodcasts/73",
            "length": "62191152",
            "sourceUrl": "http://feeds.soundcloud.com/stream/579805188-thefullvoice-73curseofknowledge.mp3"
        },
        {
            "title": "FVPC #72 Exploring Song Lyrics: Interview with Dana Lentini",
            "datePublished": "Fri, 15 Feb 2019 14:36:22 +0000",
            "description": "Returning guest, Dana Lentini shares her teaching strategies for discovering and exploring the lyrics of a song with young singers. From young beginners who are just learning to read to students starting new languages, Dana has some fantastic teacher take-a-ways to help singers learn and appreciate the text of their songs. Effective practice strategies and expressive singing for the win!\n\nMy Music Staff Minute\nClick here to start your 30-day free trial today.\nhttps://www.mymusicstaff.com/?utm_source=FullVoice",
            "length": "51451064",
            "sourceUrl": "http://feeds.soundcloud.com/stream/575864616-thefullvoice-72-lyrics.mp3"
        },
        {
            "title": "FVPC #71 Teaching New Languages: Interview with Dr. Tracey Ford",
            "datePublished": "Fri, 08 Feb 2019 14:19:19 +0000",
            "description": "When do you introduce a young singer to a new language? How do you begin the process? What about that tricky rolled or flipped \"r\" or blended vowels? Special guest, Tracey Ford loves working with young vocalists and is super passionate about teaching repertoire in new languages to her students. She shares her favorite beginner and intermediate song collections, fantastic resources and how she works new language challenges into her student's vocal warm-ups.\n\nMy Music Staff Minute: Using Social Media to promote your Business\n\nFor more information and links mentioned in this podcast, please visit:\nhttps://www.thefullvoice.com/fvpodcasts/71",
            "length": "70845415",
            "sourceUrl": "http://feeds.soundcloud.com/stream/572141931-thefullvoice-71-languages.mp3"
        },
        {
            "title": "FVPC #70 Freebie Friday: Lip and Tongue Trill Exercises",
            "datePublished": "Fri, 01 Feb 2019 03:08:25 +0000",
            "description": "Lip and Tongue trill exercises are favorite go-to exercises for many voice teachers.  As fantastic semi-occluded exercises, they have many useful applications. Our FREEBIE FRIDAY download \"engages\" young singers to explore lip and tongue trills with an outer space theme. \n\nFor details and links mentioned in the podcast, please visit\nwww.thefullvoice.com/fvpodcasts/70\n\nThank you to the team at  My Music Staff Staff for their weekly business tips.",
            "length": "23364754",
            "sourceUrl": "http://feeds.soundcloud.com/stream/568274874-thefullvoice-70-lip-and-tongue-trills.mp3"
        },
        {
            "title": "FVPC #69 How Your Health Affects Your Voice: Interview with Elizabeth Rotoff",
            "datePublished": "Fri, 25 Jan 2019 01:23:06 +0000",
            "description": "Colds, flu, and poor general health bring stress and suffering to everyone, but for a voice teacher and singer, it means missed opportunity and lost income(and in severe situations - vocal injury). Our guest, Voice Teacher, nutrition expert, and health coach, Elizabeth Rotoff outlines the four pillars of better health - exercise, stress management, sleep, and nutrition. \n\nIf you are looking to make healthy living a priority in 2019, Elizabeth shares some simple strategies and inspiration for happy AND healthy singing!\n\nVisit our website for more information and links to the resources mentioned in this podcast:\n\nwww.thefullvoice.com/fvpodcasts/69",
            "length": "50778279",
            "sourceUrl": "http://feeds.soundcloud.com/stream/564199704-thefullvoice-fvpc-69-how-your-health-affects-your-voice-interview-with-elizabeth-rotoff.mp3"
        },
        {
            "title": "FVPC #68 Introductory (Small Group) Vocal Classes",
            "datePublished": "Fri, 18 Jan 2019 01:43:52 +0000",
            "description": "Introductory Vocal Classes are a unique opportunity for students age 6-8 years who love to sing and are new to lessons. This group lesson is a music skills class with a particular focus on singing. \n\nIf you have the interest, space, and mindset to work with a small group class, Nikki shares the kid and teacher-tested singing games and activities and all the fantastic resources she uses to create a fun and educational vocal music curriculum. For links to all the resources mentioned in this podcast, please visit our show notes page.\n\nhttps://www.thefullvoice.com/fvpodcasts/68\n\nDebuting in this episode is the My Music Staff Minute: Business Tips for your music studio.",
            "length": "45412519",
            "sourceUrl": "http://feeds.soundcloud.com/stream/560722110-thefullvoice-68introvocalclass.mp3"
        },
        {
            "title": "FVPC #67 Vocal Warm-Ups from Around the World {Part Three}",
            "datePublished": "Fri, 11 Jan 2019 01:40:48 +0000",
            "description": "Discussions about onset, using resistance bands with our vocal students and a very naughty tongue twister that will keep everyone laughing. Our trip around the world continues and teachers are sharing their go-to warm-ups and exercises. A special thank you to Elizabeth Rotoff, (Winnipeg, Canada) Jerry Elsbernd, (Shorewood, Minnesota, U.S.) and Nicole Casey (U.K./Spain) For more information about our guests and the free resources mentioned in the podcast, please visit our podcast page www.thefullvoice.com/fvpodcasts/67\n{Please note, there is some crackle at the beginning of the interview, but it quickly fades away.}",
            "length": "63051939",
            "sourceUrl": "http://feeds.soundcloud.com/stream/557158698-thefullvoice-67warmupspartthree.mp3"
        },
        {
            "title": "FVPC #66 Vocal Warm-Ups from Around the World {Part Two}",
            "datePublished": "Wed, 26 Dec 2018 18:37:43 +0000",
            "description": "Kid friendly exercises for helping with speech articulation and easy-peasy (and super effective) exercises to help coordinate switching between the registers. We continue our journey around the world to discover great warm-ups and exercises for your students. A special thank you to Lauren MacKay (Brisbane, Australia), and Christine Keene (Anchorage, Alaska) for sharing super fun singing ideas! For more information about our guests visit our podcast page at www.thefullvoice.com/fvpodcasts",
            "length": "64611136",
            "sourceUrl": "http://feeds.soundcloud.com/stream/550302678-thefullvoice-fvpc-66-vocal-warm-ups-from-around-the-world-part-two.mp3"
        },
        {
            "title": "FVPC #65  Vocal Warm-ups  (from Around the World) Part 1",
            "datePublished": "Fri, 21 Dec 2018 19:29:26 +0000",
            "description": "Pack your bags - we are taking a trip around the world. We are stopping in on our friends and colleagues from around the globe and asking them about their favorite vocal warm-ups. {Teacher Take-a-way Alert} Listen to this podcast and You will have new and exciting vocal exercise ideas for your studio - guaranteed! In this episode, no piano warm-up tips and crowdsourcing ideas from your students to customize a warm-up that makes them smile! Special thanks to Karen Michaels, Kim Wessel and Rebekah Piatt for their great ideas (and some fun laughs!) For more information about the guests and links to more information - Please visit our webpage at www.thefullvoice.com/fvpodcasts",
            "length": "60196860",
            "sourceUrl": "http://feeds.soundcloud.com/stream/548369142-thefullvoice-65vocalwarmups1.mp3"
        },
        {
            "title": "FVPC #64 Vocal Instrument 101: Interview with Shannon Coates",
            "datePublished": "Fri, 14 Dec 2018 00:37:04 +0000",
            "description": "Returning Guest, Shannon Coates discusses her new online course: The Vocal Instrument 101. A fun and lively conversation about continuing education and diving into the science, anatomy, and physiology of singing. For information about the links mentioned in this podcast please visit www.thefullvoice.com/fvpodcasts (Please note: There is occasional “crackle” in the recording due to internet connection issues, but the voices are clear!)",
            "length": "45247505",
            "sourceUrl": "http://feeds.soundcloud.com/stream/544624455-thefullvoice-64vocalinstrument101.mp3"
        },
        {
            "title": "FVPC #63 Accompanist or Backing Tracks",
            "datePublished": "Fri, 07 Dec 2018 14:42:43 +0000",
            "description": "After miserably hacking through a student’s song on the piano in the lesson the other day, I started thinking about challenges of accompanying our students. And the struggle with using backing tracks for home practice.  Whether you are a seasoned pro behind the keyboard or your skills are functional there are plenty of times when we need to step away from the piano and watch our students too! Music is a collaborative art form and yet, are we supporting our singers too much? Visit our website for links from this podcast www.thefullvoice.com/fvpodcasts",
            "length": "33628577",
            "sourceUrl": "http://feeds.soundcloud.com/stream/541171731-thefullvoice-63accompanist.mp3"
        },
        {
            "title": "FVPC #62 Finding GREAT Audition Songs: Interview with Nate Plummer",
            "datePublished": "Fri, 30 Nov 2018 01:47:48 +0000",
            "description": "Voice teachers are ALWAYS preparing students for auditions. What songs will give our students the best chances of landing the roll? Should you transpose the music? What about the 16 or 32 bar cuts? Our good friend (and Musical Theatre guru) Nate Plummer answers these questions and MORE in this interview. For more information and shownotes visit www.thefullvoice.com/fvpodcasts",
            "length": "65657549",
            "sourceUrl": "http://feeds.soundcloud.com/stream/537045054-thefullvoice-62greatauditionsongs.mp3"
        },
        {
            "title": "FVPC #61 Student Retention",
            "datePublished": "Thu, 22 Nov 2018 23:55:35 +0000",
            "description": "Keeping students engaged and participating in your teaching studio can be challenging. Yes, students often quit lessons for many reasons that are out of our control, but in this podcast, Nikki discusses several strategies that can ensure that students of all ages will stay with us and take advantage of all that we have to offer in our teaching studios. For more information and links to the show notes, please visit www.thefullvoice.com/fvpodcasts",
            "length": "44668551",
            "sourceUrl": "http://feeds.soundcloud.com/stream/534140226-thefullvoice-fvpc-61-student-retention.mp3"
        },
        {
            "title": "FVPC #60 Challenges in Your Teaching Studio as Life Goes On: Special Guest Michelle Markwart Deveaux",
            "datePublished": "Fri, 16 Nov 2018 00:03:58 +0000",
            "description": "Special returning guest, Michelle Markwart Deveaux discusses the unique challenges we face in our teaching studios depending on our age. Yes! Age matters more than you may think when running an independent teaching studio. Whether you are new to teaching or you have been at it for decades, Michelle shares strategies for all of us PLUS an important reminder about how we can all support each other. For all links mentioned in this podcast, please visit our website at www.thefullvoice.com",
            "length": "49530253",
            "sourceUrl": "http://feeds.soundcloud.com/stream/530545584-thefullvoice-60agematters.mp3"
        },
        {
            "title": "FVPC #59 Creating Your Own Music Resources: Interview with Mim Adams",
            "datePublished": "Fri, 09 Nov 2018 02:08:44 +0000",
            "description": "If you are interested in creating music teaching resources - This podcast is for you. My dearest friend and faithful colleague, Mim Adams dropped into the FULL VOICE office, and we talked about our adventures researching, creating, publishing and marketing the FULL VOICE resources. It has been a LONG journey(almost 20 years), but we have enjoyed the challenges all along the way. We hope to inspire those of you who are interested in developing your educational materials. For a detailed list of all the products listed in this podcast please visit https://www.thefullvoice.com/fvpodcasts/",
            "length": "36254197",
            "sourceUrl": "http://feeds.soundcloud.com/stream/526942512-thefullvoice-fvpc-59-creating-your-own-music-resources-interview-with-mim-adams.mp3"
        },
        {
            "title": "FVPC #58 Songs for Young Singers: Interview with composer Glyn Lehmann",
            "datePublished": "Fri, 02 Nov 2018 19:08:03 +0000",
            "description": "Nikki talks to Australian composer Glyn Lehmann about his modern, pop-infused music for young singers. Children around the world have enjoyed singing his music and he shares his inspiration in composing for young voices. This podcast features clips of his catchy songs from his library of great music. Visit www.thefullvoice.com/fvpodcasts/58songlibrary for links to all the great resources listed in this podcast \n\nSongs Featured in this podcast (with permission from the composer)\nThe Children of the World\nI am the Earth\nFeed Your Imagination\nThe Seed\nThe Dance\nSing for You",
            "length": "40715911",
            "sourceUrl": "http://feeds.soundcloud.com/stream/523868136-thefullvoice-58-songlibrary.mp3"
        },
        {
            "title": "FVPC #57 Freebie Friday: Exploring ONSET with Young Singers",
            "datePublished": "Thu, 25 Oct 2018 23:35:49 +0000",
            "description": "Vocal onset is a big topic in most voice studios - but how do you explore this with young singers? We came up with a kid-friendly vocalise that uses glottal, aspirate and balanced onset sounds. \"Singing Owls\" is now available on our website and makes it fun for your kiddos discovering the sounds they make when they sing. Visit our website to get your copy of this free download www.thefullvoice.com/freeresources",
            "length": "23039164",
            "sourceUrl": "http://feeds.soundcloud.com/stream/519968157-thefullvoice-fvpc-57exploringonset.mp3"
        },
        {
            "title": "FVPC #56 Inside My Music Staff",
            "datePublished": "Fri, 19 Oct 2018 03:13:04 +0000",
            "description": "The dedicated team from My Music Staff are helping savvy music teachers run their teaching business online. Nikki talks with Dan and Dasa from My Music Staff and discovers how the company got their start five years ago (spoiler alert: Dan's wife is a voice teacher - What!!)and the new features the team is working on now.",
            "length": "41902080",
            "sourceUrl": "http://feeds.soundcloud.com/stream/516523140-thefullvoice-56-mymusicstaff.mp3"
        },
        {
            "title": "FVPC #55 Vocal Exploration Exercises",
            "datePublished": "Sat, 13 Oct 2018 01:18:45 +0000",
            "description": "Vocal exploration exercises are whole body activities that encourage students to use their voice in fun and creative ways. Often reserved for the youngest singers, vocal exploration exercises can be the first step in helping young singers sing in tune. But did you know, sirens, animal sounds, tongue twisters, and vocal expression lines can help singers of all ages and provide teachers incredible insight about the students in your studios? Visit our website for more information and free teaching resources www.thefullvoice.com \n\nFull Voice resources are now available worldwide on Amazon",
            "length": "42236447",
            "sourceUrl": "http://feeds.soundcloud.com/stream/513567972-thefullvoice-fvpc-55-vocal-exploration-exercises.mp3"
        },
        {
            "title": "FVPC #54 Sane Singing: Interview with Brian Lee",
            "datePublished": "Fri, 05 Oct 2018 02:21:46 +0000",
            "description": "Special Guest, Brian Lee discusses his new book, Sane Singing: A Guide to Vocal Progress. His book is “about self-advocacy - taking control of the course of your vocal life.” It is also a brilliant check-in for voice teachers about how challenging it can be for voice students trying to become a better singer.",
            "length": "46750406",
            "sourceUrl": "http://feeds.soundcloud.com/stream/509757411-thefullvoice-fvpc-54-sane-singing-interview-with-brian-lee.mp3"
        },
        {
            "title": "FVPC #53 Spooky Vocal Warm-Ups 2 (With Wicked Repertoire Recommendations)",
            "datePublished": "Fri, 28 Sep 2018 02:18:55 +0000",
            "description": "The Halloween Season is here! (And so is our new FREEBIE Friday download!) Using the scary themes from Halloween can be a fun time in the private teaching studio. Singing minor triads and arpeggios or exploring a chromatic scale is far more engaging with a ghostly “Oooo” or “Eeeee”.  Have some fun with your singers of all ages this month. Don't forget to get your FREEBIE FRIDAY DOWNLOAD www.thefullvoice.com/freeresources",
            "length": "27494191",
            "sourceUrl": "http://feeds.soundcloud.com/stream/506298159-thefullvoice-fvpc-53-spookyvocalwarmups2.mp3"
        },
        {
            "title": "FVPC #52 - Movable DO, Fixed DO, Numbers and Note Names - Oh My!",
            "datePublished": "Fri, 21 Sep 2018 01:58:20 +0000",
            "description": "Helping young music students to understand the language of music requires a system or method. There are many different music systems including movable DO (tonic sol-fa), fixed DO (solfege), numbers and note names. Which one is the best one for you? Which one is the best system for your students?",
            "length": "49347058",
            "sourceUrl": "http://feeds.soundcloud.com/stream/502895661-thefullvoice-fvpc-52-movable-do-fixed-do-numbers-and-note-names-oh-my.mp3"
        },
        {
            "title": "FVPC #51 Breathe, Sing, Move: Interview with Rachel Goldenberg and Jessica",
            "datePublished": "Thu, 13 Sep 2018 14:46:56 +0000",
            "description": "Professional Singing Teacher, Rachel Goldenberg, and Physiotherapist, Jessica DeMars are working together with a one of a kind program called Breathe, Sing, Move. This combination of a singing class and physiotherapy session assists patients with mild to moderate respiratory disease increase respiratory muscle strength, improve speech quality, reduce breathlessness and enhance the quality of life. Just one of the many great benefits of learning to sing! For more information about this program and my inspired guests - visit https://www.thefullvoice.com/fvpodcasts/",
            "length": "73252233",
            "sourceUrl": "http://feeds.soundcloud.com/stream/499361955-thefullvoice-fvpc-51-breathe-sing-move-interview-with-rachel-goldenberg-and-jessica.mp3"
        },
        {
            "title": "FVPC #50 Vocalization Tools (Part 2)",
            "datePublished": "Thu, 30 Aug 2018 20:10:55 +0000",
            "description": "In podcast #50 we finish the discussion about vocalization tools and we bring back great clips from season one and season two. We also close out season two with a preview about some of the great interviews and topics that we will be exploring in the FULL VOICE Podcast - Season Three. (Starting September 2018)www.thefullvoice.com/fvpodcasts\n\nSpecial returning guests in this podcast:\nShannon Coates - The Vocal Instrument 101\nSara Campbell - Sara's Music Studio\nAmanda Broadfoot - Making Light Productions\nChristin Coffee Rondeau - Sanddollar Music",
            "length": "39605056",
            "sourceUrl": "http://feeds.soundcloud.com/stream/492958245-thefullvoice-fvpc-50-vocalization-tools-part-2.mp3"
        },
        {
            "title": "FVPC #49 Vocalization Tools",
            "datePublished": "Fri, 17 Aug 2018 00:00:00 +0000",
            "description": "Long gone are the days of only teaching singing by rote. There are so many tools, props, and toys that can help our singers warm-up the voice, connect with the body, correct vocal flaws, expand the range, and explore and discover their voices. Nikki shares activities and inspiration for students of all ages. Super fun and effective ideas for private or small group classes.",
            "length": "81856394",
            "sourceUrl": "http://feeds.soundcloud.com/stream/486804057-thefullvoice-fvpc-49-vocalization-tools.mp3"
        },
        {
            "title": "FVPC #48 Social Media for Private Teachers: Interview with Karen Michaels",
            "datePublished": "Thu, 09 Aug 2018 14:33:53 +0000",
            "description": "Using social media for your teaching studio is non-negotiable. It is a business essential. If you are unsure, overwhelmed or need some catch-up information about the leading social media platforms that Private teachers are using, my special guest, Karen Michaels is not only a busy voice teacher; she is a social media expert. (win-win) Karen is Social Butterfly Guru, and she shares her tips and passion for using social media for your business. Recorded in Las Vegas at the NATS convention in June 2018",
            "length": "81784243",
            "sourceUrl": "http://feeds.soundcloud.com/stream/483266253-thefullvoice-fvpc48-socialmediaforteachers.mp3"
        },
        {
            "title": "FVPC #47 More Than Changing Voices: Interview with Patti Barrow",
            "datePublished": "Thu, 26 Jul 2018 14:24:59 +0000",
            "description": "Voice Teachers are very aware of the voice changes in our adolescent singers, but our young men are dealing with many other challenges. My special guest, Patti Barrow discusses the emotional and psychological changes that our young men struggle with and how we can best support them during this vulnerable time. Patti also shares a BIG list of recommended repertoire for changing voices. For a listing of all the fantastic resources from this podcast visit our website: https://www.thefullvoice.com/fvpodcasts/",
            "length": "95048440",
            "sourceUrl": "http://feeds.soundcloud.com/stream/477007983-thefullvoice-fvpc-47-more-than-changing-voices-interview-with-patti-barrow.mp3"
        },
        {
            "title": "FVPC #46 Vocal Exercise Masterclass: with Dana Lentini, Brian Lee, and Shannon Coates",
            "datePublished": "Sat, 30 Jun 2018 02:32:02 +0000",
            "description": "Recorded from the 2018 NATS convention in Las Vegas, my talented colleagues share the HOW and WHY of their favorite exercises. From exercises to help singers sing more expressively, to the challenges of Messa di Voce, Dana Lentini (born2singkids.com), Brian Lee (Vocalability.com), and Shannon Coates (Vocal Instrument 101) share their expertise and some laughs in this impromptu podcast.",
            "length": "58431460",
            "sourceUrl": "http://feeds.soundcloud.com/stream/465377181-thefullvoice-fvpc46-vocalexercisemasterclass.mp3"
        },
        {
            "title": "FVPC #45 Interview with Donna Rhodenizer and Andy Duinker",
            "datePublished": "Mon, 14 May 2018 16:12:41 +0000",
            "description": "Computer Cat, Ed the Invisible Dragon, I'm Wishing and Forty Little Birdies. If you haven't heard of these fun and educational songs by Donna Rhodenizer, you are in for a fantastic listen. Our special guests on the FULL VOICE podcast are Juno nominated children's music performers - Donna and Andy. Donna shares her inspiration and stories about teaching and composing. Donna and Andy share entertaining stories of their adventures touring on the road. Donna's music reaches a global audience. For more information about Donna and Andy and Red Castle Publishing - visit our website www.thefullvoice.com/fvpodcasts",
            "length": "68115777",
            "sourceUrl": "http://feeds.soundcloud.com/stream/443921988-thefullvoice-fvpc-45-interview-with-donna-rhodenizer-and-andy-duinker.mp3"
        },
        {
            "title": "FVPC #44 Don't Be Afraid to Raise Your Rates",
            "datePublished": "Tue, 01 May 2018 03:14:52 +0000",
            "description": "You know it is time to raise your lessons rates and tuition fees. For some of you, it is well overdue. Making changes to your business is scary and yes, you may lose a student or two, but you have much more to gain. Raising your rates means that you get to re-invest in your studio and your students. It can breath new life into your business and with the right wording in your communications - it may be easier than you think! Visit our podcast page for more resources and show notes. https://www.thefullvoice.com/fvpodcasts/rateyourrates",
            "length": "49152760",
            "sourceUrl": "http://feeds.soundcloud.com/stream/437611545-thefullvoice-fvpc-44-dont-be-afraid-to-raise-your-rates.mp3"
        },
        {
            "title": "FVPC #43 Movement in the Voice Lesson: Interview with Christin Coffee Rondeau",
            "datePublished": "Thu, 29 Mar 2018 20:46:42 +0000",
            "description": "In podcast #43, Our special guest, Christin Coffee Rondeau shares her passion for working with young singers and how she incorporates Orff-inspired movement and creative play into the private voice lesson and small group classes. For links and more information please visit our website: www.thefullvoice.com/podcasts\n\nVisit our website: https://www.thefullvoice.com/fvpodcasts/43",
            "length": "71474936",
            "sourceUrl": "http://feeds.soundcloud.com/stream/422013387-thefullvoice-fvpc-43-movement-in-the-voice-lesson-interview-with-christin-coffee.mp3"
        },
        {
            "title": "FVPC #42 Small Group Vocal Classes",
            "datePublished": "Wed, 14 Mar 2018 01:20:46 +0000",
            "description": "Have you been thinking about offering small group classes? There are fantastic opportunities for voice teachers to work with small ensembles and vocal classes in the private teaching studio. In podcast #42, Nikki discusses the pro and cons of teaching small group lessons as well as important logistics that teachers need to consider before welcoming a group into the lesson studio.",
            "length": "57107933",
            "sourceUrl": "http://feeds.soundcloud.com/stream/413337351-thefullvoice-fvpc-42-small-group-vocal-classes.mp3"
        },
        {
            "title": "FVPC #41 Teen Girl's Singing Guide: Interview with Nancy Bos",
            "datePublished": "Sat, 03 Mar 2018 17:28:03 +0000",
            "description": "Nancy Bos is a Sing, Voice Actor, Singing Teacher, Published Author and the Host of Every Sing Podcast. In this interview, Nancy discusses her new book, The Teen Girl's Singing Guide and how it can inspire and answer many important questions for a teenage girl interested in pursuing a career in singing.",
            "length": "58755690",
            "sourceUrl": "http://feeds.soundcloud.com/stream/408131847-thefullvoice-fvpc-41-teen-girls-singing-guide-interview-with-nancy-bos.mp3"
        },
        {
            "title": "FVPC # 40 Preschool Music Classes with Ben Bowen",
            "datePublished": "Fri, 23 Feb 2018 17:48:56 +0000",
            "description": "Ben Bowen is a Preschool Children's Music Educator from Hamilton, Ontario. He discusses the challenges of facilitating immersive music programs for children under the age of 5 years old and how he uses classical music and songwriting to keep his students (and himself) inspired and engaged. For more information about Ben please visit our website www.thefullvoice.com/podcasts/",
            "length": "74491166",
            "sourceUrl": "http://feeds.soundcloud.com/stream/404120907-thefullvoice-fvpc-40-preschool-music-classes-with-ben-bowen.mp3"
        },
        {
            "title": "FVPC #39 Beyond Technical Exercises and Repertoire",
            "datePublished": "Thu, 25 Jan 2018 00:00:00 +0000",
            "description": "Technical exercises, warm-ups, and repertoire development are the core of a great lesson, but Nikki has a list of \"other\" topics and activities that will come up in a comprehensive vocal music lesson for students of any age. Listen to the FULL VOICE Podcast and find out how you can help your student enjoy a lifetime of musical opportunities.",
            "length": "54872444",
            "sourceUrl": "http://feeds.soundcloud.com/stream/389215140-thefullvoice-fvpc-39-beyond-technical-exercises-and-repertoire.mp3"
        },
        {
            "title": "FVPC #38 Teacher/Parent Relationships",
            "datePublished": "Thu, 14 Dec 2017 18:46:44 +0000",
            "description": "Podcast #38 is about the ever so challenging, Parent - Teacher relationship. If you are working with young singers, you are working with Moms and Dads. (Whether you like it or not.) Nikki shares some simple strategies to help build better relationships with parents and a stronger community within your teaching studio. For more information, visit our podcast page. www.thefullvoice.com/podcasts",
            "length": "64601296",
            "sourceUrl": "http://feeds.soundcloud.com/stream/369544259-thefullvoice-fvpc-38-teacherparent-relationships.mp3"
        },
        {
            "title": "FVPC #37 The Young Singing Larynx: Interview with Dana Lentini",
            "datePublished": "Fri, 27 Oct 2017 13:25:52 +0000",
            "description": "Voice Teacher and pedagogue,  Dana Lentini shares her passion and detailed research about teaching young children to sing. She discusses the Young Singing Larynx and how it changes through childhood and puberty. Her recent research addresses many of the \"myths\" pertaining to working with young singers in the private teaching studio. Visit our website for more information;\nhttps://www.thefullvoice.com/fvpodcasts/37",
            "length": "79335485",
            "sourceUrl": "http://feeds.soundcloud.com/stream/348841045-thefullvoice-fvpc-37-the-young-singing-larynx-interview-with-dana-lentini.mp3"
        },
        {
            "title": "FVPC #36 Building your Community of Colleagues: Interview with Michelle Markwart Deveaux",
            "datePublished": "Fri, 08 Sep 2017 16:04:24 +0000",
            "description": "Our special guest, voice teacher, and savvy business coach, Michelle Markwart Deveaux talks about growth mindset, the importance of connecting with supportive colleagues and how to participate on online forums in a positive way.",
            "length": "85562874",
            "sourceUrl": "http://feeds.soundcloud.com/stream/341488121-thefullvoice-fvpc-36-business-and-growth-mindset-for-voice-teachers-interview-with-michelle-markwart-deaveaux.mp3"
        },
        {
            "title": "FVPC # 35 - Alignment vs Posture: Interview with Sarah Whitten",
            "datePublished": "Mon, 14 Aug 2017 01:15:25 +0000",
            "description": "Voice and Yoga Teacher Sarah Whitten talks about helping singers connect to their whole body and shares great resources for voice teachers. Whether you are new to Yoga or have been a practising Yogi for a long time this podcast has some fantastic teacher take aways",
            "length": "49945287",
            "sourceUrl": "http://feeds.soundcloud.com/stream/337762831-thefullvoice-fvpc-35-alignment-vs-posture-interview-with-sarah-whitten.mp3"
        },
        {
            "title": "FVPC #34 - Working with Adult Avocational Students",
            "datePublished": "Thu, 15 Jun 2017 17:57:13 +0000",
            "description": "Adults who are interested in \"singing for fun\" can be a blessing (or a curse) for the private music teacher. In this podcast, we discuss the pros and cons of working with this growing demographic of voice student and some simple strategies to make it work. Visit our podcast page for more information www.thefullvoice.com/podcasts",
            "length": "50691268",
            "sourceUrl": "http://feeds.soundcloud.com/stream/328236259-thefullvoice-fvpc-34-working-with-adult-avocational-students.mp3"
        },
        {
            "title": "FVPC #33 Working with kids with Special Needs: Interview with Amanda Broadfoot",
            "datePublished": "Fri, 28 Apr 2017 12:51:00 +0000",
            "description": "April is Autism Awareness month and our special Guest, Amanda Broadfoot, is a voice and piano teacher from Tallahassee Florida. She is the Creative Director of Making Light Productions - a non-profit, inclusive theatre arts education program for children of all abilities. Amanda shares her teaching story as well as encouraging and inspiring strategies for teachers who are working with special needs children.",
            "length": "78211997",
            "sourceUrl": "http://feeds.soundcloud.com/stream/319890157-thefullvoice-fvpc-33-working-with-kids-with-special-needs.mp3"
        },
        {
            "title": "FVPC #32 - Act it out! Interview with Nate Plummer",
            "datePublished": "Mon, 10 Apr 2017 19:38:00 +0000",
            "description": "Every singer is an actor, (but not every actor is a singer). In this podcast, professional actor, singer and music educator, Nate Plummer shares his teaching tips for helping our young students with their acting skills. Nate specializes in Theatre for Youth, and he shares fantastic teaching strategies - Everything from making students comfortable in the lesson to the three magic questions that every performer needs to ask before singing a song. This podcast will help your young singers dive into dramatic storytelling and bring their performances to the next level. Visit www.thefullvoice.com/podcasts",
            "length": "56643453",
            "sourceUrl": "http://feeds.soundcloud.com/stream/317038400-thefullvoice-fvpc32-act-it-out-interview-with-nate-plummer.mp3"
        },
        {
            "title": "FVPC #31 Recitals With A Rhythm Section",
            "datePublished": "Tue, 28 Mar 2017 16:10:54 +0000",
            "description": "This podcast is for voice teachers who are hosting contemporary commercial recitals (or \"unrecitals\") and are interested in giving students the opportunity to perform with a small band. Nikki shares strategies for finding the right musicians, venue, sound systems, and how to help your students prepare for this opportunity. Plenty of teacher take-a-ways for those of you who are looking to \"jazz\" up your student recitals.",
            "length": "48583446",
            "sourceUrl": "http://feeds.soundcloud.com/stream/314890964-thefullvoice-fvpc-31-recitals-with-a-rhythm-section.mp3"
        },
        {
            "title": "FVPC #30 - 10 ways to Earn More Money from your Teaching Studio",
            "datePublished": "Thu, 09 Feb 2017 16:18:24 +0000",
            "description": "In podcast #30 we are talking about our relationship with money and how it has a direct effect on how we run our businesses. Includes a top 10 list of how teachers can earn more money in their music teaching studios. Visit our website for show notes and links to more information. www.thefullvoice.com/podcasts May you sing long and prosper!",
            "length": "56883555",
            "sourceUrl": "http://feeds.soundcloud.com/stream/306898128-thefullvoice-fvpc-30-10-ways-to-earn-more-money-from-your-teaching-studio.mp3"
        },
        {
            "title": "FVPC #29 Interview with John Henny - Skype Lessons and the New Science of Singing",
            "datePublished": "Fri, 27 Jan 2017 01:20:13 +0000",
            "description": "In this podcast, we talk with renown LA Vocal Coach, podcast host and online course creator, John Henny about teaching long distance voice lessons (Skype Lessons) and about his new online course: The New Science of Singing Certification Course",
            "length": "54891122",
            "sourceUrl": "http://feeds.soundcloud.com/stream/304720343-thefullvoice-fvpc-29-interview-with-john-henny.mp3"
        },
        {
            "title": "FVPC #28 Studio Spotlight: Nicola Cantan and the 30 day Music Teaching Studio Refresh",
            "datePublished": "Tue, 10 Jan 2017 03:54:38 +0000",
            "description": "Happy New Year! Looking for some New Year inspiration? In this podcast, we talk with Nicola Cantan. Nicola is a piano teacher, resource creator, and music teaching blogger from Dublin, Ireland. Although she teaches piano, Nicola does quite a bit of (sight) singing with her students in her lesson studio. (The reason for this is quite surprising!) She is the creator of the 30-Day Music Teaching Studio Refresh Challenge on her Colourful Keys Blog. Find out how to be part of the Studio refresh at www.thefullvoice.com/fvpodcasts",
            "length": "46856267",
            "sourceUrl": "http://feeds.soundcloud.com/stream/301778905-thefullvoice-fvpc-28-studio-spotlight-nicola-cantan-and-the-30-day-music-teaching-studio-refresh.mp3"
        },
        {
            "title": "FVPC #27 Effective Lesson Pacing for Young Singers(Part 2)",
            "datePublished": "Fri, 06 Jan 2017 02:09:23 +0000",
            "description": "This podcast is part two in the series about lesson pacing for our young voice students. Nikki shares ten teacher and student tested activities that help beginners learn about their voices and develop musicianship skills. They are fun, educational activities, games, and exercises that are guaranteed to make your students smile. (and better singers.)",
            "length": "50571535",
            "sourceUrl": "http://feeds.soundcloud.com/stream/301149324-thefullvoice-fvpc-27-effective-lesson-pacing-part-2.mp3"
        },
        {
            "title": "FVPC #26 Effective Lesson Pacing for Young Singers (Part One)",
            "datePublished": "Mon, 26 Dec 2016 16:30:30 +0000",
            "description": "This podcast is all about effective lesson pacing for Young Singers. Great lesson pacing in the private teaching studio is a challenge - for any discipline. There are so many things to consider when facilitating a fun, educational vocal music program. Part One is about Student Focused Teaching.  How do you know if your lesson pacing is addressing the needs of your voice students? Listen to our podcast and find out! www.thefullvoice.com/podcasts",
            "length": "43568391",
            "sourceUrl": "http://feeds.soundcloud.com/stream/299663148-thefullvoice-fvpc-26-effective-lesson-pacing-for-young-singers-part-one.mp3"
        },
        {
            "title": "FVPC #25  Helping beginner students with first performances",
            "datePublished": "Thu, 10 Nov 2016 16:41:27 +0000",
            "description": "In this podcast, we are sharing simple teaching strategies that can help your beginner students (of any age) who are preparing for their first performances. With proper preparation, better communication and understanding support - even your \"shyest\" students can shine on your recital stage. Visit our podcast page for more details and links www.thefullvoice.com/podcasts",
            "length": "53739476",
            "sourceUrl": "http://feeds.soundcloud.com/stream/292401714-thefullvoice-fvpc-25-helping-beginner-students-with-first-performances.mp3"
        },
        {
            "title": "FVPC #24 Halloween Special: Spooky Vocal Warm-Ups",
            "datePublished": "Sun, 23 Oct 2016 00:03:12 +0000",
            "description": "SCARY! This halloween themed podcast is all about helping young singers with minor scales, minor triads and chromatic passages. It includes strategies for getting more music reading and ear training in every lesson AND keeping students engaged and learning. (Visit www.thefullvoice.com/freeresources to get your copy of the spooky vocal warm up pdf. )",
            "length": "39280373",
            "sourceUrl": "http://feeds.soundcloud.com/stream/289519389-thefullvoice-fvpc-24-halloween-special-spooky-vocal-warm-ups.mp3"
        },
        {
            "title": "FVPC #23 - Favorite Vocal Exercises and Warm-ups",
            "datePublished": "Thu, 20 Oct 2016 02:59:42 +0000",
            "description": "Have you ever wondered what vocal exercises your colleagues are using in their teaching studios? In this podcast, we bring back expert guests and ask them about their favorite vocal warms up and technical exercises. Special Guests: Mim Adams, Sara Campbell, Shannon Coates, Anne Barnshaw and Jason Hales.",
            "length": "59043293",
            "sourceUrl": "http://feeds.soundcloud.com/stream/289092382-thefullvoice-fvpc-23-favorite-vocal-exercises-and-warm-ups.mp3"
        },
        {
            "title": "FVPC #22 Jaw Tension,  TMJ and Bruxism: Interview with Physiotherapist Claire Corbett",
            "datePublished": "Tue, 20 Sep 2016 16:01:47 +0000",
            "description": "This podcast is all about jaw tension including temporomandibular Joint Dysfunction (TMJ) and Bruxism. Our special guest, Registered Physiotherapist Claire Corbett shares her clinical expertise about this condition and offers some strategies for caring for the jaw.  Don't forget to visit our FULL VOICE podcast page for her free pdf about the TMJ. www.thefullvoice.com/podcasts",
            "length": "51327557",
            "sourceUrl": "http://feeds.soundcloud.com/stream/283794831-thefullvoice-fvpc-22-jaw-tension-tmj-and-bruxism-interview-with-physiotherapist-claire-corbett.mp3"
        },
        {
            "title": "FVPC# 21 Welcoming Back Students After the Summer Break: 6 Tips for a Great year of Teaching",
            "datePublished": "Thu, 25 Aug 2016 01:24:16 +0000",
            "description": "Many Private Music Teachers are gearing up their studios for another year of teaching after the summer break. This podcast includes 6 fantastic teacher tips that can save you time, money and your sanity. Follow these steps and you and your returning students will have one incredible year of singing!",
            "length": "46330228",
            "sourceUrl": "http://feeds.soundcloud.com/stream/279770521-thefullvoice-fvpc-21-welcoming-back-students-after-the-summer-break-6-tips-for-a-great-year-of-teaching.mp3"
        },
        {
            "title": "FVPC #20 The Art Of Teaching Transfer Students: Interview with Jennifer Smele",
            "datePublished": "Fri, 12 Aug 2016 14:02:36 +0000",
            "description": "Special Guest, Jennifer Smele shares her research and teaching strategies when working with \"Transfer Students\". (Student who have previous lesson experience with another teacher.) Everything from better screening proceedures, updating policies, setting boundaries and dealing with students who think they are further along than they actually are. ",
            "length": "62451332",
            "sourceUrl": "http://feeds.soundcloud.com/stream/277962089-thefullvoice-20-transferstudents.mp3"
        },
        {
            "title": "FVPC # 19 - Strategies for Students Struggling with Stillness: Interview With Shannon Coates",
            "datePublished": "Thu, 21 Jul 2016 13:13:12 +0000",
            "description": "Our special Guest, Shannon Coates, shares her experience and strategies for working with our young singers who are struggling to keep still and focus in the vocal lesson. (You know those students - the wiggly ones who cannot stay still and are always fidgeting with the music stand.)\n\nFor more information, please visit our website\nhttps://www.thefullvoice.com/fvpodcasts/19",
            "length": "52371410",
            "sourceUrl": "http://feeds.soundcloud.com/stream/274695406-thefullvoice-fvpc-19-strategies-for-students-struggling-with-stillness-interview-with-shannon-coates.mp3"
        },
        {
            "title": "FVPC #18 - Updating Your Lesson Studio Policy",
            "datePublished": "Fri, 17 Jun 2016 03:27:03 +0000",
            "description": "Private Music Teachers -  Is it time to raise your rates? Maybe your fees are fine, but you're stressed by frequent cancellations, annoying make-up lessons and a fluctuating income.  Updating your teaching policy does not have to be stressful. In this podcast we discuss all the essential policy details that you need to cover AND how to present your  \"new\" policy so families will be excited for the upcoming year in voice lessons. Includes great teachers take-a-ways and online resources.",
            "length": "54815845",
            "sourceUrl": "http://feeds.soundcloud.com/stream/269542221-thefullvoice-fvpc-18-updating-your-lesson-studio-policy.mp3"
        },
        {
            "title": "FVPC #17 Voice Exams with Joan Heels",
            "datePublished": "Sat, 28 May 2016 16:41:54 +0000",
            "description": "Special Guest, Voice teacher and examiner, Dr. Joan Heels shares her insight, stories and some very important do's and don't's for singers preparing for voice exams. Great teacher and accompanist take-a-ways in this interview. ",
            "length": "47811058",
            "sourceUrl": "http://feeds.soundcloud.com/stream/266352858-thefullvoice-fvpc-17-voice-exams-with-joan-heels.mp3"
        },
        {
            "title": "FVPC #16 - How To Fire A Student",
            "datePublished": "Thu, 12 May 2016 17:18:48 +0000",
            "description": "This episode is all about being professional, courteous and graceful when letting a student go. Firing a student is never easy - so we talk strategies and guidelines to consider before you say goodbye. ",
            "length": "48771528",
            "sourceUrl": "http://feeds.soundcloud.com/stream/263802344-thefullvoice-fvpc-16-how-to-fire-a-student.mp3"
        },
        {
            "title": "FVPC #15 Vocal Workshops: Interview With Sara Campbell",
            "datePublished": "Tue, 26 Apr 2016 13:39:26 +0000",
            "description": "In this podcast: Group lessons are a fantastic opportunity for private teachers to keep a busy teaching schedule through slower summer months. Teachers interested in hosting workshops will learn about the detailed steps it takes to run a group program. Our highly experienced guest, Sara Campbell shares her expertise when it comes to successful and profitable vocal music workshops. ",
            "length": "58669637",
            "sourceUrl": "http://feeds.soundcloud.com/stream/260975955-thefullvoice-fvpc-15-vocal-workshops-interview-with-sara-campbell.mp3"
        },
        {
            "title": "FVPC #14 Working with Changing Voices: Interview With Roland Fix",
            "datePublished": "Sat, 02 Apr 2016 12:38:14 +0000",
            "description": "Our Guest, Roland Fix shares wonderful insight and strategies when working with our boy students who are going through voice change. Roland discusses his teaching experiences with these young singers in his private voice studio and in his middle school choir. ",
            "length": "59763018",
            "sourceUrl": "http://feeds.soundcloud.com/stream/256905819-thefullvoice-fvpc-14-working-with-changing-voices-interview-with-roland-fix.mp3"
        },
        {
            "title": "FVPC #13 - Finding Your Dream Students",
            "datePublished": "Fri, 18 Mar 2016 01:40:49 +0000",
            "description": "Finding great students is about identifying your unique teaching talents and then communicating to your \"people\" how awesome you are. In this podcast we talk about the 3 steps you take to getting your message out there - and saying hello to awesome new students. ",
            "length": "46083214",
            "sourceUrl": "http://feeds.soundcloud.com/stream/252480565-thefullvoice-fvpc-13-finding-your-dream-students.mp3"
        },
        {
            "title": "FVPC #12 The 'No Singing' Voice Lesson",
            "datePublished": "Thu, 25 Feb 2016 04:35:53 +0000",
            "description": "There are plenty of musical activities that allow singers to rest their voices. Guaranteed for a productive, fun and educational voice lesson - even when they have no voice!",
            "length": "33339430",
            "sourceUrl": "http://feeds.soundcloud.com/stream/248789702-thefullvoice-fvpc-12-the-no-singing-voice-lesson.mp3"
        },
        {
            "title": "FVPC #11 - Online Tools For Music Teachers",
            "datePublished": "Mon, 22 Feb 2016 17:20:40 +0000",
            "description": "This podcast is all about great online tools and services that help  music teachers run their teaching studios. These websites and programs help teachers save time, money and run your business in a creative and professional manner. ",
            "length": "29235489",
            "sourceUrl": "http://feeds.soundcloud.com/stream/248351835-thefullvoice-fvpc-11-online-tools-for-music-teachers.mp3"
        },
        {
            "title": "FVPC #10 - Introducing Jazz Repertoire to Young Singers: InterviewWith Mim Adams",
            "datePublished": "Thu, 11 Feb 2016 02:35:36 +0000",
            "description": "Mim Adams is a talented and passionate Jazz Music Educator with outstanding song ideas and teaching strategies to help your young singers get started in this fantastic and challenging genre. She has great repertoire recommendations including what songs you should start with and five songs you should avoid! We discuss why this genre is ESSENTIAL for the developing young vocalist. ",
            "length": "69027293",
            "sourceUrl": "http://feeds.soundcloud.com/stream/246468080-thefullvoice-fvpc-10-introducing-jazz-repertoire-to-young-singers-interviewwith-mim-adams.mp3"
        },
        {
            "title": "FVPC #9 - Meditation & Mindful Teaching With Steve Ferrell",
            "datePublished": "Mon, 01 Feb 2016 15:38:12 +0000",
            "description": "Steve Ferrell is a Yoga and Meditation Teacher with great insight on how we can be more present and focused in the teaching studio and how we can help our distracted students as well. He calls it \"Survival in an Attention Deficit Society\".",
            "length": "57987528",
            "sourceUrl": "http://feeds.soundcloud.com/stream/244896063-thefullvoice-fvpc-9-meditation-mindful-teaching-with-steve-ferrell.mp3"
        },
        {
            "title": "FVPC #8 - Repertoire Recommendation With Anne Barnshaw -Musical Theatre selections for young singers",
            "datePublished": "Wed, 13 Jan 2016 15:59:40 +0000",
            "description": "In this podcast, we discuss why so many(too many)singers choose the wrong repertoire and the many reasons why a song may not be the right choice for the singer. But fear not, Anne Barnshaw has some great suggestions for young boys and girls (and teachers) looking for more suitable musical theatre material. \n\nFor more information, please visit our website:\nhttps://www.thefullvoice.com/fvpodcasts/8",
            "length": "42243214",
            "sourceUrl": "http://feeds.soundcloud.com/stream/241776130-thefullvoice-fvpc-8-repertoire-recommendation-with-anne-barnshaw-musical-theatre-selections-for-young-singers.mp3"
        },
        {
            "title": "FVPC #7 - Are You In A Repertoire Rut?",
            "datePublished": "Thu, 07 Jan 2016 03:48:52 +0000",
            "description": "Choosing appropriate songs for young singers (any singer) is always a challenge. In this podcast we discuss the many challenges and offer some strategies to make (a bit) easier.\n",
            "length": "38115449",
            "sourceUrl": "http://feeds.soundcloud.com/stream/240761076-thefullvoice-fvpc-7-are-you-in-a-repertoire-rut.mp3"
        },
        {
            "title": "FVPC Build your business and successfully expand your teaching studio: Interview with Teresa Cirillo",
            "datePublished": "Wed, 16 Dec 2015 16:25:57 +0000",
            "description": "Have you been thinking about expanding your teaching studio? Perhaps you are entertaining the thought of opening a music school. Teresa Cirillo is the owner and director of the successful Studio E in Stoney Creek Ontario. She shares her passion, struggles and inspiring success story.",
            "length": "28467489",
            "sourceUrl": "http://feeds.soundcloud.com/stream/237837220-thefullvoice-teresacirillo.mp3"
        },
        {
            "title": "FVPC # 5  - Hosting Great Student Recitals",
            "datePublished": "Mon, 30 Nov 2015 16:36:25 +0000",
            "description": "A great student recital is about how you make everyone (students and families) feel before, during and after the event.\n\nWhether you are new to recitals, or you have been hosting them for years - We have interesting ideas that will keep families in their seats until the last performance. ",
            "length": "30579018",
            "sourceUrl": "http://feeds.soundcloud.com/stream/235420164-thefullvoice-hostingrecitals.mp3"
        },
        {
            "title": "Interview with Glory St. Germain: Communicating with students and families with NLP",
            "datePublished": "Fri, 20 Nov 2015 17:18:18 +0000",
            "description": "Glory St. Germain is a private piano teacher from Winnipeg Manitoba. She is the  author/publisher of the ULTIMATE MUSIC THEORY SERIES. She is also a Neuro Linguistic Practitioner (NLP). In this podcast she shares how learning to better communicate with students made a incredible impact in her teaching studio and with her successful Online Teacher Certification courses.",
            "length": "32523156",
            "sourceUrl": "http://feeds.soundcloud.com/stream/233950601-thefullvoice-interview-with-glory-st-germain-communicating-with-students-and-families-with-nlp.mp3"
        },
        {
            "title": "FVPC Interview With Linda Saarenvirta, Speech Language Pathologist",
            "datePublished": "Fri, 23 Oct 2015 02:11:00 +0000",
            "description": "In this podcast we speak to Linda Saarenvirta, Speech Language Pathologist at S.L. Hunter Speechworks in Burlington, Ontario, Canada. Linda discusses the clientèle she works with and the voice and speech disorders she works with. She answers questions from professional Voice Teachers and tells us when (and how) to refer our singers to see a SLP. ",
            "length": "40564899",
            "sourceUrl": "http://feeds.soundcloud.com/stream/229668339-thefullvoice-fvpc-interview-with-linda-saarenvirta-speech-language-pathologist.mp3"
        },
        {
            "title": "FVPC #2 - Strategies for Shy Singers",
            "datePublished": "Thu, 10 Sep 2015 14:20:31 +0000",
            "description": "Simple Strategies when working with Shy Singers. Great ideas for Private, Classroom and choral music teachers.\n",
            "length": "34491116",
            "sourceUrl": "http://feeds.soundcloud.com/stream/223228370-thefullvoice-fvpc-2-shy-singers.mp3"
        },
        {
            "title": "FVPC - Interview With Jordan Travis",
            "datePublished": "Wed, 09 Sep 2015 03:00:49 +0000",
            "description": "The Traits of a Great Chorus Member. Full Voice Music Podcast:Interview with Artistic Director of Harbourtown Sound, Jordan Travis. \nHost Nikki Loney speaks with Jordan Travis about what choral directors are REALLY looking for in their Chorus Members.\n\n ",
            "length": "63219332",
            "sourceUrl": "http://feeds.soundcloud.com/stream/223010373-thefullvoice-fvpc-interview-with-jordan-travis.mp3"
        }
    ]
}