{
    "artwork": "http://is2.mzstatic.com/image/thumb/Music71/v4/16/30/63/16306325-4214-7440-3c6a-66faf3be5bad/source/100x100bb.jpg",
    "description": "Evan Davis hosts the business conversation show with people at the top giving insight into what matters",
    "feedURL": "https://podcasts.files.bbci.co.uk/b006sz6t.rss",
    "podcastURL": "http://www.bbc.co.uk/programmes/b006sz6t",
    "title": "The Bottom Line",
    "episodes": [
        {
            "title": "Commercial Property Wars",
            "datePublished": "Thu, 05 Nov 2020 20:30:00 +0000",
            "description": "Commercial landlords and tenants are at odds over unpaid rents due to the pandemic. Many retail, hospitality and leisure businesses are suffering acutely. Most have landlords who collect rent for their premises. In turn, many landlords have to pay interest on their loans to the banks. The pandemic is upsetting that delicate financial balance. It's estimated that billions of pounds is owed to landlords in unpaid rents. Threats of legal action against tenants are hitting the headlines. Just who should take more of the financial hit - commercial landlords or their tenants?\n\nGuests\n\nEdward Ziff, Chair and CEO of Town Centre Securities, a property investment firm\nMark Dixon, CEO of International Workplace Group, which rents, develops and sublets office space\nand Charlotte Heyes, director of the small pub chain, Common and Co",
            "length": "26608000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p08xhkrw.mp3"
        },
        {
            "title": "Bolton Business",
            "datePublished": "Thu, 29 Oct 2020 21:00:00 +0000",
            "description": "How has the pandemic affected commerce in one English town? Bolton's economy has been struck particularly hard by this pandemic.  Not only was it subjected to the national lockdown, but it subsequently became a hotspot, under even tighter restrictions.  With a  town centre that was already in decline, how has this crisis affected local businesses and what does the future hold for the town? Evan Davis and guests discuss. \n\nGUESTS\n\nJonathan Warburton, Chairman, Warburtons\n\nJoseph Carr, Managing Director, Carrs Pasties\n\nMartyn Cox,  Deputy Leader, Bolton Council \n\nReporter:  Matthew Bone\nProducer: Julie Ball",
            "length": "26800000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p08wtz8b.mp3"
        },
        {
            "title": "COVID-19 and the gig economy",
            "datePublished": "Thu, 22 Oct 2020 19:30:00 +0000",
            "description": "Is the pandemic a spur to a world of temps and zero hour contracts? Hundreds of thousands of people have been losing their jobs during the crisis. Many are turning to the gig economy to boost their income. Should we welcome the acceleration of the move away from conventional employment? Evan Davis and guests discuss the pros and cons of the expanding gig economy.  \n\nGuests\n\nXenios Thrasyvoulou, CEO of People Per Hour\nLorna Davidson, CEO of Red Wigwam\nMatthew Taylor,  CEO of the Royal Society of Arts, Manufactures and Commerce\nand Ed Cross, self-employed courier for Hermes",
            "length": "26752000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p08w1vgr.mp3"
        },
        {
            "title": "Cybersecurity",
            "datePublished": "Fri, 16 Oct 2020 09:31:00 +0000",
            "description": "In modern business it's impossible not to be worried about a cyber attack of some form. But how do you lower your chances of attack and what do you do if someone manages to get in your system and data? Evan Davis and guests discuss.\n\nGUESTS\n\nSian John, director, EMEA, cyber security strategy, Microsoft UK\n\nGeoff White, author, 'Crime Dot Com' and investigative technology journalist\n\nJake Davis, consultant, Hacker Culture \n\nNational Centre for Cybersecurity - Cyber Essentials advice for businesses https://www.ncsc.gov.uk/cyberessentials/advice\n\nPresenter: Evan Davis\nProducer: Julie Ball\nEditor: Hugh Levinson",
            "length": "26560000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p08vgghh.mp3"
        },
        {
            "title": "The economy - winter is coming",
            "datePublished": "Thu, 08 Oct 2020 19:30:00 +0000",
            "description": "The second pandemic wave means UK businesses have to live with uncertainty for at least another six months. Those economic green shoots and the summer of 'eat out to help out ' seem a while back.  So what are the implications for jobs and overall business viability in this climate? Difficult conversations are going on in boardrooms across the country.  Evan Davis with expert guests reflect on the choices businesses face in these extraordinary times. \n\nGuests\nNobel economist, Professor Joseph Stiglitz\nWendy Carlin, Professor of Economics at University College London and member of the advisory panel to The Office for Budget Responsibility\nEntrepreneur Paul Campbell, founder of Hill Capital Partner\nHannah Bernard, Head of Business Banking at Barclays",
            "length": "26736000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p08tqbd5.mp3"
        },
        {
            "title": "WPP boss Karen Blackett on obstacles to diversity in the workplace",
            "datePublished": "Thu, 23 Jul 2020 19:30:00 +0000",
            "description": "WPP boss Karen Blackett talks to Evan Davis about building a racially diverse business.",
            "length": "21296000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p08ljylv.mp3"
        },
        {
            "title": "How to build a racially diverse business",
            "datePublished": "Thu, 23 Jul 2020 17:35:00 +0000",
            "description": "The Black Lives Matter protests have prompted boardroom soul-searching about how to engage a more racially diverse workforce. Good intentions have been around for decades and have encouraged much talk about removing biases from mainly white corporate cultures. But this has still not led to the change people want. Hardly any large UK firms have black, Asian or minority ethnic chief executives.  \n\nEvan Davis and guests explore the practical solutions to achieving racial equality at work and the potential benefits to the economy.\n\nGuests \n\nKaren Blackett, OBE, UK head of the ad giant WPP\n\nDr Kamal Munir, reader in strategy and policy at the Judge Business School, University of Cambridge\n\nJudith Hackitt, independent director at HS2 LTD\n \nKike Oniwinde, founder and CEO of The Black Young Professionals Network\n\nProducer: Lesley McAlpine\n\nProduced in association with The Open University",
            "length": "26912000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p08ljxfr.mp3"
        },
        {
            "title": "Transport after the pandemic",
            "datePublished": "Thu, 16 Jul 2020 20:00:00 +0000",
            "description": "Has staying at home during lockdown made us think more about our travel habits? Are you less likely to want to get on a bus or a train to get to work or are you itching to get on the next available flight? And what about the business travel industry? Are companies realising tele-conferencing is now just as acceptable and a cheaper option than a business flight? Evan Davis and guests discuss.\n\nGUESTS\n\nLaura Shoaf, managing director, Transport for West Midlands\n\nSimon Jeffrey, policy officer, Transport and Devolution, Centre for Cities\n\nMichael Valkevich, vice-president, Global Customer Group, EMEA, CWT \n\nPresenter: Evan Davis\n\nProducer: Julie Ball \n\nEditor: Hugh Levinson",
            "length": "26496000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p08kz21v.mp3"
        },
        {
            "title": "How we work now - lessons from lockdown",
            "datePublished": "Thu, 09 Jul 2020 20:00:00 +0000",
            "description": "Zoom meetings and working from home. Two habits which office workers have picked up during the enforced lockdown. But will these behaviours habits stick?\nSome believe that if more of us choose to work from our spare rooms on a regular basis, this will have profound implications for offices, commuting, human interaction and productivity. Evan Davis and guests discuss whether current predictions about the death of the office are over-exaggerated. \n\nGuests \n\nAndré Spicer, Professor of Organisational Behaviour, City's Business School, University of London\nRachel Higham, Managing Director of IT at BT\nKatrina Kostic Samen. Head of Workplace - Strategy and Design, Development. KKS Savills\n\nProduced by Lesley McAlpine\n\nThe programme is produced in association with The Open University",
            "length": "26704000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p08k915r.mp3"
        },
        {
            "title": "Can science save the economy?",
            "datePublished": "Thu, 02 Jul 2020 19:30:00 +0000",
            "description": "Evan Davis and guests ask if now is the time to exploit scientific research more effectively to help business recover from the coronavirus crash.  The UK has traditionally been better at basic science research than its commercial exploitation - with examples ranging from computing to the discovery of graphene, where international companies have benefited more from those discoveries. The Bottom Line examines the government’s idea of creating an agency, similar to the legendary US Defence Advanced Research Projects Agency (DARPA), to invest in, and commercialise UK science and technology projects.  \n\nThe US agency DARPA, was set up to invest in technology after they got behind in the space race with the Russian launch of the Sputnik in the 1950's.  Although the agency's remit is to work on defence projects, several of its discoveries have spawned more commercial uses, most famously the Internet.  \n \nNow the UK government wants to emulate this success for civil applications in the hope of encouraging new business sectors of the economy,  post-Covid 19.  Can it work? Evan Davis and guests discuss.\n \n\n\nGuests:\nMariana Mazzucato, professor in the economics of innovation and public value, University College London\nLuke Georghiu, professor of science and technology management,  Alliance Manchester Business School\nArati Prabhakar, former director, Defence Advanced Research Projects Agency (DARPA)\nNaomi Krieger Carmy, head of Societal Challenges Division, Israel Innovation Authority\nProducer: Julie Ball\nProduced in partnership with The Open University",
            "length": "26672000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p08jn2yx.mp3"
        },
        {
            "title": "Post-pandemic resilience",
            "datePublished": "Thu, 02 Jul 2020 11:30:00 +0000",
            "description": "During the pandemic, businesses have faced severe tests, from supply chain shocks to fluctuations in consumer demand. How resilient are companies in dealing with the unknown? In recent years the focus has been on getting costs down, creating lean supply chains, and delivering returns to shareholders. But has that emphasis left supply chains insecure in the face of shocks? Will companies learn to value resilience over mere efficiency?\n\nGuests\n\nDr Sandra Bell, founder and chief executive of The Business Resilience Company.\nMichael Davies, guest lecturer at the London Business School and founder and chairman of Endeavour Partners\nPoonam Gupta, founder and chief executive of PG Paper\nGuy Gratton, associate professor in aviation and the environment at Cranfield University",
            "length": "26848000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p08hvnbf.mp3"
        },
        {
            "title": "Consumer habits after lockdown",
            "datePublished": "Thu, 18 Jun 2020 19:31:00 +0000",
            "description": "What have you learned about yourself in lockdown? What is it you crave, what have you found you barely miss? Evan Davis and guests contemplate life after lockdown and changing consumer habits. A surge in the sale of bikes, toilet roll panic buying, and flour flying off the supermarket shelves. Will these consumer habits stick? Have we learned to value other things in life than shopping? Or will we just want to borrow and spend at the first possible opportunity?\n\nGuests:\n\nKate Ancketill, founder and CEO, GDR Creative Intelligence\nRichard Walker, managing director, Iceland Foods\nJonathan Cole, managing director, Velorution\nKate Nicholls, chief executive, UK Hospitality\n\nProducer: Lesley McAlpine",
            "length": "26800000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p08h6z16.mp3"
        },
        {
            "title": "China",
            "datePublished": "Thu, 11 Jun 2020 19:31:00 +0000",
            "description": "Will Western economies and companies decouple from China? For decades, the world has relied on this rapidly emerging economy as its factory, producing everything from toilet rolls to iPhones. But post Covid-19, US trade wars and tensions with Hong Kong, is that all about to change? Evan Davis and guests discuss\n\nGUESTS\n\nLiam Casey, CEO and founder, PCH International\n\nDiana Choyleva, chief economist, Enodo Economics\n\nDr. Yu Jie, senior research fellow, China, Chatham House",
            "length": "26688000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p08gnd3w.mp3"
        },
        {
            "title": "Saving Companies",
            "datePublished": "Fri, 05 Jun 2020 15:11:00 +0000",
            "description": "Should the government continue to bolster companies, large and small when lockdown is finally eased?  If so what businesses do you choose to save and what are the criteria?  Evan Davis and guests discuss.\n\nGUESTS\n\nMichael Jacobides, holder of the Sir Donald Gordon Chair of Entrepreneurship and Innovation, London Business School\n\nJulie Palmer,  Regional Managing Partner, Begbies Traynor, Insolvency practitioners\n\nMark Blyth, Director of the William R Rhodes Centre for International Economics and Finance, Brown University\n\nProduced in association with The Open University",
            "length": "26752000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p08g5m11.mp3"
        },
        {
            "title": "Business hype",
            "datePublished": "Thu, 12 Mar 2020 21:01:00 +0000",
            "description": "Can new businesses survive without some form of hype or over-promotion? Or will consumer or investor disillusionment inevitably correct this? One recent example where hype came back to bite a company founder is that of the shared office space provider, WeWork.  Its stock market valuation fell from $50bn to near bankruptcy over the course of a few weeks. \n\nGUESTS\n\nBrent Hoberman, serial entrepreneur and investor, chair and co-founder of Founders Factory and First Minute Capital\nKerry Baldwin, Managing Partner at IQ Capital,a venture capital investment firm\nRory Sutherland, Vice Chair of Ogilvy, the global advertising and marketing agency",
            "length": "26832000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p086ghvp.mp3"
        },
        {
            "title": "Coronavirus and business",
            "datePublished": "Thu, 05 Mar 2020 20:30:00 +0000",
            "description": "How will the infection affect commerce in the UK and around the world? Evan Davis and a panel of guests discuss what's happening to the economy and look at likely scenarios.\nJennifer McKeown, Chief Global Economist, Capital Economics,  \nGloria Guevara, CEO of the World Travel and Tourism Council. \nTim Power, MD of maritime and shipping container research firm Drewry. \n\n\n\nProducers: Lesley McAlpine and Julie Ball\nResearcher: May Cameron",
            "length": "26944000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p085s0gm.mp3"
        },
        {
            "title": "The working week",
            "datePublished": "Thu, 27 Feb 2020 20:55:00 +0000",
            "description": "Is our working week due for major reform? Will a move to a four day week - as proposed by the Labour Party in its recent General Election manifesto - ever happen? From shorter hours to more flexibility in the workplace, what will the modern world of work be like in ten years time? Evan Davis and guests discuss the latest trends. \n\nGuests appearing on The Bottom Line \n\nKate Cooper, Head of Research, Policy & Standards, Institute of Leadership and Management\nDavid Stone, CEO of MRL Recruitment\nand Karen Jansen, Professor in Leadership Challenge at Henley Business School",
            "length": "26784000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p0847hhf.mp3"
        },
        {
            "title": "Couples in Business",
            "datePublished": "Thu, 21 Nov 2019 20:59:00 +0000",
            "description": "What are the pros and cons of running a business with your life partner and how do you keep the personal out of your professional life?  Evan Davis and guests discuss.\n\nGUESTS\n\nSophie Mirman and Richard Ross, founders and owners, Trotters childrenswear and accessories\n\nClaire and Andy Burnet, founders and owners, Chococo artisan chocolatiers\n\nPeter Leach, author and Adjunct Professor in Family Business , Imperial College Business School\n\nProducer: Julie Ball \nEditor: Hugh Levinson",
            "length": "26672000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p07vpw3q.mp3"
        },
        {
            "title": "Dismissing staff",
            "datePublished": "Thu, 14 Nov 2019 20:58:00 +0000",
            "description": "What are the rules when people have to lose their jobs? It's always a difficult situation - which is why it's often handled badly. Evan Davis and guests ask if there is a better way of doing it.\n\nGUESTS\n\nAngela O'Connor, Founder and CEO, The HR Lounge Consultancy\n\nSian Keall, Partner, Employment Law,  Travers Smith LLP\n\nKate Griffiths-Lambeth, Group HR Director, Charles Stanley, Wealth Managers\n\nProducer:  Julie Ball\nEditor: Hugh Levinson",
            "length": "26688000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p07tyd4g.mp3"
        },
        {
            "title": "Business Gurus",
            "datePublished": "Thu, 07 Nov 2019 20:58:00 +0000",
            "description": "Do business gurus really hold the secret to success? Peter Drucker, Michael Porter and Gary Hamel are some of those who've found fame and influence via best-selling business books. But can following their lead transform a company - or are they really just selling themselves? Evan Davis and guests assess the pros and cons of buying from the ideas merchants.\n\nGUESTS\nLynda Gratton, professor of management practice, London Business School, CEO The Hot Spots Movement\nJohn Kay, economist, author and consultant\nEddie Obeng, founder and director of Pentacle\n\nProducer: Julie Ball \nEditor: Hugh Levinson",
            "length": "26736000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p07t99sw.mp3"
        },
        {
            "title": "Managing Conflict",
            "datePublished": "Thu, 31 Oct 2019 20:58:00 +0000",
            "description": "How should businesses deal with workplace quarrels? At a time when the nation seems increasingly divided and hot-tempered, is there a way to bring harmony among staff when there are differences of opinion and personality? Evan Davis and his guests explore what can go wrong and look for some possible solutions. In a very cooperative spirit, naturally.\nGUESTS:\nNaomi Shragai: psychological business consultant and Financial Times contributor \nRoxana Mohammadian-Molina, Chief Strategy Officer, Blend Network\nDavid Liddle, founder and CEO, The TCM Group\n\nProducer: Julie Ball",
            "length": "26928000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p07sncxk.mp3"
        },
        {
            "title": "Insolvency",
            "datePublished": "Thu, 24 Oct 2019 19:59:00 +0000",
            "description": "The number of companies in 'financial distress' in the UK is on the rise. What's causing the problems and what exactly happens when a company goes into administration? Evan Davis and guests discuss.\n\nGuests:\n\nJulie Palmer, Insolvency practitioner, Begbies Traynor\n\nAndy Scott, Chairman, REL Capital\n\nDr Rebecca Parry, Director, Centre for Business and Insolvency, Nottingham Trent University\n\nProducer: Julie Ball",
            "length": "26816000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p07rz125.mp3"
        },
        {
            "title": "Plant-based foods",
            "datePublished": "Thu, 17 Oct 2019 19:58:00 +0000",
            "description": "How can business benefit from the popularity of vegetarian and vegan products in supermarkets and restaurants?  One in eight of us identifies as vegetarian or vegan, but that's not enough to have boosted the market so significantly. So what is happening and is it sustainable?  Evan Davis and guests discuss.\n\nGUESTS\n\nKevin Brennan,  CEO Quorn \n\nTommaso Chiabra, venture capitalist and CEO Tommaso Chiabra Holdings\n\nRachel Hugh, Co-founder, The  Vurger Company\n\nProducer: Julie Ball",
            "length": "26592000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p07r8q4p.mp3"
        },
        {
            "title": "Cryptocurrencies",
            "datePublished": "Thu, 10 Oct 2019 19:59:00 +0000",
            "description": "Will Facebook's launch of its own cryptocurrency be a game changer?  What will this mean for established currencies and the global banking system? Evan Davis and guests discuss.\n\nGUESTS\n\nJutta Steiner,  Chief Executive Officer, Parity Technologies\n\nDr. Catherine Mulligan, Chief Technology Officer of Gov Tech Labs and Data Net at University College, London \n\nBarbara Mellish, Chief Executive Officer, Centre for Citizenship, Enterprise and Government\n\nPresenter: Evan Davis\n\nProducer: Julie Ball",
            "length": "26928000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p07qnx9r.mp3"
        },
        {
            "title": "The Future of Commercial Aviation",
            "datePublished": "Thu, 25 Jul 2019 19:58:00 +0000",
            "description": "How can the aviation industry marry sustainability with increasing passenger numbers? Since the deregulation of Europe's airlines in the late 1990s, more and more of us have been flying every year.  Whilst this may be good news for the airline industry, it's not good news for the environment.  Manufacturers are trying to make models lighter and more fuel efficient, with a pledge by IATA to cut emissions to 50% by 2050. Nevertheless, experts say we are at least fifteen years away from hybrid engine powered flight. Evan Davis and guests ask whether commercial aviation can meet its climate targets through new technology and more fuel efficient engines, whilst keeping costs down for the airlines and the customer?\n\nGUESTS\n\nPaul Kahn, president, Connectivity, Cobham Plc\n\nVolodymyr Bilotkach, economist, author of  The Economics of Airlines\n\nRob Morris, head of Global Consultancy, Ascend by Cirium\n\nPresenter: Evan Davis\n\nProducer:  Julie Ball\n\nEditor: Hugh Levinson",
            "length": "26800000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p07hsn58.mp3"
        },
        {
            "title": "Lessons of Theranos",
            "datePublished": "Thu, 18 Jul 2019 19:59:00 +0000",
            "description": "What can we learn from how one medical start-up fooled Silicon Valley and the world? Elizabeth Holmes dropped out of Stanford University at 19 to start Theranos. She promised investors and the public a revolutionary blood diagnosis machine which would be less painful, accessible and affordable than ordinary lab tests. She managed to raise $9 billion in funding.  Now the company is worth nothing. Holmes and her business partner may face up to 20 years in prison for fraud.  How did she manage to deceive some of the world's cleverest minds - and is there something about start-up culture and the cult of the visionary leader which encourages charlatans?  Evan Davis and guests discuss. \n\nGUESTS\nRebecca Jarvis, chief business, economics and technology correspondent, ABC News\nMargaret Heffernan, author and entrepreneur\nJos White, entrepreneur and partner,  Notion Capital\n\nProducer: Julie Ball",
            "length": "26800000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p07h6smx.mp3"
        },
        {
            "title": "The investment industry - luck or judgement?",
            "datePublished": "Thu, 11 Jul 2019 19:58:00 +0000",
            "description": "You trust financial professionals to grow your long term savings and pension pot.  But how do you know if they are investing it wisely? The UK investment industry is awash with complicated terms and conditions, and unclear and sometimes high charges, which can eat into your monetary returns. The woes of star fund manager Neil Woodford, who has temporarily frozen one of his funds to its investors after poor performance, highlights just how complicated an industry it is. Is some clarity starting to emerge? Evan Davis and expert guests look under the bonnet of the UK investment industry.\n\nGuests: \n\nJames Anderson, partner at Baillie Gifford, who jointly manage the Scottish Mortgage Investment Trust\nBella Caridade Ferreira, chief executive and founder of Fundscape\nSean Hagerty, managing director of Vanguard Europe\n\nProducer: Lesley McAlpine",
            "length": "26720000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p07gm36k.mp3"
        },
        {
            "title": "The discounters",
            "datePublished": "Thu, 04 Jul 2019 20:00:00 +0000",
            "description": "Poundland, Lidl, B&M Bargains and Primark are thriving successes on the High Street, while more mainstream retailers have seen their profits hit. Just how do the discounters keep their prices so low? Keeping the business model simple, supply chains lean and costs down are key parts of the story.\n\nGuests:\nBarry Williams, Managing Director of Poundland\nSimon Arora, Chief Executive, B&M Bargains\nCatherine Shuttleworth, Chief Executive of Savvy Marketing",
            "length": "26816000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p07g0gtt.mp3"
        },
        {
            "title": "Pivoting",
            "datePublished": "Thu, 27 Jun 2019 19:59:00 +0000",
            "description": "Can a sudden change in direction save a new company? Evan Davis and his guests hear stories about the start-up's nightmare:  the original product is not selling, and cash is running out.  Can changing focus - with a new service or product - pluck success from the jaws of doom? Speaking to entrepreneurs and experts, he learns about how in a range of sectors, from sanitary products to event ticketing, the key is to shift while staying true to the original vision. \nGuests:\nCelia Pool, cofounder DAME\nEdmund Glover and Nick Stone, FIXR\nRamdane Mir, cofounder Cobbleweb",
            "length": "26800000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p07fc1dw.mp3"
        },
        {
            "title": "Commerce and Crime",
            "datePublished": "Thu, 20 Jun 2019 19:59:00 +0000",
            "description": "From Somali pirates who've turned kidnapping into a global enterprise to cybercrime and fraud  - the worlds of business and wrongdoing potentially have much in common. Clever criminals build business empires and fraud is sometimes carried out by well paid workers at legitimate companies. What the two worlds can have in common is a pursuit of profit and a series of apparently rational calculations.  Evan Davis and guests explore why some bright, talented people try to get rich the wrong way, while others manage to do it within the rules.\n\nGuests\n\nBarrister, Sara George, a partner at Sidley Austin LLP\nMichael Corrigan, Chief Executive at Prosper 4 - a training and recruitment firm for former prisoners\nand Dr Anja Shortland, Reader in Political Economy at King's College, London.",
            "length": "26784000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p07dp7lb.mp3"
        },
        {
            "title": "The Fitness Industry",
            "datePublished": "Thu, 13 Jun 2019 19:58:00 +0000",
            "description": "Who wins and loses in the cut-throat exercise market? Looking good and being fit has become more important as we have become more wealthy. Yet most new gyms and fitness centres fail. Evan Davis and his guests work out the secrets of success in this growing industry, which is is worth over £5 billion in the UK.\n\nGUESTS\n\nStuart Broster, CEO, Anytime Fitness UK\n\nTommy Matthews, Managing Director,  Be Military Fit\n\nDawn Tuckwell,,  Director and Co-founder, Action PR\n\nPRESENTER: Evan Davis\n\nPRODUCER: Julie Ball",
            "length": "26832000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p07gdyhx.mp3"
        },
        {
            "title": "The Last Mile",
            "datePublished": "Thu, 06 Jun 2019 19:58:00 +0000",
            "description": "The package brought to your door may have crossed the globe - but the most expensive and fiddly bit of the journey will undoubtedly be what's known as 'the last mile'. Delivery firms are constantly innovating how they do this - using electric vehicles and e cargo bikes, robots, or offering customers a click and collect option at a local store of their choice. Consumers take it for granted that they will get free delivery in many cases.  But is the whole 'last mile' industry sustainable? Delivery vans add to traffic congestion and consumers are ordering more than they need and returning unwanted goods for free.  \n\nEvan Davis and guests discuss the latest trends in the logistical puzzle of 'the last mile.'  \n\nGuests\n\nJon Ormond Operations Director of Hubs and Depots at parcel carrier, Hermes. \nNick Hale, Managing Director of BT Ventures. \nand Catherine Weetman, founder of Re-think solutions.",
            "length": "26976000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p07gds1t.mp3"
        },
        {
            "title": "Anti-Biotic Resistance",
            "datePublished": "Sat, 01 Jun 2019 16:56:00 +0000",
            "description": "Antibiotic resistance is a global problem but there have been no new drugs produced since the 1980s. So who is to blame? The public's over-consumption or the current economic model for drug research and production? Evan Davis and guests discuss.\n\nGUESTS\n\nSeema Patel, Medical Director, Hospital Business, Pfizer, UK, Ireland and the Nordics\n\nLord Jim O'Neill, Chair Anti-Microbial Resistance Review (2016), Former Chief Economist, Goldman Sachs\n\nProfessor Colin Garner, Co Founder and Director, Antibiotic Research UK",
            "length": "27728000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p07bn8h9.mp3"
        },
        {
            "title": "Planning for uncertainty",
            "datePublished": "Thu, 28 Mar 2019 21:00:00 +0000",
            "description": "Every business faces uncertainty.  In the final programme of the series Evan Davis and guests ask what businesses should do when faced with uncertainty.\n\nGuests: \nJeremy Bentham, Head of Scenarios, Shell\nNick Allan, CEO, Control Risks\nDr Sandra Bell, Head of Resilience Consulting, Sungard Availability Services",
            "length": "26752000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p074vssk.mp3"
        },
        {
            "title": "Feedback frenzy",
            "datePublished": "Thu, 21 Mar 2019 21:00:00 +0000",
            "description": "It's hard to buy anything these days without being asked to rate or review it.  Evan Davis and guests look at how have businesses such as Tripadvisor, Feefo and Checkatrade have altered the relationship between companies and consumers?  Do you trust the wisdom of crowds more than an expert's view? \n \nGuests\nMatt West, Chief Executive of Feefo\nRob Paterson, Chief Executive of Best Western Hotels GB\nCaroline Wiertz, Professor of Marketing and Associate Dean for Entrepreneurship at the Cass Business School in LOndon",
            "length": "27056000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p07470h4.mp3"
        },
        {
            "title": "Internships",
            "datePublished": "Thu, 14 Mar 2019 21:00:00 +0000",
            "description": "For many graduates an internship has become the default route to full-time, paid employment. But getting a good placement is competitive and in some cases poorly paid or unpaid. What does this mean for social mobility and diversity in the workplace? Evan Davis and guests discuss the pros and cons of internships.\n\nGUESTS\n\nSarah Churchman, UK Head of Inclusion, Diversity and Wellbeing, PwC\nAmalia Illgner , Freelance journalist and a former intern\nOliver Sidwell, Co-founder, Rate My Placement",
            "length": "26704000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p073kkb9.mp3"
        },
        {
            "title": "The personalisation revolution",
            "datePublished": "Thu, 07 Mar 2019 21:00:00 +0000",
            "description": "Technological advances have made it easier for businesses to offer us more personalised goods and services, from customised cars to clothes that fit better and pioneering cell and gene therapies to target serious illnesses. How far can this personalisation revolution go? \n\nGUESTS\n\nDarrin Disley, Chief Executive of cell therapy company, Mogrify\nGeorgina Silvester, Chief Operating Officer (designate), Handelsbanken UK\nKarl Howkins, Managing Director, Citroen UK\nKate Ancketill, Chief Executive of GDR Creative Intelligence",
            "length": "27072000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p072wcqr.mp3"
        },
        {
            "title": "Magazines",
            "datePublished": "Thu, 28 Feb 2019 21:00:00 +0000",
            "description": "There are more than two-and-a-half thousand consumer and business magazine titles on sale in the UK.  What is the appeal of magazines and how does the business endure in spite of falling advertising revenues and declining circulation figures? \n\nGUESTS\n\nWolfgang Blau, President, Conde Nast International\n\nTerri White, Editor-in-Chief, Empire Magazine\n\nRebecca McGrath, Senior Analyst, Media,  Mintel",
            "length": "26544000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p07276mg.mp3"
        },
        {
            "title": "Are auditors fit for purpose?",
            "datePublished": "Thu, 21 Feb 2019 21:00:00 +0000",
            "description": "What's the point of an audit if it fails to detect when a company's about to go under? The sudden collapse of BHS, Carillion and Patisserie Valerie has dented public confidence in the firms that audited them and prompted calls for a shake-up of the audit industry. Would more competition in the sector, which is dominated by four big players, drive audit quality up? Do accountants need to be more robust in challenging company figures? \n\nJoining Evan Davis for The Bottom Line:\n\nBill Michael, UK Chairman and Senior Partner at KPMG.\nJac Berry, Audit Partner and UK Head of Quality at Mazars\nand Christopher Humphrey, Professor of Accounting at the Alliance Manchester Business School",
            "length": "26944000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p071lpkf.mp3"
        },
        {
            "title": "Behavioural science in the workplace",
            "datePublished": "Thu, 14 Feb 2019 21:00:00 +0000",
            "description": "Understanding how humans think and what makes them tick can be enormously helpful if you're running a company.  Luckily behavioural science is on hand to do just that.  How far can its use improve decision making in businesses? \n\nJoining Evan Davis are:\n\nOctavius Black, CEO and Co-founder of MindGym \nDavid Halpern, CEO, The Behavioural Insights Team\nKim Atherton, Chief People Officer, Ovo Energy and CEO and Founder of Just3Things",
            "length": "27056000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p070s6n6.mp3"
        },
        {
            "title": "University Businesses",
            "datePublished": "Thu, 07 Feb 2019 21:00:00 +0000",
            "description": "Higher education in the UK is an astonishingly successful British industry, with an income of almost £35 billion a year. Universities have expanded hugely with more students from home and abroad. But uncertain times lie ahead.  Tuition fees are under review and some people in the sector argue Brexit may make it harder to attract students from EU countries.  Are universities sustainable as businesses?\n\nGuests: \nProfessor Nick Petford, Vice-Chancellor of the University of Northampton\nProfessor Trevor McMillan Vice-Chancellor of Keele University\nDr Helen Carasso, Department of Education, Oxford University",
            "length": "26784000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p0704pt0.mp3"
        },
        {
            "title": "The Internet of Things",
            "datePublished": "Thu, 31 Jan 2019 21:00:00 +0000",
            "description": "The Internet of Things promised to revolutionise the way we live and work but what has it delivered and what more is it capable of doing?  Join Evan Davis and guests as they discuss The Internet of Things.\n\nGUESTS\n\nKevin Ashton,  Author who coined the phrase the Internet of Things\n\nCaroline Gorski, Global Director of R2 Data Labs, Rolls Royce Plc\n\nPaul Beastall, Head of Strategy,  Cambridge Consultants",
            "length": "26944000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p06zlhsy.mp3"
        },
        {
            "title": "Business in the era of #MeToo",
            "datePublished": "Thu, 22 Nov 2018 21:00:00 +0000",
            "description": "Has the #MeToo movement made businesses change the way they deal with sexual harassment and gender equality claims in the workplace? Does the law around non-disclosure agreements - often used to hush up this kind of behaviour - need to be changed?   Evan Davis and guests discuss.\nGUESTS\n\nSamantha Mangwana, Employment Lawyer, Partner,  CM Murray \n\nZelda Perkins, Campaigner and Theatrical Producer\n\nOctavius Black, CEO and Co-founder, TheMindGym",
            "length": "27008000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p06skjg3.mp3"
        },
        {
            "title": "Super-premium drinks",
            "datePublished": "Thu, 15 Nov 2018 21:00:00 +0000",
            "description": "There has been an explosion in the number of craft ale breweries and small-scale gin distilleries in recent years.  The so-called super premium alcohol sector is growing.  Why are these drinks popular among consumers? Is this a passing fad or is the drinks business facing fundamental change?  Evan Davis and guests discuss.  \n\nGuests:\n\nTina Warner-Keogh, partner and co-owner of Warner Edwards Gin Distillery\nLaura Edwards, general manager at Meantime Brewing Company\nand Andrew Geoghegan, global consumer planning director at Diageo",
            "length": "26848000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p06rvx9v.mp3"
        },
        {
            "title": "The Experience Economy",
            "datePublished": "Thu, 01 Nov 2018 21:00:00 +0000",
            "description": "There is some evidence to suggest we are falling out of love with buying material things.  Instead, we want to splash out creating memories that last a lifetime.  What does the growth of what's known as the experience economy mean for businesses?  Evan Davis and guests discuss.  \n\nGuests\n\nTristram Mayhew, Group Chairman, Go Ape!\nMyf Ryan, Chief marketing officer Europe, Unibail-Rodamco-Westfield\nNick Johnson, Founder and co-Director, Market Operations",
            "length": "26960000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p06qj22m.mp3"
        },
        {
            "title": "Plastics",
            "datePublished": "Thu, 25 Oct 2018 20:00:00 +0000",
            "description": "Plastic is arguably one of the world's greatest inventions.  Its' qualities allow it to be used in everything from food packaging to clothes and cars.  But discarded plastic clogs up our rivers and oceans threatening marine life creating a consumer backlash.  So what can the industry do to restore its reputation and how?  Evan Davis and guests discuss.\n\nGUESTS\n\nLubna Edwards, Global Sustainability Director, Klockner Pentaplast\n\nRoger Baynham, Managing Director, Philip Tyler Polymers and Chair of the Recycling Group, British Plastics Federation\n\nAdrian Griffiths,  CEO and Founder, Recycling Technologies.",
            "length": "27136000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p06pv1xy.mp3"
        },
        {
            "title": "Shortages",
            "datePublished": "Thu, 18 Oct 2018 20:00:00 +0000",
            "description": "No supply chain is immune from disruption and shocks.  From extreme weather to strikes and cyber crime, what causes a supply chain to fail? Join Evan Davis and guests.\n\nGuests\n\nTim O'Malley, Managing Director of Nationwide Produce\nRichard Oldroyd, Regional Managing Director of Persimmon Homes\nLiam Fassam, Associate Professor of Supply Chain Geography and Research Director at the University of Northampton",
            "length": "26608000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p06p6knl.mp3"
        },
        {
            "title": "Rewriting the rules of Business",
            "datePublished": "Thu, 04 Oct 2018 19:30:00 +0000",
            "description": "Business has undergone seismic changes over the past decade; do the rules of business need to be re-written? If so, who should write them and what should they say? \nEvan Davis and guests discuss. \n \nGUESTS\nIan Taylor, Chairman, Vitol\nDame Helena Morrissey, Head of Personal Investing, Legal & General Investment Management\nWendy Tan White,  Partner, BGF Ventures",
            "length": "26960000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p06myn87.mp3"
        },
        {
            "title": "The Festival Business",
            "datePublished": "Thu, 26 Jul 2018 20:00:00 +0000",
            "description": "There are thousands of festivals in the UK each year and millions of us go to them. But as an organiser how do you make any money? Do logistics and the British weather make them a risky business? Every year festivals get cancelled and some cease trading. Profit margins are tight, say organisers, and set-up costs are high. A big festival may have to pay more a million pounds to secure a top headline act. \n\nEvan Davis and guests discuss mud, music and hard cash. \n\nGuests:\nSyima Aslam, co-founder and director of the Bradford Literature Festival\nIan Stockley, chief executive of the Bath Festivals.\nSimon Taffe, co-founder of the End of The Road Festival.",
            "length": "26752000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p06fs7nr.mp3"
        },
        {
            "title": "Advertising",
            "datePublished": "Thu, 19 Jul 2018 20:00:00 +0000",
            "description": "The UK has been a global leader in the Advertising Industry since the end of the last century. But like many businesses it's now facing disruption from technology. Pop up banners on the internet and social influencers are cheaper and more immediate. Evan Davis and guests discuss whether a data driven approach to advertising will eventually kill creativity. \n\nGUESTS\n\nSir John Hegarty, Co-Founder BBH \n\nRohan Midha, Managing Director, PMYB\n\nRory Sutherland, Vice-chairman, Ogilvy \n\nProducer: Julie Ball.",
            "length": "27056000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p06f5tbn.mp3"
        },
        {
            "title": "How does the commodities business work?",
            "datePublished": "Thu, 12 Jul 2018 20:00:00 +0000",
            "description": "Commodities are the raw materials which oil the wheels of the modern economy. From minerals to crude oil to coffee, Evan Davis and guests look at how the business of buying and selling commodities works and why it matters to all of us. \n\nGUESTS\n\nAndrew Gowers, Global Head of Corporate Affairs, Trafigura\n\nJean-Francois Lambert, Founder, Lambert Commodities\n\nColin Hamilton, MD Commodities Research, BMO Capital Markets.",
            "length": "26544000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p06dkyx6.mp3"
        },
        {
            "title": "Why do companies do bad things?",
            "datePublished": "Thu, 05 Jul 2018 20:00:00 +0000",
            "description": "Social media giants mishandle data, banks mis-sell PPI insurance, engineers arrange for cars to cheat emissions tests. Why do companies sometimes do bad things? Evan Davis and guests discuss whether it's by accident or deliberate. Coverage of business wrongdoing often focuses on bad individuals but how far can a company's culture be blamed? \nGuests:\nNick Leeson, the original 'rogue trader' \nSara George, Partner, Stephenson Harwood\nAdrian Furnham, Professor of Psychology, Norwegian Business School.",
            "length": "26896000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p06cxqhc.mp3"
        },
        {
            "title": "Should CEOs have term limits?",
            "datePublished": "Thu, 28 Jun 2018 20:00:00 +0000",
            "description": "In some countries politicians have fixed term limits. What would happen if the same principle applied to CEOs? On average bosses in the UK stay for just under six years. But founder chief executives stay much longer. Evan Davis and guests discuss whether chief executives know when their time is up? \n\nGuests:\n\nMartin Gilbert, co-ceo, Aberdeen Standard Investments.\nMargaret Heffernan, author and entrepreneur\nCatherine Bright, a leadership consultant with Spencer Stuart.",
            "length": "26800000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p06c9747.mp3"
        },
        {
            "title": "Franchising",
            "datePublished": "Thu, 21 Jun 2018 20:00:00 +0000",
            "description": "Is becoming a franchisee a good way to start your own business? Evan Davis and guests discuss the ups and downs of franchising. \n\nGUESTS\n\nKen Deary, Franchisor Right at Home\n\nRachana Pancholi, Franchisee, Subway\n\nRoz Goldstein Goldstein Legal\n\nProducer: Julie Ball.",
            "length": "27072000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p06bqtl7.mp3"
        },
        {
            "title": "Is any company ever invulnerable?",
            "datePublished": "Thu, 14 Jun 2018 20:00:00 +0000",
            "description": "Facebook, Apple, Google, or Amazon. Dominant companies that today look unassailable. But similar claims were made about MySpace, Tesco, Microsoft, Kodak and Polaroid. However, these companies turned out to be more vulnerable than anyone thought. Evan Davis and guests discuss invulnerability, complacency and hubris in corporations. \n\nGuests:\n\nSean Percival, entrepreneur and former Vice President for Online Marketing at MySpace\nDr Kamal Munir, Reader in Strategy and Policy at the Judge Business School, University Of Cambridge\nMartin Franklin, Head of Global Marketing at Polaroid Originals.",
            "length": "27040000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p06b1m1c.mp3"
        },
        {
            "title": "Co-working Spaces",
            "datePublished": "Fri, 08 Jun 2018 17:23:00 +0000",
            "description": "Evan Davis hosts the business conversation show.",
            "length": "26688000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p069jwpk.mp3"
        },
        {
            "title": "Will 5G revolutionise our lives?",
            "datePublished": "Fri, 08 Jun 2018 15:51:00 +0000",
            "description": "The next generation of mobile technology - 5G - will be rolled out from 2019. It will enable faster streaming on our mobile phones and tablets and speed up the 'internet of things', allowing thousands of computers to 'talk' to each other. The fifth generation mobile network also has applications that could be used in public safety and healthcare. But will the UK build the infrastructure - installing more fibre and small communications masts - to benefit from this new technology? Joining Evan Davis for the debate will be:\n\nDerek McManus, Chief Operating Officer at Telefonica UK, which owns O2.\nProfessor Dimitra Simeonidu, Director of the Smart Lab at Bristol University\nand Kyle Brown, Head of Technology at Samsung Electronics.",
            "length": "22624000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p069jk6j.mp3"
        },
        {
            "title": "Teenage Business Entrepreneurs",
            "datePublished": "Tue, 10 Apr 2018 10:21:00 +0000",
            "description": "As children few of us have had experience of running a business. But this week we'll be hearing from four teenage entrepreneurs who have been honing their business skills in one case, since the age of 6. Evan Davis hears their stories.\n\nGUESTS\n\nKate and Annie Madden, Co-founders, FenuHealth\n\nHenry Patterson, Founder and Director, Not Before Tea \n\nRebecca Patterson, Not Before Tea\n\nAkshay Ruparelia, Founder and CEO, Doorsteps.co.uk.",
            "length": "27024000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p063vbjc.mp3"
        },
        {
            "title": "The EU after Brexit – A special programme together with The Briefing Room",
            "datePublished": "Thu, 29 Mar 2018 20:00:00 +0000",
            "description": "Radio 4’s Bottom Line and Briefing Room will combine in a special hour-long programme examining the economic and political future of the EU once Britain has left. Evan Davis meets Jean-Claude Trichet – former president of the European Central Bank – and is joined by a panel of business leaders from across the EU. David Aaronovitch will look at the politics of the EU and its future direction. France’s President Macron has outlined a vision of a profoundly transformed and more unified EU. But do all the EU’s members support such a vision? And what might a more integrated bloc on its doorstep mean for Britain?\n\nProducers: Tim Mansel, Serena Tarling and Lesley McAlpine",
            "length": "53056000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p062rp1c.mp3"
        },
        {
            "title": "Do corporate headquarters still matter?",
            "datePublished": "Thu, 15 Mar 2018 21:00:00 +0000",
            "description": "The tech giant Apple has just spent five billion dollars building a campus in California's Silicon Valley. It's not alone in its architectural ambitions. The new Facebook HQ in London features trees, grass and plants. So what does a corporate headquarters tell us about a business? Is it an opportunity for a company to show off its wealth and attract the best talent or is it folly? Evan Davis and guests explore what the latest trends in corporate architecture reveal about our business leaders.\n\nGuests:\nKen Shuttlewoth, founder of Make Architects\nHelen Berresford, head of interior design at Sheppard Robson Architects\nand Deyan Sudjic, director of the Design Museum.",
            "length": "27024000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p0617t5n.mp3"
        },
        {
            "title": "Is strategy necessary for success?",
            "datePublished": "Fri, 09 Mar 2018 19:10:00 +0000",
            "description": "What is strategy and why do businesses need it? What distinguishes a good strategy from a bad one or a non-strategy? Not to be confused with goals or a company's ambition, strategy is a word that is often mis-used and misapplied. But in reality it can make the difference between success and failure - especially if it's adaptable to changes in the market. Evan Davis looks at where companies have got strategy right and where it's gone badly wrong.\n\nGUESTS:\n\nMichael Jacobides - Associate Professor of Strategy and Entrepreneurship at The London Business School.\n\nJacqueline de Rojas, President of Tech UK\n\nAnn Cairns, President of International Markets, MasterCard.",
            "length": "26928000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p060nh83.mp3"
        },
        {
            "title": "The Ethics of Business",
            "datePublished": "Thu, 01 Mar 2018 21:00:00 +0000",
            "description": "Are 'ethical' businesses all they're cracked up to be? Evan Davis and guests discuss the newest type of certification in ethical business, the B Corp, and ask if it'll catch on. \n\nGUESTS\n\nKatie Hill, Executive Director, B Lab UK\n\nWendy Chapple, Associate Professor in Management and member of the Responsible and Sustainable Business Lab, Nottingham Business School\n\nJean-Cristophe Laugee, Vice-President, Nature and Cycle Sustainability, Danone.",
            "length": "26976000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p05zp03y.mp3"
        },
        {
            "title": "Who Owns British Companies?",
            "datePublished": "Fri, 23 Feb 2018 18:38:00 +0000",
            "description": "What has happened to Margaret Thatcher's dream of creating a nation of shareholders? Over the last decade there's been a big increase in the amount of foreign ownership. ONS figures show foreign investors now own over fifty per cent of shares listed on the stock exchange. Evan Davis and guests discuss why this has happened and whether it matters. \n\nGUESTS\n\nJohn Dawson, Founding Partner, Statera\n\nGillian Karran-Cumberlege, Founder, Fidelio Partners\n\nGervais Williams, Fund Manager, Miton Group.",
            "length": "26720000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p05z5d7l.mp3"
        },
        {
            "title": "Turning Tables",
            "datePublished": "Thu, 15 Feb 2018 21:00:00 +0000",
            "description": "Evan Davis and guests discuss why some restaurant chains thrive and others fail. Why are so many chains closing down branches now? \n\nGUESTS\n\nPaul Campbell, Founder, Hill Capital Partners LLP\n\nAngela Hartnett, Chef and Owner of Murano, Café Murano and Merchants' Tavern\n\nSarah Willingham, Entrepreneur and Investor.",
            "length": "26992000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p05ypghx.mp3"
        },
        {
            "title": "The Shock of the New",
            "datePublished": "Fri, 09 Feb 2018 19:28:00 +0000",
            "description": "Evan Davis and guests discuss the relationship between three important pillars of modern society: science, business and the consumer. Is the public right to be suspicious of business and the science it's selling? Why do some us fear GM foods, nanotechnology, AI and gene editing? \n\nGUESTS\n\nJackie Hunter, Chief Executive, Benevolent Bio\n\nJustin King, Vice-Chairman and Head of Portfolio Businesses, Terra Firma\n\nKriti Sharma, Vice-President of Artificial Intelligence, Sage.",
            "length": "26720000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p05xp2v2.mp3"
        },
        {
            "title": "How to Build a Bridge",
            "datePublished": "Fri, 02 Feb 2018 20:10:00 +0000",
            "description": "Civil engineers would argue they are the unsung heroes of the railways, roads and bridges we all take for granted. But building major infrastructure projects is a complicated business. So how do you go about putting up a bridge? Are you limited by engineering or economics? Evan Davis tries to find the answer from three civil engineers. \n\nGUESTS\n\nMike Glover, Arup Fellow\n\nLouise Hardy, Civil Engineer, Non-Executive Director Sirius Minerals and Ebbsfleet Development Corporation\n\nKaty Toms, Senior Engineer, WSP Engineering Consultancy.",
            "length": "26640000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p05wy5x6.mp3"
        },
        {
            "title": "Sir Terry Leahy",
            "datePublished": "Thu, 23 Nov 2017 21:00:00 +0000",
            "description": "In the final programme of the current series Evan Davis will be talking to Sir Terry Leahy, former Tesco CEO, in front of an invited audience at Sir Terry's old school, St. Edward's College, Liverpool.",
            "length": "26624000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p05p093y.mp3"
        },
        {
            "title": "Department Stores",
            "datePublished": "Thu, 16 Nov 2017 21:00:00 +0000",
            "description": "Are you being served? Where do you shop - online, a department store or one of the large shopping centres around the country? Evan Davis looks at the competitive business of running a mixed retail outlet, or department store, and asks can they survive?\n\nGUESTS\n\nTony Brown, CEO, Beales Department Stores\n\nStacey Cartwright, CEO, Harvey Nichols,\n\nDavid Fischel, CEO, INTU Shopping Centres.",
            "length": "26896000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p05n534d.mp3"
        },
        {
            "title": "Foreign Investment in the UK",
            "datePublished": "Fri, 10 Nov 2017 17:21:00 +0000",
            "description": "What makes the UK an attractive place for foreign companies to invest in? Britain has tended to enjoy high levels of inward investment thanks to its open economy. How might this change when the UK leaves the EU? \nEvan Davis and guests explore the topic. \n\nJoining Evan Davis are:\nIan Robertson, Global Head of BMW sales and marketing\nVera Wei, Chief Executive of Sloan Education\nDavid Landsman, Executive Director of Tata Limited.",
            "length": "27232000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p05mplx0.mp3"
        },
        {
            "title": "Pets Mean Pounds",
            "datePublished": "Thu, 09 Nov 2017 21:00:00 +0000",
            "description": "In the UK we spend £4.5 billion a year on domestic pets. Where does the money go? Evan Davis and guests discuss the business of keeping pets. \n\nGUESTS\nLynne Hill, Chief Executive of Linnaeus Group of veterinary practices\nDean Richmond, Managing Director of retailing chain, Pets Corner\nAshley Gray, Managing Director of Vetsure Pet Insurance.",
            "length": "27344000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p05mnmcx.mp3"
        },
        {
            "title": "Agents",
            "datePublished": "Thu, 26 Oct 2017 20:00:00 +0000",
            "description": "This week the programme looks at the business of agents. What exactly do they do and are they adding value to their clients' careers? Evan Davis discusses their role with three agents from the worlds of show business, football and books. \n\nGUESTS\n\nProfessor Jonathan Shalit, Chairman,  InterTalent Rights Group\n\nAnna Davis, Literary Agent. Founder and Creator of Curtis Brown Creative Writing course. Curtis Brown Group\n\nJames Featherstone, Founder and Owner, OmniSports \n\nProducer: Julie Ball.",
            "length": "27280000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p05kym14.mp3"
        },
        {
            "title": "Is there a business case for having a diverse workforce?",
            "datePublished": "Fri, 20 Oct 2017 16:15:00 +0000",
            "description": "What is the business case for having a diverse workforce? Evan Davis and guests debate whether a mix of talents in the workplace leads to better companies and translates into more profits. \n\nJoining the programme:\nRuby McGregor-Smith, former Chief Executive of MITIE, and author of a government commissioned review: Race in the Workplace. \nJane Farrell, group Chief Executive of Equality Works\nScott Page, author of The Diversity Bonus.",
            "length": "22624000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p05khn59.mp3"
        },
        {
            "title": "Shake-up in the skies",
            "datePublished": "Thu, 12 Oct 2017 20:00:00 +0000",
            "description": "What's behind the recent collapse of airlines such as Monarch, Alitalia and Air Berlin? Is it a case of supply outstripping demand or is there a larger crisis \nlooming? Will Ryanair's cancellation of thousands of flights do the company permanent damage? \n\nWhat's really happening to Europe's airline industry? \nEvan Davis and guests discuss.\n\nGUESTS\n\nJohn Strickland, Aviation consultant\n\nPeter Duffy, Chief Commercial Officer, EasyJet\n\nAnd\n\nRoger Flynn, Chairman, Loveholidays.com.",
            "length": "26928000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p05jqq3k.mp3"
        },
        {
            "title": "Batteries",
            "datePublished": "Thu, 05 Oct 2017 19:30:00 +0000",
            "description": "Is battery technology the key to decarbonising energy and reinventing transport? If so, can the current technology, Lithium-Ion batteries, evolve quickly enough to meet growing demand. If capacity is the problem, is Lithium-ion the answer and what are the alternatives? Can we expect to fly in battery powered aeroplanes in the near future? \n\nJoin Evan Davis and his guests as they discuss the future of the power of batteries.\n\nGUESTS\n\nHuw Hampson-Jones, CEO Oxis Energy\n\nCyrille Brisson, Vice-President, Eaton \n\nChris Morrison, Head of Peaking Plant, Centrica.",
            "length": "26896000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p05kq0fr.mp3"
        },
        {
            "title": "There's no business like show business",
            "datePublished": "Thu, 27 Jul 2017 20:00:00 +0000",
            "description": "There's no business like show business. Evans Davis and guests explore the success story that is UK theatre. From splashy musicals, and classic revivals to cutting edge new dramas the sector makes more than a billion pounds in ticket sales a year. But there's trouble on the horizon. Public subsidies for theatres are being cut back. Can corporate giving and donations from philanthropists continue to plug the shortfall? \n\nGuests\n\nBrenna Hobson, National Theatre of Scotland\nKate Varah, the Old Vic, London \nRachel Tackley, Chichester Festival Theatre.",
            "length": "27200000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p059md5c.mp3"
        },
        {
            "title": "Cost cutting and business transformation",
            "datePublished": "Thu, 20 Jul 2017 20:00:00 +0000",
            "description": "What is the best way of cutting costs and transforming a business? Bosses often have to prune their operations - either to reinvest the cash to grow the business in other directions or because costs have got out of control. But can cuts go too far and damage an organisation? It was reported that British Airways' computer meltdown earlier this year was caused in part because the company had moved too quickly to make efficiency savings. It now faces paying its customers millions of pounds in compensation. Evan Davis and panel discuss the good, bad and the ugly of cost cutting and business transformation.\n\nGuests:\n\nAshley Almanza, Chief Executive of G4S \nGavin Oldham, founder of Share Radio\nMarco Amitrano, head of consulting at accountants, PWC.",
            "length": "26960000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p05934sd.mp3"
        },
        {
            "title": "One Company, Many Brands",
            "datePublished": "Thu, 06 Jul 2017 20:00:00 +0000",
            "description": "Evan Davis discusses the reasons why some companies have multiple brands. Is it to bamboozle or does it help consumers navigate the wide variety of choices? Can there be too many? When does product proliferation make sense? Evan talks to three guests: a brand consultant, a marketing executive from drinks company Diageo and a representative from Johnson & Johnson about how we can better understand the world of brands.\n\nGUESTS\n\nRobert Jones - Brand consultant at Wolf Olins and a visiting professor at the University of East Anglia\nJana Ignatova - Head of Baby global franchise for EMEA at Johnson & Johnson\nEd Pilkington - European Marketing and Innovation Director at Diageo.",
            "length": "27216000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p057y6jw.mp3"
        },
        {
            "title": "Land - the mother of all monopolies",
            "datePublished": "Thu, 29 Jun 2017 20:05:00 +0000",
            "description": "Evan Davis presents the business magazine.",
            "length": "27216000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p0575qhr.mp3"
        },
        {
            "title": "When Robots Take our Jobs",
            "datePublished": "Thu, 22 Jun 2017 20:00:00 +0000",
            "description": "Are white collar workers under threat from the new robotic workforce? Manufacturing companies have been replacing production line workers with robots for years, but as the technology becomes more advanced, they are being increasingly used in healthcare, law firms and HR departments. So is the white collar worker under threat? Evan Davis talks to three guests, a roboticist, an Artificial Intelligence consultancy worker and the CEO of a hotel chain who is already using robots in his business. \n\nGUESTS\n\nThrishantha Nanayakkara - Roboticist, Imperial College\n\nDr. Michael Chui - Partner, IT and innovation, McKinsey Global Institute\n\nHubert Viriot - CEO, Yotel.",
            "length": "27088000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p056ly2w.mp3"
        },
        {
            "title": "Corporate Espionage",
            "datePublished": "Thu, 15 Jun 2017 20:00:00 +0000",
            "description": "Corporate theft has played a big part in business history from Porcelain and Tea from China, to the French attempting to get their hands on the blueprint for the Spinning Jenny. In this week's programme Evan Davis and guests discuss more modern copyright infringement and how to protect against it. \n\nGUESTS\n\nChris Morgan-Jones, Crime fiction author and Consultant, K2 Intelligence\n\nVicki Salmon, Lawyer and Patent Attorney, IP Asset Partnership, Council Member of the Chartered Institute of Patent Attorneys and Chair of CIPA's Litigation Committee \n\nMandy Haberman, Director and Founder of Haberman Products Limited.",
            "length": "27072000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p05609vm.mp3"
        },
        {
            "title": "The Future of Farming",
            "datePublished": "Thu, 08 Jun 2017 21:30:00 +0000",
            "description": "What's the future for UK Farming? Evan Davis meets three food producers from across the country to talk about the daily challenges of farming in Britain today. Guests include one of the biggest carrot producers in the country, a Wiltshire Beef farmer and Deputy President of the National Farmers Union and a lowland sheep farmer whose herd shares the land with cadets from the Ministry of Defence in Kent. \n\nGUESTS\n\nGuy Poskitt, Managing Director, M H Poskitt Ltd\n\nMarie Prebble, Lowland Sheep farmer\n\nMinette Batters, Beef farmer and Deputy President of the National Farmers Union.",
            "length": "23168000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p05593tp.mp3"
        },
        {
            "title": "The Bottom Line: Can We Trust Big Business?",
            "datePublished": "Fri, 02 Jun 2017 13:13:00 +0000",
            "description": "Business and its place in society is a prominent issue at the moment. Zero hours contracts, executive pay, tax avoidance are all issues where opinion has shifted dramatically. Has Shareholder driven capitalism finally gone too far?\nIn a special programme recorded at the Royal Academy of Engineering in front of a live audience, Evan Davis talks to the former BP CEO, Lord John Browne on his thoughts about big business as it relates to society. And asks whether it's now time to trust big business?",
            "length": "54400000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p054qrt6.mp3"
        },
        {
            "title": "Britain's nuclear future",
            "datePublished": "Thu, 30 Mar 2017 19:30:00 +0000",
            "description": "Britain's multi-billion pound nuclear dream. EDF is building the country's first new nuclear power station in decades at Hinkley Point C in Somerset. But that's just the start. Two other companies also have dreams of bringing nuclear to sites in Cumbria and on Anglesey. But the financing and logistics of these projects are tough. Power stations cost billions to build and investors won't see returns for more than five years. Critics of the nuclear option argue that renewables - wind and solar power - would be a better option to generate electricity. Just what are the options and the costs involved? Three nuclear rivals join Evan Davis.\n\nGuests:\nHumphrey Cadoux-Hudson, managing director, nuclear new build, EDF Energy UK\nDuncan Hawthorne, chief executive, Horizon Nuclear Power\nTom Samson, chief executive, NuGeneration Nuclear Power\nDame Sue Ion, chair of the Nuclear Innovation and Research Advisory Board.",
            "length": "27584000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p04yjb66.mp3"
        },
        {
            "title": "Migrant Entrepreneurs",
            "datePublished": "Thu, 23 Mar 2017 21:00:00 +0000",
            "description": "Migrant entrepreneurs create one in seven businesses in the UK. This week Evan Davis talks to three entrepreneurs who all arrived from overseas with very little and then went on to create a successful business. \n\nGUESTS\n\nTony Kitous, Founder, Comptoir Libanais\n\nRazan Alsous, Yorkshire Dama Cheese\n\nSurinder Arora, Founder and Chairman, Arora Group.",
            "length": "40576000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p04xrf0m.mp3"
        },
        {
            "title": "Fintech",
            "datePublished": "Thu, 16 Mar 2017 21:00:00 +0000",
            "description": "The UK is a world leader in financial services technology, otherwise known as fintech. \n\nPresenter Evan Davis asks how Britain has beaten Silicon Valley and what challenges fintech poses to traditional banking?\n\nGuests:\nAntony Jenkins, Founder and Executive Chairman, 10x Future Technologies\nIshaan Malhi, Founder, Trussle.com\nEileen Burbidge, Co-founder, Passion Capital\n\nProducer: Julie Ball.",
            "length": "27168000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p04x1mjq.mp3"
        },
        {
            "title": "The Secrets of Fixing a Price",
            "datePublished": "Thu, 09 Mar 2017 21:00:00 +0000",
            "description": "From budget airline seats to insurance, Evan Davis discovers the secrets of pricing.",
            "length": "27232000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p04w43rk.mp3"
        },
        {
            "title": "How does stuff get to us?",
            "datePublished": "Thu, 02 Mar 2017 21:00:00 +0000",
            "description": "How does a can of Italian tomatoes reach the supermarket shelf and a car manufacturer receives its parts in time? Evan Davis finds out about the hidden transport networks that bring goods from around the world to our high street shops and factory floors.\n\nJoining Evan to discuss the business of logistics are:\n\nPaul Dyer, CEO of DHL Supply Chain\nMaggie Simpson, Executive Director of the Rail Freight Group , the representative body for rail freight in the UK\nOliver Treneman, Park Development Director, DP World London Gateway\n\nProducer: Julie Ball.",
            "length": "27376000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p04vg7w5.mp3"
        },
        {
            "title": "The UK Space Industry",
            "datePublished": "Thu, 23 Feb 2017 21:00:00 +0000",
            "description": "The UK space industry is growing faster than the wider economy. Its application is broad - from manufacturing satellites, earth observation projects, to advanced research and design for space exploration. The government aims to capitalise on all this activity and wants the UK to have its own space port for commercial flights and satellite missions. The programme will hear from the country's top small satellite manufacturer and from a firm developing a revolutionary hypersonic propulsion engine. Evan Davis's guests are:\n\nCatherine Mealing-Jones, UK Space Agency\nMark Thomas, Reaction Engines\nPatrick Wood, Surrey Satellite Technology \n\nProducer: Lesley McAlpine.",
            "length": "27040000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p04ts9jv.mp3"
        },
        {
            "title": "Managing Workplace Relationships",
            "datePublished": "Thu, 16 Feb 2017 21:00:00 +0000",
            "description": "We spend a third of our life at work so it's inevitable that relationships blossom, whether it's a one night stand at the Christmas party or one that becomes a long term partnership. How do companies handle the issues that can arise from office romance? Evan Davis and his guests discuss the solutions.\n\nGUESTS\n\nNeil Morrison, Director, Strategy, Culture and Innovation. Penguin Random House\n\nHelen Farr, Partner, Employment Law Group, Fox Williams\n\nDanielle Harmer, Chief People Officer, Metro Bank.",
            "length": "26944000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p04t31yf.mp3"
        },
        {
            "title": "The Challenges of Running a Charity",
            "datePublished": "Thu, 09 Feb 2017 21:00:00 +0000",
            "description": "How can people running charities balance doing good, maximising income, while retaining public trust? The sector is undergoing changes in regulation in the wake of scandals involving fundraising and governance. Evan Davis meets the experts. Taking part are: the chairman of the new Fundraising Regulator, Lord Grade of Yarmouth; Jayne Clarke of the Royal National Lifeboat Institution and Simon Gillespie from the British Heart Foundation.",
            "length": "26976000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p04sc8bj.mp3"
        },
        {
            "title": "Care Homes",
            "datePublished": "Thu, 02 Feb 2017 21:00:00 +0000",
            "description": "The care home business is heading for a crisis according to Evan Davis's guests in this edition of The Bottom Line. \n\nThe cost of providing care in this labour-intensive business has increased significantly because of the introduction of the National Living Wage. The fees paid by local authorities on behalf of poorer residents no longer cover the cost of providing accommodation, food and staffing. Care homes make up the shortfall by charging higher fees to privately funded residents. Social care analyst William Laing tells Evan Davis that private payers subsidise publicly funded residents by, on average, £8000 per annum. But this is not an option in less affluent areas with a shortage of fee paying clients.\n\nJohn Ransford of the HC-One group provides care for mainly publicly funded residents. He tells Evan that 24 hour care for the elderly has to be provided for less than the cost of a night in a Travelodge.\n\nEvan's guests believe that the care sector's business model is unsustainable. Find out what they think will happen next.\n\n\nGuests:\n\nDr. Jane Townson. Chief Executive Officer, Somerset Care Group\n\nJohn Ransford, Non-Executive Director, HC-One \n\nWilliam Laing, Founder and a Director of Laing Buisson, Healthcare Intelligence Company\n\nProducer: Julie Ball.",
            "length": "45328000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p04rnv55.mp3"
        },
        {
            "title": "Negotiating a Trade Deal",
            "datePublished": "Fri, 27 Jan 2017 13:25:00 +0000",
            "description": "Brexit means the UK government will have to negotiate trade agreements with the EU and the rest of the world. Trade deal experts share their tips with presenter Evan Davis.\n\nGuests include:\n\nJanice Charette, Canadian High Commissioner to the UK \nTim Cullen, founder and director of Oxford Programme on Negotiation\n\nProducer: Julie Ball.",
            "length": "27152000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p04qzp9q.mp3"
        },
        {
            "title": "17/11/2016",
            "datePublished": "Thu, 17 Nov 2016 20:45:00 +0000",
            "description": "If the word auction conjures up pictures of a man with a gavel in a packed room shouting 'going, going, gone' - think again. These days governments and businesses rely on complicated online auctions to buy and sell. Auctions are also the preferred mechanism for the allocation of radio spectrum licences to mobile phone companies and the selling of mineral rights. Auctions come in a huge variety of forms, and the precise design can have a dramatic effect on the outcomes. Do you know a sealed bid from a \"combinatorial clock\" auction? Evan Davis and guests discuss the business of auctions. \n\nGuests include: \nDan Maldoom, DotEcon\nSamantha Collett property developer \nStephen Lerner, 3 UK\n\nProducer: Lesley McAlpine.",
            "length": "27088000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p04gfbqg.mp3"
        },
        {
            "title": "The Future of the Car Industry",
            "datePublished": "Fri, 11 Nov 2016 18:25:00 +0000",
            "description": "The future of the car industry. How car manufacturers are joining forces with \"ride hailing\" companies like Uber and why the future might be driverless. Evan Davis and guests discuss. \n\nDisruptive technology has made seismic changes to several business models: think Apple iTunes and the music industry or Netflix and our television viewing habits. It seems that the car industry might be next. Unlike their predecessors, car manufacturers are joining forces with the technology companies. Google with Ford, Uber with Volvo, General Motors with Lyft, pooling their expertise and resources. Joining Evan Davis on the programme are three guests who will talk about the hopes and fears for the industry and what this will mean for the rest of us.\n\nGUESTS\n\nGeorg Ell, Director, Western Europe, Tesla Motors\n\nMatteo de Renzi, CEO, Western Europe, Gett\n\nand\n\nDr. Eberhard Zeeb, Senior Manager, Function and Software Driving Assistance, Daimler \n\nProducer: Julie Ball.",
            "length": "27104000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p04g0n06.mp3"
        },
        {
            "title": "The Youth Market",
            "datePublished": "Thu, 03 Nov 2016 20:45:00 +0000",
            "description": "Evan Davis and guests explore the fast moving world of selling to 18-24 year olds. Collectively, that age group has billions to spend. Individually, many are strapped for cash. So how do companies get their attention and their money? The answer seems to be: market your brand using social media. Link up with a celebrity with millions of followers and watch the money roll in. That's the theory. Forget old style television adverts. That age group isn't watching the box - they're on their mobiles. Joining the programme will be: Josephine Hansom from Youth Sight; Philip O'Ferrall, Viacom International Media Networks and Simon Beckerman from Depop.\n\nProducer: Lesley McAlpine.",
            "length": "26896000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p04f163b.mp3"
        },
        {
            "title": "Selling Corporate Baby",
            "datePublished": "Thu, 27 Oct 2016 19:45:00 +0000",
            "description": "Starting a business is often compared to bringing up a baby, and with good reason: it's costly, gives you sleepless nights and requires your attention during every waking moment. But what happens when it is time sell the business you have nurtured? Three successful entrepreneurs talk to Evan Davis about the feelings of relief and regret which can accompany selling off a business.\n\nGUESTS\n\nLiz Earle, Co-founder of Liz Earle Naturally Active Skincare\n\nWilliam Kendall, Chairman, Cawston Press\n\nJules Coleman, Co-founder of Hassle.com.",
            "length": "27088000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p04d9w8r.mp3"
        },
        {
            "title": "Activist Investors",
            "datePublished": "Thu, 20 Oct 2016 19:45:00 +0000",
            "description": "Are activist investors good or bad for the firms they target? They hunt down companies they think are underperforming. They buy a stake in the business, then lobby for change. Critics say activists want to make a fast buck and then head for the exit. But you could regard these investors as doing a valuable service - challenging poorly performing company boards and making more profit for shareholders. Top UK names like Rolls Royce and John Menzies have been affected. Explore the world of activist investors with Evan Davis. Joining him will be: activist investor, Harlan Zimmerman, senior partner at Cevian Capital; Chris Walton, a company chairman and non-executive director; and Sacha Sadan, director of corporate governance at Legal and General Investment Management. \n\nProducer: Lesley McAlpine.",
            "length": "27200000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p04clmmk.mp3"
        },
        {
            "title": "Careers without College",
            "datePublished": "Thu, 13 Oct 2016 19:45:00 +0000",
            "description": "Why are more top employers offering school leavers a fast track career without the need to go to university? Applicants for the top Degree Apprenticeships need to get good A level grades and pass a rigorous selection process. Their reward is the opportunity to earn a living while they gain a degree and qualify as a professional. Evan Davis discusses the pros and cons of such schemes with a high flying apprentice and two employers who are competing with universities for the brightest and best school leavers.",
            "length": "27120000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p04bs6j8.mp3"
        },
        {
            "title": "Brexit: What Next?",
            "datePublished": "Thu, 06 Oct 2016 19:45:00 +0000",
            "description": "How do you do business when you can't see into the future? This may be what businesses always have to do, but Brexit has undeniably made the future even harder to discern than usual. When will it happen, what relationship with Europe will follow, and how will the rest of the world react? \n\nFor now we don't know, but the answers to those questions will affect every business in Britain. \n\nSo how are companies planning for an uncertain future while at the same time trying to ensure that whichever model of Brexit emerges is one that suits their needs. \n\nJoining Evan Davis are:\n\nKaren Briggs: Head of Brexit - KPMG\nGerald Mason: SVP - Tate & Lyle Sugars\nGavin Williams: Partner - Herbert Smith Freehills \n\nProducer: Joe Kent.",
            "length": "26944000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p04b4kbz.mp3"
        },
        {
            "title": "Theresanomics",
            "datePublished": "Thu, 29 Sep 2016 19:45:00 +0000",
            "description": "Theresa May has promised a bigger role for the state in business. The previously unfashionable concept of a comprehensive industrial strategy is back on the agenda. There is a new wariness about foreign investment in strategic industries such as electricity generation. Mrs May also wants to see employee representatives on company boards. \n\nPresenter Evan Davis discusses \"Theresanomics\" with a panel of entrepreneurs and corporate leaders. \n\nGuests include:\n\nElizabeth Corley, vice-chair of Allianz Global Investors\nDavid Pitt-Watson, former Chair of Hermes Focus Funds and co-author of The New Capitalists\n\nProducer: Julie Ball.",
            "length": "26928000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p049dncv.mp3"
        },
        {
            "title": "How to Build an Olympics",
            "datePublished": "Thu, 21 Jul 2016 20:00:00 +0000",
            "description": "The Olympics Games is the biggest sporting event on earth. But the road to a successful Olympics can be more gruelling than a marathon. With less than two weeks to go until the opening ceremony in Rio, Evan Davis and guests discuss the difficulties of managing the money, the politics and the people. \n\nGUESTS:\n\nNeil Wood MBE, Partner, Deloitte and former CFO of London Organising Committee for the Olympic Games (LOCOG) \n\nGerhard Heiberg, International Olympic Committee (IOC) member and President and CEO of Lillehammer Winter Olympic,s 1994\n\nProfessor Andrew Zimbalist, Sports Economist, Smith College Massachusetts, Consultant and Author\n\n\nProducer: Julie Ball\n\nEditor: Innes Bowen.",
            "length": "27024000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p0421g7z.mp3"
        },
        {
            "title": "Brave or Naive?",
            "datePublished": "Thu, 14 Jul 2016 20:00:00 +0000",
            "description": "Is escaping the rat race always a good idea? Many people dream of giving up the day job to start their own business - and we often hear about the success stories. But does everyone have what it takes? Evan Davis and guests compare the dream and the reality. \n\nGUESTS:\n\nLuke Johnson, Entrepreneur and Founder of Risk Capital Partners\n\nPaula Fry, former Director, Fashion Seeker UK \n\nSarah Meredith, Sole Trader, Rock Cakes\n\nDeirdre Critchley, former Director, Jammy Cow \n\nProducer: Elizabeth Cassin.",
            "length": "27056000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p041ffhj.mp3"
        },
        {
            "title": "The Price of Life",
            "datePublished": "Thu, 07 Jul 2016 20:00:00 +0000",
            "description": "It's hard to put a value on a human life. When you're well, perhaps you don't think about it. But if you're ill, getting access to the right drugs, whatever the cost, is a priority. But the NHS does not have a bottomless pit of money. And some medicines are judged too expensive to be freely available, so patients miss out on treatments that could save or extend their lives. There are usually two villains of the piece: The drugs companies for charging too much; the NHS for not stumping up the cash. In this edition, Evan Davis and guests explore how pharmaceutical companies price their drugs, the role of the NHS in deciding how much the medicines are worth and, in the case of generic or non-branded drugs, they'll ask whether competition is working properly to keep down the NHS medicines bill. \n\nGuests:\nErik Nordkamp, Managing Director, Pfizer UK\n\nCarole Longson, Director of the Centre for Health Technology Evaluation at NICE, the National Institute for Health and Care Excellence \n\nWarwick Smith, Director-General, British Generic Manufacturers Association\n\nProducer: Sally Abrahams.",
            "length": "26992000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p040qpyn.mp3"
        },
        {
            "title": "Life after Brexit",
            "datePublished": "Thu, 30 Jun 2016 20:02:00 +0000",
            "description": "How will the vote to leave the EU affect big and small businesses in the UK? Evan Davis and guests discuss trade deals, tariffs and 'passporting' rights that allow UK-based firms to sell financial products and services from Britain to EU customers. They'll also explore how companies can turn the current economic uncertainty into business opportunities. \n\nGuests:\n\nAnne Richards, CEO, M & G Investments \n\nJuergen Maier, CEO Siemens UK\n\nJulia Gash, Founder and CEO, BIDBI \n\nJan Atteslander, EconomieSuisse\n\nProducer: Sally Abrahams.",
            "length": "27024000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p0400lhn.mp3"
        },
        {
            "title": "How to Negotiate",
            "datePublished": "Thu, 23 Jun 2016 20:00:00 +0000",
            "description": "Most of us negotiate in some form or other every day - whether it's about who walks the dog, how much screen-time the kids can have or when to visit the in-laws. But too often we treat it like a competitive sport, with only one aim: to win. Which can backfire, especially when you need co-operation later on. It's much the same in business - negotiating to win at all costs is unlikely to result in a long-term, sustainable business relationship. So how to achieve a win-win situation when both sides leave satisfied and ready to do business with each other again? Evan Davis and guests explore the skills that can help settle disputes between individuals, companies and even nations. They'll discuss when to walk away from the negotiating table and they'll find out what happens when doing a deal is literally a matter of life and death. \n\nGuests: \n\nTim Cullen, Director, Oxford Programme on Negotiation, Said Business School\n\nBridie Warner-Adsetts, COO, Naylor Industries\n\nSue Williams, Hostage Negotiator \n\nProducer: Sally Abrahams.",
            "length": "27024000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p03yjvpg.mp3"
        },
        {
            "title": "The Finance of Films",
            "datePublished": "Thu, 16 Jun 2016 20:00:00 +0000",
            "description": "The business of film. Evan Davis follows the money trail from script to screen. With the help of a top independent film producer, a film distributor and the head of a top cinema chain, Evan discovers who takes the risks and who makes the money behind the scenes. \n\nGuests\n\nAlex Hamilton, Managing Director, Entertainment One UK\n\nElizabeth Karlsen, Producer and co-founder, Number9 Films\n\nTim Richards, CEO, Vue International.",
            "length": "26880000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p03yjty2.mp3"
        },
        {
            "title": "Old Dog, New Tricks",
            "datePublished": "Thu, 09 Jun 2016 20:00:00 +0000",
            "description": "It is not easy to teach new tricks to the business world's old dogs. The latest fashionable solution for big corporations slowed down by bureaucracy and traditional ways of thinking is to incubate tech start-ups. The idea is that the big corporation benefits from the creativity and \"can do\" attitude of the start-up. In return the start-up gets funding, professional advice and help navigating the corporate world to reach the top decision makers. The model is known as \"corporate acceleration\" and it is growing in popularity. Evan Davis hears how it works. \n\nGUESTS: \n\nJess Williamson, Director, Techstars with Barclays FinTech Accelerator\n\nDavid Fogel, Head of Accelerator & Deputy Director at Wayra UK\n\nEmily Forbes, Founder, Seenit\n\nProducer: Julie Ball.",
            "length": "27136000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p03xt95j.mp3"
        },
        {
            "title": "Profit or plunder?",
            "datePublished": "Thu, 02 Jun 2016 20:00:00 +0000",
            "description": "Asset management - or asset stripping? This week Evan Davis asks when making a profit from running a business becomes simple plundering.\n\nIn business, things go wrong at the best of times ... mistakes are made, luck turns bad. But sometimes things can also go wrong not because of bad luck, but because someone makes money out of failure.\n\nThe \"profit or plunder\" question has been raised by events at BHS. It was struggling, facing intense competition in a tough retail environment. But the owner took quite a bit of money out of the company. And the staff pension fund went into deficit. Sir Phillip Green, who was then in charge, sold the business to an inexperienced former bankrupt who didn't make it work and it is now in administration.\n\nThis has made a lot of people angry - but aside from BHS, how do we distinguish between a case that is bad luck, a bad apple, or a system that is badly designed?\n\nJoining Evan Davis in the Bottom Line studio this week are Bruce Davis of peer-to-peer lender Abundance, Breffni Walsh of Brands Are Best and Garry Wilson of private equity firm Endless LLP.",
            "length": "27280000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p03x2b33.mp3"
        },
        {
            "title": "EU Referendum",
            "datePublished": "Thu, 26 May 2016 19:30:00 +0000",
            "description": "What does EU membership mean for UK business and how might that change if Britain votes to leave? Business leaders join Evan Davis to discuss how trade agreements and red tape can both help and hinder corporate success. What can Switzerland teach us about trading with Europe and beyond, despite being outside the EU? \n\nGuests:\n\nJan Atteslander, EconomieSuisse \n\nJulia Gash, CEO, Bidbi\n\nChristopher Nieper, Managing Director, David Nieper\n\nJayne-Anne Gadhia, CEO, Virgin Money \n\nJon Moynihan, Chairman, Ipex Capital \n\nProducer: Sally Abrahams.",
            "length": "27072000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p03wc403.mp3"
        },
        {
            "title": "Life after a Blockbuster",
            "datePublished": "Mon, 04 Apr 2016 09:27:00 +0000",
            "description": "Whether it's creating Angry Birds, the best-selling mobile app, or developing the best-selling Alzheimer's drug or discovering one of the world's biggest oil fields in recent years, every company dreams of blockbuster success. \n\nBut what happens after you hit the jackpot? How do you sustain that level of success? And what's needed to adapt from small start-up to big business? \n\nEvan Davis and guests share the secrets of success and explore their experiences of trying to maintain their market position. \n\nGuests:\n\nKati Levoranta, CEO, Rovio Entertainment (creators of Angry Birds) \n\nDr David Jefferys, Global Senior Vice President, Eisai Pharmaceuticals\n\nJón Ferrier, CEO, Gulf Keystone Petroleum \n\nProducer: Sally Abrahams.",
            "length": "27056000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p03pzh6l.mp3"
        },
        {
            "title": "Lonely at the Top?",
            "datePublished": "Thu, 17 Mar 2016 21:00:00 +0000",
            "description": "Many senior executives now employ personal coaches to help them through their toughest business challenges. Coaches can provide confidential, independent support for senior managers who find life lonely at the top. But shouldn't the boss be capable of making decisions on his or her own? And are coaches sometimes the hidden power behind the senior executive throne?\n\nGuests:\n\nGavin Patterson, CEO of BT Group\n\nMelanie Richards, Vice Chairman and Partner of KPMG UK\n\nJonathan Bowman-Perks, Coach and Mentor\n\nProducer: Ruth Edwards.",
            "length": "27072000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p03n1rvn.mp3"
        },
        {
            "title": "Horse Racing",
            "datePublished": "Thu, 10 Mar 2016 21:00:00 +0000",
            "description": "Horse racing is the second most popular spectator sport in the UK but it is also a business. Presenter Evan Davis and guests discuss who makes the money: the horse owners, the jockeys, the race courses or the bookmakers?\n\nGuests:\n\nSimon Bazalgette, Chief Executive, The Jockey Club\n\nRachel Hood, Director, The Horsemen's Group\n\nCiaran O'Brien, Group Communications Director, William Hill bookmakers\n\n\nProducer: Julie Ball.",
            "length": "27056000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p03m17m5.mp3"
        },
        {
            "title": "Tax Avoidance",
            "datePublished": "Thu, 03 Mar 2016 21:00:00 +0000",
            "description": "Global firms like Amazon, Google and Starbucks have been criticised for using clever accounting tricks to reduce their tax bills in the UK. But how much tax should they be paying? Evan Davis and guests discuss the whys and wherefores of the international tax regime, including the role of tax havens. Along the way, they'll digest the \"Dutch sandwich\" and the \"double Irish\" tax avoidance devices used by some multinationals. And given the widespread perception that many firms don't pay their fair share of tax, they'll assess efforts by the world's major economies to rewrite the rules on corporate tax.\n\nGuests:\n\nHeather Self, Tax Partner, Pinsent Mason\n\nRolf Rothuizen, Partner, RPS Legal, Amsterdam\n\nAnthony Travers, Chairman, Cayman Islands Stock Exchange\n\nProducer: Sally Abrahams.",
            "length": "26992000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p03ldfdy.mp3"
        },
        {
            "title": "Now We Are Ten",
            "datePublished": "Thu, 25 Feb 2016 21:00:00 +0000",
            "description": "The Bottom Line first broadcast on BBC Radio 4 in February 2006. At the time, Tony Blair was Prime Minister, interest rates were 4.5%, petrol was 90 pence a litre and a first class stamp cost 32p (half today's price). In a special edition, to mark ten years since the programme came on air, Evan Davis and guests discuss some of the big changes that have happened in the past decade, including: the global recession, record high and record low oil prices, a technology boom and China's extraordinary economic growth. How have businesses adapted to the changing world? \n\nGuests: \n\nNicola Horlick, CEO, Money & Co\n\nSir Ian Cheshire, Chairman, Debenhams\n\nNicola Shaw, CEO, HS1\n\nKen Olisa, Founder and Chairman, Restoration Partners \n\nProducer: Sally Abrahams.",
            "length": "26976000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p03kmzhd.mp3"
        },
        {
            "title": "Data Privacy",
            "datePublished": "Thu, 18 Feb 2016 21:00:00 +0000",
            "description": "When you enter personal details onto any website or smartphone app, what happens to it? Where does it get stored, who owns it and who has access to it? These questions are becoming more relevant to ask as we put more details about every facet of our lives onto the internet. With a new piece of legislation passed in the EU dealing with this precise issue, businesses need to be up to speed with their knowledge on effective privacy management\n\nEvan Davis and guests discuss why personal data is so valuable to business, and how the individual can also benefit from sharing this information.\n\nGuests: \n\nMike Gordon, CEO, Callcredit Information Group\n\nLiz Brandt, CEO, Ctrl Shift\n\nEduardo Ustaran, Data Privacy expert and Partner, Hogan Lovells.",
            "length": "26688000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p03jvpz3.mp3"
        },
        {
            "title": "Customer Service",
            "datePublished": "Thu, 11 Feb 2016 21:00:00 +0000",
            "description": "All businesses rely on customers. So, why do some businesses bend over backwards to keep customers happy, and why do some of them appear not to care? What is the impact of poor customer service on a business and how much does it cost them to invest in improving their infrastructure? Evan Davis discusses dos and don'ts of customer service with an airline, an energy company and a retailer, all of which have tried to completely overhaul their image. Has it worked?\n\nGuests: Kenny Jacobs, Chief Marketing Officer at Ryanair; Neil Clitheroe CEO retail and generation at Scottish Power and Gary Booker, Chief Marketing Officer at Dixons Carphone\n\nProducer: Sally Abrahams \nResearcher: Sofia Patel.",
            "length": "27088000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p03j3vmb.mp3"
        },
        {
            "title": "Renewable Energy",
            "datePublished": "Thu, 04 Feb 2016 20:50:00 +0000",
            "description": "After the Paris summit on climate change and the global commitment to cut carbon emissions, The Bottom Line is going green - with businesses that generate energy from the sun, the wind - and from cheese. And, whilst the government is committed to getting more of its energy from renewables, Evan Davis and guests discuss why green firms are seeing red over cuts to subsidies they say are vital to update ageing infrastructure. \n\nGuests:\n\nJuliet Davenport, CEO, Good Energy\n\nJeremy Leggett, Founder, Solarcentury\n\nPaul Cowling, MD, RWE Innogy UK \n\nProducer: Sally Abrahams.",
            "length": "27120000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p03hjnky.mp3"
        },
        {
            "title": "Managing the Boardroom",
            "datePublished": "Thu, 28 Jan 2016 21:00:00 +0000",
            "description": "After recent corporate scandals like VW's emissions' cheating, Tesco's accounting irregularities, Barclays interest-rate rigging, many asked why company board members failed to act. What happened to the checks and balances designed to curb management excesses? Evan Davis and guests look at how company boards operate and how to make them work effectively. They discuss the role of company directors, the skills and experience required and examine why some say 'Beware the charismatic CEO'. \n\nGuests: \n\nSir David Walker, Former Chairman, Barclays plc\n\nMichael Jackson, Former Chair, The Sage Group plc\n\nMargaret Heffernan, Former CEO, entrepreneur and author \n\nProducer: Sally Abrahams.",
            "length": "27248000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p03gqtgh.mp3"
        },
        {
            "title": "The Northern Powerhouse",
            "datePublished": "Thu, 19 Nov 2015 21:00:00 +0000",
            "description": "Can the Northern Powerhouse solve Britain's North-South economic divide? For now, the Northern Powerhouse is a concept: an idea that towns and cities in the north can unite, forming their own economic hub to rival London and the south east. So how to turn it into a reality? Evan Davis and guests are with an audience at the Greater Manchester Chamber of Commerce to discuss what kind of businesses will settle in the north of England and what needs to be done to encourage them to make the move. They'll talk about the frustrations of poor transport links, the joys of green spaces and the reasons why businesses like to cluster.\n\nGuests:\nWayne Hemingway, Designer and entrepreneur, Hemingway Design\nVanda Murray, an Independent Director, Manchester Airports Group\nSir Richard Leese, Leader, Manchester City Council and Chair, Transport for the North\nJo York, co-founder, Reframed TV\n\nProducer: Sally Abrahams.",
            "length": "27248000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p037yw9f.mp3"
        },
        {
            "title": "Breaking the Mould",
            "datePublished": "Thu, 12 Nov 2015 21:00:00 +0000",
            "description": "Rewriting the rules: what does it take to be a non-conformist? Evan Davis is joined by a banker, a brewer and a tech entrepreneur as they discuss how success can mean challenging the orthodox way of doing things.\n\nGuests:\n\nJames Watt - Founder, Brewdog Ltd\n\nSarah Wood - Co-founder, Unruly Media\n\nAnders Bouvin, CEO, Handelsbanken UK.",
            "length": "26800000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p0377236.mp3"
        },
        {
            "title": "Financial Engineering",
            "datePublished": "Fri, 06 Nov 2015 11:10:00 +0000",
            "description": "What does a financial engineer do? A mechanical engineer may design a machine, one that does a task or overcomes an obstacle, but what problems does modern finance solve? Can the clever manipulation of debt, equity or derivatives, really make human beings better off? Some think finance is a bit of a racket, designed to extract money from the enterprise of others; others think modern finance is a miracle that can create value from nothing. Evan Davis and guests try to get to the bottom of this argument on this week's The Bottom Line.\n\nGuests:\n\nJohn Kay - Economist and writer\nJessica James - Head of the FX Quantative Solutions Group, Commerzbank\nJon Moulton - Founder, Better Capital.",
            "length": "27040000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p0379mfn.mp3"
        },
        {
            "title": "Fast Fashion",
            "datePublished": "Thu, 05 Nov 2015 21:00:00 +0000",
            "description": "From the design desk to the shop window, how do fast fashion brands deliver the latest trends in double-quick time? Evan Davis and guests discuss fabric, factories and a nimble supply chain. \n\nGuests: \n\nCatarina Midby, Sustainability manager, H & M;\nCarol Kane, Co-founder and Joint CEO, Boohoo;\nKim Winser, Founder and CEO, Winser London. \n\nProducer: Sally Abrahams.",
            "length": "27216000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p036n34r.mp3"
        },
        {
            "title": "Sponsorship",
            "datePublished": "Thu, 22 Oct 2015 19:30:00 +0000",
            "description": "Whether it's high-profile sports events or blockbuster art exhibitions, companies like Adidas and Unilever spend millions of pounds on sponsorship - to get their brand associated with sporting or artistic excellence. The global sponsorship market is worth more than 30 billion pounds a year, but what happens when negative publicity - like Fifa's World Cup corruption scandal - starts to tarnish a brand? Evan Davis and guests discuss whether sponsors should walk away or use their influence to press for change. \n\nGuests:\n\nPeter Mather, Group Regional Vice President for Europe, BP; \nJan Gooding, Group Brand Director, Aviva;\nJaimie Fuller, Chairman, Skins. \n\nProducer: Sally Abrahams.",
            "length": "26864000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p035908d.mp3"
        },
        {
            "title": "Going Public",
            "datePublished": "Thu, 15 Oct 2015 20:00:00 +0000",
            "description": "Companies like Royal Mail, Saga and the AA have recently listed their shares on the stock market. It gives them access to plenty of money to help them grow, but also means they're subject to public scrutiny. Evan Davis and guests discuss why firms decide to float and how they must adapt to becoming a plc. \n\nGuests: \n\nMartin Clarke, CFO, the AA; \nDan Wagner, CEO, Powa Technologies; \nGillian Karran-Cumberlege, Co-Founder, Fidelio Partners. \n\nProducer: Sally Abrahams.",
            "length": "26800000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p0356xm1.mp3"
        },
        {
            "title": "Crisis at VW: A Bottom Line Special",
            "datePublished": "Wed, 07 Oct 2015 19:45:00 +0000",
            "description": "Volkswagen is dealing with a corporate crisis following the emissions rigging scandal. Evan Davis and guests discuss. \n\nGuests: \n\nSir John Egan, former CEO, Jaguar, former Chairman, Severn Trent \n\nLord Browne, former CEO, BP \n\nLucy Marcus, CEO, Marcus Venture Consulting \n\nArndt Ellinghorst, Senior MD, Evercore ISI\n\nProducer: Sally Abrahams.",
            "length": "41504000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p034mhqf.mp3"
        },
        {
            "title": "Art and the Business of Taste",
            "datePublished": "Thu, 01 Oct 2015 20:00:00 +0000",
            "description": "How do you value something like a painting? What makes one artist worth more than another? Who decides what is in vogue and why do they have so much power in the art world? Evan Davis presents a discussion on taste and value in the art world with a panel including the British artist Grayson Perry.\n\nGuests:\n\nGrayson Perry - Artist\n\nValeria Napoleone - Collector and Patron\n\nRalph Taylor - Director, UK Board Contemporary Art, Bonhams.",
            "length": "27200000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p033ysm2.mp3"
        },
        {
            "title": "Supermarkets",
            "datePublished": "Thu, 23 Jul 2015 20:00:00 +0000",
            "description": "Food deflation, the rise of the discount grocers and continuing price wars. Evan Davis and guests discuss who are the long-term winners in the supermarkets' battle to gain market share.\n\nGuests:\nMark Price, Managing Director, Waitrose\nSteve Murrells, CEO, Co-operative Foods\nKevin Gunter, Chairman, Fulton's Foods\n\nProducer:\nSally Abrahams.",
            "length": "27264000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02xtsw3.mp3"
        },
        {
            "title": "Entrepreneurs and Education",
            "datePublished": "Thu, 16 Jul 2015 20:00:00 +0000",
            "description": "Who needs qualifications for success? Three business leaders tell Evan Davis how they made it to the top after leaving school with just one A'Level between them all. Two of the guests explain how, having dyslexia and being labelled failures at school, made them even more determined to make a success of their lives. And they'll explore whether the skills to be an entrepreneur can be taught in the classroom.\n\nGuests:\nJo Malone, CEO, Jo Loves\nGary Grant, CEO, The Entertainer\nMark Featherstone-Witty, CEO, Liverpool Institute for Performing Arts\n\nProducer:\nJim Frank.",
            "length": "27072000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02x4v8k.mp3"
        },
        {
            "title": "Newspapers - to pay or not to pay?",
            "datePublished": "Thu, 09 Jul 2015 20:00:00 +0000",
            "description": "Despite widespread predictions of their demise and amid falling numbers of readers, newspapers are still with us. How are they adapting to the challenges of digital technologies? The industry is split on the issue of whether or not to charge readers for online. What is the best business model for newspapers to survive and prosper? Evan Davis and guests discuss.\n\nThe guests this week are: John Ridding, Chief Executive of the Financial Times; Ashley Highfield, Chief Executive of the Johnson Press and Andrew Miller, out-going Chief Executive of the Guardian Media Group.\n\nProducer: Jim Frank.",
            "length": "27104000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02x4g5p.mp3"
        },
        {
            "title": "Newspapers - to pay or not to pay?",
            "datePublished": "Thu, 09 Jul 2015 20:00:00 +0000",
            "description": "Despite widespread predictions of their demise and amid falling numbers of readers, newspapers are still with us. How are they adapting to the challenges of digital technologies? The industry is split on the issue of whether or not to charge readers for online. What is the best business model for newspapers to survive and prosper? Evan Davis and guests discuss.\n\nThe guests this week are: John Ridding, Chief Executive of the Financial Times; Ashley Highfield, Chief Executive of the Johnson Press and Andrew Miller, out-going Chief Executive of the Guardian Media Group.\n\nProducer: Jim Frank.",
            "length": "27120000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02wlb1r.mp3"
        },
        {
            "title": "Burger Battles",
            "datePublished": "Thu, 02 Jul 2015 20:00:00 +0000",
            "description": "The British love fast food. Each year we munch our way through thirty billion pounds worth. On The Bottom Line this week Evan Davis and guests discuss the burgeoning burger market. There are new challengers to the traditional big boys, like Five Guys, who claim to offer better quality burgers and a \"casual dining experience.\" Whilst one old famous brand from the 1970s, Wimpy, is attempting to make a come-back with re-branded restaurants and menu. But what's the recipe for success in this already over-crowded market?\n\nGuests: John Eckbert, Managing Director of Five Guys;\nBruce Layzell, Managing Executive of International Markets at Famous Brands (the South African company who own Wimpy and Steers)\nAnd Martin Breeden, Regional Director of Intu, who own some of Britain's biggest shopping centres.\n\nProducer: Jim Frank.",
            "length": "27104000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02w1crb.mp3"
        },
        {
            "title": "Angel Investors",
            "datePublished": "Thu, 25 Jun 2015 20:00:00 +0000",
            "description": "How to spot the next Google, Paypal or LinkedIn? Three successful entrepreneurs tell Evan Davis how they use their own money to back promising start-ups.\n\nGuests:\nSherry Coutu, founder, Cambridge Business Angels\nFiona Cruickshank, founder, Gabriel Investors\nSuzanne Biegel, founder, Clearly Social Angels\n\nProducer: Sally Abrahams.",
            "length": "27120000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02v017p.mp3"
        },
        {
            "title": "Outsourcing",
            "datePublished": "Thu, 18 Jun 2015 20:00:00 +0000",
            "description": "Outsourcing has had a bad press over the years: What with taxpayers being charged for tagging offenders who were dead, the fiasco over security at the London Olympics and the earlier trend for companies to shift operations to call centres in India. Evan Davis and guests look beyond the negative headlines to examine the pros and cons of getting an outside supplier to do some of your work. And they'll find out how outsourcing has enabled the creators of a chilli sauce to expand from the garden shed to the shelves of hundreds of stores.\n\nGuests:\n\nRupert Soames, CEO, Serco\nPaul Blantern, CEO, Northampstonshire County Council\nKuldip Singh Sehota, CEO Mr Singh's Sauce\n\nProducer: Sally Abrahams.",
            "length": "27200000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02tzxsq.mp3"
        },
        {
            "title": "Corruption",
            "datePublished": "Thu, 11 Jun 2015 20:00:00 +0000",
            "description": "The scandal at FIFA is just the latest story of corporate corruption to dominate the news. What steps can businesses take to avoid getting caught up in corruption, particularly in countries and sectors where bribery is the norm? What is legitimate business conduct and what crosses the line into illegality?\nEvan Davis and his guests discuss:\n\nEmma Sharma, Chief Ethics and Compliance Officer for the Supreme Group\nHugh Miles of The Al Shafie Miles Consultancy\nLeo Martin of Good Corporation\n\nProducer: Jim Frank.",
            "length": "26864000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02t9svd.mp3"
        },
        {
            "title": "Failure",
            "datePublished": "Fri, 05 Jun 2015 14:41:00 +0000",
            "description": "If your business venture doesn't succeed, how can you be sure it's worth trying again before admitting defeat? More than 50% of businesses fail within 5 years, yet for many, failure is a necessary part of success. Even Bill Gates and Steve Jobs didn't get it right first time. Evan Davis's guests discuss the important lessons they've learned from their business mistakes and speak candidly about the personal and financial impact of failing. How do you overcome the stigma of failure and what skills are required to bounce back when your business has bombed?\n\nGuests:\nBill Cullen, Chairman, Bill Cullen Motor Group\nKatarina Skoberne, Co-founder and former CEO, OpenAd\nStuart Miller, Co-founder and CEO, ByBox Group\n\nProducer: Sally Abrahams.",
            "length": "26960000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02t05vm.mp3"
        },
        {
            "title": "Productivity",
            "datePublished": "Thu, 28 May 2015 20:00:00 +0000",
            "description": "Why is UK productivity lower than in many other countries?\n\nEvan Davis begins a new series of The Bottom Line by looking at the productivity problem. The programme asks what productivity really means and how different sectors go about measuring it.\n\nEvan hears from three chief executives in three different sectors: manufacturing; advertising and health. How can productivity be measured and improved in these diverse sectors? How, for example, should the productivity of a doctor or nurse be measured?\n\nGuests:\nDame Julie Moore, Chief Executive of University Hospitals Birmingham\nBrian Holliday Managing Director, Managing Director for Siemens Digital Factory UK\nJames Murphy, Founder and Chief Executive of Adam and Eve DDB Advertising\n\nProducer: Jim Frank.",
            "length": "26880000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02sct1f.mp3"
        },
        {
            "title": "Corporate Scandal",
            "datePublished": "Thu, 26 Mar 2015 21:00:00 +0000",
            "description": "Phone hacking, financial mis-selling and fraud: How do companies recover from scandal and negative headlines? Evan Davis and guests discuss the skills and strategy required to bounce back.\n\nGuests:\n\nNiall Booker, CEO, Co-operative Bank\n\nMike Darcey, CEO, News UK\n\nStephen Hester, CEO, RSA\n\nProducer: Sally Abrahams.",
            "length": "27040000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02plqgt.mp3"
        },
        {
            "title": "Football's Billions",
            "datePublished": "Thu, 19 Mar 2015 21:00:00 +0000",
            "description": "Premier League Chief Executive Richard Scudamore joins Evan Davis and guests to discuss the economics and business of football.\n\nIn light of the recent Premier League TV deal, worth a staggering £5 billion pounds, this week Evan and guests discuss its implications for football both in the UK and in other markets. Whilst the top players can expect even bigger salaries, how will the deal impact on fans and clubs outside the top division? Three top football executives discuss including Premier League Chief Executive, Richard Scudamore. \n\nProducer: Jim Frank.",
            "length": "27072000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02plqgy.mp3"
        },
        {
            "title": "Going Global",
            "datePublished": "Thu, 12 Mar 2015 21:00:00 +0000",
            "description": "Whether you're selling breakfast cereals, criminal tags or excavator buckets, expanding your business overseas can be a game changer. But when's the right time to export and which countries should you target? Evan Davis and guests discuss the ups and downs of trading internationally. They'll share their stories on why it can be easier to sell abroad than at home, how to adapt products for a new market and why doing your homework can ensure that nothing is lost in translation. Top tips on how to make exporting a business boost not a foreign flop. \n\nGuests:\n\nSara Murray, Founder and CEO, Buddi\n\nGiles Turrell, CEO, Weetabix\n\nJacqui Miller, Director, Miller International.",
            "length": "26800000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02plqh0.mp3"
        },
        {
            "title": "Whatever Happened To?",
            "datePublished": "Thu, 05 Mar 2015 21:00:00 +0000",
            "description": "Sock Shop, Golden Wonder and Lehman Brothers: big names that once dominated the high street, the supermarket shelves and the financial world. They faded from view, yet still exist today. What prompted their demise? How did they lose market share? Evan Davis and guests discuss the rise and fall of these iconic companies and explore whether they can ever reach the success of their golden years.\n\nGuests:\n\nVimal Ruia, Managing Director, Sock Shop\n\nPaul Allen, CEO, Tayto\n\nTony Lomas, Chief Administrator, Lehman Brothers in the UK\n\nProducer: Sally Abrahams.",
            "length": "27008000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02plqh3.mp3"
        },
        {
            "title": "Waiting in Line: The Business of Queuing",
            "datePublished": "Thu, 26 Feb 2015 21:00:00 +0000",
            "description": "The science and psychology of the queue. This week Evan and his guests look at how businesses manage queuing. \n\nWe're often told that queuing is one of those quintessential British habits which embodies our sense of fair play: that we should wait our turn. Despite technological innovation. queuing remains one of those unavoidable things we all have to do: be that on-line, waiting for a bus or to pay for our groceries at the check-out. But what does it mean for businesses? How do they go about managing queues and our expectations of those as customers? \n\nProducer: Jim Frank.",
            "length": "26800000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02plqh6.mp3"
        },
        {
            "title": "Inventors",
            "datePublished": "Mon, 23 Feb 2015 10:53:00 +0000",
            "description": "Artificial snow, a plastic hairbrush and a non-spill baby beaker: How do you turn an idea into a successful business? Three entrepreneurs discuss with Evan Davis the process of designing a product and getting it onto the market. How do you finance the project and what's the best way to protect your design from copycats? We'll hear how one inventor risked everything in a legal battle against a company that stole her design. And discover how to create more than 200 types of fake snow. \n\nGuests: \nShaun Pulfrey, Founder and CEO, Tangle Teezer\n\nMandy Haberman, Founder, Haberman Products\n\nDarcey Crownshaw, Founder and MD, Snow Business \n\nProducer: Sally Abrahams.",
            "length": "26976000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02plqhd.mp3"
        },
        {
            "title": "Gold",
            "datePublished": "Thu, 12 Feb 2015 21:00:00 +0000",
            "description": "It's soft, shiny and rare. A symbol of love, of power, of wealth - gold has been prized for thousands of years, its value rises and falls as the economies round it fluctuate. Yet there's only a limited supply of it and demand is high: for jewellery, technology, by central banks and investors. But after more than a decade of rising prices, the value of gold is down. So how to make money from this precious metal? Evan Davis and guests follow its journey from the gold mines of west Africa to the workshops of an east London jewellery maker. What are the risks, responsibilities and rewards for those who mine it, invest in it and manufacture with it?\n\nGuests:\n\nNolan Watson, CEO, Sandstorm Gold\n\nMark Bristow, CEO, Randgold Resources\n\nElizabeth Hunt, Director, Allied Gold\n\nProducer: Sally Abrahams.",
            "length": "26656000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02plqhg.mp3"
        },
        {
            "title": "Trading Places",
            "datePublished": "Thu, 05 Feb 2015 21:00:00 +0000",
            "description": "Naked bath bombs, in-store coffee shops and customer satisfaction charts: Evan Davis and guests discuss some of the secrets to retailing success. Each of them runs of a chain of stores but with hundreds, even thousands of outlets both here and abroad, how do they maintain their brand identity? And what persuades customers to buy their products ahead of their rivals'?\n\nGuests:\nMark Constantine, Founder and Managing Director, Lush cosmetics\n\nDebbie Robinson, Managing Director, Spar UK\n\nRobert Forrester, Founder and CEO, Vertu Motors plc.",
            "length": "26640000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02plqhl.mp3"
        },
        {
            "title": "The Price of Time",
            "datePublished": "Thu, 29 Jan 2015 21:00:00 +0000",
            "description": "How should we price services? By the hour? By results? Or by the difficulty of the task? And what impact does each model have on how businesses are run? In the first of a new series Evan Davis and guests look at the history of how we've priced our time and expertise and why this may be about to change. \n\nGuests : \nChristopher Saul, senior partner, Slaughter & May\nDebbie Klein, UK CEO, The Engine Group\nRussell Quirk, Founder, EMoov.",
            "length": "26640000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02plqhq.mp3"
        },
        {
            "title": "Upside-down Management",
            "datePublished": "Thu, 20 Nov 2014 21:00:00 +0000",
            "description": "What is the role of a business leader? To tell staff what to do or allow them to decide for themselves? One theory about management is that it should turn itself upside-down and permit those closest to the customer to dictate all sorts of business decisions including pricing, marketing and how to deal with complaints. This programme, first broadcast in 2013, won the Wincott Radio Journalism of the Year Award.\n\nGuests\nJohn Timpson, Chairman Timpson Group\nNikki King, Honorary Chair, Isuzu Truck UK\nSir Gerry Robinson, Chairman Moto Hospitality\nProducer : Rosamund Jones.",
            "length": "27072000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02plqhv.mp3"
        },
        {
            "title": "Family Rivals",
            "datePublished": "Thu, 13 Nov 2014 21:00:00 +0000",
            "description": "Taittinger champagne, Clarks shoes, Theakstons beer - three famous and successful family businesses that have passed down through the generations. So what prompted members of those families to leave the original firms and set up rival brands of their own? Producing champagne, making shoes and brewing beer. What's it like to compete with the companies they've known all their lives? And how easy is it to make their mark? \nGuests:\n\nPaul Theakston, Founder and Chairman, Black Sheep Brewery\n\nVirginie Taittinger, Founder, Virginie T\n\nGalahad Clark, Founder and Managing Director, Vivobarefoot\n\nProducer: Sally Abrahams.",
            "length": "27056000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02plqhx.mp3"
        },
        {
            "title": "Live Long and Prosper",
            "datePublished": "Thu, 06 Nov 2014 21:00:00 +0000",
            "description": "Very few companies survive for centuries. Evan Davis hears from a luxury jeweller, a removals firm and a diversified business that makes money from ships, finance and groceries. Between them they have nearly a thousand years of business experience. What strategies have they embarked on to ensure that they live long and prosper? Has their history become a burden or a motivator? And have they sacrificed growth for corporate longevity? \n\nGuests: \nSir Michael Bibby, MD The Bibby Line \nMichael Wainwright, CEO Boodles\nStuart Burnett, Partner Shore Porters Society\n\nProducer:\nRosamund Jones.",
            "length": "26896000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02plqj2.mp3"
        },
        {
            "title": "Wearable Technology",
            "datePublished": "Thu, 30 Oct 2014 21:00:00 +0000",
            "description": "From smartglasses to smartwatches, tech companies like Apple, Google and Samsung are investing big money in technology that you can wear. They're designed to keep us eternally connected, fully fit and super smart. But will they go mainstream or are they still the preserve of the gadget geeks? Evan Davis and guests discuss how fitness bands that measure how far you walk and how deeply you sleep could transform our healthcare. And hear about the intelligent fabric that's set to revolutionise the way US and British soldiers are kitted out. \n\nGuests:\n\nAndy Griffiths, President, Samsung UK and Ireland \nAsha Peta Thompson, Co-founder, Intelligent Textiles\nJoss Langford, Technical Director, Activinsights\n\nProducer: Sally Abrahams.",
            "length": "27040000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02plqj4.mp3"
        },
        {
            "title": "Flash Sales",
            "datePublished": "Thu, 23 Oct 2014 20:00:00 +0000",
            "description": "Flash sale companies are growing fast. Evan Davis and guests discuss how this new retail sector is changing the way we shop. How does the business model work? Just how low can the prices go? And are these internet discounters a help or a hindrance for luxury brands?\n\nGuests :\nVictoria Walton, co-founder Sportpursuit\nJamie Jackson, executive vice-chairman MySale Group\nIlan Benhaim, co-founder Vente-Privee\n\nProducer : Rosamund Jones.",
            "length": "26912000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02plqj9.mp3"
        },
        {
            "title": "TripAdvisor Etc",
            "datePublished": "Thu, 16 Oct 2014 20:00:00 +0000",
            "description": "Online postings about hotels, restaurants, hairdressers, electricians: How much can you trust the views of a total stranger when it comes to deciding what to buy, where to go and whose skills and services to employ? How do review sites monitor their online ratings and ensure they're genuine? Evan Davis and guests discuss the power of user-generated reviews that can make or break a business. What can firms do to limit the damage of a bad review and how can they maximise a positive review? \n\nGuests:\n\nStephen Kaufer, President and CEO, TripAdvisor\n\nColleen Curtis, Vice President, European Marketing, Yelp\n\nKevin Byrne, Founder and CEO, Checkatrade\n\nProducer: Sally Abrahams.",
            "length": "26960000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02plqjc.mp3"
        },
        {
            "title": "Celebrities and Fans",
            "datePublished": "Thu, 09 Oct 2014 20:00:00 +0000",
            "description": "Social advertising: Evan Davis and guests discuss the growing power of celebrities, the rise of the money-making super-fans who \"like\" their products and the vloggers with consumer clout. How effective are these new social campaigns and how will they change the advertising industry?\n\nGuests: Edwina Dunn, CEO Starcount; Dominic Burch, senior director marketing innovation and new revenue Asda; Robin Grant, co-founder We Are Social.\n\nProducer: Rosamund Jones.",
            "length": "26944000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02plqjj.mp3"
        },
        {
            "title": "The Saviour Returns",
            "datePublished": "Thu, 02 Oct 2014 20:00:00 +0000",
            "description": "The best person for the job? Evan Davis hears from four bosses who took back control of the companies they had once founded. Why did they leave and what events made them return? From boardroom coups to corporate collapses, entrepreneurs explain how they took the helm - for the second time - of the businesses they knew so well. What had changed while they were away? And what were the very first decisions they made when they walked back through the doors?\n\nGuests: Steve Morgan, founder, Redrow; Louise O'Sullivan, founder, Anam Technologies; Nick and Kath Whitworth, co-founders, Celtic & Co.\n\nProducer: Sally Abrahams.",
            "length": "26800000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02plqjl.mp3"
        },
        {
            "title": "Recalls",
            "datePublished": "Thu, 24 Jul 2014 20:00:00 +0000",
            "description": "Faulty children's beds, mislabelled horsemeat burgers and exploding dishwashers are among the products recalled by companies in the UK to protect the health and safety of consumers. Evan Davis and guests discuss the process for recalling defective items and find out how quickly manufacturers and distributors must act. What are the logistics of getting back hundreds of thousands of products from consumers? And what impact does a recall have on a company's reputation? Does it reassure or unnerve customers?\n\nGuests:\n\nGerard Bos, Customer Relations Manager for UK and Ireland, Ikea\n\nChris Dee, Chief Operating Officer, E.H Booth\n\nVince Shiers, Managing Director, RQA Group\n\nProducer: Sally Abrahams.",
            "length": "26944000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02plqjn.mp3"
        },
        {
            "title": "Location, Disruption, Location",
            "datePublished": "Thu, 17 Jul 2014 20:00:00 +0000",
            "description": "Civil war in Sierra Leone, political unrest in Ukraine, the Japanese tsunami and Hurricane Sandy on the east coast of the US - three guests tell Evan Davis how they led businesses through periods of unexpected and extended turmoil. \n\nGuests : \nPeter Kaye, Director of Business Development, Pilgrims Group\nBryan Disher, Ukraine Country Manager, PWC \nMary Bahsoon, Co-owner Bennimix \n\nProducer : Rosamund Jones.",
            "length": "27072000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02plqjs.mp3"
        },
        {
            "title": "Second-Hand Trade",
            "datePublished": "Thu, 10 Jul 2014 20:00:00 +0000",
            "description": "Making money from old phones, engines and plastic bottles is the topic for Evan Davis and guests. \nHow do you ensure that you collect what others throw away? How much profit is there really to be had from creating new from old? And why aren't milk bottle tops quite the colour they once were? \n\nGuests \nCharlo Carabott, co-founder & CEO Mazuma Mobile\nMatt Bulley, managing director Caterpillar Reman Europe\nChris Dow, Founder & CEO Closed Loop Recycling \n\nProducer : Rosamund Jones.",
            "length": "26720000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02plqjv.mp3"
        },
        {
            "title": "Mental Health",
            "datePublished": "Thu, 03 Jul 2014 20:00:00 +0000",
            "description": "Would you tell your boss you had depression? In The Bottom Line this week, Evan Davis hears from three successful business people who talk openly about what it's like to experience severe mental illness whilst running their companies. They'll explain the risks and rewards of going public about mental ill health problems: the reaction from investors and the impact on staff. And we'll hear why being open about mental illness can lead to a happier, healthier workplace.\n\nGuests:\n\nLord Stevenson of Coddenham, entrepreneur and former Chairman of HBOS and Pearson;\nAndrea Woodside, Founder, Minding Work Limited;\nand Charlie Mowat, Managing Director, The Clean Space\n\nProducer: Sally Abrahams.",
            "length": "26880000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02plqjy.mp3"
        },
        {
            "title": "Single Product Companies",
            "datePublished": "Thu, 26 Jun 2014 20:00:00 +0000",
            "description": "Can you conquer the world by selling only one product? Many companies start small, focusing their energies on a single item, with plans to expand into other areas once the business takes off. But not everyone wants to diversify. Some prefer to do one thing and do it well, rather than risk diluting the brand and perhaps also the quality of the goods. In this edition of The Bottom Line, Evan Davis talks to three companies that have stuck with the core product that made them a success in the first place. They'll discuss the benefits of keeping focused, the challenges of staying ahead of the game and explore the perils of relying on just one source of income. Does it make good business sense to put all your eggs in one basket?\n\nGuests:\n\nVince Gunn, Managing Director, Crocs Europe\n\nCarolyn Komminsk, Head of Creative, Maclaren\n\nBill Noble, Managing Director, WD40 Company\n\nProducer: Sally Abrahams.",
            "length": "26592000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02plqk3.mp3"
        },
        {
            "title": "The Muslim Pound",
            "datePublished": "Thu, 19 Jun 2014 20:00:00 +0000",
            "description": "How big is the market for halal - not just food, but holidays, fashion and music too? Muslim consumers - and how best to serve them - are the topics this week. Evan Davis talks to entrepreneurs who think they know the answer and asks how much can established companies learn from them.\n\nGuests :\n\nShelina Janmohamed, Ogilvy Noor\nElnur Seyidli, HalalBooking.com\nShazia Saleem, ieat foods\n\nProducer : Rosamund Jones.",
            "length": "26800000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02plqk5.mp3"
        },
        {
            "title": "Sex and Drugs",
            "datePublished": "Thu, 12 Jun 2014 20:00:00 +0000",
            "description": "Making money from products with a controversial image is the topic for Evan Davis and his guests who represent companies selling drugs and sex toys. These companies are testing our morals and the regulations set up to protect them. So how do you market products that many people disapprove of? And how do you manage the social and business opprobrium you encounter?\n\nGuests :\nJean Rasbridge, founder ECigaretteDirect.co.uk\nAndy Williams, co-founder Medicine Man Denver\nNeal Slateford, co-founder LoveHoney\n\nProducer : Rosamund Jones.",
            "length": "26816000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02plqk7.mp3"
        },
        {
            "title": "Bitcoin",
            "datePublished": "Thu, 05 Jun 2014 20:00:00 +0000",
            "description": "The new economy based on bitcoins, the computer-generated crypto-currency, is the subject for discussion. What can you buy with them and as the market fluctuates wildly, can investors hold their nerve? The programme will look at how the bitcoin craze began and whether the world really does need another currency. Evan Davis's guests are from new companies hoping to cash in - one trades bitcoins, another stores them and the third enables you to spend them online.\n\nContributors :\n\nMarc Warne, Bittylicious\nNicolas Cary, Blockchain\nMoe Levin, Bitpay\n\nProducer : Rosamund Jones.",
            "length": "26944000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02plqk9.mp3"
        },
        {
            "title": "Cyber Security",
            "datePublished": "Sat, 31 May 2014 17:00:00 +0000",
            "description": "Can you keep business safe from hackers? Many companies now feel besieged by constant attacks and few can claim not to have been targeted. In the first of a new series of the award-winning The Bottom Line Evan Davis and guests discuss the anatomy of a cyber attack - where the threats are coming from and how best to respond. And they'll ask - should businesses be more honest about the security breaches they've faced?\n\nGuests\nRichard Knowlton, Group Corporate Security Director, Vodafone\nRashmi Knowles, Chief Security Architect, RSA\nSeth Berman, Executive MD, Stroz Friedberg\n\nProducer : Sally Abrahams.",
            "length": "26992000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02plqkf.mp3"
        },
        {
            "title": "Serving the Super-Rich",
            "datePublished": "Thu, 27 Mar 2014 21:00:00 +0000",
            "description": "Serving the super-rich: what do the seriously wealthy do with their money? How do they preserve or spend their multi-million or even billion pound fortunes? And who is helping them manage those assets? With more billionaires in the world than ever before, working for the very rich is a growth industry. Whether finding staff for their superyacht or helping them give away the money, there's a raft of businesses ready to serve the ultra high net worth individual. Evan Davis talks to three firms whose job is to serve the wealthy elite.\n\nGuests:\n\nRichard Wilson, CEO, Billionaire Family Office\n\nKaren Clark, Director and Head of Private Clients, SandAire\n\nLucy Challenger, Manager, Bespoke Bureau\n\nProducer: Sally Abrahams.",
            "length": "26560000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02plqkh.mp3"
        },
        {
            "title": "Energy Upstarts",
            "datePublished": "Thu, 20 Mar 2014 21:00:00 +0000",
            "description": "Turning up the heat: the new energy companies breaking into a market dominated by big established firms. Evan Davis meets two small entrants to the sector to find out how they're gaining market share. Is the strategy to compete on price, customer service or green credentials? He'll discuss the role of the price comparison websites in encouraging customers to switch providers and hear how some smaller companies are cutting gas and electricity bills when their bigger rivals aren't.\n\nGuests:\n\nDale Vince, Founder and CEO, Ecotricity\n\nStephen Fitzpatrick, Founder and Managing Director, Ovo Energy\n\nAnn Robinson, Director of Consumer Policy at uSwitch.com\n\nProducer: Sally Abrahams.",
            "length": "26672000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02plqkn.mp3"
        },
        {
            "title": "Transformation",
            "datePublished": "Thu, 13 Mar 2014 21:00:00 +0000",
            "description": "Corporate turnaround and transformational tales. Evan Davis and guests discuss how companies fail, struggle and find their way again.\n\nGuests:\n\nBruno Cercley, CEO of Rossignol Group\nHarriet Green OBE, CEO of Thomas Cook Group\nMartyn Gibbs, CEO of Game Retail Ltd\n\nProducer: Kent DePinto.",
            "length": "26944000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02plqkv.mp3"
        },
        {
            "title": "Chocolate",
            "datePublished": "Thu, 06 Mar 2014 21:00:00 +0000",
            "description": "Chocolate is a big business as well as a delicious indulgence. Evan Davis and guests discuss how this global industry is tackling the pressures of rising food prices, speculation and climate change.\n\nGuests:\n\nJonathan Horrell, Director of Global Sustainability of Mondelez International\nSophi Tranchell, Managing Director of Divine Chocolate\nKojo Amoo-Gottfried, Country Director of Cargill Ghana\n\nProducer: Kent DePinto.",
            "length": "26944000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02plqky.mp3"
        },
        {
            "title": "Self-Improvement",
            "datePublished": "Thu, 27 Feb 2014 21:00:00 +0000",
            "description": "Self-improvement: If you want to look better, feel better, perform better, there's no shortage of help available. Whether it's cosmetic surgery for the perfect body, fitness programmes to boost self-esteem, or self-help books to improve the mind, there's plenty of choice. But do they promise the world and fail to deliver - or give you the strength to achieve the personal growth you desire? Evan Davis and guests discuss the industry of making your life better.\n\nGuests: \n\nJon Congdon, President and Co-Founder, Beachbody.com \n\nCarole Tonkinson, Publisher, Harper NonFiction\n\nJohn Ryan, Founder and Chairman, Make Yourself Amazing\n\n\nProducer: Sally Abrahams.",
            "length": "26688000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02plql1.mp3"
        },
        {
            "title": "Life After CEO",
            "datePublished": "Thu, 20 Feb 2014 21:00:00 +0000",
            "description": "Business leaders spend their lives climbing the corporate ladder, so what happens when it is time to step off? Evan Davis and guests discuss life after CEO.\n\nGuests:\nLord Browne of Madingley, former Chief Executive of BP\nKate Wilson, former MD of Scholastic UK, Managing Director of Nosy Crow\nRobert Polet, former CEO of Gucci Group\n\nProducer: Kent DePinto.",
            "length": "26992000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02plql5.mp3"
        },
        {
            "title": "TV Formats",
            "datePublished": "Thu, 13 Feb 2014 21:00:00 +0000",
            "description": "Successful TV formats like Big Brother, Pop Idol, X-Factor and Who Wants To Be A Millionaire are sold and broadcast all round the world, netting their creators billions of pounds. But how can you protect such a valuable asset? And are too many copycat versions saturating the market and crushing original ideas? Evan Davis finds out from those at the top of the lucrative global industry of TV formats.\n\nGuests:\nCharlie Parsons, Creator of Survivor and CEO, Castaway Television Productions\nLouise Pedersen, Managing Director, all3media international\nRicardo Pereira, TV Globo Director for Europe\n\nProducer: Sally Abrahams.",
            "length": "26896000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02plql9.mp3"
        },
        {
            "title": "MBAs",
            "datePublished": "Thu, 06 Feb 2014 21:00:00 +0000",
            "description": "Business school or school of life? An MBA from a top business school is what defines many of today's high powered CEO's - but is the qualification worth the cost or are would-be entrepreneurs better off learning business acumen in the real world? Evan Davis debates with guests.\n\nGuests:\nColin Drummond, Chairman of Viridor and Harvard MBA graduate\nKim Winser, former CEO of Pringle, now CEO of Winser London\nGlenn Sykes, Associate Dean of The University of Chicago Booth School of Business, London\n\nProducer: Kent DePinto.",
            "length": "26736000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02plqlf.mp3"
        },
        {
            "title": "The Sharing Economy",
            "datePublished": "Thu, 30 Jan 2014 21:00:00 +0000",
            "description": "The \"sharing\" economy is the topic of discussion for Evan Davis & his guests in the first of a new series of The Bottom Line. The market is built around renting out your possessions to strangers and entrepreneurs have piled in to enable us to share our homes, cars, bikes, clothes, tools and much more besides. At its heart is the idea that business works better if it collaborates, rather than competes, with other companies. How disruptive might these innovative enterprises prove to be? How much profit can they make (and is that the point anyway?).\n\nGuests :\n\nEven Heggernes, UK & Ireland Country Manager, Airbnb\nAli Clabburn, Founder, Liftshare\nFiona Disegni, Founder, Rentez-Vous\n\nProducer : Rosamund Jones.",
            "length": "26896000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02plqlk.mp3"
        },
        {
            "title": "Design",
            "datePublished": "Thu, 21 Nov 2013 21:00:00 +0000",
            "description": "Decorating your home is big business - in the UK and around the world. In China and India the home decor market is evolving fast - but will the result be a global homogenous style? Who sets the trends? And what do you do if your products lose their fashionable edge? Evan Davis and guests discuss the volatile world of design.\n\nGuests:\nKelly Hoppen, founder Kelly Hoppen Interiors\nAndrew Graham, CEO Graham and Brown\nLois Jacobs, Global CEO Fitch\n\nProducer: Rosamund Jones.",
            "length": "26592000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02plqln.mp3"
        },
        {
            "title": "Shipping",
            "datePublished": "Thu, 14 Nov 2013 21:00:00 +0000",
            "description": "It's the lifeblood of the world's economy, moving most of our imports and exports and around the globe. But shipping is changing: vessels and ports are getting bigger and competition for trade is coming from the Far East.\n\nEvan Davis and guests from the world of shipping discuss how ports are run and how the shipping business manages the risk of accidents and piracy.\n\nGuests:\n\nJames Cooper - CEO of Associated British Ports. , a private company which owns and runs 21 ports in the UK.\nKenneth MacLeod - Chairman of Stena Line UK and President of the UK Chamber of Shipping.\nRupert Atkin - CEO of Talbot Underwriting and Chairman of the Lloyd's Market Association.\n\nProducer - Smita Patel.",
            "length": "26528000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02plqlt.mp3"
        },
        {
            "title": "Planning for the Future",
            "datePublished": "Thu, 07 Nov 2013 21:00:00 +0000",
            "description": "Infrastructure projects can take decades to complete and are meant to last for generations. Planning for new rail networks, roads, bridges, airports - in the UK and overseas - all require assumptions and predictions about the future. What shape will the country's economy be in? Will the population grow or shrink? How might travel patterns change? And will the political regimes support the project over the years? \n\nEvan Davis and guests discuss the problems and pitfalls of planning for the long view.\n\nGuests: \nAlison Munro, CEO HS2\nTushar Prabhu, co-owner, Pell Frischmann \nRichard Deakin, CEO NATS \n\nProducer: Rosamund Jones.",
            "length": "26912000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02plqly.mp3"
        },
        {
            "title": "Deals",
            "datePublished": "Thu, 31 Oct 2013 21:00:00 +0000",
            "description": "When the world economy is booming, many corporate bosses love nothing more than buying each other's companies. Takeovers, mergers and acquisitions soar. But evidence tends to suggest that many of the arrangements are a waste of time, so why are deals so seductive? On the Bottom Line, Evan Davis and guests discuss why deals go right and what happens when they go wrong.\nGuests:\nSir George Buckley - former CEO, 3M and currently Chairman Designate of the engineering group Smiths\nSir Michael Rake - Chairman of BT Group and Deputy Chairman of Barclays\nJuergen Maier - MD of Siemens UK and Ireland\nProducer: Smita Patel.",
            "length": "26688000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02plqm2.mp3"
        },
        {
            "title": "Who's the Boss?",
            "datePublished": "Thu, 24 Oct 2013 20:00:00 +0000",
            "description": "What is the role of a business leader? To tell staff what to do or allow them to decide for themselves? One theory about management is that it should turn itself upside-down and permit those closest to the customer to dictate all sorts of business decisions including pricing, marketing and how to deal with complaints. Discussing these issues with Evan Davis are:\n\nJohn Timpson, Chairman Timpson Group\nNikki King, CEO Isuzu Truck UK\nSir Gerry Robinson, Chairman Moto Hospitality\n\nProducer : Rosamund Jones.",
            "length": "26928000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02plqm8.mp3"
        },
        {
            "title": "Digital Marketplaces",
            "datePublished": "Thu, 17 Oct 2013 20:00:00 +0000",
            "description": "Where can you find a hand-stitched crochet blanket, the latest Lady Gaga video or sell your old sofa? Trading online makes it easier than ever to find a marketplace and gives the consumer a different and faster way to shop and browse. On The Bottom Line Evan Davis discusses the issues with:Nic Jones, Senior Vice President International, VEVO;Nicole Vanderbilt, MD Etsy; andFrançois Coumau, General Manager for Continental Europe, eBay. Producer : Smita Patel.",
            "length": "26736000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02plqmj.mp3"
        },
        {
            "title": "The Business of War",
            "datePublished": "Thu, 10 Oct 2013 20:00:00 +0000",
            "description": "Where there is war and fear there's money to be made from protection. In The Bottom Line, Evan Davis talks to ex-army leaders turned businessmen about the world of private defence and security work.Why are governments employing private contractors to do work previously done by the armed forces? How do those businesses maintain their reputations in such a controversial sector?Guests:Major General Graham Binns CBE, DSO, MC, a former British army officer, now CEO of Aegis Defence Services Limited.Major General Andrew Pringle, CB, CBE, President of KBR UK and a former British army officer.Gabriel Carter, Managing Director of LPD Risk Management.Producer: Smita Patel.",
            "length": "26832000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02plqmm.mp3"
        },
        {
            "title": "Big Data",
            "datePublished": "Thu, 03 Oct 2013 20:00:00 +0000",
            "description": "Big data has become big business as improvements in computer memory storage have made it possible to keep and analyse digital data on a scale previously unknown. Evan Davis and guests discuss how the ability to store information about us has created new industries and transformed others. \n\nPresenter: Evan Davis\n\nGuests: Dave Coplin, Chief Envisioning Officer and Director of Search, Microsoft UK; Konrad Feldman, CEO Quantcast; Lawrence Jones, Founder UK Fast.",
            "length": "26944000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02plqmv.mp3"
        },
        {
            "title": "Investor Relations",
            "datePublished": "Thu, 25 Jul 2013 20:00:00 +0000",
            "description": "The power of investors and their role in changing how business functions and is run is the discussion for Evan Davis and his guests. What is it like to be voted off the board by your shareholders? And is investor activism here to stay? And how should a company boss best manage the owners of the company?\n\nGuests\nAlison Carnwath, chair Land Securities\nHelena Morrissey, CEO Newton Asset Management\nNigel Wilson, Group CEO Legal & General\n\nProducers: Rosamund Jones/Lucy Proctor.",
            "length": "26960000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02plqn9.mp3"
        },
        {
            "title": "Water",
            "datePublished": "Thu, 18 Jul 2013 20:00:00 +0000",
            "description": "Water is the world's most precious resource. It's also big business. As climate changes and populations shift, getting water where it needs to be is a huge global challenge. And that's without the added problem of leakage. And how much should consumers pay for something that none of us can live without?\nEvan Davis and guests discuss an industry which has changed almost beyond recognition in just a few decades - from state-owned water providers to international business players.\nGuests:\nPeter Simpson, CEO Anglian Water\nBryan Harvey, Vice President CH2M HILL\nOlivier Bret, CEO Veolia Water UK\nProducer : Rosamund Jones.",
            "length": "26928000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02plqnf.mp3"
        },
        {
            "title": "Futurology for Business",
            "datePublished": "Thu, 11 Jul 2013 20:00:00 +0000",
            "description": "Predicting the future is a skill that can earn investors and businesses a fortune - but get it wrong and disaster looms. In sectors like energy and technology planning decades ahead is an absolute necessity - but how can CEOs know what the world will look like in 2030 and how do they persuade shareholders and staff to come along for the ride? Evan Davis meets three business leaders who are placing massive bets on the future of farming, biomass fuel and the creation of a hyper-connected global society and finds out about timing, balancing risk and holding your nerve.\n\nAlso, the view from America, Sweden and the UK on corporate tax is discussed.\n\n\nGuests:\nDorothy Thompson, CEO, Drax\nHans Vestberg, CEO, Ericsson\nJim Rogers, investor\n\nProducer:\nLucy Proctor.",
            "length": "26880000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02plqnr.mp3"
        },
        {
            "title": "Managing in a Crisis",
            "datePublished": "Thu, 04 Jul 2013 20:00:00 +0000",
            "description": "What do you do when it all goes wrong? How to manage corporations in times of crisis is the subject under discussion by Evan Davis and his guests.\n\nBusiness leaders should expect the ride sometimes to be bumpy - but what is it reasonable to expect? And what is the best way to proceed when the truly unexpected happens?\n\nGuests\nMichael Woodford, former chief executive & president, Olympus Corporation\nAnn Cairns, President International Markets, Mastercard\nEddie Bensilum, Director, Regester Larkin\n\nProducer : Rosamund Jones.",
            "length": "26768000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02plqp0.mp3"
        },
        {
            "title": "Start-ups",
            "datePublished": "Thu, 27 Jun 2013 20:00:00 +0000",
            "description": "Entrepreneurs discuss how much money you need to start a business - and where to get it from - with Evan Davis.\n\nWhy do some start-ups require millions and others just a few hundred pounds? And what are the benefits and pitfalls of finding investors on the web? It's called crowd-funding and many consider it to be the next big thing in venture capital.\n\nGuests:\nMark Popkiewicz, founder, MirriAd\nJulie Deane, founder, The Cambridge Satchel Company\nJonathan Medved, venture capitalist and founder, Our Crowd\nProducer : Rosamund Jones.",
            "length": "26880000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02plqp7.mp3"
        },
        {
            "title": "Food",
            "datePublished": "Thu, 20 Jun 2013 20:00:00 +0000",
            "description": "The food industry is increasingly in the spotlight as consumers and government worry about obesity, sustainability and safety.\n\nEvan Davis finds out from three very different food companies about how their supply chains work and how much oversight any company leader can have. Guests discuss how to create an efficient and cost effective system that delivers on quality and safety. Do consumers elsewhere in Europe and the world demand the same level of locally-sourced credentials as the British now do and are these ideals worthwhile?\n\nGuests:\nAlastair Storey, CEO, WSH\nPerween Warsi, CEO, S&A Foods\nGavin Darby, CEO, Premier Foods\n\nProducer: Lucy Proctor.",
            "length": "26816000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02plqpd.mp3"
        },
        {
            "title": "Travel",
            "datePublished": "Thu, 13 Jun 2013 20:00:00 +0000",
            "description": "Travel companies have recently had to weather the storms of recession for their customers and major upheaval at popular holiday destinations around the world.\n\nEvan Davis finds out how airlines and tour companies plan for their seasonal business in light of economic crisis in Greece and political unrest in Egypt and North Africa - getting it wrong could lead to financial disaster. And guests will discuss the future for Greece, where tourism is seen as the biggest hope for reviving the economy.\n\nGuests:\nPeter Long, CEO TUI Travel\nCarolyn McCall, CEO Easyjet\nAndreas Andreadis, CEO SANI Resort\n\nProducer: Lucy Proctor.",
            "length": "26896000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02plqpj.mp3"
        },
        {
            "title": "Recruitment",
            "datePublished": "Thu, 06 Jun 2013 20:00:00 +0000",
            "description": "Recruitment companies discuss the marks left by recession on their businesses and the employment market.\n\nCompanies in the eye of the storm when the economy first collapsed have had to adapt to stay in business. Evan Davis finds out the survival strategies of three recruiters in very different markets - from board level headhunting to finding seasonal temps and mid-level professionals.\n\nGuests :\nVirginia Bottomley, Odgers Berndtson\nMatthew Sanders, CEO de Poel\nIan Temple, chair Hydrogen Group\n\nProducer : Rosamund Jones.",
            "length": "26736000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02plqpr.mp3"
        },
        {
            "title": "The App Industry",
            "datePublished": "Thu, 30 May 2013 20:00:00 +0000",
            "description": "Evan Davis meets \"appreneurs\" trying to make money in a marketplace where traditional business rules do not apply. Becoming an appreneur is easy. All you need is a computer and a couple of hundred pounds. And an idea of course. No surprise perhaps that thousands of new apps are created every week to serve the ever growing smart phone and tablet computer market. But what happens next? How do you make a living if your product is free? And if you sell your app, how high can you go when buyers expect a lot for very little? And how do you market to customers without knowing who they are?\n\nGuests :\nBarry Meade, co-founder Fireproof Studios\nProfessor Anthony Steed, co-founder Chirp\nMax Whitby, co-founder & CEO Touch Press\n\n\nProducer : Rosamund Jones.",
            "length": "26656000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02plqpw.mp3"
        },
        {
            "title": "The Education Business",
            "datePublished": "Thu, 28 Mar 2013 21:00:00 +0000",
            "description": "Education and how to make a profit from it is the focus for Evan and his three guests this week - each of them business leaders in the learning sector.\n\nFrom low-cost private schools in Ghana to no-frills law courses and a University of Liverpool campus in China, our guests will share their business lessons on how to build a reputation and how to price a good education. They'll also talk about the challenges of taking on traditional, public institutions as well as the technological advances that look set to transform learning over the next 20 years.\n\nAs usual, The Bottom Line cuts through confusion and spin to present a clearer view of the business world.\n\nGuests this week are Carl Lygo, Chief executive of BPP; Professor Sir Howard Newby, Vice Chancellor of the University of Liverpool and Professor James Tooley, chairman of Omega Schools.\n\nSeries producer: Helen Grady\nSeries editor: Innes Bowen\nSeries researcher: Ben Carter.",
            "length": "27040000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02plqpz.mp3"
        },
        {
            "title": "21/03/2013",
            "datePublished": "Thu, 21 Mar 2013 21:00:00 +0000",
            "description": "The view from the top of business. Presented by Evan Davis, The Bottom Line cuts through confusion, statistics and spin to present a clearer view of the business world, through discussion with people running leading and emerging companies.\n\nIt's said that the best way to make a small fortune in the wine business is to start with a large one. Evan Davis and his guests explore just how profitable selling crushed grapes really is. How do they convince consumers they are offering quality and value?\n\nJoining Evan in the studio are Graham Sumeray, CEO Fine + Rare; Dan Jago, Category Director (Beers, Wines and Spirits) at Tesco's; Alok Mathur, co-founder and director Soul Tree Wines.\n\nEditor: Innes Bowen.",
            "length": "26992000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02plqq5.mp3"
        },
        {
            "title": "Turnarounds",
            "datePublished": "Thu, 14 Mar 2013 21:00:00 +0000",
            "description": "Evan Davis asks his guests what it takes to rescue a sinking company.",
            "length": "26576000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02plqqb.mp3"
        },
        {
            "title": "Doing Business with Governments",
            "datePublished": "Thu, 07 Mar 2013 21:00:00 +0000",
            "description": "The view from the top of business. Presented by Evan Davis, The Bottom Line cuts through confusion, and spin to present a clearer view of the business world, through discussion with people running leading and emerging companies.\n\n\n\nFrom huge infrastructure projects to supplying civil servants with paperclips, there's big money to be made from public sector contracts. Evan Davis meets three business leaders with experience of bidding for - and securing - government contracts and finds out what it's like doing business with the state. How easy is it for smaller companies to get a slice of the public sector pie? And are we - the ultimate customers - really getting a good deal?",
            "length": "26896000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02plqqh.mp3"
        },
        {
            "title": "Retail",
            "datePublished": "Thu, 28 Feb 2013 21:00:00 +0000",
            "description": "The view from the top of business. Presented by Evan Davis, The Bottom Line cuts through confusion, statistics and spin to present a clearer view of the business world, through discussion with people running leading and emerging companies.\n\nYou go to a shopping centre and you find an ice rink. Or you go to a bookstore for a glass of wine. So is this the new world of retail? Evan Davis and his panel of top business brains explore what's in store for physical shopping. They also swap thoughts on what makes a good shop assistant.\n\nJoining Evan in the studio are Sir Stuart Rose, former Chief Executive of Marks & Spencer and soon to take over as Chairman of online grocery retailer Ocado; Berndt Hauptkorn, Chief Executive of the European arm of Japanese clothing chain Uniqlo; Andy Street, Managing Director of department store chain John Lewis.\n\nProducer: Ben Crighton\nEditor: Innes Bowen.",
            "length": "26848000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02plqqp.mp3"
        },
        {
            "title": "Business in Africa",
            "datePublished": "Thu, 21 Feb 2013 21:00:00 +0000",
            "description": "The view from the top of business. Presented by Evan Davis, The Bottom Line cuts through confusion and spin to present a clearer view of the business world through discussion with people running leading and emerging companies.\n\n\n\nThis week, Evan's three guests discuss the challenges of doing business in and out of Africa. It consists of 54 countries and has more than a billion people but the continent was a sleeping giant for decades. Now it's woken up and could it be on the verge of becoming the economic powerhouse of the 21st Century?\n\n\n\nEvan is joined in the studio by Andrew Rugasira, CEO of the Ugandan coffee company Good African Coffee; Herman Chinery-Hesse, co-founder of the Ghanaian software company SOFTtribe and Rupert Soames, CEO of the temporary power specialists Aggreko.",
            "length": "26672000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02plqqv.mp3"
        },
        {
            "title": "Alternative Finance",
            "datePublished": "Thu, 14 Feb 2013 21:00:00 +0000",
            "description": "The view from the top of business. Presented by Evan Davis, The Bottom Line cuts through confusion and spin to present a clearer view of the business world through discussion with people running leading and emerging companies. This week, Evan meets three pioneers of alternative finance and asks - can they beat the banks at their own game? Giles Andrews is CEO of Zopa, the peer to peer lending website; Anil Stocker is co-founder of Market Invoice , an online finance provider that allows companies to turn invoices into working capital; and Michael Joseph is director of mobile money at Vodafone and former CEO of the Kenyan mobile phone provider Safaricom, where he launched the revolutionary mobile money transfer service, M-Pesa.",
            "length": "26720000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02plqqy.mp3"
        },
        {
            "title": "Books",
            "datePublished": "Thu, 07 Feb 2013 21:00:00 +0000",
            "description": "The view from the top of business. Presented by Evan Davis, The Bottom Line cuts through confusion, statistics and spin to present a clearer view of the business world, through discussion with people running leading and emerging companies.\n\nLike the music industry before it, the print book industry has been turned upside down up by the digital revolution. As sales of ebooks continue to grow, bookshop sales are down from a peak in 2007. So what does the future for hold for the bricks and mortar bookstore? Will physical books become a thing of the past? And what role will traditional players like publishers, agents and retailers play in this brave new world? Evan Davis and guests examine what the landscape might look like once the dust settles.\n\nJoining Evan in the studio are Jonny Geller, literary agent and joint CEO Curtis Brown; Victoria Barnsley, CEO of publisher HarperCollins UK & International; Michael Tamblyn, Chief Content Officer at Toronto-based ebook retailer Kobo.\n\nProducer: Ben Crighton\nEditor: Innes Bowen.",
            "length": "26784000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02plqr1.mp3"
        },
        {
            "title": "Gambling",
            "datePublished": "Thu, 31 Jan 2013 21:00:00 +0000",
            "description": "The view from the top of business. Presented by Evan Davis, The Bottom Line cuts through confusion and spin to present a clearer view of the business world through discussion with people running leading and emerging companies.\n\nThis week, we hear from three people in the avant garde of the global gambling industry, which is said to be worth $417 billion. With smart phone and tablet technology driving a revolution in the way that people gamble, will old-fashioned betting shops and bingo halls survive? And can gambling companies really keep expanding despite recession, competition from the black market and prohibition in emerging economies?\n\nEvan is joined in the studio by Norbert Teufelberger, CEO of the online gaming company bwin.party; Melissa Blau, director of the consultancy iGaming Capital; Juergen Reutter, Director of Mobile at the bookmaker William Hill.\n\nProducer: Helen Grady.",
            "length": "26720000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02plqr5.mp3"
        },
        {
            "title": "Family Firms",
            "datePublished": "Thu, 24 Jan 2013 21:00:00 +0000",
            "description": "The view from the top of business. Presented by Evan Davis, The Bottom Line cuts through confusion, statistics and spin to present a clearer view of the business world, through discussion with people running leading and emerging companies.\n\nFamily businesses are the backbone of economies all around the world - indeed, the majority of firms are family-controlled, from the millions of modest firms, to commercial giants such as Ford and Wal-Mart. And yet less than a third survive to the second generation. Evan Davis and guests explore the possibilities and pitfalls of the family ownership model.\n\nIn the studio are Ian Maclean of luxury knitwear company John Smedley; Julie White of drilling and demolition firm D-Drill; Tim Wates of construction and development group Wates.\n\nProducer: Ben Crighton\nEditor: Innes Bowen.",
            "length": "26752000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02plqr8.mp3"
        },
        {
            "title": "Planet New",
            "datePublished": "Thu, 15 Nov 2012 20:30:00 +0000",
            "description": "The view from the top of business. Presented by Evan Davis, The Bottom Line cuts through confusion, statistics and spin to present a clearer view of the business world, through discussion with people running leading and emerging companies.\n\nThere are many arguments about how to solve the world's economic problems, to increase employment and achieve economic growth. But if there's one solution that most will agree on it's that we need more new products or services, which drive capitalism and make us richer. Evan's guests this week discuss the importance of innovation for the global economy and the impediments to this kind of creativity. They also swap thoughts on the 'pivot' - when to change your mind in business. \n\nJoining Evan in the studio are Suranga Chandratillake, founder of video and audio search engine Blinkx; Simon Woodroffe, founder of YO! Company; Olaf Swantee, chief executive of mobile phone operator EE.\n\nProducer: Ben Crighton\nEditor: Innes Bowen.",
            "length": "26992000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02plqrd.mp3"
        },
        {
            "title": "Financial Services",
            "datePublished": "Thu, 08 Nov 2012 21:00:00 +0000",
            "description": "The view from the top of business. Presented by Evan Davis, The Bottom Line cuts through confusion, statistics and spin to present a clearer view of the business world, through discussion with people running leading and emerging companies.\n\nEvan and his guests discuss financial services. They have the power to enrich an economy - or to ruin it completely. But what kind of makeover do they need to get them fit for the 21st century? Should the industry be more innovative and clever - or just a bit more old-fashioned and simple?\n\nJoining Evan in the studio are former fund manager David Pitt-Watson; Martin Gilbert, chief executive of Aberdeen Asset Management; Richard Ward, chief executive of insurance market Lloyd's of London.\n\nProducer: Ben Carter\nEditor: Innes Bowen.",
            "length": "26864000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02plqrh.mp3"
        },
        {
            "title": "Pricing",
            "datePublished": "Thu, 01 Nov 2012 21:00:00 +0000",
            "description": "The view from the top of business. Presented by Evan Davis, The Bottom Line cuts through confusion, statistics and spin to present a clearer view of the business world, through discussion with people running leading and emerging companies.\n\nEvan and his guests discuss the science of pricing goods and services. How do companies decide what to charge - and how much of it is educated guesswork as to what they can get away with?\n\nIn the studio are Roger Mavity, chief executive of the Conran Group; Rita Clifton, branding expert and former chairman of Interbrand; Scott Malkin, founder and chairman of Value Retail which owns the outlet shopping centre Bicester Village.\n\nProducer: Ben Crighton\nEditor: Innes Bowen.",
            "length": "26896000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02plqrl.mp3"
        },
        {
            "title": "The World of Sport",
            "datePublished": "Thu, 25 Oct 2012 20:00:00 +0000",
            "description": "Evan Davis meets three of the sport sector's top business brains and gets them to share their stories of reinvention and the secrets of their industry. Evans hears from the darts, snooker and boxing promoter, Barry Hearn, who is also chairman of Leyton Orient and creator of the televised fishing contest, Fishomania. Former Formula 1 boss Max Mosley gives the inside story on how his sport became a hit in the Far East. And former managing director of IMG India explains how the Indian Premier League turned cricket into a showbiz sporting sensation.",
            "length": "26976000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02plqrp.mp3"
        },
        {
            "title": "Overcrowded markets",
            "datePublished": "Thu, 18 Oct 2012 20:00:00 +0000",
            "description": "The view from the top of business. Presented by Evan Davis, The Bottom Line cuts through confusion, statistics and spin to present a clearer view of the business world, through discussion with people running leading and emerging companies.\n\nEvan and his guests consider the perils and possibilities of doing business in an overcrowded market, with too many products chasing too few customers. And ahead of the arrival of the latest James Bond film, they swap thoughts on product placement and celebrity endorsement. How do you ensure your products are seen in all the right places and none of the wrong ones?\n\nIn the studio are Willie Walsh, Chief Executive of International Airlines Group; fashion and retail expert Kim Winser; Peter Bamford, Chairman of Supergroup.\n\nProducer: Ben Crighton\nEditor: Innes Bowen.",
            "length": "26688000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02plqrr.mp3"
        },
        {
            "title": "Quality",
            "datePublished": "Thu, 11 Oct 2012 20:00:00 +0000",
            "description": "The view from the top of business. Presented by Evan Davis, The Bottom Line cuts through confusion, statistics and spin to present a clearer view of the business world, through discussion with people running leading and emerging companies.\n\nEvan's guests delve into the concept of quality in business - how to get it high, and why it might end up low. They also compare notes on their respective weaknesses. Who do they turn to for help should they need it?\n\nIn the studio are Jon Moulton, founder and chairman of private equity firm Better Capital; entrepreneur and investor Deborah Meaden; David Haines, chief executive of German sanitary fittings manufacturer Grohe.\n\nProducer: Ben Crighton\nEditor: Innes Bowen.",
            "length": "26656000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02plqrw.mp3"
        },
        {
            "title": "Boardroom battles",
            "datePublished": "Thu, 04 Oct 2012 20:00:00 +0000",
            "description": "The view from the top of business. Presented by Stephanie Flanders, The Bottom Line cuts through confusion, statistics and spin to present a clearer view of the business world, through discussion with people running leading and emerging companies.\n\nStephanie's guests reveal the secrets of the boardroom and offer their tips for mastering boardroom politics - from hidden agendas and clashing egos, to a simple failure to agree.\n\nThey also swap thoughts on the risks and rewards of running large incumbent companies as opposed to smaller startups. \n\nIn the studio are Stuart Fletcher, Chief Executive of private healthcare company Bupa; Eileen Gittins, founder and Chief Executive of creative self-publishing platform Blurb; Ken Olisa, chairman of boutique technology merchant bank Restoration Partners.\n\nProducer: Ben Crighton\nEditor: Innes Bowen.",
            "length": "26720000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02plqs0.mp3"
        },
        {
            "title": "Products",
            "datePublished": "Thu, 27 Sep 2012 20:00:00 +0000",
            "description": "The view from the top of business. Presented by Evan Davis, The Bottom Line cuts through confusion, statistics and spin to present a clearer view of the business world, through discussion with people running leading and emerging companies.\n\nIf business is about anything, it's about products. Evan's guests come from companies that invent them, manufacture them and sell them and they each tell the story of a product that has shaped the fortunes of their business in some way.\n\nThey also discuss the art of dismissal. How easy should it be to fire an employee?\n\nIn the studio are Sir George Buckley, former Chief Executive of 3M, the US company behind the Post-it Note and Scotch Tape, and now Chairman of private equity firm Arle Capital; Clara Gaymard, Chief Executive of the French arm of US company General Electric; Ian Cheshire, Chief Executive of home improvement retailer Kingfisher, whose brands include B&Q and Screwfix.\n\nProducer: Ben Crighton\nEditor: Innes Bowen.",
            "length": "26784000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02plqs3.mp3"
        },
        {
            "title": "20/09/2012",
            "datePublished": "Thu, 20 Sep 2012 20:00:00 +0000",
            "description": "The view from the top of business. Presented by Evan Davis, The Bottom Line cuts through confusion, statistics and spin to present a clearer view of the business world, through discussion with people running leading and emerging companies.\n\nThe mere mention of the word \"Europe\" in the media these days conjures up images of economic crisis - riots, bailouts, 12-figure debts, emergency summits. And yet the European Union remains the world's largest economy, its GDP some 10 per cent larger than that of the US. So is the idea that Europe is in terminal decline exaggerated? Evan asks his guests if Europe's current woes are just bumps on the road towards greater prosperity.\n\nAnd on a lighter note - silos, those invisible barriers which often develop inside organisations. Conventional wisdom says that they inhibit communication and can lead to dysfunctional, isolated units. Evan's guests debate whether they're such a bad thing after all.\n\nIn the studio are Rachel Lomax, former Deputy Governor of the Bank of England and non-executive director of several companies including HSBC and BAA; Moray MacLennan, Chief Executive of advertising agency M&C Saatchi Worldwide; Phil Bentley, Managing Director of British Gas.\n\nProducer: Ben Crighton\nEditor: Innes Bowen.",
            "length": "26608000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02plqs5.mp3"
        },
        {
            "title": "12/07/2012",
            "datePublished": "Thu, 12 Jul 2012 20:00:00 +0000",
            "description": "The view from the top of business. Presented by Evan Davis, The Bottom Line cuts through confusion, statistics and spin to present a clearer view of the business world, through discussion with people running leading and emerging companies. The programme is broadcast first on BBC Radio 4 and later on BBC World Service Radio, BBC World News TV and BBC News Channel TV.\n\nEvan and his executive panel discuss the business of building and running infrastructure - how good is the UK at developing and delivering it? They also swap thoughts on the pros and cons of media training. \n\nJoining Evan in the studio are Steve Holliday, chief executive of international electricity and gas company National Grid plc; Nicola Shaw, chief executive of High Speed One, the Channel Tunnel high-speed rail line; Philip Dilley, chairman of global design, engineering and consulting company Arup Group.\n\nProducer: Ben Crighton\nEditor: Stephen Chilcott.",
            "length": "26736000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02plqs9.mp3"
        },
        {
            "title": "05/07/2012",
            "datePublished": "Thu, 05 Jul 2012 20:00:00 +0000",
            "description": "The view from the top of business. Presented by Evan Davis, The Bottom Line cuts through confusion, statistics and spin to present a clearer view of the business world, through discussion with people running leading and emerging companies. The programme is broadcast first on BBC Radio 4 and later on BBC World Service Radio, BBC World News TV and BBC News Channel TV.\n\nEvan and his executive guests discuss the evolution and hierarchy of brands. Who has the upper hand in the many battles being fought between big consumer brands and shops' own-labels? They also consider consumer tastes - do their own customers have good taste, or do they just buy what they're given? \n\nJoining Evan in the studio are Justin King, chief executive of supermarket chain Sainsbury's; Cecile Bonnefond, chief executive of French champagne house Piper-Heidsieck; Geoff Cooper, chief executive of builders merchant Travis Perkins.\n\nProducer: Ben Crighton\nEditor: Stephen Chilcott.",
            "length": "26672000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02plqsd.mp3"
        },
        {
            "title": "28/06/2012",
            "datePublished": "Thu, 28 Jun 2012 20:00:00 +0000",
            "description": "The view from the top of business. Presented by Evan Davis, The Bottom Line cuts through confusion, statistics and spin to present a clearer view of the business world, through discussion with people running leading and emerging companies. The programme is broadcast first on BBC Radio 4 and later on BBC World Service Radio, BBC World News TV and BBC News Channel TV.\n\nEvan and his executive guests consider how well the market works at allocating investment capital to the right businesses. Do deserving companies get enough, do the undeserving get more than they should?\n\nJoining Evan in the studio are Terry Smith, chief executive of stockbrokers Tullett Prebon; Israeli serial entrepreneur and investor Yossi Vardi; Ken Olisa, chairman of boutique technology merchant bank Restoration Partners.\n\nProducer: Ben Crighton\nEditor: Stephen Chilcott.",
            "length": "26752000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02plqsh.mp3"
        },
        {
            "title": "21/06/2012",
            "datePublished": "Thu, 21 Jun 2012 20:00:00 +0000",
            "description": "The view from the top of business. Presented by Evan Davis, The Bottom Line cuts through confusion, statistics and spin to present a clearer view of the business world, through discussion with people running leading and emerging companies. The programme is broadcast first on BBC Radio 4 and later on BBC World Service Radio, BBC World News TV and BBC News Channel TV.\n\nEvan Davis asks his executive guests how they spend their time each day. What does the activity of running a company really involve, and what do the guests' diaries tell us about the nature of their jobs? They also swap thoughts on the so-called Shareholder Spring - how investors are rebelling against corporate pay.\n\nJoining Evan in the studio are Jackie Hunt, chief financial officer of insurance giant Standard Life; John Vincent, entrepreneur and co-founder of Leon Restaurants; Harriet Green, outgoing chief executive of Premier Farnell who takes up her new role as chief executive of travel company Thomas Cook in July. \n\nProducer: Ben Crighton\nEditor: Stephen Chilcott.",
            "length": "26864000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02plqsn.mp3"
        },
        {
            "title": "14/06/2012",
            "datePublished": "Thu, 14 Jun 2012 20:00:00 +0000",
            "description": "The view from the top of business. Presented by Evan Davis, The Bottom Line cuts through confusion, statistics and spin to present a clearer view of the business world, through discussion with people running leading and emerging companies. The programme is broadcast first on BBC Radio 4 and later on BBC World Service Radio, BBC World News TV and BBC News Channel TV.\n\nEvan Davis asks his executive guests about instant gratification. Much of our economy is devoted to providing instant pleasure to consumers, rather than long-term satisfaction. But how far should companies restrain themselves when they do so? They also examine the psychology of competition in business - how focussed are companies on their rivals?\n\nJoining Evan in the studio are Richard Evans, President PepsiCo UK and Ireland; Rita Clifton, chairman of branding consultancy Interbrand; Nathalie Gaveau, founder and chief executive of social shopping application Shopcade.\n\nProducer: Ben Crighton\nEditor: Stephen Chilcott.",
            "length": "26784000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02plqsr.mp3"
        },
        {
            "title": "07/06/2012",
            "datePublished": "Thu, 07 Jun 2012 19:30:00 +0000",
            "description": "The view from the top of business. Presented by Evan Davis, The Bottom Line cuts through confusion, statistics and spin to present a clearer view of the business world, through discussion with people running leading and emerging companies. The programme is broadcast first on BBC Radio 4 and later on BBC World Service Radio, BBC World News TV and BBC News Channel TV.\n\nEvan Davis and his executive panel discuss different types of employment contracts and how far should employers go in checking on their employees' behaviour?\n\nJoining Evan in the studio are Eric Born, Swiss CEO of logistics and transport company, Wincanton, Nick Buckles, CEO of security giant G4S and Jason Iftakhar, co-founder of Salford based company, Swifty Scooters.\n\nProducer: Ben Carter\nEditor: Stephen Chilcott.",
            "length": "26720000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02plqsx.mp3"
        },
        {
            "title": "31/05/2012",
            "datePublished": "Thu, 31 May 2012 20:00:00 +0000",
            "description": "The view from the top of business. Presented by Evan Davis, The Bottom Line cuts through confusion, statistics and spin to present a clearer view of the business world, through discussion with people running leading and emerging companies. The programme is broadcast first on BBC Radio 4 and later on BBC World Service Radio, BBC World News TV and BBC News Channel TV.\n\nAs the mood on Europe swings from doom to gloom, Evan Davis asks his executive guests about the outlook for the Euro. What will it take to save the single currency? And what are the prospects for business more generally in 2012?\n\nJoining Evan in the studio are Warren East, chief executive of FTSE 100 microchip designer ARM Holdings plc; Dr Carol Bell, energy industry executive with particular expertise in investment and financing in the oil and gas sector and a board member of three energy companies, including Salamander Energy plc; Michael Morley, chief executive of private bank Coutts.\n\nProducer: Ben Crighton\nEditor: Stephen Chilcott.",
            "length": "26688000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02plqt0.mp3"
        },
        {
            "title": "Ruthlessness",
            "datePublished": "Thu, 29 Mar 2012 20:00:00 +0000",
            "description": "The view from the top of business. Presented by Evan Davis, The Bottom Line cuts through confusion, statistics and spin to present a clearer view of the business world, through discussion with people running leading and emerging companies. The programme is broadcast first on BBC Radio 4 and later on BBC World Service Radio, BBC World News TV and BBC News Channel TV.\n\nIt's tough at the top, but when is it right to be tough at the top? Evan's executive panel debate the pros and cons of ruthlessness as a management style. They also talk about investing and selling in deprived areas - places capitalism often overlooks.\n\nJoining Evan are Jasmine Montgomery, founder of Seven Brands; Michele Giddens, co-founder of Bridges Ventures; Dido Harding, chief executive of Talk Talk Group.\n\nProducer: Ben Crighton\nEditor: Richard Vadon.",
            "length": "26640000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02plqt4.mp3"
        },
        {
            "title": "22/03/2012",
            "datePublished": "Thu, 22 Mar 2012 21:00:00 +0000",
            "description": "The view from the top of business. Presented by Evan Davis, The Bottom Line cuts through confusion, statistics and spin to present a clearer view of the business world, through discussion with people running leading and emerging companies. The programme is broadcast first on BBC Radio 4 and later on BBC World Service Radio, BBC World News TV and BBC News Channel TV.\n\nEvan's executive panel talk about decision making using examples from their professional life. A chance to see what their jobs consist of and a chance too to think about how we all make choices, for better or worse. They also swap thoughts on stress - their own and that of their employees.\n\nJoining Evan are Sir Martin Sorrell, chief executive of advertising and media company WPP; David Jones, global chief executive of France-based advertising group Havas; Nicola Horlick, chairman of investment fund Rockpool Investments.\n\nProducer: Ben Crighton\nEditor: Richard Vadon.",
            "length": "26688000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02plqt7.mp3"
        },
        {
            "title": "Leadership",
            "datePublished": "Thu, 15 Mar 2012 21:00:00 +0000",
            "description": "The view from the top of business. Presented by Evan Davis, The Bottom Line cuts through confusion, statistics and spin to present a clearer view of the business world, through discussion with people running leading and emerging companies. The programme is broadcast first on BBC Radio 4 and later on BBC World Service Radio, BBC World News TV and BBC News Channel TV.\n\nEvan's executive panel discuss what good leadership consists of - how do you turn a mediocre manager into a brilliant boss? They also swap thoughts on surviving on 20% less of everything. How would their companies cope, and what would they look like?\n\nJoining Evan are Martin Gilbert, chief executive of fund manager Aberdeen Asset Management; Allan Leighton, chairman of set top box maker Pace; Nigel Whitehead, group managing director of BAE Systems. \n\nProducer: Ben Crighton\nEditor: Richard Vadon.",
            "length": "26704000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02plqt9.mp3"
        },
        {
            "title": "Cock-ups and Conspiracies",
            "datePublished": "Thu, 08 Mar 2012 21:00:00 +0000",
            "description": "The view from the top of business. Presented by Evan Davis, The Bottom Line cuts through confusion, statistics and spin to present a clearer view of the business world, through discussion with people running leading and emerging companies. The programme is broadcast first on BBC Radio 4 and later on BBC World Service Radio, BBC World News TV and BBC News Channel TV.\n\nEvan's executive panel discuss corporate cock-ups and conspiracies. They swap thoughts on why they occur, and how best to avoid them.\n\nJoining Evan are Andy Green, chief executive of business and technology service provider Logica; Phil Smith, chief executive of technology company Cisco UK and Ireland; Luke Johnson, serial entrepreneur and chairman of private equity firm Risk Capital Partners.\n\nProducer: Ben Crighton\nEditor: Richard Vadon.",
            "length": "26672000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02plqtg.mp3"
        },
        {
            "title": "Reinvention",
            "datePublished": "Thu, 01 Mar 2012 21:00:00 +0000",
            "description": "The view from the top of business. Presented by Evan Davis, The Bottom Line cuts through confusion, statistics and spin to present a clearer view of the business world, through discussion with people running leading and emerging companies. The programme is broadcast first on BBC Radio 4 and later on BBC World Service Radio, BBC World News TV and BBC News Channel TV.\n\nEvan's three executive guests all run companies that to a large extent have had to reinvent themselves. He asks them what's driven change in each of their businesses, and how they've fared. They also swap ideas on what they think our children should be taught at school.\n\nJoining Evan are Rooney Anand, chief executive of pub retailer and brewer Greene King; Ian Livingston, chief executive of multinational telecoms provider BT Group; Rupert Gavin, chief executive of Odeon and UCI Cinemas Group. \n\nProducer: Ben Crighton\nEditor: Stephen Chilcott.",
            "length": "26800000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02plqtm.mp3"
        },
        {
            "title": "Selling expertise",
            "datePublished": "Thu, 23 Feb 2012 21:00:00 +0000",
            "description": "The view from the top of business. Presented by Evan Davis, The Bottom Line cuts through confusion, statistics and spin to present a clearer view of the business world, through discussion with people running leading and emerging companies. The programme is broadcast first on BBC Radio 4 and later on BBC World Service Radio, BBC World News TV and BBC News Channel TV.\n\nEvan and three top executives discuss the curiosities of selling their expertise, knowledge the customer doesn't have. If consumers are in a state of relative ignorance, how can they shop around? What stops them getting ripped off? They also swap thoughts on religion in the workplace.\n\nJoining Evan are Heather McGregor, managing director of headhunters Taylor Bennett; Rupert Soames, chief executive of mobile energy company Aggreko; Gavin Oldham, chief executive of retail stockbroker The Share Centre.\n\nProducer: Ben Crighton\nEditor: Stephen Chilcott.",
            "length": "26752000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02plqtp.mp3"
        },
        {
            "title": "Young Entrepreneurs",
            "datePublished": "Thu, 16 Feb 2012 21:00:00 +0000",
            "description": "The view from the top of business. Presented by Evan Davis, The Bottom Line cuts through confusion, statistics and spin to present a clearer view of the business world, through discussion with people running leading and emerging companies. The programme is broadcast first on BBC Radio 4 and later on BBC World Service Radio, BBC World News TV and BBC News Channel TV.\n\nThree young entrepreneurs, all in their early twenties, join Evan to discuss the headaches in getting their businesses up and running. They also discuss the next chapter - moving on and crucially letting go or getting out.\n\nJoining Evan in the studio are Suleman Sacranie, founder of online wholesaler 99pwholesaler.com; Kelly Goss of independent fashion brand Rock 'n' Needle; Louis Barnett, founder of luxury chocolate maker Chokolit.\n\nProducer: Ben Crighton\nEditor: Stephen Chilcott.",
            "length": "26848000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02plqtr.mp3"
        },
        {
            "title": "Big Egos",
            "datePublished": "Thu, 09 Feb 2012 21:00:00 +0000",
            "description": "The view from the top of business. Presented by Evan Davis, The Bottom Line cuts through confusion, statistics and spin to present a clearer view of the business world, through discussion with people running leading and emerging companies. The programme is broadcast first on BBC Radio 4 and later on BBC World Service Radio, BBC World News TV and BBC News Channel TV.\n\nPrompted by a comment from a guest in last week's programme that Facebook could never have been created in the UK, Evan and his panel swap thoughts on why the US does so well when it comes to startups compared to Europe. They also discuss whether a big ego helps you get on in business, or gets in the way.\n\nJoining Evan in the studio are Anita Frew, chairman of plastics company Victrex; entrepreneur and investor Richard Farleigh; Michael Spencer, founder and chief executive of money broker ICAP.\n\nProducer: Ben Crighton\nEditor: Stephen Chilcott.",
            "length": "26624000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02plqtz.mp3"
        },
        {
            "title": "Automotive",
            "datePublished": "Thu, 02 Feb 2012 21:00:00 +0000",
            "description": "The view from the top of business. Presented by Evan Davis, The Bottom Line cuts through confusion, statistics and spin to present a clearer view of the business world, through discussion with people running leading and emerging companies. The programme is broadcast first on BBC Radio 4 and later on BBC World Service Radio, BBC World News TV and BBC News Channel TV.\n\nEvan and his panel talk cars. What road is the automotive industry on? Just where is it headed? They also consider whether it's best to be a wage slave, with a regular salary, or to take a share of the profits of a business.\n\nJoining Evan in the studio are Ken Keir, Vice President of Honda Motors Europe; Nikki King, Managing Director of Isuzu Truck UK; Wol Kolade, Managing Partner of venture capital firm Isis Equity Partners.\n\nProducer: Ben Crighton\nEditor: Stephen Chilcott.",
            "length": "26912000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02plqv4.mp3"
        },
        {
            "title": "Capitalism",
            "datePublished": "Thu, 26 Jan 2012 21:00:00 +0000",
            "description": "The view from the top of business. Presented by Evan Davis, The Bottom Line cuts through confusion, statistics and spin to present a clearer view of the business world, through discussion with people running leading and emerging companies. The programme is broadcast first on BBC Radio 4 and later on BBC World Service Radio, BBC World News TV and BBC News Channel TV.\n\nEvan and his panel debate the big issue of the moment: capitalism, its virtues and vices. Across the media it's associated with negative words like 'crisis' and 'crony'. So how would Evan's executive guests redesign and rebrand capitalism? They also discuss peaking - just when do you reach your prime in business?\n\nJoining Evan in the studio are Keith Clarke, former Chief Executive and now Director of Sustainability at civil engineering and design consultancy Atkins; entrepreneur and investor Deborah Meaden; Heather Killen, co-founder of private equity and corporate finance advisory boutique Hemisphere Capital.\n\nProducer: Ben Crighton\nEditor: Stephen Chilcott.",
            "length": "26832000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02plqv9.mp3"
        },
        {
            "title": "Ambition",
            "datePublished": "Thu, 17 Nov 2011 21:00:00 +0000",
            "description": "The view from the top of business. Presented by Evan Davis, The Bottom Line cuts through confusion, statistics and spin to present a clearer view of the business world, through discussion with people running leading and emerging companies. The programme is broadcast first on BBC Radio 4 and later on BBC World Service Radio, BBC World News TV and BBC News Channel TV.\n\nEvan and his panel debate whether now's the time for companies to pursue big, ambitious ideas - or is it a time for more modest aspirations? They also discuss banking with the boss of retail banking at Royal Bank of Scotland, and take stock of the consumer sector in the run-up to Christmas.\n\nJoining Evan in the studio are Brian Hartzer, chief executive of RBS UK Retail, Wealth and Ulster; David Martin, chief executive of transport company Arriva; Nadim Ednan-Laperouse, founder and managing director of WOW toys. \n\nProducer: Ben Crighton\nEditor: Stephen Chilcott.",
            "length": "26816000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02plqvd.mp3"
        },
        {
            "title": "Business Bonds",
            "datePublished": "Thu, 10 Nov 2011 21:00:00 +0000",
            "description": "The view from the top of business. Presented by Evan Davis, The Bottom Line cuts through confusion, statistics and spin to present a clearer view of the business world, through discussion with people running leading and emerging companies. The programme is broadcast first on BBC Radio 4 and later on BBC World Service Radio, BBC World News TV and BBC News Channel TV.\n\nAfter a week of turmoil in the bond markets, Evan and his panel discuss the importance of bonds in business. The boss of Heathrow talks about the trials and tribulations of running one of the world's busiest airports. And the panel swap thoughts on whether a good business manager can run any company of any type.\n\nJoining Evan in the studio are Mark Elborne, president and chief executive of multinational conglomerate GE (UK and Ireland); Alison Carnwath, chairman of property company Land Securities; Colin Matthews, chief executive of airport owner and operator BAA.\n\nProducer: Ben Crighton\nEditor: Stephen Chilcott.",
            "length": "26864000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02plqvj.mp3"
        },
        {
            "title": "Special Relationship",
            "datePublished": "Thu, 03 Nov 2011 21:00:00 +0000",
            "description": "The view from the top of business. Presented by Evan Davis, The Bottom Line cuts through confusion, statistics and spin to present a clearer view of the business world, through discussion with people running leading and emerging companies. The programme is broadcast first on BBC Radio 4 and later on BBC World Service Radio, BBC World News TV and BBC News Channel TV.\n\nThis week Evan and his panel consider the secrets of a happy business marriage - those key symbiotic partnerships companies have with each other. They also discuss whether flat organisations work best.\n\nJoining Evan in the studio are Mike Roney, chief executive of business supplies distributor Bunzl; James Reed, chairman of recruitment specialist Reed; Nicola Shaw, chief executive of HS1, the fast rail link from London to the Channel Tunnel.\n\nProducer: Ben Crighton Editor: Stephen Chilcott.",
            "length": "26832000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02plqvq.mp3"
        },
        {
            "title": "Product Proliferation",
            "datePublished": "Thu, 27 Oct 2011 20:00:00 +0000",
            "description": "The view from the top of business. Presented by Evan Davis, The Bottom Line cuts through confusion, statistics and spin to present a clearer view of the business world, through discussion with people running leading and emerging companies. The programme is broadcast first on BBC Radio 4 and later on BBC World Service Radio, BBC World News TV and BBC News Channel TV.\n\nThis week Evan and his guests serve up a smorgasbord of topics, from Swedish business and the IKEA model, to the crisis in the Eurozone crisis. They also discuss proliferation - how many different products should a company sell?\n\nJoining Evan in the studio are John Vincent, co-founder of Leon Restaurants; Helena Morrissey, chief executive of global asset manager Newton Investment Management, part of BNY Mellon Asset Management; Peter Jelkeby, senior vice president of Swedish chain store Clas Ohlson.\n\nProducer: Ben Crighton. Editor: Stephen Chilcott.",
            "length": "26720000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02plqvy.mp3"
        },
        {
            "title": "Producers or Parasites?",
            "datePublished": "Thu, 20 Oct 2011 20:00:00 +0000",
            "description": "The view from the top of business. Presented by Evan Davis, The Bottom Line cuts through confusion, statistics and spin to present a clearer view of the business world, through discussion with people running leading and emerging companies.\n\nWith protests continuing around the world against the financial sector, three guests from that industry swap candid thoughts about it. Evan puts to them a fundamental question: is their industry creating genuine wealth, or is it essentially parasitic, finding clever ways of distributing other people's wealth to its own workers?\n\nJoining Evan in the studio are Ken Olisa, chairman of boutique technology merchant bank Restoration Partners; Ian Gorham, chief executive of financial advisory firm Hargreaves Lansdown; Julian Roberts, chief executive of savings and investment group Old Mutual.\n\nProducer: Ben Crighton Editor: Stephen Chilcott.",
            "length": "26944000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02plqw8.mp3"
        },
        {
            "title": "Marketing and Mess",
            "datePublished": "Thu, 13 Oct 2011 20:00:00 +0000",
            "description": "The view from the top of business. Presented this week by Stephanie Flanders, The Bottom Line cuts through confusion, statistics and spin to present a clearer view of the business world, through discussion with people running leading and emerging companies.\n\nStephanie asks her panel about the dos and don'ts of marketing. They also talk about messiness in the workplace. Is there any truth to the claim that a cluttered desk is a sign of a cluttered mind?\n\nStephanie is joined in the studio by Richard Harpin, chief executive of emergency home repairs business Homeserve; Nick Wheeler, founder and chairman of shirt company Charles Tyrwhitt; Charles Cohen, chief executive of mobile gaming company Probability.\n\nProducer: Ben Crighton.",
            "length": "26720000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02plqwg.mp3"
        },
        {
            "title": "Startups and Mistakes",
            "datePublished": "Thu, 06 Oct 2011 20:00:00 +0000",
            "description": "The view from the top of business. Presented by Evan Davis, The Bottom Line cuts through confusion, statistics and spin to present a clearer view of the business world, through discussion with people running leading and emerging companies.\n\nEvan asks his panel if it's getting easier to create a new business in the wired world, or does a lower barrier to entry mean it's more difficult to get noticed? They also consider how good businesses are built on the back of mistakes.\n\nEvan is joined in the studio by Matt Brittin, managing director of Google, UK and Ireland; Lara Morgan, founder of Pacific Direct and Company Shortcuts; Luke Johnson, serial entrepreneur and chairman of Risk Capital Partners. \n\nProducer: Ben Crighton.",
            "length": "26688000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02plqwk.mp3"
        },
        {
            "title": "McDonald's and New Tech",
            "datePublished": "Thu, 29 Sep 2011 20:00:00 +0000",
            "description": "The view from the top of business. Presented by Evan Davis, The Bottom Line cuts through confusion, statistics and spin to present a clearer view of the business world, through discussion with people running leading and emerging companies.\n\nEvan and his guests discuss McDonald's. After a rocky period in the middle of the last decade, how well has the global burger chain managed to revive its famous fast-food formula? They also debate whether the progress of radical new technology has slowed down. \n\nEvan is joined in the studio by Greg Lucier, chief executive of US biotechnology company Life Technologies; Rita Clifton, chairman of branding consultancy Interbrand; Jill McDonald, chief executive of McDonald's UK.\n\nProducer: Ben Crighton.",
            "length": "26880000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02plqwm.mp3"
        },
        {
            "title": "Economy and Rumours",
            "datePublished": "Thu, 22 Sep 2011 20:00:00 +0000",
            "description": "The view from the top of business. Presented by Evan Davis, The Bottom Line cuts through confusion, statistics and spin to present a clearer view of the business world, through discussion with people running leading and emerging companies.\n\nEvan asks his guests whether it's time to declare a state of emergency in the world economy and to adopt extreme measures to sort out the Euro crisis and the lack of economic activity in the West. They also discuss rumours, hearsay and speculation, and the role they play in business.\n\nEvan is joined in the studio by Guy Berruyer, chief executive of global business software supplier Sage Group; internet entrepreneur Brent Hoberman, founder of online interior decoration business mydeco.com; Hugh Hendry, co-founder of hedge fund Eclectica Asset Management.\n\nProducer: Ben Crighton.",
            "length": "26576000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02plls6.mp3"
        },
        {
            "title": "Limits of Automation",
            "datePublished": "Thu, 14 Jul 2011 20:00:00 +0000",
            "description": "The view from the top of business. Presented by Evan Davis, The Bottom Line cuts through confusion, statistics and spin to present a clearer view of the business world, through discussion with people running leading and emerging companies.\n\nThis week Evan asks his panel of top executives about the limits of automation. How far can they go in removing human beings from their business? Which processes are beyond automation? The panel also swap thoughts on the benefits of the corporate awayday.\n\nEvan is joined in the studio by Mike Lynch, founder and chief executive of the software company Autonomy; Colin Drummond, chief executive of waste management firm Viridor; Douglas Anderson, president and chief executive of the global travel management company Carlson Wagonlit Travel.\n\nProducer: Ben Crighton.",
            "length": "26928000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02pllsj.mp3"
        },
        {
            "title": "Profits and Pitfalls",
            "datePublished": "Thu, 07 Jul 2011 20:00:00 +0000",
            "description": "The view from the top of business. Presented by Evan Davis, The Bottom Line cuts through confusion, statistics and spin to present a clearer view of the business world, through discussion with people running leading and emerging companies.\n\nThis week Evan asks his panel of top executives about the perils and the possibilities of running a fast-growing business. Many a company has spiralled out of control because of a failure to manage rapid growth - but what are the speed limits? They also chew over the role of the business lunch.\n\nEvan is joined in the studio by Clive Schlee, chief executive of sandwich retail chain Pret A Manger; Peter Bamford, chairman of SuperGroup, the fashion retailer behind the SuperDry brand; Giles Andrews, founder and chief executive of Zopa, an online lending service.\n\nProducer: Ben Crighton.",
            "length": "26896000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02pllsn.mp3"
        },
        {
            "title": "The Future of the Web",
            "datePublished": "Thu, 30 Jun 2011 20:00:00 +0000",
            "description": "The view from the top of business. Presented by Evan Davis, The Bottom Line cuts through confusion, statistics and spin to present a clearer view of the business world, through discussion with people running leading and emerging companies.\n\nThis week Evan's panel of business leaders hail from the worlds of social networking and retail. He challenges them to cast their minds forward and imagine how the Web will look by the year 2020. What will have changed? Will bricks and mortar matter any more, or will everything be in the cloud? They also consider the value of storytelling in business. So many brands these days seem to have a story to tell - but what business benefit really is there in a good yarn?\n\nEvan is joined in the studio by Michael Birch, internet entrepreneur and founder of social networking website Bebo; Laura Tenison, founder and managing director of maternity and babywear retailer Jo-Jo Maman Bébé; Justin King, chief executive of supermarket chain Sainsbury's.\n\nProducer: Ben Crighton.",
            "length": "26880000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02pllsy.mp3"
        },
        {
            "title": "Keeping Score",
            "datePublished": "Thu, 23 Jun 2011 20:00:00 +0000",
            "description": "The view from the top of business. Presented by Evan Davis, The Bottom Line cuts through confusion, statistics and spin to present a clearer view of the business world, through discussion with people running leading and emerging companies.\n\nThis week Evan's executive guests hail from the worlds of banking, headhunting and advertising. He asks them about loyalty - or rather the seeming lack of it in business. Are companies generally looking for short-term relationships of convenience, with loyalty gone and promiscuity the rule? Evan also asks them how they measure how well they're performing.\n\nEvan is joined in the studio by Michael Morley, chief executive of private bank Coutts & Co; Robin Wight, president of communications agency Engine; Alistair Cox, chief executive of global recruitment firm Hays.\n\nProducer: Ben Crighton.",
            "length": "26912000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02pllt4.mp3"
        },
        {
            "title": "Contacts and Contracts",
            "datePublished": "Thu, 16 Jun 2011 20:00:00 +0000",
            "description": "The view from the top of business. Presented by Evan Davis, The Bottom Line cuts through confusion, statistics and spin to present a clearer view of the business world, through discussion with people running leading and emerging companies.\n\nEvan and his guests swap thoughts on contacts and contracts. Is it who you know that counts in business? Are informal networks the way business is allocated? Or do more formal arrangements now apply? Evan also asks his guests to reveal their greatest business regrets. \n\nEvan is joined in the studio by Will Butler-Adams, managing director of folding bicycle manufacturer Brompton Bicycle; Charles Cohen, chief executive of mobile gambling company Probability plc; Ralph Oppenheimer, chairman of steel trading company Stemcor.\n\nProducer: Ben Crighton.",
            "length": "26848000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02plltc.mp3"
        },
        {
            "title": "Raw Materials",
            "datePublished": "Thu, 09 Jun 2011 19:30:00 +0000",
            "description": "The view from the top of business. Presented by Evan Davis, The Bottom Line cuts through confusion, statistics and spin to present a clearer view of the business world, through discussion with people running leading and emerging companies.\n\nWith so many people now living in high-consuming industrial nations, and with many commodity prices increasing, Evan asks his business guests how they plan to economise in their use of raw materials. They also discuss building design and appraise the importance of form and function.\n\nEvan is joined in the studio by Eugene Kohn, co-founder and chairman of architecture firm Kohn Pedersen Fox Associates; Mark Price, managing director of supermarket chain Waitrose; Andy Bond, former chief executive and chairman of Asda.",
            "length": "26560000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02plltk.mp3"
        },
        {
            "title": "Is Greed is Good?",
            "datePublished": "Sat, 04 Jun 2011 16:55:00 +0000",
            "description": "The view from the top of business. Presented by Evan Davis, The Bottom Line cuts through confusion, statistics and spin to present a clearer view of the business world, through discussion with people running leading and emerging companies.\n\nWith plenty to worry about in the world economy, Evan asks his panel of influential business leaders whether now is a good time for companies to sit tight and play it safe, or to take a risk or two. They also discuss greed - is there anything wrong with a touch of it in business?\n\nEvan is joined in the studio by Geoff Cooper, chief executive of builders merchant Travis Perkins; Harriet Green, chief executive of electronic components distributor Premier Farnell; serial technology entrepreneur Sir Terry Matthews.\n\nProducer: Ben Crighton.",
            "length": "23184000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02pllts.mp3"
        },
        {
            "title": "Fashion",
            "datePublished": "Thu, 24 Mar 2011 20:30:00 +0000",
            "description": "The view from the top of business, presented by Evan Davis. The Bottom Line cuts through confusion, statistics and spin to present a clearer view of the business world, through discussion with people running leading and emerging companies.\n\nThis week, Evan's guests are all top executives from the world of fashion and clothing. They discuss whether normal business rules apply in their world. They also get down to the nitty gritty of the business itself - who makes the money and how do they set the prices?\n\nThe panel also talks about marketing, and the role of PR in getting their products noticed. \n\nEvan is joined in the studio by Jane Sheperdson, chief executive of Whistles; Simon Berwin, managing director of Berwin & Berwin; Kim Winser, fashion and retail expert with private equity group 3i.\n\nProducer: Ben Crighton.",
            "length": "26928000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02pllv3.mp3"
        },
        {
            "title": "Major Disaster Plans",
            "datePublished": "Thu, 17 Mar 2011 20:30:00 +0000",
            "description": "The view from the top of business, presented by Evan Davis. The Bottom Line cuts through confusion, statistics and spin to present a clearer view of the business world, through discussion with people running leading and emerging companies.\n\nThis week, Evan's top executive guests include two hoteliers and a soft drinks manufacturer. They discuss recent events in Japan, and explore to what extent companies can really prepare for major disasters. \n\nThey also reveal how much they know about life on the shop floor and where the problems lie.\n\nProducer: Ben Crighton.",
            "length": "26928000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02pllv7.mp3"
        },
        {
            "title": "Slow Growth",
            "datePublished": "Thu, 10 Mar 2011 20:59:00 +0000",
            "description": "The view from the top of business. Presented this week by Stephanie Flanders, The Bottom Line cuts through confusion, statistics and spin to present a clearer view of the business world, through discussion with people running leading and emerging companies.\n\nThis week, Stephanie's top executive guests hail from the worlds of mobile energy, sanitary fittings and business services. They discuss how businesses cope in a \"slow growth\" environment. Could years of slow growth be more challenging than a short sharp shock? \n\nAnd not so long ago, the slow coach economy in Europe was Germany - now it's steaming ahead of everyone. What's gone right for Germany - and what lessons could other countries learn?\n\nStephanie is joined in the studio by Rupert Soames, chief executive of mobile energy group, Aggreko; Neal Gandhi, chief executive of international business services company Quickstart Global; David Haines, chief executive of German bathroom fittings company Grohe.\n\nProducer: Caroline Bayley.",
            "length": "26864000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02pllvc.mp3"
        },
        {
            "title": "Business Time",
            "datePublished": "Thu, 03 Mar 2011 20:30:00 +0000",
            "description": "The view from the top of business. Presented this week by Stephanie Flanders, The Bottom Line cuts through confusion, statistics and spin to present a clearer view of the business world, through discussion with people running leading and emerging companies.\n\nThis week, Stephanie's top business guests hail from the worlds of retail, IT and pizza. They swap thoughts on the business of timing. Are modern businesses now so obsessed with doing things quickly that they fail to do it well?\n\nAnd as political turmoil continues in the Middle East, the panel debate whether it's important for businesses to keep up with what's happening around the world. How isolated from current events can they be?\n\nStephanie is joined in the studio by David Wild, chief executive of car accessories company Halfords; Mike Norris, chief executive of IT services firm Computacenter; Chris Moore, chief executive of Domino's Pizza UK & Ireland.\n\nProducer: Ben Crighton.",
            "length": "26784000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02pllvr.mp3"
        },
        {
            "title": "Consumer Research",
            "datePublished": "Thu, 24 Feb 2011 20:30:00 +0000",
            "description": "The view from the top of business. Presented by Evan Davis, The Bottom Line cuts through confusion, statistics and spin to present a clearer view of the business world, through discussion with people running leading and emerging companies.\n\nThis week, Evan's top business guests hail from retail and advertising. They swap thoughts on consumer research. Companies spend lots of money to find out how their customers spend theirs, but do they learn anything useful?\n\nThey also debate what purpose business awards serve. Can they actually help a company be more successful?\n\nEvan is joined in the studio by Ian Cheshire, chief executive of home improvement retail company Kingfisher. And from the world of advertising, Cilla Snowball, group chief executive and chairman of Abbott Mead Vickers BBDO, and David Jones, global chief executive of Havas Worldwide.\n\nProducer: Ben Crighton.",
            "length": "26800000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02pllvt.mp3"
        },
        {
            "title": "19/02/2011",
            "datePublished": "Sat, 19 Feb 2011 17:30:00 +0000",
            "description": "The view from the top of business. Presented this week by Stephanie Flanders, The Bottom Line cuts through confusion, statistics and spin to present a clearer view of the business world, through discussion with people running leading and emerging companies.\n\nThis week, Stephanie and her panel of top executives discuss hyperconnectivity - the idea that there are more devices in use around the world than there are people actually using them. How do the panel cope with the sheer mass of incoming information, and devices to carry it? Does more technology mean better communication, or just less time to think?\n\nThey also talk about the role of intuition in making important decisions. Is there still room in modern business for the good old-fashioned hunch, or do decisions these days always need to be backed up by solid analysis?\n\nStephanie is joined in the studio by Dominic Taylor, chief executive of payment services company PayPoint; Rita Clifton, chairman of branding consultancy Interbrand; Sir Michael Rake, chairman of telecoms company BT Group.\n\nProducer: Ben Crighton.",
            "length": "22976000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02pllw4.mp3"
        },
        {
            "title": "10/02/2011",
            "datePublished": "Thu, 10 Feb 2011 21:00:00 +0000",
            "description": "The view from the top of business. Presented this week by Stephanie Flanders, The Bottom Line cuts through confusion, statistics and spin to present a clearer view of the business world, through discussion with people running leading and emerging companies.\n\nThis week, Stephanie and her panel of top executives discuss the impact of political instability on the way they do business.\n\nThey also talk about their employees - many chief executives will say their workers are the company's \"most valuable asset\", but is it really true?\n\nStephanie is joined in the studio by Tim Watkins, vice president of the western arm of Chinese telecommunications company Huawei; Richard Fenning, chief executive of global security consultancy Control Risks; Vineet Nayar, chief executive of Indian IT services company HCL Technologies.\n\nProducer: Caroline Bayley.",
            "length": "26784000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02pllw8.mp3"
        },
        {
            "title": "03/02/2011",
            "datePublished": "Thu, 03 Feb 2011 20:30:00 +0000",
            "description": "The view from the top of business. Presented by Evan Davis, The Bottom Line cuts through confusion, statistics and spin to present a clearer view of the business world, through discussion with people running leading and emerging companies.\n\nThis week, Evan asks his panel of top business executives how they manage to adapt their companies and remain relevant in the modern world. What do you do when technology changes, or fashions move against you? What are the challenges of rejuvenating and transforming a mature business to keep ahead of the curve?\n\nThe panel also discusses which laws get in the way of running a business smoothly and reveal which ones they would most like to scrap.\n\nEvan is joined in the studio by Anne Murphy, UK managing director of frozen foods company Birds Eye; Norbert Teufelberger, chief executive of online gaming firm Bwin; Efrat Peled, chief executive of the fund Arison Investments.\n\nProducer: Ben Crighton.",
            "length": "26768000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02pllwf.mp3"
        },
        {
            "title": "27/01/2011",
            "datePublished": "Thu, 27 Jan 2011 20:30:00 +0000",
            "description": "The view from the top of business. Presented by Evan Davis, The Bottom Line cuts through confusion, statistics and spin to present a clearer view of the business world, through discussion with people running leading and emerging companies.\n\nEvan consults the oracle by asking his panel of top executives to fast-forward five years and forecast how they see the economic landscape in 2016. They discuss raw materials and inflation, and debate who will look stronger - will it be China or India?\n\nThe panel also discusses the value of networking - both real and virtual - for your business and your career.\n\nEvan is joined in the studio by Andy Street, managing director of high street retail chain John Lewis; Nicola Horlick, founder of Bramdean Asset Management; Simon Woodroffe, entrepreneur and founder of YO! Company.\n\nProducer: Ben Crighton.",
            "length": "27008000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02pllwk.mp3"
        },
        {
            "title": "18/11/2010",
            "datePublished": "Thu, 18 Nov 2010 20:45:00 +0000",
            "description": "The view from the top of business. Presented by Evan Davis, The Bottom Line cuts through confusion, statistics and spin to present a clearer view of the business world, through discussion with people running leading and emerging companies.\n\nIn the week that Facebook launched its own new messaging service, Evan and his panel of top business guests discuss the role of email at work, amid the many different ways of messaging and communicating.\n\nAnd location, location, location. It's a cliche that location can make or break a business, but how true is it really? And what are the advantages of being next door to the competition?\n\nEvan is joined in the studio by Chris Grigg, chief executive of property company British Land; Andrew Horton, chief executive of insurance company Beazley; Raghav Bahl, founder of Indian television news group Network 18.\n\nProducer: Ben Crighton\n\nLast in the series. The Bottom Line returns in January 2011.",
            "length": "26992000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02pllwx.mp3"
        },
        {
            "title": "11/11/2010",
            "datePublished": "Thu, 11 Nov 2010 20:45:00 +0000",
            "description": "The view from the top of business. Presented by Evan Davis, The Bottom Line cuts through confusion, statistics and spin to present a clearer view of the business world, through discussion with people running leading and emerging companies.\n\nIn the week that former BP boss Tony Hayward admitted the company had been unprepared for the Gulf of Mexico oil spill in April, Evan and his panel of top business executives consider how companies plan for unexpected events. How prepared actually are they for a crisis or a disaster?\n\nAnd dressing up, dressing down, power dressing, smart casual - they also discuss what to wear at work.\n\nEvan is joined in the studio by Neil Gaydon, chief executive of set-top box maker Pace; Sara Weller, managing director of retail chain Argos; Richard Reed, co-founder of Innocent Drinks.",
            "length": "26768000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02pllx0.mp3"
        },
        {
            "title": "04/11/2010",
            "datePublished": "Thu, 04 Nov 2010 20:45:00 +0000",
            "description": "The view from the top of business. Presented by Evan Davis, The Bottom Line cuts through confusion, statistics and spin to present a clearer view of the business world, through discussion with people running leading and emerging companies.\n\nEvan and a panel of top guests from the worlds of online retail, investment and utilities examine how young upstart companies can outsmart their well-established incumbent opponents, and how those opponents can defend themselves.\n\nThe panel also discusses company names. What makes a good one? And why the business obsession with changing them?\n\nEvan is joined in the studio by Katherine Garrett-Cox, Chief Executive of Alliance Trust, an investment trust; Brent Hoberman, serial internet entrepreneur and founder of web-based furniture company made.com; Phil Bentley, Managing Director of utility company British Gas.",
            "length": "26816000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02pllx3.mp3"
        },
        {
            "title": "28/10/2010",
            "datePublished": "Thu, 28 Oct 2010 19:30:00 +0000",
            "description": "The view from the top of business. Presented by Evan Davis, The Bottom Line cuts through confusion, statistics and spin to present a clearer view of the business world, through discussion with people running leading and emerging companies.\n\nEvan and a panel of guests from the worlds of spirits, security and digital publishing discuss the special relationship between the two people at the top of a company: the chairman and chief executive. Is it a recipe for tension, or a sensible balancing of responsibilities?\n\nThe panel also discusses the merits of youth versus experience in the workplace. What qualities do young people bring to a business compared with their older colleagues - or is there no difference?\n\nEvan is joined in the studio by Séamus McBride, President and Chief Executive of spirits company Bacardi Ltd; Nick Buckles, Chief Executive of security company G4S; Anthony Habgood, Chairman of digital publisher Reed Elsevier and the hotel, coffee shop and restaurant company Whitbread.",
            "length": "27008000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02pllx7.mp3"
        },
        {
            "title": "21/10/2010",
            "datePublished": "Thu, 21 Oct 2010 20:00:00 +0000",
            "description": "The view from the top of business. Presented by Evan Davis, The Bottom Line cuts through confusion, statistics and spin to present a clearer view of the business world, through discussion with people running leading and emerging companies.\n\nEvan and a panel of guests from the worlds of farming, packaging and investment discuss the importance of raw materials - and how the price of commodities affects their companies. \n\nThe panel also discusses emotion. Evan asks his guests how 'touchy feely' they are, as they consider whether business is a place for emotion and sentimentality. \n\nEvan is joined in the studio by William Chase, farmer and entrepreneur; Miles Roberts, chief executive of FTSE250 packaging company DS Smith; Colin Melvin, chief executive of Hermes Equity Ownership Services.",
            "length": "26640000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02pllxj.mp3"
        },
        {
            "title": "14/10/2010",
            "datePublished": "Thu, 14 Oct 2010 20:00:00 +0000",
            "description": "The view from the top of business. Presented by Evan Davis, The Bottom Line cuts through confusion, statistics and spin to present a clearer view of the business world, through discussion with people running leading and emerging companies.\n\nEvan and a panel of guests from the worlds of electronic components, online groceries and information technology discuss the exacting science of business logistics. \n\nThe panel also discusses customer service. Just how high should a company aim in trying to satisfy its consumers?\n\nEvan is joined in the studio by Tim Steiner, co-founder and chief executive of online supermarket Ocado; Nick Wilson, managing director of Hewlett-Packard UK; Ian Mason, chief executive of electronic components company Electrocomponents.",
            "length": "26752000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02pllxs.mp3"
        },
        {
            "title": "07/10/2010",
            "datePublished": "Thu, 07 Oct 2010 19:30:00 +0000",
            "description": "The view from the top of business. Presented by Evan Davis, The Bottom Line cuts through confusion, statistics and spin to present a clearer view of the business world, through discussion with people running leading and emerging companies.\n\nEvan and a panel of guests from the worlds of advertising, branding and lifestyle management discuss viral videos, social networking and some of the other methods companies now employ to reach out to their customers. \n\nThe panel also discusses positive thinking. Is better to be optimistic in business, or realistic? \n\nEvan is joined in the studio by Alex Cheatle, chief executive of the lifestyle management company Ten Group; Jasmine Montgomery, co-founder of branding consultancy Seven Brands; Robin Wight, president of communications group Engine.\n\nProducer: Ben Crighton.",
            "length": "26912000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02pllxw.mp3"
        },
        {
            "title": "30/09/2010",
            "datePublished": "Thu, 30 Sep 2010 20:00:00 +0000",
            "description": "The view from the top of business. Presented by Evan Davis, The Bottom Line cuts through confusion, statistics and spin to present a clearer view of the business world, through discussion with people running leading and emerging companies.\n\nEvan and a panel of guests from the worlds of civil engineering, hedge funds and investment discuss the art of staying ahead of the competition.\n\nThe ruthless former chief executive of General Electric, Jack Welch, often held up as a model of business leadership, pursued a strategy to establish each of GE's businesses as either number one or number two in the market. Without this approach, he believed the company's prospects would be bleak. Some companies will do anything to be big, even if it means cutting prices and making less money. Other businesses are happy to be smaller and more profitable. Which strategy wins?\n\nThe panel also discusses corporate claptrap. Silly jargon, faddish ideas and vacuous concepts - why is the business world so keen on nonsense?\n\nEvan is joined in the studio by Deborah Meaden, entrepreneur and business investor; Keith Clarke, chief executive of FTSE 250 civil engineering and design consultancy Atkins; Hugh Hendry, hedge fund manager and co-founder of Eclectica Asset Management.",
            "length": "26896000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02plly3.mp3"
        },
        {
            "title": "23/09/2010",
            "datePublished": "Thu, 23 Sep 2010 19:30:00 +0000",
            "description": "The view from the top of business. Presented by Evan Davis, The Bottom Line cuts through confusion, statistics and spin to present a clearer view of the business world, through discussion with people running leading and emerging companies.\n\nEvan Davis is joined by a panel of chief executives to discuss the US economy. There was concern over the summer that the world's economic powerhouse could be about to enter a double-dip recession, dragging rest of the world down with it. Those fears might may have now subsided, so how is the US economy actually faring? And can the rest of the world thrive without a booming America? The panel also discusses sponsorship - how companies decide which events to back, and how much to spend.\n\nEvan is joined in the studio by Nani Beccalli-Falco, President and Chief Executive of GE International; Trevor Matthews, Chief Executive of Friends Provident; Mike Lynch, founder and Chief Executive of Autonomy.",
            "length": "26928000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02plly5.mp3"
        }
    ]
}