{
    "artwork": "http://is1.mzstatic.com/image/thumb/Music111/v4/08/31/56/083156cc-6026-62c4-64f7-5c844b9fa136/source/100x100bb.jpg",
    "description": "Matthew Sweet examines philosophical problems with a live audience in a pub",
    "feedURL": "https://podcasts.files.bbci.co.uk/b01lyb82.rss",
    "podcastURL": "http://www.bbc.co.uk/programmes/b01lyb82",
    "title": "The Philosopher's Arms",
    "episodes": [
        {
            "title": "Swearing",
            "datePublished": "Tue, 28 Feb 2017 11:35:00 +0000",
            "description": "Matthew Sweet examines knotty philosophical conundrums in an abstract pub.",
            "length": "26432000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p04v9mkx.mp3"
        },
        {
            "title": "Cake or Biscuit?",
            "datePublished": "Tue, 28 Feb 2017 11:27:00 +0000",
            "description": "Is a Jaffa Cake a cake or a biscuit? A tough question for Matthew Sweet and the drinkers at The Philosopher's Arms, a pub offering both beer and philosophy. Among those helping him resolve this important conundrum are a Cambridge professor of philosophy and a former winner of the Great British Bake Off, who will be turning up in the pub with a very large, and possibly quite tasty, Jaffa Cake.\n        Producer: David Edmonds.",
            "length": "26976000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p04v9m5c.mp3"
        },
        {
            "title": "Hypocrisy",
            "datePublished": "Tue, 28 Feb 2017 11:07:00 +0000",
            "description": "What's wrong with hypocrisy? The Philosopher's Arms, everyone's favourite abstract pub, is back with a pint and a philosophical conundrum. This week, presenter Matthew Sweet is joined at at the bar by philosopher Lisa Bortolotti and political scientist David Runciman. Plus human rights activist, Peter Tatchell, who in the past has publicly exposed people whom he has accused of hypocrisy.\n        Producer: David Edmonds.",
            "length": "26992000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p04v9lct.mp3"
        },
        {
            "title": "Future People",
            "datePublished": "Mon, 21 Dec 2015 12:00:00 +0000",
            "description": "The Philosopher's Arms, presented by Matthew Sweet, asks what sort of people should we bring into the world. In the pub this week are, among others, Oxford University professor Jeff McMahan and disability studies expert Tom Shakespeare.\n        Producer: David Edmonds.",
            "length": "26848000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p03blxhn.mp3"
        },
        {
            "title": "Hate Speech",
            "datePublished": "Mon, 14 Dec 2015 10:00:00 +0000",
            "description": "The Philosopher's Arms, presented by Matthew Sweet, asks whether speech can harm. Helping us come to an answer, we have a philosopher, cartoonist and a man who was arrested for hate speech.",
            "length": "26864000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p03blx5n.mp3"
        },
        {
            "title": "Weakness of Will",
            "datePublished": "Tue, 08 Dec 2015 11:03:00 +0000",
            "description": "The Philosopher's Arms asks how we can, at the same time, both want and not want a cream cake. In the pub we have a philosopher, neuroscientists and champion dieter. And a lot of sugar.",
            "length": "26752000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p03bgvld.mp3"
        },
        {
            "title": "Lying and Misleading",
            "datePublished": "Mon, 30 Nov 2015 11:00:00 +0000",
            "description": "The Philosopher's Arms, presented by Matthew Sweet, asks whether there's a moral difference between lying and misleading. In the pub, to help us reach an answer, we have a philosopher, psychologist and political spin-doctor.",
            "length": "26688000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p039nn0h.mp3"
        },
        {
            "title": "Sex Equality",
            "datePublished": "Mon, 06 Oct 2014 19:15:00 +0000",
            "description": "Pints and philosophical problems with Matthew Sweet. Each week the programme examines a knotty philosophical issue: this week, sex equality and pay. Should we expect women to make up 50% of senior positions and, if they do not, is that evidence of discrimination? In the pub for this episode is the philosopher Janet Radcliffe Richards.\n        \n        Producer: David Edmonds.",
            "length": "26864000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02qj0y7.mp3"
        },
        {
            "title": "Induction",
            "datePublished": "Mon, 22 Sep 2014 19:15:00 +0000",
            "description": "Pints and Philosophical Problems with Matthew Sweet. This week, the problem of induction: are we justified in predicting the future on the basis of what's happened in the past? How do we know that the sun will rise tomorrow? In the snug with Matthew is philosopher Helen Beebee, discussing a conundrum which faces all of us in our daily life - and which raises profound questions about the nature of science.\n        \n        Producer: Luke Mulhall.",
            "length": "26640000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02qfj27.mp3"
        },
        {
            "title": "Trolleyology",
            "datePublished": "Mon, 15 Sep 2014 19:15:00 +0000",
            "description": "Pints and Philosophical Problems with Matthew Sweet. This week, trolleyology: how should you decide between two morally troubling courses of action? This is a question which affects both soldiers in the heat of action and decision-makers in the NHS. Matthew is joined in the snug by philosopher David Edmonds.\n        \n        Producer: Luke Mulhall.",
            "length": "26848000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02qjl80.mp3"
        },
        {
            "title": "Enhancement",
            "datePublished": "Mon, 08 Sep 2014 19:15:00 +0000",
            "description": "Pints and Philosophical Problems with Matthew Sweet. In this series, Matthew asks whether the sun will rise tomorrow, whether one person should be poisoned to save five others and whether a female tennis champion deserves the same prize money as her male counterpart. This week, should we take a pill that would make us less racist and less aggressive? In the snug with Matthew is philosopher Julian Savulescu.",
            "length": "26688000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02qgsq5.mp3"
        },
        {
            "title": "Moral Disgust",
            "datePublished": "Fri, 16 Aug 2013 10:57:00 +0000",
            "description": "Welcome to the Philosopher's Arms. A place where moral dilemmas, philosophical ideas and the real world meet for a chat and a drink. Matthew Sweet presents with a live audience.",
            "length": "26880000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02qgtyk.mp3"
        },
        {
            "title": "The Ultimatum Game",
            "datePublished": "Fri, 16 Aug 2013 10:56:00 +0000",
            "description": "Where do we get our sense of justice and fairness from? Is it hardwired in us? Are we nakedly self-interested creatures, or are we, at least partially, altruistic? These are questions philosophers - from Plato to Hobbes, from Rousseau to David Hume - have pondered for hundreds of years. And a famous game invented by economists- called The Ultimatum Game - may help provide some of the answers. All this is up for discussion and debate this week in The Philosopher's Arms. \n        \n        Welcome to the Philosopher's Arms - a place where philosophical ideas, logical dilemmas and the real world meet for a chat and a drink. Each week Matthew Sweet takes a thought experiment with philosophical pedigree and asks why it matters in the everyday world. En route we'll learn about the thinking of such luminaries as Aristotle, Hume, Kant and John Stuart Mill. And all recorded in a pub in front of a live audience, ready to tap their glasses and demand clarity. \n        \n        Questions we might confront along the way include: should the government put Prozac in the water supply? How should I treat my daughter if it turns out she's a robot? And is there anything morally wrong with having sex with a supermarket chicken? These will lead us into discussions about the treatment of mental illness, the structure of financial markets, and subjects as varied as happiness, infidelity and homosexuality. Our assumptions and intuitions will be challenged and, perhaps, undermined. \n        \n        Producer: David Edmonds.",
            "length": "26448000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02qjvyn.mp3"
        },
        {
            "title": "A Robot Daughter",
            "datePublished": "Fri, 16 Aug 2013 10:54:00 +0000",
            "description": "Welcome to the Philosopher's Arms - a place where moral dilemmas, philosophical ideas and the real world meet for a chat and a drink. Each week Matthew Sweet takes a dilemma with real philosophical pedigree and sees how it matters in the everyday world. \n        \n        This week Matthew discovers that his adopted daughter is a robot. Should he treat her any differently from before? She's indistinguishable from a human so should she have the same status as a human? Philosopher Barry Smith, Autism mentor Robyn Steward; Artificial Intelligence creator Murray Shanahan and all join Matthew for a drink and a bit of advice. \n        \n        Each week in the Philosphers Arms Matthew is joined joined by a cast of philosophers and attendant experts to show how the dilemma's we face in real life connect us to some of the trickiest philosophical problems ever thought up. En route we'll learn about the thinking of such luminaries as Kant, Hume, Aristotle and Wittgenstein. All recorded in a pub in front of a live audience ready to tap their glasses and demand clarity and ask - what's this all got to do with me? \n        \n        So questions such as should the government put prozac in the water supply? And my daughter is a robot, how should I treat her? Lead us into dilemmas, problems and issues from the treatment of mental illness to the structure of financial markets, from animal rights to homosexuality. And they will challenge a few of the assumptions and intuitions about life that we carry round with us. \n        \n        Producer James Cook.",
            "length": "26784000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02qjhpr.mp3"
        },
        {
            "title": "The Experience Machine",
            "datePublished": "Fri, 16 Aug 2013 10:50:00 +0000",
            "description": "Welcome to the Philosopher's Arms - a very special pub where moral dilemmas, philosophical ideas and the real world meet for a chat and a drink. Each week Matthew Sweet takes a dilemma with real philosophical pedigree and sees how it matters in the everyday world. \n        \n        This week he's been offered an Experience Machine. It's a device that guarantees the sensation of a happy and fulfilled life. But it's not real. Should Matthew plug in? David Willets, Jo Wolf and David Geaney join him for a drink to explain the big thinkers behind this idea and debate the nature of happiness, drugs, reality and the role of government. \n        \n        Each week in the Philosphers Arms Matthew is joined by a cast of philosophers and attendant experts to show how the dilemmas we face in real life connect us to some of the trickiest philosophical problems ever thought up. En route we'll learn about the thinking of such luminaries as Kant, Hume, Aristotle and Wittgenstein. All recorded in a pub in front of a live audience ready to tap their glasses and demand clarity and ask - what's this all got to do with me? \n        \n        So questions such as should the government put prozac in the water supply? And my daughter is a robot, how should I treat her? Lead us into dilemmas, problems and issues from the treatment of mental illness to the structure of financial markets, from animal rights to homosexuality. And they will challenge a few of the assumptions and intuitions about life that we carry round with us. \n        \n        Producer David Edmonds.",
            "length": "26592000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02qfwmt.mp3"
        },
        {
            "title": "Morality and the Law",
            "datePublished": "Fri, 16 Aug 2013 10:36:00 +0000",
            "description": "Welcome to the Philosopher's Arms - a place where philosophical ideas, logical dilemmas and the real world meet for a chat and a drink. \n        \n        \n        \n        Each week presenter Matthew Sweet takes a puzzle with philosophical pedigree and asks why it matters in the everyday world. En route we'll learn about the thinking of such luminaries as Aristotle, Hobbes, Hume, Kant, John Stuart Mill and Wittgenstein. All recorded in a pub with an audience, who'll have their own contributions to make - but whose assumptions and intuitions will be challenged and, perhaps, undermined. \n        \n        \n        \n        Propping up the bar this year will be philosophers such as Julian Baggini and Nigel Warburton, and academic experts on memory, the law, art and computers. We'll be meeting bald men, a woman who used to be a man, and a woman who can't remember being a girl. Plus music from The Drifters - a far more philosophical group than you'd ever imagine.\n        \n        This programme is a repeat\n        \n        Producer: David Edmonds\n        \n        Editor: Jeremy Skeet.",
            "length": "26912000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02qgp8n.mp3"
        },
        {
            "title": "Sorites' Heap",
            "datePublished": "Fri, 16 Aug 2013 10:33:00 +0000",
            "description": "Welcome to the Philosopher's Arms - a place where philosophical ideas, logical dilemmas and the real world meet for a chat and a drink. \n        \n        Each week presenter Matthew Sweet takes a puzzle with philosophical pedigree and asks why it matters in the everyday world. En route we'll learn about the thinking of such luminaries as Aristotle, Hobbes, Hume, Kant, John Stuart Mill and Wittgenstein. All recorded in a pub with an audience, who'll have their own contributions to make - but whose assumptions and intuitions will be challenged and, perhaps, undermined. \n        \n        Propping up the bar this year will be philosophers such as Julian Baggini and Nigel Warburton, and academic experts on memory, the law, art and computers. We'll be meeting bald men, a woman who used to be a man, and a woman who can't remember being a girl. Plus music from The Drifters - a far more philosophical group than you'd ever imagine.\n        \n        This programme is a repeat\n        Producer: David Edmonds\n        Editor: Jeremy Skeet.",
            "length": "26736000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02qhr1v.mp3"
        },
        {
            "title": "What Makes a Fake a Fake?",
            "datePublished": "Fri, 16 Aug 2013 10:31:00 +0000",
            "description": "Welcome to the Philosopher's Arms - a place where philosophical ideas, logical dilemmas and the real world meet for a chat and a drink. \n        \n        Each week presenter Matthew Sweet takes a puzzle with philosophical pedigree and asks why it matters in the everyday world. En route we'll learn about the thinking of such luminaries as Aristotle, Hobbes, Hume, Kant, John Stuart Mill and Wittgenstein. All recorded in a pub with an audience, who'll have their own contributions to make - but whose assumptions and intuitions will be challenged and, perhaps, undermined. \n        \n        Propping up the bar this year will be philosophers such as Julian Baggini and Nigel Warburton, and academic experts on memory, the law, art and computers. We'll be meeting bald men, a woman who used to be a man, and a woman who can't remember being a girl. Plus music from The Drifters - a far more philosophical group than you'd ever imagine.\n        \n        This programme is a repeat.\n        \n        The producer was Estelle Doyle.",
            "length": "26448000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02qjhmw.mp3"
        },
        {
            "title": "Moral Blame",
            "datePublished": "Fri, 16 Aug 2013 10:16:00 +0000",
            "description": "Pints and philosophical puzzles with Matthew Sweet. Each week Matthew goes to the pub to discuss a knotty conundrum with an audience and a panel of experts. Free will, exploitation, sex, sexism, blame and shame are just some of the topics to be mulled over in this series of The Philosopher's Arms.\n        Tonight we look at historic wrongs. Can we blame people in the past who held views that we now regard as abhorrent, but which were then widely accepted? The programme features philosopher Miranda Fricker.\n        \n        Producer: David Edmonds.",
            "length": "26704000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02qg9cr.mp3"
        },
        {
            "title": "Free Will",
            "datePublished": "Fri, 16 Aug 2013 10:14:00 +0000",
            "description": "Matthew Sweet is in the pub, discussing a knotty conundrum with an invited audience and a panel of experts. Today it's whether or not we have free will, with philosopher Wayne Martin of the University of Essex and neuroscientist Gemma Calvert, Managing Director of Neurosense. Also featuring Peter Mabbutt and Jo Russell.\n        \n        Producer: Marya Burgess.",
            "length": "26720000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02qhvwk.mp3"
        },
        {
            "title": "Exploitation",
            "datePublished": "Fri, 16 Aug 2013 10:10:00 +0000",
            "description": "Pints and philosophical puzzles with Matthew Sweet. Each week Matthew goes to the pub to discuss a knotty conundrum with an audience and a panel of experts. Free will, sex, sexism, blame and shame are just some of the topics to be mulled over in this series of The Philosopher's Arms.\n        \n        What is 'exploitation' - with philosopher Alex Voorhoeve.\n        \n        Producer: David Edmonds.",
            "length": "26688000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02qhvp7.mp3"
        },
        {
            "title": "Free Riders",
            "datePublished": "Fri, 16 Aug 2013 09:44:00 +0000",
            "description": "Pints and philosophical puzzles with Matthew Sweet. Each week Matthew goes to the pub to discuss a knotty conundrum with an audience and a panel of experts. Free will, exploitation, sex, sexism, blame and shame are just some of the topics to be mulled over in this series of The Philosopher's Arms.\n        \n        We look at the issue of 'free-riding', with Oxford philosopher Roger Crisp.\n        \n        Producer: Estelle Doyle.",
            "length": "26656000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02qh4bp.mp3"
        },
        {
            "title": "Theseus' Ship",
            "datePublished": "Mon, 27 Aug 2012 20:00:00 +0000",
            "description": "Welcome to the Philosopher's Arms - a place where philosophical ideas, logical dilemmas and the real world meet for a chat and a drink. \n        \n        Each week presenter Matthew Sweet takes a puzzle with philosophical pedigree and asks why it matters in the everyday world. En route we'll learn about the thinking of such luminaries as Aristotle, Hobbes, Hume, Kant, John Stuart Mill and Wittgenstein. All recorded in a pub with an audience, who'll have their own contributions to make - but whose assumptions and intuitions will be challenged and, perhaps, undermined. \n        \n        Propping up the bar this year will be philosophers such as Julian Baggini and Nigel Warburton, and academic experts on memory, the law, art and computers. We'll be meeting bald men, a woman who used to be a man, and a woman who can't remember being a girl. Plus music from The Drifters - a far more philosophical group than you'd ever imagine.\n        \n        This programme is a repeat\n        \n        The producer was David Edmonds.",
            "length": "26864000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02p4zbw.mp3"
        }
    ]
}