{
    "artwork": "http://is4.mzstatic.com/image/thumb/Music62/v4/39/15/82/391582e6-a9ef-a2c8-fe77-916f7fa76638/source/100x100bb.jpg",
    "description": "The Growth Show is a podcast for executives and entrepreneurs that shares stories on what it's really like to grow a business, a movement, an idea, or a team. Each week, we sit down with someone who has achieved remarkable growth and unpack how they did it. Get exclusive updates on the podcast, a sneak peek at upcoming guests and more at www.thegrowthshow.com, and if you're listening on iTunes, please make sure to subscribe.",
    "feedURL": "http://thegrowthshow.hubspot.libsynpro.com/rss",
    "podcastURL": "http://www.hubspot.com/podcast",
    "title": "The Growth Show",
    "episodes": [
        {
            "title": "How Minnesota Freedom Fund Scaled Quickly Under International Spotlight",
            "datePublished": "Tue, 10 Nov 2020 05:30:00 +0000",
            "description": "<p><span style=\"font-weight: 400;\">Following the death of George Floyd, Minnesota Freedom Fund found itself in the international spotlight. Over 900 thousand donations, from around the globe, came pouring in. And celebrity endorsements from folks like Mark Ruffalo guided their followers on how to donate and help support protesters.</span></p> <p><span style=\"font-weight: 400;\">As Greg Lewin quickly found out, he needed to not only scale operations at Minnesota Freedom Fund fast but maintain the integrity of its important mission to end discriminatory, coercive, and oppressive jailing.</span></p>",
            "length": "39308704",
            "sourceUrl": "http://chtbl.com/track/28555/traffic.libsyn.com/thegrowthshow/MFF20episode_FINAL.mp3?dest-id=400229",
            "snNo": "6",
            "epNo": "8"
        },
        {
            "title": "How Aequales Is Closing the Gender Gap",
            "datePublished": "Wed, 21 Oct 2020 04:30:00 +0000",
            "description": "<p><span style=\"font-weight: 400;\">On a global scale, women only hold 29 percent of senior management positions. Not to make any sweeping assumptions, but that’s a far cry from gender equality. </span></p> <p><span style=\"font-weight: 400;\">But 29 percent is also the highest percentage ever recorded in that category. And it’s thanks to folks like Mia Perdomo and Andrea de la Piedra -- the co-founders and co-CEOs of Aequales. Their consulting firm provides tools for closing gender gaps in the workplace in Latin America.</span></p>",
            "length": "34549566",
            "sourceUrl": "http://chtbl.com/track/28555/traffic.libsyn.com/thegrowthshow/Aequales_The20Growth20Show_20FINAL.mp3?dest-id=400229",
            "snNo": "6",
            "epNo": "7"
        },
        {
            "title": "Black is Beautiful",
            "datePublished": "Fri, 02 Oct 2020 04:30:00 +0000",
            "description": "<p><span style=\"font-weight: 400;\">Marcus Baskerville created Black is Beautiful -- a collaborative beer initiative amongst the brewing community and its customers -- in an attempt to bring awareness to the injustices that many people of color face daily. </span></p> <p><span style=\"font-weight: 400;\">And you can now find this open source beer at 1,158 breweries, in 50 states, and 21 countries. And As someone who has personally dealt with the abuse of power by the police, this recent turmoil the country is facing has hit home for Marcus.</span></p> <p><span style=\"font-weight: 400;\"><br /> <br /> Find & brew your own can at: <a href= \"https://blackisbeautiful.beer/\">BlackisBeautiful.beer</a></span></p>",
            "length": "18244626",
            "sourceUrl": "http://chtbl.com/track/28555/traffic.libsyn.com/thegrowthshow/Black20is20Beautiful_FINAL.mp3?dest-id=400229",
            "snNo": "6",
            "epNo": "6"
        },
        {
            "title": "Why Personalization Makes BarkBox Leader of the Pack",
            "datePublished": "Tue, 22 Sep 2020 04:00:00 +0000",
            "description": "<p><span style=\"font-weight: 400;\">If you have a dog, then you know BarkBox. It’s customizable monthly subscription boxes are your dog’s favorite pieces of mail.</span></p> <p><span style=\"font-weight: 400;\">Co-founder Matt Meeker believes the secret to the company’s success is putting every four-legged (and two-legged) friend first. </span></p> <p><span style=\"font-weight: 400;\">Matt talks about how a pig, yes a pig, redefined the company’s personalization policies and why BARK has invested so heavily in customer service.</span></p>",
            "length": "32397768",
            "sourceUrl": "http://chtbl.com/track/28555/traffic.libsyn.com/thegrowthshow/Matt20Meeker_FINAL.mp3?dest-id=400229",
            "snNo": "6",
            "epNo": "5"
        },
        {
            "title": "The Future of How We Buy is Sound",
            "datePublished": "Thu, 10 Sep 2020 04:30:00 +0000",
            "description": "<p><span style=\"font-weight: 400;\">Rodney Williams founded LISTNR with one thing in mind: simplicity. He saw that the way we buy items involves too many steps. And it could all be solved through the use of sound.</span></p> <p><span style=\"font-weight: 400;\">LISTNR uses ultrasonic sound to transfer data. That means truly contactless transactions -- be it at the coffee shop, the drive through, or your next concert. Remember concerts?</span></p> <p><br /> <span style=\"font-weight: 400;\">Register for INBOUND 2020:</span> <a href=\"http://www.inbound.com/register\"><span style= \"font-weight: 400;\">Inbound.com/register</span></a></p>",
            "length": "34129404",
            "sourceUrl": "http://chtbl.com/track/28555/traffic.libsyn.com/thegrowthshow/Rodney20Williams_FINAL.mp3?dest-id=400229",
            "snNo": "6",
            "epNo": "4"
        },
        {
            "title": "Why Binging with Babish Says Audience Knows Best",
            "datePublished": "Thu, 03 Sep 2020 04:30:00 +0000",
            "description": "<p><span style=\"font-weight: 400;\">Andrew Rea started Binging with Babish almost by accident. And nearly 8M subscribers later, he’s grown it into one of the biggest shows on YouTube. His secret ingredient? His audience.</span></p> <p><span style=\"font-weight: 400;\">Andrews talks about the show’s steady feed of audience insights and opens up about his own struggles with mental health and recovering from COVID-19.</span></p>",
            "length": "42117248",
            "sourceUrl": "http://chtbl.com/track/28555/traffic.libsyn.com/thegrowthshow/Andrew20Rea_FINAL_clean.mp3?dest-id=400229",
            "snNo": "6",
            "epNo": "3"
        },
        {
            "title": "Real Corporate Anti-Racist Training Starts at the Top",
            "datePublished": "Fri, 24 Jul 2020 04:30:00 +0000",
            "description": "<p><span style=\"font-weight: 400;\">Kim Crowder is a consultant, whose expertise covers diversity, equity, and inclusion. In particular, she’s a corporate anti-racist trainer, helping companies create inclusive marketing and communications. To say the least, Kim has been busy lately.</span></p> <p><span style=\"font-weight: 400;\">The recent protests in the US that started back on May 26 in Minneapolis in response to the death of George Floyd sparked a movement that also had companies taking a hard look at policy bias and racism in their own workplaces. But to make real, lasting change, it all starts at the top.</span></p>",
            "length": "37297538",
            "sourceUrl": "http://chtbl.com/track/28555/traffic.libsyn.com/thegrowthshow/Kim20Crowder_FINAL.mp3?dest-id=400229",
            "snNo": "6",
            "epNo": "2"
        },
        {
            "title": "Yes, You Too Can Become a Servant of Pod",
            "datePublished": "Fri, 17 Jul 2020 04:30:00 +0000",
            "description": "<p><span style=\"font-weight: 400;\">Nick Quah is almost synonymous with podcasts. His newsletter Hot Pod gives a weekly rundown on all things podcasts. And he recently partnered with LAist Studios to create his first podcast called Servant of Pod. And yes, it’s about podcasts. Wait, have we mentioned podcasts?</span></p> <p><span style=\"font-weight: 400;\">Nick talks with Meghan about what went into creating his new show, how businesses are in a unique position to determine the future of podcasting, and why his gut questions whether branded podcasts should exist at all.</span></p>",
            "length": "37541624",
            "sourceUrl": "http://chtbl.com/track/28555/traffic.libsyn.com/thegrowthshow/Nick20Quah20episode_FINAL.mp3?dest-id=400229",
            "snNo": "6",
            "epNo": "1"
        },
        {
            "title": "Trading Camp Canoes for Virtual Classrooms",
            "datePublished": "Fri, 26 Jun 2020 04:30:00 +0000",
            "description": "<p><span style=\"font-weight: 400;\">Tinashe Blanchet is the founder of The Learning Lab, a New Orleans-based non-profit organization and education space that hosts two summer camps. But given the need for social distancing, Tinashe had to quickly move both camps to fully virtual.</span></p> <p><span style=\"font-weight: 400;\">She talks about how, for the safety of everyone at the camps, she stood in opposition of local government recommendations. And Tinashe explains why the work being done today will help shape the way technology is used in classrooms in the future.</span></p>",
            "length": "33091376",
            "sourceUrl": "http://chtbl.com/track/28555/traffic.libsyn.com/thegrowthshow/Tinashe20Blanchet_FINAL.mp3?dest-id=400229",
            "snNo": "5",
            "epNo": "8"
        },
        {
            "title": "Why The Lean Startup Is More Essential Than Ever for Businesses",
            "datePublished": "Thu, 18 Jun 2020 04:30:00 +0000",
            "description": "<p><span style=\"font-weight: 400;\">Steve Blank is not a prophet. But as one of the minds behind the highly influential Lean Startup movement, when Steve starts to look at the future of how we do business, people listen.</span></p> <p><span style=\"font-weight: 400;\">Steve returns to explain why The Lean Startup is even more essential than ever for businesses right now as they work to not only survive the pandemic but set themselves up to thrive coming out of it.</span></p>",
            "length": "33759668",
            "sourceUrl": "http://chtbl.com/track/28555/traffic.libsyn.com/thegrowthshow/Steve20Blank20Returns_FINAL.mp3?dest-id=400229",
            "snNo": "5",
            "epNo": "7"
        },
        {
            "title": "How Indie Theaters Are Bringing the Silver Screen to Your TV Screen",
            "datePublished": "Thu, 11 Jun 2020 04:30:00 +0000",
            "description": "<p><span style=\"font-weight: 400;\">The Coolidge Corner Theater opened in 1933 during the Great Depression and has become a landmark in the city of Boston. But as non-essential businesses were ordered to close, it left many in the film industry wondering: Is it curtains for the indie theater system?</span></p> <p><span style=\"font-weight: 400;\">Katherine Tallman, executive director at Coolidge Corner Theater, talks about pivoting online with Virtual Screening Room and whether she sees on-demand studio releases as the future of our moviegoing experience.</span></p>",
            "length": "36392221",
            "sourceUrl": "http://chtbl.com/track/28555/traffic.libsyn.com/thegrowthshow/Katherine20Tallman_FINAL.mp3?dest-id=400229",
            "snNo": "5",
            "epNo": "6"
        },
        {
            "title": "Part Two: Reading Is a Revolutionary Act",
            "datePublished": "Wed, 03 Jun 2020 04:30:00 +0000",
            "description": "<p><span style=\"font-weight: 400;\">Bookshop is an online platform where you can buy books from local and independent bookstores. But founder Andy Hunter never imagined how quickly he’d need to scale the company after only launching in January.</span></p> <p><span style=\"font-weight: 400;\">That’s because what bookstores were experimenting with in February became what they’d need to survive in March.</span></p> <p><span style=\"font-weight: 400;\">Andy talks about how he’s not only taking on Amazon, but how Bookshop is creating virtual bookseller communities that are reflective and even larger than their physical ones.</span></p>",
            "length": "34405385",
            "sourceUrl": "http://chtbl.com/track/28555/traffic.libsyn.com/thegrowthshow/Andy20Hunter_FINAL.mp3?dest-id=400229",
            "snNo": "5",
            "epNo": "5"
        },
        {
            "title": "Part One: Reading Is a Revolutionary Act",
            "datePublished": "Fri, 29 May 2020 04:30:00 +0000",
            "description": "<p><span style=\"font-weight: 400;\">Danielle Mullen is the owner of Semicolon Bookstore & Gallery -- Chicago’s only black woman-owned bookstore. She’s worked tirelessly to build a community and improve literacy in the city. </span></p> <p><span style=\"font-weight: 400;\">As the current crisis closed bookstores around the country, Danielle moved to online sales. But she wasn’t about to handover her store’s keys to the same online giant that’s put so many other independent bookstores out of business. Instead, she found a new platform.</span></p> <p><br /> <a href= \"https://www.gofundme.com/f/reading-is-a-revolutionary-act?utm_source=customer&utm_medium=copy_link-tip&utm_campaign=p_cp+share-sheet\"> <span style=\"font-weight: 400;\">Support #CleartheShelves</span></a> <span style=\"font-weight: 400;\">and donate books to Chicago Public Schools.</span></p>",
            "length": "36009505",
            "sourceUrl": "http://chtbl.com/track/28555/traffic.libsyn.com/thegrowthshow/Danielle20Mullen_FINAL.mp3?dest-id=400229",
            "snNo": "5",
            "epNo": "4"
        },
        {
            "title": "Same Business. New Flavor.",
            "datePublished": "Wed, 20 May 2020 04:30:00 +0000",
            "description": "<p><span style=\"font-weight: 400;\">Ryan Spaccavento, founder of Coffee on Cue, saw an opportunity for an underserved market of coffee drinkers -- business subscriptions and live events.</span></p> <p><span style=\"font-weight: 400;\">But as companies closed its doors and live events locked its gates, Ryan found his businesses grinding to a halt. So he moved the company online, sold surplus beans to the general public, and distributed fresh coffee to virtual event goers' homes.</span></p>",
            "length": "34476002",
            "sourceUrl": "http://chtbl.com/track/28555/traffic.libsyn.com/thegrowthshow/Ryan20Spaccavento_FINAL.mp3?dest-id=400229",
            "snNo": "5",
            "epNo": "3"
        },
        {
            "title": "How a Community Has Taken the Weight off One Gym’s Shoulders",
            "datePublished": "Wed, 13 May 2020 04:30:00 +0000",
            "description": "<p><span style=\"font-weight: 400;\">Luke Milton of Los Angeles’ top fitness center Training Mate knew he needed to act quickly. His three gym locations were ordered to close and his entire staff’s livelihoods hung in the balance of uncertainty. </span></p> <p><span style=\"font-weight: 400;\">Luke not only moved his gym online within hours, but he brought with it the sense of community that’s won Training Mate so much acclaim. And it's this power of community that’s affirmed his faith in humanity.</span></p>",
            "length": "33264806",
            "sourceUrl": "http://chtbl.com/track/28555/traffic.libsyn.com/thegrowthshow/Luke20Milton_FINAL.mp3?dest-id=400229",
            "snNo": "5",
            "epNo": "2"
        },
        {
            "title": "Keeping Spirits High and Communities Safe",
            "datePublished": "Tue, 05 May 2020 04:30:00 +0000",
            "description": "<p><span style=\"font-weight: 400;\">Listoke Distillery is a gin and distillation school located just north of Dublin, Ireland. Owner Bronagh Conlon, herself a former healthcare worker and survivor of breast cancer, has a unique perspective on the need to protect essential workers and the general public.</span></p> <p><span style=\"font-weight: 400;\">Within hours, she converted the company’s gin distillery to produce hand sanitizer. Bronagh talks about how she made that decision and what’s most important for leaders to focus on right now.</span></p>",
            "length": "31744893",
            "sourceUrl": "http://chtbl.com/track/28555/traffic.libsyn.com/thegrowthshow/Branagh20Conlon20FINAL.mp3?dest-id=400229",
            "snNo": "5",
            "epNo": "1"
        },
        {
            "title": "How Piera Gelardi is Refining 29Rooms",
            "datePublished": "Wed, 22 May 2019 10:30:00 +0000",
            "description": "<p><span style=\"font-weight: 400;\">Piera Gelardi founded Refinery29 as a catalyst for women to claim their power. And today, she leads a digital media and entertainment empire. Piera talks about the important role her customers play in Refinery29 and 29Rooms, and how being a new mother impacts her creativity.</span></p> <p> </p> <p><span style=\"font-weight: 400;\">Listen to <a href= \"t%E2%80%99s%20not%20always%20easy%20to%20share%20your%20story%20%E2%80%94%20especially%20if%20you%20haven%E2%80%99t%20had%20the%20opportunity.%20That%E2%80%99s%20why%20Piera%20Gelardi%20founded%20Refinery29,%20a%20leading%20digital%20media%20company%20focused%20on%20bringing%20women%E2%80%99s%20stories%20to%20life.%20Piera%20talks%20about%20the%20important%20role%20her%20customers%20play%20in%20Refinery29%20and%2029Rooms,%20and%20how%20motherhood%20impacts%20her%20creativity.\"> Weird Work</a> and subscribe now before the new season!</span></p>",
            "length": "45389848",
            "sourceUrl": "http://chtbl.com/track/28555/traffic.libsyn.com/thegrowthshow/Piera20Gelardi_FINAL.mp3?dest-id=400229",
            "snNo": "4",
            "epNo": "11"
        },
        {
            "title": "Bringing Transparency to Women’s Health",
            "datePublished": "Wed, 15 May 2019 10:30:00 +0000",
            "description": "<p><span style=\"font-weight: 400;\">When Katerina Schneider set out to raise funding for her company Ritual, she was four months pregnant. And she was given the choice: Start a company. Or start a family. You cannot do both.</span></p> <p><span style=\"font-weight: 400;\">Kat talks about the early struggles in securing funding, how the mysteries behind vitamins made her launch the company, and why women’s health is essential to the company’s focus.</span></p> <p> </p> <p><span style=\"font-weight: 400;\">Learn more about how HubSpot can help you grow your business at <a href= \"http://www.hubspot.com/CustomerLove\">HubSpot.com/CustomerLove</a></span></p>",
            "length": "44069794",
            "sourceUrl": "http://chtbl.com/track/28555/traffic.libsyn.com/thegrowthshow/Kat20Schneider_FINAL.mp3?dest-id=400229",
            "snNo": "4",
            "epNo": "10"
        },
        {
            "title": "How The Success of Canned Wine Nearly Cost Its Founder Everything",
            "datePublished": "Wed, 08 May 2019 10:30:00 +0000",
            "description": "<p>Ryan Harms and his Union Wine Company were the toast of Oregon. They’d done something so crazy, they figured it was only a matter of time until the novelty wore off. Ryan and his team were responsible for putting wine in a can. And people went crazy for it.</p> <p>But just as things were going well for Ryan and the business, his personal life was falling apart. Ryan shares the mistakes he made along the way, and offers insight into what other first time founders can do to manage their own work/life balance.</p> <p> </p> <p>Learn more about how HubSpot can help you grow your business at <a href= \"http://www.hubspot.com/CustomerLove\">HubSpot.com/CustomerLove</a></p>",
            "length": "38855820",
            "sourceUrl": "http://chtbl.com/track/28555/traffic.libsyn.com/thegrowthshow/Ryan20Harms_FINAL.mp3?dest-id=400229",
            "snNo": "4",
            "epNo": "10"
        },
        {
            "title": "Hipcamp Is a Breath of Fresh Air. Literally.",
            "datePublished": "Wed, 01 May 2019 10:30:00 +0000",
            "description": "<p><span style=\"font-weight: 400;\">Whether you prefer glamping, treehouses, or the trusty old tent, camping is all about getting outside. But navigating the trail to book public or private camping spots is a hassle. So Alyssa Ravasio founded Hipcamp, an online booking site connecting campers with landowners.</span></p> <p><span style=\"font-weight: 400;\">Alyssa talks about the strength and confidence she found in camping at a young age and the three questions she needed to answer before deciding whether or not to found Hipcamp.</span></p> <p> </p> <p>Learn more about how HubSpot can help you grow your business at <a href= \"http://www.hubspot.com/CustomerLove\">HubSpot.com/CustomerLove</a></p>",
            "length": "43393986",
            "sourceUrl": "http://chtbl.com/track/28555/traffic.libsyn.com/thegrowthshow/Alyssa20Ravasio_FINAL.mp3?dest-id=400229",
            "snNo": "4",
            "epNo": "9"
        },
        {
            "title": "The Platform Revolution Is Here",
            "datePublished": "Wed, 24 Apr 2019 10:30:00 +0000",
            "description": "<p><span style=\"font-weight: 400;\">Uber. Amazon. Airbnb. Today’s top platforms all understand the power of connection. And Geoffrey Parker believes the greatest exchange in value comes from companies that put their customers first.</span></p> <p><span style=\"font-weight: 400;\">Geoffrey’s latest work, “Platform Revolution: How Networked Markets Are Transforming the Economy and How to Make Them Work for You,” charts out the future of platforms and reveals how they will change the lives and careers of millions.</span></p> <p> </p> <p><span style=\"font-weight: 400;\">Learn more about how HubSpot can help you grow your business at <a href= \"http://www.hubspot.com/CustomerLove\">HubSpot.com/CustomerLove</a></span></p>",
            "length": "42824380",
            "sourceUrl": "http://chtbl.com/track/28555/traffic.libsyn.com/thegrowthshow/Geoffrey20Parker_FINAL.mp3?dest-id=400229",
            "snNo": "4",
            "epNo": "8"
        },
        {
            "title": "Taking Care/of Your Health Just Got Easier",
            "datePublished": "Wed, 17 Apr 2019 10:30:00 +0000",
            "description": "<p><span style=\"font-weight: 400;\">Let’s be honest. There’s no such thing as a magic pill. But the vitamin industry sure makes it seem like a miracle cure is right there inside every bottle.</span></p> <p><span style=\"font-weight: 400;\">Akash Shah co-founded Care/of, a subscription vitamin company, to make personalized healthy habits simple and transparent. He talks about how Care/of generates word of mouth marketing and where companies can build more trust with their customers.</span></p> <p> </p> <p>Learn more about how HubSpot can help you grow your business at <a href= \"http://www.hubspot.com/CustomerLove\">HubSpot.com/CustomerLove</a></p>",
            "length": "43436044",
            "sourceUrl": "http://chtbl.com/track/28555/traffic.libsyn.com/thegrowthshow/Akash20Shah_FINAL.mp3?dest-id=400229",
            "snNo": "4",
            "epNo": "7"
        },
        {
            "title": "The Case for Cubes: Closing the Door on Open Offices",
            "datePublished": "Fri, 12 Apr 2019 10:30:00 +0000",
            "description": "<p><span style=\"font-weight: 400;\">There’s a new trend in office design. And its common enemy? The open office floor plan. Phone booths that once littered our sidewalks have been given new life inside our modern offices.</span></p> <p><span style=\"font-weight: 400;\">Producer Matt Brown joins us to break down why so many companies are answering the call to install private rooms in the office.</span></p>",
            "length": "14059384",
            "sourceUrl": "http://chtbl.com/track/28555/traffic.libsyn.com/thegrowthshow/Cubicall_FINAL.mp3?dest-id=400229",
            "snNo": "4",
            "epNo": "6"
        },
        {
            "title": "Brace Yourself, Quip Is Changing Everything About Dental Care",
            "datePublished": "Wed, 10 Apr 2019 10:30:00 +0000",
            "description": "<p><span style=\"font-weight: 400;\">You know the drill. Quick brush in the morning, neglect the afternoon floss, and win your week with a second brush a few nights a week. Changing habits is hard, especially when it comes to dental care.</span></p> <p><span style=\"font-weight: 400;\">Simon Enever founded Quip to fix oral care. He talks about the role of messaging in the early years, how customers are helping influence new products, and the company’s recent foray into selling offline.</span></p> <p><br /> <br /> <span style=\"font-weight: 400;\">Learn more about how HubSpot can help you grow your business at</span> <a href= \"http://www.hubspot.com/CustomerLove\"><span style= \"font-weight: 400;\">HubSpot.com/CustomerLove</span></a></p>",
            "length": "43344016",
            "sourceUrl": "http://chtbl.com/track/28555/traffic.libsyn.com/thegrowthshow/Simon20Enever_FINAL.mp3?dest-id=400229",
            "snNo": "4",
            "epNo": "5"
        },
        {
            "title": "Finding Humanity in Technology",
            "datePublished": "Wed, 03 Apr 2019 10:00:00 +0000",
            "description": "<p><span style=\"font-weight: 400;\">Artificial Intelligence. Automation. Bots. Technology has disrupted nearly every aspect of our daily lives. But author Kate O’Neill asks the question, where is all this technology headed? And are we steering that technology to create the best future, for the most people?</span> <span style= \"font-weight: 400;\"><br /></span></p> <p><span style=\"font-weight: 400;\">In her latest work “Tech Humanist: How Data and Technology Shape the Future of Meaningful Human Experiences,” Kate explores how we can create more meaningful, intentional, and integrated experiences that better align with businesses and people.</span></p> <p> </p> <p><span style=\"font-weight: 400;\">Learn more about how HubSpot can help you grow your business at <a href= \"http://www.hubspot.com/CustomerLove\">HubSpot.com/CustomerLove</a></span></p>",
            "length": "44393762",
            "sourceUrl": "http://chtbl.com/track/28555/traffic.libsyn.com/thegrowthshow/Kate20O27Neill_FINAL.mp3?dest-id=400229",
            "snNo": "4",
            "epNo": "4"
        },
        {
            "title": "Outdoor Apparel Doesn’t Have to Be Ugly",
            "datePublished": "Fri, 29 Mar 2019 10:00:00 +0000",
            "description": "<p>[Mini Episode] Topo Designs president Jedd Rose believes outdoor apparel design deserves better. And this week, producer Matt Brown helps us unpack how the company designs for urban and outdoor life.</p> <p>Jedd talks about the company’s design principles and tells us why the best outdoor gear has more to do with memories than fabrics.</p>",
            "length": "13851282",
            "sourceUrl": "http://chtbl.com/track/28555/traffic.libsyn.com/thegrowthshow/Topo20Designs20minisode_FINAL.mp3?dest-id=400229",
            "snNo": "4",
            "epNo": "3"
        },
        {
            "title": "Hims: Baldness. Cold Sores. ED. Optional.",
            "datePublished": "Wed, 27 Mar 2019 10:30:00 +0000",
            "description": "<p><span style=\"font-weight: 400;\">Hims founder Andrew Dudum knew that less than 10 percent of men feel comfortable talking about their looks and health with their doctor. But even getting people to the doctor meant conflicting work schedules, travel, and countless more headaches along the way.</span></p> <p><span style=\"font-weight: 400;\">So Andrew decided to not only destigmatize men’s self-care, but make access to prescriptions, products and medical advice easier and more affordable.</span><br /> <br /></p> <p><span style=\"font-weight: 400;\">Learn more about how HubSpot can help you grow your business at</span> <a href= \"http://www.hubspot.com/CustomerLove\"><span style= \"font-weight: 400;\">HubSpot.com/CustomerLove</span></a></p>",
            "length": "44760073",
            "sourceUrl": "http://chtbl.com/track/28555/traffic.libsyn.com/thegrowthshow/Andrew20Dudum_FINAL.mp3?dest-id=400229",
            "snNo": "4",
            "epNo": "2"
        },
        {
            "title": "Why ThirdLove's Heidi Zak Called Out Victoria’s Secret for Not Supporting Women ",
            "datePublished": "Wed, 20 Mar 2019 07:00:00 +0000",
            "description": "<p><span style=\"font-weight: 400;\">When Ed Razek, the CMO of Victoria’s Secret, made disparaging comments about Heidi Zak’s company ThirdLove, she stood up for herself and all women. Her response? An Open Letter to Victoria’s Secret in The New York Times.</span></p> <p><span style=\"font-weight: 400;\">We talk with Heidi about the open letter, the aftermath that followed, and share the story of lingeries’ most interesting challenger brand.</span></p> <p><br /> <br /> <span style=\"font-weight: 400;\">Learn more about how HubSpot can help you grow your business at</span> <a href= \"http://www.hubspot.com/customerlove\"><span style= \"font-weight: 400;\">HubSpot.com/CustomerLove</span></a></p>",
            "length": "44512414",
            "sourceUrl": "http://chtbl.com/track/28555/traffic.libsyn.com/thegrowthshow/ThirdLove20FINAL.mp3?dest-id=400229",
            "snNo": "4",
            "epNo": "1"
        },
        {
            "title": "How Brandless Is Democratizing Access to Quality",
            "datePublished": "Wed, 19 Dec 2018 11:30:00 +0000",
            "description": "<p><span style=\"font-weight: 400;\">For most shoppers, fair trade, organic, non-GMO products means paying a premium. And the amount of choices? Endless. But conscious consumerism doesn't have to equal uninformed decisions and an empty bank account.</span></p> <p><span style=\"font-weight: 400;\">Brandless, which charges $3 for a variety of products, is changing this equation. Founder Tina Sharkey talks about her mission to democratize access to high-quality goods, redefine what brand means, and scale the Brandless business alongside its community.</span></p>",
            "length": "31833046",
            "sourceUrl": "http://chtbl.com/track/28555/traffic.libsyn.com/thegrowthshow/Tina20Sharkey_FINAL.mp3?dest-id=400229",
            "snNo": "3",
            "epNo": "13"
        },
        {
            "title": "Cracking The Culture Code",
            "datePublished": "Wed, 12 Dec 2018 11:30:00 +0000",
            "description": "<p><span style=\"font-weight: 400;\">Culture happens. Whether you plan for it or not, all companies have a culture. An no one knows more about how culture works than New York Times’s best-selling author Daniel Coyle.</span></p> <p><span style=\"font-weight: 400;\">Daniel talks about his latest work, The Culture Code, where he goes inside the world’s most successful organizations - Pixar, San Antonio Spurs, SEAL Team Six, and more - to find out what makes them tick.</span></p>",
            "length": "54219300",
            "sourceUrl": "http://chtbl.com/track/28555/traffic.libsyn.com/thegrowthshow/Dan20Coyle_FINAL.mp3?dest-id=400229",
            "snNo": "3",
            "epNo": "12"
        },
        {
            "title": "Why Rejecting $30 Million From Mark Cuban Was Her Best Business Move",
            "datePublished": "Wed, 05 Dec 2018 11:30:00 +0000",
            "description": "<p><span style=\"font-weight: 400;\">It was the largest offer in</span> <em><span style=\"font-weight: 400;\">Shark Tank</span></em> <span style=\"font-weight: 400;\">history. Mark Cuban offered Arum Kang $30 million for her dating app Coffee Meets Bagel. But she and her sisters swiped left, and that decision made them the targets of keyboard cowboys who labeled them “foolish” and “greedy”.</span></p> <p><span style=\"font-weight: 400;\">There was a specter of self-doubt, a discovery of the company’s real values, and a final rise above all the noise. Three years later, Kang feels zero regret for her decision to pass on the Shark’s tantalizing offer.</span></p>",
            "length": "33543420",
            "sourceUrl": "http://chtbl.com/track/28555/traffic.libsyn.com/thegrowthshow/Arum20Kang_FINAL.mp3?dest-id=400229",
            "snNo": "3",
            "epNo": "11"
        },
        {
            "title": "Building an Outdoors Brand Around People",
            "datePublished": "Wed, 28 Nov 2018 11:30:00 +0000",
            "description": "<p><span style=\"font-weight: 400;\">Davis Smith grew up like every other kid -- spearfishing piranhas in the Amazon, eating wild coconuts for snacks, and taking family adventures around Central and South America.</span></p> <p><span style=\"font-weight: 400;\">During these early years, Davis also saw the abject poverty that others lived in first-hand. So he founded Cotopaxi, an outdoor brand committed to alleviating poverty and empowering communities through entrepreneurship.</span></p>",
            "length": "36252986",
            "sourceUrl": "http://chtbl.com/track/28555/traffic.libsyn.com/thegrowthshow/Davis20Smith20interview_FINAL.mp3?dest-id=400229",
            "snNo": "3",
            "epNo": "10"
        },
        {
            "title": "How Spartan is Growing a 100 Million Warrior Movement",
            "datePublished": "Wed, 21 Nov 2018 11:30:00 +0000",
            "description": "<p><span style=\"font-weight: 400;\">Joe De Sena founded Spartan with a single purpose: to change people’s lives.</span></p> <p><span style=\"font-weight: 400;\">But growing the company has been the toughest race of Joe’s life. Its meant persevering through a near death experience, pivoting after a decade of failing business models, and setting one of the most ambitious growth goals ever.</span></p> <p><br /> <br /> <span style=\"font-weight: 400;\">Check out HubSpot’s new documentary</span> <a href= \"http://bit.ly/brilliant-spartan\"><em><span style= \"font-weight: 400;\">BRILLIANT</span></em></a><span style= \"font-weight: 400;\">, which tells the untold stories of brilliant people and the things that make them human. The first episode follows Joe De Sena and his journey of building Spartan.</span></p>",
            "length": "56222634",
            "sourceUrl": "http://chtbl.com/track/28555/traffic.libsyn.com/thegrowthshow/Joe20De20Sena20Spartan_FINAL.mp3?dest-id=400229",
            "snNo": "3",
            "epNo": "9"
        },
        {
            "title": "Amazon Has Spoken. And the HQ2 Winners are… Amazon.",
            "datePublished": "Sat, 17 Nov 2018 11:30:00 +0000",
            "description": "<p><span style=\"font-weight: 400;\">[News] Amazon has officially announced the locations for the company’s second headquarters -- Crystal City, Virginia, and Long Island City, New York.</span></p> <p><span style=\"font-weight: 400;\">But with the announcement comes controversy. HubSpot’s resident news writer Amanda Zantal-Wiener joins us to break it all down.</span></p> <p><br /> <span style=\"font-weight: 400;\">Read Amanda’s</span> <a href= \"http://bit.ly/2Fry7iq\"><span style=\"font-weight: 400;\">news article</span></a> <span style=\"font-weight: 400;\">on the HQ2 announcement here.</span></p>",
            "length": "11202706",
            "sourceUrl": "http://chtbl.com/track/28555/traffic.libsyn.com/thegrowthshow/Amazon20HQ2_FINAL.mp3?dest-id=400229",
            "snNo": "3",
            "epNo": "8"
        },
        {
            "title": "Your Next Insurance Agent Is a Bot",
            "datePublished": "Wed, 14 Nov 2018 11:30:00 +0000",
            "description": "<p>If there’s one thing everyone can agree on, it’s how much they loathe insurance companies. And yet, despite every technological revolution, the insurance industry continues to operate basically the same way it did in the Middle Ages.</p> <p>Dan Schreiber, co-founder of Lemonade, saw the fundamental wrong of insurance: If people don’t get paid for claims, insurance companies make more money. So he aligned the company with its customers and created a bot to make the process surprisingly more human.</p>",
            "length": "36115744",
            "sourceUrl": "http://chtbl.com/track/28555/traffic.libsyn.com/thegrowthshow/Daniel20Schreiber_FINAL.mp3?dest-id=400229",
            "snNo": "3",
            "epNo": "7"
        },
        {
            "title": "Beep Boop Chop Chop: Robot Chefs Are Taking Over",
            "datePublished": "Fri, 09 Nov 2018 11:30:00 +0000",
            "description": "<p><span style=\"font-weight: 400;\">[Mini Episode] The robots have arrived. Welcome! First stop: the kitchen. So we asked, is that really all that bad a thing?</span></p> <p><span style=\"font-weight: 400;\">We sit down with robot restaurateur Michael Farid of Spyce to hear about why standing over hot stoves, endlessly stirring, chopping, and plating food might just be a thing of the past.</span></p>",
            "length": "12671829",
            "sourceUrl": "http://chtbl.com/track/28555/traffic.libsyn.com/thegrowthshow/Spyce20Mini20Episode_FINAL.mp3?dest-id=400229",
            "snNo": "3",
            "epNo": "6"
        },
        {
            "title": "How Rand Fishkin Went From Debt Collectors to Rejecting VCs",
            "datePublished": "Wed, 07 Nov 2018 11:30:00 +0000",
            "description": "<p><span style=\"font-weight: 400;\">After founding and stepping away from Moz, Rand Fishkin finds himself back in the startup world. Only this time, he’s doing things differently.</span></p> <p><span style=\"font-weight: 400;\">In this live recording from INBOUND 2018, we talk to The Wizard of Moz about why he now refuses venture capital, how he’s helping SparkToro grow better, and what it’s like to play Dungeons & Dragons with Anita Sarkeesian.</span></p>",
            "length": "38079282",
            "sourceUrl": "http://chtbl.com/track/28555/traffic.libsyn.com/thegrowthshow/Rand20Fishkin_FINAL.mp3?dest-id=400229",
            "snNo": "3",
            "epNo": "5"
        },
        {
            "title": "How Glossier Is Giving the Beauty Industry a Makeover",
            "datePublished": "Wed, 31 Oct 2018 10:30:00 +0000",
            "description": "<p><span style=\"font-weight: 400;\">Beauty is a $450 billion industry. But traditionally, communication on beauty routines and products came from companies, not other customers. That is, until a little blog named Into the Gloss was launched.</span></p> <p><span style=\"font-weight: 400;\">Using customer insights, the blog launched Glossier -- it’s own line of beauty products. Ali Weiss tells us how Glossier is giving the makeup industry got a much-needed makeover.</span></p>",
            "length": "36473846",
            "sourceUrl": "http://chtbl.com/track/28555/traffic.libsyn.com/thegrowthshow/Glossier_Ali20Weiss_Final.mp3?dest-id=400229",
            "snNo": "3",
            "epNo": "4"
        },
        {
            "title": "The AI Overlords Have Come for Your Instagram Feed",
            "datePublished": "Fri, 26 Oct 2018 09:30:00 +0000",
            "description": "<p><span style=\"font-weight: 400;\">[Mini Episode] Take a look at your Instagram feed. You likely follow a few different influencers. But look a bit closer. Are each and every one of them human? Not if you’re one of the 1.5M followers of Lil’ Miquela.</span></p> <p><span style=\"font-weight: 400;\">The rise in AI influencers might not be the stuff of nightmares or summer blockbusters, but it’s not that far off. Our producer Matthew Brown talks with Chris Detert of Influential about our human(less) future.</span></p>",
            "length": "11601238",
            "sourceUrl": "http://chtbl.com/track/28555/traffic.libsyn.com/thegrowthshow/AI20Influencers_FINAL2.mp3?dest-id=400229",
            "snNo": "3",
            "epNo": "3"
        },
        {
            "title": "Payal Kadakia on Building ClassPass and Stepping Down as CEO",
            "datePublished": "Wed, 24 Oct 2018 09:30:00 +0000",
            "description": "<p><span style=\"font-weight: 400;\">Movement is the art of change. You pass through one physical location to the next, with decisions at every step. And whether that’s in dance or starting a company, movement is what inspires us.</span></p> <p><span style=\"font-weight: 400;\">Payal Kadakia has fought to keep dance in her life since she started at a young age. But doing so has taken a number of tough decisions -- some that could have derailed her entire career. We caught up with Payal for a live recording at INBOUND 2018. She tells us how she knew when to start ClassPass, and more recently, when to step down as CEO.</span></p>",
            "length": "37472572",
            "sourceUrl": "http://chtbl.com/track/28555/traffic.libsyn.com/thegrowthshow/Payal20Kadakia20FINAL.mp3?dest-id=400229",
            "snNo": "3",
            "epNo": "2"
        },
        {
            "title": "MoonPie’s Social Eclipse of the Heart",
            "datePublished": "Wed, 17 Oct 2018 06:45:00 +0000",
            "description": "<p><span style=\"font-weight: 400;\">It’s August 21, 2017. There’s only one thing on people’s minds: The solar eclipse.</span></p> <p><span style=\"font-weight: 400;\">Every brand under the sun jockeyed for the cultural zeitgeist, but it was MoonPie — throwing a little shade at Hostess — that won the day. The company’s viral tweet “Lol ok” broke brand social records, and the ensuing demand sold out stores and even caused their bakery to shutdown. Who said social was only good for engagement?</span></p> <p><span style=\"font-weight: 400;\">Dooley Tombras gives us a look into how how he made a humble snack cake one of the most out of this world brands on social.</span></p>",
            "length": "35122299",
            "sourceUrl": "http://chtbl.com/track/28555/traffic.libsyn.com/thegrowthshow/Dooley20Tombras_MoonPie_FINAL.mp3?dest-id=400229",
            "snNo": "3",
            "epNo": "1"
        },
        {
            "title": "The Turnaround: Kristen Kish",
            "datePublished": "Tue, 10 Apr 2018 09:00:00 +0000",
            "description": "<p>Kristen Kish’s road to Season 10 of Top Chef was winding, to say the least. She tried out business school for a spell, got in way over her head as an executive chef, and ended up working for one of the best-known culinary icons in the world. And the entire time, she was struggling with her own identity.</p> <p>In the last episode of The Turnaround season, we explain why appearing on Top Chef was only the second biggest turnaround in Kristen’s life.</p>",
            "length": "33195754",
            "sourceUrl": "http://chtbl.com/track/28555/traffic.libsyn.com/thegrowthshow/KristenKish.mp3?dest-id=400229",
            "snNo": "2",
            "epNo": "7"
        },
        {
            "title": "The Turnaround: Market Basket",
            "datePublished": "Tue, 03 Apr 2018 09:00:00 +0000",
            "description": "<p>During the Summer of 2014, customers and employees of Market Basket boycotted the company, demanding that the board of trustees reinstate Arthur T. Demoulas, the beloved president and CEO of the grocery store chain.</p> <p>This week, we tell the story of that protest, which is a good reminder that the people sitting around a boardroom table aren’t the only ones who own a company.</p>",
            "length": "28373661",
            "sourceUrl": "http://chtbl.com/track/28555/traffic.libsyn.com/thegrowthshow/MarketBasket.mp3?dest-id=400229",
            "snNo": "2",
            "epNo": "6"
        },
        {
            "title": "The Turnaround: The World’s Only Curious George Store",
            "datePublished": "Tue, 27 Mar 2018 09:00:00 +0000",
            "description": "<p>The World’s Only Curious George Store sits in the heart of Harvard Square. It’s been there, in some form, since 1995. But behind the bright colors and the cheery facade, there’s been a fight raging to keep the store open since day one.</p> <p>In today’s episode, we tell the dramatic and little-known story of literature’s most mischievous monkey.</p>",
            "length": "35068627",
            "sourceUrl": "http://chtbl.com/track/28555/traffic.libsyn.com/thegrowthshow/Curious20George.mp3?dest-id=400229",
            "snNo": "2",
            "epNo": "5"
        },
        {
            "title": "The Turnaround: Nintendo",
            "datePublished": "Tue, 20 Mar 2018 09:00:00 +0000",
            "description": "<p>Nintendo is known for constantly reinventing the video game landscape. But a few years ago, they had just released their slowest-selling product of all time. Sales were so bad that the president of the company cut his salary in half. And for the first time since entering the video game market, they were operating at a loss.</p> <p>In today’s episode, we look at how they got there. And how they managed to turn things around.</p>",
            "length": "38453948",
            "sourceUrl": "http://chtbl.com/track/28555/traffic.libsyn.com/thegrowthshow/Nintendo.mp3?dest-id=400229",
            "snNo": "2",
            "epNo": "4"
        },
        {
            "title": "The Turnaround: Absinthe",
            "datePublished": "Tue, 13 Mar 2018 09:00:00 +0000",
            "description": "<p>Before it was banned for nearly a century, absinthe used to be one of the most popular drinks in the world. But somewhere along the way, it got a reputation for making people hallucinate and even go insane.</p> <p>How did it get such a bad reputation? Why was it made illegal in countries around the world for so long? And how did an entire industry come back from such dire straits?</p>",
            "length": "40936181",
            "sourceUrl": "http://chtbl.com/track/28555/traffic.libsyn.com/thegrowthshow/Absinthe.mp3?dest-id=400229",
            "snNo": "2",
            "epNo": "3"
        },
        {
            "title": "The Turnaround: Narragansett Brewing Company",
            "datePublished": "Tue, 06 Mar 2018 10:00:00 +0000",
            "description": "<p>Mark Hellendrung visited a local pub in his home town in Rhode Island. He was just looking for a drink, but he found himself on a journey to bring back the 125-year-old beer brand locals call ‘Gansett.</p> <p>But how do you balance tradition with innovation? With the weight of an entire community (and generations more) behind him, Mark finally brought The Narragansett Beer Company back home.</p> <p>“<em>No industry relies more upon the</em> good will<em>, neighborliness, and friendship of the public than does the brewing business.</em>” - Carl W. Haffenreffer (Former Vice President & Co-Owner, Narragansett Brewing Company)</p>",
            "length": "36363943",
            "sourceUrl": "http://chtbl.com/track/28555/traffic.libsyn.com/thegrowthshow/Narragansett20Beer20Company.mp3?dest-id=400229",
            "snNo": "2",
            "epNo": "2"
        },
        {
            "title": "The Turnaround: Coming Soon",
            "datePublished": "Tue, 20 Feb 2018 10:00:00 +0000",
            "description": "<p><span style=\"font-weight: 400;\">Our new season -- The Turnaround -- is right around the corner, but we wanted to give you a little preview of what’s to come. In this mini-episode, Dan Pink and Steve Blank both return to the show, and we ask them about a turnaround from their own lives.</span></p> <p><span style=\"font-weight: 400;\">Have a turnaround story of your own? Record a voice memo, and send it to</span> <a href= \"mailto:hello@thegrowthshow.com\"><span style= \"font-weight: 400;\">hello@thegrowthshow.com</span></a><span style= \"font-weight: 400;\">. You could end up on a future episode of the show!</span></p> <p><a href= \"https://soundcloud.com/the-growth-show/dan-pink-robots-wont-steal\"> <span style=\"font-weight: 400;\">Dan’s original episode</span></a></p> <p><a href= \"https://soundcloud.com/the-growth-show/taking-the-lean-startup-from\"> <span style=\"font-weight: 400;\">Steve’s original episode</span></a></p>",
            "length": "23678702",
            "sourceUrl": "http://chtbl.com/track/28555/traffic.libsyn.com/thegrowthshow/Mini-episode.mp3?dest-id=400229",
            "snNo": "2",
            "epNo": "1"
        },
        {
            "title": "We’ll See You in 2018!",
            "datePublished": "Tue, 31 Oct 2017 09:30:00 +0000",
            "description": "<p><span style=\"font-weight: 400;\">After nearly three years, The Growth Show is officially taking a break. But we’re not stopping, by any means. We’ve already begun production on our next season.</span></p> <p><span style=\"font-weight: 400;\">We got the inspiration for the new season from Narragansett Brewing Company. A story of a titan of industry, falling on hard times, only to rise from the (literal) ashes once more. You’ll hear how they -- and other companies that faced near extinction -- pulled off an epic company turnaround.</span></p> <p><span style=\"font-weight: 400;\">So we’ll be back in 2018 with all new episodes, telling all new stories of companies bringing themselves back from the brink. Until then, subscribe to the podcast and we’ll see you in the New Year!</span></p>",
            "length": "6436134",
            "sourceUrl": "http://chtbl.com/track/28555/traffic.libsyn.com/thegrowthshow/Season20One20Finale20Episode_FINAL.mp3?dest-id=400229",
            "snNo": "2"
        },
        {
            "title": "From Marketing to Mountain Biking: How to Learn Anything",
            "datePublished": "Tue, 24 Oct 2017 09:30:00 +0000",
            "description": "<p>We spend so much of our life in school -- with classes, teachers, tests, and papers. So when structured learning isn’t around anymore, it can be jarring. Like your training wheels just got removed.</p> <p>Noah Kagan, the Chief Sumo at Sumo.com, has trained himself to keep learning new things all the time. Today on the show, he tells us how he manages to keep learning new skills, whether it’s marketing, mountain biking, or anything in between.</p>",
            "length": "40502140",
            "sourceUrl": "http://chtbl.com/track/28555/traffic.libsyn.com/thegrowthshow/Noah20Kagan.mp3?dest-id=400229",
            "snNo": "1",
            "epNo": "157"
        },
        {
            "title": "From Brain Teasers to Technical Tests: How to Fix Hiring in Tech",
            "datePublished": "Tue, 17 Oct 2017 09:30:00 +0000",
            "description": "<p>If you’ve ever applied for a job in tech, you know just how painful it can be. Technical tests consume hours of your time, brain teasers leave you baffled, and culture fit questions juice your stress levels. On top of all this, you’re likely still trying to hold down your current position.</p> <p>Jason Shen, CEO and Co-Founder of Headlight, has spent months asking around to see how companies are hiring today. His results are telling, and they’ve given him an idea of how we should be hiring instead.</p>",
            "length": "42683380",
            "sourceUrl": "http://chtbl.com/track/28555/traffic.libsyn.com/thegrowthshow/Jason20Shen.mp3?dest-id=400229",
            "snNo": "1",
            "epNo": "156"
        },
        {
            "title": "Building LEGO’s Next Big Move, Brick by Brick",
            "datePublished": "Tue, 10 Oct 2017 09:00:00 +0000",
            "description": "<p>When you’re one of the most recognizable companies on the planet, how do you decide on your next big idea? If you’re Michael McNally, you think about it all the time.</p> <p>Michael is the Senior Director of Brand Relations at LEGO, and he’s gone from building LEGO cities in his basement to rolling the world’s largest LEGO model into downtown Manhattan. Michael tells us how he approaches partnerships, gets his team out of creative ruts, and what it’s like meeting some memorable longtime LEGO fans.</p>",
            "length": "37834832",
            "sourceUrl": "http://chtbl.com/track/28555/traffic.libsyn.com/thegrowthshow/Michael20McNally20Rebroadcast.mp3?dest-id=400229",
            "snNo": "1",
            "epNo": "155"
        },
        {
            "title": "How one entrepreneur added 700+ people to her network",
            "datePublished": "Tue, 03 Oct 2017 09:00:00 +0000",
            "description": "<p>Every single day at 9:15 AM, Molly Beck reaches out to a new person in her network. And if you’re trying to get to the next level in your career, you might want to consider doing the same thing.</p> <p>Molly is an entrepreneur and the author of a book called ‘Reach Out: The Simple Strategy You Need to Expand Your Network and Increase Your Influence.’ She tells us how she starts genuine professional relationships, why we need to move beyond the coffee date, and the story of the worst reach out experience she’s had recently.</p>",
            "length": "55868556",
            "sourceUrl": "http://chtbl.com/track/28555/traffic.libsyn.com/thegrowthshow/Molly20Beck.mp3?dest-id=400229",
            "snNo": "1",
            "epNo": "154"
        },
        {
            "title": "Introducing… Weird Work",
            "datePublished": "Tue, 26 Sep 2017 09:30:00 +0000",
            "description": "<p><span style=\"font-weight: 400;\">Check out HubSpot’s latest podcast, called</span> <a href= \"https://itunes.apple.com/us/podcast/weird-work/id1281393532?mt=2\"><span style=\"font-weight: 400;\"> Weird Work</span></a><span style=\"font-weight: 400;\">! Each week, host Sam Balter talks with folks who work some of the weirdest jobs out there. The new show features guests like a dinosaur erotica writer, a professional bridesmaid, and an ASMR artist.</span></p> <p><span style=\"font-weight: 400;\">In this episode, Meghan talks with Sam about what listeners are in for, the reason HubSpot is focusing on people with weird jobs, and why the people with the strangest jobs are actually a lot more normal than Sam’s own co-workers.</span></p>",
            "length": "7156874",
            "sourceUrl": "http://chtbl.com/track/28555/traffic.libsyn.com/thegrowthshow/Sam202620Meghan20Interview_FINAL.mp3?dest-id=400229",
            "snNo": "1",
            "epNo": "153"
        },
        {
            "title": "Beyond Meat’s Mission to Convert the Hardcore Carnivore",
            "datePublished": "Tue, 19 Sep 2017 09:30:00 +0000",
            "description": "<p><span style=\"font-weight: 400;\">Innovation is great when it’s in an iPhone. But is it something you want to put inside your mouth? We rarely think of technology’s impact on our taste buds. But one company is on mission to use tech as a way to shift the entire food culture. That’s right, meat industry. Your days are numbered.</span></p> <p><span style=\"font-weight: 400;\">Ethan Brown at Beyond Meat is hoping his company’s mission of sustainable, plant-based protein will convert even the most hardcore carnivore. Lofty goals, but he tells us how you too can evolve your own company’s mission to create real change in the world.</span></p>",
            "length": "12375610",
            "sourceUrl": "http://chtbl.com/track/28555/traffic.libsyn.com/thegrowthshow/Ethan20Brown_FINAL.mp3?dest-id=400229",
            "snNo": "1",
            "epNo": "152"
        },
        {
            "title": "The Future Workforce Is Human to the Bot Power",
            "datePublished": "Tue, 12 Sep 2017 09:00:00 +0000",
            "description": "<p>There’s the hype. Sure. But there’s also the hysteria. For most, bots are either the thing that’ll carry our companies into the future, or they’re a skip away from subjugating the entire human race.</p> <p>Today, we’re talking to Adelyn Zhou, CMO of TOPBOTS. She advises a wide range of companies on how they use AI and machine learning. She gives us her take on companies using these technologies successfully, how you can build a AI or machine learning team yourself (if you really need one), and what we can really expect from our robot overlords.</p>",
            "length": "47369618",
            "sourceUrl": "http://chtbl.com/track/28555/traffic.libsyn.com/thegrowthshow/Adelyn20Zhou.mp3?dest-id=400229",
            "snNo": "1",
            "epNo": "151"
        },
        {
            "title": "Your office is built for extroverts. Here’s why that’s a problem.",
            "datePublished": "Tue, 05 Sep 2017 09:00:00 +0000",
            "description": "<p>When we look for leadership characteristics, are we really building a workplace made for extroverts? We look for leaders to constantly speak up, network, and think on their feet. But what are we missing by excluding the strengths of introverts?</p> <p>Today on the show, we’re talking with Amma Marfo, a speaker, writer and editor, who thinks that we can do better. And she has a good idea of where we can start.</p>",
            "length": "49022318",
            "sourceUrl": "http://chtbl.com/track/28555/traffic.libsyn.com/thegrowthshow/Amma20Marfo.mp3?dest-id=400229",
            "snNo": "1",
            "epNo": "150"
        },
        {
            "title": "Grief Is Inevitable. Why Aren't We Preparing for It at Work?",
            "datePublished": "Tue, 29 Aug 2017 09:30:00 +0000",
            "description": "<p><span style=\"font-weight: 400;\">Four years ago, Karen Millsap’s husband was shot and killed in the gym they co-owned. There was no warning. No response manual. What followed was a time of immense hardship, struggle, and reinvention.</span></p> <p><span style=\"font-weight: 400;\">Karen joins us to talk about the importance of creating a psychologically safe work environment and the importance of building a culture of empathy and compassion. She offers ways you can ready your company to respond to even the toughest of life experiences.</span></p>",
            "length": "45592692",
            "sourceUrl": "http://chtbl.com/track/28555/traffic.libsyn.com/thegrowthshow/Karen20Millsap.mp3?dest-id=400229",
            "snNo": "1",
            "epNo": "149"
        },
        {
            "title": "Is Your Company Ready for PR 2.0?",
            "datePublished": "Tue, 22 Aug 2017 09:00:00 +0000",
            "description": "<p>PR hasn’t really changed since we invented email. And it’s a problem. Companies have great stories to tell, but they’re being drowned out by thousands of low-quality messages that journalists receive each day.</p> <p>Ricky Yean and his team at <a href= \"https://www.upbeatpr.com/\">Upbeat</a> realized that the problem is one of coordination. Journalists getting way too much of what they don’t need, and not enough of what they do. In this episode, Ricky talks about his solution, the increasing role of influencers in PR, and whether there’s even a future for humans in a more automated PR world.</p>",
            "length": "28049543",
            "sourceUrl": "http://chtbl.com/track/28555/traffic.libsyn.com/thegrowthshow/Ricky20Yean.mp3?dest-id=400229",
            "snNo": "1",
            "epNo": "148"
        },
        {
            "title": "How ClassPass is Getting Rid of Your Excuses [Rebroadcast]",
            "datePublished": "Tue, 15 Aug 2017 09:00:00 +0000",
            "description": "<p><span style=\"font-weight: 400;\">When Payal Kadakia quit her job at Warner Music Group, she didn't have a backup plan.</span></p> <p>She knew she wasn't happy in her job, but she wasn't sure what she wanted to do next. After a few weeks of soul-searching, she decided on her next move: She was going to start a fitness membership to help people uncover new classes in their area.</p> <p><span style=\"font-weight: 400;\">Five years, and a few business models later, ClassPass is helping hundreds of thousands of people ignore any excuse to not exercise.</span></p>",
            "length": "19458266",
            "sourceUrl": "http://chtbl.com/track/28555/traffic.libsyn.com/thegrowthshow/Payal20Kadakia.mp3?dest-id=400229",
            "snNo": "1",
            "epNo": "147"
        },
        {
            "title": "Why Chubbies is Tired of Being Called a “Bro”",
            "datePublished": "Tue, 08 Aug 2017 09:30:00 +0000",
            "description": "<p><span style=\"font-weight: 400;\">Not long ago, men’s shorts were long, with as many pockets as possible. But these days, they’re shrinking. And we can trace it all back to four friends with one simple idea.</span></p> <p><span style=\"font-weight: 400;\">Today, we’re talking with Tom Montgomery, a co-founder of Chubbies, a men and women’s clothing company. Tom tells us what it’s like to bear the “bro” stereotype and sell a product that no one was asking for at the time.</span></p>",
            "length": "36059273",
            "sourceUrl": "http://chtbl.com/track/28555/traffic.libsyn.com/thegrowthshow/Tom20Montgomery.mp3?dest-id=400229",
            "snNo": "1",
            "epNo": "146"
        },
        {
            "title": "Should Everyone Have an Executive Coach?",
            "datePublished": "Tue, 01 Aug 2017 09:00:00 +0000",
            "description": "<p><span style=\"font-weight: 400;\">To Jerry Colonna, accepting leadership means accepting to work on yourself. Because if you’re struggling personally, your company is probably struggling as well.</span></p> <p>Jerry is the founder of Reboot, a coaching company that’s helped some of the tech industry’s most well-known leaders. In this episode, he tells us the first step he takes with all of his clients, how he got into this industry, and where he thinks we’re headed when it comes to mental health in the workplace.</p>",
            "length": "46931510",
            "sourceUrl": "http://chtbl.com/track/28555/traffic.libsyn.com/thegrowthshow/Jerry20Colonna.mp3?dest-id=400229",
            "snNo": "1",
            "epNo": "145"
        },
        {
            "title": "Why a Side Hustle Shouldn't Actually Take That Much Hustle",
            "datePublished": "Tue, 25 Jul 2017 09:00:00 +0000",
            "description": "<p><span style=\"font-weight: 400;\">Projects fail. Side-projects fail even more. A lot more, in fact. But every once in awhile, a project comes along that shatters expectations (and maybe even a Google Sheet in the process). Yet all too often, we’re left wondering the same question: Why</span></p> <p>Mikael Cho, the CEO and founder of Unsplash, knows the answers to this question. And why shouldn’t he? Unsplash was once a side project itself. In today’s episode, Mikael explains which signs to keep a sharp eye on when you’re exploring side projects, and how he transitioned his own into the company it is today.</p>",
            "length": "29389624",
            "sourceUrl": "http://chtbl.com/track/28555/traffic.libsyn.com/thegrowthshow/Mikael20Cho.mp3?dest-id=400229",
            "snNo": "1",
            "epNo": "144"
        },
        {
            "title": "Stop Looking up to Workaholics Who Look Down on You",
            "datePublished": "Tue, 18 Jul 2017 09:00:00 +0000",
            "description": "<p><span style=\"font-weight: 400;\">When did working 100 hours become the banner for success? And worse, when did it become so damn cool? Luckily, not everyone thinks so.</span></p> <p><span style=\"font-weight: 400;\">David Heinemeier Hansson is the creator of Ruby on Rails and the founder and CTO of Basecamp. David believes this type of workaholism starts at the top and quickly trickles down to your employees. He tells us why we need to change the narrative and stop thinking that all-nighters make us better employees.</span></p>",
            "length": "52509308",
            "sourceUrl": "http://chtbl.com/track/28555/traffic.libsyn.com/thegrowthshow/DHH.mp3?dest-id=400229",
            "snNo": "1",
            "epNo": "143"
        },
        {
            "title": "There’s More to Empowering Young People of Color in Tech Than Coding",
            "datePublished": "Tue, 11 Jul 2017 09:00:00 +0000",
            "description": "<p><span style=\"font-weight: 400;\">Tech has a diversity problem. And in recent years we’ve seen a wave of programs aimed at teaching young people of color to code. But the reality is that addressing the diversity problem is about much more than just teaching kids how to code.</span></p> <p> </p> <p>Brandon Nicholson is the founding executive director of the Hidden Genius Project, an organization that teaches engineering skills, but also equips students with leadership skills. Brandon is working to build a community that will help the next generation of entrepreneurs thrive in tech.</p>",
            "length": "36310206",
            "sourceUrl": "http://chtbl.com/track/28555/traffic.libsyn.com/thegrowthshow/Brandon20Nicholson.mp3?dest-id=400229",
            "snNo": "1",
            "epNo": "142"
        },
        {
            "title": "How Pepsi and SheaMoisture Lost the Heart of Their Brand",
            "datePublished": "Tue, 04 Jul 2017 09:00:00 +0000",
            "description": "<p>Remember Pepsi’s tone deaf Kendall Jenner ad? SheaMoisture’s “Break Free from Hair Hate” campaign? After seeing these, you may have how in the world these campaigns were created.</p> <p>Amanda Spann is a serial entrepreneur, and after seeing these and other major judgment errors, she launched the site youneedablackperson.com. She meant it as a joke, but it’s rooted in a much larger issue.</p> <p>On today’s episode, Amanda explains how rapid growth and groupthink can poison a company’s better judgment, and how she’s avoiding having the same issues with her own products.</p>",
            "length": "31443890",
            "sourceUrl": "http://chtbl.com/track/28555/traffic.libsyn.com/thegrowthshow/Amanda20Spann.mp3?dest-id=400229",
            "snNo": "1",
            "epNo": "141"
        },
        {
            "title": "Why Slow Fashion Doesn’t Have to Mean Slow Growth",
            "datePublished": "Tue, 27 Jun 2017 09:00:00 +0000",
            "description": "<p><span style=\"font-weight: 400;\">For years, the pace of everyday work has been increasing. But Kathie Sever’s company is a good example of why the future may not be faster.</span></p> <p><span style=\"font-weight: 400;\">Kathie owns Fort Lonesome, a custom chain stitching outfit in Austin, Texas. After witnessing first hand the unsustainable practices of the garment industry, she wanted to change the way we all think about clothing. And she’s doing just that. One stitch at a time.</span></p>",
            "length": "41011652",
            "sourceUrl": "http://chtbl.com/track/28555/traffic.libsyn.com/thegrowthshow/Kathie20Sever.mp3?dest-id=400229",
            "snNo": "1",
            "epNo": "140"
        },
        {
            "title": "Taking The Lean Startup from Silicon Valley to the State Department",
            "datePublished": "Tue, 20 Jun 2017 09:00:00 +0000",
            "description": "<p>Why does innovation come so naturally to startups - but not to larger companies or governments? That’s a question that Steve Blank is working to answer.</p> <p>More than a decade ago, Steve helped lay the groundwork for The Lean Startup movement. Instead of innovating in a vacuum, he told entrepreneurs they needed to get outside and talk to customers. In this episode, Steve explains why innovation is fundamentally different in startups, how the Lean Startup can be applied almost anywhere, and what you should do if your company’s innovation engine starts to sputter.</p>",
            "length": "63996493",
            "sourceUrl": "http://chtbl.com/track/28555/traffic.libsyn.com/thegrowthshow/Steve20Blank.mp3?dest-id=400229",
            "snNo": "1",
            "epNo": "139"
        },
        {
            "title": "Turning the Worst Day of Your Life into Your Life's Work",
            "datePublished": "Tue, 13 Jun 2017 09:00:00 +0000",
            "description": "<p><span style=\"font-weight: 400;\">Six months after Karen Aiach’s daughter Ornella was born, she was diagnosed with Sanfilippo syndrome, a rare genetic disorder. Doctors told Karen her daughter would likely live for just over a decade, and there was nothing Karen could do about it. Left with no option, she created one herself.</span></p> <p><span style=\"font-weight: 400;\">After only three weeks of receiving the news, and with no medical background, Karen cofounded Lysogene, a biotech company targeting the syndrome. In this episode, she reminds us why “no” or “never” is only the start of the conversation.</span></p>",
            "length": "43285662",
            "sourceUrl": "http://chtbl.com/track/28555/traffic.libsyn.com/thegrowthshow/Karen20Aiach.mp3?dest-id=400229",
            "snNo": "1",
            "epNo": "138"
        },
        {
            "title": "Rewiring Our Big Dumb Brains (and Culture) for Goodness",
            "datePublished": "Tue, 06 Jun 2017 09:00:00 +0000",
            "description": "<p><span style=\"font-weight: 400;\">In a world of unicorns, Anthony Tjan is an investor looking for sea turtles. He watched first hand as his company went bust the same day the Dotcom bubble burst. And he realized that good, steady growth powered by teams of good people is really the only thing that matters.</span></p> <p> </p> <p>In this episode, Tony tells us how to learn from standout companies that promote goodness, how to surround yourself with good people, why you may want to cook dinner with more of your potential employees.</p>",
            "length": "40834673",
            "sourceUrl": "http://chtbl.com/track/28555/traffic.libsyn.com/thegrowthshow/Anthony20Tjan.mp3?dest-id=400229",
            "snNo": "1",
            "epNo": "137"
        },
        {
            "title": "The $21 billion niche Stefania Mallett caters to",
            "datePublished": "Tue, 30 May 2017 09:00:00 +0000",
            "description": "<p><span style=\"font-weight: 400;\">If you’ve ever had to cater a meeting, you know the panic that comes along with it. The type of panic that sits deep in the pit of your stomach. Will the food be late? Will it be the same as you ordered? Or even worse, will it show up at all?</span></p> <p><br /> <span style=\"font-weight: 400;\">Stefania Mallett heard these concerns first hand. Thousands of these concerns, in fact. All from customers at her previous company. And when that company went under? She knew exactly what problem to solve with her next company -- EzCater.</span></p>",
            "length": "35128420",
            "sourceUrl": "http://chtbl.com/track/28555/traffic.libsyn.com/thegrowthshow/Stefania20Mallet.mp3?dest-id=400229",
            "snNo": "1",
            "epNo": "136"
        },
        {
            "title": "Your productivity app isn’t the problem. You are.",
            "datePublished": "Tue, 23 May 2017 09:00:00 +0000",
            "description": "<p><span style=\"font-weight: 400;\">On Monday, you download a new productivity app. On Tuesday, you load it up with all the tasks you need to accomplish. By Friday? You’ve abandoned that list -- and you’re in the market for the next new app that’s sure to change your life. This cycle happens to pretty much everyone.</span></p> <p><span style=\"font-weight: 400;\">That’s why Amir Salihefendic, the founder and CEO of the productivity startup Doist, says his company is out to solve a psychological problem, not a product problem. In this episode, Amir tells us how his most successful customers use his products, why email is king (but could be much better), and why all of these productivity apps we use are just slowing us down.</span></p>",
            "length": "37123212",
            "sourceUrl": "http://chtbl.com/track/28555/traffic.libsyn.com/thegrowthshow/Amir20Salihefendic.mp3?dest-id=400229",
            "snNo": "1",
            "epNo": "135"
        },
        {
            "title": "How $500 Checks Helped Bring a Manufacturing Titan Back From Bankruptcy",
            "datePublished": "Tue, 16 May 2017 09:00:00 +0000",
            "description": "<p><span style=\"font-weight: 400;\">Jim Cline was only a few months away from retirement. That is, until a former colleague of his offered him a job most people would run far away from: CFO of a company $134 million in debt.</span></p> <p>In today’s episode, Jim tells us why he took on that challenge, how he helped realign his team, and how he’s changing course now that he’s stepped up to be the CEO.</p> <p><span style=\"font-weight: 400;\">This episode is presented with HubSpot’s <a href=\"http://hubs.ly/H07vVJs0\">State of Inbound 2017</a>.</span></p>",
            "length": "40207482",
            "sourceUrl": "http://chtbl.com/track/28555/traffic.libsyn.com/thegrowthshow/Jim20Cline.mp3?dest-id=400229",
            "snNo": "1",
            "epNo": "134"
        },
        {
            "title": "Who's in Control When Everything On Earth is Connected? [Rebroadcast]",
            "datePublished": "Tue, 09 May 2017 09:00:00 +0000",
            "description": "<p><span style=\"font-weight: 400;\">If everything on earth is connected, what does that mean for humanity? This week we’re digging out one of our favorites from the archives. In this episode, Linden Tibbets, CEO of IFTTT, outlines a vision of the world where everything is so connected, that moving across the different systems in your life is as easy as rearranging books on a shelf.</span></p>",
            "length": "43735618",
            "sourceUrl": "http://chtbl.com/track/28555/traffic.libsyn.com/thegrowthshow/Linden20Tibbets20Rebroadcast.mp3?dest-id=400229",
            "snNo": "1",
            "epNo": "133"
        },
        {
            "title": "GV's (Google Ventures) Jake Knapp on How to 'Fix' Brainstorming",
            "datePublished": "Tue, 02 May 2017 09:00:00 +0000",
            "description": "<p><span style=\"font-weight: 400;\">If you work in some kind of office, you’ve probably spent a good amount of your time in group brainstorms. Sometimes they work, but often you’re left with a ton of really great ideas -- and no action.</span></p> <p><br /> <span style=\"font-weight: 400;\">Jake Knapp is probably the most vocal critic of the group brainstorm. He’s the creator of GV's (Google Ventures) sprint process, and the author of “Sprint: How to Solve Big Problems and Test New Ideas in Just Five Days” in which he lays out a five-day alternative to group brainstorms that actually has results. In this episode, he tells us how he lost faith in brainstorming, what you can learn from Slack’s sprint process, and how you can even apply the idea to your personal life.</span></p>",
            "length": "32577168",
            "sourceUrl": "http://chtbl.com/track/28555/traffic.libsyn.com/thegrowthshow/Jake20Knapp.mp3?dest-id=400229",
            "snNo": "1",
            "epNo": "132"
        },
        {
            "title": "Hello Alfred Is Bringing W-2 Employment Benefits to the Gig Economy",
            "datePublished": "Tue, 25 Apr 2017 09:00:00 +0000",
            "description": "<p><span style=\"font-weight: 400;\">One criticism of the gig economy is that it takes advantage of employees. Notable companies like Uber or Lyft classify their employees as independent contractors, disqualifying them from benefits like maternity leave and health insurance. In many cases, it encourages employees to work far more hours than a full-time employee would.</span></p> <p><br /> <span style=\"font-weight: 400;\">But Hello Alfred, a personal butler service, started by thinking about work differently. When they launched, they made their workforce all W-2 employees, making them eligible for health insurance, 401Ks, and paid family leave. In this episode, co-founders Marcela Sapone and Jessica Beck explain how their model works and scales, how they combat major misconceptions about their company, and the future of the on-demand economy.</span></p>",
            "length": "36628640",
            "sourceUrl": "http://chtbl.com/track/28555/traffic.libsyn.com/thegrowthshow/Hello20Alfred.mp3?dest-id=400229",
            "snNo": "1",
            "epNo": "131"
        },
        {
            "title": "Always Wear Pants: New Rules of Work From The Muse's Kathryn Minshew",
            "datePublished": "Tue, 18 Apr 2017 09:00:00 +0000",
            "description": "<p><span style=\"font-weight: 400;\">Back in 2011, Kathryn Minshew and Alexandra Cavoulacos founded the online career resource The Muse. They were fed up with how something so important -- advancing in your career-- had fallen so far behind the times. Six years and 50 million users later, they decided to team up again to write a playbook -- The New Rules of Work -- for people looking to plot a course for their career and execute on it.</span></p> <p><br /> <span style=\"font-weight: 400;\">In this episode, we talk to Kathryn about what getting taken down by government agents while working at the US Embassy in Cyprus taught her about what she truly valued, what she’s learned about hiring and retention since then, and why you should</span> <strong>always</strong> <span style= \"font-weight: 400;\">wear pants.</span></p>",
            "length": "53002792",
            "sourceUrl": "http://chtbl.com/track/28555/traffic.libsyn.com/thegrowthshow/Katheryn20Minshew20New.mp3?dest-id=400229",
            "snNo": "1",
            "epNo": "130"
        },
        {
            "title": "Finding Scale in a Business Where One Size Doesn’t Fit All",
            "datePublished": "Tue, 11 Apr 2017 09:00:00 +0000",
            "description": "<p><span style=\"font-weight: 400;\">Many women find themselves at a point in their career where they’re just … stuck. Sometimes it has to do with moving up the ranks in a company, returning to the workforce in general, or even striking out in their own venture.</span></p> <p><span style=\"font-weight: 400;\">That inflection point is why Lisa Skeete Tatum created Landit, which provides career coaching and a playbook for women trying to reach the next step in their career. In this episode, she explains how she’s managed to scale such a personalized business, why codifying your network is more important than having thousands of connections, and why companies don’t have the choice</span> <em><span style= \"font-weight: 400;\">not</span></em> <span style= \"font-weight: 400;\">to provide the women in their organizations with these types of tools nowadays.</span></p>",
            "length": "40136744",
            "sourceUrl": "http://chtbl.com/track/28555/traffic.libsyn.com/thegrowthshow/Lisa20Skeete20Tatum.mp3?dest-id=400229",
            "snNo": "1",
            "epNo": "129"
        },
        {
            "title": "The Myth of Machine Learning & Building a Data Science Team That Works",
            "datePublished": "Tue, 04 Apr 2017 09:00:00 +0000",
            "description": "<p><span style=\"font-weight: 400;\">It seems like every company is trying to come up with an AI and machine learning strategy.</span></p> <p><br /> <span style=\"font-weight: 400;\">Monica Rogati is an independent data science advisor, and she has some news: You can’t just lock a few data scientists in a room and expect them to sprinkle “magical machine learning dust” on everything. In this episode, she explains how a company can develop a successful data strategy, build a strong data team, and hire (and retain) talented data scientists.</span></p>",
            "length": "45883328",
            "sourceUrl": "http://chtbl.com/track/28555/traffic.libsyn.com/thegrowthshow/Monica20Rogati.mp3?dest-id=400229",
            "snNo": "1",
            "epNo": "128"
        },
        {
            "title": "When You’re Not Learning Anymore, It’s Time For a Career Change",
            "datePublished": "Tue, 28 Mar 2017 09:00:00 +0000",
            "description": "<p><span style=\"font-weight: 400;\">There are a lot of different ways to move in your career.  You can quit and move on to a new company. You can create a company and sell it. You can completely reinvent your job, or even reinvent your company. Rachel Blumenthal has moved in her career pretty much every way you can think of. Today, she’s the CEO and Founder of Rockets of Awesome, a children’s clothing membership.</span></p> <p><br /> <span style=\"font-weight: 400;\">In this episode, she tells us how she knew when it was time to move on, how she did it gracefully, and some of the lessons she learned along the way.</span></p>",
            "length": "39600056",
            "sourceUrl": "http://chtbl.com/track/28555/traffic.libsyn.com/thegrowthshow/Rachel20Blumenthal.mp3?dest-id=400229",
            "snNo": "1",
            "epNo": "127"
        },
        {
            "title": "Product Market Fit Should Be Emotional",
            "datePublished": "Tue, 21 Mar 2017 09:00:00 +0000",
            "description": "<p><span style=\"font-weight: 400;\">Many ecommerce companies face the same two problems: the cost of keeping inventory, and the money they have to swallow when a customer returns an item. Shan-Lyn Ma, the CEO and co-founder of Zola, has dodged both of those problems.</span></p> <p><br /> <span style=\"font-weight: 400;\">Zola is an update on the wedding registry. In today’s episode, Shan-Lyn tells us about what she learned from her time working at the shopping website Gilt, her view on the future of ecommerce, and why it’s a really good thing if a customer gets emotional when you’re doing user research.</span></p>",
            "length": "39236770",
            "sourceUrl": "http://chtbl.com/track/28555/traffic.libsyn.com/thegrowthshow/Shan-Lyn20Ma.mp3?dest-id=400229",
            "snNo": "1",
            "epNo": "126"
        },
        {
            "title": "Facebook's Julie Zhou on How To Design For 2 Billion Users",
            "datePublished": "Tue, 14 Mar 2017 09:00:00 +0000",
            "description": "<p><span style=\"font-weight: 400;\">Julie Zhuo was Facebook’s first intern back in 2006. Today, more than a decade later, she’s their VP of Product Design. You can thank her for the newsfeed, “Reactions”, and a lot more.</span></p> <p><br /> <span style=\"font-weight: 400;\">On today’s episode, Julie tells us how she got to where she is today -- despite having no formal background in design -- why her goal is for her team’s work to be “invisible”, and why changes to your product (even changes that make it better) are still incredibly hard to get users to like.</span></p>",
            "length": "52195903",
            "sourceUrl": "http://chtbl.com/track/28555/traffic.libsyn.com/thegrowthshow/Julie20Zhou.mp3?dest-id=400229",
            "snNo": "1",
            "epNo": "125"
        },
        {
            "title": "Reham Fagiri: From Goldman Sachs to Challenging Craigslist",
            "datePublished": "Tue, 07 Mar 2017 10:00:00 +0000",
            "description": "<p><span style=\"font-weight: 400;\">The process of buying and selling used furniture is painful. It’s hard to know what you’re getting and who you’re getting it from. Or how you’re actually going to move it.</span></p> <p><br /> <span style=\"font-weight: 400;\">Reham Fagiri started AptDeco to solve that problem. The company has morphed from a scrappy team poaching furniture sales from Craigslist to operating an end-to-end buying, selling and delivery service. In this episode, she talks about how she got AptDeco off the ground, how she deals with the sometimes “explosive” problems she faces, and how she avoids analysis paralysis when planning for what’s next.</span></p>",
            "length": "41938372",
            "sourceUrl": "http://chtbl.com/track/28555/traffic.libsyn.com/thegrowthshow/Reham20Fagiri.mp3?dest-id=400229",
            "snNo": "1",
            "epNo": "124"
        },
        {
            "title": "How Winnie’s Founder Launched a Company as a New Mom & the Spouse of a Cancer Survivor",
            "datePublished": "Tue, 28 Feb 2017 10:00:00 +0000",
            "description": "<p><span style=\"font-weight: 400;\">A few short months after Sara Mauskopf launched her first company, her husband was diagnosed with an aggressive form of cancer. With an infant at home and investors looking for results, Sara had to find a new definition of what “normal” looked like, in both her personal and professional life.</span></p> <p><br /> <span style=\"font-weight: 400;\">In this episode, Sara talks about how she started her company while supporting her husband through his illness, why having a co-founder is so important for stability, and what companies get wrong when they try to create products for parents.</span></p>",
            "length": "30715843",
            "sourceUrl": "http://chtbl.com/track/28555/traffic.libsyn.com/thegrowthshow/Sara20Mauskopf.mp3?dest-id=400229",
            "snNo": "1",
            "epNo": "123"
        },
        {
            "title": "What Vera Fischer Did After Losing Her Job During Maternity Leave",
            "datePublished": "Tue, 21 Feb 2017 10:00:00 +0000",
            "description": "<p><span style=\"font-weight: 400;\">Just 10 weeks into her maternity leave, Vera Fischer was laid off after her company went through a major reorg. Now, 13 years later, she shares how she launched her successful all-in-one advertising and marketing agency, 97 Degrees West.</span></p> <p><br /> <span style=\"font-weight: 400;\">This episode includes</span> <a href= \"http://freemusicarchive.org/music/Blue_Dot_Sessions/Aeronaut/Heliotrope_1250\"> <span style=\"font-weight: 400;\">Heliotrope</span></a> <span style= \"font-weight: 400;\">and</span> <a href= \"http://freemusicarchive.org/music/Blue_Dot_Sessions/Aeronaut/Shift_of_Currents\"> <span style=\"font-weight: 400;\">Shift of Currents</span></a> <span style=\"font-weight: 400;\">by</span> <a href= \"http://freemusicarchive.org/music/Blue_Dot_Sessions/\"><span style= \"font-weight: 400;\">Blue Dot Sessions</span></a><span style= \"font-weight: 400;\">, licensed under a</span> <a href= \"https://creativecommons.org/licenses/by-nc/4.0/\"><span style= \"font-weight: 400;\">Creative Commons license</span></a><span style= \"font-weight: 400;\">.</span></p>",
            "length": "25038530",
            "sourceUrl": "http://chtbl.com/track/28555/traffic.libsyn.com/thegrowthshow/Vera20Fischer.mp3?dest-id=400229",
            "snNo": "1",
            "epNo": "122"
        },
        {
            "title": "Gimlet Media Co-Founders Alex Blumberg and Matt Lieber *Rebroadcast*",
            "datePublished": "Tue, 14 Feb 2017 10:00:00 +0000",
            "description": "<p><span style=\"font-weight: 400;\">Happy Valentine’s Day!</span></p> <p> </p> <p>This holiday has everything to do with relationships. And there’s one type of relationship that we talk about a lot on this show: the relationship between co-founders. In the spirit of the day, we’re bringing back one of our favorite episodes with the co-founders of Gimlet Media.</p> <p> </p> <p>Alex and Matt tell us why they decided to document their entire experience starting Gimlet in a podcast called StartUp, how they got away with “sucking” at marketing, and how they got listeners to love (like, really love) their ads.</p>",
            "length": "43904638",
            "sourceUrl": "http://chtbl.com/track/28555/traffic.libsyn.com/thegrowthshow/Gimlet20Media20rebroadcast.mp3?dest-id=400229",
            "snNo": "1",
            "epNo": "121"
        },
        {
            "title": "Amazon’s Former Data Scientist on Making Your Data Work For You",
            "datePublished": "Tue, 07 Feb 2017 10:00:00 +0000",
            "description": "<p><span style=\"font-weight: 400;\">In 1949, Andreas Weigend’s father was imprisoned in East Germany by Soviet occupying forces who thought he was an American spy. A decade later, when Andreas tried to find the Stasi file on his father, he instead found one about himself.</span></p> <p><br /> <span style=\"font-weight: 400;\">Instead of transforming Andreas into a privacy advocate, it set him on a course to completely rethink data sharing. Since then, he’s contracted with dozens of companies and acted as Amazon’s Chief Data Scientist. In his new book “Data For the People: How to Make Our Post-Privacy Economy Work for You,” he works to help people understand how they can use their personal data to their benefit.</span></p>",
            "length": "21958027",
            "sourceUrl": "http://chtbl.com/track/28555/traffic.libsyn.com/thegrowthshow/Andreas20Weigend.mp3?dest-id=400229",
            "snNo": "1",
            "epNo": "120"
        },
        {
            "title": "How Box's Chief Storyteller Bridges the Sales/Marketing Divide: Live at INBOUND16",
            "datePublished": "Tue, 31 Jan 2017 10:00:00 +0000",
            "description": "<p><span style=\"font-weight: 400;\">Doug Landis has a unique point of view in the sales and marketing world in that he’s seen both sides of the relationship. Before he stepped into his current role as the Chief Storyteller at the file-sharing company Box, he was a Senior Director of Sales at Salesforce.</span></p> <p> </p> <p><span style=\"font-weight: 400;\">In our last episode from INBOUND 2016, Doug explains why having a story to tell your customers is important, why there’s so often a divide between sales and marketing teams, and why it’s important to let out your inner “weekend self” sometimes.</span></p> <p> </p> <p><span style=\"font-weight: 400;\">This episode features the song “<a href= \"http://freemusicarchive.org/music/SK/20160923191558199/SK_-_Beats_-_Here_I_come\">Beats - Here I come</a>” by <a href= \"http://freemusicarchive.org/music/SK/\">SK</a>, available under a <a href=\"https://creativecommons.org/licenses/by/4.0/\">Creative Commons Attribution</a> license.</span></p>",
            "length": "29387698",
            "sourceUrl": "http://chtbl.com/track/28555/traffic.libsyn.com/thegrowthshow/Doug20Landis.mp3?dest-id=400229",
            "snNo": "1",
            "epNo": "119"
        },
        {
            "title": "The Inside Story of Making 'Making a Murderer': Live at INBOUND16",
            "datePublished": "Tue, 24 Jan 2017 11:49:02 +0000",
            "description": "<p><span style=\"font-weight: 400;\">It was 2005. Laura Ricciardi and Moira Demos borrowed a camera, rented a car, and set out to cover a murder trial in the small town of Manitowoc, Wisconsin. They didn’t realize they were embarking in a decade-long journey to create the eventual Netflix hit series ‘Making a Murderer.’</span></p> <p> </p> <p><span style=\"font-weight: 400;\">This week, in our third episode from INBOUND 2016, Moira and Laura give us a behind-the-scenes look into their process. They explain how they identified the breadth of Steven Avery and Brendan Dassey’s story early on, how they turned their obstacles into advantages, and how the popularity of the series could change how they’re making the second season.</span></p> <p> </p> <p><span style=\"font-weight: 400;\">This episode features the song “</span><a href= \"http://freemusicarchive.org/music/SK/20160923191558199/SK_-_Beats_-__Lets_get_it\"><span style=\"font-weight: 400;\">Let's get it</span></a><span style=\"font-weight: 400;\">” by</span> <a href=\"http://freemusicarchive.org/music/SK/\"><span style= \"font-weight: 400;\">J-K</span></a><span style=\"font-weight: 400;\">, available under a</span> <a href= \"https://creativecommons.org/licenses/by/4.0/\"><span style= \"font-weight: 400;\">Creative Commons Attribution license</span></a><span style=\"font-weight: 400;\">.</span></p>",
            "length": "31612612",
            "sourceUrl": "http://chtbl.com/track/28555/traffic.libsyn.com/thegrowthshow/Making20A20Murderer.mp3?dest-id=400229",
            "snNo": "1",
            "epNo": "118"
        },
        {
            "title": "Sarah Cooper on Finding Comedy in the Corporate World: Live at INBOUND16",
            "datePublished": "Tue, 17 Jan 2017 10:00:00 +0000",
            "description": "<p><span style=\"font-weight: 400;\">Sarah Cooper was sitting in a meeting one day. One of her coworkers spent part of the meeting drawing a Venn Diagram and explaining it, and that’s when Sarah realized something: It was all BS. Years later, it became part of the article that made her satirical blog -- The Cooper Review -- famous.</span></p> <p> </p> <p><span style=\"font-weight: 400;\">Today, Sarah is a full-time comedian. This week, in our second episode from INBOUND 2016, Sarah tells us how she makes typical life hysterical, how she gets the type of feedback she needs, and what companies often get wrong when they try to create content for regular people.</span></p> <p><br /> <span style=\"font-weight: 400;\">This episode features the song “</span><a href= \"http://freemusicarchive.org/music/J-K/Sorriso_Parvo/J-K_-_Sorriso_Parvo_-_13_Sorriso_Parvo\"><span style=\"font-weight: 400;\">Sorriso (Parvo)</span></a><span style=\"font-weight: 400;\">” by</span> <a href=\"http://freemusicarchive.org/music/J-K/\"><span style= \"font-weight: 400;\">J-K</span></a><span style=\"font-weight: 400;\">, available under a</span> <a href= \"https://creativecommons.org/licenses/by-nc/4.0/\"><span style= \"font-weight: 400;\">Creative Commons Attribution</span></a> <span style=\"font-weight: 400;\">license.</span></p>",
            "length": "23251975",
            "sourceUrl": "http://chtbl.com/track/28555/traffic.libsyn.com/thegrowthshow/Comedian20Sarah20Cooper.mp3?dest-id=400229",
            "snNo": "1",
            "epNo": "117"
        },
        {
            "title": "Alec Baldwin: Live at INBOUND16",
            "datePublished": "Tue, 10 Jan 2017 10:00:00 +0000",
            "description": "<p><span style=\"font-weight: 400;\">This week is the first of our episodes from INBOUND 2016.</span></p> <p> </p> <p><span style=\"font-weight: 400;\">First up is Alec Baldwin -- actor, comedian, and most recently, Donald Trump impersonator on</span> <em><span style=\"font-weight: 400;\">Saturday Night Live</span></em><span style=\"font-weight: 400;\">.</span></p> <p> </p> <p><span style=\"font-weight: 400;\">In this episode, he tells us why the role of Jack Donaghy on</span> <em><span style= \"font-weight: 400;\">30 Rock</span></em> <span style= \"font-weight: 400;\">was the best job he’s ever had, how he prepared to play Trump, and why he almost didn’t take the gig in the first place.</span></p> <p><br /> <span style=\"font-weight: 400;\">This episode features the song “</span><a href= \"http://freemusicarchive.org/music/Mise/Plastic_Love/Mise_-_Plastic_Love_-_18_Cant_Shake_You\"><span style=\"font-weight: 400;\">Can't Shake You</span></a><span style=\"font-weight: 400;\">” by</span> <a href=\"http://freemusicarchive.org/music/Mise/\"><span style= \"font-weight: 400;\">Mise</span></a><span style= \"font-weight: 400;\">, available under a</span> <a href= \"https://creativecommons.org/licenses/by/4.0/\"><span style= \"font-weight: 400;\">Creative Commons Attribution license</span></a><span style=\"font-weight: 400;\">.</span></p>",
            "length": "34030114",
            "sourceUrl": "http://chtbl.com/track/28555/traffic.libsyn.com/thegrowthshow/Alec20Baldwin.mp3?dest-id=400229",
            "snNo": "1",
            "epNo": "116"
        },
        {
            "title": "Dan Pink: Robots Won't Steal Jobs, They'll Transform Them.",
            "datePublished": "Tue, 03 Jan 2017 10:00:00 +0000",
            "description": "<p><span style=\"font-weight: 400;\">Daniel Pink has been a leading voice in business for more than two decades. He’s written five best-selling books about work and management, including “Drive: The Surprising Truth About What Motivates Us” and “To Sell Is Human: The Surprising Truth About Moving Others.”</span></p> <p><br /> <span style=\"font-weight: 400;\">In this episode, Dan tells us what most managers get wrong when they try to motivate their employees, why feedback is key for younger employees, and why he thinks robots won’t be taking away everyone’s job anytime soon.</span></p>",
            "length": "55834274",
            "sourceUrl": "http://chtbl.com/track/28555/traffic.libsyn.com/thegrowthshow/Dan20Pink.mp3?dest-id=400229",
            "snNo": "1",
            "epNo": "115"
        },
        {
            "title": "Best of 2016: Bill Walton, Charles Duhigg, Patty McCord & More",
            "datePublished": "Tue, 27 Dec 2016 10:00:00 +0000",
            "description": "<p><span style=\"font-weight: 400;\">We’re looking back on a few of our favorite moments from the show this year. In this episode, we hear from basketball legend Bill Walton about his time working with coach John Wooden, author Charles Duhigg on why the making of the movie ‘Frozen’ was so chaotic, and a few other favorite past guests.</span></p> <p> </p> <p><span style=\"font-weight: 400;\">Here are the links to the episodes we featured:</span></p> <p><a href=\"http://bit.ly/2hXUKf0\">Patty McCord</a></p> <p><a href=\"http://bit.ly/2ikJXKH\">Neil Pasricha</a></p> <p><span style=\"font-weight: 400;\"><a href= \"http://bit.ly/2hwpDpV\">Bill Walton</a></span></p> <p><a href=\"http://bit.ly/2ikLFvu\">Charles Duhigg</a></p> <p><a href=\"http://bit.ly/2h71GnY\">Rick Ridgeway</a></p> <p><br /> <span style=\"font-weight: 400;\">Cheers to a great 2016! Thanks for listening.</span></p>",
            "length": "57930988",
            "sourceUrl": "http://chtbl.com/track/28555/traffic.libsyn.com/thegrowthshow/Best20of202016.mp3?dest-id=400229",
            "snNo": "1",
            "epNo": "114"
        },
        {
            "title": "What One Entrepreneur Learned From 100 Days of Rejection",
            "datePublished": "Tue, 20 Dec 2016 10:00:00 +0000",
            "description": "<p><span style=\"font-weight: 400;\">Getting turned down is painful, whether it’s in your personal or your professional life. After a particularly harsh rejection, Jia Jiang decided to go out and face that pain head on. He purposefully tried to get rejected every day for 100 days in a row.</span></p> <p><br /> <span style=\"font-weight: 400;\">In this episode, Jia tells us about how this experiment led him to fly a plane, drive a police car, give a college lecture, buy some specialty donuts, and much more.</span></p>",
            "length": "55208545",
            "sourceUrl": "http://chtbl.com/track/28555/traffic.libsyn.com/thegrowthshow/Jia20Jiang.mp3?dest-id=400229",
            "snNo": "1",
            "epNo": "113"
        },
        {
            "title": "Swears & Stick Figures: Behind the Charm of Tim Urban's 'Wait But Why'",
            "datePublished": "Tue, 13 Dec 2016 10:00:00 +0000",
            "description": "<p><span style=\"font-weight: 400;\">Tim Urban’s blog, ‘Wait But Why,’ looks different than most sites you might visit nowadays. While most publications are trying to keep their articles short and sweet, Tim regularly dives deep on his topics, writing thousands of words on a given subject. Plus, he illustrates every post -- not with modern, sleek graphics, but with hand-drawn stick figures.</span></p> <div> </div> <p><span style=\"font-weight: 400;\">In this episode, he explains just how he racks up a million pageviews regularly, how he builds and maintains his audience, and why not being an expert on something might make you better at teaching other people about it. Plus, he tells us about the prehistoric musical he was working on before starting ‘Wait But Why.’</span></p>",
            "length": "53709752",
            "sourceUrl": "http://chtbl.com/track/28555/traffic.libsyn.com/thegrowthshow/Tim20Urban20Wait20But20Why.mp3?dest-id=400229",
            "snNo": "1",
            "epNo": "112"
        },
        {
            "title": "How Hunter Walk Spots Success Before the Spreadsheet Proves Him Right",
            "datePublished": "Tue, 06 Dec 2016 10:00:00 +0000",
            "description": "<p><span style=\"font-weight: 400;\">When seed stage venture capitalist Hunter Walk is evaluating whether to invest in a company, he doesn’t look at the product. To him, it’s all about finding a great team.</span></p> <p> </p> <p>This philosophy has helped him make investments in some of the top startups today, such as theSkimm, Shyp, and Joymode. Before Homebrew, he worked at YouTube, Google & Second Life, and even worked for a time on Late Night with Conan O'Brien.</p> <p> </p> <p>In this episode, Hunter explains why Conan was the first startup he worked for, how he identifies great companies when there’s no data to evaluate, and the three factors every company needs to be successful when taking VC funding.</p>",
            "length": "49617491",
            "sourceUrl": "http://chtbl.com/track/28555/traffic.libsyn.com/thegrowthshow/Hunter20Walk.mp3?dest-id=400229",
            "snNo": "1",
            "epNo": "111"
        },
        {
            "title": "Escaping the \"Good\" Trap: The Tough Choices Founders Make to Be Great",
            "datePublished": "Tue, 29 Nov 2016 10:00:00 +0000",
            "description": "<p><span style=\"font-weight: 400;\">“[For entrepreneurs,] it’s the best of times … and it’s not the worst of times, but it’s a different time,” says Ravi Belani, managing partner of Alchemist Accelerator. There are so many advantages that didn’t exist 10 years ago, but founders and CEOs face more competition than ever. At Alchemist Accelerator, Ravi has helped budding companies navigate these changes -- and as a result, has many lessons to share.</span></p> <p><span style=\"font-weight: 400;\">In this episode, Ravi gives some concrete advice about how to break into the startup scene in 2016, explains why growth purgatory is much worse than hell, and why persistence is more important than intelligence.</span></p>",
            "length": "47290828",
            "sourceUrl": "http://chtbl.com/track/28555/traffic.libsyn.com/thegrowthshow/Ravi20Belani.mp3?dest-id=400229",
            "snNo": "1",
            "epNo": "110"
        },
        {
            "title": "The Hashtag's Creator Is Glad He Gave It Away for Free",
            "datePublished": "Tue, 22 Nov 2016 10:00:00 +0000",
            "description": "<p><span style=\"font-weight: 400;\">Back in January, Chris Messina said that 2016 would be the year of ‘conversational commerce.’ Almost a year later, it looks like he might have been right. Chris, who invented the hashtag and the concept of coworking spaces, now works for Uber as a Developer Experience Lead.</span></p> <p>In this episode, Chris explains that the best thing you can do is to give your work away for free, why conversational interfaces will become commonplace by 2020, and how having an open source philosophy can make the internet a more diverse place.</p>",
            "length": "72392211",
            "sourceUrl": "http://chtbl.com/track/28555/traffic.libsyn.com/thegrowthshow/Chris20Messina.mp3?dest-id=400229",
            "snNo": "1",
            "epNo": "109"
        },
        {
            "title": "Twitter's Fmr. Editorial Director on Writing: If You Think You Sound Ridiculous, You Do",
            "datePublished": "Tue, 15 Nov 2016 10:00:00 +0000",
            "description": "<p><span style=\"font-weight: 400;\">Even if you’ve correctly identified your customer base, hired the best team around, and built the perfect product, it’s possible your target audience has no idea what you actually do.</span></p> <p><span style=\"font-weight: 400;\">That’s a problem Karen Wickre has been solving for decades. A former journalist turned communications strategist, Wickre has lead communication efforts for both Google and Twitter. Today, she advises other prominent companies on building an effective communication strategy.</span></p> <p><span style=\"font-weight: 400;\">In this episode, she tells us where companies go wrong when trying to work with journalists, how to avoid mind-numbingly bad copy, and how content creators should work with the rest of the company to convince the rest of the company that their work is vital.</span></p>",
            "length": "32486474",
            "sourceUrl": "http://chtbl.com/track/28555/traffic.libsyn.com/thegrowthshow/Karen20Wickre.mp3?dest-id=400229",
            "snNo": "1",
            "epNo": "108"
        },
        {
            "title": "How Do You Build an Online Secondhand Clothes Store? Think Like Richard Branson",
            "datePublished": "Tue, 08 Nov 2016 10:00:00 +0000",
            "description": "<p><span style=\"font-weight: 400;\">Buying clothing secondhand is nothing new -- but the way Anthony Marino is growing threadUP</span> <em><span style= \"font-weight: 400;\">is</span></em><span style= \"font-weight: 400;\">.</span></p> <p><span style=\"font-weight: 400;\">Before moving to thredUP, Marino worked for Virgin, under Richard Branson. He says thredUP is building many of Branson’s sensibilities into their growth strategy: Get the economics right first,</span> <em><span style= \"font-weight: 400;\">then</span></em> <span style= \"font-weight: 400;\">build your brand.</span></p> <p><span style=\"font-weight: 400;\">In this episode, he talks about his personal crash course in ecommerce, how he innovates in a longstanding industry, and why consensus hiring is such a mistake for a growing company.</span></p>",
            "length": "43033765",
            "sourceUrl": "http://chtbl.com/track/28555/traffic.libsyn.com/thegrowthshow/thredUP20Anthony20Marino.mp3?dest-id=400229",
            "snNo": "1",
            "epNo": "107"
        },
        {
            "title": "Hiten Shah Thinks You Should Admit You Suck",
            "datePublished": "Tue, 01 Nov 2016 09:00:00 +0000",
            "description": "<p><span style=\"font-weight: 400;\">When it comes to growing a business, Hiten Shah has pretty much seen it all. He’s co-founded several successful businesses (Kissmetrics, Crazy Egg, and Quick Sprout), and advises an impressive roster of high-growth companies in his spare time.</span></p> <p>His deep experience is why entrepreneurs look to him for advice all the time. If you come to him with a problem, he’ll know exactly how to start fixing it.</p> <p>In this episode, Hiten shares some of his first-hand knowledge with us. He talks about how to avoid the common growth trap new companies fall into, what makes a great founder, and what you need to do to run a successful remote company. He even tells us a secret to parenthood!</p>",
            "length": "45849476",
            "sourceUrl": "http://chtbl.com/track/28555/traffic.libsyn.com/thegrowthshow/Hiten20Shah.mp3?dest-id=400229",
            "snNo": "1",
            "epNo": "106"
        },
        {
            "title": "Amy Chang’s Secret to Building Accompany? Take Big Bets",
            "datePublished": "Tue, 25 Oct 2016 09:00:00 +0000",
            "description": "<p>Have you ever been tortured by an idea?</p> <p>An idea that is not only your first thought in the morning, but also the reason you wake up in a cold sweat in the middle of the night? Amy Chang, CEO of Accompany, knows this feeling well. In fact, it’s what drove her to leave her seven-year stint at Google to start something new.</p> <p>In this episode, Amy shares her thought process behind some of her bolder decisions -- from leaving Google to raising $20 million in three years with a product in beta -- and the lessons she learned along the way.</p>",
            "length": "43743936",
            "sourceUrl": "http://chtbl.com/track/28555/traffic.libsyn.com/thegrowthshow/Amy20Chang.mp3?dest-id=400229",
            "snNo": "1",
            "epNo": "105"
        },
        {
            "title": "Ramit Sethi’s Counterintuitive Advice for Building a Richer Life",
            "datePublished": "Tue, 18 Oct 2016 09:00:00 +0000",
            "description": "<p>While at Stanford University 12 years ago, Ramit Sethi made a big promise to the readers of his blog: He would teach them to become rich.</p> <p>Though he may regret his website’s name today, no one can question the following his blog, subsequent best-selling book, and numerous spin-off projects have amassed.</p> <p>In this episode, Ramit shares his story of turning his side project full-time, along with his advice on receiving feedback, dodging the typical new entrepreneur pitfalls, and mastering the art of persuasion.</p>",
            "length": "40459760",
            "sourceUrl": "http://chtbl.com/track/28555/traffic.libsyn.com/thegrowthshow/Ramit20Sethi.mp3?dest-id=400229"
        },
        {
            "title": "Buffer Almost Went Under: The Heartbreaking Consequences of Growing Too Quickly",
            "datePublished": "Tue, 11 Oct 2016 09:30:00 +0000",
            "description": "<p><span style=\"font-weight: 400;\">Earlier this year, all looked rosy at Buffer. With such a fast-growing team, evolving product, and devoted audience, the company seemed destined for success.</span></p> <p><span style=\"font-weight: 400;\">But one day, Buffer’s CEO Joel Gascoigne and the rest of the management team realized their math didn’t add up. If they didn’t make some tough decisions, Buffer would be out of money in just five months. After running the numbers, the path seemed clear: They had to lay off 10% of their staff.</span></p> <p><span style=\"font-weight: 400;\">In this episode, Joel shares how he navigated this tough decision, pivoted after realizing he made a mistake, and restored the company's faith in their vision through radical transparency.</span></p>",
            "length": "26962986",
            "sourceUrl": "http://chtbl.com/track/28555/traffic.libsyn.com/thegrowthshow/Joel20Gascoigne.mp3?dest-id=400229",
            "snNo": "1",
            "epNo": "103"
        },
        {
            "title": "Scaling Trello: The Challenges of Growing Tech’s Favorite Productivity App",
            "datePublished": "Tue, 04 Oct 2016 09:30:00 +0000",
            "description": "<p><span style=\"font-weight: 400;\">Getting teams across an organization to work together fluidly, transparently, and productively can be a serious challenge -- but it’s one Michael Pryor, CEO of Trello, is on a mission to solve</span></p> <p><span style=\"font-weight: 400;\">And for all measures, his company is on the fast track to solving it. Five years ago, Trello was just a side project at Fog Creek Software. Then, last year, Trello reached over 10 million users from all over the globe.</span></p> <p><br /> <span style=\"font-weight: 400;\">In this episode, Michael shares the lessons he learned turning a side-project into an international company, and the tough things he had to learn along the way.</span></p>",
            "length": "42107714",
            "sourceUrl": "http://chtbl.com/track/28555/traffic.libsyn.com/thegrowthshow/Michael20Pryor20Trello.mp3?dest-id=400229",
            "snNo": "1",
            "epNo": "102"
        },
        {
            "title": "Why Early-Stage VCs Shouldn’t Place Bets",
            "datePublished": "Tue, 27 Sep 2016 09:00:00 +0000",
            "description": "<p>Rob Go, Co-Founder of NextView Ventures, knows what the future of business looks like. In fact, he’s invested in it: As an early-stage VC, he’s backed many companies that made it big, including several that were later acquired by Microsoft, Twitter, and Google.</p> <p><span style=\"font-weight: 400;\">In this special episode, Rob shares his thoughts on what it takes to get traction for your product, why investors shouldn’t place bets, and what else he looks for in companies he invests in.</span><span style= \"font-weight: 400;\">                                                                                  </span></p> <p><span style=\"font-weight: 400;\">Want to see the live recording of this episode? Watch it here:</span> <a href= \"http://bit.ly/RobGoTGS\"><span style= \"font-weight: 400;\">http://bit.ly/RobGoTGS</span></a></p>",
            "length": "43250505",
            "sourceUrl": "http://chtbl.com/track/28555/traffic.libsyn.com/thegrowthshow/Rob20Go.mp3?dest-id=400229",
            "snNo": "1",
            "epNo": "101"
        },
        {
            "title": "Episode 100: Guy Kawasaki's Unconventional Advice on Growth",
            "datePublished": "Tue, 20 Sep 2016 09:00:00 +0000",
            "description": "<p>The year was 2015. It was a cold January morning, and HubSpot HQ was buried under record snowfall. The Growth Show launched our first few episodes -- but our team had no idea whether people would listen to them.</p> <p>Fast-forward to today. We've released 100 episodes with some of the top minds in business, and thousands of people listen to the show each week.</p> <p>To thank all the people who've helped us get here, we wanted to do something special.</p> <p>Today, we're bringing back one of our listeners' all-time favorite guests: Guy Kawasaki.</p> <p>(Quick refresher for anyone not familiar with his incredible career: Guy's the Former Chief Evangelist at Apple, famed author, seasoned startup investor, and current Chief Evangelist at Canva.)</p> <p>In January 2015, Guy Kawasaki came on the show to talk about some of his counterintuitive social media strategies. Today, he joins us to talk about what's changed since then: the Snapchat vs. Instagram Stories debate; making the most of Facebook Live; and lessons from his book, <em>The Art of the Start 2.0</em>, on building great businesses.</p> <p>We hope you enjoy this special recording.</p> <p>And from all of us here at The Growth Show: Thanks for listening.  </p>",
            "length": "50534759",
            "sourceUrl": "http://chtbl.com/track/28555/traffic.libsyn.com/thegrowthshow/Guy20Kawasaki.mp3?dest-id=400229",
            "snNo": "1",
            "epNo": "100"
        },
        {
            "title": "Your Key to Growth May Be Free(mium)",
            "datePublished": "Tue, 13 Sep 2016 09:30:00 +0000",
            "description": "<p>Julie Herendeen, a pioneer of the freemium model, knows better than most that sometimes your best marketing is free -- freemium to be exact.</p> <p>She’s racked up over 16 years of experience as a marketing executive and board member at companies like Dropbox, Lookout, Yahoo, and Shutterfly. Julie’s experience has earned her the trust of top companies looking to implement a freemium model -- and in this episode we get to cover just that.</p> <p>Julie schools us on how to avoid common pitfalls, induce virality, and succeed using the freemium model -- in addition to the lessons she’s learned along the way.</p>",
            "length": "42681519",
            "sourceUrl": "http://chtbl.com/track/28555/traffic.libsyn.com/thegrowthshow/Julie20Herendeen.mp3?dest-id=400229",
            "snNo": "1",
            "epNo": "99"
        },
        {
            "title": "The Psychology Behind Your App Addiction",
            "datePublished": "Tue, 06 Sep 2016 09:00:00 +0000",
            "description": "<p><span style=\"font-weight: 400;\">We all have habits -- some good, some bad. But why are some habits easy to form and others impossible to break?</span></p> <p><span style=\"font-weight: 400;\">Nir Eyal, author of</span> <em><span style=\"font-weight: 400;\">Hooked: How to Build Habit-Forming Products,</span></em> <span style= \"font-weight: 400;\">has spent years trying to figure out what makes some products and behaviors more habitual than others.</span></p> <p><span style=\"font-weight: 400;\">In this episode, Nir shares his findings on the secrets to creating habit-forming products and how to leverage these behaviors in your business, career, and life.</span></p>",
            "length": "47167153",
            "sourceUrl": "http://chtbl.com/track/28555/traffic.libsyn.com/thegrowthshow/Nir20Eyal_.mp3?dest-id=400229",
            "snNo": "1",
            "epNo": "98"
        },
        {
            "title": "The Neuroscience of Unforgettable Content",
            "datePublished": "Tue, 30 Aug 2016 08:45:00 +0000",
            "description": "<p>We all want to create content people remember (and hopefully, act on). But what makes some pieces of content easier to remember than others?</p> <p>The Neuroscientist Carmen Simon has researched just that and shared her findings in her book, <em>Impossible to Ignore</em>.</p> <p>In this episode, Carmen shares her researched-backed insights on how to create content that leaves a lasting impression.</p>",
            "length": "30216895",
            "sourceUrl": "http://chtbl.com/track/28555/traffic.libsyn.com/thegrowthshow/Carmen20Simon.mp3?dest-id=400229",
            "snNo": "1",
            "epNo": "97"
        },
        {
            "title": "The Power of Knowing Your Weaknesses, and Other Advice From eShares’ CEO",
            "datePublished": "Tue, 23 Aug 2016 10:00:00 +0000",
            "description": "<p>When you're building a business, it's tempting to focus on what you're good at. You've got numbers to hit, people to impress, and customers to satisfy, so you zero in on your strengths and leave your weaknesses for another time.</p> <p>Henry Ward, CEO of eShares, doesn't believe in that philosophy. He thinks that if you want to build a great product, a great team, and a great company, you've got to get real with yourself on what you're bad at.</p> <p>In this episode, we talk with Henry about some of his weaknesses, and hear his perspective on management, feedback, organizational structure, and a few other hot-button issues he's blogged about on Medium.</p>",
            "length": "52415821",
            "sourceUrl": "http://chtbl.com/track/28555/traffic.libsyn.com/thegrowthshow/Henry20Ward20eShares.mp3?dest-id=400229",
            "snNo": "1",
            "epNo": "96"
        },
        {
            "title": "What Happens When You Win a Free Super Bowl Ad: The Death Wish Coffee Story",
            "datePublished": "Thu, 18 Aug 2016 10:00:00 +0000",
            "description": "<p>What if one moment could change the course of your entire business? That pivotal moment came to Mike Brown, Founder of Death Wish Coffee, in the form of a free Super Bowl ad. In one night, their small business became a household name, all because they won a contest with Intuit.</p> <p>In this episode, Mike shares the story behind winning the $5-million-dollar ad slot, what it meant for the business, and how they dealt with quadrupling in size and revenue.</p>",
            "length": "49069547",
            "sourceUrl": "http://chtbl.com/track/28555/traffic.libsyn.com/thegrowthshow/Mike20Brown20Death20Wish20Coffee.mp3?dest-id=400229",
            "snNo": "1",
            "epNo": "95"
        },
        {
            "title": "Growing GE, Intuit, eBay & More: Lorrie Norrington's Advice for Building a Legendary Company",
            "datePublished": "Tue, 16 Aug 2016 10:00:00 +0000",
            "description": "<p>Lorrie Norrington knows how to grow a company. She’s racked up over 30 years of experience as a senior business executive building companies like DIRECTV, GE, Intuit, and eBay.</p> <p>Her unique perspective has earned her the trust of top businesses, making her one of the most sought-after board members and advisors in tech.</p> <p>In this episode, Lorrie shares lessons from her storied career on the benefits of taking enough time to analyze your problems, leading your team with transparency, and watching what your customers do (not what they say).</p>",
            "length": "58960882",
            "sourceUrl": "http://chtbl.com/track/28555/traffic.libsyn.com/thegrowthshow/Lorrie20Norrington.mp3?dest-id=400229",
            "snNo": "1",
            "epNo": "94"
        },
        {
            "title": "Building the Netflix for Wine: Winc’s CEO on Creating a Personalized Wine Delivery Service",
            "datePublished": "Thu, 11 Aug 2016 10:00:00 +0000",
            "description": "<p>What wine should you try next?</p> <p>Many people are happy to head into a store and buy the same old Pinot Grigio they’ve come to love. Maybe if they’re feeling adventurous, they’ll opt for a new wine with a well-designed label. Maybe.</p> <p>One company is on a mission to change that. Winc (formerly known as Club W) uses machine learning to give subscribers personalized wine recommendations and deliver those recommendations to their doorsteps. It’s like Netflix -- but for wine.</p> <p>In this episode, we chat with Xander Oxman, co-founder and CEO of Winc, about his experience building the wine recommendation service, and what advice he’d give other entrepreneurs on starting a company around their personal passions.</p>",
            "length": "35211237",
            "sourceUrl": "http://chtbl.com/track/28555/traffic.libsyn.com/thegrowthshow/Xander_Oxman_Winc_.mp3?dest-id=400229",
            "snNo": "1",
            "epNo": "93"
        },
        {
            "title": "Mattermark’s CEO on Her Accidental Mission to Organize the World’s Business Data",
            "datePublished": "Tue, 09 Aug 2016 10:00:00 +0000",
            "description": "<p>Danielle Morrill didn’t set out to organize the world’s business information -- it happened sort of by accident.</p> <p>In high school, she started down this path by working at her father's business. After spending time as an analyst and the Head of Marketing for Twilio, she founded Mattermark, a business that helps companies uncover actionable insights in the wealth of data at their fingertips.</p> <p>In this episode, Danielle talks with our host, Kipp Bodnar, about expanding Mattermark’s target market, finding “work-life balance” when you start a company with close friends, and building a team when you’re early on in your startup’s journey.</p>",
            "length": "53938893",
            "sourceUrl": "http://chtbl.com/track/28555/traffic.libsyn.com/thegrowthshow/Danielle_Morrill_Mattermark.mp3?dest-id=400229",
            "snNo": "1",
            "epNo": "92"
        },
        {
            "title": "Why IBM Watson Won Jeopardy (And What It Means for Our Future)",
            "datePublished": "Thu, 04 Aug 2016 10:00:00 +0000",
            "description": "<p><span style=\"font-weight: 400;\">In 2011, IBM Watson beat</span> <em><span style=\"font-weight: 400;\">Jeopardy</span></em> <span style=\"font-weight: 400;\">mega-champion Ken Jennings, signaling a seismic shift in computing. Like the human mind, Watson can process massive amounts of information --- but in a fraction of the time it would take a normal person.</span></p> <p><span style=\"font-weight: 400;\">In this episode, Zachary Walchuk, developer evangelist at IBM Watson, shares how computers are starting to think a lot more like humans and what it means for our future.</span></p>",
            "length": "23475947",
            "sourceUrl": "http://chtbl.com/track/28555/traffic.libsyn.com/thegrowthshow/Zachary20Walchuk20IBM20Watson.mp3?dest-id=400229",
            "snNo": "1",
            "epNo": "91"
        },
        {
            "title": "Netflix’s Former Chief Talent Officer on the Right Way to Build a Great Team",
            "datePublished": "Tue, 02 Aug 2016 10:00:00 +0000",
            "description": "<p>Patty McCord knows a thing or two about building great teams and a corporate culture.</p> <p>During her time as Chief Talent Officer at Netflix, she created the famous Netflix Culture Deck -- one Sheryl Sandberg refers to as “...the most important document ever to come out of the Valley.” It comes as no surprise that Patty is a trusted advisor among bigwigs at places like Warby Parker, Bigcommerce, and Simply Hired.</p> <p>In today’s episode, Patty shares her firsthand advice on hiring invaluable teams, building a company culture, and dealing with the growing pains of scale.</p>",
            "length": "68800606",
            "sourceUrl": "http://chtbl.com/track/28555/traffic.libsyn.com/thegrowthshow/Netflix20Patty20McCord20.mp3?dest-id=400229",
            "snNo": "1",
            "epNo": "90"
        },
        {
            "title": "$5M in 3 Years: Behind the Scenes of an Up-and-Coming Fashion Startup",
            "datePublished": "Tue, 26 Jul 2016 10:00:00 +0000",
            "description": "<p><span style=\"font-weight: 400;\">Katie Doyle and Jay Adams, the co-founders of Brass Clothing, met when they were 14 years old. Since then, they’ve grown up a lot -- and so has their style, career, and friendship.</span></p> <p><span style=\"font-weight: 400;\">It’s on that foundation that they began Brass Clothing. With just $25,000 in the bank from a Kickstarter campaign, they set out to build a company to rival fast fashion giants like H&M and Forever 21.</span></p> <p>In two years, they’ve managed to grow tremendously. At the end of the year, they’re estimating $1 million in revenue, and $5M by end of 2017.</p> <p><span style=\"font-weight: 400;\">In this episode, Katie and Jay share their perspective on fundraising and customer feedback, and how their evolving friendship has accelerated their company’s growth.</span></p>",
            "length": "27585592",
            "sourceUrl": "http://chtbl.com/track/28555/traffic.libsyn.com/thegrowthshow/Brass_Clothing.mp3?dest-id=400229",
            "snNo": "1",
            "epNo": "89"
        },
        {
            "title": "What If Everything in the World Was Connected?",
            "datePublished": "Tue, 19 Jul 2016 10:00:00 +0000",
            "description": "<p>What if everything around you was connected? That is our future, and Linden Tibbets, CEO of IFTTT, is at the center of it.</p> <p>IFTTT users have complete creative control over how they connect apps and products -- and the possibilities are endless.</p> <p>In this episode, Linden shares his predictions on the future of connectivity and the possible implications for humanity.</p>",
            "length": "43528896",
            "sourceUrl": "http://chtbl.com/track/28555/traffic.libsyn.com/thegrowthshow/Linden20Tibbets20IFTTT.mp3?dest-id=400229",
            "snNo": "1",
            "epNo": "88"
        },
        {
            "title": "How to Fail Better: Hard-Learned Lessons From Medium’s Top Writer",
            "datePublished": "Tue, 12 Jul 2016 16:01:34 +0000",
            "description": "<p>Jon Westenberg is arguably one of the top writers on Medium. He has over 50 thousand followers, and his content receives over 300 thousand views in a month.</p> <p>By any measure, Jon is incredibly successful - but he’s also taken his fair share of knocks. In this episode, Jon talks about some of the secrets to his success on Medium - and how a few important failures shaped who he is today.</p>",
            "length": "39150676",
            "sourceUrl": "http://chtbl.com/track/28555/traffic.libsyn.com/thegrowthshow/Jon_Westenberg_-_Final.mp3?dest-id=400229",
            "snNo": "1",
            "epNo": "87"
        },
        {
            "title": "What Happens When You Start a Business With the Love of Your Life",
            "datePublished": "Tue, 05 Jul 2016 13:48:48 +0000",
            "description": "<p>Imagine starting a company with your significant other. Does that sound like a dream... or a nightmare? For married couple Anna and Nathan Bond, it seemed only natural to start a business together. Years ago, they began Rifle Paper Co., a stationery company, out of their garage. Today, it’s an international success, and Anna and Nathan’s relationship is stronger than ever. In this episode, Anna and Nathan share the real implications of having your business partner and romantic partner be the same person in your life -- and how their relationship has been a key to growing Rifle Paper Co.</p>",
            "length": "19565086",
            "sourceUrl": "http://chtbl.com/track/28555/traffic.libsyn.com/thegrowthshow/272277792-the-growth-show-rifle-paper-co.mp3?dest-id=400229",
            "snNo": "1",
            "epNo": "86"
        },
        {
            "title": "Mind the Gap: The Startup Bent on Helping Women Overcome Resume Breaks",
            "datePublished": "Tue, 28 Jun 2016 13:01:20 +0000",
            "description": "<p>Over 3 million educated women in the U.S. are looking to re-enter the workforce after taking a career break - yet only 40% secure full-time jobs, according to the Center for Talent Innovation. That’s where Jennifer Gefsky, founder of Après, comes in. She created a job marketplace targeting women who’ve taken a career break and helps them re-enter the workforce. In this episode, Jennifer shares advice on how to prepare for a career break, what to do during the gap to ensure an easy transition back, and what businesses around the world have to gain from hiring these valuable candidates.</p>",
            "length": "27224606",
            "sourceUrl": "http://chtbl.com/track/28555/traffic.libsyn.com/thegrowthshow/271224019-the-growth-show-jennifer-gefsky.mp3?dest-id=400229",
            "snNo": "1",
            "epNo": "85"
        },
        {
            "title": "The Secret to Mixpanel’s Rapid Growth? Question Everything",
            "datePublished": "Tue, 21 Jun 2016 12:54:23 +0000",
            "description": "<p>Suhail Doshi, the founder of Mixpanel, is not afraid to question the way things are done -- and his curiosity is one of the reasons why he’s so successful today. It all started in 2009. Suhail challenged the “golden metric” of website success and opened the door to more detailed analytics. Today, Mixpanel has nearly 4,000 customers at companies like Uber, Airbnb, and Venmo. In this episode, Suhail shares how he managed to grow his company during a recession using his passion, discipline, luck, and unconventional way of thinking all along the way.</p>",
            "length": "28511084",
            "sourceUrl": "http://chtbl.com/track/28555/traffic.libsyn.com/thegrowthshow/270165685-the-growth-show-suhail-doshi-mixpanel.mp3?dest-id=400229",
            "snNo": "1",
            "epNo": "84"
        },
        {
            "title": "What Most Managers Get Wrong About Hiring",
            "datePublished": "Tue, 14 Jun 2016 12:43:19 +0000",
            "description": "<p>On paper, the hiring process appears fairly straightforward: read applications, interview, hire top talent, and then rinse and repeat … right? Well, not exactly. The thing is, the conventional hiring process is broken -- and Jon Bischke, CEO of Entelo, has made it his mission to mend it. In this episode, Jon schools us on the top mistakes managers make in the hiring process and the tactics you can employ to be better at recruiting the right talent to grow your team.</p>",
            "length": "25897168",
            "sourceUrl": "http://chtbl.com/track/28555/traffic.libsyn.com/thegrowthshow/269030613-the-growth-show-jon-bischke-entelo.mp3?dest-id=400229",
            "snNo": "1",
            "epNo": "83"
        },
        {
            "title": "Building Better Bots: Ryan Block on Why Computers Can’t Replace Humans (Yet)",
            "datePublished": "Tue, 07 Jun 2016 13:02:20 +0000",
            "description": "<p>Are computers replacing humans? In short: not yet. That’s what Ryan Block, co-founder of Begin, believes, anyway - and he knows a thing or two about bots. In fact, his team is building one of their own, one that helps you stay on top of everything you've got going on. Ryan knows better than most what the bot timeline means for humans, and despite huge tech advancements, he’s largely skeptical. In fact, he claims we’re “15 Nobel Prizes away” from anything that could even remotely replace humans. In this episode, Ryan discusses our misinformed user expectations of bots, the mysterious future of bots, and their possible implications for humanity. Bonus: Watch a piece of this recording here: http://bit.ly/1PA2p19</p>",
            "length": "33432136",
            "sourceUrl": "http://chtbl.com/track/28555/traffic.libsyn.com/thegrowthshow/267962276-the-growth-show-bots-ryan-block.mp3?dest-id=400229",
            "snNo": "1",
            "epNo": "82"
        },
        {
            "title": "The Convenience Play: How Shyp Became the Hottest Startup in Silicon Valley",
            "datePublished": "Tue, 31 May 2016 12:47:48 +0000",
            "description": "<p>People pay for convenience. In fact, the Journal of Economic Perspectives found that consumers are willing to pay 20% more for a product purchased at a convenience store. Kevin Gibbon, the founder of Shyp, experienced this firsthand during his college years as an eBay PowerSeller. During that time, there was one major inhibitor on his business’ scale: the shipping process. Kevin decided to take matters into his own hands, and started Shyp, an uber-convenient shipping service. In this live-recorded show, HubSpot CEO Brian Halligan chats with Kevin about how he’s tapped into people’s need for convenience to rapidly expand his business.</p>",
            "length": "20775496",
            "sourceUrl": "http://chtbl.com/track/28555/traffic.libsyn.com/thegrowthshow/266761950-the-growth-show-kevin-gibbon-shyp.mp3?dest-id=400229",
            "snNo": "1",
            "epNo": "81"
        },
        {
            "title": "The Risks & Rewards of Getting Acquired by Google",
            "datePublished": "Tue, 24 May 2016 12:42:16 +0000",
            "description": "<p>Victoria Ransom has never been afraid of doing things a little differently than her peers. She once left New Zealand suburbia to attend school in the U.S. Later, she started a company during an economic crisis, and even spent six weeks living with a remote Amazonian tribe. By never shying away from the risks associated with making big changes, Victoria has reaped the rewards - one of them being an acquisition by Google for a reported $450 million. In this episode, Victoria tells us about the risks and rewards of being acquired by Google and the power of taking a break to unlock career growth.</p>",
            "length": "25160723",
            "sourceUrl": "http://chtbl.com/track/28555/traffic.libsyn.com/thegrowthshow/265669349-the-growth-show-victoria-ransom.mp3?dest-id=400229",
            "snNo": "1",
            "epNo": "80"
        },
        {
            "title": "The Surprising Benefit of Sharing Secrets: PostSecret’s Founder on His Decade-Long Social Experiment",
            "datePublished": "Tue, 17 May 2016 12:38:36 +0000",
            "description": "<p>Meet Frank Warren, the person who likely keeps the most secrets in the world. In fact, he has a whole room in his house devoted to storing them. You’re probably familiar with Frank: He’s the founder of PostSecret. Twelve years ago, he asked people to anonymously send their secrets to him on a prestamped postcard. Over a decade later, his social experiment turned into one of the most-visited ad-free blogs in the world. In this episode, Frank shares why vulnerability was the key to PostSecret’s growth, and how it can be used to strengthen your core relationships, leadership skills, and business.</p>",
            "length": "25608776",
            "sourceUrl": "http://chtbl.com/track/28555/traffic.libsyn.com/thegrowthshow/264546537-the-growth-show-postsecret-frank-warren.mp3?dest-id=400229",
            "snNo": "1",
            "epNo": "79"
        },
        {
            "title": "charity: water’s Founder on the Power of Naivety",
            "datePublished": "Tue, 10 May 2016 13:09:00 +0000",
            "description": "<p>charity: water’s founder, Scott Harrison, spent 10 years as a club promoter before starting his nonprofit. Yet, over a decade later, he’s managed to help over 6 million people get access to clean water. How did he rapidly grow charity: water with no experience in the nonprofit sector? He attributes his success to an often-undervalued quality: being naive. In this episode, Scott explains the perspective he’s gained being an outsider in the nonprofit sector and how this has helped him rapidly grow his organization.</p>",
            "length": "19979283",
            "sourceUrl": "http://chtbl.com/track/28555/traffic.libsyn.com/thegrowthshow/263398791-the-growth-show-charity-water-scott-harrison.mp3?dest-id=400229",
            "snNo": "1",
            "epNo": "78"
        },
        {
            "title": "What NBA Legend Bill Walton Learned From the Most Influential Leaders in His Life",
            "datePublished": "Tue, 03 May 2016 12:44:35 +0000",
            "description": "<p>Bill Walton’s life is one of extremes. Back in the 80s, he was a talented player on the Celtics. After his illustrious sports career, he went on to win awards for his career as a sportscaster. He's also experienced some deeply difficult situations with his health. At one point, he didn’t think he’d be able to walk again. To navigate these ups and downs, he’s leaned on lessons from three of the most influential leaders of his life: John Wooden, his basketball coach at UCLA; Larry Bird, his teammate on the Celtics; and Jerry Garcia, his idol in The Grateful Dead. In this episode, Bill tells us about some of the most prominent lessons learned from his influencers, including advice on achieving ambitious goals and being a better teammate and leader.</p>",
            "length": "23200913",
            "sourceUrl": "http://chtbl.com/track/28555/traffic.libsyn.com/thegrowthshow/262281528-the-growth-show-nba-legend-bill-walton.mp3?dest-id=400229",
            "snNo": "1",
            "epNo": "77"
        },
        {
            "title": "Making “The Message”: Why GE Took a Big Bet on Podcasting (And What’s Next)",
            "datePublished": "Tue, 19 Apr 2016 13:04:33 +0000",
            "description": "<p>As the Chief Creative Officer of GE, Andy Goldberg led the charge in developing new stories on emerging platforms and broadening General Electric's brand reach in the process. One of Andy's recent efforts was launching a podcast called \"The Message.\" In the few weeks after launch, it shot up to the top of the iTunes charts, beating out hits like \"Serial.\" On today's show, Andy shares advice on how to actually push a brand to explore these new, creative pursuits while still staying true to a company's roots.</p>",
            "length": "17967228",
            "sourceUrl": "http://chtbl.com/track/28555/traffic.libsyn.com/thegrowthshow/259835507-the-growth-show-ge-andy-goldberg.mp3?dest-id=400229",
            "snNo": "1",
            "epNo": "76"
        },
        {
            "title": "How to Inspire Others to Make Bold Changes: Tips for Turning Your Vision Into Reality",
            "datePublished": "Tue, 12 Apr 2016 13:21:16 +0000",
            "description": "<p>Part of being an exceptional leader means setting a solid vision for your team - and getting them on board to execute your vision together. But that is easier said than done. Even if you have a great idea, getting your team to understand and support your vision comes with a host of challenges. Enter communications experts Nancy Duarte and Patti Sanchez. In their new book, \"Illuminate,\" Nancy and Patti dive into research and real examples from companies like Apple, Disney, and IBM. They uncover better ways to sell your ideas to your team and inspire them to make those visions a reality. In this episode of The Growth Show, Nancy and Patti share what they found while writing their book - and how they've applied it to their own careers.</p>",
            "length": "23757217",
            "sourceUrl": "http://chtbl.com/track/28555/traffic.libsyn.com/thegrowthshow/258617456-the-growth-show-nancy-duarte-and-patti-sanchez.mp3?dest-id=400229",
            "snNo": "1",
            "epNo": "75"
        },
        {
            "title": "Building LEGO: A Behind-the-Scenes Look at the Iconic Brand’s Growth",
            "datePublished": "Tue, 05 Apr 2016 12:50:00 +0000",
            "description": "<p>For Michael McNally, working at LEGO was destiny. As a kid, he was a die-hard LEGO fanatic. So when he stumbled on a LEGO job listing as an adult, he knew he had to take a chance and apply. Seventeen years later, he couldn't be happier with his choice. In this episode of The Growth Show, Michael shares stories about what it's been like to work for such an iconic company - and his experiences shaping the future of the LEGO brand.</p>",
            "length": "24961357",
            "sourceUrl": "http://chtbl.com/track/28555/traffic.libsyn.com/thegrowthshow/257423800-the-growth-show-lego-michael-mcnally.mp3?dest-id=400229",
            "snNo": "1",
            "epNo": "74"
        },
        {
            "title": "Why the Best Managers Don't Have All the Answers",
            "datePublished": "Tue, 29 Mar 2016 13:31:38 +0000",
            "description": "<p>When you're a manager, it can be tempting to always have an answer for your employees' questions. But it turns out, the best managers aren't always quick to provide a solution. Instead, they ask more questions to help guide their employees to a solution on their own. Sounds simple, right? The thing is, this can be very tough to put into action. And in this episode of The Growth Show, that's exactly what our guest helps us do. We're joined by Michael Bungay Stanier, author of \"The Coaching Habit,\" to learn what separates good managers from great ones - and the tactics you can employ to become a great manager yourself.</p>",
            "length": "22017252",
            "sourceUrl": "http://chtbl.com/track/28555/traffic.libsyn.com/thegrowthshow/255755824-the-growth-show-michael-bungay-stanier-coaching.mp3?dest-id=400229",
            "snNo": "1",
            "epNo": "73"
        },
        {
            "title": "How to Build a Brand When No One Understands What You Do",
            "datePublished": "Thu, 24 Mar 2016 13:06:27 +0000",
            "description": "<p>The first rule of branding is to nail down a solid story. But what if your story is extremely complicated and technical? That's the situation Mike Troiano walked into when he become the CMO of Actifio. His solution? Forget the technicalities - instead, pretend you're talking to a 12-year-old about what your company does. That's just one of the branding tips Mike shares in this episode of The Growth Show. Mike also talks with us about some of the challenges he's run into and the specific growth tactics he's seen work along the way.</p>",
            "length": "18660622",
            "sourceUrl": "http://chtbl.com/track/28555/traffic.libsyn.com/thegrowthshow/254796124-the-growth-show-mike-troiano-actifio.mp3?dest-id=400229",
            "snNo": "1",
            "epNo": "72"
        },
        {
            "title": "The Happiness Equation: How to Design a More Fulfilling Life",
            "datePublished": "Sat, 19 Mar 2016 15:42:31 +0000",
            "description": "<p>Most people think happiness is a destination. You work hard. You become successful. Then, you're happy. Rinse and repeat for a happy life...right? Not exactly. According to Neil Pasricha, we've got this all backward. In his recently released book, \"The Happiness Equation,\" Neil dives into research about what makes people happy at work and in life. In this episode, Neil joins us to share his findings, including how to avoid burnout, why you should never retire, and how to identify your true passions in life.</p>",
            "length": "28247352",
            "sourceUrl": "http://chtbl.com/track/28555/traffic.libsyn.com/thegrowthshow/253194654-the-growth-show-the-happiness-equation.mp3?dest-id=400229",
            "snNo": "1",
            "epNo": "71"
        },
        {
            "title": "The Unconventional Habits of Highly Productive People",
            "datePublished": "Tue, 15 Mar 2016 12:00:53 +0000",
            "description": "<p>How do they actually get so much done in a day? We've all had this thought run through our minds before. The person in question tackles a bunch of projects at work, spends time with family, nurtures their personal relationships, and still finds time to train for a marathon. What's their secret? You convince yourself that they simply don't sleep. Or maybe they've escaped the space-time continuum. Or maybe, they just have something you don't. Turns out, they are doing something different -- but it's something you can learn to do, too. Charles Duhigg, a Pulitzer-winning journalist for The New York Times and author of \"The Power of Habit,\" has spent years trying to figure out what makes some people and teams more productive than others. Last week, Charles released his findings in a book titled \"Smarter Faster Better.\" In this episode, Charles shares some of his findings on how to build a happier and more productive team, career, and life.</p>",
            "length": "33178852",
            "sourceUrl": "http://chtbl.com/track/28555/traffic.libsyn.com/thegrowthshow/251975517-the-growth-show-charles-duhigg-productivity.mp3?dest-id=400229",
            "snNo": "1",
            "epNo": "70"
        },
        {
            "title": "The Slow Growth Advantage: How This Food Truck Turned Overnight Fame Into Long-Term Profit",
            "datePublished": "Tue, 08 Mar 2016 11:52:07 +0000",
            "description": "<p>James DiSabatino didn't set out to build one of Boston's biggest food trucks. In fact, he didn't have much of a plan at all. He just knew he wanted to sell grilled cheese, and a food truck was a relatively cheap way to do so. Fast-forward five years, and my, how things have changed. His food truck, Roxy's Grilled Cheese, has expanded into multiple brick-and-mortar locations (one of which is a shipping container). He's building an arcade in partnership with another local joint. He's even expanding out of his grilled cheese niche with an all-new restaurant theme. How'd he do it? According to James, it was taking a slower, conscious path to growth. And on this episode of The Growth Show, James tells us all about this deliberate path to growth, one that's made Roxy's Grilled Cheese a huge presence in Boston.</p>",
            "length": "20276034",
            "sourceUrl": "http://chtbl.com/track/28555/traffic.libsyn.com/thegrowthshow/250815878-the-growth-show-the-slow-growth-advantage-how-this-food-truck-turned-overnight-fame-into-long-term-profit.mp3?dest-id=400229",
            "snNo": "1",
            "epNo": "69"
        },
        {
            "title": "Patagonia’s Rick Ridgeway: Eye-Opening Lessons for Working (and Living) Adventurously",
            "datePublished": "Tue, 01 Mar 2016 16:44:49 +0000",
            "description": "<p>At Patagonia, transparency isn't convenient. \"Transparency is telling the good and the bad,\" says Rick Ridgeway, Patagonia's VP of Environmental Affairs. \"It is having the moxie to openly tell our customers and other external stakeholders about the harm that we are doing.\" But how does transparency work in reality? In this episode of The Growth Show, Rick gives us a true behind-the-scenes view of what it's like working at one of the most transparent companies in the world. He also shares some refreshing and eye-opening advice about life. Recently, he was in an accident with his longtime friend, Doug Tompkins (Founder of The North Face), and on this episode, Rick shares some of the life lessons he's learned in the aftermath. This is a special episode, folks. We hope you enjoy it.</p>",
            "length": "33827943",
            "sourceUrl": "http://chtbl.com/track/28555/traffic.libsyn.com/thegrowthshow/249674304-the-growth-show-patagonias-rick-ridgeway-eye-opening-lessons-for-working-and-living-adventurously.mp3?dest-id=400229",
            "snNo": "1",
            "epNo": "68"
        },
        {
            "title": "Developing the Writing Algorithm: Can Computers Teach Us to Be Better Writers?",
            "datePublished": "Tue, 23 Feb 2016 14:02:20 +0000",
            "description": "<p>Learning to write is a painful process. Here's how it typically goes: You spend hours crafting something you think will be a good piece. You submit it to someone else who's in charge of giving you feedback. They tear your piece apart. You make changes to your piece based on their suggestions. Rinse and repeat with new pieces until you're a proficient writer. Becoming a better writer isn't easy. Nor is it fast. But what if technology could make this whole process a little easier? That's what WriteLab is trying to do. Using algorithms and machine learning, they analyze a person's writing and give them suggestions on how to improve it. On this episode of The Growth Show, WriteLab's Co-Founder & CEO Matthew Ramirez joins us to talk about the lessons and challenges his company has encountered when addressing such an audacious problem.</p>",
            "length": "19591835",
            "sourceUrl": "http://chtbl.com/track/28555/traffic.libsyn.com/thegrowthshow/248495189-the-growth-show-developing-the-writing-algorithm-can-computers-teach-us-to-be-better-writers.mp3?dest-id=400229",
            "snNo": "1",
            "epNo": "67"
        },
        {
            "title": "The Power of No: 3 Leaders Discuss Their Most Difficult Decisions",
            "datePublished": "Thu, 18 Feb 2016 14:58:10 +0000",
            "description": "<p>Some things in life are easy to turn down. Offered a boiling cup of coffee in the middle of the summer? That's an easy thing to pass on. But some decisions in life aren't so clear-cut. In this episode of The Growth Show, we hear about the most difficult situations three of our past guests (Radical Candor's Author Kim Scott, Wistia's Co-Founder Chris Savage, and Everlane's Founder Michael Preysman) have been presented within their careers - and why they walked away from them.</p>",
            "length": "22764146",
            "sourceUrl": "http://chtbl.com/track/28555/traffic.libsyn.com/thegrowthshow/247691745-the-growth-show-the-power-of-no-3-leaders-discuss-their-most-difficult-decisions.mp3?dest-id=400229",
            "snNo": "1",
            "epNo": "66"
        },
        {
            "title": "How One Entrepreneur Built a Six-Figure Tech Company Without Knowing a Line of Code",
            "datePublished": "Tue, 16 Feb 2016 13:52:14 +0000",
            "description": "<p>When Mike Wilner first set out to build his tech startup, there was a huge elephant in the room: He had no idea how to code. To make matters worse, the company didn’t have a technical founder, either. Not one to let his background hold him back, Mike set out to build his dream company using the skills and resources he already had. The result? Six figures in sales, and enough product-market fit to attract a technical co-founder to the team. On this episode of The Growth Show, Mike shares his stories of the ups and downs of building a tech company when you have no technical talent at your disposal.</p>",
            "length": "18528129",
            "sourceUrl": "http://chtbl.com/track/28555/traffic.libsyn.com/thegrowthshow/247337438-the-growth-show-how-one-entrepreneur-built-a-six-figure-tech-company-without-knowing-a-line-of-code.mp3?dest-id=400229",
            "snNo": "1",
            "epNo": "65"
        },
        {
            "title": "How ChefSteps Plans to Make You Fall in Love With Cooking Again",
            "datePublished": "Tue, 09 Feb 2016 12:35:59 +0000",
            "description": "<p>For many, cooking is a chore. After a long day of work, you come home to throw together an easy-yet-healthy-enough meal. After whipping it up and scarfing it down, you're on to the next thing: Family time, unresolved emails, or a quick episode of Netflix before you pass out. ChefSteps wants to change all that. With a vibrant community, a plethora of creative recipes, and most recently, a shiny new piece of hardware, the company plans to change the way regular people feel about cooking at home. In this episode, ChefSteps Co-Founder Chris Young joins us to talk about building his company from the ground up -- and the lessons he's learned along the way.</p>",
            "length": "22943868",
            "sourceUrl": "http://chtbl.com/track/28555/traffic.libsyn.com/thegrowthshow/246188433-the-growth-show-how-chefsteps-plans-to-make-you-fall-in-love-with-cooking-again.mp3?dest-id=400229",
            "snNo": "1",
            "epNo": "64"
        },
        {
            "title": "Selling Snow: How One Couple Built a Booming Side Business From Boston's Biggest Blizzard",
            "datePublished": "Tue, 02 Feb 2016 14:03:59 +0000",
            "description": "<p>It was snowing. A lot. Boston was in the midst of a blizzard, receiving the most snow ever in recorded history. Kyle and Jessica Waring were stranded in their apartment, racking their brains for something to do. Then, they landed on an idea. What if they sold the snow outside their apartment and shipped it to anyone in the country? It'd be hilarious -- and might turn into a viable business opportunity. Within weeks, their business went viral. Orders were piling up. Top media outlets from across the country were talking about it. And Kyle and Jessica were having a blast. A year later, the fun hasn't stopped. They've launched several other lines of business shipping foliage and coal -- all while working 9-5 jobs.</p>",
            "length": "15712338",
            "sourceUrl": "http://chtbl.com/track/28555/traffic.libsyn.com/thegrowthshow/245059297-the-growth-show-how-one-couple-built-a-booming-side-business-from-bostons-biggest-blizzard.mp3?dest-id=400229",
            "snNo": "1",
            "epNo": "63"
        },
        {
            "title": "ClassPass' Founder on the Twists & Turns of Growing the Popular Fitness Startup",
            "datePublished": "Tue, 26 Jan 2016 13:55:28 +0000",
            "description": "<p>When Payal Kadakia quit her job at Warner Music Group, she didn't have a backup plan. She knew she wasn't happy in her job, but she wasn't sure what she wanted to do next. After a few weeks of soul-searching, she decided on her next move: She was going to start a fitness search engine to help people uncover new classes in their area. Three years and several pivots later, Payal's landed on a business model that works. Her company, ClassPass, is valued at over $400 million and has expanded to 36 cities and 3 countries. In this episode of The Growth Show, Payal walks us through the twists and turns of building ClassPass -- and what she's learned along the way.</p>",
            "length": "13594539",
            "sourceUrl": "http://chtbl.com/track/28555/traffic.libsyn.com/thegrowthshow/243870241-the-growth-show-classpass-founder-on-the-twists-turns-of-growing-the-popular-fitness-startup.mp3?dest-id=400229",
            "snNo": "1",
            "epNo": "62"
        },
        {
            "title": "No Such Thing As Luck? 3 Entrepreneurs Dish on Their Biggest Breaks",
            "datePublished": "Thu, 21 Jan 2016 15:56:46 +0000",
            "description": "<p>Most people would agree: Luck is an integral ingredient to success. The tough part is, getting lucky is all up to chance. You can't predict it. You can't manufacture it. Or can you? In this special episode of The Growth Show, we hear stories from three of our past guests (Chris Savage of Wistia, Jascha Kaykas-Wolff of Mozilla, and Vlad Tenev of Robinhood) about a time they got lucky in business - and find out if getting lucky really comes down to chance.</p>",
            "length": "29403845",
            "sourceUrl": "http://chtbl.com/track/28555/traffic.libsyn.com/thegrowthshow/243074598-the-growth-show-no-such-thing-as-luck-3-entrepreneurs-dish-on-their-biggest-breaks.mp3?dest-id=400229",
            "snNo": "1",
            "epNo": "61"
        },
        {
            "title": "What Great Bosses Do Differently",
            "datePublished": "Tue, 19 Jan 2016 14:07:12 +0000",
            "description": "<p>When was the last time you held back valuable feedback for fear of being mean? We've all done this before. We think we're being kind. But, we aren't. Turns out, this behavior can have drastic consequences when you do this at work - especially when you're a manager. In this episode of The Growth Show, Kim Scott, an author who's previously worked with companies like Twitter, Apple, Google, and Dropbox, outlines her framework for radical candor, and gives tips for making a change in your own management style to build a more productive, happy team.</p>",
            "length": "34081226",
            "sourceUrl": "http://chtbl.com/track/28555/traffic.libsyn.com/thegrowthshow/242728918-the-growth-show-what-great-bosses-do-differently.mp3?dest-id=400229",
            "snNo": "1",
            "epNo": "60"
        },
        {
            "title": "How to Discover the Next Big Thing: Advice From Mozilla's CMO, Jascha Kaykas-Wolff",
            "datePublished": "Tue, 12 Jan 2016 14:12:16 +0000",
            "description": "<p>We all want to be the one to uncover the next big thing - the next big app, the next big trend, the next big growth strategy. We take big bets. We tell our boss that surely this is the thing that's going to take off. If we don't pay attention now, we could be left behind. The truth is, uncovering the next big thing can be very difficult - but it's a necessary skill when you're tasked with growing a company. So how do you go about figuring out which trends are about to take off, and which ones will be duds? On this episode of The Growth Show, the CMO of Mozilla, Jascha Kaykas-Wolff, joins our host, Kipp, to talk about the best way to identify growth opportunities - even when you have limited or fragmented data.</p>",
            "length": "25402304",
            "sourceUrl": "http://chtbl.com/track/28555/traffic.libsyn.com/thegrowthshow/241598084-the-growth-show-advice-from-mozillas-cmo-jascha-kaykas-wolff.mp3?dest-id=400229",
            "snNo": "1",
            "epNo": "59"
        },
        {
            "title": "Everlane's Founder on Building a Transparent, Focused & Cutting-Edge Fashion Brand",
            "datePublished": "Tue, 05 Jan 2016 14:22:49 +0000",
            "description": "<p>Everlane isn't like many other contemporary fashion brands. While others drive profits by discretely marking up low-cost goods, Everlane discloses the line-by-line costs for producing their products - and how much money they make on each transaction. While others obscure details about their supply chain, Everlane devotes a whole section of their website to photos and information about their factories. While others rely on tried-and-true marketing tactics like sending emails and launching remarketing campaigns to interact with customers, Everlane experiments with Facebook Messenger and Snapchat to place orders and drive demand. How'd the company build such a transparent and nimble brand? In this episode of The Growth Show, our host, Kipp Bodnar, sits down with Everlane's Founder, Michael Preysman, to learn the secrets to the company's success.</p>",
            "length": "24039339",
            "sourceUrl": "http://chtbl.com/track/28555/traffic.libsyn.com/thegrowthshow/240501368-the-growth-show-everlane-michael-preysman-transparent-fashion.mp3?dest-id=400229",
            "snNo": "1",
            "epNo": "58"
        },
        {
            "title": "Disrupting a Centuries-Old Industry: How Robinhood Plans to Upend the Financial Sector's Giants",
            "datePublished": "Tue, 29 Dec 2015 13:28:44 +0000",
            "description": "<p>When you're up against companies with household names and centuries of experience, how do you win market share? It's simple: Find out what they don't do well ... and then do that thing very well. That philosophy is what has made Robinhood a fierce competitor in their space. They created a mobile app that makes it easy to buy and sell stocks - for free. In an industry where people typically pay $10 per transaction, Robinhood is quickly gaining traction with both brand new and experienced investors. In this episode, we sit down with Robinhood co-founder Vlad Tenev to dive into their strategy for building a disruptive business -- and how the heck they generate revenue without charging fees.</p>",
            "length": "17432240",
            "sourceUrl": "http://chtbl.com/track/28555/traffic.libsyn.com/thegrowthshow/239546343-the-growth-show-robinhood-vlad-tenev.mp3?dest-id=400229",
            "snNo": "1",
            "epNo": "57"
        },
        {
            "title": "The Realities of Scaling a Startup: Inside Wistia's 10-Year Path to 200K Customers",
            "datePublished": "Tue, 22 Dec 2015 13:43:00 +0000",
            "description": "<p>In the beginning, Wistia had just a few guys working out of an apartment in Cambridge, Massachusetts. It took them a year to make their first dollar, and then another year to sign on 10 customers. But the folks at Wistia never gave up. Nearly 10 years later, the company's persistence has paid off in spades: They have 200,000 customers using their video marketing platform, and they've hired more than 60 people to grow the company even more.</p>",
            "length": "26243656",
            "sourceUrl": "http://chtbl.com/track/28555/traffic.libsyn.com/thegrowthshow/238658120-the-growth-show-wistia-chris-savage.mp3?dest-id=400229",
            "snNo": "1",
            "epNo": "56"
        },
        {
            "title": "Lyft's CMO on Disrupting a Competitive Industry, Scaling Culture & Hiring Player-Coaches",
            "datePublished": "Tue, 15 Dec 2015 14:30:43 +0000",
            "description": "<p>Pink mustaches. Fist bumps. A seat up front. These quirks help differentiate Lyft as the friendly, human option in an uber-competitive industry. And it's working. Today, the company is one of the fastest-growing ride-sharing apps on the market. We chat with Lyft CMO Kira Wampler about surviving (and thriving) in a competitive industry, scaling non-scalable parts of a company, and hiring the best people for a high-growth team.</p>",
            "length": "22082036",
            "sourceUrl": "http://chtbl.com/track/28555/traffic.libsyn.com/thegrowthshow/237663078-the-growth-show-lyft-cmo-kira-wampler.mp3?dest-id=400229",
            "snNo": "1",
            "epNo": "55"
        },
        {
            "title": "Behind the Scenes With Zappos: How to Build a Lovable Company Culture",
            "datePublished": "Tue, 08 Dec 2015 12:22:54 +0000",
            "description": "<p>Ah, company culture. It's the management buzzword du jour. And it's often the overlooked, compartmentalized, and misunderstood element to building a hyper-growth company. How should you actually go about building a company culture people love? To find an answer, we spoke with Zappos' Jon Wolske. Listen to this episode to learn about the company's unique approach to management, organizational structure, and most importantly, culture.</p>",
            "length": "27073723",
            "sourceUrl": "http://chtbl.com/track/28555/traffic.libsyn.com/thegrowthshow/236616922-the-growth-show-zappos-lovable-company-culture.mp3?dest-id=400229",
            "snNo": "1",
            "epNo": "54"
        },
        {
            "title": "The Secrets to Becoming a Radically Honest, Passionate & Audacious Leader",
            "datePublished": "Wed, 02 Dec 2015 17:03:00 +0000",
            "description": "<p>Kai Kight's background is anything but typical. When he was three, he began learning the violin, later going on to perform in places like the White House and the Great Wall of China. Then, he went on to earn an engineering degree from Stanford University's d. school where he was entrenched in the entrepreneurship community of Silicon Valley. Today, he travels the world, teaching people at companies like Disney and Coca-Cola how to be better leaders and managers. On this episode of the Growth Show, we sit down with Kai to learn his secrets to being an insanely honest leader, creating (and sticking to) healthy habits, and building a career around your passions.</p>",
            "length": "22119652",
            "sourceUrl": "http://chtbl.com/track/28555/traffic.libsyn.com/thegrowthshow/235759766-the-growth-show-kai-kight-motivational-composer.mp3?dest-id=400229",
            "snNo": "1",
            "epNo": "53"
        },
        {
            "title": "Mo Mustaches, Mo Growth: The Rise of the Movember Movement",
            "datePublished": "Tue, 24 Nov 2015 02:31:19 +0000",
            "description": "<p>It began as a bet in a bar. A group of friends got together and decided to see who could grow the coolest mustache. Over a decade later, this bet has blossomed into a global movement called Movember. Each November, millions of men all over the world grow mustaches to raise awareness and funds for men's health initiatives.</p>",
            "length": "21516955",
            "sourceUrl": "http://chtbl.com/track/28555/traffic.libsyn.com/thegrowthshow/234441527-the-growth-show-movember-growth.mp3?dest-id=400229",
            "snNo": "1",
            "epNo": "52"
        },
        {
            "title": "Growth Secrets From Canva: How the Design Startup Acquires 30K New Users a Day",
            "datePublished": "Tue, 17 Nov 2015 14:18:43 +0000",
            "description": "<p>Visual content: Everyone knows they need it, but many people lack the skills or tools to do it well. That is, until Canva entered the picture in 2013. The company created an easy-to-use design platform to help the average person create beautiful content. Two years later, it's acquired nearly 7 million users and secured famous investors like Owen Wilson and Woody Harrelson. How'd Canva grow so darn fast?</p>",
            "length": "21848397",
            "sourceUrl": "http://chtbl.com/track/28555/traffic.libsyn.com/thegrowthshow/233459174-the-growth-show-growth-secrets-from-canva.mp3?dest-id=400229",
            "snNo": "1",
            "epNo": "51"
        },
        {
            "title": "How to Compete With Google: Inside This Startup's Plan to Disrupt the #1 Search Engine in the World",
            "datePublished": "Tue, 10 Nov 2015 14:28:50 +0000",
            "description": "<p>Would you ever start a company that competed with Google? Back in 2007, that's exactly what Gabriel Weinberg did. He created DuckDuckGo, an alternative search engine to Google, and has been chipping away at Google's massive market share ever since. In the past two years, DuckDuckGo has grown nearly 600% and even reached profitability. How does DuckDuckGo successfully compete against one of the biggest and most recognizable companies in the world?</p>",
            "length": "16687437",
            "sourceUrl": "http://chtbl.com/track/28555/traffic.libsyn.com/thegrowthshow/232430475-the-growth-show-gabriel-weinberg-how-to-compete-with-google.mp3?dest-id=400229",
            "snNo": "1",
            "epNo": "50"
        },
        {
            "title": "Succeeding on Medium: How the Hottest Publishing Platform Rewards Quality Content & Conversation",
            "datePublished": "Tue, 03 Nov 2015 14:23:42 +0000",
            "description": "<p>In a world where attention spans are shortening and there's more and more content than ever, how should a company grow its brand online? Enter Medium. Part platform and part publisher, the company's out to change the way people create and discover content on the web. This week, we chat with Sophie Moura, the head of B2B partnerships at Medium, to get tips for leaders on building a content strategy on the platform.</p>",
            "length": "24148008",
            "sourceUrl": "http://chtbl.com/track/28555/traffic.libsyn.com/thegrowthshow/231360389-the-growth-show-medium-sophie-moura.mp3?dest-id=400229",
            "snNo": "1",
            "epNo": "49"
        },
        {
            "title": "How to Become an Influential Leader: Tips on Hiring, Growth & Management From Charlene Li",
            "datePublished": "Tue, 27 Oct 2015 13:36:41 +0000",
            "description": "<p>Technology has completely changed the way people work -- especially leaders at high-growth companies. How should managers approach hiring, growth, and management today? This week, we sit down with Charlene Li, Founder and CEO of Altimeter Group, to chat about her philosophy on these top leadership concerns.</p>",
            "length": "26848025",
            "sourceUrl": "http://chtbl.com/track/28555/traffic.libsyn.com/thegrowthshow/230308212-the-growth-show-charlene-li-tips-on-hiring-and-growth.mp3?dest-id=400229",
            "snNo": "1",
            "epNo": "48"
        },
        {
            "title": "How to Make Your Own Luck: Problogger's Founder on the Secrets to Success (Live at #INBOUND15)",
            "datePublished": "Tue, 20 Oct 2015 14:17:00 +0000",
            "description": "<p>It all started with an email from a friend, mentioning this thing called a \"blog.\" Darren Rowse learned of this new trend taking the internet by storm - and he wanted to try it to build a business. Thirteen years later, Darren Rowse has built two extremely successful blogs - Problogger and Digital Photography School - that amass over 5 million visitors each month. While lots of hard work certainly went into building his websites, Darren attributes part of his success to being in the right place at the right time. In this episode of The Growth Show, Darren joins us to chat about the role luck plays when you're starting something new -- and how you can set yourself up to be even luckier in business.</p>",
            "length": "12249964",
            "sourceUrl": "http://chtbl.com/track/28555/traffic.libsyn.com/thegrowthshow/229254851-the-growth-show-darren-rowse-problogger-live-at-inbound.mp3?dest-id=400229",
            "snNo": "1",
            "epNo": "47"
        },
        {
            "title": "Embracing Doubt & Other Leadership Lessons From a Former Executive at LinkedIn (Live at #INBOUND15)",
            "datePublished": "Tue, 13 Oct 2015 14:21:36 +0000",
            "description": "<p>It's natural to be afraid of doubt - especially when you're leading a team. You want to be the calm, cool, and collected leader ... but inside you're freaking out. Turns out, some of the best leaders and innovators are those who embrace doubt. In this episode of The Growth Show, Kevin Eyres, an executive coach for hyper-growth companies and former executive at LinkedIn, joins us to talk about the power of doubt, and how it can make you a more innovative leader.</p>",
            "length": "20131003",
            "sourceUrl": "http://chtbl.com/track/28555/traffic.libsyn.com/thegrowthshow/228210541-the-growth-show-linkedin-exec-kevin-eyres-inbound-15.mp3?dest-id=400229",
            "snNo": "1",
            "epNo": "46"
        },
        {
            "title": "Todd Rowe, Google’s Managing Director, on Creating a Culture of Innovation (Live at #INBOUND15)",
            "datePublished": "Tue, 06 Oct 2015 14:28:37 +0000",
            "description": "<p>Ever wonder why Google is so successful? According to Todd Rowe, Managing Director at Google, it all comes down to placing big bets on smart people - and giving them the space to achieve those bets. In this special episode of The Growth Show that was recorded live at INBOUND 2015, Todd gives us a great overview of Google’s philosophy on growth.</p>",
            "length": "9205968",
            "sourceUrl": "http://chtbl.com/track/28555/traffic.libsyn.com/thegrowthshow/227168672-the-growth-show-todd-rowe-google-inbound-15.mp3?dest-id=400229",
            "snNo": "1",
            "epNo": "45"
        },
        {
            "title": "Sophia Amoruso, Founder of Nasty Gal, Live at #INBOUND15",
            "datePublished": "Tue, 29 Sep 2015 13:19:55 +0000",
            "description": "<p>The year was 2006. Sophia Amoruso was sitting in her apartment in a bathrobe and selling vintage clothes on eBay. She was the “one man band” behind Nasty Gal: She found the vintage clothes, styled the outfits, modeled them for product pictures, shipped her products to eager customers, and collected feedback along the way. Years later, Nasty Gal has become one of the hottest fashion brands for young women. In this special episode of The Growth Show recorded live at INBOUND 2015, Nasty Gal founder Sophia Amoruso gives us an inside look at her company's incredible growth.</p>",
            "length": "10115865",
            "sourceUrl": "http://chtbl.com/track/28555/traffic.libsyn.com/thegrowthshow/226099643-the-growth-show-sophia-amoruso-nasty-gal-inbound15.mp3?dest-id=400229",
            "snNo": "1",
            "epNo": "44"
        },
        {
            "title": "Jonah Peretti, Founder of BuzzFeed & The Huffington Post, Live at #INBOUND15",
            "datePublished": "Tue, 22 Sep 2015 13:38:51 +0000",
            "description": "<p>On this live-recorded episode from INBOUND 2015, Jonah Peretti, founder of BuzzFeed & The Huffington Post, joins us to chat about BuzzFeed's insane growth and how viral content spreads.</p>",
            "length": "10591502",
            "sourceUrl": "http://chtbl.com/track/28555/traffic.libsyn.com/thegrowthshow/225038833-the-growth-show-jonah-peretti-buzzfeed-inbound15.mp3?dest-id=400229",
            "snNo": "1",
            "epNo": "43"
        },
        {
            "title": "Marc Maron Live at #INBOUND15",
            "datePublished": "Wed, 16 Sep 2015 20:51:38 +0000",
            "description": "<p>Comedian and podcaster Marc Maron joins us on this episode of The Growth Show -- the first in a series of live interview's from INBOUND 2015.</p>",
            "length": "29203637",
            "sourceUrl": "http://chtbl.com/track/28555/traffic.libsyn.com/thegrowthshow/224185461-the-growth-show-marc-maron-interview.mp3?dest-id=400229",
            "snNo": "1",
            "epNo": "42"
        },
        {
            "title": "Clif Bar CEO Kevin Cleary",
            "datePublished": "Mon, 31 Aug 2015 13:47:01 +0000",
            "description": "<p>The founders of Clif Bar could have sold the company for $120M in 2000. Most people would have taken that offer, but instead, Clif Bar wanted to build a brand that would last well beyond their founders -- a brand that would matter for current employees, future employees and their kids. Fast forward to 2015 and that’s exactly what Clif Bar has done.</p>",
            "length": "78414348",
            "sourceUrl": "http://chtbl.com/track/28555/traffic.libsyn.com/thegrowthshow/221694741-the-growth-show-clif-bar-ceo-kevin-cleary.mp3?dest-id=400229",
            "snNo": "1",
            "epNo": "42"
        },
        {
            "title": "Re-Thinking the Way We Work with Basecamp CEO Jason Fried",
            "datePublished": "Tue, 25 Aug 2015 14:08:32 +0000",
            "description": "<p>Jason Fried is the founder and CEO of Basecamp, the co-author of Getting Real, Remote, and The New York Times Bestseller REWORK. He’s a frequent speaker on management, leadership and is always challenging the status quo in a quest to change the way we work.</p>",
            "length": "65986746",
            "sourceUrl": "http://chtbl.com/track/28555/traffic.libsyn.com/thegrowthshow/220815973-the-growth-show-re-thinking-the-way-we-work-with-basecamp-ceo-jason-fried.mp3?dest-id=400229",
            "snNo": "1",
            "epNo": "41"
        },
        {
            "title": "Ghostery CEO Scott Meyer",
            "datePublished": "Tue, 18 Aug 2015 13:56:48 +0000",
            "description": "<p>Scott Meyer is the CEO of Ghostery, a technology company that allows consumers and businesses to create safer, faster, and more trusted digital experiences. Prior to Ghostery, Scott was President and CEO of About.com and held a senior management role at the New York Times. He joins Dave this week to talk about transparency, why he still makes the time to interview every new hire, how he runs meetings with his direct reports and more.</p>",
            "length": "79115493",
            "sourceUrl": "http://chtbl.com/track/28555/traffic.libsyn.com/thegrowthshow/219782104-the-growth-show-ghostery-ceo-scott-meyer.mp3?dest-id=400229",
            "snNo": "1",
            "epNo": "40"
        },
        {
            "title": "The Heady Topper Craze",
            "datePublished": "Mon, 10 Aug 2015 14:45:12 +0000",
            "description": "<p>John and Jen Kimmich are the owners of the Alchemist Brewery. Their most popular beer, Heady Topper, has become a sensation up and down the East Coast. It’s been called liquid gold, sacred beer and the greatest IPA people have ever tasted, and craft beer lovers today go to crazy lengths just to get their hands on a case of it. The thing that makes Heady Topper’s popularity even crazier, is that the beer is only sold within a 20-mile radius near Stow, Vermont.</p>",
            "length": "60676747",
            "sourceUrl": "http://chtbl.com/track/28555/traffic.libsyn.com/thegrowthshow/218599176-the-growth-show-alchemist-brewing.mp3?dest-id=400229",
            "snNo": "1",
            "epNo": "39"
        },
        {
            "title": "Sue Heilbronner, CEO, MergeLane",
            "datePublished": "Mon, 03 Aug 2015 20:34:06 +0000",
            "description": "<p>Sue Heilbronner is the CEO and Co-Founder of MergeLane, a startup accelerator in Boulder, CO that discovers, accelerates and invests in exceptional women and the companies they run. We talk about MergeLane and why she started an accelerator focused on women, how she re-invented herself in the middle of her career (she’s gone from Federal Prosecutor to CMO to CEO to investor), and what makes a great leader (based on her work with the Conscious Leadership Group).</p>",
            "length": "84009757",
            "sourceUrl": "http://chtbl.com/track/28555/traffic.libsyn.com/thegrowthshow/217640415-the-growth-show-sue-heilbronner-ceo-mergelane.mp3?dest-id=400229",
            "snNo": "1",
            "epNo": "38"
        },
        {
            "title": "Gimlet Media Co-Founders Alex Blumberg and Matt Lieber",
            "datePublished": "Mon, 27 Jul 2015 16:27:57 +0000",
            "description": "<p>Last year, former This American Life producer and Planet Money co-host Alex Blumberg launched a business of his own: Gimlet Media. In true journalistic fashion, Alex decided to document the entire process of starting Gimlet — from botching a pitch to legendary VC Chris Sacca all the way through finding his business partner Matt Lieber — and released it as a podcast of it’s own called StartUp. Fast forward to today, and Gimlet has 20 full-time employees, $2M in revenue, and three shows (including StartUp) that are routinely in the top 30 on iTunes, attracting an audience of over four million people each month.</p>",
            "length": "79830772",
            "sourceUrl": "http://chtbl.com/track/28555/traffic.libsyn.com/thegrowthshow/216574444-the-growth-show-gimlet-media.mp3?dest-id=400229",
            "snNo": "1",
            "epNo": "37"
        },
        {
            "title": "Harry's Co-Founder and Co-CEO Jeff Raider",
            "datePublished": "Tue, 21 Jul 2015 14:41:06 +0000",
            "description": "<p>Jeff Raider is the Co-Founder and Co-CEO of Harry’s. Harry’s is on a mission to make the shaving process easier: all you have to do is enter the number of blades you want and how often you want to get them, and Harry's will send razors right to your door. Before starting Harry’s, Jeff was one of the co-founders of Warby Parker, and many are now calling Harry’s \"The Warby Parker of shaving.\" He joins Mike this week to talk about taking on the incumbents like Gillette and disrupting a 100-year-old industry, the importance of creating a creating a direct relationship with consumers, how they were able to get 100,000 people signed up before launching, and what he learned as a co-founder of Warby Parker.</p>",
            "length": "61473782",
            "sourceUrl": "http://chtbl.com/track/28555/traffic.libsyn.com/thegrowthshow/215690159-the-growth-show-harrys-co-founder-and-co-ceo-jeff-raider.mp3?dest-id=400229",
            "snNo": "1",
            "epNo": "36"
        },
        {
            "title": "Blue Bottle Coffee CEO James Freeman",
            "datePublished": "Mon, 13 Jul 2015 20:21:27 +0000",
            "description": "<p>James Freeman is the founder and CEO of Blue Bottle Coffee, a coffee roaster and retailer headquartered in Oakland, California. Blue Bottle has cafes in San Francisco's Ferry Building, New York's Rockefeller Center and New York, as well as seven other locations. Best known for their long lines of customers who wait for individually brewed cups of coffee, Blue Bottle has caught the eye of Silicon Valley’s top investors, including Chris Sacca’s Lowercase Capital, Google Ventures, Kevin Systrom (Instagram founder) and Tony Hawk. Mike and James go behind the scenes on James' passion for good coffee, and how it's led to Blue Bottle's growth.</p>",
            "length": "61216264",
            "sourceUrl": "http://chtbl.com/track/28555/traffic.libsyn.com/thegrowthshow/214569718-the-growth-show-blue-bottle-coffee-ceo-james-freeman.mp3?dest-id=400229",
            "snNo": "1",
            "epNo": "35"
        },
        {
            "title": "How 90+ Cellars Became the Fastest Growing Wine Brand in the U.S.",
            "datePublished": "Mon, 06 Jul 2015 19:29:17 +0000",
            "description": "<p>90+ Cellars is the fastest growing wine brand in the U.S. yet they don’t own any vineyards, they don’t plant any grapes, and they don’t even own any wineries. Kevin Mehra (President) and Brett Vankoski (Vice President) join Growth Show producer Dave Gerhardt on this episode to share the story behind 90+ Cellars and going from launching the company during the recession to growing 580%.</p>",
            "length": "68185678",
            "sourceUrl": "http://chtbl.com/track/28555/traffic.libsyn.com/thegrowthshow/213528455-the-growth-show-wine.mp3?dest-id=400229",
            "snNo": "1",
            "epNo": "34"
        },
        {
            "title": "Codecademy CEO Zach Sims",
            "datePublished": "Mon, 29 Jun 2015 16:22:22 +0000",
            "description": "<p>With only one year left until graduation, Zach Sims decided to drop out of Columbia in 2011 to start Codecademy. Fast forward to 2015 and Codecademy has grown to help more than 25 million people around the world learn how to code. Zach joins Mike on this episode of The Growth Show to talk about the decision to drop out of Columbia and Codecademy’s rapid growth, plus some thoughts on the future of the education system (will we be sending our kids to college 15 years from now?), what’s broken with corporate learning, and Zach’s big appearance on The Colbert Report.</p>",
            "length": "53307606",
            "sourceUrl": "http://chtbl.com/track/28555/traffic.libsyn.com/thegrowthshow/212503676-the-growth-show-codecademy.mp3?dest-id=400229",
            "snNo": "1",
            "epNo": "33"
        },
        {
            "title": "Elon Musk Biographer and Businessweek Writer Ashlee Vance",
            "datePublished": "Mon, 22 Jun 2015 19:30:21 +0000",
            "description": "<p>Veteran tech journalist Ashlee Vance (NYT, Businessweek) joins Mike to talk about Ashlee’s best-selling biography of Elon Musk. Ashlee goes behind the scenes to talk about PayPal, SpaceX, Tesla and SolarCity, Elon’s personality and working style, and why he’s more like Thomas Edison than Steve Jobs.</p>",
            "length": "74615652",
            "sourceUrl": "http://chtbl.com/track/28555/traffic.libsyn.com/thegrowthshow/211503446-the-growth-show-elon.mp3?dest-id=400229",
            "snNo": "1",
            "epNo": "32"
        },
        {
            "title": "theSkimm Founders Carly Zakin and Danielle Weisberg",
            "datePublished": "Mon, 15 Jun 2015 19:32:04 +0000",
            "description": "<p>Carly and Danielle quit their jobs at NBC News without a product and only two months worth of savings in their bank accounts. Today, they’re the founders of theSkimm, which has been called Oprah’s must-read newsletter. And Oprah’s not alone -- theSkimm has grown to over one million subscribers, and the founders are well on their way to turning news into a lifestyle brand.</p>",
            "length": "66442378",
            "sourceUrl": "http://chtbl.com/track/28555/traffic.libsyn.com/thegrowthshow/210470887-the-growth-show-theskimm.mp3?dest-id=400229",
            "snNo": "1",
            "epNo": "31"
        },
        {
            "title": "Harvard Business Review and Venturebeat on the Future of Publishing",
            "datePublished": "Mon, 08 Jun 2015 17:10:23 +0000",
            "description": "<p>We’ve got two special guests on this episode of The Growth Show: Harvard Business Review Group Publisher Josh Macht and Venturebeat Editor-In-Chief Dylan Tweney. Dylan steps in as host and talks to Josh about the future of the publishing industry, how Harvard Business Review has grown an audience of millions in an age where traditional media is declining, and they both share their thoughts on why today’s publishers need to diversify their revenue streams and not rely on a single business model.</p>",
            "length": "76334650",
            "sourceUrl": "http://chtbl.com/track/28555/traffic.libsyn.com/thegrowthshow/209385128-the-growth-show-hbr-venturebeat.mp3?dest-id=400229",
            "snNo": "1",
            "epNo": "30"
        },
        {
            "title": "How an Event Grew from an Idea to 10,000 Attendees",
            "datePublished": "Mon, 01 Jun 2015 15:38:38 +0000",
            "description": "<p>If you've ever thought about running an event for your business, you don't want to miss this episode. Mike sits down with HubSpot's VP of Brand & Buzz Cindy Goodrich to talk about how INBOUND grew from a small conference to an event with over 10,000 attendees and speakers like Martha Stewart, Seth Godin, Arianna Huffington, Malcolm Gladwell and Amy Schumer.</p>",
            "length": "39618922",
            "sourceUrl": "http://chtbl.com/track/28555/traffic.libsyn.com/thegrowthshow/208278076-the-growth-show-how-an-event-grew-from-an-idea-to-10000-attendees.mp3?dest-id=400229",
            "snNo": "1",
            "epNo": "29"
        },
        {
            "title": "Mark Roberge, Chief Revenue Officer, HubSpot",
            "datePublished": "Sun, 31 May 2015 17:54:14 +0000",
            "description": "<p>When Mark Roberge joined HubSpot in 2007, he had never run a sales team and was not familiar with the conventional techniques that sales managers used to drive and inspire their teams. So he stuck with what he knew how to do and created a system of hiring and development that relied heavily on metrics and quantitative analysis (he was trained as an engineer at MIT). Mark grew to serve as HubSpot's SVP of Worldwide Sales and Services until 2013, during which he increased revenue over 6,000% and expanded the team from 1 to 450 employees. These results placed HubSpot #33 on the 2011 INC 500 Fastest Growing Companies list. Mark was ranked #19 in Forbes' Top 30 Social Sellers in the World. He was also awarded the 2010 Salesperson of the Year at the MIT Sales Conference. Mark is the author of the new book, The Sales Acceleration Formula: Using Data, Technology, and Inbound Selling to go from $0 to $100 Million.</p>",
            "length": "72586196",
            "sourceUrl": "http://chtbl.com/track/28555/traffic.libsyn.com/thegrowthshow/208135080-the-growth-show-building-a-winning-sales-team-with-mark-roberge.mp3?dest-id=400229",
            "snNo": "1",
            "epNo": "28"
        },
        {
            "title": "Ask Mike Anything",
            "datePublished": "Fri, 29 May 2015 15:27:29 +0000",
            "description": "<p>Mike answers your questions on this special episode of The Growth Show — including how his team maintains a startup mentality, the right way to pay marketers, and what he would do with a billion dollar budget. Thanks to everyone who submitted their questions via Inbound.org. Here’s a link to the waterfall chart that Mike mentioned (his favorite chart in Excel that shows progress vs. a goal) and instructions on how to create one for your team: http://blog.hubspot.com/blog/tabid/6307/bid/14222/The-One-Graph-Marketers-Should-Update-Daily-The-Leads-Waterfall.aspx</p>",
            "length": "63504611",
            "sourceUrl": "http://chtbl.com/track/28555/traffic.libsyn.com/thegrowthshow/207830832-the-growth-show-ask-mike-anything.mp3?dest-id=400229",
            "snNo": "1",
            "epNo": "27"
        },
        {
            "title": "Michelle Miller, The Underwriting",
            "datePublished": "Mon, 25 May 2015 23:47:14 +0000",
            "description": "<p>In 2013, Michelle Miller left her job at JP Morgan to write a story about Wall Street and Silicon Valley called The Underwriting. She knew nothing about publishing or marketing a book but knew she wanted to do something different, so she wrote the story and released it on her website, one chapter at a time over the course of 12 weeks. There were two interesting wrinkles. First, each new chapter was free for the first 24 hours. If you missed the free window, it cost $1.50 to download. Second, each chapter was accompanied by a few different transmedia elements: there free samples from brand sponsors like Harry’s and deals on sites like HotelTonight, downloadable DJ playlists, business cards for each character, and finance tutorials to explain some of the concepts in the book. Fast forward to today and based on the popularity of The Underwriting, Michelle signed on to published five books as part of a six-figure book deal. She joins Mike on this episode of The Growth Show to talk about her decision to disrupt the publishing industry by launching online and how she got this new idea to spread so quickly (including some interesting tactics like using Tinder and hiring a cop on Craigslist).</p>",
            "length": "69734392",
            "sourceUrl": "http://chtbl.com/track/28555/traffic.libsyn.com/thegrowthshow/207208977-the-growth-show-the-underwriting.mp3?dest-id=400229",
            "snNo": "1",
            "epNo": "26"
        },
        {
            "title": "Ministry of Supply CEO Gihan Amarasiriwardena",
            "datePublished": "Wed, 20 May 2015 15:16:51 +0000",
            "description": "<p>Imagine wearing a dress shirt that didn’t make you sweat on your commute to work? Launched out of MIT, Ministry of Supply has set out to do just that: create clothes for work that behave like clothes you’d wear to the gym. After the company was started out of MIT, Ministry of Supply set out to raise just $30,000 on Kickstarter. Within five days of launching their campaign, the team not only met their goal, but went on to raise over $400,000 and shattered the record for a fashion campaign on Kickstarter. Ministry of Supply’s CEO, Gihan Amarasiriwardena -- who was recently named to Forbes 30 under 30 list -- joins HubSpot’s Mike Volpe and Katie Burke on this episode of The Growth Show to go behind the scenes on Ministry of Supply's success on Kickstarter and how they are creating a new category of fashion for the office.</p>",
            "length": "44792956",
            "sourceUrl": "http://chtbl.com/track/28555/traffic.libsyn.com/thegrowthshow/206380555-the-growth-show-how-ministry-of-supply-shattered-the-kickstarter-fashion-record.mp3?dest-id=400229",
            "snNo": "1",
            "epNo": "25"
        },
        {
            "title": "Boston Red Sox SVP of Brand and Marketing, Adam Grossman",
            "datePublished": "Sun, 17 May 2015 15:19:10 +0000",
            "description": "<p>The concept of growth is a little different when you run marketing for a professional sports team. For Adam Grossman, SVP of marketing and brand development for the Boston Red Sox, success is often dictated by two things he can’t control: wins and losses. But he still has to fill seats, sell merchandise, and drive revenue for the organization. That presents a unique challenge for his marketing team: How do you measure success, exactly? How do you know if you’re doing a good job? Adam joins Mike on this episode of The Growth Show to talk about his experience running marketing for the Red Sox - and, previously, his experience as SVP of public affairs for the Miami Dolphins.</p>",
            "length": "64583114",
            "sourceUrl": "http://chtbl.com/track/28555/traffic.libsyn.com/thegrowthshow/205895123-the-growth-show-how-do-you-grow-a-professional-sports-franchise.mp3?dest-id=400229",
            "snNo": "1",
            "epNo": "24"
        },
        {
            "title": "Brandee Barker, Facebook’s First PR Executive",
            "datePublished": "Mon, 11 May 2015 20:40:39 +0000",
            "description": "<p>Brandee Barker was hired in 2006 as Facebook’s first head of communications. While at Facebook, she led the PR strategy around their investments, acquisitions, strategic partnerships and product announcements, including News Feed, Pages, “Share,” “Like,” and Facebook Ads. As an expert in communications strategy, she’s become the go-to PR person in Silicon Valley and has advised some of the fastest-growing companies of this decade including Airbnb, Dropbox, Groupon, Spotify, and Uber. In 2012, she helped launched Sheryl Sandberg’s book \"Lean In: Women, Work and the Will to Lead\" and the accompanying non-profit, LeanIn.org. Today, she runs her own agency called The Pramana Collective that she launched with the former PR heads Twitter and Skype.</p>",
            "length": "98383290",
            "sourceUrl": "http://chtbl.com/track/28555/traffic.libsyn.com/thegrowthshow/205011443-the-growth-show-brandee-barker-facebooks-first-pr-executive.mp3?dest-id=400229",
            "snNo": "1",
            "epNo": "23"
        },
        {
            "title": "Product Strategy with Intercom Co-Founder Des Traynor",
            "datePublished": "Thu, 07 May 2015 20:50:04 +0000",
            "description": "<p>Des Traynor is one of the best in the business when it comes to product strategy and managing growth. He joins HubSpot’s Meghan Keaney Anderson on this bonus episode of The Growth Show to talk about why product strategy means saying no, the best ways to get customer feedback, and why you should think about a cupcake instead of baking a wedding cake.</p>",
            "length": "50118408",
            "sourceUrl": "http://chtbl.com/track/28555/traffic.libsyn.com/thegrowthshow/204412873-the-growth-show-product-strategy-with-des-traynor.mp3?dest-id=400229",
            "snNo": "1",
            "epNo": "22"
        },
        {
            "title": "Seth Godin",
            "datePublished": "Mon, 04 May 2015 22:13:56 +0000",
            "description": "<p>Seth Godin is an entrepreneur, a marketer, an author and a speaker. People have called him the godfather of modern marketing and the best marketing brain on the planet. He joins HubSpot CMO Mike Volpe on this episode of The Growth Show to talk about building a business that will last, the importance of trust in hiring, and why you should think about being better vs. being bigger. Seth also shares the process behind his writing, including how he makes time to blog every day and why he doesn’t believe the excuse that you don’t have the time.</p>",
            "length": "66652951",
            "sourceUrl": "http://chtbl.com/track/28555/traffic.libsyn.com/thegrowthshow/203928270-the-growth-show-seth-godin.mp3?dest-id=400229",
            "snNo": "1",
            "epNo": "21"
        },
        {
            "title": "Warby Parker Co-Founder Neil Blumenthal",
            "datePublished": "Mon, 27 Apr 2015 20:42:51 +0000",
            "description": "<p>Neil Blumenthal and his friends (later turned co-founders) were tired of paying outrageous prices for their glasses, so they did what any crazy and ambitious entrepreneur would: they set out to disrupt the eyewear industry by cutting out the middleman. Warby Parker launched in 2010 and hit their first-year sales goals in three weeks. Fast forward five years and not only have Neil and his co-founders achieved their mission, but they’ve built a socially conscious brand that people love. Neil joins HubSpot’s Katie Burke on this episode of The Growth Show to talk about how they managed a waiting list of 20,000 people with no “sold out” functionality on their website, a pact the founders made before launch, and the importance of building a brand with a mission (they’ve donated over a million pairs of glasses to people in need as part of their buy a pair, give a pair program).</p>",
            "length": "67278032",
            "sourceUrl": "http://chtbl.com/track/28555/traffic.libsyn.com/thegrowthshow/202842124-the-growth-show-warby-parker.mp3?dest-id=400229",
            "snNo": "1",
            "epNo": "20"
        },
        {
            "title": "Meerkat Founder Ben Rubin",
            "datePublished": "Fri, 24 Apr 2015 14:59:57 +0000",
            "description": "<p>Two months ago, Meerkat didn’t even exist. Today, the live-streaming app has over 700,000 active users, including celebrities like Jimmy Fallon and Madonna. Meerkat founder Ben Rubin sits down with HubSpot CMO Mike Volpe to talk about how they grew so big so fast, how they’ve kept growing despite being cut off from Twitter’s graph, the decision to pivot the entire company in just five days, and why we should care about live-streaming.</p>",
            "length": "73761858",
            "sourceUrl": "http://chtbl.com/track/28555/traffic.libsyn.com/thegrowthshow/202347970-the-growth-show-meerkat-founder-ben-rubin.mp3?dest-id=400229",
            "snNo": "1",
            "epNo": "19"
        },
        {
            "title": "SoulCycle VP of PR & Brand Strategy Gabby Cohen",
            "datePublished": "Wed, 22 Apr 2015 13:12:25 +0000",
            "description": "<p>SoulCycle has evolved into one of the fastest-growing fitness sensations of all-time — the result of a cult-like following that they’ve built that’s been taking over America since 2006. What began as a single cycling studio in New York City then has now grown to 39 studios and in 2011, the company was acquired by Equinox. Gabby Cohen, SoulCycle’s VP of PR & Brand Strategy joins us on this episode of The Growth Show to share the story behind SoulCycle, including how they’ve been able to build such a loyal base of brand advocates that do everything from wear SoulCycle gear to chew SoulCycle gum.</p>",
            "length": "41740022",
            "sourceUrl": "http://chtbl.com/track/28555/traffic.libsyn.com/thegrowthshow/202019653-the-growth-show-soulcycle.mp3?dest-id=400229",
            "snNo": "1",
            "epNo": "18"
        },
        {
            "title": "Product Hunt's Ryan Hoover and Erik Torenberg",
            "datePublished": "Fri, 17 Apr 2015 15:11:32 +0000",
            "description": "<p>Product Hunt started as an email newsletter in 2013 about founder Ryan Hoover’s favorite new products. Today, Product Hunt has become the place to discover what’s next in tech -- everything from new products to apps, podcasts and even books. Dave Gerhardt, the producer of The Growth Show, sat down with Product Hunt’s Ryan Hoover and Erik Torenberg to learn about what’s behind their crazy growth, how they’ve built a community of thousands of raving fans, and created a new habit for everyone interested in tech and startups.</p>",
            "length": "66147612",
            "sourceUrl": "http://chtbl.com/track/28555/traffic.libsyn.com/thegrowthshow/201256505-the-growth-show-how-product-hunt-became-silicon-valleys-favorite-website.mp3?dest-id=400229",
            "snNo": "1",
            "epNo": "17"
        },
        {
            "title": "Blue Apron Founder & CEO Matt Salzberg",
            "datePublished": "Mon, 13 Apr 2015 20:45:31 +0000",
            "description": "<p>Blue Apron is one of the fastest-growing food delivery businesses. Each week, they send customers a box that includes recipes and the ingredients needed to create high-quality, fresh meals. And these aren’t just your average recipes - Blue Apron meals range from things like Almond-Crusted Cod to Piri-Piri Chicken. Since launching just two years ago, Blue Apron now ships over one million meals every month. Blue Apron Founder and CEO Matt Salzberg sits down with HubSpot CMO Mike Volpe to talk about what’s behind Blue Apron’s growth and how they’re disrupting the traditional grocery chain model.</p>",
            "length": "65373588",
            "sourceUrl": "http://chtbl.com/track/28555/traffic.libsyn.com/thegrowthshow/200661021-the-growth-show-blue-aprons-recipe-for-growth-with-founder-ceo-matt-salzberg.mp3?dest-id=400229",
            "snNo": "1",
            "epNo": "16"
        },
        {
            "title": "Apple Watch Special: Silicon Valley Veteran Philippe Kahn",
            "datePublished": "Thu, 09 Apr 2015 16:03:04 +0000",
            "description": "<p>You may not have heard of Philippe Kahn, but you’re definitely familiar with his work: he’s credited with creating the first camera phone and sharing the first mobile photo. Today, his company Fullpower Technologies is behind many of today’s top wearable devices including Jawbone’s UP and Nike’s fuel band. Now he’s helping luxury Swiss watchmakers tap into the smart watch movement -- they’ve created the first watches that look like a Swiss watch but act like an Apple Watch. Pre-orders for the Apple Watch start at midnight tonight, and Kahn sat down with HubSpot’s VP of Content Joe Chernov to talk about the watch’s potential and whether this is the next big new product line for Apple.</p>",
            "length": "69171354",
            "sourceUrl": "http://chtbl.com/track/28555/traffic.libsyn.com/thegrowthshow/200016064-the-growth-show-apple-watch-special.mp3?dest-id=400229",
            "snNo": "1",
            "epNo": "15"
        },
        {
            "title": "Airbnb's Growth Philosophy & Why It's Better to Have 100 People Love You",
            "datePublished": "Tue, 07 Apr 2015 13:54:38 +0000",
            "description": "<p>Airbnb has already overtaken major hotel companies in terms of its valuation, and their growth could have them on pace to book more guests than hotels over the next few years. On this episode of The Growth Show, Airbnb’s engineering manager for growth Jason Bosinoff joins HubSpot CMO Mike Volpe to talk about what’s behind that growth, why their customers tell the story better than they do, and why they believe it’s better to have 100 people love you than 1,000 people like you.</p>",
            "length": "62364124",
            "sourceUrl": "http://chtbl.com/track/28555/traffic.libsyn.com/thegrowthshow/199665198-the-growth-show-airbnbs-growth-philosophy-why-its-better-to-have-100-people-love-you.mp3?dest-id=400229",
            "snNo": "1",
            "epNo": "14"
        },
        {
            "title": "Slack CMO Bill Macaitis",
            "datePublished": "Tue, 31 Mar 2015 13:18:15 +0000",
            "description": "<p>Bill Macaitis knows a little bit about growth. In his time as Zendesk CMO, he helped take the company from venture-funded startup through an IPO resulting in a $1.7 billion market cap. When he led online marketing and operations at Salesforce, he helped grow revenues from $900M to $3 billion. Today he serves as CMO at Slack, the hyper-growth messaging startup that is less than two years old and already worth north of $2B with over 500,000 users. Many people are calling it the fastest growing business application ever. Bill joins HubSpot CMO Mike Volpe on this episode of The Growth Show and goes behind the scenes on Slack’s explosive growth.</p>",
            "length": "60628018",
            "sourceUrl": "http://chtbl.com/track/28555/traffic.libsyn.com/thegrowthshow/198568847-the-growth-show-behind-slacks-explosive-growth.mp3?dest-id=400229",
            "snNo": "1",
            "epNo": "13"
        },
        {
            "title": "Christine Tsai, Founding Partner, 500 Startups",
            "datePublished": "Tue, 24 Mar 2015 13:52:33 +0000",
            "description": "<p>Christine Tsai is one of the founding partners of 500 Startups. Prior to 500, Christine spent eight years at Google working on AdSense, Google Analytics and YouTube. She joins HubSpot’s Katie Burke on this episode of the Growth Show to talk about what she learned during Google’s crazy growth - there were 1,000 employees when she started there and over 50,000 today.</p>",
            "length": "67380365",
            "sourceUrl": "http://chtbl.com/track/28555/traffic.libsyn.com/thegrowthshow/197442247-the-growth-show-behind-500-startups-growth-with-christine-tsai.mp3?dest-id=400229",
            "snNo": "1",
            "epNo": "12"
        },
        {
            "title": "Executive Coach & Former COO of 1-800-GOT-JUNK Cameron Herold",
            "datePublished": "Tue, 17 Mar 2015 13:41:45 +0000",
            "description": "<p>Most people would be thrilled to build one $100 Million business. Cameron Herold has built three, including 1-800-GOT-JUNK, the worlds-largest residential junk removal company, where he grew revenues from $2 Million to $106 Million in just six years. Today, Cameron is a business coach, mentor to several companies, and CEO coach to large corporations globally. He joins HubSpot CMO Mike Volpe on this episode of The Growth Show to talk about why mission statements are broken and how to fix yours, how to think about hiring as you start to scale, and how he’s landed over 5,000 media placements including coverage on Oprah and The Today Show without a PR agency.</p>",
            "length": "71573502",
            "sourceUrl": "http://chtbl.com/track/28555/traffic.libsyn.com/thegrowthshow/196310630-the-growth-show-cameron-herold-got-junk.mp3?dest-id=400229",
            "snNo": "1",
            "epNo": "11"
        },
        {
            "title": "The Podcast Resurgence with Marketing Over Coffee’s John Wall",
            "datePublished": "Thu, 12 Mar 2015 21:25:30 +0000",
            "description": "<p>John Wall, host of Marketing Over Coffee - one of the most popular and longest running marketing podcasts - joins HubSpot CMO Mike Volpe to talk about the resurgence of podcasts and if you should think about starting one for your business.</p>",
            "length": "55167297",
            "sourceUrl": "http://chtbl.com/track/28555/traffic.libsyn.com/thegrowthshow/195574407-the-growth-show-the-podcast-resurgence-with-john-wall.mp3?dest-id=400229",
            "snNo": "1",
            "epNo": "10"
        },
        {
            "title": "Why Beth Doane Left the Fashion Industry to Change It & The Story Behind Raintees",
            "datePublished": "Tue, 10 Mar 2015 17:34:45 +0000",
            "description": "<p>After years running a company in the fashion industry and witnessing environmental pollution and human rights violations, Beth Doane had finally seen enough. But instead of leaving the industry behind, she wanted to try and change it -- and that’s exactly what she did with Raintees. Built on her vision that fashion could be made ethically while making a difference, every Raintee sold plants a tree in an endangered forest and helps to donate school supplies to children in need. To date, Raintees has helped sent children to school across 20 countries and planted over 40,000 trees. Beth joins HubSpot’s Meghan Keaney Anderson on this episode of The Growth Show to share the story behind Raintees and why she believes that businesses built to give back are setting the new standard for our future. We want to learn a little more about our listeners, so we created this quick survey: http://bit.ly/growthshowsurvey -- the feedback will help give us a better sense of who our listeners are and guide upcoming episodes. Thanks!</p>",
            "length": "53653711",
            "sourceUrl": "http://chtbl.com/track/28555/traffic.libsyn.com/thegrowthshow/195203379-the-growth-show-beth-doane-raintees.mp3?dest-id=400229",
            "snNo": "1",
            "epNo": "9"
        },
        {
            "title": "Inside the Mind of a Great Leader: What Boston's Chief of Staff Learned from Arianna Huffington",
            "datePublished": "Mon, 02 Mar 2015 21:45:02 +0000",
            "description": "<p>17 years ago, Dan Koh kicked off his career in public service by working in sting operations designed to crack down on cigarette sales to minors. He was 12 years old. Today - at just 29 - Dan is Chief of Staff to the City of Boston where he advises the Mayor and helps him execute on his vision for the city. He previously served as Chief of Staff to Arianna Huffington, helping to keep the 700-person organization running smoothly on a daily basis. Dan holds two degrees from Harvard and was named to Forbes’ 30 under 30 list in 2014. He joins HubSpot CEO Brian Halligan on this week’s episode of The Growth Show to talk about how he sets up his day for efficiency, the best thing he’s learned about crisis management, and the commonalities of effective leaders. Learn more at www.hubspot.com/podcast.</p>",
            "length": "25941471",
            "sourceUrl": "http://chtbl.com/track/28555/traffic.libsyn.com/thegrowthshow/193902551-the-growth-show-dan-koh.mp3?dest-id=400229",
            "snNo": "1",
            "epNo": "8"
        },
        {
            "title": "A VC's Advice on Content, Cash & Churn with Tomasz Tunguz",
            "datePublished": "Tue, 24 Feb 2015 00:57:47 +0000",
            "description": "<p>Tomasz Tunguz is a partner at Redpoint Ventures and former Product Manager at Google. Tomasz is best known for his data-driven blog posts about the key questions facing startups including how to fundraise, startup benchmarks, management best practices and team building. Almost all of his writing and thought leadership is centered around one main theme: “What can you do to grow faster?” He joins HubSpot CMO Mike Volpe to chat about the two things that can help almost any business grow faster, the compounding effects of content marketing and more. You can learn more at http://www.hubspot.com/podcast and check out Tom’s blog http://tomtunguz.com/</p>",
            "length": "24368691",
            "sourceUrl": "http://chtbl.com/track/28555/traffic.libsyn.com/thegrowthshow/192699249-the-growth-show-tomasz-tunguz-redpoint-ventures.mp3?dest-id=400229",
            "snNo": "1",
            "epNo": "7"
        },
        {
            "title": "5,000 Tattoos, and $75M in Revenue: Inside Tough Mudder's Rapid Growth",
            "datePublished": "Tue, 17 Feb 2015 02:02:18 +0000",
            "description": "<p>Will Dean is the founder and CEO of Tough Mudder. Dean came up with the idea for Tough Mudder while at Harvard Business School and at the time, everyone thought he was crazy. With only $8,000 to spend on marketing, Dean hoped to get 500 people at their first event. Instead, 5,000 people showed up and there was no looking back from there. Today, Tough Mudder holds 70 events worldwide, has grown to over $75M in revenue, raised millions for the Wounded Warrior Project and had over 5,000 people tattoo the company’s logo on their body(!) Dean has helped build a brand that people truly love, and he joins HubSpot CMO Mike Volpe on this episode of the Growth Show to share the story behind the company’s growth. Dean talks about how much time he spends thinking about the competition, why great culture isn’t determined by free beer, and his advice for hiring. You can learn more at hubspot.com/podcast -- and if you are enjoying the show, we'd love it if you left a review on iTunes.</p>",
            "length": "25535215",
            "sourceUrl": "http://chtbl.com/track/28555/traffic.libsyn.com/thegrowthshow/191519134-the-growth-show-will-dean-ceo-founder-tough-mudder.mp3?dest-id=400229",
            "snNo": "1",
            "epNo": "6"
        },
        {
            "title": "Guy Kawasaki on Unconventional Social Media Strategies",
            "datePublished": "Tue, 10 Feb 2015 01:08:30 +0000",
            "description": "<p>Guy Kawasaki, former Chief Evangelist at Apple and now Chief Evangelist at Canva joins us to talk about his latest book, The Art of Social Media: Power Tips for Power Users, and a few of his unconventional social media strategies that have helped him drive traffic and build an audience of millions of followers. Learn more at hubspot.com/podcast.</p>",
            "length": "110537008",
            "sourceUrl": "http://chtbl.com/track/28555/traffic.libsyn.com/thegrowthshow/190345074-the-growth-show-guy-kawasaki.mp3?dest-id=400229",
            "snNo": "1",
            "epNo": "5"
        },
        {
            "title": "How Shopify Grew 10X in 3 Years",
            "datePublished": "Thu, 29 Jan 2015 21:55:43 +0000",
            "description": "<p>On this episode of The Growth Show, HubSpot’s Mike Volpe and Meghan Keaney-Anderson sit down with Craig Miller, Chief Marketing Officer at Shopify, to talk about the techniques that his team has used to help fuel Shopify's 10x growth since joining the company just three years ago. Miller also talks about why he thinks engineers make great marketers, his decision to re-brand the marketing team to the growth team, and why there are huge opportunities in things that are often boring like your Terms of Service. Learn more at hubspot.com/podcast.</p>",
            "length": "1",
            "sourceUrl": "http://chtbl.com/track/28555/traffic.libsyn.com/thegrowthshow/188536345-the-growth-show-craig-miller.mp3?dest-id=400229",
            "snNo": "1",
            "epNo": "4"
        },
        {
            "title": "David Skok, Matrix Partners (Pt. 2)",
            "datePublished": "Thu, 29 Jan 2015 21:52:41 +0000",
            "description": "<p>Part 2 of Mike Volpe's interview with David Skok, General Partner, Matrix Partners and four-time entrepreneur.</p>",
            "length": "1",
            "sourceUrl": "http://chtbl.com/track/28555/traffic.libsyn.com/thegrowthshow/188535930-the-growth-show-david-skok-pt2.mp3?dest-id=400229",
            "snNo": "1",
            "epNo": "3"
        },
        {
            "title": "David Skok, Matrix Partners (Pt. 1)",
            "datePublished": "Thu, 29 Jan 2015 21:51:05 +0000",
            "description": "<p>On this episode of The Growth Show, HubSpot CMO Mike Volpe sits down with David Skok from Matrix Partners. Skok started his first company in 1977 at age 22, and since then has started four separate companies, three of which went public. Through his experience as a founder and now an investor, Skok has become one of the leading thinkers on growth and building a business -- and specifically in the areas of sales and marketing. Skok pens the blog ForEntrepreneurs, which was listed as number two in Forbes list of the 100 best websites for entrepreneurs, and shares many of those insights and learnings on this podcast. Learn more at hubspot.com/podcast.</p>",
            "length": "77649770",
            "sourceUrl": "http://chtbl.com/track/28555/traffic.libsyn.com/thegrowthshow/188535687-the-growth-show-david-skok-pt1.mp3?dest-id=400229",
            "snNo": "1",
            "epNo": "2"
        },
        {
            "title": "The Naked Brand and the Importance of Truth in Advertising & Marketing",
            "datePublished": "Thu, 29 Jan 2015 15:09:26 +0000",
            "description": "<p>On this episode of The Growth Show, HubSpot CEO Brian Halligan & VP of Marketing Cindy Goodrich chat with Jeff Rosenblum, the writer, director, and executive producer of The Naked Brand, a documentary that looks at how companies can change the world by doing something revolutionary -- telling the truth in their marketing and advertising. Rosenblum goes behind the scenes and talks about everything from the making of the documentary to the modern CEO and what we can learn from brands like Patagonia and Under Armour. Learn more at hubspot.com/podcast.</p>",
            "length": "108722000",
            "sourceUrl": "http://chtbl.com/track/28555/traffic.libsyn.com/thegrowthshow/188474533-the-growth-show-jeff-rosenblum.mp3?dest-id=400229",
            "snNo": "1",
            "epNo": "1"
        }
    ]
}