{
    "artwork": "http://is4.mzstatic.com/image/thumb/Music71/v4/a0/05/4c/a0054ce4-3538-3f5e-d368-85c56602c376/source/100x100bb.jpg",
    "description": "Whether you are training for your first 5k or have been running for decades, The Conscious Runner Podcast brings you the information you need to take your running from ordinary to EXTRAORDINARY and feel FANTASTIC while doing it. Blog: www.ConsciousRunner.com.",
    "feedURL": "http://feeds.feedburner.com/consciousrunnerpodcast",
    "podcastURL": "http://consciousrunner.com",
    "title": "The Conscious Runner Podcast",
    "episodes": [
        {
            "title": "TCR121 | The Difference Between Source Versus Symptoms",
            "datePublished": "Tue, 28 Apr 2020 10:00:51 +0000",
            "description": "Episode Summary Hi Conscious Runners! Today we’ve got another amazing episode. It is about the difference between source versus symptoms. You see, there is so much information out there and it is keeping A LOT of runners stuck, in pain and repeating the cycle of injury. Much of it is outdated and no one has […]",
            "length": "23095587",
            "sourceUrl": "http://traffic.libsyn.com/consciousrunner/TCR121_SourceVersusSymptoms_04202020.mp3",
            "epNo": "121",
            "categories": [
                "Coach's Corner"
            ]
        },
        {
            "title": "TCR 120 | What to Do About Those Hurting Feet",
            "datePublished": "Tue, 21 Apr 2020 10:00:26 +0000",
            "description": "Episode Summary Hi Conscious Runners! Today’s episode is all about feet! I can’t count the number of runners who have come to us with plantar fasciitis and other foot pain. Many of them have been in pain for months or years. They’ve gone to doctors, chiropractors, massage therapists, acupuncturists, podiatrists and have tried, rest, new […]",
            "length": "26863071",
            "sourceUrl": "http://traffic.libsyn.com/consciousrunner/TCR120_FeetHurt_04202020.mp3",
            "epNo": "120",
            "categories": [
                "Coach's Corner"
            ]
        },
        {
            "title": "TCR 119 | Running During the Pandemic",
            "datePublished": "Fri, 17 Apr 2020 12:24:24 +0000",
            "description": "Episode Summary Hi Conscious Runners! As always, today we’ve got another amazing episode for you. Its all about running during the pandemic! One of the things we’ve found is a lot of people have fallen off the motivation to run during this time. It’s just gotten harder and harder and harder to lace up those […]",
            "length": "9437184",
            "sourceUrl": "http://traffic.libsyn.com/consciousrunner/TCR119_RunningDuringThePandemic_04112020.mp3",
            "epNo": "119",
            "categories": [
                "Coach's Corner"
            ]
        },
        {
            "title": "TCR 118 | How to Create Your Future Self Even If You Don’t Know Where to Start",
            "datePublished": "Sat, 21 Mar 2020 17:11:45 +0000",
            "description": "TCR 118 | How to Create Your Future Self Even If You Don't Know Where to Start",
            "length": "35515848",
            "sourceUrl": "http://traffic.libsyn.com/consciousrunner/TCR118_howToCreateYourFutureSelf.mp3",
            "categories": [
                "Coach's Corner"
            ]
        },
        {
            "title": "TCR 117 | Why You Aren’t Motivated and What to Do About it Today",
            "datePublished": "Wed, 04 Mar 2020 16:22:48 +0000",
            "description": "Episode Summary If you struggle with getting out the door to get your run in or doing the ancillary work you need to do that keeps you running, this episode is for you! In this episode we dive deep into the biggest things keeping you from being motivated and reaching your goals and what to […]",
            "length": "16885550",
            "sourceUrl": "http://traffic.libsyn.com/consciousrunner/tcr117_whyYouArentMotivatedAndWhatToDo.mp3",
            "categories": [
                "Coach's Corner"
            ]
        },
        {
            "title": "TCR115 | 3 Reasons Strength Training is NOT Helping You Run Pain Free and What to Do Instead",
            "datePublished": "Tue, 21 Jan 2020 13:00:50 +0000",
            "description": "Episode Summary We thought this was a good one because we see too many people who have been strength training (among a whole lot of other things )and are still in pain…some for months and some for years. Even just yesterday we saw a post in the group about the pitfalls of strength training. So […]",
            "length": "31448374",
            "sourceUrl": "http://traffic.libsyn.com/consciousrunner/TCR115_3ReasonsStrengthTrainingIsNotHelpingYou.mp3",
            "categories": [
                "Coach's Corner"
            ]
        },
        {
            "title": "TCR114 | Julio Serrant: From Debilitating Plantar Fasciitis to Running Multiple Half and Full Marathons",
            "datePublished": "Mon, 02 Apr 2018 09:51:37 +0000",
            "description": "",
            "length": "20430720",
            "sourceUrl": "http://traffic.libsyn.com/consciousrunner/tcr_114_JulioiSerrantNOV2017.mp3",
            "categories": [
                "guest_Interviews"
            ]
        },
        {
            "title": "TCR113 | Jens Jakob Andersen: The Best Pair of Running Shoes Are the Ones That Are Most Comfortable to You",
            "datePublished": "Mon, 13 Nov 2017 23:16:18 +0000",
            "description": "Hey Conscious Runners! So excited to bring another episode of The Conscious Runner podcast to you. Today, I've got Jens Jakob Anderson on the line with me. Jens is the founder of RunRepeat.com. RunRepeat.com helps you find your next pair of running shoes in an unbiased and transparent way.",
            "length": "35818568",
            "sourceUrl": "http://traffic.libsyn.com/consciousrunner/TCR113_JensJakobAndersenRunRepeat.mp3",
            "categories": [
                "guest_Interviews"
            ]
        },
        {
            "title": "TCR112 | Joel C. Cohen: How to Lose a Marathon: A Starter’s Guide to Finishing in 26.2 Chapters",
            "datePublished": "Thu, 02 Nov 2017 10:38:23 +0000",
            "description": "Hey Conscious Runners! I've got an inspiring, entertaining and all around funny episode for you, that also happens to be packed with nuggets of training gold that will take you from the couch to completing your first marathon laughing all the way.",
            "length": "30049975",
            "sourceUrl": "http://traffic.libsyn.com/consciousrunner/TCR112_JoelCCohen2017.mp3",
            "categories": [
                "guest_Interviews",
                "Podcast Episodes"
            ]
        },
        {
            "title": "TCR111 | Dr. David Geier: That Doesn’t Have to Hurt & The Injuries That Changed Sports Forever",
            "datePublished": "Tue, 31 Oct 2017 13:46:19 +0000",
            "description": "Of course I've got another fantastic episode for you. Today, I chat it up with Dr. David Geir, an orthopedic and sports medicine specialist who practices in Mount Pleasant, South Carolina. Despite being an orthopedic surgeon, Dr. Geir first tries to treat injuries without surgery.",
            "length": "51299723",
            "sourceUrl": "http://traffic.libsyn.com/consciousrunner/TCR111_DrDavidGeier2017.mp3",
            "categories": [
                "guest_Interviews",
                "Podcast Episodes"
            ]
        },
        {
            "title": "TCR110 | Nick Symmonds: From 800 Meters to the Marathon & Energizing Runners With Run Gum",
            "datePublished": "Tue, 19 Sep 2017 13:47:31 +0000",
            "description": "Hey Conscious Runners! I’ve got another fantastic interview for you today. For the second time, I’ve got 2x Olympian, businessman, public speaker, entrepreneur and creator of Run Gum (performance gum), Nick Symmonds on the line with me. Nick got started running in a very interesting way. In high school, a girl he wanted to get to know better suggested he try out for the cross country team and he did.",
            "length": "31453813",
            "sourceUrl": "http://traffic.libsyn.com/consciousrunner/NickSimmonsJUL2017.mp3",
            "categories": [
                "guest_Interviews"
            ]
        },
        {
            "title": "TCR109 | Lisah & Julia: Soul Sessions Episode 6 – Running as Art and Accepting What Is",
            "datePublished": "Mon, 07 Aug 2017 14:08:44 +0000",
            "description": "Hey Conscious Runners! I’ve got another fantastic episode for you. Today, Julia Chi Taylor and I sit down for our sixth episode of Soul Sessions with Lisah and Julia. Soul sessions with Lisah and Julia is a monthly series on The Conscious Runner Podcast where Julia and I share honestly and openly about our running, ourselves and our lives. I met Julia last year when I interviewed her for The Conscious Runner Podcast.",
            "length": "49178705",
            "sourceUrl": "http://traffic.libsyn.com/consciousrunner/TCR106_LisahAndJuliaSoulSessions6.mp3",
            "categories": [
                "Conscious Running",
                "Soul Sessions"
            ]
        },
        {
            "title": "TCR108 | Winston Fisher: 7 Marathons on 7 Continents in 7 Days and Doing What Scares You",
            "datePublished": "Tue, 06 Jun 2017 19:06:23 +0000",
            "description": "Hey Conscious Runners! I've got another fantastic episode for you. Today, I've got Winston Fisher on the mic with me. I met Winston about a month ago when I interviewed him for The Conscious Runner Podcast. Over the past two years I've conducted dozens of interviews and have never come across someone like Winston.",
            "length": "31993880",
            "sourceUrl": "http://traffic.libsyn.com/consciousrunner/TCR108_WinstonFisherMAY2017.mp3",
            "categories": [
                "guest_Interviews"
            ]
        },
        {
            "title": "TCR107 | Maggie Kay: Running, Spirituality, and Diving for Pearls",
            "datePublished": "Tue, 09 May 2017 15:06:18 +0000",
            "description": "Hey Conscious Runners! Yes, its that time again. I've got another episode of the podcast for you. I've got Maggie Kay from Maggie Kay wisdom on the line with me. Maggie is an inspirational coach and founder of Thrivecraft--a life coaching practice that opens up the dimension of spirituality to everybody. Having graduated with a BA in Psychology in her native Glasgow, Scotland, Maggie spent her twenties in a semi-monastic community in London, training intensively to become ordained into the Western Buddhist Order.",
            "length": "48221985",
            "sourceUrl": "http://traffic.libsyn.com/consciousrunner/TCR107_MaggieKay.mp3",
            "categories": [
                "guest_Interviews"
            ]
        },
        {
            "title": "TCR106: Jessica Leggio | Why Your Running Shoes Are Causing Your Injuries & What to Do About It",
            "datePublished": "Tue, 18 Apr 2017 20:26:06 +0000",
            "description": "Hey Conscious Runners, I've got another fantastic episode for you! Today I've got Jessica Marie Rose Leggio on the line with me.  As an athletic Functional Movement expert, Jessica helps runners with form, strength and conditioning and Injury Prevention. She is also the creator of the #RunPainFree Running Program.",
            "length": "53402616",
            "sourceUrl": "http://traffic.libsyn.com/consciousrunner/TCR106_JessicaMarieRoseLeggio.mp3",
            "categories": [
                "guest_Interviews"
            ]
        },
        {
            "title": "TCR105 | Brian Madden: Believing in Yourself & Running Your First Marathon",
            "datePublished": "Thu, 23 Mar 2017 13:38:08 +0000",
            "description": "Hey Conscious Runners! I've got an amazing episode for you! I know I say that about every episode, and it's true. But honestly, this one is takes it to a another level! Today, I've got first time marathoner Brian Madden on the line with me. I met Brian a couple of years ago. He reached out to me about being interested in running a marathon. I didn't hear from him for two years.",
            "length": "47811147",
            "sourceUrl": "http://traffic.libsyn.com/consciousrunner/TCR0105_BrianMadden-BelievingInYourselfAndRunningYourFirstMarathon.mp3",
            "categories": [
                "guest_Interviews"
            ]
        },
        {
            "title": "TCR104 | Michel Dion: There is No Tough Day That Can’t Be Solved By a Good Run",
            "datePublished": "Tue, 21 Mar 2017 14:53:33 +0000",
            "description": "Michel and I had wanted to record an episode together for awhile. He thought it would be a great idea to get the perspective of a newbie runner starting later in life and I agreed! This episode is a bit of a different kind of interview. Michel asks me questions on everything from shoes to nutrition, to training plans, to barefoot running. Nothing is off limits.",
            "length": "56106987",
            "sourceUrl": "http://traffic.libsyn.com/consciousrunner/TCR104_MichelDion.mp3",
            "categories": [
                "guest_Interviews"
            ]
        },
        {
            "title": "TCR103: Jessica Leggio | Correcting Dysfunctional Movement and Running Pain Free",
            "datePublished": "Tue, 14 Mar 2017 16:08:40 +0000",
            "description": "Hey Conscious Runners, I've got another fantastic episode for you! Today I've got Jessica Marie Rose Leggio on the line with me.  As an athletic Functional Movement expert, Jessica helps runners with form, strength and conditioning and Injury Prevention. She is also the creator of the #RunPainFree Running Program. The #RunPainFree Running Program corrects dysfunctional movement patterns, to eliminate pain and get you running pain free.",
            "length": "57793676",
            "sourceUrl": "http://traffic.libsyn.com/consciousrunner/TCR103_JessicaLeggioRunPainFree.mp3",
            "categories": [
                "guest_Interviews"
            ]
        },
        {
            "title": "TCR102 | Lisah & Julia: Soul Sessions Episode 5 – Sound of Silence, Barefoot Running, Restoring Health Through Movement & Living Free",
            "datePublished": "Fri, 03 Mar 2017 16:31:41 +0000",
            "description": "Hey Conscious Runners! I’ve got another fantastic episode for you. Today, Julia Chi Taylor and I sit down for our fifth episode of Soul Sessions with Lisah and Julia. Soul sessions with Lisah and Julia is a monthly series on The Conscious Runner Podcast where Julia and I share honestly and openly about our running, ourselves and our lives. I met Julia last year when I interviewed her for The Conscious Runner Podcast.",
            "length": "43840071",
            "sourceUrl": "http://traffic.libsyn.com/consciousrunner/TCR102_LisahAndJuliaSoulSessions5.mp3",
            "categories": [
                "Soul Sessions"
            ]
        },
        {
            "title": "TCR101 | Coach’s Corner: 4 Reasons Over 75% of Runners are Injured Each Year and How NOT to Be One of Them – Part 2",
            "datePublished": "Thu, 23 Feb 2017 14:29:46 +0000",
            "description": "Welcome to another episode of the Coach's Corner. Today, is part two of Strength & Injury Prevention for Runners. In this episode I talk about how our shoes influence our running gait and how our running gait influences our running form and our running form influences our injury profile.",
            "length": "21235624",
            "sourceUrl": "http://traffic.libsyn.com/consciousrunner/TCR101_CCInjuryPreventionPart2.mp3",
            "categories": [
                "Coach's Corner"
            ]
        },
        {
            "title": "TCR100 | Kari Gormley: Being Yourself & The Running Lifestyle",
            "datePublished": "Thu, 16 Feb 2017 09:55:13 +0000",
            "description": "Hey Conscious Runners! Yes, its that time again! I've got another fantastic episode of The Conscious Runner podcast for you! Today Kari Gormley from the Running Lifestyle and I sit down and chat it out about things running and life. Kari and I have been trying to connect for the few months. First I had tech issues, then the holidays came, then she had tech issues. It was one challenge after another. But all the while I knew we were destined to meet.",
            "length": "30897599",
            "sourceUrl": "http://traffic.libsyn.com/consciousrunner/TCR100_KariGormleyTheRunningLifestyle.mp3",
            "categories": [
                "guest_Interviews"
            ]
        },
        {
            "title": "TCR099 | Coach’s Corner: 4 Reasons Over 75% of Runners Are Injured Each Year and How NOT to Be One of Them – Part 1",
            "datePublished": "Tue, 07 Feb 2017 15:41:29 +0000",
            "description": "Welcome to another episode of the Coach’s Corner. Today, is part one of Why You Keep Getting Injured and How You Can Stop. In this episode I go deep about how your running form influences your injury profile and running specific strength and mobility work can change your running form and therefore your injury profile. […]",
            "length": "11001807",
            "sourceUrl": "http://traffic.libsyn.com/consciousrunner/TCR099_CCInjuryPreventionPart1.mp3",
            "categories": [
                "Coach's Corner"
            ]
        },
        {
            "title": "TCR098 | Lisah & Julia: Soul Sessions Episode 4 – Letting Go, Learning and Connecting With the God Within",
            "datePublished": "Tue, 31 Jan 2017 13:32:21 +0000",
            "description": "Hey Conscious Runners! I’ve got another fantastic episode for you. Today, Julia Chi Taylor and I sit down for our fourth episode of Soul Sessions with Lisah and Julia. Soul sessions with Lisah and Julia is a monthly series on The Conscious Runner Podcast where Julia and I share honestly and openly about our running, ourselves and our lives. I met Julia earlier this year when I interviewed her for The Conscious Runner Podcast.",
            "length": "46181551",
            "sourceUrl": "http://traffic.libsyn.com/consciousrunner/TCR098_LisahAndJuliaSoulSessionsEpisode4.mp3",
            "categories": [
                "Soul Sessions"
            ]
        },
        {
            "title": "TCR097 | Martinus Evans: It May Be Hard, But it Can Be Done",
            "datePublished": "Thu, 19 Jan 2017 13:31:27 +0000",
            "description": "Hey Conscious Runners! Yes, I've got another amazing interview for you today! It is with runner, speaker and coach Martinus Evans. In July 2012, Martinus  weighed approximately 360 lbs (He didn't know his exact weight because all the scales he stepped on stopped working at 350 lbs.). This episode is about Martinus's journey to becoming a marathoner.",
            "length": "33081432",
            "sourceUrl": "http://traffic.libsyn.com/consciousrunner/TCR097_MartinusEvans_JAN2017.mp3",
            "categories": [
                "guest_Interviews"
            ]
        },
        {
            "title": "TCR096 | Dr. Justin Ross: Change Your Thoughts & Change Your Run",
            "datePublished": "Tue, 10 Jan 2017 22:18:57 +0000",
            "description": "Hey Conscious Runners! Guess what! Yes, I've got another amazing interview for you! I've got runner and sports psychologist Dr. Justin Ross on the line with me. I was so excited about meeting and chatting with him. A lot of running focuses on what we do with our body, but equally, if not more important is the training that needs o happen with our mind.",
            "length": "30435338",
            "sourceUrl": "http://traffic.libsyn.com/consciousrunner/TCR096_DrJustinRoss_JAN2017.mp3",
            "categories": [
                "guest_Interviews"
            ]
        },
        {
            "title": "TCR095 | Lisah & Julia: Soul Sessions Episode 3 – Running Towards Pain & Being Settled Within",
            "datePublished": "Thu, 22 Dec 2016 13:54:26 +0000",
            "description": "Hey Conscious Runners! Welcome to another episode of Soul Sessions with Lisah and Julia.  Soul sessions with Lisah and Julia is a monthly series on The Conscious Runner Podcast where Julia and I share honestly and openly about our running, ourselves and our lives. From a very early age, Julia and I have been on parallel journeys –from representing our respective countries at world class international running events, to questioning why we run, to our pursuit of inner freedom and adventure and the names of our sites– The Conscious Runner and Running Conscious.",
            "length": "43638767",
            "sourceUrl": "http://traffic.libsyn.com/consciousrunner/TCR095_LisahAndJuliaSoulSessions.mp3",
            "categories": [
                "Soul Sessions"
            ]
        },
        {
            "title": "TCR094 | Jeff Sanders: The 5am Miracle & Dominating Your Day Before Breakfast",
            "datePublished": "Thu, 15 Dec 2016 22:06:07 +0000",
            "description": "Jeff Sanders is a keynote speaker, author of the best-selling and award-winning book on productivity, The 5 AM Miracle: Dominate Your Day Before Breakfast, and founder of the The Rockin’ Productivity Academy. Jeff is also the host of The 5 AM Miracle Podcast, which has ranked #1 in iTunes in the Self-Help and Business categories, been nominated for 4 Podcast Awards, and exceeded 3.5 million downloads.",
            "length": "37508872",
            "sourceUrl": "http://traffic.libsyn.com/consciousrunner/TCR094_JeffSanders_DEC2016.mp3",
            "categories": [
                "guest_Interviews"
            ]
        },
        {
            "title": "TCR093 | Sarah Bowen Shea: Finding Your Inner Athlete and Another Mother Runner",
            "datePublished": "Tue, 06 Dec 2016 11:40:11 +0000",
            "description": "Hey Conscious Runners, I've got another fantastic interview for you. It is with author, runner and mother Sarah Bowen Shea of Another Mother Runner and Train Like a Mother. I'm so excited to be delivering this interview to you. Sarah is an avid runner and former competitive rower. At 5,11, 165 pounds, Sarah doesn't consider herself a natural athlete.",
            "length": "51195804",
            "sourceUrl": "http://traffic.libsyn.com/consciousrunner/TCR093_SarahBowenSheaDEC2016.mp3",
            "categories": [
                "guest_Interviews"
            ]
        },
        {
            "title": "TCR092 | Runner, Mother, and  2 X Olympian Kara Goucher on Running and Life",
            "datePublished": "Wed, 09 Nov 2016 18:30:29 +0000",
            "description": "Hey Conscious Runners, I've got another fantastic interview for you! It is with mother, runner and Olympian Kara Goucher. This interview is especially exciting for me, as I've been a fan of Kara for over a decade, and have watched her evolution as a runner and a person. Kara started running at a very early age and was good from the start. But it wasn't always a smooth ride.",
            "length": "51083310",
            "sourceUrl": "http://traffic.libsyn.com/consciousrunner/TCR092_KaraGoucher.mp3",
            "categories": [
                "guest_Interviews",
                "Training Strategies"
            ]
        },
        {
            "title": "TCR091 | Lisah & Julia: Soul Sessions Episode 2 – Living Your Truth & Running Free",
            "datePublished": "Tue, 25 Oct 2016 13:22:45 +0000",
            "description": "Hey Conscious Runners! I've got another fantastic episode for you. Today, Julia Chi Taylor and I sit down for our second episode of Soul Sessions with Lisah and Julia. Soul sessions with Lisah and Julia is a monthly series on The Conscious Runner Podcast where Julia and I share honestly and openly about our running, ourselves and our lives. I met Julia this year when I interviewed her for The Conscious Runner Podcast. Immediately, I knew we would remain connected.",
            "length": "39009763",
            "sourceUrl": "http://traffic.libsyn.com/consciousrunner/TCR091_LisahAndJuliaSoulSessions.mp3",
            "categories": [
                "Conscious Running",
                "Soul Sessions"
            ]
        },
        {
            "title": "TCR090 | Danny Dreyer: Backdoor Enlightenment & Running & Living From Your Center",
            "datePublished": "Tue, 18 Oct 2016 14:02:31 +0000",
            "description": "Hey Conscious Runners! Welcome to another amazing interview! Yes! Can you believe it? I've got runner and co-founder of Chi Running, Danny Dreyer on the line with me again! I first interviewed Danny in August of this year. If you haven't had a chance to listen to that episode, I suggest you do; especially if you want to run with more grace and ease.",
            "length": "45831278",
            "sourceUrl": "http://traffic.libsyn.com/consciousrunner/TCR090_DannyDreyer_ChiRunning.mp3",
            "categories": [
                "Conscious Running",
                "guest_Interviews"
            ]
        },
        {
            "title": "TCR089 | Nick Symmonds: 2x Olympian, Advocate and Activist for Runner’s Rights and Founder of Run Gum",
            "datePublished": "Thu, 13 Oct 2016 21:49:11 +0000",
            "description": "Hey Conscious Runners! I've got another fantastic interview for you today. I've got 2x Olympian, advocate and activist for runners and creator of Run Gum (performance gum), Nick Symmonds on the line with me. Nick got started running in a very interesting way. In high school, a girl he wanted to get to know better suggested he try out for the cross country team and he did.",
            "length": "31789541",
            "sourceUrl": "http://traffic.libsyn.com/consciousrunner/TCR089_NickSymmonds.mp3",
            "categories": [
                "guest_Interviews",
                "Training Strategies"
            ]
        },
        {
            "title": "TCR088 | Jeff McCloud: Running After a 25 Year Break & Running as Family Affair",
            "datePublished": "Thu, 06 Oct 2016 22:14:52 +0000",
            "description": "Jeff has been a long-standing member of The Conscious Runner Academy and has taken on the role of The Conscious Runner Academy Community manager. As a Conscious Runner Academy Community manager, Jeff helps to ensure our community remains dedicated to the vision of The Conscious Runner (see the core values on the Home Page). How Jeff got started running is a pretty interesting story.",
            "length": "24318315",
            "sourceUrl": "http://traffic.libsyn.com/consciousrunner/TCR088_JeffMcCloud_OCT2016.mp3",
            "categories": [
                "guest_Interviews",
                "Training Strategies"
            ]
        },
        {
            "title": "TCR087 | Matthew Newnham: Conscious Running, Letting Go & Trusting the Process",
            "datePublished": "Thu, 29 Sep 2016 11:12:02 +0000",
            "description": "Hey Conscious Runners! Today, I've got another fantastic interview for you. I've got runner and co-creator of The Vitality Test and The Five Institute, Mathew Newnham. This is Matthews second time on The Conscious Runner Podcast. Matthew has been running for over 40 years.",
            "length": "32560253",
            "sourceUrl": "http://traffic.libsyn.com/consciousrunner/TCR087_MatthewNewnham.mp3",
            "categories": [
                "guest_Interviews",
                "Training Strategies"
            ]
        },
        {
            "title": "TCR086 | Lisah & Julia: Soul Sessions Episode 1",
            "datePublished": "Sat, 24 Sep 2016 13:33:22 +0000",
            "description": "Hey Conscious Runners! As always, I've got another fantastic interview for you. Today, former elite runner, mentor, healer and founder of  Running Conscious, Julia Chi Taylor and I sit down for a chat about me. Yes, that's right. The tables have been turned and I'm being interviewed. My name is Lisah. I am a masters runner, mother, author, certified running coach and the heart and soul behind The Conscious Runner. Using a mind, body and soul approach to running, I help you become a stronger, faster, more injury-resistant runner and feel GREAT while doing it!",
            "length": "33302064",
            "sourceUrl": "http://traffic.libsyn.com/consciousrunner/TCR086_LisahAndJulia.mp3",
            "categories": [
                "Conscious Running",
                "Soul Sessions"
            ]
        },
        {
            "title": "TCR085 | Coach’s Corner: How to Keep Yourself Accountable & Reach Your Running Goals",
            "datePublished": "Sat, 17 Sep 2016 11:21:40 +0000",
            "description": "Hey Conscious Runners! Lately, I've been hearing about a lot of runners struggling with motivation and holding themselves accountable so they reach their running goals. The truth is everyone has to start somewhere. Whether you’re coming back from injury or coming back from a planned break, you’ve got to start somewhere. Some of us start back with a few miles, some of us start back with a combination of walking and running and others of us start back one block at a time.",
            "length": "11194607",
            "sourceUrl": "http://traffic.libsyn.com/consciousrunner/TCR085_CC_KeepingAccountableAndReachingYourGoals.mp3",
            "categories": [
                "Coach's Corner",
                "Conscious Running"
            ]
        },
        {
            "title": "TCR084 | Jackie Linehan: Making Running as Easy as Possible and Never Getting Injured",
            "datePublished": "Wed, 07 Sep 2016 12:00:47 +0000",
            "description": "Jackie believes if we don't know how to properly deal with and release our emotions during these stressful events, they remain in our bodies until a later time when the body feels it is safe to release them. Unfortunately for runners, these suppressed emotions often show up as running pain and running injuries. She believes we need to learn how to deal with these sensations in a positive way and allow them to easily move in and out of our bodies.",
            "length": "41979360",
            "sourceUrl": "http://traffic.libsyn.com/consciousrunner/TCR084_JackieLinehan_ThePeacfulRunner-SEPT2016.mp3",
            "categories": [
                "Conscious Running",
                "guest_Interviews"
            ]
        },
        {
            "title": "TCR083 | Julia Chi Taylor: Loving Yourself, Staying With the Pain & Running Free",
            "datePublished": "Wed, 31 Aug 2016 09:00:12 +0000",
            "description": "Hey Conscious Runners! As always, I've got another fantastic interview for you. I've got Julia Chi Taylor from RunningConscious on the mic with me. From a very young age Julia knew all she needed to do was to 'run free'. To let the running take me where it wanted to. To stay in the step. To be in the moment and so to experience running as a meditation on the move.",
            "length": "41917940",
            "sourceUrl": "http://traffic.libsyn.com/consciousrunner/TCR083_JuliaChiTaylor_RunnningConscious-AUG2016.mp3",
            "categories": [
                "Conscious Running",
                "guest_Interviews"
            ]
        },
        {
            "title": "TCR082 | Danny Dreyer: Listening to Your Body and Running With Grace and Ease",
            "datePublished": "Wed, 24 Aug 2016 15:14:52 +0000",
            "description": "Hey Conscious Runners! Welcome to another amazing interview. Today, I have runner and co-founder of Chi Running, Danny Dreyer on the line with me. Danny is an accomplished Ultra Marathon runner (races longer than a marathon) and has raced every distance from a 10K to 100 miles. He has successfully completed 40 ultra-marathons since 1995, finishing in the top 3 in his age group in all but one. In August 2005 he placed second in his age group in the USATF National 50k Championships.",
            "length": "57443866",
            "sourceUrl": "http://traffic.libsyn.com/consciousrunner/TCR082_DannyDreyer_ChiRunning_AUG2016.mp3",
            "categories": [
                "Conscious Running",
                "guest_Interviews"
            ]
        },
        {
            "title": "TCR081 | Brad Beer: YES! You Can Run Pain Free",
            "datePublished": "Wed, 17 Aug 2016 09:00:24 +0000",
            "description": "Hey Conscious Runners! Welcome to another amazing episode of The Conscious Runner Podcast. I have runner and physical therapist Brad Beer on the line with me. Brad didn't set out to be a runner, in fact, he had his heart set on becoming a professional triathlete.",
            "length": "48752387",
            "sourceUrl": "http://traffic.libsyn.com/consciousrunner/TCR081_BradBeer_YouCanRunPainFree_AUG2016.mp3",
            "categories": [
                "guest_Interviews",
                "Injury Prevention"
            ]
        },
        {
            "title": "TCR080 | Matt Frazier: Running on Plants and the Relentless Pursuit of Qualifying for Boston",
            "datePublished": "Wed, 03 Aug 2016 09:13:25 +0000",
            "description": "Matt got started running in one of the most interesting ways. One day, he and some friends of his got the idea to run a marathon. This was interesting because Matt had hated running his whole life. But here he was, training to run his first marathon an on top of it he was going after a Boston qualifier. But that didn't happen, he missed the mark by 104 minutes. This really hit him hard. But it wasn't surprising, he knew nothing about running, his training was terrible, his pacing was terrible, the whole thing was a mess.",
            "length": "46949744",
            "sourceUrl": "http://traffic.libsyn.com/consciousrunner/TCR080_MattFrazier_RunningOnPlantsQualifyingForBoston.mp3",
            "categories": [
                "guest_Interviews",
                "Nutrtition Strategies"
            ]
        },
        {
            "title": "TCR079 | James Mullins Q&A: Weight Loss and Running Nutrition",
            "datePublished": "Thu, 28 Jul 2016 13:39:35 +0000",
            "description": "Hey Conscious Runners! Hope you all are having a fantastic week. I'm so excited to bring this long awaited episode to you today. As you know, there is more to running than just running. We have to pay attention to the little things, such as following sound training principles, strength training, mobility, recover and yes, nutrition. well, today is all about nutrition. I've got Strength and Conditioning Specialist and weight loss and nutrition expert James Mullins on the line with me.",
            "length": "36215283",
            "sourceUrl": "http://traffic.libsyn.com/consciousrunner/TCR079_JamesMullinsNutritionQA.mp3",
            "categories": [
                "guest_Interviews",
                "Nutrtition Strategies"
            ]
        },
        {
            "title": "TCR078 | Cory Smith: Anatomy of Training Design and Running Because You Enjoy It",
            "datePublished": "Wed, 20 Jul 2016 09:00:52 +0000",
            "description": "Cory is a USA Track & Field Level 2 Endurance Certified Coach. He started guiding athletes in 2009 when he co-founded Villanova Elite, a running club providing support to post-collegiate distance runners.  As club founder, Cory helped guide several of their athletes to multiple personal bests.",
            "length": "53066140",
            "sourceUrl": "http://traffic.libsyn.com/consciousrunner/TCR078_CorySmith_AnatomyOfTrainingDesign.mp3",
            "categories": [
                "guest_Interviews",
                "Training Strategies"
            ]
        },
        {
            "title": "TCR077 | Coach’s Corner: How to Start Running After a Long Break",
            "datePublished": "Sat, 16 Jul 2016 19:21:02 +0000",
            "description": "Everyone has to start somewhere. Whether you’re coming back from injury or coming back from a planned break, you’ve got to start somewhere. Some of us start back with a few miles, some of us start back with a combination of walking and running and others of us start back one block at a time.",
            "length": "39261317",
            "sourceUrl": "http://traffic.libsyn.com/consciousrunner/TCR077_CC_HowToStartRunningAfterALongBreak.mp3",
            "categories": [
                "Coach's Corner",
                "Training Strategies"
            ]
        },
        {
            "title": "TCR076 | Jason Stephenson: In That Moment, I Had Nothing, But I Had Everything",
            "datePublished": "Tue, 05 Jul 2016 15:25:14 +0000",
            "description": "Today, I've got an amazing interview for you! It is with Jason Stephenson, one of the amazing artists on Running Deep. The album of guided meditations for runners that I've been raving about for the past two months. Jason is also the founder of Relax Me Online and Meditation Masters TV- sites that explore the mind, body and soul connection.",
            "length": "43770321",
            "sourceUrl": "http://traffic.libsyn.com/consciousrunner/TCR076_JasonStephenson_Meditation_JUL2016.mp3",
            "categories": [
                "Conscious Running",
                "guest_Interviews"
            ]
        },
        {
            "title": "TCR075 | James Mullins: Your Strength Training Questions Answered",
            "datePublished": "Thu, 30 Jun 2016 14:12:44 +0000",
            "description": "Hey Conscious Runners, I'm so excited to be bringing you this episode today! This is really a special one to me. It was inspired by a conscious runner who has been diligently going through 45 Days to Building Your Strong Running Body-No Gym Required, a strength training and injury prevention course in The Conscious Runner membership Program.",
            "length": "30860394",
            "sourceUrl": "http://traffic.libsyn.com/consciousrunner/TCR075_JamesMullins_StrengthTraining.mp3",
            "categories": [
                "guest_Interviews",
                "Injury Prevention"
            ]
        },
        {
            "title": "TCR074 | Steve Kamb: The Best Workout Plan is the One that You Actually Follow",
            "datePublished": "Thu, 23 Jun 2016 11:30:52 +0000",
            "description": "Today, I've got health and fitness nerd, Steve Kamb on the mic with me. Steve Kamb is the heart and soul behind the mega, fitness and wellness site, Nerd Fitness. Through workout quests, yoga videos, fitness tips, healthy meals and a camp that is just simply magical, Nerd Fitness gives people who are struggling to get heathy a fighting chance.",
            "length": "58105872",
            "sourceUrl": "http://traffic.libsyn.com/consciousrunner/TCR074_SteveKamb_TheBestWorkoutPlanIsTheOneYouWillDo.mp3",
            "categories": [
                "guest_Interviews",
                "Training Strategies"
            ]
        },
        {
            "title": "TCR073 | Coach’s Corner: Sometimes You Just Don’t Need to Be Running",
            "datePublished": "Wed, 15 Jun 2016 11:24:17 +0000",
            "description": "Hey Conscious Runners!  Today, I’ve got an episode of The Coach’s Corner for you. I haven’t released a oCoach’s Corner episode in a few weeks. It feels really good to be back in front of the camera and mic again. This episode is unlike previous Coach’s Corner. Previous episodes of the Coach’s Corner focus more on the tactical aspects of running such as training, nutrition, strength and recovery.",
            "length": "19224850",
            "sourceUrl": "http://traffic.libsyn.com/consciousrunner/TCR073_CoachCorner.mp3",
            "categories": [
                "Coach's Corner",
                "Training Strategies"
            ]
        },
        {
            "title": "TCR072 | Linda Hall: Getting Up When Life Kicks You Down & Running Deeper",
            "datePublished": "Wed, 08 Jun 2016 09:27:36 +0000",
            "description": "Hey Conscious Runners! Another week has gone I've got another fantastic interview for you. Yes, I know I keep saying this, but it's true. It's just that my guests are so awesome! This week I've got meditator, teacher, personal development coach and Author Linda Hall on the line with me to show us how we can take our running to another level, by running with the mind of mindfulness meditation.",
            "length": "36366981",
            "sourceUrl": "http://traffic.libsyn.com/consciousrunner/TCR072_LindaHall_GettingUpWhenLifeKicksYouDown.mp3",
            "categories": [
                "Conscious Running",
                "guest_Interviews"
            ]
        },
        {
            "title": "TCR071 | Brian Madden: Believing in Yourself & Running Your First Marathon",
            "datePublished": "Wed, 25 May 2016 10:18:31 +0000",
            "description": "Hey Conscious Runners! I've got an amazing episode for you! I know I say that about every episode, and it's true. But honestly, this one is takes it to a another level! Today, I've got first time marathoner Brian Madden on the line with me. I met Brian a couple of years ago. He reached out to me about being interested in running a marathon. I didn't hear from him for two years.",
            "length": "47530277",
            "sourceUrl": "http://traffic.libsyn.com/consciousrunner/TCR071_BrianMadden-BelievingInYourselfAndRunningYourFirstMarathon.mp3",
            "categories": [
                "guest_Interviews",
                "Training Strategies"
            ]
        },
        {
            "title": "TCR070 | Jack Thompson: Being in the Moment & Running Deep",
            "datePublished": "Tue, 17 May 2016 10:56:19 +0000",
            "description": "Today I've got another fantastic interview for you! I've got runner, meditator and producer of guided meditations for runners, Jack Thompson! I met Jack a few weeks ago when he reached out to me about coming on the podcast. Jack is a part of a major running project that I absolutely LOVE.",
            "length": "33290776",
            "sourceUrl": "http://traffic.libsyn.com/consciousrunner/TCR070_JackThompson-BeingInTheMomentAndRunningDeep.mp3",
            "categories": [
                "Conscious Running",
                "guest_Interviews"
            ]
        },
        {
            "title": "TCR069 | Coach’s Corner: How to Make Hill Running Easier",
            "datePublished": "Tue, 26 Apr 2016 13:10:31 +0000",
            "description": "Have you ever wondered how to make Hill running easier? This is the question that I am going to answer in this episode of the Coaches Corner.",
            "length": "9916742",
            "sourceUrl": "http://traffic.libsyn.com/consciousrunner/TCR069_HowToMakeHillRunningEasier.mp3",
            "categories": [
                "Coach's Corner",
                "Training Strategies"
            ]
        },
        {
            "title": "TCR068 | PJ Ann Anguilar: You Are Where You Need to Be, Yoga & Running Your First Half Marathon",
            "datePublished": "Wed, 06 Apr 2016 19:14:49 +0000",
            "description": "Today I’ve got another fantastic interview for you! It’s with one one of my good friends, runner and yogi PJ Ann Aguilar. PJ started running several years ago as a way to ‘take time out for herself’ and is about to embark on her first half-marathon.",
            "length": "36718960",
            "sourceUrl": "http://traffic.libsyn.com/consciousrunner/TCR068_PJAnnAguilar.mp3",
            "categories": [
                "Conscious Running",
                "guest_Interviews"
            ]
        },
        {
            "title": "TCR067 | Coach’s Corner: How to Decide How Many Days a Week to Run",
            "datePublished": "Tue, 22 Mar 2016 14:10:24 +0000",
            "description": "Have you ever wondered how many days a week to run?\r\n\r\nThat is the question that I am going to answer on this episode of The Conscious Runner podcast. Interestingly I never thought about this question for myself. In college, I ran 5 days a week. After graduating I added on a 6th day and have been doing that for the last 20 years.",
            "length": "15686854",
            "sourceUrl": "http://traffic.libsyn.com/consciousrunner/TCR067_HowToDecideWhichDaysOfTheWeekToRun.mp3",
            "categories": [
                "Coach's Corner",
                "Training Strategies"
            ]
        },
        {
            "title": "TCR066 | Sicco Rood: The World Around Us is Reflective of the World Inside of Us",
            "datePublished": "Wed, 16 Mar 2016 14:59:33 +0000",
            "description": "Today I've got a fantastic interview for you! It's with one of my good friends Sicco Rood of Meditation Freedom and the Meditation Freedom Podcast. I was interviewed for Sicco's podcast when I was writing The Conscious Runner Book. I absolutely loved my interview with Sicco and know you will too.",
            "length": "48570977",
            "sourceUrl": "http://traffic.libsyn.com/consciousrunner/TCR066_SiccoRood.mp3",
            "categories": [
                "Conscious Running",
                "guest_Interviews"
            ]
        },
        {
            "title": "TCR065 | Coach’s Corner: How to Take Charge of Pre-Race Nervousness",
            "datePublished": "Tue, 01 Mar 2016 23:18:15 +0000",
            "description": "So your race is here and you are nervous. This is not something to be concerned with. Being a little nervous before a race means you care about your performance. And why shouldn’t you? A lot of hard physical, mental and emotional work went into getting you",
            "length": "13792176",
            "sourceUrl": "http://traffic.libsyn.com/consciousrunner/TCR065_HowToTakeChargeOfPre-RaceNervousness.mp3",
            "categories": [
                "Coach's Corner",
                "Training Strategies"
            ]
        },
        {
            "title": "TCR064 | Michel Dion: There is No Tough Day That Can’t Be Solved By a Good Run",
            "datePublished": "Thu, 25 Feb 2016 17:38:03 +0000",
            "description": "Hey Conscious Runners! I’m so excited to bring you this episode. Today, I’ve got our very own Michel Dion on the line with me! You may have seen him inThe Conscious Runner Academy private Facebook Group. I met Michel last year when I was writing The Conscious Runner",
            "length": "55283440",
            "sourceUrl": "http://traffic.libsyn.com/consciousrunner/TCR064_MichelDion.mp3",
            "categories": [
                "guest_Interviews",
                "Training Strategies"
            ]
        },
        {
            "title": "TCR063 | Coach’s Corner: How to Decide Which Running Club to Join",
            "datePublished": "Fri, 12 Feb 2016 00:13:56 +0000",
            "description": "Have you ever wondered whether joining a running club was right for you? If so, have you ever wondered which club to join? One of our very own Conscious Runners is faced with this dilemma.  I am pleased to cover this topic for you in today's video.",
            "length": "13107563",
            "sourceUrl": "http://traffic.libsyn.com/consciousrunner/TCR063_HowToDecideWhichRunningClubToJoin.mp3",
            "categories": [
                "Coach's Corner",
                "Conscious Running"
            ]
        },
        {
            "title": "TCR062 | Elinor Fish: Running Free from Burnout Injury and Fatigue",
            "datePublished": "Mon, 01 Feb 2016 21:43:38 +0000",
            "description": "Hey Conscious Runners! I'm so excited to bring you this episode. Today, I've got runner, editor at Trail Runner Magazine and creator of the Mindful Running Training system and running and wellness retreats.",
            "length": "50956254",
            "sourceUrl": "http://traffic.libsyn.com/consciousrunner/TCR062_Elinor_Fish_Mindful_Running_JAN2016.mp3",
            "categories": [
                "Conscious Running",
                "guest_Interviews"
            ]
        },
        {
            "title": "TCR061 | Amby Burfoot: I Wanted to Win the Boston Marathon & The First Ladies of Running",
            "datePublished": "Wed, 27 Jan 2016 00:17:14 +0000",
            "description": "Hey Conscious Runners! I'm so excited to bring you this episode. Today, I've got legendary runner, winner of the 1968 Boston Marathon, author and Editor in Chief at Runner's World magazine, Amby Burfoot on the line with me.",
            "length": "44336678",
            "sourceUrl": "http://traffic.libsyn.com/consciousrunner/TCR061_Amby_Burfoot_Boston_And_First_Ladies_Of_RunningJAN24.mp3",
            "categories": [
                "guest_Interviews",
                "Training Strategies"
            ]
        },
        {
            "title": "TCR060 | Stephen Lee: Running Forces You to Deal With Yourself and Not Make Excuses",
            "datePublished": "Tue, 19 Jan 2016 10:54:45 +0000",
            "description": "Hey Conscious Runners! I've got a super inspiring show for you. Today, my guest is Stephen Lee from Zerometers Running and The Average Runner Podcast.",
            "length": "30478721",
            "sourceUrl": "http://traffic.libsyn.com/consciousrunner/TCR060_Stephen_Lee_Running_Forces_You_To_Deal_With_Yourself.mp3",
            "categories": [
                "Conscious Running",
                "guest_Interviews"
            ]
        },
        {
            "title": "TCR059 | Davonda Williams: Life is Not About Being Perfect (Replay)",
            "datePublished": "Tue, 12 Jan 2016 16:25:54 +0000",
            "description": "In this episode I chat with runner, mother and super motivator Davonda Williams about balancing running, motherhood and everything else.",
            "length": "38308877",
            "sourceUrl": "http://traffic.libsyn.com/consciousrunner/TCR059_Davonda_Williams_Life_Is_Not_About_Perfection_SEPT2014.mp3",
            "categories": [
                "Conscious Running",
                "guest_Interviews"
            ]
        },
        {
            "title": "TCR058 | Jeff Gaudette: In the End It’s a Battle Within Yourself (Replay)",
            "datePublished": "Tue, 05 Jan 2016 16:22:43 +0000",
            "description": "In this episode, I talk to former elite runner and founder of Runners Connect, Jeff Gaudette. If you have ever wondered if strength training would help your running, this episode is for you.",
            "length": "41459895",
            "sourceUrl": "http://traffic.libsyn.com/consciousrunner/TCR058__Jeff_Gaudette_The_Battle_Within_AUG2014.mp3",
            "categories": [
                "guest_Interviews",
                "Injury Prevention"
            ]
        },
        {
            "title": "TCR057 | Paul Trevethan: The Running Injury Free Revolution (Replay)",
            "datePublished": "Tue, 29 Dec 2015 16:17:28 +0000",
            "description": "In this episode I talk to Paul Trevethan of Body Leadership Austrailia about what it takes to run injury free and the Running Injury Free Revolution. If you are a runner who is often injured, this episode is for you.",
            "length": "49681910",
            "sourceUrl": "http://traffic.libsyn.com/consciousrunner/TCR057_Paul_Trevethan_Injury_Free_RevolutionJUN2014.mp3",
            "categories": [
                "guest_Interviews",
                "Injury Prevention"
            ]
        },
        {
            "title": "TCR056 | Cait Chock: If I Wasn’t a Runner, I Don’t Know if I Would Have Made It (Replay)",
            "datePublished": "Tue, 22 Dec 2015 16:09:52 +0000",
            "description": "In this episode, I talk with former elite runner and artist Cait Chock about running at the elite level and having an accident take it all away.",
            "length": "25850739",
            "sourceUrl": "http://traffic.libsyn.com/consciousrunner/TCR056_Cait_Chock_Running_How_Running_Helped_Me_JUN2014.mp3",
            "categories": [
                "guest_Interviews",
                "Training Strategies"
            ]
        },
        {
            "title": "TCR055 | Matthew Newnham: Defining Success as a Runner & Being the Best Version of Yourself",
            "datePublished": "Wed, 16 Dec 2015 23:44:47 +0000",
            "description": "Hey Conscious Runners! Today, I've got another fantastic interview for you. I've got runner and co-creator of The Vitality Test and The Five Institute, Mathew Newnham. Mathew been running for over 40 years.",
            "length": "51644588",
            "sourceUrl": "http://traffic.libsyn.com/consciousrunner/Episode55MatthewNewnhamDEC2015.mp3",
            "categories": [
                "Conscious Running",
                "guest_Interviews"
            ]
        },
        {
            "title": "TCR054 | Jae Gruenke: How to Make Running Feel Great Again & The Balanced Runner",
            "datePublished": "Tue, 08 Dec 2015 10:00:41 +0000",
            "description": "Hey Conscious Runners! Today, I've got another fantastic interview for you. I've got Jae Gruenke from The Balanced Runner on with me. And to say our chat was eye opening would be an understatement.",
            "length": "42444572",
            "sourceUrl": "http://traffic.libsyn.com/consciousrunner/Episode54JaeGrunkeDEC2015.mp3",
            "categories": [
                "guest_Interviews",
                "Training Strategies"
            ]
        },
        {
            "title": "TCR053 | Chris Russell: MarathonBQ: How to qualify for the Boston Marathon in 14 weeks (with a full time job and family)",
            "datePublished": "Fri, 27 Nov 2015 15:33:08 +0000",
            "description": "Chris has been running for over 40 years and has qualified and run the Boston Marathon 18 times. We talk about his book, MarathonBQ: How to qualify for the Boston Marathon in 14 weeks (with a full time job and family).",
            "length": "40565011",
            "sourceUrl": "http://traffic.libsyn.com/consciousrunner/Episode53_chrisRussellNOV2015.mp3",
            "categories": [
                "guest_Interviews",
                "Training Strategies"
            ]
        },
        {
            "title": "TCR052 | Max Mlambo: Growing Up in a Ghetto, Overcoming Obstacles and Becoming a Marathoner",
            "datePublished": "Thu, 19 Nov 2015 12:33:10 +0000",
            "description": "From growing up in a ghetto in Zimbabwe to immigrating to the United States, from sprinting at an early age to becoming a multiple time marathon finisher, Max has been through an incredible amount in his life.",
            "length": "44557394",
            "sourceUrl": "http://traffic.libsyn.com/consciousrunner/Episode52MaxMlamboNOV2015.mp3",
            "categories": [
                "guest_Interviews",
                "Training Strategies"
            ]
        },
        {
            "title": "TCR051 | Amanda Brooks: Intuitive Training and Running to the Finish",
            "datePublished": "Tue, 10 Nov 2015 11:27:58 +0000",
            "description": "Amanda has been running for over 13 years and has gained a wealth of knowledge on all things running. If you want to eat better and run in a more holistic way, this episode is for you.",
            "length": "32869553",
            "sourceUrl": "http://traffic.libsyn.com/consciousrunner/Episode51AmandaBrooksNOV2015.mp3",
            "categories": [
                "guest_Interviews",
                "Training Strategies"
            ]
        },
        {
            "title": "TCR050 | John R. Ruiz: Overcoming Obstacles, Chasing the Runners High & the Power of Teamwork",
            "datePublished": "Tue, 03 Nov 2015 13:01:11 +0000",
            "description": "Through our back and forth conversations, I got to really know John and when I found out the obstacles he's overcome and helped others to overcome, I knew I had to interview him. If you are looking to be inspired, this episode is for you.",
            "length": "20078900",
            "sourceUrl": "http://traffic.libsyn.com/consciousrunner/Episode50JohnRuizNOV2015.mp3",
            "categories": [
                "guest_Interviews",
                "Training Strategies"
            ]
        },
        {
            "title": "TCR049 | Jill Ormond Whitaker: Celebrating What You Can Do, Doing What Feels Right for You & Mental Health",
            "datePublished": "Tue, 27 Oct 2015 13:55:41 +0000",
            "description": "As someone who has/had Obsessive Compulsive Disorder (OCD) and understands being locked in your mind, this interview was extremely personal to me. I had a great time getting to know Jill and know you will too.",
            "length": "40758023",
            "sourceUrl": "http://traffic.libsyn.com/consciousrunner/Episode49JillOrmondWhitaker.mp3",
            "categories": [
                "Conscious Running",
                "guest_Interviews"
            ]
        },
        {
            "title": "TCR048 | Jeff Horton: Whether Your Successful or not Depends on Your Definition of Success",
            "datePublished": "Tue, 20 Oct 2015 09:30:44 +0000",
            "description": "If you are a masters runner, this is an interview you don't want to miss. With over 40 years of experience, Jeff knows what it's like to train through your 40s, 50s and recently he's embarked on running in his 60s.",
            "length": "23437700",
            "sourceUrl": "http://traffic.libsyn.com/consciousrunner/Episode48JeffHorton.mp3",
            "categories": [
                "guest_Interviews",
                "Training Strategies"
            ]
        },
        {
            "title": "TCR047 | Thomas Neuberger: Ultramarathoning and Believing in the Run",
            "datePublished": "Tue, 13 Oct 2015 09:00:08 +0000",
            "description": "In his words, Running has had a huge impact of my life. It changed the way I approach any challenge. It opened my mind to the possibility that I’m capable of doing much more than I thought.",
            "length": "26213533",
            "sourceUrl": "http://traffic.libsyn.com/consciousrunner/Episode47ThomasNeubergerOCT2015.mp3",
            "categories": [
                "guest_Interviews",
                "Training Strategies"
            ]
        },
        {
            "title": "TCR046 | Coach Kristie Cranford: The Courage to Keep Going, Training Smart & Forrest Gump",
            "datePublished": "Tue, 06 Oct 2015 10:55:15 +0000",
            "description": "Today, I'm excited to bring you ultra runner, wife, hockey Mom, multiple cancer survivor and co-founder of KR Endurance coach Kristie Cranford. I loved my interview with coach Kristie and know you will too.",
            "length": "39689629",
            "sourceUrl": "http://traffic.libsyn.com/consciousrunner/Episode46KristieCranford.mp3",
            "categories": [
                "guest_Interviews",
                "Training Strategies"
            ]
        },
        {
            "title": "TCR045 | Coach Rebecca Adamson: From Playing Badminton to Running the Boston Marathon & KR Endurance",
            "datePublished": "Mon, 28 Sep 2015 09:16:23 +0000",
            "description": "In this episode, coach Rebecca Adamson and I chat about how running makes you a happier and healthier person, the importance of strength training, heart rate monitor training and much more. I completely enjoyed my talk with Rebecca and know you will too.",
            "length": "55249315",
            "sourceUrl": "http://traffic.libsyn.com/consciousrunner/Episode45_RebeccaAdamson.mp3",
            "categories": [
                "guest_Interviews",
                "Training Strategies"
            ]
        },
        {
            "title": "TCR044 | Dr. Bob Marcus: Becoming a Doctor, Creating JogTunes, Breaking an 11 Minute Mile at 71 and More…",
            "datePublished": "Thu, 23 Oct 2014 18:57:21 +0000",
            "description": "In this episode I talk to Dr. Bob Marcus about starting Jog Tunes (the best running music site on the web) and breaking an 11 minute mile. If you're looking for good running tunes or to be super inspired, this episode is for you.",
            "length": "28918471",
            "sourceUrl": "http://traffic.libsyn.com/consciousrunner/CR0044-Dr-Bob-Marcus.mp3",
            "categories": [
                "guest_Interviews",
                "Training Strategies"
            ]
        },
        {
            "title": "TCR043 | Dr. Jason Karp: It’s Not Hard to Make Time for Something You Want to Do",
            "datePublished": "Mon, 13 Oct 2014 21:03:34 +0000",
            "description": "It all started with a race once around the track in sixth grade. Little did he know how much it would change and define his life. If you want to become a better runner today, than you were yesterday, this episode is for you.",
            "length": "52274436",
            "sourceUrl": "http://traffic.libsyn.com/consciousrunner/CR0043-Dr-Jason-Karp.mp3",
            "categories": [
                "guest_Interviews",
                "Injury Prevention"
            ]
        },
        {
            "title": "TCR042 | Coach’s Corner: Run Your Own Pace. Run Your Own Race. Don’t Get Caught Up in the Hype",
            "datePublished": "Mon, 15 Sep 2014 11:47:24 +0000",
            "description": "Have you ever run with someone who has to be at least half a step ahead of you? Your running buddy starts out half a step in front of you. You pick up your pace to run alongside them and eventually what started out as a training run, becomes a race.",
            "length": "8525327",
            "sourceUrl": "http://traffic.libsyn.com/consciousrunner/CR0042-Run-Your-Own-Pace.mp3",
            "categories": [
                "Coach's Corner",
                "Training Strategies"
            ]
        },
        {
            "title": "TCR041 | Davonda Williams: Life is Not About Being Perfect (Runner, Mom, Motivator)",
            "datePublished": "Mon, 01 Sep 2014 18:54:51 +0000",
            "description": "In this episode I chat with runner, mother and super motivator Davonda Williams about balancing running, motherhood and everything else. I completely enjoyed my conversation with Davonda and know you will too.",
            "length": "38297926",
            "sourceUrl": "http://traffic.libsyn.com/consciousrunner/CR0041-Davonda-Williams.mp3",
            "categories": [
                "guest_Interviews"
            ]
        },
        {
            "title": "TCR040 | Jeff Gaudette: In the End It’s a Battle Within Yourself",
            "datePublished": "Tue, 26 Aug 2014 18:51:18 +0000",
            "description": "If you've ever wondered whether strength training would help your running, this episode is for you. Today, Jeff Gaudette, former elite runner and founder of Runners Connect, answers that very question.",
            "length": "41448903",
            "sourceUrl": "http://traffic.libsyn.com/consciousrunner/CR0040-Jeff-Gaudette-RunnersConnect.mp3",
            "categories": [
                "guest_Interviews",
                "Injury Prevention",
                "Podcast Episodes"
            ]
        },
        {
            "title": "TCR039 | Scott Jones: Bridging the Gap Between People Who Are Doing Amazing Things and People Who Want to Do Amazing Things",
            "datePublished": "Tue, 19 Aug 2014 17:20:18 +0000",
            "description": "Scott interviewed me earlier this year and in this episode, I turn the mic on him. We chat about everything from running, to his businesses, to the Athlete on Fire podcast which showcases athletes of all levels and all walks of life.",
            "length": "33924383",
            "sourceUrl": "http://traffic.libsyn.com/consciousrunner/CR0039-Scott-Jones-Athlete-On-Fire.mp3",
            "categories": [
                "guest_Interviews"
            ]
        },
        {
            "title": "TCR038 | Denny Krahe: Opening up the Throttle and Going as Hard as You Can",
            "datePublished": "Tue, 12 Aug 2014 03:59:22 +0000",
            "description": "Today, I chat with Denny Krahe of DK FitSolutions, and the DizRuns With podcast. Denny has an awesome wife, baby, and two dogs that keep him busy. I completely enjoyed my conversation with Denny and know you will too!",
            "length": "5242880",
            "sourceUrl": "http://traffic.libsyn.com/consciousrunner/CR0038-Denny-Krahe-DizRuns.mp3",
            "categories": [
                "guest_Interviews",
                "Training Strategies"
            ]
        },
        {
            "title": "TCR037 | Julia Hanlon: Running, Living Yoga Philosophies and Going Beyond the Edge",
            "datePublished": "Tue, 05 Aug 2014 15:36:26 +0000",
            "description": "I first stumbled across Julia's site several months ago and was recently reminded about it from a fellow Conscious Runner. When I went back to Julia site, I knew I had to interview her.  Not only was I drawn to Julia as a runner, but as a person. Julia is 23 years old and wise beyond her years.",
            "length": "42533517",
            "sourceUrl": "http://traffic.libsyn.com/consciousrunner/CR0037-Julia-Hanlon-Running-On-Om.mp3",
            "categories": [
                "Conscious Running",
                "guest_Interviews"
            ]
        },
        {
            "title": "TCR036 | Ashley Koff: Eating for Running, Eating for Life",
            "datePublished": "Wed, 30 Jul 2014 18:39:02 +0000",
            "description": "Today, I chat with Ahsley Koff about how to level up your nutrition. We talk about all sorts of things, including how to get meals approved by Ashley and much more. If you're serious about your running and want to give your nutrition a boost, this episode is for you.",
            "length": "59443736",
            "sourceUrl": "http://traffic.libsyn.com/consciousrunner/CR0036-Ashley-Koff-Eating-Running-Life.mp3",
            "categories": [
                "guest_Interviews",
                "Nutrtition Strategies"
            ]
        },
        {
            "title": "TCR035 | Eric Hunley: I Was Tricked into Running",
            "datePublished": "Thu, 24 Jul 2014 09:58:35 +0000",
            "description": "This episode holds a special place in my heart because I'm coaching Eric. Eric is attempting a Boston Qualifier at the 2014 Outer Banks Marathon in November. In this episode, we talk about all things running and much more.",
            "length": "29598048",
            "sourceUrl": "http://traffic.libsyn.com/consciousrunner/CR0035-Eric-Hunley.mp3",
            "categories": [
                "guest_Interviews",
                "Training Strategies"
            ]
        },
        {
            "title": "TCR034 | Katrina Elle: You Should Always Feel Uncomfortable",
            "datePublished": "Tue, 22 Jul 2014 09:37:00 +0000",
            "description": "Katrina is a runner, personal trainer, motivator and one of the most positive people I've met. understatement. Katrina's been down the road of fat burners and get-fit-quick diets, but ultimately turned to fitness for lasting results.",
            "length": "36456779",
            "sourceUrl": "http://traffic.libsyn.com/consciousrunner/CR0034-_Katrina-Elle-Fitness-And-Nutrition.mp3",
            "categories": [
                "guest_Interviews",
                "Training Strategies"
            ]
        },
        {
            "title": "TCR033 | Jill Angie: Running With Curves – Getting Your Head Right for Success + More",
            "datePublished": "Mon, 14 Jul 2014 21:39:18 +0000",
            "description": "Today I chat with Jill Angie from Running With Curves. This is one of the most enjoyable interviews I've had the pleasure to be part of.\r\n\r\nI met Jill online and was struck by her journey to fitness and running.",
            "length": "52239336",
            "sourceUrl": "http://traffic.libsyn.com/consciousrunner/CR033-Jill-Angie-Running-With-Curves.mp3",
            "categories": [
                "guest_Interviews",
                "Training Strategies"
            ]
        },
        {
            "title": "TCR032 | Jessica Humphrey: Finding Peace on the Run",
            "datePublished": "Thu, 10 Jul 2014 19:38:29 +0000",
            "description": "I'm happy to bring Jessica Humphrey from Racing to Zen to you today. What first caught my attention about Jessica's site was the name. Jessica and I both share a passion for finding peace on the run.",
            "length": "37643648",
            "sourceUrl": "http://traffic.libsyn.com/consciousrunner/CR032-Jessica-Humphre-Racing-To-Zen.mp3",
            "categories": [
                "Conscious Running",
                "guest_Interviews"
            ]
        },
        {
            "title": "TCR031 | Paul Trevethan: The Running Injury Free Revolution",
            "datePublished": "Fri, 27 Jun 2014 16:42:28 +0000",
            "description": "Paul is the Director of Body Leadership Australia. He graduated as a physiotherapist from the University of Queensland in 1995 and has been practicing for over 18 years. In this episode, we talk about running injury free.",
            "length": "49670992",
            "sourceUrl": "http://traffic.libsyn.com/consciousrunner/CR031-Paul-Trevethan-Running-Injury-Free-Revolution.mp3",
            "categories": [
                "guest_Interviews",
                "Injury Prevention"
            ]
        },
        {
            "title": "TCR030 | Adam Goucher & Tim Catalano: Running the Edge",
            "datePublished": "Sun, 22 Jun 2014 18:35:21 +0000",
            "description": "In this episode, former elite runner, Adam Goucher and Tim Catalano of Run the Edge talk to me about what it means to Run the Edge. If you believe running is as much a mental sport as it is a physical sport, this episode is for you.",
            "length": "39926679",
            "sourceUrl": "http://traffic.libsyn.com/consciousrunner/CR030-Run-The-Edge-Adam-Goucher-Tim-CatalanoFinal.mp3",
            "categories": [
                "guest_Interviews",
                "Training Strategies"
            ]
        },
        {
            "title": "TCR029 | Nikki Blanton: Putting Yourself Out There and Giving Your All",
            "datePublished": "Tue, 17 Jun 2014 01:02:24 +0000",
            "description": "Inspired by watching her sister-in-law train and complete a marathon, Nikki Blanton began to run. First she ran for some sought-after time, then she ran to slice open life.",
            "length": "40896320",
            "sourceUrl": "http://consciousrunner.com/wp-content/uploads/CR029-Nikki-Blanton-Runner-Artist-Movement-CoachFinal1.mp3",
            "categories": [
                "Conscious Running",
                "guest_Interviews"
            ]
        },
        {
            "title": "TCR028 | Cait Chock: If I Wasn’t a Runner, I Don’t Know if I Would Have Made It",
            "datePublished": "Tue, 10 Jun 2014 18:29:29 +0000",
            "description": "In this episode, I talk with former elite runner and artist Cait Chock about running at the elite level and having an accident take it all away.",
            "length": "25839844",
            "sourceUrl": "http://traffic.libsyn.com/consciousrunner/CR028-Cait-Chock-Runner-Writer-Artist.mp3",
            "categories": [
                "guest_Interviews",
                "Training Strategies"
            ]
        },
        {
            "title": "TCR027 | Ryan Hill: I Wasn’t the Most Talented Runner But My Coaches Got Everything Out of Me",
            "datePublished": "Tue, 03 Jun 2014 09:40:49 +0000",
            "description": "I'm so excited to be bringing you this episode today. Today, I chat with runner, coach and founder of HillRunner.com, Ryan Hill. I remember HillRunner being one of the few running sites on the internet in the '9o's. If you are looking to be inspired, this episode is for you.",
            "length": "48390790",
            "sourceUrl": "http://traffic.libsyn.com/consciousrunner/CR027-Interview-With-Ryan-Hill-Of-HillRunner.mp3",
            "categories": [
                "guest_Interviews",
                "Training Strategies"
            ]
        },
        {
            "title": "TCR026 | Coach’s Corner: How to Get Rid of Those Nasty Side Stitches & The Two Wolves",
            "datePublished": "Thu, 29 May 2014 10:42:32 +0000",
            "description": "Have you ever been running along and felt this intense pain in your side? I don't know a runner who hasn't experienced this at one point or another. Assuming it is a side stitch, there is something you can do about it and you don't have to stop running either.",
            "length": "8351425",
            "sourceUrl": "http://traffic.libsyn.com/consciousrunner/CR026-How-To-Get-Rid-Of-Those-Nasty-Side-Stitches.mp3",
            "categories": [
                "Coach's Corner",
                "Conscious Running",
                "Training Strategies"
            ]
        },
        {
            "title": "TCR025 | Coach’s Corner: How to Avoid Shin Splints & Going After Your Dreams",
            "datePublished": "Tue, 27 May 2014 10:11:25 +0000",
            "description": "If you are a new runner and the front of your legs hurt, this episode is for you. In this episode I talk about what causes shin splints, how you can treat them, my experience with them and how I was able to overcome them while running.",
            "length": "14048588",
            "sourceUrl": "http://traffic.libsyn.com/consciousrunner/CR025-Avoiding-Shin-Splints_And-Going-After-Your-Dreams.mp3",
            "categories": [
                "Coach's Corner",
                "Conscious Running",
                "Injury Prevention"
            ]
        },
        {
            "title": "TCR024 | Coach’s Corner: 3 Ways to Mix Up Your Stretching and You ALWAYS Have a Choice",
            "datePublished": "Thu, 22 May 2014 14:18:23 +0000",
            "description": "As runners, it can sometimes be hard to do the non-running stuff that keeps us healthy. But we must, if we are to stay injury-free. If you are a runner who struggles to do the little things that keep you healthy, this episode is for you.",
            "length": "15865056",
            "sourceUrl": "http://traffic.libsyn.com/consciousrunner/CR024-3-Ways-To-Stretch-And-Keep-Injury-At-Bay.mp3",
            "categories": [
                "Coach's Corner",
                "Conscious Running",
                "Training Strategies"
            ]
        },
        {
            "title": "TCR023 | Tom Casano: Hitting Rock Bottom and Getting Up",
            "datePublished": "Mon, 19 May 2014 10:18:11 +0000",
            "description": "Today I've got another special episode for you. The entire podcast is the inspirational segment. If you like it, the plan would be to air full inspirational segments like this several times a month.",
            "length": "5242880",
            "sourceUrl": "http://traffic.libsyn.com/consciousrunner/CR023-Tom-Casano-On-Hitting-Rock-Bottom.mp3",
            "categories": [
                "Conscious Running",
                "guest_Interviews"
            ]
        },
        {
            "title": "TCR022 | Coach’s Corner: Running, Living Your Truth & Enjoying the Journey",
            "datePublished": "Fri, 09 May 2014 20:24:13 +0000",
            "description": "Today I've got a special episode for you. The tables have been turned. Yes, I am being interviewed. Woot! Woot! Listen in as Chris Russell and I chat about running and life!",
            "length": "26576274",
            "sourceUrl": "http://traffic.libsyn.com/consciousrunner/CR022-Running-Living-Your-Truth-Enjoying-The-Journey.mp3",
            "categories": [
                "Coach's Corner",
                "Conscious Running"
            ]
        },
        {
            "title": "TCR021 | Steve Carmichael: From Overweight, Borderline Diabetic to Passionate Runner and More Part2",
            "datePublished": "Thu, 01 May 2014 14:42:40 +0000",
            "description": "Today, I bring you part two of Steve Carmichael's  story of how he went from being overweight, having fatty liver disease and being a borderline diabetic to a passionate runner and more (part 2).",
            "length": "28893206",
            "sourceUrl": "http://traffic.libsyn.com/consciousrunner/CR021-Steve-Carmichael-Borderline-Diabetic-To-Passionate-Runner-And-CoachPart2.mp3",
            "categories": [
                "guest_Interviews",
                "Training Strategies"
            ]
        },
        {
            "title": "TCR020 | Steve Carmicheal: From Overweight, Borderline Diabetic to Passionate Runner and Coach",
            "datePublished": "Mon, 28 Apr 2014 18:25:02 +0000",
            "description": "Today, I bring you part two of Steve Carmichael's  story of how he went from being overweight, having fatty liver disease and being a borderline diabetic to a passionate runner and more (part 1).",
            "length": "27982231",
            "sourceUrl": "http://traffic.libsyn.com/consciousrunner/CR020-Steve-Carmichael-Borderline-Diabetic-To-Passionate-Runner-And-CoachPart1.mp3",
            "categories": [
                "guest_Interviews",
                "Training Strategies"
            ]
        },
        {
            "title": "TCR019 | Chris Cudworth: A Fascinating Conversation with Former Elite Runner, Chris Cudworth",
            "datePublished": "Tue, 22 Apr 2014 10:36:48 +0000",
            "description": "This has been one of the most fascinating interviews I've had the pleasure to be on the other side of. If you are in any of the LinkedIn running groups, you will know the name Chris Cudworth.",
            "length": "49456226",
            "sourceUrl": "http://traffic.libsyn.com/consciousrunner/CR019-A-Fascinating_Conversation-With-Chris-Cudworth.mp3",
            "categories": [
                "guest_Interviews",
                "Training Strategies"
            ]
        },
        {
            "title": "TCR018 | Coach’s Corner: Finding Your Sweet Spot Mileage",
            "datePublished": "Mon, 21 Apr 2014 10:45:07 +0000",
            "description": "Have you ever wondered how many miles you should be running per week? Should you be running 30, 40, 70 or even upwards of 100 miles per week to achieve your running goals.",
            "length": "9989808",
            "sourceUrl": "http://traffic.libsyn.com/consciousrunner/CR018-Finding-Your-Sweet-Spot-Mileage.mp3",
            "categories": [
                "Coach's Corner",
                "Training Strategies"
            ]
        },
        {
            "title": "TCR017 | Coach’s Corner: The Boston Marathon and Finishing Your Last 4 Marathon Miles Fast",
            "datePublished": "Thu, 17 Apr 2014 13:39:20 +0000",
            "description": "With the Boston Marathon less than a week away and the significance of this year's race, I thought it fitting to talk about a couple of my favorite contenders and finishing the last four miles of your marathon fast.",
            "length": "8771521",
            "sourceUrl": "http://traffic.libsyn.com/consciousrunner/CR017-Boston-Marathon-And-Finishing-The-Last-Four-Marathon-Miles-Fast.mp3",
            "categories": [
                "Coach's Corner",
                "Training Strategies"
            ]
        },
        {
            "title": "TCR016 | Susie Stephen: On Ultra-Marathoning, Yoga, Running and Being",
            "datePublished": "Mon, 07 Apr 2014 10:32:35 +0000",
            "description": "In this episode I chat with ultra-marathoner and yogi Susie Stephen. Although I've know about Susie's site for several months, I met her earlier this week. One of the things that captivated me most about Susie was the sheer number of miles she runs.",
            "length": "43710945",
            "sourceUrl": "http://traffic.libsyn.com/consciousrunner/CR016-Susie-Stephen-Ultra-Marathoning-Yoga-Running-Being.mp3",
            "categories": [
                "Conscious Running",
                "guest_Interviews"
            ]
        },
        {
            "title": "TCR015 | Chris Russell: A Conversation with 15 Time Boston Qualifier Chris Russell",
            "datePublished": "Thu, 03 Apr 2014 15:45:29 +0000",
            "description": "In this episode I sit down with Chris Russell, 15 time Boston Qualifier, Groton Road Racer, frequent flyer, author of  The Mid Packer's Lament and the voice behind the Run Run Live podcast and site.",
            "length": "36015907",
            "sourceUrl": "http://traffic.libsyn.com/consciousrunner/CR015-A-Conversation-With-Chris-Russell.mp3",
            "categories": [
                "guest_Interviews",
                "Training Strategies"
            ]
        },
        {
            "title": "TCR014 | Coach’s Corner: Hydration May Be More Important Than You Think",
            "datePublished": "Wed, 02 Apr 2014 03:07:07 +0000",
            "description": "I'm sure you've heard the importance of hydration, but do you know how important it really is? What if I told you it could be the difference between running a 4hr marathon and a 3hr 52 minute marathon? Would that peak your interest?",
            "length": "17478829",
            "sourceUrl": "http://traffic.libsyn.com/consciousrunner/CR014-Hydration-May-Be-More-Important-Than-You-Think.mp3",
            "categories": [
                "Coach's Corner",
                "Training Strategies"
            ]
        },
        {
            "title": "TCR013 | Timur Crone: Running With the Mind of Mindfulness Meditation",
            "datePublished": "Mon, 24 Mar 2014 14:27:51 +0000",
            "description": "If you are looking to run with more mindfulness, this episode is for you. In this episode, I talk to Timur Crone about running with the mind of mindfulness and meditation and much more.",
            "length": "40334647",
            "sourceUrl": "http://traffic.libsyn.com/consciousrunner/CR013-Running-With-The-Mind-Of-Mindfulness-Meditation.mp3",
            "categories": [
                "Conscious Running",
                "guest_Interviews"
            ]
        },
        {
            "title": "TCR012 | Coach’s Corner: Could Your Shoes Be Working Against You",
            "datePublished": "Tue, 11 Mar 2014 15:37:30 +0000",
            "description": "When you run, the first thing that hits the ground is your feet. That means what's on your feet matters. If you've ever wondered the impact your shoes have on your running, this episode is for you.",
            "length": "11305140",
            "sourceUrl": "http://traffic.libsyn.com/consciousrunner/CR012-Could-Your-Shoues-Be-Working-Against-You.mp3",
            "categories": [
                "Coach's Corner",
                "Training Strategies"
            ]
        },
        {
            "title": "TCR011 | Coach’s Corner: Being the Best Runner You Can Be",
            "datePublished": "Thu, 06 Mar 2014 16:00:20 +0000",
            "description": "Running is actually the easy part of becoming the best runner you can be. I say this because it the one thing we as runners make sure we complete each day. If you truly want to be the best runner that you can be, this episode is for you.",
            "length": "6639616",
            "sourceUrl": "http://traffic.libsyn.com/consciousrunner/CR011-Be-The-Best-Runner-You-Can-Be-And-Dreams.mp3",
            "categories": [
                "Coach's Corner",
                "Training Strategies"
            ]
        },
        {
            "title": "TCR010 | Coach’s Corner: The Truth About Inflammation and Ice Baths",
            "datePublished": "Wed, 05 Mar 2014 14:59:35 +0000",
            "description": "Taking an ice bath is a common practice among many runners as a way to recover faster, and reduce muscle pain and soreness after an intense training session or race. Listen to this episode to see if it's right for you.",
            "length": "8475558",
            "sourceUrl": "http://traffic.libsyn.com/consciousrunner/CR010-The-Truth-About-Inflammation-And-Ice-Bathsv2.mp3",
            "categories": [
                "Coach's Corner",
                "Training Strategies"
            ]
        },
        {
            "title": "TCR009 | Coach’s Corner: Tight Muscles and Muscle Imbalance",
            "datePublished": "Sat, 01 Mar 2014 16:33:01 +0000",
            "description": "In this episode of the show, I talk about the importance of flexibility and strength to prevent injury. I know I've beat this drum a lot lately and in this episode I beat it a lot more.",
            "length": "11527926",
            "sourceUrl": "http://traffic.libsyn.com/consciousrunner/CR009-Preventing-Injury-Stretching-And-Strength.mp3",
            "categories": [
                "Coach's Corner",
                "Training Strategies"
            ]
        },
        {
            "title": "TCR008 | Coach’s Corner: Overtraining & The Secret to Happiness",
            "datePublished": "Fri, 28 Feb 2014 01:00:21 +0000",
            "description": "Have you ever woken up with your legs feeling heavy, your mind wondering how you were ever going to go for a run? If you have, this episode is for you.",
            "length": "9850222",
            "sourceUrl": "http://traffic.libsyn.com/consciousrunner/CR008-Overtraining-And-The-Secret-To-Happiness.mp3",
            "categories": [
                "Coach's Corner",
                "Conscious Running",
                "Training Strategies"
            ]
        },
        {
            "title": "TCR007 | Coach’s Corner: The Year of the Needles and How to Be a More Positive Person",
            "datePublished": "Wed, 26 Feb 2014 17:11:49 +0000",
            "description": "On one of the times I stepped up, I heard my knee pop. I In this episode In this episode of the show, I talk about my experience with prolotherapy and give tips on how to be a more positive person.",
            "length": "11665872",
            "sourceUrl": "http://traffic.libsyn.com/consciousrunner/CR007-The-Year-Of-The-Needles-Being-More-Positive.mp3",
            "categories": [
                "Coach's Corner",
                "Personal Stories"
            ]
        },
        {
            "title": "TCR006 | Coach’s Corner: Running YOUR Pace & Failing Your Way To Success",
            "datePublished": "Tue, 25 Feb 2014 15:49:03 +0000",
            "description": "In this episode I talk about the importance of keeping to your schedule, running at your own pace and not being swayed from your overall goal by others. I also talk about failing your way to success.",
            "length": "9442721",
            "sourceUrl": "http://traffic.libsyn.com/consciousrunner/CR006-Run-Your-Pace-Fail-Your-Way-To-Success.mp3",
            "categories": [
                "Coach's Corner",
                "Training Strategies"
            ]
        },
        {
            "title": "TCR005 | Coach’s Corner: Lactate Threshold Training & Small Things Mattering Most",
            "datePublished": "Mon, 24 Feb 2014 16:30:00 +0000",
            "description": "Over the years lactic acid has gotten a pretty bad reputation. It's been blamed for fatigue, sore muscles, cramps and is often thought of as something to avoid at all cost. Listen in to learn more about it.",
            "length": "10289456",
            "sourceUrl": "http://traffic.libsyn.com/consciousrunner/CR005-Lactate-Threshold-And-Small-Things_Mattering_Most.mp3",
            "categories": [
                "Coach's Corner",
                "Training Strategies"
            ]
        },
        {
            "title": "TCR004 | Chris Cooper: My Best-Race: 50 Runners and the Finish Line They’ll Never Forget",
            "datePublished": "Sun, 23 Feb 2014 19:21:31 +0000",
            "description": "In this episode, I talk to runner and author Chris Cooper, about his book “My Best-Race: 50 Runners and the Finish Line They'll Never Forget”. If you want to be inspired, this episode is for you.",
            "length": "27266605",
            "sourceUrl": "http://traffic.libsyn.com/consciousrunner/CR004-Chris-Cooper-My-Best-Race.mp3",
            "categories": [
                "guest_Interviews",
                "Personal Stories"
            ]
        },
        {
            "title": "TCR003 | Coach’s Corner: Small Things Matter Most",
            "datePublished": "Sat, 22 Feb 2014 18:16:36 +0000",
            "description": "If you’ve ever felt caught up in the frenzy of life or feel like things just aren’t going your way, this episode is for you. In it, I talk about how putting your attention on the smallest of things can make a huge difference.",
            "length": "15496396",
            "sourceUrl": "http://traffic.libsyn.com/consciousrunner/CR003-Small-Things-Matter-Loving-Kindness-Meditation.mp3",
            "categories": [
                "Coach's Corner",
                "Conscious Running"
            ]
        },
        {
            "title": "TCR002 | Betsy Henry: Becoming a Zen Mamma",
            "datePublished": "Fri, 21 Feb 2014 17:57:57 +0000",
            "description": "If you’re a busy mother trying to do it ALL and get your runs in, this episode is for you. Betsy Henry and I go deep on what it means to be a Zen Mamma and create peace and order in your life.",
            "length": "45986618",
            "sourceUrl": "http://traffic.libsyn.com/consciousrunner/CR002-Betsy-Henry-On-Becoming-A-Zen-Mamma.mp3",
            "categories": [
                "Conscious Running",
                "guest_Interviews"
            ]
        },
        {
            "title": "TCR001 | Andrea Owen: Challenge, Perseverence & Living a Kickass-Life",
            "datePublished": "Thu, 20 Feb 2014 17:45:43 +0000",
            "description": "If you want an all around feel good life that will help your running too, this episode is for you. Andrea Owen and I talk about how to make lasting positive change and live a super kick ass life.",
            "length": "47019024",
            "sourceUrl": "http://traffic.libsyn.com/consciousrunner/CR001-Andrea-Owen-Challenge-Perseverence-And-Living-A-Kickass-Life.mp3",
            "categories": [
                "Conscious Running",
                "guest_Interviews"
            ]
        }
    ]
}