{
    "artwork": "http://is2.mzstatic.com/image/thumb/Music128/v4/98/4b/89/984b8943-1d49-80b6-ec9a-cdeb0c54f07e/source/100x100bb.jpg",
    "description": "Watch the Mark Gungor Show every weekday starting at 10am central time. Join Mark and co-hosts Diane Brierley and Phil Gungor as they discuss any and all issues concerning life, love and marriage. This is your opportunity to hear Mark answer your questions. Mark is the creator of the Laugh Your Way to a Better Marriage seminar, and one of the most sought-after speakers in the country on marriage and family.",
    "feedURL": "http://34.232.96.170/feed/videopodcast/",
    "podcastURL": "http://34.232.96.170",
    "title": "The Mark Gungor Show Video",
    "episodes": [
        {
            "title": "08-14-2017",
            "datePublished": "Mon, 14 Aug 2017 16:09:47 +0000",
            "description": "Four Phrases That Make You a Hero to Your Wife.  How can I rekindle a lost sex drive? A young man dating a single mom wonders if he can be a good stepfather to her child. What can I do with a wife who rebuffs my advances and says she is just not an affectionate […]",
            "length": "420501650",
            "sourceUrl": "http://media.blubrry.com/mgshow/s3.amazonaws.com/MGSOURCE/video/2017/toair_w05082017.mp4"
        },
        {
            "title": "08-07-2017",
            "datePublished": "Thu, 10 Aug 2017 20:34:12 +0000",
            "description": "Three things your phone reveals about your marriage. How do I deal with my wife showing she cares by controlling me? Is there such a thing as innocent flirting?",
            "length": "419248791",
            "sourceUrl": "http://media.blubrry.com/mgshow/s3.amazonaws.com/MGSOURCE/video/2017/toair_w05012017.mp4"
        },
        {
            "title": "07-31-2017",
            "datePublished": "Mon, 31 Jul 2017 15:03:37 +0000",
            "description": "Mark begins the show with a discussion of annulment. A young wife is having issues with her past sexual relationship interfering with her current marital sex life.  How can I deal with my husband seeing inappropriate sexual content on Facebook. What are the pitfalls of marrying someone who was previously divorced? What do I do […]",
            "length": "414270290",
            "sourceUrl": "http://media.blubrry.com/mgshow/s3.amazonaws.com/MGSOURCE/video/2017/toair_w04242017.mp4"
        },
        {
            "title": "07-24-2017",
            "datePublished": "Mon, 24 Jul 2017 15:10:54 +0000",
            "description": "3 ways to instantly spice up your marriage.  A couple is struggling because of the wife’s hormonal issues. Parents ask for advice on how to deal with their teenage daughter who is sneaking around with her boyfriend. A wife needs help dealing with her sexless marriage.",
            "length": "417208879",
            "sourceUrl": "http://media.blubrry.com/mgshow/s3.amazonaws.com/MGSOURCE/video/2017/toair_w04172017.mp4"
        },
        {
            "title": "07-17-2017",
            "datePublished": "Mon, 17 Jul 2017 15:08:31 +0000",
            "description": "Sexual connection is key to a happy marriage. A daughter asks for help for her parents’ failing marriage. Where is the line for modesty in the church? How do I get over the pain and sadness of my divorce? A young man is desperate for help with his porn and masturbation struggles. Am I crazy […]",
            "length": "2643519597",
            "sourceUrl": "http://media.blubrry.com/mgshow/s3.amazonaws.com/MGSOURCE/video/2017/toair_w04102017.mp4"
        },
        {
            "title": "07-10-2017",
            "datePublished": "Mon, 10 Jul 2017 14:19:46 +0000",
            "description": "Why do some new marriages fail so fast? How do I get my husband’s attention back on me instead of his hobby? Parents want to know how to help their 18-year-old daughter get over a heartbreaking breakup with her boyfriend.  A woman wonders if “ex-sex” is okay with her husband now that they are divorced. […]",
            "length": "419494045",
            "sourceUrl": "http://media.blubrry.com/mgshow/s3.amazonaws.com/MGSOURCE/video/2017/toair_w04032017.mp4"
        },
        {
            "title": "07-03-2017",
            "datePublished": "Mon, 03 Jul 2017 14:02:21 +0000",
            "description": "Avoid these dates for your wedding to reduce the odds of divorce. A wife is upset because SHE can’t stop checking out other guys; a woman asks if the saying, “Once a cheater, always a cheater” is true; a husband is struggling from issues due to his past use of porn and masturbation. Could my […]",
            "length": "393812603",
            "sourceUrl": "http://media.blubrry.com/mgshow/s3.amazonaws.com/MGSOURCE/video/2017/toair_w03062017.mp4"
        },
        {
            "title": "06-26-2017",
            "datePublished": "Mon, 26 Jun 2017 15:02:14 +0000",
            "description": "4 things every man wants in a woman.  Are those who marry young more apt to divorce? What should my response be when my husbands tells me he wouldn’t look at porn if I would have sex with him more often?  Is masturbation a bad a idea for women? Is common law marriage against biblical […]",
            "length": "394616214",
            "sourceUrl": "http://media.blubrry.com/mgshow/s3.amazonaws.com/MGSOURCE/video/2017/toair_w02272017.mp4"
        },
        {
            "title": "06-19-2017",
            "datePublished": "Mon, 19 Jun 2017 15:09:53 +0000",
            "description": "Study links church attendance with marriage stability.  A couple needs help breaking away from the use of some harmful sexual fantasy. Is spending quality family time more important than going to church on a Sunday? Is it possible for people to disagree with each other without arguing? How do I submit to a husband with […]",
            "length": "396660862",
            "sourceUrl": "http://media.blubrry.com/mgshow/s3.amazonaws.com/MGSOURCE/video/2017/toair_w02132017.mp4"
        },
        {
            "title": "06-12-2017",
            "datePublished": "Mon, 12 Jun 2017 13:55:55 +0000",
            "description": "Ten things to do for your wife every year. A wife is having trouble forgiving her husband’s  past use of pornography. Should men tell their wives about the lustful thoughts and struggles they have? Do men deserve respect even if they have failed a lot?",
            "length": "392869933",
            "sourceUrl": "http://media.blubrry.com/mgshow/s3.amazonaws.com/MGSOURCE/video/2017/toair_w02062017.mp4"
        },
        {
            "title": "06-05-2017",
            "datePublished": "Mon, 05 Jun 2017 14:20:10 +0000",
            "description": "Is “kissing dating goodbye” a good thing or bad thing? What to do after you are married and lose the “can’t keep our hands off each other” feeling? The importance of not comparing your sex life to other people’s sex life. Is withholding sex from your spouse grounds for divorce?  Can I ask my husband […]",
            "length": "395459093",
            "sourceUrl": "http://media.blubrry.com/mgshow/s3.amazonaws.com/MGSOURCE/video/2016/toair_w12192016.mp4"
        },
        {
            "title": "05-29-2017",
            "datePublished": "Mon, 29 May 2017 15:04:22 +0000",
            "description": "3 ways men communicate differently than women. A wife is frustrated with her husband who is too tired to put effort into sex.  How can my wife and I  be a godly example of marriage to the young people in our youth group? A man gives testimony on how he quit watching porn and masturbating. […]",
            "length": "392142138",
            "sourceUrl": "http://media.blubrry.com/mgshow/s3.amazonaws.com/MGSOURCE/video/2016/toair_w12122016.mp4"
        },
        {
            "title": "05-22-2017",
            "datePublished": "Mon, 22 May 2017 15:18:57 +0000",
            "description": "Does divorce lead children away from faith? A couple disagrees about church attendance while on vacation, a divorced mom with teens wonders about remarriage before the kids are grown and flown, a wife is troubled because she craves attention from other men. Mark has great insight on the necessity of “reminding”, a guy wants to […]",
            "length": "392750198",
            "sourceUrl": "http://media.blubrry.com/mgshow/s3.amazonaws.com/MGSOURCE/video/2016/toair_w12052016.mp4"
        },
        {
            "title": "05-15-2017",
            "datePublished": "Mon, 15 May 2017 14:25:03 +0000",
            "description": "More on the marriage mistakes even smart couples make. Mark discusses prayer when a husband writes in wondering what he can pray to get his wife back after she left him for another man. Should couples “help” each other lose weight? A new husband has trouble during sex due to his porn use. How can […]",
            "length": "391392154",
            "sourceUrl": "http://media.blubrry.com/mgshow/s3.amazonaws.com/MGSOURCE/video/2016/toair_w10172016.mp4"
        },
        {
            "title": "05-08-2017",
            "datePublished": "Mon, 08 May 2017 14:52:03 +0000",
            "description": "NEW EPISODE: Four Phrases That Make You a Hero to Your Wife.  How can I rekindle a lost sex drive? A young man dating a single mom wonders if he can be a good stepfather to her child. What can I do with a wife who rebuffs my advances and says she is just not […]",
            "length": "420501650",
            "sourceUrl": "http://media.blubrry.com/mgshow/s3.amazonaws.com/MGSOURCE/video/2017/toair_w05082017.mp4"
        },
        {
            "title": "05-01-2017",
            "datePublished": "Mon, 01 May 2017 14:35:10 +0000",
            "description": "NEW EPISODE: Three things your phone reveals about your marriage. How do I deal with my wife showing she cares by controlling me? Is there such a thing as innocent flirting?",
            "length": "419248791",
            "sourceUrl": "http://media.blubrry.com/mgshow/s3.amazonaws.com/MGSOURCE/video/2017/toair_w05012017.mp4"
        },
        {
            "title": "04-24-2017",
            "datePublished": "Mon, 24 Apr 2017 21:12:05 +0000",
            "description": "NEW EPISODE: Mark begins the show with a discussion of annulment. A young wife is having issues with her past sexual relationship interfering with her current marital sex life. How can I deal with my husband seeing inappropriate sexual content on Facebook. What are the pitfalls of marrying someone who was previously divorced? What do […]",
            "length": "414270290",
            "sourceUrl": "http://media.blubrry.com/mgshow/s3.amazonaws.com/MGSOURCE/video/2017/toair_w04242017.mp4"
        },
        {
            "title": "04-17-2017",
            "datePublished": "Mon, 17 Apr 2017 21:16:47 +0000",
            "description": "NEW EPISODE: 3 ways to instantly spice up your marriage. A couple is struggling because of the wife’s hormonal issues. Parents ask for advice on how to deal with their teenage daughter who is sneaking around with her boyfriend. A wife needs help dealing with her sexless marriage.",
            "length": "417208879",
            "sourceUrl": "http://media.blubrry.com/mgshow/s3.amazonaws.com/MGSOURCE/video/2017/toair_w04172017.mp4"
        },
        {
            "title": "04-10-2017",
            "datePublished": "Mon, 10 Apr 2017 21:18:22 +0000",
            "description": "NEW EPISODE: Sexual connection is key to a happy marriage. A daughter asks for help for her parents’ failing marriage. Where is the line for modesty in the church? How do I get over the pain and sadness of my divorce? A young man is desperate for help with his porn and masturbation",
            "length": "2643519597",
            "sourceUrl": "http://media.blubrry.com/mgshow/s3.amazonaws.com/MGSOURCE/video/2017/toair_w04102017.mp4"
        },
        {
            "title": "04-03-2017",
            "datePublished": "Mon, 03 Apr 2017 21:22:01 +0000",
            "description": "NEW EPISODE: Why do some new marriages fail so fast? How do I get my husband’s attention back on me instead of his hobby? Parents want to know how to help their 18-year-old daughter get over a heartbreaking breakup with her boyfriend. A woman wonders if “ex-sex” is okay with her husband now that they […]",
            "length": "419494045",
            "sourceUrl": "http://media.blubrry.com/mgshow/s3.amazonaws.com/MGSOURCE/video/2017/toair_w04032017.mp4"
        },
        {
            "title": "03-27-2017",
            "datePublished": "Mon, 27 Mar 2017 14:43:40 +0000",
            "description": "7 Marriage Mistakes Even Smart Couples Make. How can one deal with apathy and a porn problem? A wife needs advice after she finds out her husband is involved with his former fiancé. A Christian married to an unbeliever wonders how to restore her marriage. How do I know if I’m ready to date or […]",
            "length": "390555347",
            "sourceUrl": "http://media.blubrry.com/mgshow/s3.amazonaws.com/MGSOURCE/video/2016/toair_w10102016.mp4"
        },
        {
            "title": "03-20-2017",
            "datePublished": "Mon, 20 Mar 2017 14:39:06 +0000",
            "description": "Can “Facebragging” fuel divorce? A married guy has trouble in his marriage after he went to a movie with a single woman.  A husband and wife are arguing about the frequency of sex. The Mrs. wants him to get rid of the dogs he’s had since before they were married. A single woman wants to […]",
            "length": "434608392",
            "sourceUrl": "http://media.blubrry.com/mgshow/s3.amazonaws.com/MGSOURCE/video/2016/toair_w10032016.mp4"
        },
        {
            "title": "03-13-2017",
            "datePublished": "Mon, 13 Mar 2017 14:44:51 +0000",
            "description": "Four simple ways to get your wife in the mood. Mark discusses the human sexual response cycle. A woman asks a question about generational curses.",
            "length": "441563500",
            "sourceUrl": "http://media.blubrry.com/mgshow/s3.amazonaws.com/MGSOURCE/video/2016/toair_w09262016.mp4"
        },
        {
            "title": "02-27-2017",
            "datePublished": "Mon, 27 Feb 2017 22:28:20 +0000",
            "description": "NEW EPISODE: 4 things every man wants in a woman. Are those who marry young more apt to divorce? What should me response be when my husbands tells me he wouldn’t look at porn if I would have sex with him more often? Is masturbation a bad a idea for women? Is common law marriage […]",
            "length": "394616214",
            "sourceUrl": "http://media.blubrry.com/mgshow/s3.amazonaws.com/MGSOURCE/video/2017/toair_w02272017.mp4"
        },
        {
            "title": "02-20-2017",
            "datePublished": "Mon, 20 Feb 2017 16:26:56 +0000",
            "description": "Millennials marry young if their mother married young–and stayed married! Why don’t more couples find happiness in their marriage? A wife has issues with her husband’s close female friend. A young woman has concerns after fiancé admits he wouldn’t keep a child born with disabilities. A wife doesn’t want to be the initiator for sex […]",
            "length": "443088108",
            "sourceUrl": "http://media.blubrry.com/mgshow/s3.amazonaws.com/MGSOURCE/video/2016/toair_w09192016.mp4"
        },
        {
            "title": "02-13-2017",
            "datePublished": "Mon, 13 Feb 2017 22:33:54 +0000",
            "description": "NEW EPISODE: Study links church attendance with marriage stability. A couple needs help breaking away from the use of some harmful sexual fantasy. Is spending quality family time more important than going to church on a Sunday? Is it possible for people to disagree with each other without arguing? How do I submit to a […]",
            "length": "396660862",
            "sourceUrl": "http://media.blubrry.com/mgshow/s3.amazonaws.com/MGSOURCE/video/2017/toair_w02132017.mp4"
        },
        {
            "title": "02-06-2017",
            "datePublished": "Mon, 06 Feb 2017 22:37:31 +0000",
            "description": "NEW EPISODE: Ten things to do for your wife every year. A wife is having trouble forgiving her husband’s past use of pornography. Should men tell their wives about the lustful thoughts and struggles they have? Do men deserve respect even if they have failed a lot?",
            "length": "392869933",
            "sourceUrl": "http://media.blubrry.com/mgshow/s3.amazonaws.com/MGSOURCE/video/2017/toair_w02062017.mp4"
        },
        {
            "title": "01-30-2017",
            "datePublished": "Mon, 30 Jan 2017 14:20:49 +0000",
            "description": "Best and worst words to use for an online dating profile. The influence of movies on the dating culture. Should I let my cheating husband see our daughter?  A young man needs advice after he got into fornicating with his girlfriend. Can love grow from friendship rather than physical attraction?",
            "length": "437594919",
            "sourceUrl": "http://media.blubrry.com/mgshow/s3.amazonaws.com/MGSOURCE/video/2016/toair_w09122016.mp4"
        },
        {
            "title": "01-23-2017",
            "datePublished": "Mon, 23 Jan 2017 13:03:37 +0000",
            "description": "Mark discusses the new books he has coming out. A young man wonders if he should confront his future in-laws about their parenting skills. A wife is struggling after her husband’s emotional affair and a couple has issues due to his constant use of the cell phone.",
            "length": "437013265",
            "sourceUrl": "http://media.blubrry.com/mgshow/s3.amazonaws.com/MGSOURCE/video/2016/toair_w09052016.mp4"
        },
        {
            "title": "01-16-2017",
            "datePublished": "Mon, 16 Jan 2017 16:01:04 +0000",
            "description": "Men who marry smart women live longer. What is Mark’s view on older, single people being sexually intimate outside of marriage? How do I deal with my husband’s emotional attachment to another woman? Should families establish the habit of daily bible study and prayer? A wife needs help with her husband’s porn problem. What do […]",
            "length": "444347055",
            "sourceUrl": "http://media.blubrry.com/mgshow/s3.amazonaws.com/MGSOURCE/video/2016/toair_w08292016.mp4"
        },
        {
            "title": "01-09-2017",
            "datePublished": "Mon, 09 Jan 2017 15:35:26 +0000",
            "description": "Is porn exposure forcing kids into early sex? How can my husband and I shift our schedules to get more sex in our life? When a couple is apart for military service, is masturbation okay? Should a non-blood relative be referred to as “aunt and uncle”? My husband would rather play video games than have […]",
            "length": "440923676",
            "sourceUrl": "http://media.blubrry.com/mgshow/s3.amazonaws.com/MGSOURCE/video/2016/toair_w07112016.mp4"
        },
        {
            "title": "01-02-2017",
            "datePublished": "Sun, 01 Jan 2017 16:00:07 +0000",
            "description": "Three phrases to never say to your husband. My wife has lost the “in love” feeling for me…what do I do? Am I weird to feel it’s okay for my husband to have a girlfriend? Do you think people can change their personality traits? Does the Bible tell people to “wait on God” to find […]",
            "length": "437403088",
            "sourceUrl": "http://media.blubrry.com/mgshow/s3.amazonaws.com/MGSOURCE/video/2016/toair_w07042016.mp4"
        },
        {
            "title": "12-26-2016",
            "datePublished": "Mon, 26 Dec 2016 16:09:06 +0000",
            "description": "What  does your phone reveal about your marriage? Is it right to have phone sex with my wife? My husband has low testosterone, won’t have sex with me and won’t get help for it…what do I do?  What are first dates like? Are they generally awkward?",
            "length": "434404704",
            "sourceUrl": "http://media.blubrry.com/mgshow/s3.amazonaws.com/MGSOURCE/video/2016/toair_w06272016.mp4"
        },
        {
            "title": "12-19-2016",
            "datePublished": "Mon, 19 Dec 2016 22:45:25 +0000",
            "description": "NEW EPISODE: Is “kissing dating goodbye” a good thing or bad thing? What to do after you are married and lose the “can’t keep our hands off each other” feeling? The importance of not comparing your sex life to other people’s sex life. Is withholding sex from your spouse grounds for divorce? Can I ask […]",
            "length": "395459093",
            "sourceUrl": "http://media.blubrry.com/mgshow/s3.amazonaws.com/MGSOURCE/video/2016/toair_w12192016.mp4"
        },
        {
            "title": "12-12-2016",
            "datePublished": "Mon, 12 Dec 2016 22:53:37 +0000",
            "description": "NEW EPISODE: 3 ways men communicate differently than women. A wife is frustrated with her husband who is too tired to put effort into sex. How can my wife and I be a godly example of marriage to the young people in our youth group? A man gives testimony on how he quit watching porn […]",
            "length": "392142138",
            "sourceUrl": "http://media.blubrry.com/mgshow/s3.amazonaws.com/MGSOURCE/video/2016/toair_w12122016.mp4"
        },
        {
            "title": "12-05-2016",
            "datePublished": "Mon, 05 Dec 2016 23:00:48 +0000",
            "description": "NEW EPISODE: Does divorce lead children from faith? A couple disagrees about church attendance while on vacation, a divorced mom with teens wonders about remarriage before the kids are grown and flown, a wife is troubled because she craves attention from other men. Mark has great insight on the necessity of “reminding”, a guy wants […]",
            "length": "392750198",
            "sourceUrl": "http://media.blubrry.com/mgshow/s3.amazonaws.com/MGSOURCE/video/2016/toair_w12052016.mp4"
        },
        {
            "title": "11-28-2016",
            "datePublished": "Mon, 28 Nov 2016 15:31:33 +0000",
            "description": "The power of touch in maintaining a good marital relationship. How can I act respectfully toward my husband when I don’t respect him? A woman needs help dealing with her crazy mother-in-law. How can we more effectively deal with conflict in our marriage? Should I keep pursuing a girl who put me in the “friend […]",
            "length": "412989674",
            "sourceUrl": "http://media.blubrry.com/mgshow/s3.amazonaws.com/MGSOURCE/video/2016/toair_w06202016.mp4"
        },
        {
            "title": "11-21-2016",
            "datePublished": "Mon, 21 Nov 2016 16:06:30 +0000",
            "description": "More tips to make your relationship feel like it did in the beginning. A woman writes after she overheard her husband confessing his problem with lust. Do I fake it even if my husband doesn’t “get my motor running”? Must a widow fulfill her husband’s request remarry after he’s gone? Should I confess my past […]",
            "length": "369653871",
            "sourceUrl": "http://media.blubrry.com/mgshow/s3.amazonaws.com/MGSOURCE/video/2016/toair_w06132016.mp4"
        },
        {
            "title": "11-14-2016",
            "datePublished": "Mon, 14 Nov 2016 16:05:04 +0000",
            "description": "8 tips to make your relationship feel like it did in the beginning. Should I forgive my wife for her infidelity? A newlywed couple can’t seem to agree on the frequency of sex. A guy and his fiancé disagree about alcohol in the home and a young woman says her boyfriend gets on her nerves […]",
            "length": "366063041",
            "sourceUrl": "http://media.blubrry.com/mgshow/s3.amazonaws.com/MGSOURCE/video/2016/toair_w06062016.mp4"
        },
        {
            "title": "11-07-2016",
            "datePublished": "Mon, 07 Nov 2016 15:26:10 +0000",
            "description": "My husband has a close female friend and I am uncomfortable with their relationship, what do I do?  How do I get my husband to go to church with me? What can we do if our sex life is being negatively impacted by our premarital sexual experiences? My husband plays video games I consider pornographic, […]",
            "length": "390498011",
            "sourceUrl": "http://media.blubrry.com/mgshow/s3.amazonaws.com/MGSOURCE/video/2016/toair_w05302016.mp4"
        },
        {
            "title": "10-31-2016",
            "datePublished": "Mon, 31 Oct 2016 14:05:17 +0000",
            "description": "Why women allow their husbands to cheat. A newlywed couple wonders when the fights are going to start. A husband uses Mark to justify his sarcasm toward his wife. How does one know what career path to choose or does God tell you? A wife worries about her husband being stuck in an frustrating and […]",
            "length": "378642972",
            "sourceUrl": "http://media.blubrry.com/mgshow/s3.amazonaws.com/MGSOURCE/video/2016/toair_w05232016.mp4"
        },
        {
            "title": "10-24-2016",
            "datePublished": "Mon, 24 Oct 2016 16:59:42 +0000",
            "description": "Men battle sexual temptation even after marriage. How can I encourage my husband to slow down and get more involved in foreplay? How do I deal with my husband’s PTSD impacting our marriage? Should I have sex all the time with my husband even if it is extremely painful for me? What Flag Page traits […]",
            "length": "351971112",
            "sourceUrl": "http://media.blubrry.com/mgshow/s3.amazonaws.com/MGSOURCE/video/2016/toair_w05022016.mp4"
        },
        {
            "title": "10-17-2016",
            "datePublished": "Mon, 17 Oct 2016 14:52:36 +0000",
            "description": "NEW EPISODE: More on the marriage mistakes even smart couples make. Mark discusses prayer when a husband writes in wondering what he can pray to get his wife back after she left him for another man. Should couples “help” each other lose weight? A new husband has trouble during sex due to his porn use. […]",
            "length": "391392154",
            "sourceUrl": "http://media.blubrry.com/mgshow/s3.amazonaws.com/MGSOURCE/video/2016/toair_w10172016.mp4"
        },
        {
            "title": "10-10-2017",
            "datePublished": "Mon, 10 Oct 2016 14:54:14 +0000",
            "description": "NEW EPISODE: 7 Marriage Mistakes Even Smart Couples Make. How can one deal with apathy and a porn problem? A wife needs advice after she finds out her husband is involved with his former fiancé. A Christian married to an unbeliever wonders how to restore her marriage. How do I know if I’m ready to […]",
            "length": "390555347",
            "sourceUrl": "http://media.blubrry.com/mgshow/s3.amazonaws.com/MGSOURCE/video/2016/toair_w10102016.mp4"
        },
        {
            "title": "10-03-2016",
            "datePublished": "Mon, 03 Oct 2016 14:58:58 +0000",
            "description": "NEW EPISODE: Can “Facebragging” fuel divorce? A married guy has trouble in his marriage after he went to a movie with a single woman. A husband and wife are arguing about the frequency of sex. The Mrs. wants him to get rid of the dogs he’s had since before they were married. A single woman […]",
            "length": "434608392",
            "sourceUrl": "http://media.blubrry.com/mgshow/s3.amazonaws.com/MGSOURCE/video/2016/toair_w10032016.mp4"
        },
        {
            "title": "09-26-2016",
            "datePublished": "Mon, 26 Sep 2016 15:04:13 +0000",
            "description": "NEW EPISODE: Four simple ways to get your wife in the mood. Mark discusses the human sexual response cycle. A woman asks a question about generational curses.",
            "length": "441563500",
            "sourceUrl": "http://media.blubrry.com/mgshow/s3.amazonaws.com/MGSOURCE/video/2016/toair_w09262016.mp4"
        },
        {
            "title": "09-19-2016",
            "datePublished": "Mon, 19 Sep 2016 15:07:52 +0000",
            "description": "NEW EPISODE: Millennials marry young if their mother married young–and stayed married! Why don’t more couples find happiness in their marriage? A wife has issues with her husband’s close female friend. A young woman has concerns after fiancé admits he wouldn’t keep a child born with disabilities. A wife doesn’t want to be the initiator […]",
            "length": "443088108",
            "sourceUrl": "http://media.blubrry.com/mgshow/s3.amazonaws.com/MGSOURCE/video/2016/toair_w09192016.mp4"
        },
        {
            "title": "09-12-2016",
            "datePublished": "Mon, 12 Sep 2016 15:10:31 +0000",
            "description": "NEW EPISODE: Best and worst words to use for an online dating profile. The influence of movies on the dating culture. Should I let my cheating husband see our daughter? A young man needs advice after he got into fornicating with his girlfriend. Can love grow from friendship rather than physical attraction?",
            "length": "437594919",
            "sourceUrl": "http://media.blubrry.com/mgshow/s3.amazonaws.com/MGSOURCE/video/2016/toair_w09122016.mp4"
        },
        {
            "title": "09-05-2016",
            "datePublished": "Mon, 05 Sep 2016 15:13:08 +0000",
            "description": "NEW EPISODE: Mark discusses the new books he has coming out. A young man wonders if he should confront his future in-laws about their parenting skills. A wife is struggling after her husband’s emotional affair and a couple has issues due to his constant use of the cell phone.",
            "length": "437013265",
            "sourceUrl": "http://media.blubrry.com/mgshow/s3.amazonaws.com/MGSOURCE/video/2016/toair_w09052016.mp4"
        },
        {
            "title": "08-29-2016",
            "datePublished": "Mon, 29 Aug 2016 15:16:08 +0000",
            "description": "NEW EPISODE: Men who marry smart women live longer. What is Mark’s view on older, single people being sexually intimate outside of marriage? How do I deal with my husband’s emotional attachment to another woman? Should families establish the habit of daily bible study and prayer? A wife needs help with her husband’s porn problem. […]",
            "length": "444347055",
            "sourceUrl": "http://media.blubrry.com/mgshow/s3.amazonaws.com/MGSOURCE/video/2016/toair_w08292016.mp4"
        },
        {
            "title": "08-22-2016",
            "datePublished": "Mon, 22 Aug 2016 14:30:18 +0000",
            "description": "4 Fatal Relationship Mistakes. A woman is insecure and jealous about the attention her partner gets from other women. What is an adult child’s role when his parents divorce? A guy wants to learn to laugh more. What is an appropriate age range for one’s “dating pool”? Should I wait to hear a “yes” from […]",
            "length": "356599515",
            "sourceUrl": "http://media.blubrry.com/mgshow/s3.amazonaws.com/MGSOURCE/video/2016/toair_w04252016.mp4"
        },
        {
            "title": "08-15-2016",
            "datePublished": "Mon, 15 Aug 2016 16:05:29 +0000",
            "description": "Is an emotional affair worse than a sexual one? Should a man masturbate before his wedding night to help sustain the act with his bride? Do most people feel financially ready before they have children? A young man has a question about dating a girl he met on the mission field. What is Mark’s view […]",
            "length": "362782346",
            "sourceUrl": "http://media.blubrry.com/mgshow/s3.amazonaws.com/MGSOURCE/video/2016/toair_w04182016.mp4"
        },
        {
            "title": "08-08-2016",
            "datePublished": "Mon, 08 Aug 2016 14:11:23 +0000",
            "description": "3 things women unknowing do that men despise. How can a couple have  a “vacation sex life” everyday? A wife is having issues with her husband’s friendship with his ex. How important is sexual attraction in marriage?",
            "length": "367146513",
            "sourceUrl": "http://media.blubrry.com/mgshow/s3.amazonaws.com/MGSOURCE/video/2016/toair_w04112016.mp4"
        },
        {
            "title": "08-01-2016",
            "datePublished": "Mon, 01 Aug 2016 14:32:09 +0000",
            "description": "You could regret that divorce in five years. The hyperbole of Martin Luther. How do you deal with the “no sex” time after the birth of the baby? My husband thinks I am not allowed to say no to sex. How can I help my wife to learn to be more selfless? A couple of […]",
            "length": "380230388",
            "sourceUrl": "http://media.blubrry.com/mgshow/s3.amazonaws.com/MGSOURCE/video/2016/toair_w04042016.mp4"
        },
        {
            "title": "07-25-2016",
            "datePublished": "Mon, 25 Jul 2016 13:54:19 +0000",
            "description": "5 reasons to ask for your husband’s permission. A wife is heartbroken after her husband won’t reverse his vasectomy to have a child. Can a wife have “me time” apart from her husband? A woman needs advice on how to deal with her husband ogling women at the beach.",
            "length": "378681626",
            "sourceUrl": "http://media.blubrry.com/mgshow/s3.amazonaws.com/MGSOURCE/video/2016/toair_w03282016.mp4"
        },
        {
            "title": "07-18-2016",
            "datePublished": "Mon, 18 Jul 2016 14:33:54 +0000",
            "description": "5 bad habits that can lead to infidelity. At what point should I make my boyfriend a priority over my children? A man is having trouble finding a woman of biblical morals. A guy wonders what to do about his clingy girlfriend.",
            "length": "363367825",
            "sourceUrl": "http://media.blubrry.com/mgshow/s3.amazonaws.com/MGSOURCE/video/2016/toair_w03212016.mp4"
        },
        {
            "title": "07-11-2016",
            "datePublished": "Mon, 11 Jul 2016 15:23:48 +0000",
            "description": "NEW EPISODE: Is porn exposure forcing kids into early sex? How can my husband and I shift our schedules to get more sex in our life? When a couple is apart for military service, is masturbation okay? Should a non-blood relative be referred to as “aunt and uncle”? My husband would rather play video games […]",
            "length": "440923676",
            "sourceUrl": "http://media.blubrry.com/mgshow/s3.amazonaws.com/MGSOURCE/video/2016/toair_w07112016.mp4"
        },
        {
            "title": "07-04-2016",
            "datePublished": "Mon, 04 Jul 2016 15:33:24 +0000",
            "description": "NEW EPISODE: Three phrases to never say to your husband. My wife has lost the “in love” feeling for me…what do I do? Am I weird to feel it’s okay for my husband to have a girlfriend? Do you think people can change their personality traits? Does the Bible tell people to “wait on God” […]",
            "length": "437403088",
            "sourceUrl": "http://media.blubrry.com/mgshow/s3.amazonaws.com/MGSOURCE/video/2016/toair_w07042016.mp4"
        },
        {
            "title": "06-27-2016",
            "datePublished": "Mon, 27 Jun 2016 15:36:55 +0000",
            "description": "NEW EPISODE: What does your phone reveal about your marriage? Is it right to have phone sex with my wife? My husband has low testosterone, won’t have sex with me and won’t get help for it…what do I do? What are first dates like? Are they generally awkward?",
            "length": "434404704",
            "sourceUrl": "http://media.blubrry.com/mgshow/s3.amazonaws.com/MGSOURCE/video/2016/toair_w06272016.mp4"
        },
        {
            "title": "06-20-2016",
            "datePublished": "Mon, 20 Jun 2016 15:39:41 +0000",
            "description": "NEW EPISODE: The power of touch in maintaining a good marital relationship. How can I act respectfully toward my husband when I don’t respect him? A woman needs help dealing with her crazy mother-in-law. How can we more effectively deal with conflict in our marriage? Should I keep pursuing a girl who put me in […]",
            "length": "412989674",
            "sourceUrl": "http://media.blubrry.com/mgshow/s3.amazonaws.com/MGSOURCE/video/2016/toair_w06202016.mp4"
        },
        {
            "title": "06-13-2016",
            "datePublished": "Mon, 13 Jun 2016 15:43:38 +0000",
            "description": "NEW EPISODE: More tips to make your relationship feel like it did in the beginning. A woman writes after she overheard her husband confessing his problem with lust. Do I fake it even if my husband doesn’t “get my motor running”? Must a widow fulfill her husband’s request remarry after he’s gone? Should I confess […]",
            "length": "369653871",
            "sourceUrl": "http://media.blubrry.com/mgshow/s3.amazonaws.com/MGSOURCE/video/2016/toair_w06132016.mp4"
        },
        {
            "title": "06-06-2016",
            "datePublished": "Mon, 06 Jun 2016 15:47:35 +0000",
            "description": "NEW EPISODE: 8 tips to make your relationship feel like it did in the beginning. Should I forgive my wife for her infidelity? A newlywed couple can’t seem to agree on the frequency of sex. A guy and his fiancé disagree about alcohol in the home and a young woman says her boyfriend gets on […]",
            "length": "366063041",
            "sourceUrl": "http://media.blubrry.com/mgshow/s3.amazonaws.com/MGSOURCE/video/2016/toair_w06062016.mp4"
        },
        {
            "title": "05-30-2016",
            "datePublished": "Mon, 30 May 2016 15:50:14 +0000",
            "description": "NEW EPISODE: My husband has a close female friend and I am uncomfortable with their relationship, what do I do? How do I get my husband to go to church with me? What can we do if our sex life is being negatively impacted by our premarital sexual experiences? My husband plays video games I […]",
            "length": "390498011",
            "sourceUrl": "http://media.blubrry.com/mgshow/s3.amazonaws.com/MGSOURCE/video/2016/toair_w05302016.mp4"
        },
        {
            "title": "05-23-2016",
            "datePublished": "Mon, 23 May 2016 15:53:36 +0000",
            "description": "NEW EPISODE: Why women allow their husbands to cheat. A newlywed couple wonders when the fights are going to start. A husband uses Mark to justify his sarcasm toward his wife. How does one know what career path to choose or does God tell you? A wife worries about her husband being stuck in an […]",
            "length": "378642972",
            "sourceUrl": "http://media.blubrry.com/mgshow/s3.amazonaws.com/MGSOURCE/video/2016/toair_w05232016.mp4"
        },
        {
            "title": "05-16-2016",
            "datePublished": "Mon, 16 May 2016 14:10:22 +0000",
            "description": "What men want in the lady of their dreams. What to do when your fiancé won’t say, “I love you.” Can marriages between a Republican and a Democrat work?",
            "length": "383254574",
            "sourceUrl": "http://media.blubrry.com/mgshow/s3.amazonaws.com/MGSOURCE/video/2016/toair_w03142016.mp4"
        },
        {
            "title": "05-09-2016",
            "datePublished": "Mon, 09 May 2016 12:10:41 +0000",
            "description": "40% of U.S. weddings are remarriages. When it is forgiveness and when is it just being a sucker? What should be discussed about sex during premarital instruction? What do Perfect Country people want most in life? Can a couple kiss during dating or will that cross the line to touching?  How can we make our […]",
            "length": "370156113",
            "sourceUrl": "http://media.blubrry.com/mgshow/s3.amazonaws.com/MGSOURCE/video/2016/toair_w03072016.mp4"
        },
        {
            "title": "05-02-2016",
            "datePublished": "Mon, 02 May 2016 14:15:27 +0000",
            "description": "NEW EPISODE: Men battle sexual temptation even after marriage. How can I encourage my husband to slow down and get more involved in foreplay? How do I deal with my husband’s PTSD impacting our marriage? Should I have sex all the time with my husband even if it is extremely painful for me? What Flag […]",
            "length": "351971112",
            "sourceUrl": "http://media.blubrry.com/mgshow/s3.amazonaws.com/MGSOURCE/video/2016/toair_w05022016.mp4"
        },
        {
            "title": "04-25-2016",
            "datePublished": "Mon, 25 Apr 2016 14:42:24 +0000",
            "description": "NEW EPISODE: 4 Fatal Relationship Mistakes. A woman is insecure and jealous about the attention her partner gets from other women. What is an adult child’s role when his parents divorce? A guy wants to learn to laugh more. What is an appropriate age range for one’s “dating pool”? Should I wait to hear a […]",
            "length": "356599515",
            "sourceUrl": "http://media.blubrry.com/mgshow/s3.amazonaws.com/MGSOURCE/video/2016/toair_w04252016.mp4"
        },
        {
            "title": "04-18-2016",
            "datePublished": "Mon, 18 Apr 2016 14:35:11 +0000",
            "description": "NEW EPISODE: Is an emotional affair worse than a sexual one? Should a man masturbate before his wedding night to help sustain the act with his bride? Do most people feel financially ready before they have children? A young man has a question about dating a girl he met on the mission field. What is […]",
            "length": "362782346",
            "sourceUrl": "http://media.blubrry.com/mgshow/s3.amazonaws.com/MGSOURCE/video/2016/toair_w04182016.mp4"
        },
        {
            "title": "04-11-2016",
            "datePublished": "Mon, 11 Apr 2016 15:26:28 +0000",
            "description": "NEW EPISODE: 3 things women unknowing do that men despise. How can a couple have  a “vacation sex life” everyday? A wife is having issues with her husband’s friendship with his ex. How important is sexual attraction in marriage?",
            "length": "367146513",
            "sourceUrl": "http://media.blubrry.com/mgshow/s3.amazonaws.com/MGSOURCE/video/2016/toair_w04112016.mp4"
        },
        {
            "title": "04-04-2016",
            "datePublished": "Mon, 04 Apr 2016 14:09:37 +0000",
            "description": "NEW EPISODE: You could regret that divorce in five years. The hyperbole of Martin Luther. How do you deal with the “no sex” time after the birth of the baby? My husband thinks I can never say no to sex. How can I help my wife to learn to be more selfless? A couple of […]",
            "length": "380230388",
            "sourceUrl": "http://media.blubrry.com/mgshow/s3.amazonaws.com/MGSOURCE/video/2016/toair_w04042016.mp4"
        },
        {
            "title": "03-28-2016",
            "datePublished": "Mon, 28 Mar 2016 14:34:33 +0000",
            "description": "NEW EPISODE: 5 reasons to ask for your husband’s permission. A wife is heartbroken after her husband won’t reverse his vasectomy to have a child. Can a wife have “me time” apart from her husband? A woman needs advice on how to deal with her husband ogling women at the beach.",
            "length": "378681626",
            "sourceUrl": "http://media.blubrry.com/mgshow/s3.amazonaws.com/MGSOURCE/video/2016/toair_w03282016.mp4"
        },
        {
            "title": "03-21-2016",
            "datePublished": "Mon, 21 Mar 2016 13:18:57 +0000",
            "description": "NEW EPISODE: 5 bad habits that can lead to infidelity. At what point should I make my boyfriend a priority over my children? A man is having trouble finding a woman of biblical morals. A guy wonders what to do about his clingy girlfriend.",
            "length": "363367825",
            "sourceUrl": "http://media.blubrry.com/mgshow/s3.amazonaws.com/MGSOURCE/video/2016/toair_w03212016.mp4"
        },
        {
            "title": "03-14-2016",
            "datePublished": "Mon, 14 Mar 2016 14:56:03 +0000",
            "description": "NEW EPISODE: What men want in the lady of their dreams. What to do when your fiancé won’t say, “I love you.” Can marriages between a Republican and a Democrat work?",
            "length": "383254574",
            "sourceUrl": "http://media.blubrry.com/mgshow/s3.amazonaws.com/MGSOURCE/video/2016/toair_w03142016.mp4"
        },
        {
            "title": "03-07-2016",
            "datePublished": "Mon, 07 Mar 2016 15:53:36 +0000",
            "description": "NEW EPISODE: 40% of U.S. weddings are remarriages. When it is forgiveness and when is it just being a sucker? What should be discussed about sex during premarital instruction? What do Perfect Country people want most in life? Can a couple kiss during dating or will that cross the line to touching?  How can we […]",
            "length": "370156113",
            "sourceUrl": "http://media.blubrry.com/mgshow/s3.amazonaws.com/MGSOURCE/video/2016/toair_w03072016.mp4"
        },
        {
            "title": "02-29-2016",
            "datePublished": "Mon, 29 Feb 2016 13:50:18 +0000",
            "description": "NEW EPISODE: Four things you can’t expect your spouse to do for you. A wife needs help dealing with her depressed husband. The importance of having a community and support structure around you.  A couple is trying to find balance in dealing with their finances. A young woman wonders if having sex during her engagement […]",
            "length": "373275760",
            "sourceUrl": "http://media.blubrry.com/mgshow/s3.amazonaws.com/MGSOURCE/video/2016/toair_w02292016.mp4"
        },
        {
            "title": "02-22-2016",
            "datePublished": "Mon, 22 Feb 2016 15:37:31 +0000",
            "description": "NEW EPISODE: Things women shouldn’t say when they catch their husbands with porn. Is respect something that is simply given or must one earn it? A young woman is struggling with same sex attraction. Most Americans have little to no savings…and that’s not a good thing.",
            "length": "371534064",
            "sourceUrl": "http://media.blubrry.com/mgshow/s3.amazonaws.com/MGSOURCE/video/2016/toair_w02222016.mp4"
        },
        {
            "title": "02-15-2016",
            "datePublished": "Mon, 15 Feb 2016 15:49:26 +0000",
            "description": "NEW EPISODE: A company will give you a loan for your wedding…and you only pay it back if you get divorced! Is it okay for young couples getting married to live with their parents to start out? Should you intervene if you know your brother is having an affair? What marriage advice does Mark have […]",
            "length": "372007846",
            "sourceUrl": "http://media.blubrry.com/mgshow/s3.amazonaws.com/MGSOURCE/video/2016/toair_w02152016.mp4"
        },
        {
            "title": "02-08-2016",
            "datePublished": "Mon, 08 Feb 2016 15:04:06 +0000",
            "description": "NEW EPISODE: Are men more engaged with their phones than their families? A wife asks how she can increase her husband’s sex drive. A guy can’t seem to choose between his marriage and his mistress. A young woman wants advice on changing jobs and wondering if it’s God’s calling. How can couples stop fighting over […]",
            "length": "388436953",
            "sourceUrl": "http://media.blubrry.com/mgshow/s3.amazonaws.com/MGSOURCE/video/2016/toair_w02082016.mp4"
        },
        {
            "title": "02-01-2016",
            "datePublished": "Mon, 01 Feb 2016 14:43:10 +0000",
            "description": "NEW EPISODE: Advice to husbands: Stop giving your career and hobbies your best and giving your wife the leftovers. Mark answers a stupid argument about laundry. A guy needs help getting past the sexual rejection from his wife. Is masturbation good for you? Talking about money issues with your spouse. How well should you know […]",
            "length": "377117985",
            "sourceUrl": "http://media.blubrry.com/mgshow/s3.amazonaws.com/MGSOURCE/video/2016/toair_w02012016.mp4"
        },
        {
            "title": "01-25-2016",
            "datePublished": "Mon, 25 Jan 2016 16:45:14 +0000",
            "description": "NEW EPISODE: Things married men need to stop doing–checking out other women and not wearing your wedding ring. Are Christians called to always trust others? How much should a guy care about whether or not his wife reaches orgasm during sex? Can I influence my fiancée to change his health habits or is that just trying […]",
            "length": "401696942",
            "sourceUrl": "http://media.blubrry.com/mgshow/s3.amazonaws.com/MGSOURCE/video/2016/toair_w01252016.mp4"
        },
        {
            "title": "01-18-2016",
            "datePublished": "Mon, 18 Jan 2016 15:03:54 +0000",
            "description": "NEW EPISODE:  9 things married men need to stop doing. A new bride doesn’t want to take her husband’s last name. Is separation just a “pre-divorce?” How does one help someone else stop a porn addiction?",
            "length": "402635929",
            "sourceUrl": "http://media.blubrry.com/mgshow/s3.amazonaws.com/MGSOURCE/video/2016/toair_w01182016.mp4"
        },
        {
            "title": "01-11-2016",
            "datePublished": "Mon, 11 Jan 2016 14:52:47 +0000",
            "description": "NEW EPISODE:  Wrap up of the BEST MARRIAGE ADVICE EVER.  A woman feels more like his mother than his wife. What is a “biblical marriage”? How are Christian marriages supposed to be different from non-Christian marriages? A husband isn’t getting enough sex from his wife. Does age difference matter in dating and marriage? How to […]",
            "length": "354680048",
            "sourceUrl": "http://media.blubrry.com/mgshow/s3.amazonaws.com/MGSOURCE/video/2016/toair_w01112016.mp4"
        },
        {
            "title": "01-04-2016",
            "datePublished": "Mon, 04 Jan 2016 16:00:38 +0000",
            "description": "NEW EPISODE: Best Marriage Advice–Don’t badmouth your spouse. Always wear your wedding ring. A husband constantly tells his wife that she needs a mentor. A wife is concerned with the relationship her husband has with a co-worker. A woman says her husband won’t have sex with her and it constantly leads to fighting. Mark discusses […]",
            "length": "354641228",
            "sourceUrl": "http://media.blubrry.com/mgshow/s3.amazonaws.com/MGSOURCE/video/2016/toair_w01042016.mp4"
        },
        {
            "title": "12-28-2015",
            "datePublished": "Mon, 28 Dec 2015 16:17:55 +0000",
            "description": "NEW EPISODE: More of the best marriage advice. A man needs help because his wife wants a divorce and Mark explains why it’s important to tell other people when you have marriage struggles and not keep it a secret. A husband and wife fight about her hair and make-up. A mom wonders how to deal […]",
            "length": "374466181",
            "sourceUrl": "http://media.blubrry.com/mgshow/s3.amazonaws.com/MGSOURCE/video/2015/toair_w12282015.mp4"
        },
        {
            "title": "12-21-2015",
            "datePublished": "Mon, 21 Dec 2015 15:14:21 +0000",
            "description": "NEW EPISODE: More of the Best Marriage Advice. Is it advisable to barter with your spouse on having another child? How does an idealistic, Perfect-natured person stop being so sensitive and feelings-oriented?  Is having an orgasm the main point of sex? Do couples have to pray aloud together? A woman has issues with her husband’s […]",
            "length": "387223191",
            "sourceUrl": "http://media.blubrry.com/mgshow/s3.amazonaws.com/MGSOURCE/video/2015/toair_w12212015.mp4"
        },
        {
            "title": "12-14-2015",
            "datePublished": "Mon, 14 Dec 2015 21:30:18 +0000",
            "description": "NEW EPISODE:  More of the best marriage advice. A woman is having trouble with the kids and ex of the man she is dating. Advice on how to decrease spending, a man wants Mark’s opinion on vasectomies, and a young woman is torn between two guys she is interested in dating.",
            "length": "379522725",
            "sourceUrl": "http://media.blubrry.com/mgshow/s3.amazonaws.com/MGSOURCE/video/2015/toair_w12142015.mp4"
        },
        {
            "title": "12-07-2015",
            "datePublished": "Mon, 07 Dec 2015 13:06:22 +0000",
            "description": "NEW EPISODE: More of the best marriage advice ever.  A woman wonders if her husband is just sick after 32 years of marriage. A young man wants Marks’s opinion on secret eloping. Can a woman ask a man out for coffee or is it too forward?",
            "length": "375144603",
            "sourceUrl": "http://media.blubrry.com/mgshow/s3.amazonaws.com/MGSOURCE/video/2015/toair_w12072015.mp4"
        },
        {
            "title": "11-30-2015",
            "datePublished": "Mon, 30 Nov 2015 14:39:41 +0000",
            "description": "NEW EPISODE:  More of the best marriage advice ever. A woman wonders if she should use prayer like in the movie “War Room” to solve her marriage issues.  Mark talks about the “peace natured” people of the world and how they can best function in relationships. A young woman wonders why God would send her […]",
            "length": "367114660",
            "sourceUrl": "http://media.blubrry.com/mgshow/s3.amazonaws.com/MGSOURCE/video/2015/toair_w11302015.mp4"
        },
        {
            "title": "11-23-2016",
            "datePublished": "Mon, 23 Nov 2015 14:08:44 +0000",
            "description": "NEW EPISODE: The best marriage advice ever.  Is it always God’s will for marriage to be restored? Why don’t pastors discuss money during premarital sessions? Mark uses a couple’s Flag Pages to help them deal with issues of respect in their marriage. Is it wrong for an Evangelical Christian to marry a Catholic?",
            "length": "373361215",
            "sourceUrl": "http://media.blubrry.com/mgshow/s3.amazonaws.com/MGSOURCE/video/2015/toair_w11232015.mp4"
        },
        {
            "title": "11-16-2015",
            "datePublished": "Mon, 16 Nov 2015 14:46:18 +0000",
            "description": "NEW EPISODE: 4 thoughts that harm your marriage. A couple is fighting over starting a family: She wants kids and he doesn’t. What do men look for in a future spouse? A wife is frustrated  because her husband isn’t open about how he handles their money. A couple is worried about their daughter’s over-controlling fiancé.",
            "length": "370758370",
            "sourceUrl": "http://media.blubrry.com/mgshow/s3.amazonaws.com/MGSOURCE/video/2015/toair_w11162015.mp4"
        },
        {
            "title": "11-09-2015",
            "datePublished": "Mon, 09 Nov 2015 15:13:51 +0000",
            "description": "NEW EPISODE: How to get past a nasty fight. A wife feels like something is missing in her marriage because her mind wanders during sex. A man needs help with his wife’s spending habits. Mark uses the Flag Page to help a couple with communication issues. Should I tell the guy I’m dating that I’m […]",
            "length": "354570851",
            "sourceUrl": "http://media.blubrry.com/mgshow/s3.amazonaws.com/MGSOURCE/video/2015/toair_w11092015.mp4"
        },
        {
            "title": "11-02-2015",
            "datePublished": "Mon, 02 Nov 2015 13:47:48 +0000",
            "description": "NEW EPISODE: Husbands can be nagged to death? What is an emotional affair and what should a concerned spouse do about it? What is a wife to do when the husband takes control of all their money? Should a guy always “lead” in the dating relationship?",
            "length": "356908756",
            "sourceUrl": "http://media.blubrry.com/mgshow/s3.amazonaws.com/MGSOURCE/video/2015/toair_w11022015.mp4"
        },
        {
            "title": "10-26-2015",
            "datePublished": "Mon, 26 Oct 2015 13:38:53 +0000",
            "description": "NEW EPISODE of The Mark Gungor Show: Pet peeves of middle-aged women's online dating profiles. Mark discusses the surprising results of his recent marriage survey.",
            "length": "349977827",
            "sourceUrl": "http://media.blubrry.com/mgshow/s3.amazonaws.com/MGSOURCE/video/2015/toair_w10262015.mp4"
        },
        {
            "title": "10-19-2015",
            "datePublished": "Mon, 19 Oct 2015 14:24:05 +0000",
            "description": "NEW EPISODE: Pet peeves about middle-aged men’s online dating profiles.  Are all second marriages not “true covenant” marriages? What questions should a woman ask a man she is dating to see if he is truly born again? A man needs help dealing with conflict. Another man wants to know how to deal with his sister […]",
            "length": "363988943",
            "sourceUrl": "http://media.blubrry.com/mgshow/s3.amazonaws.com/MGSOURCE/video/2015/toair_w10192015.mp4"
        },
        {
            "title": "10-12-2015",
            "datePublished": "Mon, 12 Oct 2015 13:33:08 +0000",
            "description": "NEW EPISODE: The happiest parents have 4 or more children. How can a woman discern a man’s true character and not be fooled when he is faking the godly lifestyle? How do I handle my boyfriend who says he never wants to marry? Should I always try to look good for my husband even if […]",
            "length": "379274981",
            "sourceUrl": "http://media.blubrry.com/mgshow/s3.amazonaws.com/MGSOURCE/video/2015/toair_w10122015.mp4"
        },
        {
            "title": "10-05-2015",
            "datePublished": "Mon, 05 Oct 2015 14:36:55 +0000",
            "description": "NEW EPISODE: What higher sex drive spouses wish their lower sex drive spouses knew. A dad wants to know if they should tell their teens that they didn’t wait for marriage to have sex. A husband needs help because his wife throws up too many roadblocks to sex. How does one discover his calling in […]",
            "length": "376829483",
            "sourceUrl": "http://media.blubrry.com/mgshow/s3.amazonaws.com/MGSOURCE/video/2015/toair_w10052015.mp4"
        },
        {
            "title": "09-28-2015",
            "datePublished": "Mon, 28 Sep 2015 14:53:36 +0000",
            "description": "Ten reasons why couples stay in troubled marriages. Can a wife demand that her husband does a porn treatment program? A man wonders if he missed his youth by remaining abstinent. Is it possible for men and women to be “just friends”? How do I get over the guilt of my divorce? Should grown children […]",
            "length": "378012795",
            "sourceUrl": "http://media.blubrry.com/mgshow/s3.amazonaws.com/MGSOURCE/video/2015/toair_w05252015.mp4"
        },
        {
            "title": "09-21-2015",
            "datePublished": "Mon, 21 Sep 2015 15:44:54 +0000",
            "description": "5 horrible pieces of dating advice. A husband wonders if he should give his wife the separation that she wants. Is online dating a good option? Should couples use fertility treatments? A wife wants to know if it makes her selfish if she leaves her husband after six years of marriage.",
            "length": "391492049",
            "sourceUrl": "http://media.blubrry.com/mgshow/s3.amazonaws.com/MGSOURCE/video/2015/toair_w05182015.mp4"
        },
        {
            "title": "09-14-2015",
            "datePublished": "Mon, 14 Sep 2015 17:00:51 +0000",
            "description": "Is separating worse than divorce? A mom needs help after her teenage daughter confesses to having sex. A husband wants to know if he should give up a job opportunity so his wife doesn’t have to move away from her family. A wife has racist in-laws and another has a badly behaving husband.",
            "length": "356886567",
            "sourceUrl": "http://media.blubrry.com/mgshow/s3.amazonaws.com/MGSOURCE/video/2015/toair_w05112015.mp4"
        },
        {
            "title": "09-08-2015",
            "datePublished": "Tue, 08 Sep 2015 14:40:09 +0000",
            "description": "A bride swaps her groom for another wedding guest mid-ceremony. An African listener has a question about the tradition of paying a dowry.  A woman wonders how handle the issue of spouses attending separate churches. A parent wants to know about “shunning” Christians for bad behavior and a husband is upset over his wife’s modesty […]",
            "length": "355547512",
            "sourceUrl": "http://media.blubrry.com/mgshow/s3.amazonaws.com/MGSOURCE/video/2015/toair_w05042015.mp4"
        },
        {
            "title": "08-31-2015",
            "datePublished": "Mon, 31 Aug 2015 13:02:22 +0000",
            "description": "NEW EPISODE: 3 things I wish my parents had told me about sex. A mom and dad disagree about what music their teenage daughter should listen to. A wife wonders what her responsibility is to her diabetic husband who refuses to seek treatment for his illness. What is Mark’s advice for someone who is not […]",
            "length": "352159196",
            "sourceUrl": "http://media.blubrry.com/mgshow/s3.amazonaws.com/MGSOURCE/video/2015/toair_w08312015.mp4"
        },
        {
            "title": "08-24-2015",
            "datePublished": "Mon, 24 Aug 2015 14:45:10 +0000",
            "description": "NEW EPISODE:  5 signs the guy won’t marry you. How much does chemistry matter when choosing a spouse? A young woman needs help with her controlling and paranoid fiance. A wife is betrayed by her husband who fathered a child during a time of separation. Does a husband have a right to read emails and […]",
            "length": "357129183",
            "sourceUrl": "http://media.blubrry.com/mgshow/s3.amazonaws.com/MGSOURCE/video/2015/toair_w08242015.mp4"
        },
        {
            "title": "08-17-2015",
            "datePublished": "Mon, 17 Aug 2015 15:39:47 +0000",
            "description": "NEW EPISODE: When do people feel most attracted to their spouses? A young woman has to choose between two different guys. How can I help educate my male friends so they won’t be such buffoons around girls? A husband and wife disagree on where to live. A woman has great guilt over her past sins. […]",
            "length": "353343276",
            "sourceUrl": "http://media.blubrry.com/mgshow/s3.amazonaws.com/MGSOURCE/video/2015/toair_w08172015.mp4"
        },
        {
            "title": "08-10-2015",
            "datePublished": "Mon, 10 Aug 2015 14:19:56 +0000",
            "description": "NEW EPISODE: The most popular pieces of bad marriage advice. A pastor’s wife has problems with her husband. A man wants to know if separation works to save the marriage when it’s the wife behaving badly. Does forgiveness require reconciliation of a relationship? Should a husband or wife tell their spouse of a past transgression […]",
            "length": "357234041",
            "sourceUrl": "http://media.blubrry.com/mgshow/s3.amazonaws.com/MGSOURCE/video/2015/toair_w08102015.mp4"
        },
        {
            "title": "08-03-2015",
            "datePublished": "Mon, 03 Aug 2015 13:54:21 +0000",
            "description": "NEW EPISODE: Parents should talk to their kids about porn. A wife is desperate to help her failing 26-year marriage. How long does it take for the pain to ease after a breakup? What does Mark think about the condition of Low-T? Should you wait for God’s timing and pray for the girl He has […]",
            "length": "360681753",
            "sourceUrl": "http://media.blubrry.com/mgshow/s3.amazonaws.com/MGSOURCE/video/2015/toair_w08032015.mp4"
        },
        {
            "title": "07-27-2015",
            "datePublished": "Mon, 27 Jul 2015 14:58:23 +0000",
            "description": "NEW EPISODE: Four things every husband should say to his wife.  A young girl wonders how to deal with her emerging hormones. A man is concerned after a male friend attempted to kiss his wife. A listener has questions about his honeymoon being less than enjoyable. A guy wants to know how to become “unaddicted” […]",
            "length": "349639782",
            "sourceUrl": "http://media.blubrry.com/mgshow/s3.amazonaws.com/MGSOURCE/video/2015/toair_w07272015.mp4"
        },
        {
            "title": "07-20-2015",
            "datePublished": "Mon, 20 Jul 2015 15:38:19 +0000",
            "description": "NEW EPISODE: Five biggest mistakes a mother-in-law can make. A wife in a troubled marriage wants out and is looking for peace. A husband has issues with his wife mooching from his plate. What scripture is there that backs up kicking a spouse out for bad behavior? A woman wonders if her fiance is too […]",
            "length": "357731373",
            "sourceUrl": "http://media.blubrry.com/mgshow/s3.amazonaws.com/MGSOURCE/video/2015/toair_w07202015.mp4"
        },
        {
            "title": "07-13-2015",
            "datePublished": "Mon, 13 Jul 2015 15:22:37 +0000",
            "description": "NEW EPISODE: The 5 biggest mistakes a daughter-in-law can make. A young married couple has issues living with the parents. Does a long distance relationship hurt your marriage? Does a 20 year age gap make for a more difficult marriage? Should guys wait for marriage until they control their porn habit? Is body painting pornography? […]",
            "length": "361174777",
            "sourceUrl": "http://media.blubrry.com/mgshow/s3.amazonaws.com/MGSOURCE/video/2015/toair_w07132015.mp4"
        },
        {
            "title": "07-06-2015",
            "datePublished": "Mon, 06 Jul 2015 15:08:24 +0000",
            "description": "NEW EPISODE: Reasons why men won’t marry. Parents are concerned that the guy their daughter wants to marry doesn’t have a job. A young lady wonders about communication differences between men and women. A divorced dad has a parenting question. A wife is bothered because she and her husband sleep in separate beds. Is porn […]",
            "length": "374023676",
            "sourceUrl": "http://media.blubrry.com/mgshow/s3.amazonaws.com/MGSOURCE/video/2015/toair_w07062015.mp4"
        },
        {
            "title": "06-29-2015",
            "datePublished": "Mon, 29 Jun 2015 14:02:17 +0000",
            "description": "NEW EPISODE: Why do most people regret getting divorced? A young man can’t get over the loss of his girlfriend, a wife needs help with her non-existent sex life, and another wife asks for advice on dealing with her husband’s lying problem. An emailer wants Mark’s opinion on eloping and a couple is concerned about […]",
            "length": "349296389",
            "sourceUrl": "http://media.blubrry.com/mgshow/s3.amazonaws.com/MGSOURCE/video/2015/toair_w06292015.mp4"
        },
        {
            "title": "06-22-2015",
            "datePublished": "Mon, 22 Jun 2015 14:53:40 +0000",
            "description": "NEW EPISODE: What does it say about couples who “over share” on Facebook? Is it possible to get married too soon? How can I get over feelings of resentment toward my wife because she only wants to have one child? Is there a way to balance all the demands on a wife and mother? A […]",
            "length": "387916842",
            "sourceUrl": "http://media.blubrry.com/mgshow/s3.amazonaws.com/MGSOURCE/video/2015/toair_w06222015.mp4"
        },
        {
            "title": "06-15-2015",
            "datePublished": "Mon, 15 Jun 2015 14:09:04 +0000",
            "description": "NEW EPISODE: Is a trip to IKEA the best test for your dating relationship? A pastor is frustrated by his critical wife. Why the difference in men and women’s sexual peaks? How do men learn to be good lovers to their wives? Is virtual cheating the same as actual cheating? How do I deal with […]",
            "length": "379648026",
            "sourceUrl": "http://media.blubrry.com/mgshow/s3.amazonaws.com/MGSOURCE/video/2015/toair_w06152015.mp4"
        },
        {
            "title": "06-08-2015",
            "datePublished": "Mon, 08 Jun 2015 14:55:43 +0000",
            "description": "NEW EPISODE:  Why do couples remember two different versions of an event? How do I deal with my husband’s annoying habits? A woman who has recently become a Christian is struggling with cohabiting with her man now that she’s saved.  A wife needs help dealing with her husband’s bad breath. How do I deal with […]",
            "length": "389084491",
            "sourceUrl": "http://media.blubrry.com/mgshow/s3.amazonaws.com/MGSOURCE/video/2015/toair_w06082015.mp4"
        },
        {
            "title": "06-01-2015",
            "datePublished": "Mon, 01 Jun 2015 15:04:18 +0000",
            "description": "NEW EPISODE: Do not get married unless you ask these 15 questions. A woman fixes her sexless marriage. Are “alternative forms” of sex ok? Should an adult child confront her father’s infidelity? What about dating a divorced person? How much say do parents have over the dating decisions of their adult kids?",
            "length": "378539081",
            "sourceUrl": "http://media.blubrry.com/mgshow/s3.amazonaws.com/MGSOURCE/video/2015/toair_w06012015.mp4"
        },
        {
            "title": "05-25-2015",
            "datePublished": "Mon, 25 May 2015 15:17:36 +0000",
            "description": "NEW EPISODE: Ten reasons why couples stay in troubled marriages. Can a wife demand that her husband does a porn treatment program? A man wonders if he missed his youth by remaining abstinent. Is it possible for men and women to be “just friends”? How do I get over the guilt of my divorce? Should […]",
            "length": "378012795",
            "sourceUrl": "http://media.blubrry.com/mgshow/s3.amazonaws.com/MGSOURCE/video/2015/toair_w05252015.mp4"
        },
        {
            "title": "05-18-2015",
            "datePublished": "Mon, 18 May 2015 16:11:25 +0000",
            "description": "NEW EPISODE! 5 horrible pieces of dating advice. A husband wonders if he should give his wife the separation that she wants. Is online dating a good option? Should couples use fertility treatments? A wife wants to know if it makes her selfish if she leaves her husband after six years of marriage.",
            "length": "391492049",
            "sourceUrl": "http://media.blubrry.com/mgshow/s3.amazonaws.com/MGSOURCE/video/2015/toair_w05182015.mp4"
        },
        {
            "title": "05-11-2015",
            "datePublished": "Mon, 11 May 2015 14:40:26 +0000",
            "description": "NEW SHOW! Is separating worse than divorce? A mom needs help after her teenage daughter confesses to having sex. A husband wants to know if he should give up a job opportunity so his wife doesn’t have to move away from her family. A wife has racist in-laws and another has a badly behaving husband.",
            "length": "356886567",
            "sourceUrl": "http://media.blubrry.com/mgshow/s3.amazonaws.com/MGSOURCE/video/2015/toair_w05112015.mp4"
        },
        {
            "title": "05-04-2015",
            "datePublished": "Mon, 04 May 2015 14:50:13 +0000",
            "description": "NEW EPISODE! A bride swaps her groom for another wedding guest mid-ceremony. An African listener has a question about the tradition of paying a dowry.  A woman wonders how handle the issue of spouses attending separate churches. A parent wants to know about “shunning” Christians for bad behavior and a husband is upset over his […]",
            "length": "355547512",
            "sourceUrl": "http://media.blubrry.com/mgshow/s3.amazonaws.com/MGSOURCE/video/2015/toair_w05042015.mp4"
        },
        {
            "title": "04-27-2015",
            "datePublished": "Mon, 27 Apr 2015 15:04:48 +0000",
            "description": "BEST OF THE MARK GUNGOR SHOW:  How is the “guyological clock” changing the dating game? What can a couple do when they have “outgrown” each other? What is an appropriate age for children to stop breastfeeding?",
            "length": "361250899",
            "sourceUrl": "http://media.blubrry.com/mgshow/s3.amazonaws.com/MGSOURCE/video/2015/bestof_04272015.mp4"
        },
        {
            "title": "04-20-2015",
            "datePublished": "Mon, 20 Apr 2015 14:28:04 +0000",
            "description": "THE BEST OF THE MARK GUNGOR SHOW: Mark and crew start out discussing a great article: Underage Dating: The Elephant in the Social Conservative Living Room. Then they answer emails: A husband wants to know if women really don’t want to have sex as often as men do, a woman wonders if  in vitro fertilization is […]",
            "length": "373058519",
            "sourceUrl": "http://media.blubrry.com/mgshow/s3.amazonaws.com/MGSOURCE/video/2015/bestof_04202015.mp4"
        },
        {
            "title": "04-13-2015",
            "datePublished": "Mon, 13 Apr 2015 14:34:59 +0000",
            "description": "THE BEST OF THE MARK GUNGOR SHOW: Jail time for striking your wife with genitalia? How many things do you need to be attracted to in a person to know they are the one to marry? Is it a sin to be attracted to another person if you are already in a relationship? If I’ve broken […]",
            "length": "368621139",
            "sourceUrl": "http://media.blubrry.com/mgshow/s3.amazonaws.com/MGSOURCE/video/2015/bestof_04132015.mp4"
        },
        {
            "title": "04-06-2015",
            "datePublished": "Mon, 06 Apr 2015 17:52:52 +0000",
            "description": "BEST OF THE MARK GUNGOR SHOW: What is the definition of cheating? How can I get my second husband to support me in the care of my grandchildren when he sees them as a complication to our life? Should I stay single for life after a serious porn and masturbation problem? A 58 year old man […]",
            "length": "357484004",
            "sourceUrl": "http://media.blubrry.com/mgshow/s3.amazonaws.com/MGSOURCE/video/2015/bestof_04062015.mp4"
        },
        {
            "title": "03-30-2015",
            "datePublished": "Mon, 30 Mar 2015 14:36:31 +0000",
            "description": "BEST OF THE MARK GUNGOR SHOW: A Chinese woman kills  a man squeezing his testicles during a dispute over a parking place!  Mark answers emails: Is it wrong to use natural childbirth methods practice by pagans and Buddhists? How do I get rid of demons and spirits of lust from porn use?  Mark and crew […]",
            "length": "370414794",
            "sourceUrl": "http://media.blubrry.com/mgshow/s3.amazonaws.com/MGSOURCE/video/2015/bestof_03302015.mp4"
        },
        {
            "title": "03-23-2015",
            "datePublished": "Mon, 23 Mar 2015 14:10:57 +0000",
            "description": "A BEST OF THE MARK GUNGOR SHOW: “Chaste and Germains” What chaste activity is “better than sex”? What is the purpose of sex in marriage? Should unmarried couples be allowed in a marriage class? And a listener asks Mark to warn others of the dangers of auto-erotic asphyxiation.",
            "length": "351287811",
            "sourceUrl": "http://media.blubrry.com/mgshow/s3.amazonaws.com/MGSOURCE/video/2015/bestof_03232015.mp4"
        },
        {
            "title": "03-16-2015",
            "datePublished": "Mon, 16 Mar 2015 13:37:31 +0000",
            "description": "It’s a BEST OF THE MARK GUNGOR SHOW:  What’s a “consorce”…the alternative to a divorce? What can I do to deal with my husband’s lack of showering? How do I get forgiveness for having premarital sex in our relationship?",
            "length": "352746149",
            "sourceUrl": "http://media.blubrry.com/mgshow/s3.amazonaws.com/MGSOURCE/video/2015/bestof_03162015.mp4"
        },
        {
            "title": "03-09-2015",
            "datePublished": "Mon, 09 Mar 2015 17:00:38 +0000",
            "description": "A BEST OF THE MARK GUNGOR SHOW episode! What are ten personality traits that try marriages? Does porn and masturbation have the same imprinting consequences as premarital sex?  How can I deal with my husband who is not providing financially for our family? Should I dump my boyfriend for being rude to me? How do […]",
            "length": "374806238",
            "sourceUrl": "http://media.blubrry.com/mgshow/s3.amazonaws.com/MGSOURCE/video/2015/bestof_03092015.mp4"
        },
        {
            "title": "03-02-2015",
            "datePublished": "Mon, 02 Mar 2015 16:00:03 +0000",
            "description": "This week’s show is a BEST OF episode: “The Acceptable Receptacle” 6 signs you are a bad lover. Should Christians engage in oral and anal sex? A woman is afraid her husband is having an affair.",
            "length": "361868654",
            "sourceUrl": "http://media.blubrry.com/mgshow/s3.amazonaws.com/MGSOURCE/video/2015/bestof_03022015.mp4"
        },
        {
            "title": "02-23-2015",
            "datePublished": "Mon, 23 Feb 2015 17:01:01 +0000",
            "description": "Today is a BEST OF THE MARK GUNGOR SHOW: The BAGPIPING SHOW! Having high expectations about marriage could lead to unhappiness. A couple has differing opinions on oral sex. A mom has questions about boyfriend/girlfriend sleepovers. Mark’s opinion on homeschooling. What to do when your calling/purposes don’t match up.",
            "length": "367058180",
            "sourceUrl": "http://media.blubrry.com/mgshow/s3.amazonaws.com/MGSOURCE/video/2015/bestof_02232015.mp4"
        },
        {
            "title": "02-16-2015",
            "datePublished": "Mon, 16 Feb 2015 18:21:48 +0000",
            "description": "Today is a BEST OF THE MARK GUNGOR SHOW: Is it really impossible for men to resist sexual temptation? Can you still have oral sex if you pledge to be abstinent?  Are traditional marriage vows necessary or can couples write their own? What should we do about our fornicating youth leader?",
            "length": "364846959",
            "sourceUrl": "http://media.blubrry.com/mgshow/s3.amazonaws.com/MGSOURCE/video/2015/bestof_02162015.mp4"
        },
        {
            "title": "02-09-2015",
            "datePublished": "Mon, 09 Feb 2015 16:23:25 +0000",
            "description": "Today is a BEST OF THE MARK GUNGOR show: “What would Jesus say?”  Also, a young woman wants to know how to react after a heavy make out session with the youth pastor.",
            "length": "366459307",
            "sourceUrl": "http://media.blubrry.com/mgshow/s3.amazonaws.com/MGSOURCE/video/2015/bestof_02092015.mp4"
        },
        {
            "title": "01-19-2015",
            "datePublished": "Mon, 19 Jan 2015 15:34:59 +0000",
            "description": "NEW EPISODE:  Five ways you are unknowingly destroying your husband and killing your marriage. How can I convince my spouse to attend one of Mark’s seminars? Should I date a Catholic guy if I am not Catholic? How do I respect my porn-viewing husband when he doesn’t deserve the respect? How do I move past […]",
            "length": "349530177",
            "sourceUrl": "http://media.blubrry.com/mgshow/s3.amazonaws.com/MGSOURCE/video/2015/toair_w01192015.mp4"
        },
        {
            "title": "01-12-2015",
            "datePublished": "Mon, 12 Jan 2015 15:25:59 +0000",
            "description": "NEW EPISODE: 9 Chivalrous Habits of a True Gentleman That Make Women Melt. A divorced woman has concerns about the man she is dating because he can’t seem to live a Godly life without her help. A military wife needs advice about finding a church to attend that both she and her husband agree upon.",
            "length": "350381107",
            "sourceUrl": "http://media.blubrry.com/mgshow/s3.amazonaws.com/MGSOURCE/video/2015/toair_w01122015.mp4"
        },
        {
            "title": "01-05-2015",
            "datePublished": "Mon, 05 Jan 2015 19:43:40 +0000",
            "description": "NEW EPISODE: Reasons people reject marriage proposals. A husband can’t have sex at all with his wife. A Christian girl is having trouble because she attracts heathens. A newlywed couple has an issue over oral sex. A man needs advice on how to deal with his “ultra-religious, self-righteous, perfectionist” mother.",
            "length": "359078118",
            "sourceUrl": "http://media.blubrry.com/mgshow/s3.amazonaws.com/MGSOURCE/video/2015/toair_w01052015.mp4"
        },
        {
            "title": "12-29-2014",
            "datePublished": "Mon, 29 Dec 2014 15:31:35 +0000",
            "description": "NEW EPISODE: Once a cheater always a cheater?  Is it right to leave everything for the sake of the gospel–including my wife?  How do I get my fiance to understand that all men deal with temptation? Is is okay for a Christian couple to live together before marriage as long as they don’t have sex? […]",
            "length": "363964024",
            "sourceUrl": "http://media.blubrry.com/mgshow/s3.amazonaws.com/MGSOURCE/video/2014/toair_w12292014.mp4"
        },
        {
            "title": "12-22-2014",
            "datePublished": "Mon, 22 Dec 2014 15:21:33 +0000",
            "description": "NEW EPISODE: The smaller the engagement ring, the more successful the marriage? A husband needs help dealing with his wife who won’t have sex with him.",
            "length": "296364725",
            "sourceUrl": "http://media.blubrry.com/mgshow/s3.amazonaws.com/MGSOURCE/video/2014/toair_w12222014.mp4"
        },
        {
            "title": "12-15-2014",
            "datePublished": "Mon, 15 Dec 2014 15:30:20 +0000",
            "description": "NEW EPISODE: Four expectations that can injure a good marriage. A wife is having unwanted sexual dreams. How does a family deal with a father’s affair?  A woman is suspicious of her husband’s behavior. A wife has a question about “old people sex” and another has concerns regarding the impact her disability is having on […]",
            "length": "296360360",
            "sourceUrl": "http://media.blubrry.com/mgshow/s3.amazonaws.com/MGSOURCE/video/2014/toair_w12152014.mp4"
        },
        {
            "title": "12-08-2014",
            "datePublished": "Mon, 08 Dec 2014 15:47:59 +0000",
            "description": "NEW EPISODE: The truth about the female orgasm. Does the “honeymoon phase” end? Should a Christian date someone of a different faith? Should I date a guy who wants to experiment with drugs while he’s young? A guy is very specific with his prayer request for a wife!",
            "length": "296198894",
            "sourceUrl": "http://media.blubrry.com/mgshow/s3.amazonaws.com/MGSOURCE/video/2014/toair_w12082014.mp4"
        },
        {
            "title": "12-01-2014",
            "datePublished": "Mon, 01 Dec 2014 15:51:48 +0000",
            "description": "NEW EPISODE: Do married women have a “backup husband” in mind? Why is it a bad idea for parents of teens to date and remarry? Is it possible for a man to be weaned off sex? How fast is too fast to start dating again after a divorce? How do we handle sex in our […]",
            "length": "351846113",
            "sourceUrl": "http://media.blubrry.com/mgshow/s3.amazonaws.com/MGSOURCE/video/2014/toair_w12012014.mp4"
        },
        {
            "title": "11-24-2014",
            "datePublished": "Mon, 24 Nov 2014 15:30:46 +0000",
            "description": "NEW EPISODE: Naked church services. Wearing a white wedding dress. Encouraging modesty. Feeling attracted to someone who is not your spouse. Improving your husband’s memory. Differing sex needs.",
            "length": "351368078",
            "sourceUrl": "http://media.blubrry.com/mgshow/s3.amazonaws.com/MGSOURCE/video/2014/toair_w11242014.mp4"
        },
        {
            "title": "11-17-2014",
            "datePublished": "Mon, 17 Nov 2014 15:30:00 +0000",
            "description": "NEW EPISODE: Should Christians attend a same sex wedding? Is staying together for the kids a good idea? A Christian father needs help raising his son with his atheist wife. A family is debating circumcision. Do women respond to consequences the same way men do?",
            "length": "338277221",
            "sourceUrl": "http://media.blubrry.com/mgshow/s3.amazonaws.com/MGSOURCE/video/2014/toair_w11172014.mp4"
        },
        {
            "title": "11-10-2014",
            "datePublished": "Mon, 10 Nov 2014 16:05:28 +0000",
            "description": "NEW EPISODE:  What kind of cancers are on the rise among young adults? Should a wife entertain her husband with lap dances? Should you always tell your spouse about an affair? What are the pros and cons of older women dating younger men? What questions should you ask during the premarital phase? How can a […]",
            "length": "353187931",
            "sourceUrl": "http://media.blubrry.com/mgshow/s3.amazonaws.com/MGSOURCE/video/2014/toair_w11102014.mp4"
        },
        {
            "title": "11-03-2014",
            "datePublished": "Mon, 03 Nov 2014 15:54:14 +0000",
            "description": "NEW EPISODE: Poached partners make unreliable mates. Can long distance relationships work? A wife needs advice because her husband doesn’t want any “couple friends”. Is painting the nude form ok for Christians who are artists? A wife needs help after she had an affair. A guy isn’t sexually attracted to the girl he wants to […]",
            "length": "296972651",
            "sourceUrl": "http://media.blubrry.com/mgshow/s3.amazonaws.com/MGSOURCE/video/2014/toair_w11032014.mp4"
        },
        {
            "title": "10-27-2014",
            "datePublished": "Mon, 27 Oct 2014 14:41:30 +0000",
            "description": "NEW EPISODE: A husband who “just lost it” after years of a nagging wife. Do men who don’t want sex with their wives get it somewhere else? Should you save your first kiss for your wedding day? A wife is frustrated by her husband’s cussing. Should a spouse always tell of their whereabouts? A wife […]",
            "length": "296745090",
            "sourceUrl": "http://media.blubrry.com/mgshow/s3.amazonaws.com/MGSOURCE/video/2014/toair_w10272014.mp4"
        },
        {
            "title": "10-20-2014",
            "datePublished": "Mon, 20 Oct 2014 14:29:22 +0000",
            "description": "NEW EPISODE!! Five bad reasons to get married. How can a spouse defuse an argument quickly? Should a husband be telling other women that he “loves” them? Is it selfish to not want children? Is sexting with your spouse ok? Is middle of the night sex a requirement for women? How can women get over […]",
            "length": "357993700",
            "sourceUrl": "http://media.blubrry.com/mgshow/s3.amazonaws.com/MGSOURCE/video/2014/toair_w10202014.mp4"
        },
        {
            "title": "10-13-2014",
            "datePublished": "Mon, 13 Oct 2014 14:24:51 +0000",
            "description": "Is a “Snuggle House” a legitimate business? Should wives have babies to try to improve their marriage or make them happy? What do I do when my husband forgets all the special occasions in our life? A listener wonders if there will be sex in heaven? A wife wants suggestions on how to get the […]",
            "length": "387944616",
            "sourceUrl": "http://media.blubrry.com/mgshow/s3.amazonaws.com/MGSOURCE/video/2014/toair_w01062014.mp4"
        },
        {
            "title": "10-06-2014",
            "datePublished": "Mon, 06 Oct 2014 14:28:04 +0000",
            "description": "6 signs you are a bad lover. Should Christians engage in oral and anal sex? A woman is afraid her husband is having an affair.",
            "length": "371293370",
            "sourceUrl": "http://media.blubrry.com/mgshow/s3.amazonaws.com/MGSOURCE/video/2013/Weekly/toair_w12302013.mp4"
        },
        {
            "title": "09-29-2014",
            "datePublished": "Mon, 29 Sep 2014 15:30:15 +0000",
            "description": "Reason to dump his butt when dating.  Can I check my husband’s cell phone? A young man needs help with finding a girl for his arranged marriage.  A mom is torn between working and being a stay at home mom. A wife is struggling with her commuter marriage.",
            "length": "357380457",
            "sourceUrl": "http://media.blubrry.com/mgshow/s3.amazonaws.com/MGSOURCE/video/2013/Weekly/toair_w12232013.mp4"
        },
        {
            "title": "09-22-2014",
            "datePublished": "Mon, 22 Sep 2014 15:30:12 +0000",
            "description": "Are nice people more attractive? Mark answers the “creepiest email ever” from a guy who has issues with his wife’s weight and problems with his children.  A mom wonders when she has to conceal her breastfeeding and other chance exposures from her children. A couple of women want to know if the effects of masturbation […]",
            "length": "367936435",
            "sourceUrl": "http://media.blubrry.com/mgshow/s3.amazonaws.com/MGSOURCE/video/2013/Weekly/toair_w12162013.mp4"
        },
        {
            "title": "09-15-2014",
            "datePublished": "Mon, 15 Sep 2014 15:22:34 +0000",
            "description": "Biblical (and hilarious) ways to find a spouse. A wife can’t enjoy sex with her husband without some kind of fantasy, a listener wants to know what kinds of sexual sin needs to be confessed to your spouse, and a woman has questions about the sincerity of her husband’s desire to reconcile. Is it unbiblical […]",
            "length": "352573891",
            "sourceUrl": "http://media.blubrry.com/mgshow/s3.amazonaws.com/MGSOURCE/video/2013/Weekly/toair_w12092013.mp4"
        },
        {
            "title": "09-08-2014",
            "datePublished": "Mon, 08 Sep 2014 14:24:37 +0000",
            "description": "Be-Attitudes of Marriage: When Jesus sat down for his amazing Sermon on the Mount, he began by sharing nine simple truths: Blessed are the poor in spirit, blessed are those that mourn, blessed are the meek, etc… we call them the “beatitudes”. Mark shares his “Nine Be-Attitudes” for a successful marriage. Nine ways for you […]",
            "length": "391234354",
            "sourceUrl": "http://media.blubrry.com/mgshow/s3.amazonaws.com/MGSOURCE/video/2013/Weekly/toair_w12022013.mp4"
        },
        {
            "title": "09-01-2014",
            "datePublished": "Mon, 01 Sep 2014 14:25:34 +0000",
            "description": "London firefighters advise: Don’t put your penis in a toaster. Why are second marriages so difficult for kids? Is sex during the menstrual period morally wrong? How can I find a guy to marry when dating is discouraged at my church?",
            "length": "389287575",
            "sourceUrl": "http://media.blubrry.com/mgshow/s3.amazonaws.com/MGSOURCE/video/2013/Weekly/toair_w11252013.mp4"
        },
        {
            "title": "08-25-2014",
            "datePublished": "Mon, 25 Aug 2014 15:30:29 +0000",
            "description": "Mark comments about one California county that offers free home STD tests.  A listener asks about “Christian naturism or nudism”. A wife wants to know if she can tell her husband to delete his Facebook account and a woman is very upset about her messy husband.",
            "length": "388112599",
            "sourceUrl": "http://media.blubrry.com/mgshow/s3.amazonaws.com/MGSOURCE/video/2013/Weekly/toair_w11182013.mp4"
        },
        {
            "title": "08-18-2014",
            "datePublished": "Mon, 18 Aug 2014 15:30:23 +0000",
            "description": "Single guys who are terrible housekeepers. Why does Mark feel sorry for people who have feelings for someone who isn’t their spouse? Denying the sexual needs of your spouse. Dealing with the issue of electronics in the family. A guy needs help dealing with his masturbation habit. What are the roles of husbands and wives […]",
            "length": "394084684",
            "sourceUrl": "http://media.blubrry.com/mgshow/s3.amazonaws.com/MGSOURCE/video/2013/Weekly/toair_w11112013.mp4"
        },
        {
            "title": "08-11-2014",
            "datePublished": "Mon, 11 Aug 2014 15:16:28 +0000",
            "description": "Married + Monogamous = Best Sex. Why am I so terrible at dating? Are pastors obligated to share their past history or not? Do most people know or suspect when their spouse is cheating on them? How do you deal with an out of wedlock pregnancy in your family? A young man needs help to […]",
            "length": "389980561",
            "sourceUrl": "http://media.blubrry.com/mgshow/s3.amazonaws.com/MGSOURCE/video/2013/Weekly/toair_w11042013.mp4"
        },
        {
            "title": "08-04-2014",
            "datePublished": "Mon, 04 Aug 2014 15:30:34 +0000",
            "description": "How does a strong grandparent/grandchild relationship benefit both? A guy makes “demands” of God for the girl he wants–and she’s 28 years younger than he is!  A new husband writes in because his bride is depressed over things she wishes were different about the wedding. A listener has mother-in-law issues and a husband gets busted […]",
            "length": "389063656",
            "sourceUrl": "http://media.blubrry.com/mgshow/s3.amazonaws.com/MGSOURCE/video/2013/Weekly/toair_w10282013.mp4"
        },
        {
            "title": "07-28-2014",
            "datePublished": "Mon, 28 Jul 2014 14:27:01 +0000",
            "description": "Should the guy or the girl pay for the date? How can I deal with and get over my boyfriend’s sexual past? Can a man and woman just live together to share resources if they aren’t having sex?  Can love make any marriage work? How do we turn our sex life back on again after […]",
            "length": "387913011",
            "sourceUrl": "http://media.blubrry.com/mgshow/s3.amazonaws.com/MGSOURCE/video/2013/Weekly/toair_w10212013.mp4"
        },
        {
            "title": "07-21-2014",
            "datePublished": "Mon, 21 Jul 2014 15:30:33 +0000",
            "description": "Sex addiction isn’t real. A woman emails saying she is having trouble reaching the kind of orgasm Mark describes in his seminar. What traits did Mark look for when he dated his wife? How do you know it’s “the one”? Is a 17 year age gap problematic in a marriage? Should divorced/single people date while […]",
            "length": "393351475",
            "sourceUrl": "http://media.blubrry.com/mgshow/s3.amazonaws.com/MGSOURCE/video/2013/Weekly/toair_w10142013.mp4"
        },
        {
            "title": "07-14-2014",
            "datePublished": "Mon, 14 Jul 2014 15:30:19 +0000",
            "description": "Carolyn Evans joins the program to talk about the new book she co-authored with Mark called “The Bead Method”.  A great tool for couples that want to be intentional about having a great sex life.",
            "length": "395297316",
            "sourceUrl": "http://media.blubrry.com/mgshow/s3.amazonaws.com/MGSOURCE/video/2013/Weekly/toair_w10072013.mp4"
        },
        {
            "title": "07-07-2014",
            "datePublished": "Mon, 07 Jul 2014 15:30:13 +0000",
            "description": "Having high expectations about marriage could lead to unhappiness. A couple has differing opinions on oral sex. A mom has questions about boyfriend/girlfriend sleepovers. Mark’s opinion on homeschooling. What to do when your calling/purposes don’t match up.",
            "length": "356976162",
            "sourceUrl": "http://media.blubrry.com/mgshow/s3.amazonaws.com/MGSOURCE/video/2013/Weekly/toair_w09302013.mp4"
        },
        {
            "title": "06-30-2014",
            "datePublished": "Mon, 30 Jun 2014 15:30:12 +0000",
            "description": "Do the majority of women use sex as a reward? How do I get older women to stop hitting on me? Why are so many married men caught up in pornography? What is the right balance of our public display of affection? Can Christians listen to other genres of music even if the songs have […]",
            "length": "365075017",
            "sourceUrl": "http://media.blubrry.com/mgshow/s3.amazonaws.com/MGSOURCE/video/2013/Weekly/toair_w09232013.mp4"
        },
        {
            "title": "06-23-2014",
            "datePublished": "Mon, 23 Jun 2014 15:30:53 +0000",
            "description": "Why are stepfathers twice as likely to leave a marriage? What defines lust? How does a single-again person deal with sexual needs? Is it normal to fear dying too soon? Is masturbation a sin if you only do it for pleasure and don’t include lustful thoughts? Also…dating when one has wacko family members and divine […]",
            "length": "367877718",
            "sourceUrl": "http://media.blubrry.com/mgshow/s3.amazonaws.com/MGSOURCE/video/2013/Weekly/toair_w09162013.mp4"
        },
        {
            "title": "06-16-2014",
            "datePublished": "Mon, 16 Jun 2014 14:43:58 +0000",
            "description": "Men aren’t mature until 43!? What does the bible say about using artificial insemination to have a child even if you are unmarried? How is a pastor’s wife to deal with flirty women who cause temptation for her husband?",
            "length": "389041278",
            "sourceUrl": "http://media.blubrry.com/mgshow/s3.amazonaws.com/MGSOURCE/video/2013/Weekly/toair_w09092013.mp4"
        },
        {
            "title": "06-09-2014",
            "datePublished": "Mon, 09 Jun 2014 15:10:30 +0000",
            "description": "Is it really impossible for men to resist sexual temptation? Can you still have oral sex if you pledge to be abstinent?  Are traditional marriage vows necessary or can couples write their own? What should we do about our fornicating youth leader?",
            "length": "357635755",
            "sourceUrl": "http://media.blubrry.com/mgshow/s3.amazonaws.com/MGSOURCE/video/2013/Weekly/toair_w9022013.mp4"
        },
        {
            "title": "06-02-2014",
            "datePublished": "Mon, 02 Jun 2014 15:30:32 +0000",
            "description": "NEW SHOW: A website that “slut shames” women who cheat with married men, a woman has a solution to a low-sex marriage, a young woman asks about arranged marriage because she wants to be married but doesn’t want to date, and a listener wonders how to say grace a meals with unbelievers. A listener has […]",
            "length": "354523146",
            "sourceUrl": "http://media.blubrry.com/mgshow/s3.amazonaws.com/MGSOURCE/video/2014/toair_w06022014.mp4"
        },
        {
            "title": "05-26-2014",
            "datePublished": "Mon, 26 May 2014 15:30:22 +0000",
            "description": "NEW SHOW: More than half of religious surveyed are OK with premarital sex.  What age should I talk to me teens about sex? A young woman has questions about the guy she is “destined” to be with. A couple has issues with the way each reaches orgasm. A wife is concerned about her mother-in-law coming […]",
            "length": "359579748",
            "sourceUrl": "http://media.blubrry.com/mgshow/s3.amazonaws.com/MGSOURCE/video/2014/toair_w05262014.mp4"
        },
        {
            "title": "05-19-2014",
            "datePublished": "Mon, 19 May 2014 15:30:20 +0000",
            "description": "NEW SHOW: Should you talk about your marriage problems to others? How do we get back to the way things were before my husband’s affair? A woman writes in after her husband requests that she masturbates and tells him about it. A young man has poor self-esteem and is afraid to date and another guy […]",
            "length": "353190894",
            "sourceUrl": "http://media.blubrry.com/mgshow/s3.amazonaws.com/MGSOURCE/video/2014/toair_w05192014.mp4"
        },
        {
            "title": "05-12-2014",
            "datePublished": "Mon, 12 May 2014 15:30:56 +0000",
            "description": "NEW SHOW: Would marriage education help prevent divorces? Mark has a GREAT rant you don’t want to miss about “good men” and what a “good man” really is. Wife wants to go on a missions trip but the husband is saying no.  A mom wants help for her daughter who is dating a married man. […]",
            "length": "356485005",
            "sourceUrl": "http://media.blubrry.com/mgshow/s3.amazonaws.com/MGSOURCE/video/2014/toair_w05122014.mp4"
        },
        {
            "title": "05-05-2014",
            "datePublished": "Mon, 05 May 2014 14:56:32 +0000",
            "description": "NEW SHOW:  An article says “Love is a Gift, Not a Swap of Emotions.”  A woman needs help choosing better men after two bad marriage experiences.  A young man is a sex addict. What is Mark’s opinion of premarital counseling? A husband reneges on his promise to reverse his vasectomy. A mom wonders how to […]",
            "length": "390499496",
            "sourceUrl": "http://media.blubrry.com/mgshow/s3.amazonaws.com/MGSOURCE/video/2014/toair_w05052014.mp4"
        },
        {
            "title": "04-28-2014",
            "datePublished": "Mon, 28 Apr 2014 15:30:32 +0000",
            "description": "NEW EPISODE: Happiness is overrated: It’s more important to be right. A guy wants to know why “happy wife, happy life” is the rule and where is the happiness for the men? A young couple wants the parents’ blessing on their marriage, a woman gets text pictures of her boyfriend’s private parts and a Christian […]",
            "length": "368310324",
            "sourceUrl": "http://media.blubrry.com/mgshow/s3.amazonaws.com/MGSOURCE/video/2014/toair_w04282014.mp4"
        },
        {
            "title": "04-21-2014",
            "datePublished": "Mon, 21 Apr 2014 14:40:19 +0000",
            "description": "NEW EPISODE: Most questions we receive on The Mark Gungor Show are about S-E-X. Find out what our listeners are asking. Erotic fiction. What is permissible? Fetishes. Dating married men. Props and costumes. When masturbation replaces real sex. Dumb girls who date for years. Orgasms.",
            "length": "349612412",
            "sourceUrl": "http://media.blubrry.com/mgshow/s3.amazonaws.com/MGSOURCE/video/2014/toair_w04212014.mp4"
        },
        {
            "title": "04-14-2014",
            "datePublished": "Mon, 14 Apr 2014 15:30:11 +0000",
            "description": "NEW EPISODE: Casual sex can’t match the sex in committed relationships. Can one be a Christian and still suffer from depression? A mom doesn’t want her kids to stay with her in-laws, a husband doesn’t want his wife sharing the details of their sex life, and a woman needs help recovering from her husband’s affair. […]",
            "length": "364962988",
            "sourceUrl": "http://media.blubrry.com/mgshow/s3.amazonaws.com/MGSOURCE/video/2014/toair_w04142014.mp4"
        },
        {
            "title": "04-07-2014",
            "datePublished": "Mon, 07 Apr 2014 15:30:44 +0000",
            "description": "NEW EPISODE: Jimmie Bratcher joins us for one final show this week! We discuss polygamy, grabbin’ taters, boudoir photos, resisting the devil, sexual purity and Mark is inflamed over delayed marriage.",
            "length": "346645731",
            "sourceUrl": "http://media.blubrry.com/mgshow/s3.amazonaws.com/MGSOURCE/video/2014/toair_w04072014.mp4"
        },
        {
            "title": "03-31-2014",
            "datePublished": "Mon, 31 Mar 2014 15:30:11 +0000",
            "description": "NEW EPISODE:  Week #3 with Jimmie Bratcher! A teen calls the cops after hearing mom having sex with her boyfriend, Jimmie explains “The Baloney Sandwich” song, a woman wants to know the difference between noticing women and girl watching, a gal wonders if she should make the first move to let the guy know she’s […]",
            "length": "355001870",
            "sourceUrl": "http://media.blubrry.com/mgshow/s3.amazonaws.com/MGSOURCE/video/2014/toair_w03312014.mp4"
        },
        {
            "title": "03-24-2014",
            "datePublished": "Mon, 24 Mar 2014 15:30:22 +0000",
            "description": "NEW EPISODE: Jimmie Bratcher is our special guest again this week! Gramps chokes to death just before his “super bowl of sex”. A wife complains about the “nerdy sex” with her husband. A guy is concerned about the relationship his girlfriend has with her ex husband and a lady is having issues with her in-laws […]",
            "length": "350498968",
            "sourceUrl": "http://media.blubrry.com/mgshow/s3.amazonaws.com/MGSOURCE/video/2014/toair_w03242014.mp4"
        },
        {
            "title": "03-17-2014",
            "datePublished": "Mon, 17 Mar 2014 15:30:01 +0000",
            "description": "NEW EPISODE: Jimmie Bratcher is our special guest on this week’s show! Ten great suggestions for improving your marriage. A guy isn’t thrilled with how the fornicating part of his relationship is going. A gal wants to know how to get her fiance to listen and try to fix her. One wife wants to know […]",
            "length": "365103036",
            "sourceUrl": "http://media.blubrry.com/mgshow/s3.amazonaws.com/MGSOURCE/video/2014/toair_w03172014.mp4"
        },
        {
            "title": "03-10-2014",
            "datePublished": "Mon, 10 Mar 2014 15:30:35 +0000",
            "description": "NEW EPISODE: Do erectile drugs make men happier? What does it mean to have a “personal relationship” with Jesus? How do we deal with our 13-year-old son who was watching porn on his smart phone? Can a married couple overcome differences in liberal/conservative ideologies? A single mom needs advice after her young daughter is desperate […]",
            "length": "358448880",
            "sourceUrl": "http://media.blubrry.com/mgshow/s3.amazonaws.com/MGSOURCE/video/2014/toair_w03102014.mp4"
        },
        {
            "title": "03-03-2014",
            "datePublished": "Mon, 03 Mar 2014 15:27:57 +0000",
            "description": "NEW EPISODE: Mark and crew start off with a story that gives a whole new meaning to “shop till you drop!” Why “just pray about it” is a terrible answer, dating deal breakers, satanic music, husbands who want to date other women, all on a show that has Mark spitting mad!",
            "length": "366791025",
            "sourceUrl": "http://media.blubrry.com/mgshow/s3.amazonaws.com/MGSOURCE/video/2014/toair_w03022014.mp4"
        },
        {
            "title": "02-24-2014",
            "datePublished": "Mon, 24 Feb 2014 15:30:25 +0000",
            "description": "Another episode with Ross sitting in! Do men with attractive wives have better marriages? Does God “assign” spouses? How can I speak to my husband about his poor health habits? What is the difference between honoring your parents and obeying them? A guy is concerned about “his size not measuring up” to the men he’s […]",
            "length": "350353649",
            "sourceUrl": "http://media.blubrry.com/mgshow/s3.amazonaws.com/MGSOURCE/video/2014/toair_w02242014.mp4"
        },
        {
            "title": "02-17-2014",
            "datePublished": "Mon, 17 Feb 2014 15:46:06 +0000",
            "description": "Ross Allen Skorzewski makes a guest appearance on this week’s show. Discover ten old fashioned dating habits to make cool again. Learn how to twerk with Ross and a discussion about death and dating.",
            "length": "357271408",
            "sourceUrl": "http://media.blubrry.com/mgshow/s3.amazonaws.com/MGSOURCE/video/2014/toair_w02172014.mp4"
        },
        {
            "title": "02-10-2014",
            "datePublished": "Mon, 10 Feb 2014 15:30:04 +0000",
            "description": "NEW EPISODE: Ross Allen Skorzewski makes a guest appearance on this week’s show….and it’s a CRAZY one! An Australia man killed his wife, WHY!? People who think they are married “in the eyes of the Lord.”  A discussion about the difference between premarital sex and married sex. A guy has sexual addiction issues.",
            "length": "366551965",
            "sourceUrl": "http://media.blubrry.com/mgshow/s3.amazonaws.com/MGSOURCE/video/2014/toair_w02102014.mp4"
        },
        {
            "title": "02-03-2014",
            "datePublished": "Mon, 03 Feb 2014 15:30:02 +0000",
            "description": "NEW EPISODE: Man charged with using a stun gun on wife after football bet. Should couples stay together for the sake of their kids?  How do I get my husband to forgive me for my past affair? A wife explains how separation saved their marriage. Should a believer date a non-believer? What does it look […]",
            "length": "356945854",
            "sourceUrl": "http://media.blubrry.com/mgshow/s3.amazonaws.com/MGSOURCE/video/2014/toair_w02032014.mp4"
        },
        {
            "title": "01-27-2014",
            "datePublished": "Mon, 27 Jan 2014 15:30:19 +0000",
            "description": "NEW EPISODE: Practical (or maybe not) tips for husbands to spiritually lead their family. Do parents have a say in who gets invited to their kids’ wedding? What do I do if I’m no longer attracted to my spouse? Is it okay to play violent video games? How do I tell a prospective husband that […]",
            "length": "359208397",
            "sourceUrl": "http://media.blubrry.com/mgshow/s3.amazonaws.com/MGSOURCE/video/2014/toair_w01272014.mp4"
        },
        {
            "title": "01-20-2014",
            "datePublished": "Mon, 20 Jan 2014 15:30:33 +0000",
            "description": "NEW EPISODE: So some women prefer their pets over their partners? How do I show honor and respect to my husband? Is marriage prep a good idea? What is Mark’s take on the 144,000 going to heaven? Should pastors be 100% transparent with the church about their private lives?What do I do with a husband […]",
            "length": "393452227",
            "sourceUrl": "http://media.blubrry.com/mgshow/s3.amazonaws.com/MGSOURCE/video/2014/toair_w01202014.mp4"
        },
        {
            "title": "01-13-2014",
            "datePublished": "Mon, 13 Jan 2014 15:30:04 +0000",
            "description": "NEW EPISODE: Couples are happier if wives calm down after fights. The importance of asking the guy you’re dating if he looks at porn. How can I get my husband to leave his momma and cleave to me?  What can I do to get my husband to read more books, especially the Bible? This will […]",
            "length": "393264884",
            "sourceUrl": "http://media.blubrry.com/mgshow/s3.amazonaws.com/MGSOURCE/video/2014/toair_w01132014.mp4"
        },
        {
            "title": "01-06-2014",
            "datePublished": "Mon, 06 Jan 2014 15:00:44 +0000",
            "description": "NEW EPISODE: Is a “Snuggle House” a legitimate business? Should wives have babies to try to improve their marriage or make them happy? What do I do when my husband forgets all the special occasions in our life? A listener wonders if there will be sex in heaven? A wife wants suggestions on how to […]",
            "length": "387944616",
            "sourceUrl": "http://media.blubrry.com/mgshow/s3.amazonaws.com/MGSOURCE/video/2014/toair_w01062014.mp4"
        },
        {
            "title": "12-30-2013",
            "datePublished": "Mon, 30 Dec 2013 15:30:08 +0000",
            "description": "NEW EPISODE: 6 signs you are a bad lover. Should Christians engage in oral and anal sex? A woman is afraid her husband is having an affair.",
            "length": "371293370",
            "sourceUrl": "http://media.blubrry.com/mgshow/s3.amazonaws.com/MGSOURCE/video/2013/Weekly/toair_w12302013.mp4"
        },
        {
            "title": "12-23-2013",
            "datePublished": "Mon, 23 Dec 2013 15:30:36 +0000",
            "description": "NEW EPISODE: Reasons to dump his butt when dating.  Can I check my husband’s cell phone? A young man needs help with finding a girl for his arranged marriage.  A mom is torn between working and being a stay at home mom. A wife is struggling with her commuter marriage.",
            "length": "357380457",
            "sourceUrl": "http://media.blubrry.com/mgshow/s3.amazonaws.com/MGSOURCE/video/2013/Weekly/toair_w12232013.mp4"
        },
        {
            "title": "12-16-2013",
            "datePublished": "Mon, 16 Dec 2013 15:30:58 +0000",
            "description": "NEW EPISODE: Are nice people more attractive? Mark answers the “creepiest email ever” from a guy who has issues with his wife’s weight and problems with his children.  A mom wonders when she has to conceal her breastfeeding and other chance exposures from her children. A couple of women want to know if the effects […]",
            "length": "367936435",
            "sourceUrl": "http://media.blubrry.com/mgshow/s3.amazonaws.com/MGSOURCE/video/2013/Weekly/toair_w12162013.mp4"
        },
        {
            "title": "12-09-2013",
            "datePublished": "Mon, 09 Dec 2013 15:30:49 +0000",
            "description": "NEW EPISODE: Biblical (and hilarious) ways to find a spouse. A wife can’t enjoy sex with her husband without some kind of fantasy, a listener wants to know what kinds of sexual sin needs to be confessed to your spouse, and a woman has questions about the sincerity of her husband’s desire to reconcile. Is […]",
            "length": "352573891",
            "sourceUrl": "http://media.blubrry.com/mgshow/s3.amazonaws.com/MGSOURCE/video/2013/Weekly/toair_w12092013.mp4"
        },
        {
            "title": "12-02-2013",
            "datePublished": "Mon, 02 Dec 2013 15:30:50 +0000",
            "description": "NEW EPISODE:  Be-Attitudes of Marriage: When Jesus sat down for his amazing Sermon on the Mount, he began by sharing nine simple truths: Blessed are the poor in spirit, blessed are those that mourn, blessed are the meek, etc… we call them the “beatitudes”. Mark shares his “Nine Be-Attitudes” for a successful marriage. Nine ways […]",
            "length": "391234354",
            "sourceUrl": "http://media.blubrry.com/mgshow/s3.amazonaws.com/MGSOURCE/video/2013/Weekly/toair_w12022013.mp4"
        },
        {
            "title": "11-25-2013",
            "datePublished": "Mon, 25 Nov 2013 15:30:54 +0000",
            "description": "NEW EPISODE: London firefighters advise: Don’t put your penis in a toaster. Why are second marriages so difficult for kids? Is sex during the menstrual period morally wrong? How can I find a guy to marry when dating is discouraged at my church?",
            "length": "389287575",
            "sourceUrl": "http://media.blubrry.com/mgshow/s3.amazonaws.com/MGSOURCE/video/2013/Weekly/toair_w11252013.mp4"
        },
        {
            "title": "11-18-2013",
            "datePublished": "Mon, 18 Nov 2013 15:30:20 +0000",
            "description": "NEW EPISODE: Mark comments about one California county that offers free home STD tests.  A listener asks about “Christian naturism or nudism”. A wife wants to know if she can tell her husband to delete his Facebook account and a woman is very upset about her messy husband.",
            "length": "388112599",
            "sourceUrl": "http://media.blubrry.com/mgshow/s3.amazonaws.com/MGSOURCE/video/2013/Weekly/toair_w11182013.mp4"
        },
        {
            "title": "11-11-2013",
            "datePublished": "Mon, 11 Nov 2013 19:18:44 +0000",
            "description": "NEW EPISODE: Single guys who are terrible housekeepers. Why does Mark feel sorry for people who have feelings for someone who isn’t their spouse? Denying the sexual needs of your spouse. Dealing with the issue of electronics in the family. A guy needs help dealing with his masturbation habit. What are the roles of husbands […]",
            "length": "394084684",
            "sourceUrl": "http://media.blubrry.com/mgshow/s3.amazonaws.com/MGSOURCE/video/2013/Weekly/toair_w11112013.mp4"
        },
        {
            "title": "11-04-2013",
            "datePublished": "Mon, 04 Nov 2013 15:30:07 +0000",
            "description": "NEW SHOW: Married + Monogamous = Best Sex. Why am I so terrible at dating? Are pastors obligated to share their past history or not? Do most people know or suspect when their spouse is cheating on them? How do you deal with an out of wedlock pregnancy in your family? A young man needs […]",
            "length": "389980561",
            "sourceUrl": "http://media.blubrry.com/mgshow/s3.amazonaws.com/MGSOURCE/video/2013/Weekly/toair_w11042013.mp4"
        },
        {
            "title": "10-28-2013",
            "datePublished": "Mon, 28 Oct 2013 15:30:31 +0000",
            "description": "NEW SHOW: How does a strong grandparent/grandchild relationship benefit both? A guy makes “demands” of God for the girl he wants–and she’s 28 years younger than he is!  A new husband writes in because his bride is depressed over things she wishes were different about the wedding. A listener has mother-in-law issues and a husband […]",
            "length": "389063656",
            "sourceUrl": "http://media.blubrry.com/mgshow/s3.amazonaws.com/MGSOURCE/video/2013/Weekly/toair_w10282013.mp4"
        },
        {
            "title": "10-21-2013",
            "datePublished": "Mon, 21 Oct 2013 14:15:43 +0000",
            "description": "NEW SHOW: Should the guy or the girl pay for the date? How can I deal with and get over my boyfriend’s sexual past? Can a man and woman just live together to share resources if they aren’t having sex?  Can love make any marriage work? How do we turn our sex life back on […]",
            "length": "387913011",
            "sourceUrl": "http://media.blubrry.com/mgshow/s3.amazonaws.com/MGSOURCE/video/2013/Weekly/toair_w10212013.mp4"
        },
        {
            "title": "10-14-2013",
            "datePublished": "Mon, 14 Oct 2013 14:50:02 +0000",
            "description": "NEW SHOW: Sex addiction isn’t real. A woman emails saying she is having trouble reaching the kind of orgasm Mark describes in his seminar. What traits did Mark look for when he dated his wife? How do you know it’s “the one”? Is a 17 year age gap problematic in a marriage? Should divorced/single people […]",
            "length": "393351475",
            "sourceUrl": "http://media.blubrry.com/mgshow/s3.amazonaws.com/MGSOURCE/video/2013/Weekly/toair_w10142013.mp4"
        },
        {
            "title": "10-07-2013",
            "datePublished": "Mon, 07 Oct 2013 15:00:36 +0000",
            "description": "NEW SHOW: Carolyn Evans joins the program to talk about the new book she co-authored with Mark called “The Bead Method”.  A great tool for couples that want to be intentional about having a great sex life.",
            "length": "395297316",
            "sourceUrl": "http://media.blubrry.com/mgshow/s3.amazonaws.com/MGSOURCE/video/2013/Weekly/toair_w10072013.mp4"
        },
        {
            "title": "09-30-2013",
            "datePublished": "Mon, 30 Sep 2013 15:00:33 +0000",
            "description": "NEW SHOW: Having high expectations about marriage could lead to unhappiness. A couple has differing opinions on oral sex. A mom has questions about boyfriend/girlfriend sleepovers. Mark’s opinion on homeschooling. What to do when your calling/purposes don’t match up.",
            "length": "356976162",
            "sourceUrl": "http://media.blubrry.com/mgshow/s3.amazonaws.com/MGSOURCE/video/2013/Weekly/toair_w09302013.mp4"
        },
        {
            "title": "09-23-2013",
            "datePublished": "Mon, 23 Sep 2013 15:00:37 +0000",
            "description": "NEW EPISODE: Do the majority of women use sex as a reward? How do I get older women to stop hitting on me? Why are so many married men caught up in pornography? What is the right balance of our public display of affection? Can Christians listen to other genres of music even if the […]",
            "length": "365075017",
            "sourceUrl": "http://media.blubrry.com/mgshow/s3.amazonaws.com/MGSOURCE/video/2013/Weekly/toair_w09232013.mp4"
        },
        {
            "title": "09-16-2013",
            "datePublished": "Mon, 16 Sep 2013 16:00:48 +0000",
            "description": "NEW EPISODE: Why are stepfathers twice as likely to leave a marriage? What defines lust? How does a single-again person deal with sexual needs? Is it normal to fear dying too soon? Is masturbation a sin if you only do it for pleasure and don’t include lustful thoughts? Also…dating when one has wacko family members […]",
            "length": "367877718",
            "sourceUrl": "http://media.blubrry.com/mgshow/s3.amazonaws.com/MGSOURCE/video/2013/Weekly/toair_w09162013.mp4"
        },
        {
            "title": "09-09-2013",
            "datePublished": "Mon, 09 Sep 2013 16:00:02 +0000",
            "description": "NEW EPISODE: Men aren’t mature until 43!? What does the bible say about using artificial insemination to have a child even if you are unmarried? How is a pastor’s wife to deal with flirty women who cause temptation for her husband?",
            "length": "389041278",
            "sourceUrl": "http://media.blubrry.com/mgshow/s3.amazonaws.com/MGSOURCE/video/2013/Weekly/toair_w09092013.mp4"
        },
        {
            "title": "09-02-2013",
            "datePublished": "Mon, 02 Sep 2013 16:00:36 +0000",
            "description": "NEW EPISODE: Is it really impossible for men to resist sexual temptation? Can you still have oral sex if you pledge to be abstinent?  Are traditional marriage vows necessary or can couples write their own? What should we do about our fornicating youth leader?",
            "length": "357635755",
            "sourceUrl": "http://media.blubrry.com/mgshow/s3.amazonaws.com/MGSOURCE/video/2013/Weekly/toair_w9022013.mp4"
        },
        {
            "title": "08-26-2013",
            "datePublished": "Mon, 26 Aug 2013 17:00:39 +0000",
            "description": "IT’S AN ALL NEW SHOW! Join Mark and crew for the update on what’s been going on and what the future direction of the show is.",
            "length": "356271113",
            "sourceUrl": "http://media.blubrry.com/mgshow/s3.amazonaws.com/MGSOURCE/video/2013/August/toair_w08262013.mp4"
        },
        {
            "title": "08-23-2013",
            "datePublished": "Fri, 23 Aug 2013 17:00:34 +0000",
            "description": "What are ten personality traits that try marriages? Does porn and masturbation have the same imprinting consequences as premarital sex?  How can I deal with my husband who is not providing financially for our family? Should I dump my boyfriend for being rude to me? How do I know if I’m ready for marriage? Is […]",
            "length": "218856245",
            "sourceUrl": "http://media.blubrry.com/mgshow/s3.amazonaws.com/MGSOURCE/video/2013/August/toair_08232013r.mp4"
        },
        {
            "title": "07-12-2012",
            "datePublished": "Thu, 12 Jul 2012 16:08:28 +0000",
            "description": "Watch a NEW EPISODE of The Mark Gungor Show! Topics today: Why are women the losers in a “hook-up” culture? Should a husband and wife pray together? Should I be concerned if my fiance won’t disclose how much money he makes?",
            "length": "169399241",
            "sourceUrl": "http://media.blubrry.com/mgshow/s3.amazonaws.com/MGSOURCE/toair_07122012.mp4"
        },
        {
            "title": "07-11-2012",
            "datePublished": "Wed, 11 Jul 2012 17:00:36 +0000",
            "description": "Watch a NEW EPISODE of The Mark Gungor Show! Topics today: Can a Catholic and an Evangelical make a relationship work? Should unmarried women use fertility treatments to get pregnant? Is it okay for spouses to have naked pictures of each other?",
            "length": "194321257",
            "sourceUrl": "http://media.blubrry.com/mgshow/s3.amazonaws.com/MGSOURCE/toair_07112012.mp4"
        },
        {
            "title": "07-10-2012",
            "datePublished": "Tue, 10 Jul 2012 17:00:54 +0000",
            "description": "Watch a NEW EPISODE of The Mark Gungor Show! Topics today: Mark weighs in on the buzz over the book “The 50 Shades of Grey”, the crew discusses why married men shouldn’t discuss their marital issues with other women, and a woman has an interesting way to get her husband’s attention!",
            "length": "170041748",
            "sourceUrl": "http://media.blubrry.com/mgshow/s3.amazonaws.com/MGSOURCE/toair_07102012.mp4"
        },
        {
            "title": "06-29-2012",
            "datePublished": "Fri, 29 Jun 2012 17:00:07 +0000",
            "description": "Watch and listen to another NEW show! Mark and crew discuss the problems associated with delaying marriage until you are in your 30s-40s.",
            "length": "170010984",
            "sourceUrl": "http://media.blubrry.com/mgshow/s3.amazonaws.com/MGSOURCE/toair_06292012.mp4"
        },
        {
            "title": "05-23-2012",
            "datePublished": "Wed, 23 May 2012 17:00:19 +0000",
            "description": "Who needs Viagra, when there is pomegranate juice?  Mark answers emails: A wife needs advice after her husband says his porn stash isn’t a big deal, a listener wonders if you can just live apart and not divorce if the marriage is difficult, and a guy asks questions about masturbation. Today will forever be known […]",
            "length": "188257431",
            "sourceUrl": "http://media.blubrry.com/mgshow/s3.amazonaws.com/MGSOURCE/toair_05232012.mp4"
        },
        {
            "title": "05-22-2012",
            "datePublished": "Tue, 22 May 2012 15:49:48 +0000",
            "description": "The show starts with stories of guys who solve their issues by stabbing!  Mark answers emails: A mom is concerned after her young daughter accesses porn on her smart phone, a listener has questions about raising children in broken homes, a guy wants to know if he can still be friends with the girl he […]",
            "length": "165339448",
            "sourceUrl": "http://media.blubrry.com/mgshow/s3.amazonaws.com/MGSOURCE/toair_05222012.mp4"
        },
        {
            "title": "04-24-2012",
            "datePublished": "Tue, 24 Apr 2012 17:00:55 +0000",
            "description": "Should a Christian school be able to fire an unmarried teacher after she gets pregnant? A wife writes in with a positive testimony after she and her husband gave up porn, and Mark goes off on a rant over a dating question and how the church tends to over-spiritualize things.",
            "length": "167917965",
            "sourceUrl": "http://media.blubrry.com/mgshow/s3.amazonaws.com/MGSOURCE/toair_04242012.mp4"
        },
        {
            "title": "04-20-2012",
            "datePublished": "Fri, 20 Apr 2012 17:00:09 +0000",
            "description": "What can single women learn from Jane Austen? A long discussion evolves on why there are so many bad men, and a wife complains about her husband’s hobby being so important to him.",
            "length": "210925553",
            "sourceUrl": "http://media.blubrry.com/mgshow/s3.amazonaws.com/MGSOURCE/toair_04202012.mp4"
        },
        {
            "title": "04-19-2012",
            "datePublished": "Thu, 19 Apr 2012 17:00:11 +0000",
            "description": "A guy gets a surprise when he spots his wife in a pornographic movie. Then Mark answers email: a young woman wonders how to deal with her stubborn and hard-headed fiance’s temper tantrums, a listener revisits the issue of toilet seats up vs. down, and a husband asks questions about oral sex.",
            "length": "164319754",
            "sourceUrl": "http://media.blubrry.com/mgshow/s3.amazonaws.com/MGSOURCE/toair_04192012.mp4"
        }
    ]
}