{
    "artwork": "http://is1.mzstatic.com/image/thumb/Music111/v4/19/3f/c4/193fc448-6c83-71a2-d9d9-7343b073c5b7/source/100x100bb.jpg",
    "description": "The Sneaker Box is the ultimate source to keep sneakerheads updated weekly with news and information about upcoming sneakers. The show is hosted by Afrikan Caesar, Jumpmanbostic, The Sneaker Girl, Guru, Nara Mar and various other guests. The podcast features discussions on sneaker news and Air Jordan Release Dates information for Air Jordans, Nike, Adidas, plus many more brands.",
    "feedURL": "https://sneakerbardetroit.com/feed/podcast/",
    "podcastURL": "https://sneakerbardetroit.com",
    "title": "The Sneaker Box",
    "episodes": [
        {
            "title": "TSB Podcast: Episode 273 – Can Nike and Adidas do a Better Job of Marketing?",
            "datePublished": "Thu, 05 Nov 2020 15:54:40 +0000",
            "description": "In this episode of TSB, Caesar, Geeno, Francis, and Dunks are in-studio. We begin the show with an email Dunk’s received from Warren Lotas. In it, Warren exhibits a lack of self awareness by acting like some martyr in his court case with Nike, even going as far as offering to send Dunk’s a commemorative […]",
            "length": "142370204",
            "sourceUrl": "https://traffic.libsyn.com/secure/sneakerbardetroit/Episode_273.mp3",
            "categories": [
                "Adidas",
                "Nike",
                "Podcast",
                "The Sneaker Box Podcast"
            ]
        },
        {
            "title": "TSB Podcast: Episode 272 – Did Nike waste an opportunity to release the “Banned” Airships",
            "datePublished": "Wed, 28 Oct 2020 13:50:57 +0000",
            "description": "In this episode of TSB, Caesar, Geeno, and Dunks are in-studio. Adidas is looking to unload Reebok. We wonder if the brand has any life left, and if so, who should step in to save it. Despite Beyonce’s ability to look in any outfit, the upcoming Ivy Park X Adidas collection doesn’t seem like it […]",
            "length": "99041630",
            "sourceUrl": "https://traffic.libsyn.com/secure/sneakerbardetroit/Episode_272.mp3",
            "categories": [
                "Adidas",
                "Nike",
                "Podcast",
                "The Sneaker Box Podcast"
            ]
        },
        {
            "title": "TSB Podcast: Episode 291 – Kool Kiy accused of creating knockoffs?",
            "datePublished": "Mon, 19 Oct 2020 14:03:01 +0000",
            "description": "In this episode of TSB, Caesar, Guru, Geeno, and Dunks are in-studio. Ebay is getting into the authentication game. Caesar thinks they’re opening up an unnecessary can a worms. He says the way they did business was just fine, they don’t need to be like StockX or GOAT. Agree or disagree? Reebok seems to be […]",
            "length": "112186864",
            "sourceUrl": "https://traffic.libsyn.com/secure/sneakerbardetroit/Episode_271.mp3",
            "categories": [
                "Podcast",
                "The Sneaker Box Podcast"
            ]
        },
        {
            "title": "TSB Podcast: Episode 270 – The J Blavin x Air Jordan 1 is the Worse Sneaker Collab This Year",
            "datePublished": "Tue, 13 Oct 2020 19:16:05 +0000",
            "description": "In this episode of TSB, Caesar and Dunks are in-studio. We bring back our “Fab 5” segment. Too bad it was a slow week as far as releases are concerned. Ruby Tuesday’s filed for bankruptcy. Where did they go wrong? What’s the best no name brand cereal to eat? Caesar names the one shoe, outside […]",
            "length": "106570328",
            "sourceUrl": "https://traffic.libsyn.com/secure/sneakerbardetroit/Episode_270.mp3",
            "categories": [
                "Podcast",
                "The Sneaker Box Podcast"
            ]
        },
        {
            "title": "TSB Podcast: Episode 269 – Goat Fashion sues GOAT App",
            "datePublished": "Tue, 06 Oct 2020 20:19:12 +0000",
            "description": "In this episode of TSB, Caesar, Geeno, and Dunks are in-studio. Guru does call in later in the show. Things start of pretty tense after Caesar relays a message from Mayor to Dunks about his comments from a few episodes ago pertaining to Mayor selling off his collection. Does any brand do a worse job […]",
            "length": "81583214",
            "sourceUrl": "https://traffic.libsyn.com/secure/sneakerbardetroit/Episode_269.0.mp3",
            "categories": [
                "Podcast",
                "The Sneaker Box Podcast"
            ]
        },
        {
            "title": "TSB Podcast: Episode 268 – What’s the point of the Travis Scott X McDonald’s collaboration?",
            "datePublished": "Thu, 01 Oct 2020 15:11:35 +0000",
            "description": "In this episode of TSB, Caesar, Geeno, and Dunks are in-studio. Geeno sells his soul to Dunks for a pair of Dunks. Caesar gives his overall thoughts on the current state of sneaker collaborations. Try as we might, Kanye is the topic of discussion once again on our show. What line does he have to […]",
            "length": "110590260",
            "sourceUrl": "https://traffic.libsyn.com/secure/sneakerbardetroit/Episode_268.mp3",
            "categories": [
                "Podcast",
                "The Sneaker Box Podcast"
            ]
        },
        {
            "title": "TSB Podcast: Episode 267 – Nike’s Top Brass “Out Of Touch” With Reality",
            "datePublished": "Fri, 25 Sep 2020 22:21:54 +0000",
            "description": "In this episode of TSB, Caesar and Guru are in-studio. Josh Luber makes his exit at StockX. What is he going to do next? What does this mean for the company going forward? People seem to be getting more “L’s” than sneakers on the SNKRS app lately. But what will it actually take to get […]",
            "length": "94428977",
            "sourceUrl": "https://traffic.libsyn.com/secure/sneakerbardetroit/Episode_267.mp3",
            "categories": [
                "Podcast",
                "The Sneaker Box Podcast"
            ]
        },
        {
            "title": "TSB Podcast: Episode 266 – LaMelo Ball signing with PUMA",
            "datePublished": "Thu, 10 Sep 2020 13:16:48 +0000",
            "description": "In this episode of TSB, Caesar, Guru, Geeno, and Dunks are in-studio. We begin the show by interviewing the founders of SNEAKQL, Andrew Lipp and Patrick Donelan. SNEAKQL is trying to change the game by mitigating the impact of bots and making raffles and releases fairer, and more obtainable, for the average sneakerhead. Wex-Dawg, aka […]",
            "length": "102489375",
            "sourceUrl": "https://traffic.libsyn.com/secure/sneakerbardetroit/Episode_266.mp3",
            "categories": [
                "Podcast",
                "The Sneaker Box Podcast"
            ]
        },
        {
            "title": "TSB Podcast: Episode 265 – Did Nike Completely Drop the Ball with Last Week’s “Mamba Week” Kobe Protro 5 Releases?",
            "datePublished": "Thu, 03 Sep 2020 22:01:27 +0000",
            "description": "In this episode of TSB, Caesar, Guru, Dunks, and, making his first appearance of the year–literally–Francis are all in-studio. Sugar belongs in spaghetti, but NOT in rice or grits. This is our last time addressing this issue. Adidas recently reintroduced their Confirm app, upgraded with all the newest bells and whistles. You can get limited […]",
            "length": "97898093",
            "sourceUrl": "https://traffic.libsyn.com/secure/sneakerbardetroit/Episode_265.mp3",
            "categories": [
                "Podcast",
                "The Sneaker Box Podcast"
            ]
        },
        {
            "title": "TSB Podcast: Episode 264 – Make sneaker collaborations great again",
            "datePublished": "Thu, 27 Aug 2020 14:39:59 +0000",
            "description": "In this episode of TSB, Caesar and Geeno are in-studio. We begin the show by pre-planning for our 300th episode. It involves Dunks, listener complaints, and a dunk tank. Make sneaker collaborations great again. Story telling used to be a staple of a good collab. Nowadays it just feels like anyone can get a collab […]",
            "length": "100106590",
            "sourceUrl": "https://traffic.libsyn.com/secure/sneakerbardetroit/Episode_264.mp3",
            "categories": [
                "Podcast",
                "The Sneaker Box Podcast"
            ]
        },
        {
            "title": "TSB Podcast: Episode 263 – Too soon for Nike to release Kobe retros?",
            "datePublished": "Tue, 18 Aug 2020 20:36:17 +0000",
            "description": "In this episode of TSB, Caesar, Guru, Geeno, and Dunks are in-studio. There’s an intruder in the studio. Luckily Dave is there to save the day. Jordan Brand trolled their own fans by releasing the highly coveted “Banned” Nike Air Ship only in Europe in very limited quantities. Does the amount of shoes you have […]",
            "length": "109029600",
            "sourceUrl": "https://traffic.libsyn.com/secure/sneakerbardetroit/Episode_263.mp3",
            "categories": [
                "Podcast",
                "The Sneaker Box Podcast"
            ]
        },
        {
            "title": "TSB Podcast: Episode 262 – Under Amour wants out of a $280 million deal",
            "datePublished": "Wed, 05 Aug 2020 14:12:00 +0000",
            "description": "In this episode of TSB, Caesar, JumpmanBostic, Geeno, Guru, and Dunks are all in-studio. However, due to coronavirus restrictions only 4 people can be in the studio at one time, so the crew must play musical chairs throughout the show. We go through and give our thoughts on upcoming sneaker releases, including the very ugly […]",
            "length": "107193087",
            "sourceUrl": "https://traffic.libsyn.com/secure/sneakerbardetroit/Episode_262.mp3",
            "categories": [
                "Podcast",
                "The Sneaker Box Podcast"
            ]
        },
        {
            "title": "TSB Podcast: Episode 261 – We’re Back!",
            "datePublished": "Tue, 21 Jul 2020 18:02:15 +0000",
            "description": "In this episode of TSB, the crew–really just Caesar and Guru–are back in studio after a 4 month hiatus due to the coronavirus pandemic. Caesar hits the ground running by diving right into the “Black Lives Matter” movement and how it’s shown the ugly side of the sneaker industry. He urges everyone to remain vigilant, […]",
            "length": "113872493",
            "sourceUrl": "https://traffic.libsyn.com/secure/sneakerbardetroit/Episode_261.mp3",
            "categories": [
                "Podcast",
                "The Sneaker Box Podcast"
            ]
        },
        {
            "title": "TSB Podcast: Episode 260 – Best of Vol. 7",
            "datePublished": "Fri, 15 May 2020 12:36:34 +0000",
            "description": "In this episode of TSB, Caesar, The Sneaker Girl, and JumpmanBostic are back at it in this throwback episode of the show. We celebrate The Sneaker Girl’s (14th) birthday and look forward to JumpmanBostic’s 52.01692487th birthday. We field questions from our listeners, which includes questions like: “Is it tacky to wear sneakers in a wedding?” […]",
            "length": "100837270",
            "sourceUrl": "https://traffic.libsyn.com/secure/sneakerbardetroit/TSB_260_BEST_OF_VOL._7.mp3",
            "categories": [
                "Podcast",
                "The Sneaker Box Podcast"
            ]
        },
        {
            "title": "TSB Podcast: Episode 259 – Best of Vol. 6",
            "datePublished": "Fri, 01 May 2020 15:55:12 +0000",
            "description": "In this episode of TSB, Caesar, The Sneaker Girl, and JumpmanBostic are once again in the #BasementOfTheJs. We revisit Deflategate and all the media focus that put into Tom Brady’s balls. We look back at the lawsuit against Nike over the Air Jordan “Jumpman” logo. We listen back to the constant back and forth between […]",
            "length": "71894857",
            "sourceUrl": "http://traffic.libsyn.com/sneakerbardetroit/Episode_259.mp3",
            "categories": [
                "Podcast",
                "The Sneaker Box Podcast"
            ]
        },
        {
            "title": "Episode 258: Best Of The Sneaker Box Vol. 5",
            "datePublished": "Wed, 15 Apr 2020 15:46:28 +0000",
            "description": "In this Best Of episode, we take a look back. Once again, Caesar, The Sneaker Girl, and JumpmanBostic are in the #BasementOfTheJs. We discuss the proper ways to clean and store your sneakers. We breakdown the differences between a sneakerhead and a hypebeast? We answer more questions submitted by our listeners, including a comment by […]",
            "length": "89708688",
            "sourceUrl": "http://traffic.libsyn.com/sneakerbardetroit/Episode_258.mp3",
            "categories": [
                "Podcast",
                "The Sneaker Box Podcast"
            ]
        },
        {
            "title": "TSB Podcast: Episode 257 – Best of Vol. 4",
            "datePublished": "Tue, 07 Apr 2020 16:41:33 +0000",
            "description": "In this episode of TSB, because of this coronvirus lockdown in effect, we take a look back by virtue of our “Best Of” series. Caesar, The Sneaker Girl, and JumpmanBostic are in the #BasementOfTheJs. We discuss the credibility of #TeamEarly, people who post pictures of releases weeks before they come out, and wonder how many […]",
            "length": "94506023",
            "sourceUrl": "http://traffic.libsyn.com/sneakerbardetroit/TSB_Episode_257.mp3",
            "categories": [
                "Podcast",
                "The Sneaker Box Podcast"
            ]
        },
        {
            "title": "TSB Podcast: Episode 256 – How coronavirus has disrupted sneaker life",
            "datePublished": "Fri, 27 Mar 2020 15:20:04 +0000",
            "description": "In this episode of TSB, it’s just Caesar, all by himself, in-studio. Well, New White Ranger is there too. The coronvirus has disrupted life throughout the entire country, sneakers included. In both the industry and community side of sneaker culture, people are questioning their priorities during this epidemic. The brand with the 3 Stripes had […]",
            "length": "90104826",
            "sourceUrl": "http://traffic.libsyn.com/sneakerbardetroit/Episode_256.mp3",
            "categories": [
                "Podcast",
                "The Sneaker Box Podcast"
            ]
        },
        {
            "title": "TSB Podcast: Episode 255 – New Balance teams up with the NBA to produce “AUTHENTIC” content",
            "datePublished": "Sat, 14 Mar 2020 13:23:11 +0000",
            "description": "In this episode of TSB, Caesar, Geeno and Dunks–aka SlamDunk–and Sarena are in-studio. Has Sarena finally come around on SB Dunks? Dunks and Geeno formed a short-lived alliance, only to have Dunks turn on Geeno for his lack of “cooking. We would probably be more impressed with the Sacai X Nike collabs if we hadn’t […]",
            "length": "87542742",
            "sourceUrl": "http://traffic.libsyn.com/sneakerbardetroit/TSB_EPISODE_255.mp3",
            "categories": [
                "Podcast",
                "The Sneaker Box Podcast"
            ]
        },
        {
            "title": "TSB Podcast: Episode 254 – CAN JORDAN BRAND PLEASE PUT THE AIR JORDAN 1 BACK IN THE VAULT?!",
            "datePublished": "Wed, 11 Mar 2020 21:23:30 +0000",
            "description": "In this episode of TSB, Caesar, Geeno, Guru, Dunks, and Sarena are in-studio. We spend the first few of the show clowning Dunks’ pair of Travis Scott X Nike SB Dunk Low. Now that Geeno has been promoted to VP of Pepsi, JumpmanBostic might finally get that Mt. Dew collab. Once again, we attempt to […]",
            "length": "99586623",
            "sourceUrl": "http://traffic.libsyn.com/sneakerbardetroit/TSB_Episode_254.mp3",
            "categories": [
                "Podcast",
                "The Sneaker Box Podcast"
            ]
        },
        {
            "title": "TSB Podcast: Episode 253 – Fresh from NBA All-Star weekend in Chicago",
            "datePublished": "Mon, 02 Mar 2020 15:31:43 +0000",
            "description": "In this episode of TSB, Caesar, Guru (late), Dunks, and Sarena are in-studio. A listener calls in to ask what alternate jersey–i.e., Michael Jordan #12 Bulls road jersey–Mitchell and Ness should release one day. Brands are still ignoring the vast segment of sneakerheads with large feet, why? We list the retros we want to see […]",
            "length": "106709509",
            "sourceUrl": "http://traffic.libsyn.com/sneakerbardetroit/TSB_Episode_253.mp3",
            "categories": [
                "Podcast",
                "The Sneaker Box Podcast"
            ]
        },
        {
            "title": "TSB Podcast: Episode 252 – The Nike Adapt BB 2.0 isn’t living up to expectations",
            "datePublished": "Fri, 21 Feb 2020 16:51:16 +0000",
            "description": "In this episode of TSB, Caesar, Guru, Geeno, and Sarena are in-studio. Reebok is starting to get their groove back. But can they maintain it? We discuss this year’s NBA All-Star releases, including the botched release of the Air Jordan “New Beginnings” Pack. The Nike Adapt BB 2.0 isn’t living up to expectations at HQ. […]",
            "length": "73829085",
            "sourceUrl": "http://traffic.libsyn.com/sneakerbardetroit/TSB_Episode_252.mp3",
            "categories": [
                "Podcast",
                "The Sneaker Box Podcast"
            ]
        },
        {
            "title": "TSB Podcast: Episode 251 – It’s not a good time to be a sneakerhead in China",
            "datePublished": "Fri, 14 Feb 2020 14:55:28 +0000",
            "description": "In Episode 251 of TSB, Caesar, Guru, Geeno, Dunks, and Sarena are in-studio. Dunks isn’t sure if he’s a hypebeast or not. In-N-Out finally made something appealing, and it wasn’t their food. Sarena ran into Wale and fanned out. Do sneakerheads buy sneakers more for looks or for comfort? Caesar goes in on this year’s […]",
            "length": "106711181",
            "sourceUrl": "http://traffic.libsyn.com/sneakerbardetroit/TSB_Podcast_Episode_251.mp3",
            "categories": [
                "Podcast",
                "The Sneaker Box Podcast"
            ]
        },
        {
            "title": "TSB Podcast: Episode 250 – Are hypebeast beginning to turn on Yeezys?",
            "datePublished": "Fri, 07 Feb 2020 14:11:36 +0000",
            "description": "In this episode of TSB, Caesar, Geeno, Dunks, and Sarena are in-studio. We celebrate recording our 250th episode, and Dunks was “DYING” to celebrate. (Inside joke). Caesar and David Banner become best friends after he writes an article about his Ewing Rogue collab. This past week had to be one of the weakest and worse […]",
            "length": "102259915",
            "sourceUrl": "http://traffic.libsyn.com/sneakerbardetroit/TSB_Episode_250.mp3",
            "categories": [
                "Podcast",
                "The Sneaker Box Podcast"
            ]
        },
        {
            "title": "TSB Podcast: Episode 249 – Honoring the Life of Kobe Bryant",
            "datePublished": "Thu, 30 Jan 2020 15:11:09 +0000",
            "description": "In this episode of TSB, Caesar, Guru, Geeno, Dunks, and Sarena are in-studio. We take time at the beginning of the show to talk about the life and legacy of Kobe Bryant. From his game to his sneakers, be definitely made an impact. We reached out to Jaysse Lopez, owner of Urban Necessities, over his […]",
            "length": "94147745",
            "sourceUrl": "http://traffic.libsyn.com/sneakerbardetroit/TSB_Podcast_Episode_249.mp3",
            "categories": [
                "Podcast",
                "The Sneaker Box Podcast"
            ]
        }
    ]
}