{
    "artwork": "http://is4.mzstatic.com/image/thumb/Music19/v4/35/65/c1/3565c18c-4036-e486-8e73-d92d99fd38e0/source/100x100bb.jpg",
    "description": "Contemporary drama in a rural setting",
    "feedURL": "https://podcasts.files.bbci.co.uk/b006qpgr.rss",
    "podcastURL": "http://www.bbc.co.uk/programmes/b006qpgr",
    "title": "The Archers",
    "episodes": [
        {
            "title": "12/11/2020",
            "datePublished": "Thu, 12 Nov 2020 19:15:00 +0000",
            "description": "Writers, Liz John & Katie Hims \nDirector, Kim Greengrass\nEditor, Jeremy Howe\n\nBen Archer ….. Ben Norris \nHelen Archer ….. Louiza Patikas  \nBrian Aldridge ….. Charles Collingwood \nJennifer Aldridge ….. Angela Piper\t\nAlice Carter ….. Hollie Chapman\t\nRuairi Donovan ….. Arthur Hughes \nJazzer McCreary ….. Ryan Kelly \nKirsty Miller ….. Annabelle Dowler \nJohnny Phillips ….. Tom Gibbons  \nLynda Snell ….. Carole Boyd \nRobert Snell …..Graham Blockey",
            "length": "12656000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p08xn642.mp3"
        },
        {
            "title": "11/11/2020",
            "datePublished": "Wed, 11 Nov 2020 19:10:00 +0000",
            "description": "Jennifer’s planning a grand dinner for Ruairi’s eighteenth tomorrow. She mentions to Alice how frail Lynda sounded in her appeal about help for the Christmas show on Radio Borsetshire. Alice notices her mum is rather jumpy, and wonders what’s wrong. Jennifer comes clean about Siobhan’s CD, and admits to being worried about what’s on it. She doesn’t want Ruairi distressed any more, but she can see she needs to let him listen to it when he wants to. Alice thinks her mum’s being amazing; it’s such a difficult balance to strike. They share memories of the awful time of the affair. Alice assures her mum she doesn’t mind if she wants to slag Siobhan off – she’s every right to feel that way still. Mother and daughter have a bonding moment.\nAs Ben and Ruairi search for the best glass and china for Ruairi’s birthday dinner, Ben ribs Ruairi about a long call to Troy. Ruairi admits that Troy is an ex. He worries whether Ben’s ok with it, but Ben’s more than ok – it means no competition for girls! Ruairi declares he’s bisexual, so that won’t necessarily work… They banter for a bit. Ruairi hasn’t told anyone else. He thinks Brian and Jennifer will be cool with it. But he’s worried about how his birth mum would have felt. Ben assures him Siobhan would be proud whatever. But Ruairi points out that he’ll never know now, will he?",
            "length": "12592000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p08xn5zt.mp3"
        },
        {
            "title": "10/11/2020",
            "datePublished": "Tue, 10 Nov 2020 19:10:00 +0000",
            "description": "Kirsty drops the bombshell to Helen that she and Philip are moving to Wales. They acknowledge they’ll miss one another, but Helen thinks it’s a great new start for Kirsty. And it will make sense for Philip too, to escape the ghosts of the Grey Gables explosion. They toast the news with prosecco. Kirsty suggests Helen buys her Beechwood house – and inherit the joy of Joy… The two of them have a joke about this and the garden, before Helen admits she’s seriously interested in giving this idea consideration.\n\nRuairi tells Brian about the CD from his mum. Brian’s angry with Ruairi’s Auntie Naimh for sending it, and loses it slightly. Jennifer brings more sensitivity to the proceedings, and shoos Brian out and talks to Ruairi. She sees the CD as a wonderful gift, and allays Ruairi’s fears as to what it might contain. She comments that Siobhan was a strong woman; Ruairi counters that Jennifer is the strongest woman he knows, and has given him all the love and care he needs. He’s scared hearing his mum might be too much. Jennifer advises him not to listen to the CD now, but to wait until he’s ready. She’s here for him and loves him, and that’s never going to change.",
            "length": "12528000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p08xn5tv.mp3"
        },
        {
            "title": "09/11/2020",
            "datePublished": "Mon, 09 Nov 2020 19:10:00 +0000",
            "description": "Johhny’s grateful to Jazzer for reuniting him with his winning scratchcard, and happy to do him any favour he asks. Jazzer plies him with strong homebrew, of which Johnny heartily approves. Johnny promises to spread the ‘craft beer’ word among his mates. Jazzer has his eye on a woman from his milk round. Johnny admires his confidence; he has no-one on the horizon himself. Jazzer offers to take Johnny under his wing – starting with a house party on Wednesday night. And he’ll provide some of his home brew free to Ruairi for his eighteenth. Then he can sit back and watch the orders roll in.\n\nLynda reports Freddie’s having no luck recruiting for the Christmas show, at which she’s outraged. She heads off on a mystery mission. To Robert’s delight he hears her later on Susan’s radio show, making an emotional plea to the community about how important the Christmas show is to her healing process. Well done Lyndy!\n\nBen still feels guilty about his mistake broadcasting the Brookfield find, and the resultant trashing of their land. He suggests a post-birthday rave for Ruairi – and eighteen and a half party. Searching among his cards for more money to fund it, Ruairi finds a CD. It’s a recording Siobhan made for him. He’s overcome, and can’t immediately think about listening to it. It’s his mum’s voice; what’s he supposed to do?",
            "length": "12544000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p08xn5q8.mp3"
        },
        {
            "title": "05/11/2020",
            "datePublished": "Thu, 05 Nov 2020 19:10:00 +0000",
            "description": "Freddie shows Lynda the new brochure for Grey Gables. Oliver was keen for her to see it. Both of them are jumpy at the loud bangs of Bonfire Night celebrations. Lynda likes the concept for the Christmas show. Freddie struggles to name which readings will feature. He confesses that only Bert Fry has responded to his callout for performers. Lynda explains that hardly anyone volunteered freely for her shows; she had to use the gentle art of manipulation. Freddie’s not sure he can match Lynda but she assures him that he can do it.  \nPhilip is angry to learn that Gavin didn’t go to the Gamblers Anonymous meeting. Kirsty tries to explain that she and Gavin have had a long chat and it’s ultimately got to be Gavin’s decision. Philip storms out. Later Kirsty tells Philip she thinks he’s being too hard on Gavin. She was impressed with Gavin’s maturity and self-awareness yesterday. Philip accepts that Kirsty is right and he’s being stubborn. Now Kirsty can see Gavin is putting his past behind him she can contemplate a move to Wales. They can finally think about their own little place, just the two of them.",
            "length": "12576000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p08xbxyb.mp3"
        },
        {
            "title": "04/11/2020",
            "datePublished": "Wed, 04 Nov 2020 19:10:00 +0000",
            "description": "While on the look-out for trespassers, David spots someone hiding in a ditch. But it turns out to be Eddie who says he’s scouting for holly and mistletoe. Eddie points out the evidence of more digging on Brookfield land which infuriates David. David finds a metal detector in a hedge and Eddie feigns innocence. \nWhen he gets back home, Eddie tells Will that David’s handing the metal detector in to the police – it shouldn’t be traceable though as it’s really old. Eddie’s volunteered himself, Will and Ed to help keep a lookout at Brookfield for any more rogue detectorists. Will can’t believe it but Eddie’s sure it’ll lead to a reward for the Grundys. \nPhilip forces Gavin to go to a Gamblers Anonymous meeting with Kirsty. Outside the meeting, Kirsty is sympathetic when Gavin shows that he’s not keen to go in. Gavin tells her that he just wants to be himself and that he doesn’t have a gambling problem… any more, he quickly adds. The pressure Philip’s business is under has made him stop and think. Kirsty’s happy for them just to head home but Gavin thinks his dad will blow a gasket. Kirsty thinks that maybe it’s time for Gavin to show Philip it’s his life.",
            "length": "12672000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p08xbwny.mp3"
        },
        {
            "title": "03/11/2020",
            "datePublished": "Tue, 03 Nov 2020 19:10:00 +0000",
            "description": "Ruth and David are under the impression that both Rex and Toby are OK about their Hollowtree tenancy coming to an end. Freddie’s asked David and Pip about taking part in the Christmas show – it seems he’s phoned the whole village but there’s little interest from anyone. \nRuth blames Ben for their location being publicised in connection with the coin find. David thinks Ben’s doing his best to make amends. Ben keeps watch after dark as it’s likely they’ll get more trespassers. He reports later that there was a pick-up parked where the cattle got out last week, but when he approached it quickly drove away. \nWhile Philip assesses some repair work at St Stephen’s, Shula reports to Kirsty her ordination training is keeping her busy along with running the Stables. Nice for some, says Kirsty. The Wildlife Trust job isn’t what she’d hoped, and Philip is scratching around for work. \nShula’s shocked to hear that Kirsty and Philip are thinking about moving to Wales. Kirsty feels it’s much more her thing than their current Beechwood home. But they can’t leave Ambridge at the moment, because of Gavin. Kirsty explains Gavin’s gambling problem to Shula and how Alistair has been a great help, but that Philip doesn’t seem to know how to deal with it. Following Shula’s advice, Kirsty suggests to Philip that Gavin is given some responsibility to prove that he can cope on his own. Kirsty worries Gavin might relapse. Philip’s certain that won’t happen.",
            "length": "12592000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p08x8nm2.mp3"
        },
        {
            "title": "02/11/2020",
            "datePublished": "Mon, 02 Nov 2020 19:10:00 +0000",
            "description": "Eddie drags Will along to Brookfield with a metal detector. Eddie’s sure there’s got to be more to find. While they’re there, they spot someone else with a detector. Eddie’s disgusted to find a group of people who tell him to get off their patch. He labels them ‘night hawkers’. Eddie reports to Ruth the carload of people with metal detectors, who’d said the location was on an online forum. Ruth calls Ben immediately.  \n\nAt Lily’s request, Johnny suggests her idea for the Christmas show to Freddie without letting on that it came from her. Freddie isn’t too keen but acknowledges that it would be easier than a full-scale panto. Later, Freddie asks Johnny about the show he saw that inspired his suggestion. Johnny tries to stall, but Freddie has already figured out that Lily put him up to it. The siblings bicker but ultimately Freddie comes out on top. He’s already put the concept for the show (Lily’s idea) to Elizabeth and Glen and they’ve approved it. What’s more he’s got a plan to make it Covid-secure. The only downside is that he won’t have a budget. But Lynda always managed with only voluntary effort so, how hard can it be?",
            "length": "12112000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p08x6170.mp3"
        },
        {
            "title": "29/10/2020",
            "datePublished": "Thu, 29 Oct 2020 19:10:00 +0000",
            "description": "Rex is gutted to learn from Pip that the tenancy at Hollowtree is coming to an end. Pip’s about to tell Toby when she’s interrupted by a message from Ruth – the Herefords have got out. Toby already knows about the tenancy from Rex. He understands, for which Pip is hugely grateful. \nDriving back from Felpersham, Ben takes a call from Ruth. She wants to get Ruairi a shirt for his 18th birthday but Ben thinks it’s a terrible idea. Ben’s feeling sorry for Ruairi about the birthday dinner party that Jennifer’s hosting – he’s turning 18 not 80! Suddenly Ben spots cattle all over the road. Once they’re all safely returned to the field Ruth and Ben discover the padlock securing the gate has been smashed. Ruth immediately connects the break-in with Ben’s radio interview, but he plays it cool, saying it could have been anyone and was probably a one-off. \nRex questions Pip about how she will benefit from he and Toby leaving Hollowtree. He’s annoyed she let him believe that she stood up for the Fairbrothers when her family were weighing up the decision to take back Hollowtree. Pip tries to explain but Rex is too angry. He no longer sees her friendship as genuine. Pip accuses him of taking the moral high-ground which he has no right to do. Her family’s duty to the farm and its future is paramount. Rex should stop wallowing in self-pity.",
            "length": "12352000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p08w5kmf.mp3"
        },
        {
            "title": "28/10/2020",
            "datePublished": "Wed, 28 Oct 2020 19:10:00 +0000",
            "description": "Ruth asks Ben to mention their barn venue in his interview with Susan. She thinks he’s due to talk about life as a student during coronavirus. In a pre-interview chat with Susan, Ben persuades her to first ask him about student life. During the interview Ben mentions the coins found at the dig and name drops Evie a number of times. Ben cringes when Susan dedicates a love song to him and Evie. Just before the end of the interview Ben quickly mentions Brookfield’s barn venue. Ruth tells Ben off for lying about the interview and for giving way their location. She softens at Ben’s worry about what Evie thought about it. To his relief Evie found it funny and they’re going to meet up. \nAt the eco-office, Alice snaps at Jennifer as she tries to find the details she needs for a meeting about the venison. Jennifer encourages her to take it easy as she doesn’t look well. Alice insists she’s fine. But during the meeting she was sick, and Jennifer has had to drive her home. Alice gets even grumpier with Jennifer when she suggests getting help with morning sickness. Alice then calms down and Jennifer offers to get her anything that she needs. Alice replies that Jennifer can’t do that; she’s got to deal with this on her own.",
            "length": "12672000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p08w5k3l.mp3"
        },
        {
            "title": "27/10/2020",
            "datePublished": "Tue, 27 Oct 2020 19:10:00 +0000",
            "description": "Lily tries to find out if Elizabeth has any more dates with Vince planned and then appeals for her mum’s help in getting Freddie to share his ideas for the Christmas show. Elizabeth prepares for a meeting with the Lower Loxley trustees and bats away Lily’s requests. \nChair of the Lower Loxley Trust, Bernard, quizzes Elizabeth about Freddie undertaking a Christmas show. He warns her that Freddie needs to show he is suitable to become custodian of Lower Loxley and this will be a very public test. Elizabeth vents to Lily about Bernard’s warning, which strengthens Lily’s concerns about Freddie’s capability. But Elizabeth has every faith that Freddie will show the trustees what they need to see. Meanwhile their Halloween event, organised by Lily, is looking great. \nSusan and Keira call on Alice. Alice tries to drop hints that she’d like to be alone but Susan gets teary remembering her mum, and Alice softens. They share memories of Ivy, and Alice gives in to Susan’s company for a while. Susan complains about her dad and then goes into detail about her brother, Stewart. He has a history of problem drinking. Unsympathetic Susan points out that these days he’d be called an alcoholic and told it’s a disease. She comments that if it was herself or Alice in his position, they’d see the hurt and damage they were causing, wouldn’t they?",
            "length": "12720000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p08w5jf9.mp3"
        },
        {
            "title": "26/10/2020",
            "datePublished": "Mon, 26 Oct 2020 19:10:00 +0000",
            "description": "Ben’s glum now the archaeology students have finished their project at Brookfield. He’s not keen to get in touch with Evie without a reason and jumps at Susan’s enquiry for her radio show, but Ruth says no. Ben’s day goes from bad to worse when he learns he’s not part of Ruairi’s birthday plans. Ruairi’s sorry – it was organised by a school friend. Ruairi suggests to Ben that he finds a way to get round Ruth’s refusal to let him go on Susan’s show. Ben decides to talk about the dig on Susan’s show, agreeing it with her and planning to be ‘surprised’ by the question. Ruairi thinks it’s a terrible plan, but Ben’s oblivious. He’s got the result he was after; he and Evie are now in touch. \nWith Pip feeling bad about ending Rex and Toby’s tenancy at Hollowtree, Josh points out it’s necessary in order for Brookfield to survive. Pip thinks it’s too soon with Josh’s egg business not yet off the ground. But Josh has a meeting with the bank. Since his machinery business trouble he’s doing everything properly this time. The meeting is tough but Josh is approved for a loan. Now they really do need to give notice to Rex and Toby. Someone’s going to have to tell them.",
            "length": "12640000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p08w5dyp.mp3"
        },
        {
            "title": "22/10/2020",
            "datePublished": "Thu, 22 Oct 2020 18:15:00 +0000",
            "description": "Elizabeth and Vince meet for lunch. He’s not bothered by Lily’s outburst yesterday. It shows she cares at least – his children don’t take any interest in him. Back home, Elizabeth suggests to Lily and Freddie that could put any questions they have about Vince to him directly. To Lily and Freddie’s horror, the doorbell rings…\nThings start awkwardly between Vince and the twins, before Vince takes charge of the situation. He couldn’t care less what they think of him but he thinks it looks bad on them to be judging him based on gossip. Freddie and Lily report back to Elizabeth on their chat with Vince. They’re both still concerned about their mum dating him, but Elizabeth is sure she can handle Vince. \nRuth reports that the archaeology students haven’t unearthed any finds from their investigations at Brookfield. Pip rolls her eyes at Ben chasing after Evie. Later, Pip and Josh argue over the use of a field – Josh says David gave him the OK to move his hens there but Pip needs it for heifers and she overrules Josh. Josh explains he needs space to expand his egg business as it’s the only way to stay afloat. There’s an impasse. They take the problem to Ruth who considers both of their needs as equally important – they just need to find the space. It looks like the only option is to use Hollowtree for the hens – which would mean evicting the Fairbrothers.",
            "length": "12384000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p08vps3r.mp3"
        },
        {
            "title": "21/10/2020",
            "datePublished": "Wed, 21 Oct 2020 18:15:00 +0000",
            "description": "Lily quizzes Elizabeth about where she’s going and gets out of her that she has met a man who is single. While Elizabeth is at a seminar, Lily wonders why she isn’t answering her phone. She declares she’d going to find her. Freddie tells her to stop freaking out. Lily explains that she is concerned about their mum because of the time she cared for her during her depression. Freddie’s sympathetic. He’s pleased Lily told him how hard that time was. Lily hopes Freddie will now come with her to the seminar but Freddie refuses. \nHarrison and Rex run up Lakey Hill, both feeling unfit. They agree that Chris is going to be a great dad. Harrison talks to Rex about Fallon not wanting children. He admits he probably does want kids but he’s not sure how much he wants them. Later, Harrison tells Fallon that he doesn’t want a child if it means he will not have Fallon. \nLily had spotted Vince whispering to Elizabeth at the seminar, but Elizabeth’s cross that Lily went to spy on her. Freddie and Lily aren’t complimentary about Vince, but Elizabeth says she’s having fun. Lily says she just wanted to save Elizabeth from any extra stress but Elizabeth points out that Lily’s actions have merely increased it. She’s having lunch with Vince tomorrow so that she can apologise for Lily’s behaviour.",
            "length": "12592000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p08vps0q.mp3"
        },
        {
            "title": "20/10/2020",
            "datePublished": "Tue, 20 Oct 2020 18:15:00 +0000",
            "description": "Whilst no more coins have been found, Ruth’s surprised to hear that Pip would give up farming if they got rich from the discovery of a hoard on Brookfield land. Pip’s struggling with Rosie’s behaviour at the moment. Ruth outlines her idea of expanding the dairy herd which Pip thinks is a great idea. Meanwhile, Pip is confident that they have secured funding towards their rewilding project. Rex’s urgent meeting with Tom has gone well too. They plan to celebrate but Pip gets a text from Toby who’s having a bad time with Rosie and needs Pip’s help.   \nFallon and Harrison have an afternoon off together. Harrison notices Fallon’s not her usual self. Eventually Fallon admits that the news of Alice’s pregnancy has made her realise that she never wants kids herself. Fallon’s keen to know how Harrison feels. He’s sanguine. He thought they might have children one day but he’ll get over it. Fallon is apologetic but Harrison tells her to stop – they both love one another and that’s all that matters. Later that night, Fallon tells Harrison she would understand if he wanted to leave her to find someone who did want kids. He assures her he has all that he wants with her, but she makes him promise to give it some more real thought.",
            "length": "12624000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p08vprwy.mp3"
        },
        {
            "title": "19/10/2020",
            "datePublished": "Mon, 19 Oct 2020 18:15:00 +0000",
            "description": "Lily ponders Halloween while Elizabeth gets ready to go out. Freddie invites himself and Lily along but Elizabeth politely turns them down. Freddie tells Lily it’s clear that their mum has a date. He moves on to his thoughts for a Christmas Show but Lily’s preoccupied with the thought that Elizabeth is on a date. Freddie reassures her that their mum will be fine. They watch a DVD of village pantos from the 1990s that Lynda lent Freddie. They agree panto isn’t the right thing to do this year. \nPhilip shows Kirsty some cottages he’s been looking at after their conversation about getting away last week. Kirsty’s surprised but Philip lays out his argument – he’s had enough of the building business and her work isn’t all that secure. \nWhile waiting for her date to arrive, Elizabeth is accosted by Vince. He offers to buy her a drink. They discuss business seminars. Elizabeth confronts Vince about his reputation for ruthlessness. Vince insists he’s a different person at home. On her return, Freddie and Lily quiz Elizabeth but she tells them to mind their own business. Although she does reveal she thinks she will have a second date with the person she’s met this evening.",
            "length": "12432000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p08vprrj.mp3"
        },
        {
            "title": "15/10/2020",
            "datePublished": "Thu, 15 Oct 2020 18:15:00 +0000",
            "description": "The archaeology students descended on Brookfield at the crack of dawn. After dropping Freddie off to join them, Elizabeth catches up with Ruth. Ruth is excited about the possibilities of what could be buried at Brookfield. Meanwhile, Elizabeth asks if Freddie can get some health and safety pointers from Brookfield as he takes on the mantle of producing the village’s Christmas Show.\nWhile at work, Philip fondly remembers camping trips when Gavin was a kid. But Gavin tells him he remembers those times very differently – he didn’t enjoy them as much as Philip thought. Then, as now, Gavin is always having to do things Philip’s way and he’s fed up. Philip defuses Gavin’s frustrations by telling him he’s proud of him and grateful for him taking all the flak.\nAt the end of the day Elizabeth catches up with Ben. He’s a little fed up; the students are a bit too focused on their task. Elizabeth suggests he just needs to get to know them better. \nKirsty is reporting the litter situation to the Wildlife Trust board. Philip is feeling down and asks Kirsty when their luck is going to change. Philip floats the idea of making a fresh start somewhere else. He doesn’t think he can take life as it is at the moment for much longer.",
            "length": "12448000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p08tl3fb.mp3"
        },
        {
            "title": "14/10/2020",
            "datePublished": "Wed, 14 Oct 2020 18:15:00 +0000",
            "description": "Gavin’s not feeling great ahead of his meeting with Alistair. Kirsty tries to give him a boost, telling him he’s got a lot going for him. She’s sorry they got off on the wrong foot initially and explains she didn’t understand then what he’s going through.\nGavin meets Alistair but feels like he’s wasting his time. When Alistair asks about Gavin’s gambling he struggles to answer so Alistair outlines his own experience. He says he can trace back what lay behind his gambling addiction to the death of his mother. Alistair then goes on to his relationship with his dad and how he’s tried to do things differently with his son, Dan. Gavin doesn’t reckon he deserves the happiness of fatherhood. Gavin admits he’s been living a certain way that’s made him easy money but he’s realising it’s wrong and it’s got to change. Alistair reassures him that once he’s made that decision to change things do get easier. Gavin is buoyed by their chat – he knows what he has to do now.\nAlice calls Emma to try to make up with her but Emma is still angry. Alice apologises and asks to put their differences aside for Chris’s sake; he’s really looking forward to being a dad. Emma admits that she doesn’t like Alice but accepts they don’t have to be at each other throats. Then Alice comments that making peace is important for the baby. This inflames Emma who thinks Alice has an agenda; she warns Alice that she will have her to answer if she drinks during pregnancy.",
            "length": "12624000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p08tl3s3.mp3"
        },
        {
            "title": "Making Mince Pies with Jill Archer",
            "datePublished": "Mon, 09 Dec 2019 10:30:00 +0000",
            "description": "Join Jill in the kitchen at Brookfield as she makes a batch of her much loved mince pies",
            "length": "12320000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p07xbjsz.mp3"
        }
    ]
}