{
    "artwork": "http://is3.mzstatic.com/image/thumb/Music122/v4/87/64/b3/8764b3e4-5f2e-832a-1a48-2c04745eb853/source/100x100bb.jpg",
    "description": "If you're new to backpacking, or if you’re hopelessly in love with someone who wants you to love backpacking, then this podcast is for you. We’ll talk about the essentials, how to lighten your load, and how to make the most of your time on the trail. New episodes every Tuesday.",
    "feedURL": "http://www.thefirst40miles.com/feed/",
    "podcastURL": "http://www.thefirst40miles.com",
    "publisher": "Heather",
    "title": "The First 40 Miles: Hiking and Backpacking Podcast",
    "episodes": [
        {
            "title": "214: The Final Episode",
            "datePublished": "Tue, 18 Dec 2018 14:00:16 +0000",
            "description": "<p>Today on the First 40 Miles, we’re wrapping up production of The First 40 Miles with today’s final episode.  We’ll share some of our ideas for podcasts we’d love to see started, talk a little about what it’s been like to share our backpacking adventures with ya’ll, then wrap up with a little trail wisdom that brings it all full circle.</p>",
            "length": "41329920",
            "sourceUrl": "http://media.blubrry.com/thefirst40miles/content.blubrry.com/thefirst40miles/TFFM214.mp3",
            "categories": [
                "Uncategorized"
            ]
        },
        {
            "title": "213: Health Benefits of Backpacking",
            "datePublished": "Tue, 11 Dec 2018 14:00:11 +0000",
            "description": "<p>Today on the First 40 Miles, if you haven’t figured it out by experience, then we’ll give you one more huge reason to begin backpacking…the health benefits!  The list of health benefits ishuge!  Then our SUMMIT Gear Review today is a 22 pound piece of gear…but hear us out…it’s 100% backpackable and incredibly fun!</p>",
            "length": "25377024",
            "sourceUrl": "http://media.blubrry.com/thefirst40miles/content.blubrry.com/thefirst40miles/TFFM213.mp3",
            "categories": [
                "Uncategorized",
                "health benefits",
                "stand up paddle board",
                "SUP"
            ]
        },
        {
            "title": "212: PLAY: Games on the Trail",
            "datePublished": "Tue, 04 Dec 2018 14:00:09 +0000",
            "description": "<p>Today on the First 40 Miles,  who says you can’t have type one fun <em>and</em> type two fun on a backpacking trip?  Today’s episode explores games on the trail and how to make memories without bringing Monopoly.  You’ll learn 5 super fast, super fun games that you can play on  your next wilderness backpacking adventure or use to break the ice at your next board meeting.  Then, we’ll review a love it or hate it nano game that, for mere grams, will earn its spot in your pack.</p>",
            "length": "24564864",
            "sourceUrl": "http://media.blubrry.com/thefirst40miles/content.blubrry.com/thefirst40miles/TFFM212.mp3",
            "categories": [
                "Uncategorized",
                "card table",
                "cards",
                "games",
                "nano games"
            ]
        },
        {
            "title": "211: Gear That Lasts the Miles",
            "datePublished": "Tue, 27 Nov 2018 14:00:44 +0000",
            "description": "<p>Today on the First 40 Miles, we love our listeners!  And we love hearing their stories!  Then, even if you never plan to do a thru hike, you can still scam some of their best gear hacks and incorporate them into your next overnighter.  Next, a gear review that will outfit you in the toughest clothes on the planet.  And a hack that as easy as sticking a piece of tape to a tent pole. </p>",
            "length": "22488960",
            "sourceUrl": "http://media.blubrry.com/thefirst40miles/content.blubrry.com/thefirst40miles/TFFM211.mp3",
            "categories": [
                "Uncategorized",
                "backpacking clothing",
                "hiking pants",
                "listener story"
            ]
        },
        {
            "title": "210: Battle of the Utensil",
            "datePublished": "Tue, 20 Nov 2018 14:00:07 +0000",
            "description": "<p>Today on the First 40 Miles, maybe you want to eat like royalty on the trail—but you don’t need a 15 piece place setting to make that happen.  What does it take to shovel food from your cook pot to your mouth?  Then we’ll talk about our top 5 favorite post trip meals.  Then, what are our recommendations for backpacking gear that can go seamlessly from trail to off-trail lunchbox?  And we’ll wrap things up with a quote from our favorite Dutch Post-Impressionist painter.</p>",
            "length": "22025856",
            "sourceUrl": "http://media.blubrry.com/thefirst40miles/content.blubrry.com/thefirst40miles/TFFM210.mp3",
            "categories": [
                "Uncategorized",
                "backpacking food",
                "dollar tree food",
                "utensils"
            ]
        },
        {
            "title": "209: Hidden Messages in Your Gear",
            "datePublished": "Tue, 13 Nov 2018 14:00:01 +0000",
            "description": "<p>Today on the First 40 Miles, have you ever given much thought to the names that companies give gear?  The name of your pack or your tent isn’t just some random name they pulled out of a hat.   Next, today’s top 5 list is a whole pile of hacks I picked up on my recent backpacking trip.  Then, a little SteriPEN that is a backpackers dream!  And a quick hack that has been on every single one of our backpacking trips.</p>",
            "length": "27816960",
            "sourceUrl": "http://media.blubrry.com/thefirst40miles/content.blubrry.com/thefirst40miles/TFFM209.mp3",
            "categories": [
                "Uncategorized",
                "backpack hacks",
                "packs",
                "Steripen"
            ]
        },
        {
            "title": "208: HEAVY: When You Can’t Carry the Load",
            "datePublished": "Tue, 06 Nov 2018 14:00:34 +0000",
            "description": "<p>Today on the First 40 Miles, we've heard people say “I’d love to go backpacking like I did when I was younger, but I <em>just can’t carry the load</em>.”  Are their backpacking days truly over?  Then, what do you do when a trail mate is injured, sick or fatigued and <em>can’t</em> carry the load.  For the SUMMIT Gear Review, something that will change the way you think of transporting your gear.  And we’ll teach you how native peoples transported goods using a few sticks.</p>",
            "length": "32614656",
            "sourceUrl": "http://media.blubrry.com/thefirst40miles/content.blubrry.com/thefirst40miles/TFFM208.mp3",
            "categories": [
                "Uncategorized",
                "injury",
                "Pack Wheel",
                "travois"
            ]
        },
        {
            "title": "207: Scary Stuff",
            "datePublished": "Tue, 30 Oct 2018 13:00:11 +0000",
            "description": "<p>Today on The First 40 Miles, we’ve dredged up as many scary things as we can for this Halloween episode.  Cougar attacks, mysterious items in hiker boxes, dead cats and the scariest thing of all—hiker stink.  Then we’ll wrap up today’s episode with a quote from a zombie.  Actually it’s just a quote from someone’s posthumously published journal.  They’re dead, but they’re alive!  (But they’re dead.)</p>",
            "length": "29253120",
            "sourceUrl": "http://media.blubrry.com/thefirst40miles/content.blubrry.com/thefirst40miles/TFFM207.mp3",
            "categories": [
                "Uncategorized",
                "cougars",
                "games",
                "Halloween",
                "hiker stink",
                "John Muir"
            ]
        },
        {
            "title": "206: Backpacking Dinner Challenge",
            "datePublished": "Tue, 23 Oct 2018 13:00:18 +0000",
            "description": "<p>Today on the First 40 Miles, we’ve dumped out our box of random backpacking food, affectionately labeled, our “Bucket o’ Calories”, and will go head to head today as Josh and I battle it out, civilly, for the Backpacking Dinner Challenge.  Can we each create a unique meal with just the pile of ingredients in front of us?  We’ll find out.  Then we’ll eat dinner.  </p>",
            "length": "16090752",
            "sourceUrl": "http://media.blubrry.com/thefirst40miles/content.blubrry.com/thefirst40miles/TFFM206.mp3",
            "categories": [
                "Uncategorized",
                "backpacking food",
                "dinner"
            ]
        },
        {
            "title": "205: Steve’s Trip Report",
            "datePublished": "Tue, 16 Oct 2018 13:00:55 +0000",
            "description": "<p>Today on the First 40 Miles, we’re checking in with our friend Steve, who completed a thru hike of the Oregon section of the Pacific Crest Trail this summer.  And we’ll throw in a backpack hack and some trail wisdom, just for funsies.</p>",
            "length": "21801216",
            "sourceUrl": "http://media.blubrry.com/thefirst40miles/content.blubrry.com/thefirst40miles/TFFM205.mp3",
            "categories": [
                "Uncategorized",
                "Pacific Crest Trail"
            ]
        },
        {
            "title": "204: So, How Was Your Hike?",
            "datePublished": "Tue, 09 Oct 2018 13:00:03 +0000",
            "description": "<p>Today on the First 40 Miles, maybe you’ve posted a few pics of your backpacking trip on social media, and now everyone is asking you “So…How was your trip?”  What’s the best way to respond?  Then we have a listener story from Mason who let his adventures lead to creating a business that helps others experience adventure.  Then we’ll share a hack that may just awaken you to a possible feature on your oven or toaster oven. </p>",
            "length": "22687872",
            "sourceUrl": "http://media.blubrry.com/thefirst40miles/content.blubrry.com/thefirst40miles/TFFM204.mp3",
            "categories": [
                "Uncategorized",
                "backpacking",
                "food dehydrator"
            ]
        },
        {
            "title": "203: Pardon Our Dust",
            "datePublished": "Tue, 02 Oct 2018 13:00:00 +0000",
            "description": "<p>Today on the First 40 Miles, all of our backpacking gear is in moving boxes, sitting in the barn, waiting for us to unpack them!  We’re keeping the podcast going through our move, and we couldn’t have done it without a few of our fabulous listeners who will be contributing to the show today. </p>",
            "length": "16571520",
            "sourceUrl": "http://media.blubrry.com/thefirst40miles/content.blubrry.com/thefirst40miles/TFFM203.mp3",
            "categories": [
                "Uncategorized",
                "cowboy camping",
                "listener stories"
            ]
        },
        {
            "title": "202: The Slow, Methodical Accumulation of Gear",
            "datePublished": "Tue, 25 Sep 2018 13:00:29 +0000",
            "description": "<p>Today on the First 40 Miles, so you’re convinced! Backpacking is your new thing and you’re headed out to buy the latest and best of everything from the packing list.  Wait!  We’ll share a few reasons to slow down before you buy.  Then we’ve got a 4-in-1 piece of gear that will keep you warm and protected from the elements.  For today’s hack, a simple paradigm shift that will give you the most psychological bang for your buck when it comes to using your stove.</p>",
            "length": "24253824",
            "sourceUrl": "http://media.blubrry.com/thefirst40miles/content.blubrry.com/thefirst40miles/TFFM202.mp3",
            "categories": [
                "Uncategorized",
                "backpacking gear",
                "fuel",
                "poncho"
            ]
        },
        {
            "title": "201: Cowboy Camping",
            "datePublished": "Tue, 18 Sep 2018 13:00:53 +0000",
            "description": "<p>Today on the First 40 Miles, we’ll talk about cowboy camping and why we tried it.  Then a story from a listener about how she transitioned from car camping to backpacking.  Today’s hack is a great way to repurpose an old towel, and we’ll wrap up with a little trail wisdom from someone who knew the answer to life’s question!</p>",
            "length": "27776640",
            "sourceUrl": "http://media.blubrry.com/thefirst40miles/content.blubrry.com/thefirst40miles/TFFM201.mp3",
            "categories": [
                "Uncategorized",
                "cowboy camping",
                "tentless"
            ]
        },
        {
            "title": "200: A Week on the Pacific Crest Trail",
            "datePublished": "Tue, 11 Sep 2018 13:00:25 +0000",
            "description": "<p>Today on the First 40 Miles, we’re live on the Pacific Crest Trail!</p>",
            "length": "16233984",
            "sourceUrl": "http://media.blubrry.com/thefirst40miles/content.blubrry.com/thefirst40miles/TFFM200.mp3",
            "categories": [
                "Uncategorized",
                "compression sacks",
                "Pacific Crest Trail",
                "paracord"
            ]
        },
        {
            "title": "199: REFLECTIONS:  The Four Year Anniversary of Our First Backpacking Trip Together",
            "datePublished": "Tue, 04 Sep 2018 13:00:22 +0000",
            "description": "<p>Today on the First 40 Miles, we get a little nostalgic whenever September rolls around.  This week marks the 4 year anniversary of <em>our</em> first 40 miles—the trip Josh and I took together with friends around Mt. Hood.  And even though we’ve been backpacking for a few years, there are still things that take us by surprise.  Next, for today’s SUMMIT Gear Review, a headlamp that doubles as a flashlight and triples as a stand up torch.  Then we’ll share a hack that will make your next trip to the bathroom rock.  And we’ll leave you with a little trail wisdom that will help you understand your human connection with nature.</p>",
            "length": "31628544",
            "sourceUrl": "http://media.blubrry.com/thefirst40miles/content.blubrry.com/thefirst40miles/TFFM199.mp3",
            "categories": [
                "Uncategorized",
                "bathroom",
                "catholes",
                "headlamp",
                "Mt. Hood"
            ]
        },
        {
            "title": "198: Rewired Backpacking Brain",
            "datePublished": "Tue, 28 Aug 2018 13:00:12 +0000",
            "description": "<p>Today on the First 40 Miles, wilderness backpacking has the power to rewire your brain—and we’ll share the top 5 ways it’s changed us.  Then, an epic way to stay clean while backpacking.  Next a listener shares her one pound solution for oil painting on the trail.  And we'll wrap up with a little trail wisdom from our good friend on the trail, John Muir.</p>",
            "length": "27327744",
            "sourceUrl": "http://media.blubrry.com/thefirst40miles/content.blubrry.com/thefirst40miles/TFFM198.mp3",
            "categories": [
                "Uncategorized",
                "backpacking brain",
                "oil painting"
            ]
        },
        {
            "title": "197: Anxiety on the Trail",
            "datePublished": "Tue, 21 Aug 2018 13:00:57 +0000",
            "description": "<p>Today on the First 40 Miles, when hiking or backpacking, our whole goal is to move forward, otherwise we’d just set up our tent in the parking lot.  But what do you do when anxiety stops your progress?  We have some tools that will help.  Then we’ll share a hack that will cut your tent weight almost in half.  Then we’ll wrap up the show with a quote that revives fire from the ashes.</p>",
            "length": "25143936",
            "sourceUrl": "http://media.blubrry.com/thefirst40miles/content.blubrry.com/thefirst40miles/TFFM197.mp3",
            "categories": [
                "Uncategorized",
                "anxiety",
                "breathing",
                "tent"
            ]
        },
        {
            "title": "196: Lightning Safety",
            "datePublished": "Tue, 14 Aug 2018 13:00:31 +0000",
            "description": "<p>Today on the First 40 Miles, I was wondering what today’s episode should be about… and then it struck me.   Today we’ll chat about lightning safety.  Nothing shocking.  We promise to conduct ourselves appropriately.  Then ya’ll get to hear a little story from Steve about his friend’s top secret backpacking spot.  Next, we’ll test some backpacking energy bars and wrap it up with a great resource from National Outdoor Leadership School (NOLS) on everything you ever wanted to know about backcountry lightning safety.</p>",
            "length": "28503552",
            "sourceUrl": "http://media.blubrry.com/thefirst40miles/content.blubrry.com/thefirst40miles/TFFM196.mp3",
            "categories": [
                "Uncategorized",
                "lightning",
                "safety"
            ]
        },
        {
            "title": "195: A LONG HIKE: Prepping for a Weeklong Trip",
            "datePublished": "Tue, 07 Aug 2018 13:00:43 +0000",
            "description": "<p>Today on the First 40 Miles, this week we’ll talk about an upcoming weeklong trip and what we’re doing to prepare.  Then, if you’ve got an itch to hit the trail, but you have no gear, we’ll hook you up with a company who can supply the gear for your first trip.  For today’s Backpack Hack for the Week, Josh picked the perfect app for our upcoming backpacking adventure.  And we’ll share a little trail wisdom from someone who didn’t do anything halfway.</p>",
            "length": "31119360",
            "sourceUrl": "http://media.blubrry.com/thefirst40miles/content.blubrry.com/thefirst40miles/TFFM195.mp3",
            "categories": [
                "Uncategorized",
                "app",
                "hiking",
                "kids",
                "PCT",
                "prep"
            ]
        },
        {
            "title": "194: The Womens’ Advantage",
            "datePublished": "Tue, 31 Jul 2018 13:00:10 +0000",
            "description": "<p>Today on the First 40 Miles, if you think that men have the natural advantage on the trail, think again.  Then for the Summit Gear Review, an STP device that levels the playing field when it comes to using the bathroom.  Next, our kids’ favorite go-to site for looking up hiking and backpacking trails.  And we’ll wrap up the show with a little trail wisdom from the American Government.</p>",
            "length": "29486208",
            "sourceUrl": "http://media.blubrry.com/thefirst40miles/content.blubrry.com/thefirst40miles/TFFM194.mp3",
            "categories": [
                "Uncategorized",
                "stand-to-pee",
                "women"
            ]
        },
        {
            "title": "193: The First Step",
            "datePublished": "Tue, 24 Jul 2018 13:00:08 +0000",
            "description": "<p>Today on the First 40 Miles, we love getting audio recordings from our listeners—and today we have one from a new backpacker who figured out his own way of doing things.  Then, on the SUMMIT Gear Review, a titanium tool inspired by a Japanese gardening knife.  Next, a hammock hack that will turn any blanket or sleeping bag into an underquilt.  And we’ll wrap it up with a little trail wisdom from the third best-selling poet of all time—right behind Shakespeare and Laozi.</p>",
            "length": "27126528",
            "sourceUrl": "http://media.blubrry.com/thefirst40miles/content.blubrry.com/thefirst40miles/TFFM193.mp3",
            "categories": [
                "Uncategorized",
                "beginner",
                "hammock",
                "titanium",
                "trowel",
                "Vargo"
            ]
        },
        {
            "title": "192: Getting Back to Basics",
            "datePublished": "Tue, 17 Jul 2018 13:00:39 +0000",
            "description": "<p>Today on the First 40 Miles, sometimes life gets out of control—and when that happens, it’s time to get back to basics.  We’ll talk a little about how to simplify your trip.  Then, the Top 5 ways that backpacking can make you more effective, more productive, and less stressed.  Next, if you’ve always wondered how Native Americans hung their laundry to dry before clothespins were invented, we’ve got something you might be interested in.  Then we’ll share a simple, one ingredient backpack hack for your next trip.</p>",
            "length": "28801536",
            "sourceUrl": "http://media.blubrry.com/thefirst40miles/content.blubrry.com/thefirst40miles/TFFM192.mp3",
            "categories": [
                "Uncategorized",
                "basics",
                "survival",
                "wilderness"
            ]
        },
        {
            "title": "191: Micro Improvements",
            "datePublished": "Tue, 10 Jul 2018 13:00:55 +0000",
            "description": "<p>Today on the First 40 Miles, how would you do things differently next time?  Today we’re talking micro improvements.  Then on our Top 5 List, we’ll share why we prioritize backpacking.  If you’re looking for a way to bring a game and lighten your load, we have a fun option for you.  And, a hack that will make you rethink toilet paper.</p>",
            "length": "26448384",
            "sourceUrl": "http://media.blubrry.com/thefirst40miles/content.blubrry.com/thefirst40miles/TFFM191.mp3",
            "categories": [
                "Uncategorized",
                "games",
                "paper and pencil",
                "toilet paper"
            ]
        },
        {
            "title": "190: COLD + HUNGRY: The Stoveless Cooking Episode",
            "datePublished": "Tue, 03 Jul 2018 13:00:36 +0000",
            "description": "<p>Today on the First 40 Miles, what you may have thought of as an essential piece of backpacking gear isn't as indispensable as you think.  Today, we’re going stoveless, and we’ll share some delicious ways to ditch the stove for your next trip.  Then we’ll taste test a whole food, energy bar that has some sneaky vegetables added.  And we’ll share a thru hiker’s go to container for soaking their meals.</p>",
            "length": "20441856",
            "sourceUrl": "http://media.blubrry.com/thefirst40miles/content.blubrry.com/thefirst40miles/TFFM190.mp3",
            "categories": [
                "Uncategorized",
                "backpacking food",
                "backpacking food tips",
                "stoveless"
            ]
        },
        {
            "title": "189: What is Real?",
            "datePublished": "Tue, 26 Jun 2018 13:00:05 +0000",
            "description": "<p>Today on the First 40 Miles, what is real?  Social media does a pretty bang-up job of convincing us that everything that’s posted is real, but we’re smart enough to know better.  Today, we’ll call their bluff and prove that being outdoors is about as real as it gets.  Then we’ll review a headlamp that uses a unique swipe gesture to boldly illuminate your path.   Today’s hack is a cheap, easy way to store and access your ten essentials.</p>",
            "length": "28151040",
            "sourceUrl": "http://media.blubrry.com/thefirst40miles/content.blubrry.com/thefirst40miles/TFFM189.mp3",
            "categories": [
                "Uncategorized",
                "headlamp",
                "social media",
                "ten essentials",
                "trends",
                "ziptop bags"
            ]
        },
        {
            "title": "188: Wise Words from a Old Mountain Goat",
            "datePublished": "Tue, 19 Jun 2018 13:00:29 +0000",
            "description": "<p>Today on the First 40 Miles, are you over 50, 60, 70 and wondering if it’s too late to begin backpacking?  It’s never too late.  We’ll share some wise words from an old mountain goat.  Then, on the SUMMIT Gear Review, an unassuming flashlight that packs a ton of power, versatility and technology into 23 little grams.   And we’ll share an easy way to cut your trash in half—mathematically.</p>",
            "length": "31024896",
            "sourceUrl": "http://media.blubrry.com/thefirst40miles/content.blubrry.com/thefirst40miles/TFFM188.mp3",
            "categories": [
                "Uncategorized",
                "backpacking books",
                "flashlight",
                "trash"
            ]
        },
        {
            "title": "187: How Would You Describe Your First Backpacking Trip?",
            "datePublished": "Tue, 12 Jun 2018 13:00:03 +0000",
            "description": "<p>Today on the First 40 Miles, still wondering what your first backpacking trip will be like?  We think we can boil it down to five words.  Then, we’ve found a solar charger that will not only power your electronics, but also rolls up to the size of a Payday candy bar.  And a hack for all you hammock hangers out there—sorry ground dwellers.</p>",
            "length": "28745472",
            "sourceUrl": "http://media.blubrry.com/thefirst40miles/content.blubrry.com/thefirst40miles/TFFM187.mp3",
            "categories": [
                "Uncategorized",
                "hammock",
                "solar charger"
            ]
        },
        {
            "title": "186: TRAILS: A Little Light Trail Maintenance",
            "datePublished": "Tue, 05 Jun 2018 13:00:04 +0000",
            "description": "<p>Today on the First 40 Miles,  I used to believe that trails just existed and that they were just the well-worn footpaths created by thousands of people walking those same miles over and over.  Nope.  Trails are made and maintained.  Today we’ll talk about some things you can do to help.  Then, if you’ve always wanted to pack a chainsaw for clearing fallen trees on the trail, but just didn’t have enough room in your pack…we have a solution.  And we’ll share a hack that will upcycle your favorite old cotton t-shirt and give it some trail time.</p>",
            "length": "30386304",
            "sourceUrl": "http://media.blubrry.com/thefirst40miles/content.blubrry.com/thefirst40miles/TFFM186.mp3",
            "categories": [
                "Uncategorized",
                "bandanas",
                "saws",
                "trail maintenance"
            ]
        },
        {
            "title": "185: Weekend with Friends",
            "datePublished": "Tue, 29 May 2018 13:00:35 +0000",
            "description": "<p>Today on the First 40 Miles, within 24 hours we hiked a cumulative 25 miles, ate about 15 pounds of food, built three teepees and breathed in more campfire smoke than the Surgeon General would recommend.  Today you’ll hear a trip report from our adventure with our friends who have never been backpacking before.  And we’ll share a hack for DIY soap sheets.</p>",
            "length": "30619776",
            "sourceUrl": "http://media.blubrry.com/thefirst40miles/content.blubrry.com/thefirst40miles/TFFM185.mp3",
            "categories": [
                "Uncategorized",
                "trail games"
            ]
        },
        {
            "title": "184: Camp Chores",
            "datePublished": "Tue, 22 May 2018 13:00:29 +0000",
            "description": "<p>Today on the First 40 Miles, after a long, glorious day of hiking, you arrive into camp and you can relax.  <em>Almost</em>.  We’ll share a few things you’ll need to do <em>first</em> that will make it so you can truly kick back.  Then, we discovered a tool that not only helps with minor trail clearing. but also earns it’s weight when it comes time to build a long-burning campfire.   For today’s hack, not all putts drop—and when they don’t, you need to make sure you clean them up.  We’ll show you how. </p>",
            "length": "31441920",
            "sourceUrl": "http://media.blubrry.com/thefirst40miles/content.blubrry.com/thefirst40miles/TFFM184.mp3",
            "categories": [
                "Uncategorized",
                "camp chores",
                "cat holes",
                "saws"
            ]
        },
        {
            "title": "183: Taking Some Friends Along",
            "datePublished": "Tue, 15 May 2018 13:00:43 +0000",
            "description": "<p>Today on the First 40 Miles, we’re planning a family backpacking trip with another family who hasn’t been backpacking before.  What can we do to give them a great introduction to the wilderness?  Then we’ll share a listener story about his introduction to the wild woods.  For Today’s Backpack Hack of the Week, a ten-card, 17-gram microgame that will provide minutes of fun on your next backpacking trip.</p>",
            "length": "22556544",
            "sourceUrl": "http://media.blubrry.com/thefirst40miles/content.blubrry.com/thefirst40miles/TFFM183.mp3",
            "categories": [
                "Uncategorized",
                "friends",
                "stories",
                "trail games"
            ]
        },
        {
            "title": "182: Tinkering with Tarps",
            "datePublished": "Tue, 08 May 2018 13:00:21 +0000",
            "description": "<p>Today on the First 40 Miles, what do you get when you mix the ancient Japanese art of paper folding with a huge sheet of silnylon?  Tarpigami.  We’ll talk tarps today and learn about some of the risks and rewards of changing up your shelter.  Then, an ultralight shoe that fits in on the trail, in the creek or just bumming around camp.  For Today’s Hack, an idiot-proof tarp shelter that you, yes, you can put up in seconds, plus a lovely little poem to go with it.</p>",
            "length": "27950208",
            "sourceUrl": "http://media.blubrry.com/thefirst40miles/content.blubrry.com/thefirst40miles/TFFM182.mp3",
            "categories": [
                "Uncategorized",
                "FitKicks",
                "Paria",
                "plowpoint shelter",
                "shoes",
                "tarps"
            ]
        },
        {
            "title": "181: Raising the Next Generation of Hikers and Backpackers",
            "datePublished": "Tue, 01 May 2018 13:00:27 +0000",
            "description": "<p>Today on the First 40 Miles, it’s too hard.  I’m too tired.  I just can’t.  Is resilience a lost skill?  And how can we pass it on to the next generation?  On today’s Top 5 List we’ll talk about how to raise the next generation of strong hikers and backpackers.  Then, if you’re looking for a way to introduce backpacking to new readers, we have the perfect book for you.  For today’s Backpack Hack of the Week, an instant food option that can fill a tortilla and feed a crowd. </p>",
            "length": "36436608",
            "sourceUrl": "http://media.blubrry.com/thefirst40miles/content.blubrry.com/thefirst40miles/TFFM181.mp3",
            "categories": [
                "Uncategorized",
                "backpacker abcs",
                "children",
                "resilience"
            ]
        },
        {
            "title": "180: Do You Know What You Signed Up For?",
            "datePublished": "Tue, 24 Apr 2018 13:00:37 +0000",
            "description": "<p>Today on the First 40 Miles, are you sure you want to go backpacking?  Do you know what you’re signing up for?  We’ll wisen you up a little.  On today’s Top 5 List, learn what not to do on your first backpacking trip.  And if you’re looking for a way to compress your gear, here's a stashable water bottle option.  For the Backpack Hack of the Week, learn where to borrow backpacking gear before you buy.  </p>",
            "length": "31934592",
            "sourceUrl": "http://media.blubrry.com/thefirst40miles/content.blubrry.com/thefirst40miles/TFFM180.mp3",
            "categories": [
                "Uncategorized",
                "etiquette",
                "Hydrapak",
                "water bottle"
            ]
        },
        {
            "title": "179: Spring Break at the Metolius River",
            "datePublished": "Tue, 17 Apr 2018 13:00:58 +0000",
            "description": "<p>Today on the First 40 Miles, we report on our spring break adventure to the Metolius River.  Then, we'll review an ultralight headlamp from UCO.  Today's Backpack Hack of the Week will give you a good reason to knock marshmallows off your packing list.  And we'll wrap up the show with some wisdom from a man who was no dummy.</p>",
            "length": "30802176",
            "sourceUrl": "http://media.blubrry.com/thefirst40miles/content.blubrry.com/thefirst40miles/TFFM179.mp3",
            "categories": [
                "Uncategorized",
                "backpacking food",
                "backpacking with kids",
                "Metolius River",
                "Spring Break"
            ]
        },
        {
            "title": "178: Test of Time",
            "datePublished": "Tue, 10 Apr 2018 13:00:11 +0000",
            "description": "<p>Today on the First 40 Miles, some gear is fun for just a few trips, but other gear stands the test of time.  We’re going back into The First 40 Miles Archives, to find out which gear made the final cut.  Then, we’ll dive into the five different types of trails and how to navigate them.  The rest of the show is just fun and games, and we’ll wrap it all up with a quote from James Fenimore Cooper.</p>",
            "length": "25763328",
            "sourceUrl": "http://media.blubrry.com/thefirst40miles/content.blubrry.com/thefirst40miles/TFFM178.mp3",
            "categories": [
                "Uncategorized",
                "backpacking",
                "gear",
                "John Muir",
                "trail games"
            ]
        },
        {
            "title": "177: BEGINNERS: One Step at a Time",
            "datePublished": "Tue, 03 Apr 2018 13:00:58 +0000",
            "description": "<p>Today on the First 40 Miles, if you’re a beginner backpacker, you are on the threshold of one of the most thrilling adventures of your life.   We’ll help you navigate this new adventure with confidence.  For today’s SUMMIT Gear Review, a monthly subscription service that will keep you excited about backpacking all year long.  Today’s hack will help you repurpose a Pringles can.  And we’ll leave you with some Trail Wisdom from our favorite mountain goat.</p>",
            "length": "37234560",
            "sourceUrl": "http://media.blubrry.com/thefirst40miles/content.blubrry.com/thefirst40miles/TFFM177.mp3",
            "categories": [
                "Uncategorized",
                "backpacking food",
                "beginner",
                "muffins",
                "subscription boxes"
            ]
        },
        {
            "title": "176: The Importance of Redundancy",
            "datePublished": "Tue, 27 Mar 2018 14:42:16 +0000",
            "description": "<p>Today on the First 40 Miles, if you’re bringing something on a backpacking trip “just in case”, there’s a good chance you’ll probably never use that item.  How do you know which “just in case” items are actually important?  Then, a classic backpacking gear standard that’s lightweight, cheap and easy to use.  And we’ll share a hack that will help slim down your trekking poles.</p>",
            "length": "36160128",
            "sourceUrl": "http://media.blubrry.com/thefirst40miles/content.blubrry.com/thefirst40miles/TFFM176.mp3",
            "categories": [
                "Uncategorized",
                "redundancy",
                "Sawyer Mini",
                "water filter"
            ]
        },
        {
            "title": "175: Backpacking is Better With Friends",
            "datePublished": "Tue, 20 Mar 2018 13:00:11 +0000",
            "description": "<p>Today on the First 40 Miles, hockey may be better with Wayne Gretsky, but who are the people you want to backpack with?  Then on today’s SUMMIT Gear Review, a gear repair that takes 15 minutes, and leaves <em>your</em> gear looking cooler, by far, than your friend’s gear.  And we’ll share a hack from one of our listeners, Paul.</p>",
            "length": "28677120",
            "sourceUrl": "http://media.blubrry.com/thefirst40miles/content.blubrry.com/thefirst40miles/TFFM175.mp3",
            "categories": [
                "Uncategorized",
                "friends",
                "repair",
                "Wayne Gretsky"
            ]
        },
        {
            "title": "174: Scared or Prepared?",
            "datePublished": "Tue, 13 Mar 2018 13:00:52 +0000",
            "description": "<p>Today on the First 40 Miles, have you ever thought about how your skills as a backpacker can be a huge benefit to yourself and others during a natural disaster?  Today we’ll share a story from a listener who experienced the devastation in Puerto Rico.  Then, we’ll share a survival hack that will turn your empty pack into something that everyone should have—just in case.</p>",
            "length": "34248576",
            "sourceUrl": "http://media.blubrry.com/thefirst40miles/content.blubrry.com/thefirst40miles/TFFM174.mp3",
            "categories": [
                "Uncategorized",
                "emergency preparedness"
            ]
        },
        {
            "title": "173: Backpacking Conversations",
            "datePublished": "Tue, 06 Mar 2018 14:00:25 +0000",
            "description": "<p>Today on the First 40 Miles, we talk about our latest project, a children’s book designed to help get kids outside.  An on-the-fly top 5 list emerges as Josh and Heather plan ahead for future episodes.  Then we each share one of our favorite “must-have” backpacking items.  Next, a super-healthy, super-crunchy trail snack that can be ready in minutes.  And we'll wrap up the show with a little trail wisdom from a couple of nutty backpacking podcasters.</p>",
            "length": "29297664",
            "sourceUrl": "http://media.blubrry.com/thefirst40miles/content.blubrry.com/thefirst40miles/TFFM173.mp3",
            "categories": [
                "Uncategorized",
                "backpacking books",
                "backpacking food",
                "hiking with children",
                "Trail Grazing"
            ]
        },
        {
            "title": "172: The Next Level of Essentials",
            "datePublished": "Tue, 27 Feb 2018 14:00:57 +0000",
            "description": "<p>Today on the First 40 Miles, Once you’ve got survival in the woods figured out, maybe you’re ready to take it to the next level.  We’ve got the top 5 secondary survival essentials to round out your outdoor experience.  Then, we’ll review a stove and pot combo that will help you cook up your latest trail cuisine experiment.  And if you’re not feeling like any culinary experimentation, we’ll share a food hack that’s under a buck and requires no dishwashing.</p>",
            "length": "33573504",
            "sourceUrl": "http://media.blubrry.com/thefirst40miles/content.blubrry.com/thefirst40miles/TFFM172.mp3",
            "categories": [
                "Uncategorized",
                "stove"
            ]
        },
        {
            "title": "171: Survival Essentials",
            "datePublished": "Tue, 20 Feb 2018 14:00:58 +0000",
            "description": "<p>Today on the First 40 Miles, we’re most of the way through winter—and we’ve survived!  And for today’s top 5 list, we’ll share some survival essentials—known to the bushcrafters as \"the five Cs\".  Then we’ll share one of the best subscription boxes we’ve found, that will help you hone your survival skills into a craft.  Next, a backpack hack that’ll prepare you for surviving laundry.</p>",
            "length": "25960320",
            "sourceUrl": "http://media.blubrry.com/thefirst40miles/content.blubrry.com/thefirst40miles/TFFM171.mp3",
            "categories": [
                "Uncategorized"
            ]
        },
        {
            "title": "170: A Winter Overnighter",
            "datePublished": "Tue, 13 Feb 2018 14:00:54 +0000",
            "description": "<p>Today on the First 40 Miles, we took off for 24  hours to enjoy a little Northwest winter backpacking trip.  We’ll share our top 5 experiments <em>plus</em> our brush with death!  And if you’ve ever wondered how to start a fire after a soil-drenching rainstorm, we’ll show you what worked for us.  Then we’ll give you a hack that will make your winter fires burn cleaner, hotter and more efficiently.</p>",
            "length": "34766208",
            "sourceUrl": "http://media.blubrry.com/thefirst40miles/content.blubrry.com/thefirst40miles/TFFM170.mp3",
            "categories": [
                "Uncategorized",
                "Coghlans Fire Disc",
                "fire",
                "winter backpacking"
            ]
        },
        {
            "title": "169: FEATHERS: The Down Episode",
            "datePublished": "Tue, 06 Feb 2018 14:00:41 +0000",
            "description": "<p>Today on the First 40 Miles, Ounce for ounce, down is the warmest insulating material available—but where does it come from, how do synthetics match up, and did Neil Sedaka really write a song about his down puffy?  Then we’ll review a sleeping bag that not only harnesses the power of down, but also uses a unique closure system.  And if you’ve avoided down because of allergies, we have a simple trick that just may save you a box of Kleenex.</p>",
            "length": "30782208",
            "sourceUrl": "http://media.blubrry.com/thefirst40miles/content.blubrry.com/thefirst40miles/TFFM169.mp3",
            "categories": [
                "Uncategorized",
                "down",
                "feathers",
                "magnetic sleeping bag",
                "NoZipp"
            ]
        },
        {
            "title": "168: Weight vs. Volume",
            "datePublished": "Tue, 30 Jan 2018 14:00:14 +0000",
            "description": "<p>Today on the First 40 Miles, if you’re trying to get your pack weight down, but the numbers just don’t want to budge, we have a <em>new</em> challenge for you.  Reduce. Your. Volume.  We’ll share 5 ways to take up less space.  For today’s SUMMIT Gear Review, would you trust a stuff sack made of tissue paper?  For the same weight, we’ll give you a much better option.  Then, a quick hack that will help you streamline your bathroom time.</p>",
            "length": "27970176",
            "sourceUrl": "http://media.blubrry.com/thefirst40miles/content.blubrry.com/thefirst40miles/TFFM168.mp3",
            "categories": [
                "Uncategorized",
                "HMG",
                "stuff sacks",
                "volume",
                "weight"
            ]
        },
        {
            "title": "167: Prepping for a Winter Backpacking Trip",
            "datePublished": "Tue, 23 Jan 2018 14:00:19 +0000",
            "description": "<p>Today on the First 40 Miles, Friday night is always date night, and for this week’s date night, we’re packing and prepping for a quick winter backpacking trip—and we’ll tell you why.  Then, we’ll review a sleeping pad with a 4.4 R-value that is a win for budget minded backpackers.  And we’ve got the perfect hack that will make your sleeping pad stay in place.</p>",
            "length": "34620672",
            "sourceUrl": "http://media.blubrry.com/thefirst40miles/content.blubrry.com/thefirst40miles/TFFM167.mp3",
            "categories": [
                "Uncategorized",
                "sleeping pad",
                "winter"
            ]
        },
        {
            "title": "166: Armchair Backpacker",
            "datePublished": "Tue, 16 Jan 2018 14:00:16 +0000",
            "description": "<p>Today on the First 40 Miles, for whatever reason, maybe you’re not going to be able to get out hiking or backpacking for a while.  That’s ok!  We’ll help you immerse yourself in the experience without leaving home.  Then we’ll review a huge tarp that will give you all the coverage you need.  Then we’ll show you ”the place to go when you can’t go backpacking”.  And we’ll wrap up the show with some strong words from someone who always seemed to have time to get outdoors. </p>",
            "length": "27861120",
            "sourceUrl": "http://media.blubrry.com/thefirst40miles/content.blubrry.com/thefirst40miles/TFFM166.mp3",
            "categories": [
                "Uncategorized",
                "Paria",
                "podcasts",
                "tarp"
            ]
        },
        {
            "title": "165: Reading Between the Lines",
            "datePublished": "Tue, 09 Jan 2018 14:00:43 +0000",
            "description": "<p>Today on the First 40 Miles, while looking for your next hike or backpacking trip, it’s easy to lose track of time reading colorful, inspiring trip reports.   We’ll help you decipher some uncommon words and phrases you may run across in your reading.  Then we’ll review some dreamy socks that are getting a cult following among thru hikers.  And we’ll give you access to the secret government code book to decipher trip reports.</p>",
            "length": "29509248",
            "sourceUrl": "http://media.blubrry.com/thefirst40miles/content.blubrry.com/thefirst40miles/TFFM165.mp3",
            "categories": [
                "Uncategorized",
                "CloudLine",
                "glossary",
                "socks"
            ]
        },
        {
            "title": "164: Zero Waste Backpacking",
            "datePublished": "Tue, 02 Jan 2018 14:00:11 +0000",
            "description": "<p>Today on the First 40 Miles,  we’re always up for a challenge—and that challenge was to have a zero waste backpacking trip—no wrappers, no garbage, no junk.  We’ll share what we did and how it worked out.  Then we’ll review an all-natural way to package and protect your food, that uses no plastic, foil or mylar.  And you’ll learn a backpack hack that will turn your used food packaging into tinder.</p>",
            "length": "22389888",
            "sourceUrl": "http://media.blubrry.com/thefirst40miles/content.blubrry.com/thefirst40miles/TFFM164.mp3",
            "categories": [
                "Uncategorized",
                "BeesWrap",
                "zero waste"
            ]
        },
        {
            "title": "163: Is it a Good Match?",
            "datePublished": "Tue, 26 Dec 2017 14:00:02 +0000",
            "description": "<p>Today on the First 40 Miles, incredible trail reports peppered with phrases like <em>stunning views</em>, <em>photographer’s dream</em>, and <em>crystal lake</em> can almost make you ignore other phrases like <em>aggressive ascent</em>, <em>grueling</em>, or <em>sheer rock</em>.  How can you tell if your hike is a good match for your skill level?  Then, we’ll share a fun trip report from a listener in Australia where our winter is their summer.  Next, a recipe from our new book “Trail Grazing” that will keep your fueled and happy on your next outdoor adventure.</p>",
            "length": "26413056",
            "sourceUrl": "http://media.blubrry.com/thefirst40miles/content.blubrry.com/thefirst40miles/TFFM163.mp3",
            "categories": [
                "Uncategorized",
                "backpacking food"
            ]
        },
        {
            "title": "162: Hunting the Cantharellus Formosus",
            "datePublished": "Tue, 19 Dec 2017 14:00:21 +0000",
            "description": "<p>Today on the First 40 Miles, our family did something that exercised our risk muscle and prepared us for some interesting side trails on autumn and spring backpacking trips.  We went mushroom hunting without someone holding our hand!  Then we’ll review a sturdy piece of outdoor gear that will give you a place to organize mushrooms, do a little outdoor sketching and maybe some meal prep.</p>",
            "length": "28679040",
            "sourceUrl": "http://media.blubrry.com/thefirst40miles/content.blubrry.com/thefirst40miles/TFFM162.mp3",
            "categories": [
                "Uncategorized",
                "Helinox",
                "mushrooms"
            ]
        },
        {
            "title": "161: The Great Mushroom Hunt",
            "datePublished": "Tue, 12 Dec 2017 14:00:59 +0000",
            "description": "<p>Today on the First 40 Miles, we went on our first mushroom hunt and lived to tell the tale!  Today we’ll share the treasures we found in the forest and we’ll share what we learned.  Then, our trip guide from the Oregon Mycological Society, Leah, tells her story of how she entered the world of mushrooms.  And we have some fun audio from the mushroom identification session at the end of our hunt.</p>",
            "length": "32481792",
            "sourceUrl": "http://media.blubrry.com/thefirst40miles/content.blubrry.com/thefirst40miles/TFFM161.mp3",
            "categories": [
                "Uncategorized",
                "mushrooms"
            ]
        },
        {
            "title": "160: HAM: The Amateur Radio Episode",
            "datePublished": "Tue, 05 Dec 2017 14:00:44 +0000",
            "description": "<p>Today on the First 40 Miles, how do you communicate from point A when your friends are at point B?  One of our listeners clued us in to how he stays connected with trail mates while backpacking.  Then we’ll review the communication device we’ve been using plus teach you a simple code you wished you would have known when you were passing notes in 4<sup>th</sup> grade.  And we’ll leave you with some trail wisdom that will help you fine tune your communication skills on and off the trail.</p>",
            "length": "38574336",
            "sourceUrl": "http://media.blubrry.com/thefirst40miles/content.blubrry.com/thefirst40miles/TFFM160.mp3",
            "categories": [
                "Uncategorized"
            ]
        },
        {
            "title": "159: Should I Be Worried About Theft?",
            "datePublished": "Tue, 28 Nov 2017 14:00:10 +0000",
            "description": "<p>Today on the First 40 Miles, when you’re new to backpacking and hiking, you probably have good sized list of things to worry about.  We’ll help you add an item to your “do not worry” list—and give you some ways to be proactive.  Then we’ll review a simple 100% wool beanie that was so great, we bought it again.  Next, a hack that can help you add 24 hours onto your next trip—or can be a life-saving backup plan.</p>",
            "length": "27172608",
            "sourceUrl": "http://media.blubrry.com/thefirst40miles/content.blubrry.com/thefirst40miles/TFFM159.mp3",
            "categories": [
                "Uncategorized"
            ]
        },
        {
            "title": "158: The Trip is in the Details",
            "datePublished": "Tue, 21 Nov 2017 14:00:03 +0000",
            "description": "<p>Today on the First 40 Miles, we’re at the time of year when hiking and backpacking have unique challenges—and we’re up to the challenge!  Listen in on our planning session, then find out which dayhike gets the top vote.  Next, a man, a plan, a can—a Canjo!  Believe it or not, we found another trail-worthy instrument that can help you while away the dark winter nights (and the dark winter days).  And we’ll share a backpackable recipe that will probably push you over your Pumpkin Pie Spice threshold.</p>",
            "length": "34311168",
            "sourceUrl": "http://media.blubrry.com/thefirst40miles/content.blubrry.com/thefirst40miles/TFFM158.mp3",
            "categories": [
                "Uncategorized"
            ]
        },
        {
            "title": "157: Enjoying the Long Slow Adaptation Process",
            "datePublished": "Tue, 14 Nov 2017 14:00:16 +0000",
            "description": "<p>Today on the First 40 Miles, there is nothing wrong with taking the slow route.  Start now and you’ll be ready when everyone else is rushing and cramming last minute.  On today’s top 5 list, a common kitchen ingredient that will change the way you backpack.  Then, a review of a backpacking pant that stretches, breathes, and moves.  And we’ll share a hack that will keep you balanced.</p>",
            "length": "34927872",
            "sourceUrl": "http://media.blubrry.com/thefirst40miles/content.blubrry.com/thefirst40miles/TFFM157.mp3",
            "categories": [
                "Uncategorized",
                "baking soda",
                "pants"
            ]
        },
        {
            "title": "156: The Pizza Episode",
            "datePublished": "Tue, 07 Nov 2017 14:00:32 +0000",
            "description": "<p>Today on the First 40 Miles, follow us on a whim to the land of crispy crust and creamy mozzarella, where the sauce is rich and spicy and the toppings are bountiful and varied.  We’re going to make pizza! This episode is for everyone from the kitchen challenged to the culinary adventurers.  So set aside your freeze dried sweet and sour textured vegetable protein, and let’s make pizza!</p>",
            "length": "30760320",
            "sourceUrl": "http://media.blubrry.com/thefirst40miles/content.blubrry.com/thefirst40miles/TFFM156.mp3",
            "categories": [
                "Uncategorized",
                "backpacking food",
                "oven",
                "pepperoni",
                "pizza",
                "vegan"
            ]
        },
        {
            "title": "155: Happy Hike-O-Ween!",
            "datePublished": "Tue, 31 Oct 2017 13:00:24 +0000",
            "description": "<p>Today on the First 40 Miles, we’ve talked about foraging for food of the leafy green variety—but what about foraging for the <em>creepy crawly</em> variety?  We’ll talk about edible bugs and try to make it sound delicious.  For today’s SUMMIT Gear Review, a true backpacking classic finds it’s place in our pack.  Then, instead of jumping at every twig snap you hear in the forest, we’ll teach you how to be the one doing the twig snapping.</p>",
            "length": "29049984",
            "sourceUrl": "http://media.blubrry.com/thefirst40miles/content.blubrry.com/thefirst40miles/TFFM155.mp3",
            "categories": [
                "Uncategorized",
                "backpacking food",
                "bugs",
                "MRS WhisperLite"
            ]
        },
        {
            "title": "154: Planning for Adventure",
            "datePublished": "Tue, 24 Oct 2017 13:00:48 +0000",
            "description": "<p>Today on the First 40 Miles, if you’ve ever had a plan go awry, this episode is for you.  We’ll talk about trip planning, and why it’s such a critical part of backpacking.  For today’s SUMMIT Gear Review, we’ll share a valuable book for beginners along with a hack straight from page 104.  And we’ll wrap up today’s show with a little trail wisdom from someone who understood the power of planning.</p>",
            "length": "29308032",
            "sourceUrl": "http://media.blubrry.com/thefirst40miles/content.blubrry.com/thefirst40miles/TFFM154.mp3",
            "categories": [
                "Uncategorized",
                "backpacking books",
                "trip planning"
            ]
        },
        {
            "title": "153: Trinity Alps Wilderness Trip Report",
            "datePublished": "Tue, 17 Oct 2017 13:00:35 +0000",
            "description": "<p>Today on the First 40 Miles, Is it ok to skip school and hit the trails?  We think so!  Josh and our two youngest will share some of the highlights of the week.  Then we’ll review a clever way to get food from the plat to your mouth.  And, a few nights on a deflated pad is the inspiration behind today’s Backpack Hack of the Week.  Then we’ll wrap up the show with a little trail wisdom from Arnold Bennet.</p>",
            "length": "31954560",
            "sourceUrl": "http://media.blubrry.com/thefirst40miles/content.blubrry.com/thefirst40miles/TFFM153.mp3",
            "categories": [
                "Uncategorized",
                "HumanGear",
                "trinity alps"
            ]
        },
        {
            "title": "152: Trail Parenting",
            "datePublished": "Tue, 10 Oct 2017 13:00:52 +0000",
            "description": "<p>Today on the First 40 Miles, last week we turned the mic over to the kids.  And today, we’re taking it back—and sharing a little bit of insight to parenting on the trail.  On Today’s Top 5 list, are there principles that are easier to teach outside than inside?  Then, we’ll review a versatile, functional, rechargeable light.  For today’s Backpack hack, a crowd-pleasing three ingredient granola recipe that’s just begging for space in your pack.</p>",
            "length": "37292160",
            "sourceUrl": "http://media.blubrry.com/thefirst40miles/content.blubrry.com/thefirst40miles/TFFM152.mp3",
            "categories": [
                "Uncategorized",
                "challenges",
                "opportunities",
                "parenting"
            ]
        },
        {
            "title": "151: For the Kids, By the Kids: The No Parents Episode",
            "datePublished": "Tue, 03 Oct 2017 13:00:40 +0000",
            "description": "Show Notes: Episode 151 Today on the First 40 Miles, the Legler kids are on the mic to provide the kids perspective on backpacking.  They’ll share some fun memories from past trips.  For today’s gear review, our youngest child reviews his kid-sized pack.  Then some friends join us and share their experience backpacking.  And we’ll &#8230; <a href=\"http://www.thefirst40miles.com/151-for-the-kids-by-the-kids-the-no-parents-episode/\" class=\"more-link\">Continue reading <span class=\"screen-reader-text\">151: For the Kids, By the Kids: The No Parents Episode</span> <span class=\"meta-nav\">&#8594;</span></a>",
            "length": "18244992",
            "sourceUrl": "http://media.blubrry.com/thefirst40miles/content.blubrry.com/thefirst40miles/TFFM151.mp3",
            "categories": [
                "Uncategorized"
            ]
        },
        {
            "title": "150: Clever and Creative",
            "datePublished": "Tue, 26 Sep 2017 13:00:39 +0000",
            "description": "<p>Today on the First 40 Miles, there’s something about being outside that lights a spark inside.  It makes us more in tune with ourselves, it shuts out the noise of civilization and it slows us down—in a good way.  Today we’re going to share some of our upcoming creative projects and hopefully inspire you to get started on your own!  Then we’ll review a sub two pound tent that can fit you plus four really good friends.  For today’s Backpack Hack of the Week, you’ll learn how to \"steal like an artist\".</p>",
            "length": "33808896",
            "sourceUrl": "http://media.blubrry.com/thefirst40miles/content.blubrry.com/thefirst40miles/TFFM150.mp3",
            "categories": [
                "Uncategorized",
                "Appy Trails",
                "creativity",
                "Mark V"
            ]
        },
        {
            "title": "149: Friends of the Flora",
            "datePublished": "Tue, 19 Sep 2017 13:00:29 +0000",
            "description": "<p>Today on the First 40 Miles, if you want to be a friend of the forest, get to know the flora.  We’ll share some ways to make your next trip more rich as you get to know the plants that surround you.  Then we’ll review a new ultra-durable, refillable lighter.  For today’s Backpack Hack of the Week, you’ll learn a plant-geek approved way to bring forest samples home for further study.</p>",
            "length": "28009344",
            "sourceUrl": "http://media.blubrry.com/thefirst40miles/content.blubrry.com/thefirst40miles/TFFM149.mp3",
            "categories": [
                "Uncategorized",
                "Exotac",
                "flora",
                "lighter",
                "plants"
            ]
        },
        {
            "title": "148: Skip the Trip",
            "datePublished": "Tue, 12 Sep 2017 13:00:20 +0000",
            "description": "<p>Today on the First 40 Miles, is it OK to skip a planned backpacking trip, without also taking yourself on a scenic guilt trip?  Yep.  And we’ll share some reasons why skipping a trip is OK.  Then we’ll share a new twist on the classic carabiner.  And, if you had a chance to experience the total solar eclipse in August, we’ll hook you up with even more heavenly wonders.</p>",
            "length": "29681664",
            "sourceUrl": "http://media.blubrry.com/thefirst40miles/content.blubrry.com/thefirst40miles/TFFM148.mp3",
            "categories": [
                "Uncategorized",
                "astronomy",
                "carabiner",
                "eclipse",
                "recovery"
            ]
        },
        {
            "title": "147: DRIED: The Dehydrated Food Episode",
            "datePublished": "Tue, 05 Sep 2017 13:00:07 +0000",
            "description": "<p>Today on the First 40 Miles, the surest way to lighten your food load is to extract the water from it.  We’ll share our dehydrating successes, some graceful fails and some tips to help you dehydrate your own food.  Then, for the SUMMIT Gear Review, we’ll show you a fun tool to make jerky—and we’ll give you a recipe that will help you pack your favorite Chinese takeout flavor on the trail.</p>",
            "length": "33662208",
            "sourceUrl": "http://media.blubrry.com/thefirst40miles/content.blubrry.com/thefirst40miles/TFFM147.mp3",
            "categories": [
                "Uncategorized",
                "backpacking food",
                "dehydrated food"
            ]
        },
        {
            "title": "146: Outdoor Retailer Summer Market 2017",
            "datePublished": "Tue, 29 Aug 2017 13:00:04 +0000",
            "description": "<p>Today on the First 40 Miles, what’s new in the world of backpacking gear?  We’re back from the Outdoor Retailer Show to share gear that’s relevant to backpackers.  Then, we’ll share a listener story that may inspire you to rethink your freeze dried chicken a la “whatever”.  And we’ll share a backpack hack that will turn your hand held flashlight into a hands-free flashlight.</p>",
            "length": "33876480",
            "sourceUrl": "http://media.blubrry.com/thefirst40miles/content.blubrry.com/thefirst40miles/TFFM146.mp3",
            "categories": [
                "Uncategorized"
            ]
        },
        {
            "title": "145: Are You a Fair Weather Backpacker?",
            "datePublished": "Tue, 22 Aug 2017 13:00:38 +0000",
            "description": "<p>Today on the First 40 Miles, Are you a fair weather backpacker?  This was a question Heather asked herself on our last trip.   Then, we’ll share the Top 5 features we wish our gear had…nothing too crazy this time.  Then you’ll learn the simple steps to make your own whole grain flatbread for your next backpacking trip.</p>",
            "length": "27417600",
            "sourceUrl": "http://media.blubrry.com/thefirst40miles/content.blubrry.com/thefirst40miles/TFFM145.mp3",
            "categories": [
                "Uncategorized"
            ]
        },
        {
            "title": "144: Barefoot Backpacking",
            "datePublished": "Tue, 15 Aug 2017 13:00:58 +0000",
            "description": "<p>Today on the First 40 Miles, one of the best feelings after a long day of hiking is that moment when you unlace your boots and toss them next to your pack.  But have you ever thought about ditching your boots altogether?  We’ll share some benefits of lightening up and going more minimalist with your footwear—maybe even barefoot.  Then we’ll review a pair of shoes from Vibram that will practically gift wrap your feet in Japanese wrapping cloth.  Next, we’ll help you crack the code on how to find long, winding trails.</p>",
            "length": "31162752",
            "sourceUrl": "http://media.blubrry.com/thefirst40miles/content.blubrry.com/thefirst40miles/TFFM144.mp3",
            "categories": [
                "Uncategorized",
                "barefoot",
                "minimalist shoes"
            ]
        },
        {
            "title": "143: Summer Update",
            "datePublished": "Tue, 08 Aug 2017 13:00:46 +0000",
            "description": "<p>Today on the First 40 Miles, we’ve been planning this summer for the past year…and it did not disappoint—and it’s not even over yet.  We’ll give you a mid-summer update on what we’ve been up to and the trails we’ve hiked.  Then, we'll share a hack from a real live Philmont Scout Ranger!  And we'll wrap up with a little trail wisdom that will leave you feeling refreshed.</p>",
            "length": "35554560",
            "sourceUrl": "http://media.blubrry.com/thefirst40miles/content.blubrry.com/thefirst40miles/TFFM143.mp3",
            "categories": [
                "Uncategorized",
                "backpacking",
                "BSA",
                "Cimmaron",
                "Mountain Trek",
                "New Mexico",
                "Philmont Scout Ranch",
                "youth"
            ]
        },
        {
            "title": "142: TICKS: The Parasitic Arachnid Episode",
            "datePublished": "Tue, 01 Aug 2017 13:00:23 +0000",
            "description": "<p>Today on the First 40 Miles, TICKS: The Parasitic Arachnid Episode.  If you gross out easily when people are talking about blood sucking parasites, we give you full permission to skip this episode.  However, if you’re kinda curious about ticks, how to keep them away and what to do if you end up being a host, then listen on.  Then, on the SUMMIT Gear Review we’ll share an innovative way to remove ticks.  For today’s Backpack Hack of the Week, an item you may already have in your first aid kit that will ensure a quick and easy way to say goodbye to any hitchhikers--plus we’ll dispel some dangerous myths that are still circulating about how to remove a tick.</p>",
            "length": "25130496",
            "sourceUrl": "http://media.blubrry.com/thefirst40miles/content.blubrry.com/thefirst40miles/TFFM142.mp3",
            "categories": [
                "Uncategorized",
                "disease",
                "Lyme disease",
                "ticks"
            ]
        },
        {
            "title": "141: Staying Cool",
            "datePublished": "Tue, 25 Jul 2017 13:00:08 +0000",
            "description": "<p>Today on the First 40 Miles, if you’re too darned hot, today’s episode will give you some ideas for cooling down.  And we’ll keep the heat coming with a review on a fire starter that’s non-toxic, long burning and waterproof.  Then, on the Backpack Hack of the Week you’ll learn how create your own ultralight human powered AC unit (is that overselling it a bit?)</p>",
            "length": "26449280",
            "sourceUrl": "http://media.blubrry.com/thefirst40miles/content.blubrry.com/thefirst40miles/TFFM141.mp3",
            "categories": [
                "Uncategorized",
                "fire starter",
                "heat",
                "staying cool"
            ]
        },
        {
            "title": "140: College of Blister Knowledge",
            "datePublished": "Tue, 18 Jul 2017 13:00:26 +0000",
            "description": "<p>Today on the First 40 Miles, for everyone else it’s summer vacation, but not for you.  We’ve enrolled you in summer school.  Welcome to the College of Blister Knowledge.  We’re glad you popped in!  We’re going to do all we can today to prevent this universal trail trial.  Then, on the SUMMIT Gear Review, a water filter that performs equally well in nearly dry creek beds  or rushing glacial run-off.  And one of our first 40 milers will share a wild trip he took with some friends. </p>",
            "length": "35894912",
            "sourceUrl": "http://media.blubrry.com/thefirst40miles/content.blubrry.com/thefirst40miles/TFFM140.mp3",
            "categories": [
                "Uncategorized",
                "blisters",
                "MSR",
                "water filter"
            ]
        },
        {
            "title": "139: Giving Back to The Trails You Love",
            "datePublished": "Tue, 11 Jul 2017 13:00:01 +0000",
            "description": "<p>Today on the First 40 Miles, we’re on site at Heather Lake in Washington State with Rudy from the Cascade Hiker podcast.  We’ll talk about trail service and pulaskis.  Then, we’ll review a lightweight container than can hold your precious habanero flakes or a week’s worth of ibuprofen.  For the Backpack Hack of the Week, a quick flick of your foot may prevent a trail full of mug bogs.  And we’ll wrap up the show with a little trail wisdom, from a nature writer of the 20<sup>th</sup> century.</p>",
            "length": "32578304",
            "sourceUrl": "http://media.blubrry.com/thefirst40miles/content.blubrry.com/thefirst40miles/TFFM139.mp3",
            "categories": [
                "Uncategorized",
                "Cascade Hiker",
                "HumanGear",
                "pulaski",
                "trail service"
            ]
        },
        {
            "title": "138: TREASURE HUNT: The Geocaching Episode",
            "datePublished": "Tue, 04 Jul 2017 13:00:56 +0000",
            "description": "<p>Today on the First 40 Miles, The Geocaching Episode.  We’ll show you how to turn a simple hike into a bushwhacking treasure hunt and we’ll walk you through the steps to incorporate this fun activity into your next outdoor adventure.  Then, a feature-rich solar charger that can power your next backpacking trip.  On today’s Backpack Hack of the Week, a free app that will get you started Geocaching in minutes.</p>",
            "length": "27928064",
            "sourceUrl": "http://media.blubrry.com/thefirst40miles/content.blubrry.com/thefirst40miles/TFFM138.mp3",
            "categories": [
                "Uncategorized",
                "BioLite",
                "geocaching",
                "solar chargers"
            ]
        },
        {
            "title": "137: Getting Social on the Trail",
            "datePublished": "Tue, 27 Jun 2017 13:00:30 +0000",
            "description": "<p>Today on the First 40 Miles, how do you find people to hike with?  We’ll play a fun game today to see if we can answer that question.  Then we’ll review a 3 liter water storage reservoir that has a unique blasting feature.  On today’s Backpack Hack of the Week, have you ever made up constellation names just to impress your hiking mates?  Not only is that hilarious, but it’s also avoidable—and we’ll show you how.  Then a little trail wisdom from a man who wished to live deliberately.</p>",
            "length": "29133056",
            "sourceUrl": "http://media.blubrry.com/thefirst40miles/content.blubrry.com/thefirst40miles/TFFM137.mp3",
            "categories": [
                "Uncategorized",
                "astronomy",
                "constellations",
                "hiking groups",
                "social",
                "water reservoirs"
            ]
        },
        {
            "title": "136: Move to Backpack, Backpack to Move",
            "datePublished": "Tue, 20 Jun 2017 13:00:12 +0000",
            "description": "<p>Today on the First 40 Miles, a hiker, a backpacker and a biomechanist all walk up to a bar.  What they do next might just surprise you.  On today’s Top 5 List, we’ll talk about how another podcaster we listen to has changed---nay---revolutionized the way we move.  Then we’ll review some stretchy pants that allow freedom of movement along with the power of wool.  For today’s Backpack Hack of the Week, a movement hack provided by Katy herself.</p>",
            "length": "36452480",
            "sourceUrl": "http://media.blubrry.com/thefirst40miles/content.blubrry.com/thefirst40miles/TFFM136.mp3",
            "categories": [
                "Uncategorized",
                "biomechanics",
                "Ibex",
                "Katy Bowman",
                "movement",
                "Nutritious Movement"
            ]
        },
        {
            "title": "135: Dreaming of Trail Time",
            "datePublished": "Tue, 13 Jun 2017 13:00:22 +0000",
            "description": "<p>Today on the First 40 Miles, if you’re planning your first backpacking trip, you may have some visions in your head about what it will be like.  We’ll help you prep for your dream trip.   On Today’s Top 5 List, you’ll learn the 5 things to keep in your car that will help you upon your return.  Then, on the Summit Gear Review, a battery that can charge your cell phone and your car!  Next, a listener shares a story of an unexpected incredible experience. </p>",
            "length": "29085440",
            "sourceUrl": "http://media.blubrry.com/thefirst40miles/content.blubrry.com/thefirst40miles/TFFM135.mp3",
            "categories": [
                "Uncategorized",
                "battery",
                "chargers",
                "dream trip"
            ]
        },
        {
            "title": "134: MUSIC: Songs on the Trail",
            "datePublished": "Tue, 06 Jun 2017 13:00:13 +0000",
            "description": "<p>Today on the First 40 Miles, music on or off the trail is one of the great pleasures in life.  Today we’ll talk about how to incorporate music on your backpacking trip:  what to bring and what not to bring.  Then, a top 5 list that will help you plan your personal playlist.  Next on the SUMMIT Gear Review, a three stringed instrument, that’s trail worthy and is impossible to play wrong.  And our Backpack Hack has morphed today into Backpack Homework.</p>",
            "length": "33489920",
            "sourceUrl": "http://media.blubrry.com/thefirst40miles/content.blubrry.com/thefirst40miles/TFFM134.mp3",
            "categories": [
                "Uncategorized",
                "music",
                "songs",
                "Strumstick"
            ]
        },
        {
            "title": "133: Cats, Wonderland, and Ticks",
            "datePublished": "Tue, 30 May 2017 13:00:17 +0000",
            "description": "<p>Today on the First 40 Miles, if a news story didn’t involve the latest political scandal or secret missile launch, it probably didn’t even make it above the fold.  Fortunately, we’ve found a handful of stories  that we think you’ll find twice as interesting as what’s on the front page.   Then, the Summit Gear Review will feature a handy waterproof stuff sack that can hold anything from muddy hiking shoes to all the fixin’s for a campfire dinner.  Just not at the same time.  Next, a simple way to give peanut butter a flavor makeover. </p>",
            "length": "29003648",
            "sourceUrl": "http://media.blubrry.com/thefirst40miles/content.blubrry.com/thefirst40miles/TFFM133.mp3",
            "categories": [
                "Uncategorized",
                "backpacking food",
                "backpacking news",
                "Matador",
                "SOLVE Clean Up",
                "stuff sack"
            ]
        },
        {
            "title": "132: Wanna Clean Up The Forest?",
            "datePublished": "Tue, 23 May 2017 13:00:36 +0000",
            "description": "<p>Today on the First 40 Miles, remember that BLM land we talked about in episode 131—we have some exciting news to share!  A clean up group in Oregon has scheduled a clean up there—and you’re all invited!  Then, we’ll teach you how to get street cred on the trail without having to roll up your pant leg and show any raccoon bite marks. Next on the SUMMIT Gear Review, will the inflatable insanity ever end?  And a Backpack Hack that will keep you clean.</p>",
            "length": "30305792",
            "sourceUrl": "http://media.blubrry.com/thefirst40miles/content.blubrry.com/thefirst40miles/TFFM132.mp3",
            "categories": [
                "Uncategorized",
                "BLM",
                "inflatable chair",
                "soap",
                "SOLVE Clean Up"
            ]
        },
        {
            "title": "131: Our Secret Backpacking Spot",
            "datePublished": "Tue, 16 May 2017 13:00:46 +0000",
            "description": "<p>Today on the First 40 Miles, everyone needs a favorite backpacking spot—and you know what makes it even better?  If it’s a <em>top secret</em> backpacking spot.  On today’s top 5 list, we’ll break down our plans to make our off-grid backpacking Shangri-La even better.  Then, a collapsible cookware set  that takes up about a tenth of the space that a traditional set would.  And we’ll answer every backpacker’s burning question about whether or not to bring your Snuggie on your next outdoor adventure.  The answer is no.  But we’ll give you an equally good option on today’s Backpack Hack of the Week. </p>",
            "length": "27083243",
            "sourceUrl": "http://media.blubrry.com/thefirst40miles/content.blubrry.com/thefirst40miles/TFFM131.mp3",
            "categories": [
                "Uncategorized",
                "BLM",
                "cookware",
                "Sea to Summit",
                "secret backpacking spot",
                "Snuggie"
            ]
        },
        {
            "title": "130: Lost and Found",
            "datePublished": "Tue, 09 May 2017 13:00:37 +0000",
            "description": "<p>Today on the First 40 Miles, we lost both our camera and one of our kids on a recent hike—and we’ll share how we got <em>one</em> of them back.  On today’s top 5 list, how to incorporate bread into your backpacking meals, without ending up with a bag of crumbs.  Then we’ll review a tent that uses trendy buzzwords like hybrid and compact.  Next we’ll share a hack that will help others identify your lost camera and get it safely back to you.  And we’ll wrap up the show with a poem of mysterious origin.</p>",
            "length": "35672576",
            "sourceUrl": "http://media.blubrry.com/thefirst40miles/content.blubrry.com/thefirst40miles/TFFM130.mp3",
            "categories": [
                "Uncategorized",
                "bread",
                "camera",
                "Kelty tent"
            ]
        },
        {
            "title": "129: FORTIFY: The Pre-Trip Nutrition Episode",
            "datePublished": "Tue, 02 May 2017 13:00:29 +0000",
            "description": "<p>Today on the First 40 Miles, the time to build a solid nutritional foundation is now.  We’ll share how we got back on track and improved our off-trail nutrition.  Then we’re mashing up the top 5 list and the SUMMIT Gear Review to share 5 ways to get food into your mouth without spilling too much on your hiking pants.  And we’ll share a free resource that will inspire you to take the next step in your nutritional health.</p>",
            "length": "30492032",
            "sourceUrl": "http://media.blubrry.com/thefirst40miles/content.blubrry.com/thefirst40miles/TFFM129.mp3",
            "categories": [
                "Uncategorized",
                "nutrition",
                "recipes",
                "Trailside Kitchen",
                "utensils"
            ]
        },
        {
            "title": "128: A Break in the Weather",
            "datePublished": "Tue, 25 Apr 2017 13:00:00 +0000",
            "description": "<p>Today on the First 40 Miles, we’re on the trail in a hiker camp at Ecola State Park.  We’ll get input from the kids on our Spring Break adventure.  Then we’ll head back home and review a piece of gear we brought with us on the trail.  And we’ll share a backpack hack that will turn leftover dinner into dessert.</p>",
            "length": "29016609",
            "sourceUrl": "http://media.blubrry.com/thefirst40miles/content.blubrry.com/thefirst40miles/TFFM128.mp3",
            "categories": [
                "Uncategorized",
                "backpacking food",
                "Ecola State Park",
                "family",
                "headlamp",
                "mud",
                "NiteIze",
                "rechargeable"
            ]
        },
        {
            "title": "127: Smoke Signals and Trail Marking",
            "datePublished": "Tue, 18 Apr 2017 13:00:15 +0000",
            "description": "<p>Today on the First 40 Miles, leaving a trail of bread crumbs didn’t work out so well for Hansel and Gretel, so is there a better way to mark the trail that won’t conflict with Leave No Trace principles?  Then Josh will share the top 5 things he does on every backpacking trip.  Next, we’ll share a way to text, even when you’re days from a cell tower.  For today’s Backpack Hack of the Week, a ridiculous zero-gram trail game that will keep you entertained for hours.</p>",
            "length": "36475136",
            "sourceUrl": "http://media.blubrry.com/thefirst40miles/content.blubrry.com/thefirst40miles/TFFM127.mp3",
            "categories": [
                "Uncategorized"
            ]
        },
        {
            "title": "126: Cottage Gear",
            "datePublished": "Tue, 11 Apr 2017 13:00:30 +0000",
            "description": "<p>Today on the First 40 Miles, a little small talk about small backpacking gear companies.  Then we’ll share some benefits of buying from cottage gear manufacturers.  Next on the SUMMIT Gear Review, we’ll review a piece of gear we found by accident then we’ll share a hack that will reduce your productivity at the office today by 20 percent.  </p>",
            "length": "29598848",
            "sourceUrl": "http://media.blubrry.com/thefirst40miles/content.blubrry.com/thefirst40miles/TFFM126.mp3",
            "categories": [
                "Uncategorized",
                "backpacking table",
                "Boots McFarland",
                "comic",
                "cottage gear",
                "Garage Grown Gear"
            ]
        },
        {
            "title": "125: DRIP: The Rain Epsiode",
            "datePublished": "Tue, 04 Apr 2017 13:00:37 +0000",
            "description": "<p>Today on the First 40 Miles, DRIP: The Rain Episode.  Don’t let the rain keep you from getting outside!  We’ll have some great gear recommendations for your next drippy trip.  Then, a 3 layer rain jacket designed to sock it to Mother Nature.  For the Backpack Hack of the Week, a way to keep your maps from disintegrating in a downpour.  And we’ll leave you with a little trail wisdom from a man who is known for his humor…or wisdom… we can’t tell the difference.</p>",
            "length": "33937664",
            "sourceUrl": "http://media.blubrry.com/thefirst40miles/content.blubrry.com/thefirst40miles/TFFM125.mp3",
            "categories": [
                "Uncategorized",
                "rain",
                "rain gear",
                "water"
            ]
        },
        {
            "title": "124: Anatomy of an Overnight Backpacking Trip",
            "datePublished": "Tue, 28 Mar 2017 13:00:52 +0000",
            "description": "<p>Today on the First 40 Miles, If you’re planning your first overnight backpacking trip, we’ll talk about a few things that might surprise you.  Next on our SUMMIT Gear Review an all-American pair of socks from a company who set out to create the best sock ever.  Then, this week’s hack will get you outside, then inside, then back outside again!  And we’ll wrap up with a little trail wisdom from Mr. Frost.</p>",
            "length": "34444800",
            "sourceUrl": "http://media.blubrry.com/thefirst40miles/content.blubrry.com/thefirst40miles/TFFM124.mp3",
            "categories": [
                "Uncategorized",
                "Backpacker Magazine",
                "beginner",
                "overnight",
                "socks"
            ]
        },
        {
            "title": "123: Learn As You Go",
            "datePublished": "Tue, 21 Mar 2017 13:00:45 +0000",
            "description": "<p>Today on the First 40 Miles,  each of us are in a constant state of learning, and we’re all on different paths.  Today we’ll share a few things that we have learned recently.  Then, a spikey way to stay on the icy, snowy trails.  For our Backpack Hack of the Week, a listener shares a tip he learned from another hiker.</p>",
            "length": "31578752",
            "sourceUrl": "http://media.blubrry.com/thefirst40miles/content.blubrry.com/thefirst40miles/TFFM123.mp3",
            "categories": [
                "Uncategorized",
                "camp",
                "crampons",
                "ice",
                "learning",
                "winter hiking"
            ]
        },
        {
            "title": "122: Giving Up on Foraging?",
            "datePublished": "Tue, 14 Mar 2017 13:00:07 +0000",
            "description": "<p>Today on the First 40 Miles, is it possible to go out into the wilderness with a crusty loaf and a canteen of water—and then derive everything else you need from the land?  We’ll share our experiences with foraging.  Then on today’s Top 5 List, we’ll share the top 5 things that Heather does on every single trip.  Next, we’re skipping the SUMMIT Gear Review and having a little story time instead.  Today’s Backpack Hack of the Week is a little creepy, but super useful</p>",
            "length": "31270016",
            "sourceUrl": "http://media.blubrry.com/thefirst40miles/content.blubrry.com/thefirst40miles/TFFM122.mp3",
            "categories": [
                "Uncategorized",
                "foraging",
                "snakes",
                "Tom Hennessy"
            ]
        },
        {
            "title": "121: ROPE: The Knot Episode",
            "datePublished": "Tue, 07 Mar 2017 14:00:40 +0000",
            "description": "Show Notes: Episode 121 Today on the First 40 Miles, ROPE: The Knot Episode.&#160; We’ll be extremely judicious with the knot puns and deliver some solid info on how to start incorporating these mathematical beauties into your outdoor adventures.&#160; For today’s SUMMIT Gear Review, a cheap way to get a whole lot of line that’ll &#8230; <a href=\"http://www.thefirst40miles.com/121-rope-the-knot-episode/\" class=\"more-link\">Continue reading <span class=\"screen-reader-text\">121: ROPE: The Knot Episode</span> <span class=\"meta-nav\">&#8594;</span></a>",
            "length": "32066048",
            "sourceUrl": "http://media.blubrry.com/thefirst40miles/content.blubrry.com/thefirst40miles/TFFM121.mp3",
            "categories": [
                "Uncategorized",
                "knots",
                "rope"
            ]
        },
        {
            "title": "120: Good Body Mechanics for Backpackers",
            "datePublished": "Tue, 28 Feb 2017 14:00:34 +0000",
            "description": "<p>Today on the First 40 Miles, your car has a mechanic, but when it comes to good body mechanics, it’s all up to you.  Find out how to prevent injury in today’s top 5 list.  Then on the SUMMIT Gear Review, a piece of backpacking clothing that goes before the base layer.  Next, a zero gram solution that will support your lower back while you’re taking a quick break.  And we’ll wrap up the show with a little trail wisdom from the Bible.</p>",
            "length": "28475392",
            "sourceUrl": "http://media.blubrry.com/thefirst40miles/content.blubrry.com/thefirst40miles/TFFM120.mp3",
            "categories": [
                "Uncategorized",
                "backpacking chair",
                "body mechanics",
                "injury",
                "underwear"
            ]
        },
        {
            "title": "119: Sidelined By Injury",
            "datePublished": "Tue, 21 Feb 2017 14:00:01 +0000",
            "description": "<p>Today on the First 40 Miles, we’re not made of titanium (well <em>some</em> people are) but most of us experience injury that can sideline us from even getting out on the trail.  We’ll share some ideas that will turn that recovery time into valuable trail prep.  Then, on the SUMMIT Gear Review, Katadyn rocks the water filtration scene with a collapsible, ultralight, dead-simple filter.  For today’s Backpack Hack of the Week, you’ll learn how to get your knife sharp enough to split a hair or a log…</p>",
            "length": "24784000",
            "sourceUrl": "http://media.blubrry.com/thefirst40miles/content.blubrry.com/thefirst40miles/TFFM119.mp3",
            "categories": [
                "Uncategorized",
                "Hydrapak",
                "injury",
                "Katadyn BeFree",
                "limited mobility",
                "lower back pain",
                "Vitamin I",
                "water filter",
                "yoga"
            ]
        },
        {
            "title": "118: The Baditude",
            "datePublished": "Tue, 14 Feb 2017 14:00:05 +0000",
            "description": "<p>Today on the First 40 Miles, we’ll talk about a rare but real plague of the trail—the baditude.  And we’ll offer some easy solutions for how to combat it.  Then on the SUMMIT Gear Review, a piece of gear to go with your down jacket, down sleeping bag or down booties.  Next, on the Backpack Hack of the Week we’ll show you how turn your plastic spoon into a weapon—no, just kidding.  We’ll just show you how to extend the handle so you can eat your freeze dried food without getting your hands dirty. </p>",
            "length": "28543744",
            "sourceUrl": "http://media.blubrry.com/thefirst40miles/content.blubrry.com/thefirst40miles/TFFM118.mp3",
            "categories": [
                "Uncategorized",
                "bad attitude",
                "down skirt",
                "eating utensils",
                "mood elevators",
                "spoon",
                "Woodcraft"
            ]
        },
        {
            "title": "117: RUBBISH: The Trash on the Trail Episode",
            "datePublished": "Tue, 07 Feb 2017 14:00:18 +0000",
            "description": "<p>Today on the First 40 Miles, RUBBISH: The Backpacking Trash Episode.  We’ll answer some questions about trash on the trail, then share our top 5 favorite pieces of trash that we’ve found over this past year while hiking and backpacking.  Then on the SUMMIT Gear Review, we’ll let you in on a fisherman’s secret for containing little bits of refuse.  For today’s Backpack Hack of the Week, a quick hack that will keep your pots, pans and mugs clean.  And we’ll wrap up the show with a little trail wisdom from someone who considers all trail experiences to be gifts.</p>",
            "length": "27965824",
            "sourceUrl": "http://media.blubrry.com/thefirst40miles/content.blubrry.com/thefirst40miles/TFFM117.mp3",
            "categories": [
                "Uncategorized",
                "trash"
            ]
        },
        {
            "title": "116: Three Stories and Three Takeaways",
            "datePublished": "Tue, 31 Jan 2017 14:00:12 +0000",
            "description": "<p>Today on the First 40 Miles,  we have three stories we want to share with you today—of women on the trail—plus our takeaways from their experiences.  Then on the SUMMIT Gear Review, an inflatable hammock that may not make it on your 40 miler, but might find a way onto your weekend two mile out and back packing list.  Next, we’ll share the <em>real</em> recipe for a healthy, simple trail snack that almost everyone makes incorrectly.  And we’ll leave you with a little trail wisdom from a guy who has strong opinions about one piece of backpacking gear.</p>",
            "length": "33751936",
            "sourceUrl": "http://media.blubrry.com/thefirst40miles/content.blubrry.com/thefirst40miles/TFFM116.mp3",
            "categories": [
                "Uncategorized",
                "backpacking food",
                "inflatable hammock",
                "stories"
            ]
        },
        {
            "title": "115: Outdoor Retailer Winter Market 2017 Report",
            "datePublished": "Tue, 24 Jan 2017 14:00:43 +0000",
            "description": "<p>Today on the First 40 Miles, Heather is back from the Outdoor Retailer Show in Salt Lake City with tales of what she saw!  Next,  today’s SUMMIT Gear Review features a buttery soft, ultrastrong + ultralight hammock.  For today’s Backpack Hack of the Week, you knew that a hammock had to do <em>more</em> than just rock you to sleep—and we’ll confirm your suspicion with today’s hack.  And we’ll wrap up the show with a little trail wisdom from a guy who has some wise insight about backpacking.</p>",
            "length": "39011968",
            "sourceUrl": "http://media.blubrry.com/thefirst40miles/content.blubrry.com/thefirst40miles/TFFM115.mp3",
            "categories": [
                "Uncategorized",
                "hammock",
                "insulation",
                "Outdoor Retailer Winter Market"
            ]
        },
        {
            "title": "114: Winter is Summer Prep",
            "datePublished": "Tue, 17 Jan 2017 14:00:21 +0000",
            "description": "<p>Today on the First 40 Miles, we have work to do!  Winter is summer prep for backpackers!  Then we’ll share the top 5 extras that you’ll want to consider next time you pack.  For the SUMMIT Gear Review, a daypack that packs down to the size of a baked potato.  Next, a Backpack Hack of the Week that will fill up the dark winter days with a flood of backpacking memories.  And we’ll wrap up the show with a little trail wisdom from someone who knew how to hike light.</p>",
            "length": "33841408",
            "sourceUrl": "http://media.blubrry.com/thefirst40miles/content.blubrry.com/thefirst40miles/TFFM114.mp3",
            "categories": [
                "Uncategorized",
                "daypack",
                "extra gear",
                "photo books",
                "summit pack",
                "winter"
            ]
        },
        {
            "title": "113: How to Pack for a Trip",
            "datePublished": "Tue, 10 Jan 2017 14:00:43 +0000",
            "description": "<p>Today on the First 40 Miles, packing for a backpacking trip can sometimes look like the aftermath of an REI rummage sale.  Gear everywhere.  We can’t help you with that, but we’ll share some tips for packing that will make your trip go a little smoother.  For today’s Summit Gear Review, a load of insulation for your next winter adventure.  Next, the Backpack Hack of the Week will show you a sleeping bag hack for all you claustrophobes out there.</p>",
            "length": "34263808",
            "sourceUrl": "http://media.blubrry.com/thefirst40miles/content.blubrry.com/thefirst40miles/TFFM113.mp3",
            "categories": [
                "Uncategorized",
                "down",
                "gear organization",
                "mummy bags",
                "packing",
                "trip planning",
                "winter sleeping bag"
            ]
        },
        {
            "title": "112: CREATE: The Outdoor Innovators Episode",
            "datePublished": "Tue, 03 Jan 2017 14:00:28 +0000",
            "description": "<p>Today on the First 40 Miles, CREATE: The Outdoor Innovators Episode.  If you’ve ever had a great idea for a piece of outdoor gear, we’ll share some stories today that will help to inspire you to take the next step.  This episode will feature the creative minds behind some up and coming outdoor gear companies.  Then on our Top 5 List, you’ll learn the basic steps for how to coax more great ideas out of your head and turn those ideas into the next big thing.</p>",
            "length": "38286208",
            "sourceUrl": "http://media.blubrry.com/thefirst40miles/content.blubrry.com/thefirst40miles/TFFM112.mp3",
            "categories": [
                "Uncategorized",
                "backpacking gear",
                "ECLO",
                "innovation",
                "innovator",
                "kickstarter",
                "manufacturing",
                "Matador",
                "NoZipp"
            ]
        },
        {
            "title": "111: Zero Days",
            "datePublished": "Tue, 27 Dec 2016 14:00:00 +0000",
            "description": "<p>Today on the First 40 Miles, hiking and backpacking go together like Lewis and Clark, but is it ok have a day in the wilderness where you don’t hike at all?  Absolutely!  We’ll give you a few ideas for what else you can do.  For today’s SUMMIT Gear Review, a pack that is incredibly adaptable.  Next, our Backpack Hack of the Week is a soul-filling pot of beans that can only be made on a zero day.</p>",
            "length": "32434816",
            "sourceUrl": "http://media.blubrry.com/thefirst40miles/content.blubrry.com/thefirst40miles/TFFM111.mp3",
            "categories": [
                "Uncategorized",
                "backpacking food",
                "Gregory",
                "tealights",
                "zero day"
            ]
        },
        {
            "title": "110: The Shortest, Darkest Day of the Year",
            "datePublished": "Tue, 20 Dec 2016 14:00:57 +0000",
            "description": "<p>Today on the First 40 Miles, on the shortest, darkest day of the year can we still find a glimmer of light?  Yes!  We’ll talk about lumens, lightbulbs, and LEDs and what they can do for you in the dark.  On the SUMMIT Gear Review, a flexible light that transitions seamlessly from from lantern to landing strip.  Next on the Backpack Hack of the Week, if your closet is crammed with coats, we’ll help you find the perfect home for them.</p>",
            "length": "32046592",
            "sourceUrl": "http://media.blubrry.com/thefirst40miles/content.blubrry.com/thefirst40miles/TFFM110.mp3",
            "categories": [
                "Uncategorized",
                "coats",
                "flashlight",
                "headlamps",
                "LED",
                "Luminoodle",
                "string lights"
            ]
        },
        {
            "title": "109: Wish List",
            "datePublished": "Tue, 13 Dec 2016 14:00:45 +0000",
            "description": "<p>Today on the First 40 Miles, if we could give a pack full of brightly wrapped gifts to each of our listeners, what would we give?  Then on the SUMMIT Gear Review, Columbia has cracked the code on rain gear.  Next today’s Backpack Hack of the Week is a unique way to find deals ultralight backpacking gear.  And we’ll wrap up the show with a little trail wisdom to denumb your brain.</p>",
            "length": "32991232",
            "sourceUrl": "http://media.blubrry.com/thefirst40miles/content.blubrry.com/thefirst40miles/TFFM109.mp3",
            "categories": [
                "Uncategorized",
                "Christmas",
                "Mass Drop",
                "ultralight",
                "wish list"
            ]
        },
        {
            "title": "108: SKETCH: Art on the Trail",
            "datePublished": "Tue, 06 Dec 2016 14:00:08 +0000",
            "description": "<p>Today on the First 40 Miles, SKETCH: Art on the Trail.  If you’re inspired by purple mountains majesty, we’ll give you a few reasons why you should take the time to sketch what you see.  Plus, on today’s Top 5 List we’ve put together a two ounce packing list for your artistic adventures.  On the SUMMIT Gear Review, an ultralight way to liven up your plein air sketches with vibrant watercolors.  Then on the Backpack Hack of the Week, an entire watercolor palette that weighs less than the toothpaste you put on your toothbrush this morning.</p>",
            "length": "34825216",
            "sourceUrl": "http://media.blubrry.com/thefirst40miles/content.blubrry.com/thefirst40miles/TFFM108.mp3",
            "categories": [
                "Uncategorized",
                "art",
                "paint",
                "plein air",
                "sketching",
                "watercolors"
            ]
        },
        {
            "title": "107: We Have a Cookbook!",
            "datePublished": "Tue, 29 Nov 2016 14:00:05 +0000",
            "description": "<p>Today on the First 40 Miles, we have a cookbook!  And we’ll share some behind the scenes details along with some tips to help you create your own recipes!  Then on the SUMMIT Gear Review, a flameless cooker that will keep your meals hot and toasty to the last bite. Next, our Backpack Hack of the Week is the recipe we’ve hyped for months…and we promise it’s worth it!</p>",
            "length": "32301952",
            "sourceUrl": "http://media.blubrry.com/thefirst40miles/content.blubrry.com/thefirst40miles/TFFM107.mp3",
            "categories": [
                "Uncategorized",
                "backpacking food",
                "cookbook",
                "flameless stove",
                "granola",
                "HydroHeat"
            ]
        },
        {
            "title": "106: Black Friday Backpacking Options",
            "datePublished": "Tue, 22 Nov 2016 14:00:45 +0000",
            "description": "<p>Today on the First 40 Miles, along with thousands of other folks this week, we'll ditch the midnight shopping, the mall mayhem and the deals on flat screen TVs for a little time on the trail.  Next on today’s Top 5 List, we’ll share some gifts that just keep on giving.  For today’s SUMMIT Gear Review, a top of the line, fully featured two-way radio that has an undergrad degree in Communications, and a masters in Global Positioning.  Next, our Backpack Hack of the Week will give you the map to anywhere.</p>",
            "length": "35001856",
            "sourceUrl": "http://media.blubrry.com/thefirst40miles/content.blubrry.com/thefirst40miles/TFFM106.mp3",
            "categories": [
                "Uncategorized",
                "backpacking food",
                "flameless stove",
                "granola",
                "Trail Fuel"
            ]
        },
        {
            "title": "105: Is There a Right and Proper Way to Backpack?",
            "datePublished": "Tue, 15 Nov 2016 14:00:26 +0000",
            "description": "<p>Today on the First 40 Miles, if your mother in law tells you there is one right way to set the table for Thanksgiving dinner, you may or may not believe her.  But believe us when we say there is <em>not</em> one right and proper way to backpack.   However there are some key elements that will ensure that your trip is safe, fun and memorable!  Then, on today’s SUMMIT Gear Review, accessible storage for your pack that keeps your essentials within reach.  For the Backpack Hack of the Week, we’re going to #OptOutside this black Friday, but later we may do a wee bit of browsing for deals online. </p>",
            "length": "28279552",
            "sourceUrl": "http://media.blubrry.com/thefirst40miles/content.blubrry.com/thefirst40miles/TFFM105.mp3",
            "categories": [
                "Uncategorized",
                "backpacking basics",
                "gear pouches"
            ]
        },
        {
            "title": "104: Trip and Fall",
            "datePublished": "Tue, 08 Nov 2016 14:00:39 +0000",
            "description": "<p>Today on the First 40 Miles, usually your pack is lighter on the way home… but not on our most recent trip, and we’ll tell you why.  Then on today’s SUMMIT Gear Review, what do you get when you mix the coverage of an underquilt with the structure of a pad?  Next on the Backpack Hack of the Week, three tent stakes might be your ultralight solution for leaving your stove at home.  And we’ll wrap up the show with a little trail wisdom from a mononymous French philosopher.</p>",
            "length": "29430400",
            "sourceUrl": "http://media.blubrry.com/thefirst40miles/content.blubrry.com/thefirst40miles/TFFM104.mp3",
            "categories": [
                "Uncategorized",
                "hammock",
                "hammock pad",
                "Klymit",
                "Mount Jefferson",
                "shoulder season",
                "stove"
            ]
        },
        {
            "title": "103: SNOOZE: The Sleeping Episode",
            "datePublished": "Tue, 01 Nov 2016 13:00:50 +0000",
            "description": "<p>Today on the First 40 Miles, SNOOZE: The sleeping Episode.  This does <em>not</em> mean you can sleep through this episode.  However you may sleep a little better on your next backpacking trip after listening.  On today’s SUMMIT Gear Review, we’ll share a down sleeping bag that’s a great deal!  Then on the Backpack Hack of the Week, a quick fix for an uncomfortable air mattress.</p>",
            "length": "37831936",
            "sourceUrl": "http://media.blubrry.com/thefirst40miles/content.blubrry.com/thefirst40miles/TFFM103.mp3",
            "categories": [
                "Uncategorized",
                "air mattress",
                "EN 13537",
                "sleeping",
                "sleeping bag"
            ]
        },
        {
            "title": "102: Stories that Inspire",
            "datePublished": "Tue, 25 Oct 2016 13:00:02 +0000",
            "description": "<p>Today on the First 40 Miles, there is power in sharing stories—and we’ll tell you why your stories are <em>so important</em>!  Then, on the SUMMIT Gear Review, a super simple water filter that uses very long and impressive words to keep you safe on the trail.  On Today’s Backpack Hack of the Week, Happy Halloween—now let’s get on to Christmas.  And we’ll share our experience with Rainy Pass Repair and a zipper repair that was beyond our skill level.</p>",
            "length": "27592192",
            "sourceUrl": "http://media.blubrry.com/thefirst40miles/content.blubrry.com/thefirst40miles/TFFM102.mp3",
            "categories": [
                "Uncategorized",
                "Christmas lights",
                "gear repair",
                "Grayl",
                "stories",
                "water filter"
            ]
        },
        {
            "title": "101: The Ultimate Pancake Challenge",
            "datePublished": "Tue, 18 Oct 2016 13:00:30 +0000",
            "description": "<p>Today on the First 40 Miles, we’ve always wondered why people make pancakes on the trail…so today we face The Ultimate Pancake Challenge.  We’ll also share the top 5 ways to make your pancakes worth the extra effort.  On the SUMMIT Gear Review, we have  three pieces of gear that all contributed to the success of the Ultimate Pancake Challenge.  And we’ll leave you today with a little trail wisdom from someone believes that pancakes equal love.</p>",
            "length": "33082240",
            "sourceUrl": "http://media.blubrry.com/thefirst40miles/content.blubrry.com/thefirst40miles/TFFM101.mp3",
            "categories": [
                "Uncategorized",
                "backpacking food"
            ]
        },
        {
            "title": "100: Celebrating Episode 100!",
            "datePublished": "Tue, 11 Oct 2016 13:00:25 +0000",
            "description": "<p>Today on the First 40 Miles, this is episode 100!  And we have a shocking revelation: this is <em>not</em> a backpacking podcast—and we’ll tell you why in our top 5 list today.  We’ll also have a fun announcement that will put our First 40 Milers and their stories on center stage. For today’s Backpack Hack of the Week, a simple no cook dinner that packs in flavor, nutritional density, and over 1000 calories.</p>",
            "length": "29432704",
            "sourceUrl": "http://media.blubrry.com/thefirst40miles/content.blubrry.com/thefirst40miles/TFFM100.mp3",
            "categories": [
                "Uncategorized",
                "100",
                "bulgar",
                "stories"
            ]
        },
        {
            "title": "099: BLINK: The Eyes Episode",
            "datePublished": "Tue, 04 Oct 2016 13:00:46 +0000",
            "description": "<p>Today on the First 40 Miles, BLINK: The Eye Episode.  Most of us rely on our sight to help us navigate the trail, which means that eye health is a critical part of backpacking. Today’s episode focuses on eye health basics and how to care for your eyes while backpacking.  And we’ll be swapping out our SUMMIT Gear Review for a SUMMIT <em>Film</em> Review.  For today’s Backpack Hack of the Week, Josh shares his tips for using contact lenses while backpacking.  And we’ll wrap up the show with a little trail wisdom from our good friend on the trail, Helen Keller.</p>",
            "length": "26557696",
            "sourceUrl": "http://media.blubrry.com/thefirst40miles/content.blubrry.com/thefirst40miles/TFFM099.mp3",
            "categories": [
                "Uncategorized",
                "contact lenses",
                "documentary",
                "eyes",
                "sunglasses",
                "Trevor Thomas",
                "Zenni Optical"
            ]
        },
        {
            "title": "098: Seeing Beyond the Marketing Hype",
            "datePublished": "Tue, 27 Sep 2016 13:00:02 +0000",
            "description": "<p>Today on the First 40 Miles: New! Improved! Ultralight! Waterproof! Breathable! And loaded with functionality!  These are words you might read on the packaging for backpacking gear—but where does the hype end and the honesty begin?  Right here.  Then on today’s Top 5 List, the top 5 pieces of gear that ensure that you won’t get flustered on your next blustery trip.  For today’s Backpack Hack of the Week, Gilbert from the Patagonia Worn Wear program shares a hack for revitalizing a corroded zipper.  And we’ll wrap up the show with a little trail wisdom from the son of an organist and an anarchist.</p>",
            "length": "30274432",
            "sourceUrl": "http://media.blubrry.com/thefirst40miles/content.blubrry.com/thefirst40miles/TFFM098.mp3",
            "categories": [
                "Uncategorized",
                "backpacking gear",
                "innovation",
                "marketing hype",
                "Patagonia",
                "Patagonia Worn Wear Program"
            ]
        },
        {
            "title": "097: Google Trails",
            "datePublished": "Tue, 20 Sep 2016 13:00:33 +0000",
            "description": "<p>Today on the First 40 Miles, Google Maps is awesome, but what if you could brainstorm a new Google initiative called Google Trails—what would you include?  Then on Today’s Top 5 List, a few simple suggestions to help diffuse conflict on the trail.  For the SUMMIT Gear Review, a neck gaiter that does double duty with a secret storage compartment.  Then for the Backpack Hack of the Week, a trashy way to keep your pack contents dry.</p>",
            "length": "29701888",
            "sourceUrl": "http://media.blubrry.com/thefirst40miles/content.blubrry.com/thefirst40miles/TFFM097.mp3",
            "categories": [
                "Uncategorized",
                "conflict",
                "Google Trails",
                "neck gaiter",
                "pack liner",
                "Sholdit"
            ]
        },
        {
            "title": "096: The Last Trip of the Summer",
            "datePublished": "Tue, 13 Sep 2016 13:00:52 +0000",
            "description": "<p>Today on the First 40 Miles, our last family trip of the summer—and this trip did <em>not</em> disappoint!  We’ll share the top 5 things we loved about our trip to the Oregon coast.  Then on the SUMMIT Gear Review,  we’ll share a hammock that’s light enough to throw in your day pack—and may even fit in your back pocket!  Next, on the Backpack Hack of the Week, a simple hammock hack that will keep you cocooned and snug on your next hammock hang. </p>",
            "length": "35458432",
            "sourceUrl": "http://media.blubrry.com/thefirst40miles/content.blubrry.com/thefirst40miles/TFFM096.mp3",
            "categories": [
                "Uncategorized",
                "hammock",
                "Hummingbird Hammocks",
                "Oregon Coast",
                "summer"
            ]
        },
        {
            "title": "095: TWO: The Couples Episode",
            "datePublished": "Tue, 06 Sep 2016 13:00:25 +0000",
            "description": "<p>Today on the First 40 Miles, TWO: The Couples Episode.  If you’re hiking or backpacking with your significant other, there are some great benefits—and some relationship pitfalls.  We’ll do our best to share some helpful information for how to include your spouse in your next backpacking trip.  Then, on the SUMMIT Gear Review, we’ll share a pair of shoes that will help you get through better or worse.  On the Backpack Hack of the Week, a tweak to your sleep system that maximizes your heat output.  And we’ll wrap up the show with a little trail wisdom that just may save your relationship.</p>",
            "length": "34285696",
            "sourceUrl": "http://media.blubrry.com/thefirst40miles/content.blubrry.com/thefirst40miles/TFFM095.mp3",
            "categories": [
                "Uncategorized",
                "minimalist",
                "relationships",
                "Xero Shoes"
            ]
        },
        {
            "title": "094: Outdoor Retailer Summer Market 2016",
            "datePublished": "Tue, 30 Aug 2016 13:00:43 +0000",
            "description": "<p>Today on the First 40 Miles, a sneak peek inside 2017 outdoor trends and upcoming gear!  Then, on the SUMMIT Gear Review we’ll share a Nalgene that is 50% more than the Nalgene you already have.  And the Backpack Hack of the week you’ll learn another use for a Nalgene that will get you ready for those chilly autumn nights.  And we’ll wrap up the show with a vision of green threads!</p>",
            "length": "39489664",
            "sourceUrl": "http://media.blubrry.com/thefirst40miles/content.blubrry.com/thefirst40miles/TFFM094.mp3",
            "categories": [
                "Uncategorized",
                "hammocks",
                "Nalgene",
                "Outdoor Industry Association",
                "Outdoor Retailer Summer Market",
                "solar chargers",
                "water purification"
            ]
        },
        {
            "title": "093: What’s Up With Queen Moonracer?",
            "datePublished": "Tue, 23 Aug 2016 13:00:31 +0000",
            "description": "<p>Today on the First 40 Miles, if you’ve ever met someone on the trail who sounds like they were named by cartoon characters, you have discovered trail names! And today we’ll share everything you need to know about this fun trail tradition.  Then on the SUMMIT Gear Review, a piece of gear that will make you 10% more attractive, 30% smarter, and 98% protected from harmful UVA/UVB rays.  On today’s Backpack Hack of the Week, a simple mnemonic for what to do during a bear attack.  And we’ll wrap up the show with a little trail wisdom from our good friend on the trail, Henry David Thoreau.</p>",
            "length": "27870208",
            "sourceUrl": "http://media.blubrry.com/thefirst40miles/content.blubrry.com/thefirst40miles/TFFM093.mp3",
            "categories": [
                "Uncategorized",
                "bears",
                "Tilley",
                "trail names"
            ]
        },
        {
            "title": "092: Am I Going to Die?",
            "datePublished": "Tue, 16 Aug 2016 13:00:30 +0000",
            "description": "<p>Today on the First 40 Miles, don’t die!  If you’re nervous about getting out on the trail, we’ll share the top 5 ways people die and how to avoid them…mostly.  Then we’ll share a water-proof, wind-proof, lightning-proof way to make music on the trail.  For today’s Backpack Hack of the Week, a simple trick that makes using the bathroom just a little bit easier.  And we’ll wrap up the show with a little trail wisdom from our good friend on the trail, Susan Polis Schutz.</p>",
            "length": "28208512",
            "sourceUrl": "http://media.blubrry.com/thefirst40miles/content.blubrry.com/thefirst40miles/TFFM092.mp3",
            "categories": [
                "Uncategorized",
                "death",
                "risk management",
                "toilet paper",
                "ukuleles"
            ]
        },
        {
            "title": "091: A Beginner Forever",
            "datePublished": "Tue, 09 Aug 2016 13:00:35 +0000",
            "description": "<p>Today on the First 40 Miles, if you’re new to backpacking, how long are you allowed to claim that beginner status?  And what does it mean to be a beginner?  Then on today’s Top 5 List, are you ready to go tentless?  We’ll share some benefits.  Next on today’s SUMMIT Gear Review, Hyperlite Mountain Gear has a pack that shaves ounces, while being tougher than your grandpa’s drill sergeant.  On the Backpack Hack of the Week, a simple and cheap way to get <em>double</em> the insulation.</p>",
            "length": "35444608",
            "sourceUrl": "http://media.blubrry.com/thefirst40miles/content.blubrry.com/thefirst40miles/TFFM091.mp3",
            "categories": [
                "Uncategorized",
                "beginner",
                "hammocks",
                "Hyperlite Mountain Gear",
                "tarp shelters"
            ]
        },
        {
            "title": "090: HANG: The Hammock Camping Episode",
            "datePublished": "Tue, 02 Aug 2016 13:00:37 +0000",
            "description": "<p>Today on the First 40 Miles, HANG: The Hammock Camping Episode!  We’ve always schlepped a tent while backpacking, but recently our eyes were opened to the other options on the trail.  And today, we’re all about the possibilities that hammock camping opens up to backpackers.  Next, the SUMMIT Gear Review turns into the SUMMIT Gear Dump, as we unload the box of gear that was loaned to us for our first hammock trip.  Next, on the Backpack Hack of the Week, a quick way to find the perfect distance between two trees. </p>",
            "length": "33817216",
            "sourceUrl": "http://media.blubrry.com/thefirst40miles/content.blubrry.com/thefirst40miles/TFFM090.mp3",
            "categories": [
                "Uncategorized",
                "Eno",
                "hammocks",
                "Hennessy",
                "Yukon Outfitters"
            ]
        },
        {
            "title": "089: Backpacking in the Olympics",
            "datePublished": "Tue, 26 Jul 2016 13:00:24 +0000",
            "description": "<p>Today on the First 40 Miles, with Summer Olympics coming soon, we have one question on our minds: why isn’t backpacking an Olympic sport?  Then on today’s Top 5 List, we’ll peruse an issue of Backpacker Magazine from 40 years ago and see what catches our eye.  On Ready for Adventure, the Olympics <em>do</em> have backpacking!   On the Backpack Hack of the Week, we’ll share a listener’s life hack.  And we’ll wrap up the show with our good friend on the trail, Horace Kephart.</p>",
            "length": "36380032",
            "sourceUrl": "http://media.blubrry.com/thefirst40miles/content.blubrry.com/thefirst40miles/TFFM089.mp3",
            "categories": [
                "Uncategorized",
                "Backpacker Magazine",
                "mental health",
                "Olympic National Park",
                "Summer Olympics"
            ]
        },
        {
            "title": "088: Setting Reasonable Expectations",
            "datePublished": "Tue, 19 Jul 2016 13:00:54 +0000",
            "description": "<p>Today on the First 40 Miles, we’ll talk about setting reasonable expectations—and why it will make your trip even better!  Then, our Top 5 List will give you some great ideas for how to say happy birthday on the trail—without the mess of confetti or balloons.  Next on the SUMMIT Gear Review, an upgrade for your Nalgene water bottle that will save you the embarrassment of spilled water in your lap.  For today’s Backpack Hack of the Week, learn the trick for getting closer to one more birthday.</p>",
            "length": "32708608",
            "sourceUrl": "http://media.blubrry.com/thefirst40miles/content.blubrry.com/thefirst40miles/TFFM088.mp3",
            "categories": [
                "Uncategorized",
                "birthdays",
                "expectations",
                "Nalgene",
                "safety",
                "water bottle"
            ]
        },
        {
            "title": "087: Scoutmaster for a Day",
            "datePublished": "Tue, 12 Jul 2016 13:00:01 +0000",
            "description": "<p>Today on the First 40 Miles, you have one hour to teach half a dozen 12-13 year old boy scouts a handful of backpacking basics.  Where to begin…?  Then on the SUMMIT Gear Review, a day pack that has the potential to fit a few extras for an overnight out and back.  On today’s Backpack Hack of the Week, a little variety goes a long way—and we’ll show you the best place to stock up on a load of trail worthy snacks.  Then we’ll wrap up the show with a little trail wisdom from Sheridan Anderson.</p>",
            "length": "36334336",
            "sourceUrl": "http://media.blubrry.com/thefirst40miles/content.blubrry.com/thefirst40miles/TFFM087.mp3",
            "categories": [
                "Uncategorized",
                "BSA",
                "bulk foods",
                "daypack"
            ]
        },
        {
            "title": "086: BUDGET: The Spending Episode",
            "datePublished": "Tue, 05 Jul 2016 13:00:02 +0000",
            "description": "<p>Today on the First 40 Miles, BUDGET: The Spending Episode. Does a budget truly limit us, or does it save us from stupid purchases we would make if we had unlimited resources? Today you’ll hear how Josh and Heather work through budgeting decisions when it comes to backpacking gear. For today’s SUMMIT Gear Review, if you want easy access to 7 liters of M&#38;Ms, we’ve got the perfect pack for you. Then on today’s Backpack Hack of the Week, seventeen cents doesn’t go very far in today’s world, but on the trail it gets you through another day. And we’ll wrap up the show with a little trail wisdom from our good friend on the trail, Horace Kephart.</p>",
            "length": "38074240",
            "sourceUrl": "http://media.blubrry.com/thefirst40miles/content.blubrry.com/thefirst40miles/TFFM086.mp3",
            "categories": [
                "Uncategorized",
                "backpacking food",
                "budgeting",
                "Ribz",
                "spending"
            ]
        },
        {
            "title": "085: MacGyver Moments",
            "datePublished": "Tue, 28 Jun 2016 13:00:40 +0000",
            "description": "<p>Today on the First 40 Miles, if you’ve ever been involved in a wild international caper involving Caribbean terrorists, a stolen helicopter, and a roll of duct tape, you might be MacGyver. But if you’ve ever eaten a freeze dried meal with a titanium tent stake, you might be a backpacker. Then on today’s Top 5 List, we’ll help you with a simple numbers decision. For the SUMMIT Gear review, we’ll be reviewing a tent that is light—literally! On today’s Backpack Hack of the Week, we’re going to talk about something that is simply bulgar.</p>",
            "length": "37472479",
            "sourceUrl": "http://media.blubrry.com/thefirst40miles/content.blubrry.com/thefirst40miles/TFFM085.mp3",
            "categories": [
                "Uncategorized",
                "backpacking food",
                "tents"
            ]
        },
        {
            "title": "084: Nature is the Birthplace of Creativity",
            "datePublished": "Tue, 21 Jun 2016 13:00:21 +0000",
            "description": "<p>Today on the First 40 Miles, if necessity is the mother of invention, then nature is the maternity ward. Then on today’s top 5 list, we’ll share the 5 types of YouTubers that you should check out before your next trip. On the SUMMIT Gear Review, one of the ten essentials just became a little more compact. Next on the Backpack Hack of the Week, a zero gram trail game that will keep everyone entertained around the campfire. And we’ll wrap up the show with a little trail wisdom from a guy who looks and talks exactly like Henry David Thoreau. No wait, no, that <em>is</em> Henry David Thoreau.</p>",
            "length": "36029056",
            "sourceUrl": "http://media.blubrry.com/thefirst40miles/content.blubrry.com/thefirst40miles/TFFM084.mp3",
            "categories": [
                "Uncategorized",
                "creativity",
                "Popticals",
                "trail game",
                "YouTube"
            ]
        },
        {
            "title": "083: Lessons from Dad",
            "datePublished": "Tue, 14 Jun 2016 13:00:17 +0000",
            "description": "<p>Today on the First 40 Miles, fathers play such a critical role in helping their children discover and love the outdoors. Today we celebrate and honor Fathers for their role in family adventures! Then, today’s Top 5 List, we spotlight the “Father of Our National Parks”. Next, on Ready for Adventure, we plan a backpacking trip along the Batona Trail in New Jersey. For Today’s Backpack Hack of the Week, we’ll share a hack that is totally gross, but hey, it works. And we’ll wrap up the show with a little trail wisdom from, well, not John Muir. He already got a turn.</p>",
            "length": "36681472",
            "sourceUrl": "http://media.blubrry.com/thefirst40miles/content.blubrry.com/thefirst40miles/TFFM083FATHERSDAY.mp3",
            "categories": [
                "Uncategorized",
                "Batona Trail",
                "Father's Day",
                "Hiking Dad",
                "New Jersey"
            ]
        },
        {
            "title": "082: CLICK 2.0: The Photography Technique Episode",
            "datePublished": "Tue, 07 Jun 2016 13:00:16 +0000",
            "description": "<p>Today on the First 40 Miles, CLICK 2.0, The Photography Technique Episode. If you’ve ever wondered how to capture starlight or soften a bubbling brook, we’ll have some beginner outdoor photography tips that will help you crack the code. Then on the SUMMIT Gear Review, if a full sized tripod and some tent poles got married, we have a pretty good idea of what their kids would look like. On the Backpack Hack of the Week, Josh geeks out and shares an open source software plug in that will turn you into the next Ansel Adams. And we’ll wrap up the show with a little philosophy.</p>",
            "length": "38339584",
            "sourceUrl": "http://media.blubrry.com/thefirst40miles/content.blubrry.com/thefirst40miles/TFFM082.mp3",
            "categories": [
                "Uncategorized",
                "photography",
                "tone mapping",
                "tripod"
            ]
        },
        {
            "title": "081: Perfect Popcorn on the Trail",
            "datePublished": "Tue, 31 May 2016 13:00:31 +0000",
            "description": "<p>Today on the First 40 Miles, backpackers spend their time in the <em>backcountry</em>, but your first outdoor experiences were probably in the <em>frontcountry</em>. We’ll explain the difference! Then on today’s Top 5 List, you’ll learn the key factors for making perfect popcorn on the trail—a skill that we don’t take lightly. On the SUMMIT Gear Review, we’re trying a twist on the classic Buff. Next on the Backpack Hack of the Week, learn a simple first aid hack that will change the way you look at your fast food garbage.</p>",
            "length": "31949440",
            "sourceUrl": "http://media.blubrry.com/thefirst40miles/content.blubrry.com/thefirst40miles/TFFM081.mp3",
            "categories": [
                "Uncategorized",
                "backcountry",
                "Buff",
                "frountcountry",
                "Ibuprofen",
                "Leave No Trace",
                "LNT",
                "popcorn",
                "Vitamin I"
            ]
        },
        {
            "title": "080: Managing Your Risk",
            "datePublished": "Tue, 24 May 2016 13:00:22 +0000",
            "description": "<p>Today on the First 40 Miles, staying inside has its benefits. No risk, <em>but</em>, no reward. On today’s Top 5 List we’ll help you put together your risk management plan. For today’s SUMMIT Gear Review, a lightweight, stuffable daypack that’s the perfect stowaway for your next backpacking trip. Next, on today’s Backpack Hack of the Week, it's time to get organized.  And we’ll leave you with a little trail wisdom that may help you to slow down a little.</p>",
            "length": "33668992",
            "sourceUrl": "http://media.blubrry.com/thefirst40miles/content.blubrry.com/thefirst40miles/TFFM080.mp3",
            "categories": [
                "Uncategorized",
                "daypack",
                "organization",
                "risk management"
            ]
        },
        {
            "title": "079: Electronics on the Trail",
            "datePublished": "Tue, 17 May 2016 13:00:45 +0000",
            "description": "<p>Today on the First 40 Miles, many of us go hiking and backpacking so we can unplug, but what if you can’t? When it comes to electronics—we’re literally surrounded. Then on today’s Top 5 List, you’ll learn to look for the signs that mean it’s time to get outside. Then, on the SUMMIT Gear Review, a pillow that will perfectly cradle your cranium. On today’s Backpack Hack of the Week, what three words are the best response when you hear an SOS call? And, we’ll wrap up the show with a little trail wisdom from our good friend Woody Hesselbarth.</p>",
            "length": "30681088",
            "sourceUrl": "http://media.blubrry.com/thefirst40miles/content.blubrry.com/thefirst40miles/TFFM079.mp3",
            "categories": [
                "Uncategorized",
                "electronics",
                "Klymit",
                "pillow",
                "SOS"
            ]
        },
        {
            "title": "078: The First 40 Kilometers",
            "datePublished": "Tue, 10 May 2016 13:00:38 +0000",
            "description": "<p>Today on The First 40 Kilometers, we discuss the metric lifestyle and how it applies to backpackers and bushwhackers. Then, as promised in episode 68, you’ll learn the top 5 reasons to carry a hydration bladder.  Next, on the SUMMIT Gear Review, a pair of shoes that provide the perfect climate for your feet.  On the Backpack Hack of the Week, learn how to remove sap with things from your pack. </p>",
            "length": "28820992",
            "sourceUrl": "http://media.blubrry.com/thefirst40miles/content.blubrry.com/thefirst40miles/TFFM078.mp3",
            "categories": [
                "Uncategorized",
                "hydration bladder",
                "LOWA",
                "metric",
                "sap removal"
            ]
        },
        {
            "title": "077: CLICK: The Photography Gear Episode",
            "datePublished": "Tue, 03 May 2016 13:00:26 +0000",
            "description": "<p>Today on The First 40 Miles, CLICK: The Photography Gear Episode. We can’t provide you with stunning scenery, but we can help you incorporate photography in your backpacking adventures.  Then, find out what camera Josh is taking with him on the trail. For the Backpack Hack of the Week, you’ll learn how to add a little stability to your next shot.  And we’ll wrap up the show with some words from Ansel Adams.</p>",
            "length": "39329536",
            "sourceUrl": "http://media.blubrry.com/thefirst40miles/content.blubrry.com/thefirst40miles/TFFM077.mp3",
            "categories": [
                "Uncategorized",
                "camera",
                "photography",
                "Sony"
            ]
        },
        {
            "title": "076: On the Rogue Again",
            "datePublished": "Tue, 26 Apr 2016 13:00:48 +0000",
            "description": "<p>Today on The First 40 Miles, our family heads out on a spring adventure, being careful to dodge areas of dense population <em>and</em> rascally weather—and we’ll let the kids share the highlights on today’s Top 5 List. Then on the SUMMIT Gear Review, a technical throw quilt that looks a lot like your favorite puffy jacket, but without the annoying arm holes and hood. Next, on today’s Backpack Hack of the Week, we’ll hook you up with the master list we use before every backpacking trip. And we’ll wrap up the show with a little trail wisdom from a precocious 6 year old boy and his tiger.</p>",
            "length": "27426688",
            "sourceUrl": "http://media.blubrry.com/thefirst40miles/content.blubrry.com/thefirst40miles/TFFM076.mp3",
            "categories": [
                "Uncategorized",
                "REI Backpacking Checklist",
                "Rumpl",
                "Spring Break"
            ]
        },
        {
            "title": "075: What Ever Happened to GoLite?",
            "datePublished": "Tue, 19 Apr 2016 13:00:46 +0000",
            "description": "<p>Today on The First 40 Miles, what ever happened to GoLite, the well-loved backpacking gear company? We have some great news! Then we’ll share the top 5 benefits that a thin wall of nylon can provide. Next, on the SUMMIT Gear Review, we’ll share what happens when you mash up two pieces of trail equipment. On today’s Backpack Hack of the Week, you’ll learn about a free resource for folks who like to get lost…in a good book.</p>",
            "length": "30230656",
            "sourceUrl": "http://media.blubrry.com/thefirst40miles/content.blubrry.com/thefirst40miles/TFFM075.mp3",
            "categories": [
                "Uncategorized",
                "GoLite",
                "LibriVox",
                "MyTrailCo",
                "tents",
                "titanium"
            ]
        },
        {
            "title": "074: Right of Way",
            "datePublished": "Tue, 12 Apr 2016 13:00:02 +0000",
            "description": "<p>Today on The First 40 Miles, a hiker, a horse and a cyclist walk into a bar…is there a punchline or is there trail protocol? On the Top 5 List you’ll learn why Titanium isn’t just for aircraft. On the SUMMIT Gear Review, we’ll review a water bottle that has all the right features. For today’s Backpack Hack of the Week, a simple compostable cutting board and food prep area. And we’ll wrap up the show with a guy who cannot stop talking about how beautiful the wilderness is.</p>",
            "length": "27340672",
            "sourceUrl": "http://media.blubrry.com/thefirst40miles/content.blubrry.com/thefirst40miles/TFFM074.mp3",
            "categories": [
                "Uncategorized",
                "Avex",
                "Evernew",
                "John Muir",
                "right of way",
                "titanium",
                "Vargo"
            ]
        },
        {
            "title": "073: CAT FOOD: The DIY Alcohol Stove Episode",
            "datePublished": "Tue, 05 Apr 2016 13:00:35 +0000",
            "description": "<p>Today on The First 40 Miles, whether you love cats or not, by the time we’re done today, you’ll be adding cat food to your grocery shopping list. And you might as well add some denatured alcohol to the list, too. For today’s top 5 list we’ll be sharing the benefits of DIY Alcohol Stoves—and a couple of the important risk factors as well. Then on the SUMMIT Gear Review, baking while backpacking turns out to be a lot easier than you might think. And today’s Backpack Hack of the Week is no surprise—it’s the title of today’s episode.</p>",
            "length": "31483648",
            "sourceUrl": "http://media.blubrry.com/thefirst40miles/content.blubrry.com/thefirst40miles/TFFM073.mp3",
            "categories": [
                "Uncategorized",
                "alcohol stoves",
                "baking",
                "cat food stoves",
                "Fancy Feast",
                "Packit Gourmet",
                "SuperCat"
            ]
        },
        {
            "title": "072: Ha-ha-happy April Fool’s Day",
            "datePublished": "Tue, 29 Mar 2016 13:00:29 +0000",
            "description": "<p>Today on The First 40 Miles, pranking your trail buddies is fun, but it’s even more fun if your trail buddies are barely tall enough to ride a roller coaster. Then, we’ll share a wild Carolina swamp adventure that’s even too much for the British Empire. For today’s Backpack Hack of the Week, you’ll learn how to make a biscuit, quickly. And we’ll wrap up the show with a little trail wisdom from a Supreme Court justice on the trail, William O. Douglas.</p>",
            "length": "25811968",
            "sourceUrl": "http://media.blubrry.com/thefirst40miles/content.blubrry.com/thefirst40miles/TFFM072.mp3",
            "categories": [
                "Uncategorized",
                "backpacking food",
                "pluff mud",
                "pranks",
                "Ready for Adventure",
                "South Carolina"
            ]
        },
        {
            "title": "071: The Art of Nanomanaging",
            "datePublished": "Tue, 22 Mar 2016 13:00:01 +0000",
            "description": "<p>Today on The First 40 Miles, micromanaging is a terrible strategy for bosses, and nanomanaging is even worse—but does it have merit on the trail? Then, 5 ways that you can nanomanage your little domain. Next, on the SUMMIT Gear Review, a lightweight solution to cooking for a family. For today’s Backpack Hack of the Week, learn when to bring shallots, prime rib and crusty bread. And we’ll wrap up the show with a little trail wisdom from our good friend on the trail, author Donald Miller.</p>",
            "length": "30106240",
            "sourceUrl": "http://media.blubrry.com/thefirst40miles/content.blubrry.com/thefirst40miles/TFFM071.mp3",
            "categories": [
                "Uncategorized",
                "backpacking food",
                "nanomanaging",
                "titanium"
            ]
        },
        {
            "title": "070: Stuck in a Rut",
            "datePublished": "Tue, 15 Mar 2016 13:00:45 +0000",
            "description": "<p>Today on The First 40 Miles, are you stuck in a rut, or do you believe that ruts aren’t even a thing on the trail? Then we’ll share the top 5 pieces of important backpacking equipment that will probably never make it out on the trail. If you’re in the mood for a game night, we have a fun game that will have you dreaming of your next adventure. For today’s Backpack Hack of the Week, if you’re pack didn’t come with an integrated pack cover, we’ve got you covered. And we’ll wrap up the show with a secret…kind of.</p>",
            "length": "25540096",
            "sourceUrl": "http://media.blubrry.com/thefirst40miles/content.blubrry.com/thefirst40miles/TFFM070.mp3",
            "categories": [
                "Uncategorized",
                "Appalachian Trail",
                "food dehydrator",
                "in a rut",
                "pack covers"
            ]
        },
        {
            "title": "069: The Ten Essentials",
            "datePublished": "Tue, 08 Mar 2016 14:00:07 +0000",
            "description": "<p>Today on the First 40 Miles, we get to dump out our ten essentials and spill what’s really inside. Then on today’s Top 5 list, we’ll take our First 40 Milers with us to the Salmon River.  On the SUMMIT Gear Review, see what Lifestraw did to keep your knees clean. Next, we’ll show you how to make a primitive chair out of stuff from the hardware store. And we’ll wrap up the show with a little trail wisdom from our good friend on the trail, Charles de Lint.</p>",
            "length": "32710144",
            "sourceUrl": "http://media.blubrry.com/thefirst40miles/content.blubrry.com/thefirst40miles/TFFM069.mp3",
            "categories": [
                "Uncategorized",
                "camp furniture",
                "LifeStraw",
                "ten essentials",
                "water filter"
            ]
        },
        {
            "title": "068: FLOW: The Water Episode",
            "datePublished": "Tue, 01 Mar 2016 14:00:55 +0000",
            "description": "<p>Today on The First 40 Miles, FLOW: The Water Episode. If you like H2O, we’ve got some great info for you today! We’ll highlight the most common forms of water treatment on the trail. For today’s top 5 list, if you’ve been on the fence about how to store your water, we’ll give you some good reasons why you might want to skip the bladder. Then on the SUMMIT Gear Review, you’ll learn how thousands of thru hikers have treated millions of liters to stay hydrated on the trail. On today’s Backpack Hack of the Week, we’ll sing a little ditty to help you remember a simple water treatment formula. And we’ll wrap up the show with a little trail wisdom from the American Government.</p>",
            "length": "29339392",
            "sourceUrl": "http://media.blubrry.com/thefirst40miles/content.blubrry.com/thefirst40miles/TFFM068.mp3",
            "categories": [
                "Uncategorized",
                "Aquamira",
                "hydration bladder",
                "water",
                "water purification",
                "water treatment"
            ]
        },
        {
            "title": "067: What in the Heck is VBL?",
            "datePublished": "Tue, 23 Feb 2016 14:00:30 +0000",
            "description": "<p>Today on The First 40 Miles, a three letter abbreviation that may make all the difference on your next adventure. Then, get your feet ready with five simple steps. On the SUMMIT Gear Review, we’ll share a luxury that will keep you toasty warm for hours and hours. And we’ll come full circle with a hack that includes today’s mysterious three letter abbreviation.</p>",
            "length": "32452864",
            "sourceUrl": "http://media.blubrry.com/thefirst40miles/content.blubrry.com/thefirst40miles/TFFM067.mp3",
            "categories": [
                "Uncategorized",
                "feet",
                "foot care",
                "gloves",
                "VBL",
                "Zippo Hand Warmer"
            ]
        },
        {
            "title": "066: Passion, Sport, Trend or Lifestyle?",
            "datePublished": "Tue, 16 Feb 2016 14:00:44 +0000",
            "description": "<p>Today on The First 40 Miles, is backpacking just a fad, a trend or is it more—and why didn’t the Beach Boys ever sing about it? Then on today’s top 5 list, we’ll share some backpacking realities—and how to adapt. Then, on the Ready for Adventure segment, we plan a trip for two along the beautiful Salmon River. On the Backpack Hack of the Week, everyone loves how their clothes feel when they come straight out of the dryer—we’ll show you how to duplicate that feeling on the trail. And we’ll wrap up the show with a little trail wisdom from our good friend on the trail, English poet William Henry Davies.</p>",
            "length": "34536448",
            "sourceUrl": "http://media.blubrry.com/thefirst40miles/content.blubrry.com/thefirst40miles/TFFM066.mp3",
            "categories": [
                "Uncategorized",
                "beginner",
                "couple backpacking",
                "warm clothes"
            ]
        },
        {
            "title": "065: Hopelessly in Love",
            "datePublished": "Tue, 09 Feb 2016 14:00:38 +0000",
            "description": "<p>Today on The First 40 Miles, if you’re hopelessly in love with someone, we have a few ideas you can stow away in your pack or use for Valentine’s Day. Then, on the SUMMIT Gear Review, a mini blanket that is the perfect size for an outdoor romantic picnic for two. Next, on the Backpack Hack of the Week, we’ll share a relationship saver for the one who <em>refuses</em> to stop to ask for directions. And we’ll wrap up the show with a little trail wisdom from a husband and wife team who loved to be outdoors and write books about it!</p>",
            "length": "27553024",
            "sourceUrl": "http://media.blubrry.com/thefirst40miles/content.blubrry.com/thefirst40miles/TFFM065.mp3",
            "categories": [
                "Uncategorized",
                "book",
                "compass",
                "love",
                "Matador Mini Pocket Blanket",
                "romance",
                "Valentines Day"
            ]
        },
        {
            "title": "064: CHILL: The Winter Backpacking Episode",
            "datePublished": "Tue, 02 Feb 2016 14:00:31 +0000",
            "description": "<p>Today on The First 40 Miles, is backpacking just a summer fling? We’ll talk about the challenges of winter backpacking, and how to remain thermally neutral. Then, if you’ve ever dreamed of wrapping your legs in merino and baby alpaca fiber, then your dreams are about to come true on today’s SUMMIT Gear Review. Next, on the Backpack Hack of the Week, the forest has no lost and found, but it does have some handy free stuff laying around that you can use if you lose some gear. And we’ll wrap up the show with a little trail wisdom from our good friend on the <a href=\"https://en.wikipedia.org/wiki/Walking_in_the_United_Kingdom#Hillwalking\">hills and fells</a>, Chris Townsend.</p>",
            "length": "29704960",
            "sourceUrl": "http://media.blubrry.com/thefirst40miles/content.blubrry.com/thefirst40miles/TFFM064.mp3",
            "categories": [
                "Uncategorized",
                "alpaca",
                "handwarmers",
                "tent stake",
                "winter"
            ]
        },
        {
            "title": "063: Outdoor Themes for 2016",
            "datePublished": "Tue, 26 Jan 2016 14:00:17 +0000",
            "description": "<p>Today on The First 40 Miles, what happens when thousands of outdoorsy people get together in one place? A city full of happy and healthy people. Then, on today’s top 5 list, we’ll share the top 5 themes that have tree-huggers, peak-baggers and hill-hikers all excited. Next, on the SUMMIT Gear Review, you’ll find out which knife replaced the heirloom that Josh has been carrying since he was a scout. On the Backpack Hack of the week, you’ll learn how to use your fuel can to track fuel consumption. And we’ll wrap up the show with a little trail wisdom from our good friend on the trail, again, Mr. Emerson.</p>",
            "length": "32918656",
            "sourceUrl": "http://media.blubrry.com/thefirst40miles/content.blubrry.com/thefirst40miles/TFFM063.mp3",
            "categories": [
                "Uncategorized",
                "fuel",
                "Gerber",
                "knife",
                "Outdoor Retailer Winter Market"
            ]
        },
        {
            "title": "062: Is the Pack Half Full or Half Empty?",
            "datePublished": "Tue, 19 Jan 2016 14:00:09 +0000",
            "description": "<p>Today on The First 40 Miles, is the pack half full or half empty? How you answer that question may determine your experience on the trail. We’ll share five tips for new backpackers that will help ensure that your next trip will be even better than your last! Then, on the SUMMIT Gear Review, a solution for hikers who don’t want to waste a minute fumbling with shoelaces. On the Backpack Hack of the Week, an “Oh Duh!” solution to keep your homemade meals from tipping over. And we’ll leave you today with a little trail wisdom from our good friend Henry.</p>",
            "length": "30598144",
            "sourceUrl": "http://media.blubrry.com/thefirst40miles/content.blubrry.com/thefirst40miles/TFFM062.mp3",
            "categories": [
                "Uncategorized",
                "dehydrated meals",
                "optimism",
                "shoelaces",
                "Thoreau"
            ]
        },
        {
            "title": "061: The Perfect Gateway Activity",
            "datePublished": "Tue, 12 Jan 2016 14:00:22 +0000",
            "description": "<p>Today on The First 40 Miles, are you looking to persuade a friend or family member to come backpacking with you? We’ve got the perfect gateway activity to start them off with. Then, if you haven’t found the perfect knife from the wagon of the village peddler, we’ll give you an even better place to start. On the SUMMIT Gear Review, a multiuse piece of gear that can go from pack to trail and right back to pack. Then on the Backpack Hack of the Week, 420 calories and no mess. And we’ll wrap up the show with a little trail wisdom from our good friend on the trail, William O Douglas</p>",
            "length": "29257984",
            "sourceUrl": "http://media.blubrry.com/thefirst40miles/content.blubrry.com/thefirst40miles/TFFM061.mp3",
            "categories": [
                "Uncategorized",
                "backpacking food",
                "Case Knives",
                "dayhiking",
                "dry bag",
                "Peregrine",
                "summit pack",
                "tuna sandwiches"
            ]
        },
        {
            "title": "060: FIX: The Gear Maintenance and Repair Episode",
            "datePublished": "Tue, 05 Jan 2016 14:00:26 +0000",
            "description": "<p>Today on The First 40 Miles, if you’re scared to take your brand new gear out into the rough and wild wilderness because you think it might get damaged, have no fear! This episode is dedicated to making sure your gear stays in top form, regardless of the elements. You’ll learn the top 5 things you can do when good gear goes bad. Then, the SUMMIT Gear Review turns into the SUMMIT Gear Hospital, as we search and rescue gear that has flatlined. On the Backpack Hack of the Week, learn the critical pieces of a DIY Custom Repair Kit.</p>",
            "length": "35284096",
            "sourceUrl": "http://media.blubrry.com/thefirst40miles/content.blubrry.com/thefirst40miles/TFFM060.mp3",
            "categories": [
                "Uncategorized",
                "broken zipper",
                "gear maintenance",
                "gear repair",
                "repair kit",
                "solarproofing",
                "stinky gear",
                "waterproofing"
            ]
        },
        {
            "title": "059: A Recipe for Disaster",
            "datePublished": "Tue, 29 Dec 2015 14:00:44 +0000",
            "description": "<p>Today on The First 40 Miles, if eating more bacon is your 2016 New Year’s Resolution, we’re here to support you with five creative ways for you to achieve your goal! Then, if leaving your sleeping bag in the morning is a real challenge, we have a unique solution for you. On the Backpack Hack of the Week, vegan bacon is not as gross as it sounds—we promise! Then we’ll wrap up the show with a little trail wisdom from a guy who enjoys the good life.</p>",
            "length": "35233408",
            "sourceUrl": "http://media.blubrry.com/thefirst40miles/content.blubrry.com/thefirst40miles/TFFM059.mp3",
            "categories": [
                "Uncategorized",
                "bacon",
                "coconut bacon",
                "down",
                "DreamWalker",
                "ExPed",
                "sleeping bag",
                "smokanut"
            ]
        },
        {
            "title": "058: A Glorious Night Hike",
            "datePublished": "Tue, 22 Dec 2015 14:00:15 +0000",
            "description": "<p>Today on The First 40 Miles, if you’ve ever listened to the Christmas story from the Bible and felt some connection, we’ll share some good reasons why you may feel that way. On the SUMMIT Gear Review, we’ll show you a simple way to deal with the moody weather of December. For the Backpack Hack of the Week, find out where we dig up all our best backpacking stories. And we’ll wrap up the show with a little Christmas yuletide.</p>",
            "length": "29874688",
            "sourceUrl": "http://media.blubrry.com/thefirst40miles/content.blubrry.com/thefirst40miles/TFFM058.mp3",
            "categories": [
                "Uncategorized",
                "backpacking news",
                "Christmas",
                "music",
                "umbrella"
            ]
        },
        {
            "title": "057: How to Remain Thermally Neutral",
            "datePublished": "Tue, 15 Dec 2015 14:00:37 +0000",
            "description": "<p>Today on The First 40 Miles, we’ll tackle an issue that no presidential candidate has had the courage to tackle—and we have the numbers to back it up. Then on Today’s Top 5 list, a whimsical wish list of impossible gifts. On the SUMMIT Gear Review, a 100 year old piece of paper that can withstand a winter rainstorm or blizzard. Next on the Backpack Hack of the Week, a simple, kinda embarrassing way to keep your feet dry.</p>",
            "length": "34055680",
            "sourceUrl": "http://media.blubrry.com/thefirst40miles/content.blubrry.com/thefirst40miles/TFFM057.mp3",
            "categories": [
                "Uncategorized",
                "gifts",
                "rain",
                "Rite in the Rain paper",
                "shoebrellas",
                "thermal neutrality"
            ]
        },
        {
            "title": "056: St. Nick on the Trail",
            "datePublished": "Tue, 08 Dec 2015 14:00:50 +0000",
            "description": "<p>Today on The First 40 Miles, 'tis the season for Christmas parodies! Then on today’s Top 5 List, we’ll share some fun ways to present your gifts. Next, on the SUMMIT Gear Review, a piece of gear that will leave you feeling as fresh as a snowdrift. On the Backpack Hack of the Week, a one dollar solution that will help you feel a whole lot smarter and lighter! And we’ll wrap up the show with a little trail wisdom from one of the most quotable men in history.</p>",
            "length": "30443776",
            "sourceUrl": "http://media.blubrry.com/thefirst40miles/content.blubrry.com/thefirst40miles/TFFM056.mp3",
            "categories": [
                "Uncategorized",
                "blisters",
                "body powder",
                "Christmas",
                "dry shampoo",
                "gifts",
                "SmartWater",
                "St Nick on the Trail"
            ]
        },
        {
            "title": "055: GIVE: The Gift Giving Episode",
            "datePublished": "Tue, 01 Dec 2015 14:00:19 +0000",
            "description": "<p>Today on The First 40 Miles, GIVE: The Gift Giving Episode! If you’ve ever wanted to give the 12 Days of Christmas, we have the whole thing planned out for you—minus the Lords a Leaping and other weird gifts! Then on the SUMMIT Gear Review, a pad that can take you through all four seasons of backpacking! On the Backpack Hack of the Week, a simple way to wrap a gift for the backpacker in your life. And we’ll wrap up the show with a little trail wisdom from a little girl who loved adventures.</p>",
            "length": "22883200",
            "sourceUrl": "http://media.blubrry.com/thefirst40miles/content.blubrry.com/thefirst40miles/TFFM055.mp3",
            "categories": [
                "Uncategorized",
                "gifts",
                "R value",
                "sleeping pad",
                "Thermarest"
            ]
        },
        {
            "title": "054: Six Words",
            "datePublished": "Tue, 24 Nov 2015 14:00:47 +0000",
            "description": "<p>Today on The First 40 Miles, if you’re looking for a way to avoid eye contact with raisins, we may have the perfect breakup option in our Top 5 List today! Then, the SUMMIT Gear Review turns into the SUMMIT SMACKDOWN…which is kind of dangerous this time because there are knives involved. For the Backpack Hack of the Week, you’ll learn about a great resource for cheap backup eyeglasses to bring on the trail. And we’ll leave you with a little trail wisdom from someone who tries to make the road a little smoother for everyone.</p>",
            "length": "34766464",
            "sourceUrl": "http://media.blubrry.com/thefirst40miles/content.blubrry.com/thefirst40miles/TFFM054.mp3",
            "categories": [
                "Uncategorized",
                "glasses",
                "Leatherman",
                "multitool",
                "Navitas",
                "superfoods",
                "trail mix"
            ]
        },
        {
            "title": "053: Pilgrims and Strangers",
            "datePublished": "Tue, 17 Nov 2015 14:00:06 +0000",
            "description": "<p>Today on The First 40 Miles, is it possible to pack an entire Thanksgiving Dinner in your pack? Nope. But there are a few things you can pack that’ll get you pretty close to it. Then on the SUMMIT Gear Review, you’ll learn about a unique way to light your camp space. On the Backpack Hack of the Week, we’ll share a secret ingredient that will make all of your backpacking dinners palatable. And we’ll wrap up the show with a little trail wisdom from Roethke.</p>",
            "length": "29340544",
            "sourceUrl": "http://media.blubrry.com/thefirst40miles/content.blubrry.com/thefirst40miles/TFFM053.mp3",
            "categories": [
                "Uncategorized",
                "backpacking food",
                "Luminaid",
                "Sriracha",
                "Thanksgiving"
            ]
        },
        {
            "title": "052: Cutting the Switchbacks",
            "datePublished": "Tue, 10 Nov 2015 14:00:23 +0000",
            "description": "<p>Today on The First 40 Miles, there are times when shortcuts are a bad idea, and times when they’re a <em>great</em> idea! We’ll help you figure it all out in today’s Top 5 List. Then, on the SUMMIT Gear Review, a light, lightweight way to deal with microorganisms in your drinking water. Next, on the Backpack Hack of the Week, we’ll show you a great resource you can take advantage of that will improve your outdoor skills and knowledge. And we’ll wrap up the show with a little trail wisdom from a guy named Woody who wrote the handbook on Trail Construction and Management.</p>",
            "length": "34781824",
            "sourceUrl": "http://media.blubrry.com/thefirst40miles/content.blubrry.com/thefirst40miles/TFFM052.mp3",
            "categories": [
                "Uncategorized",
                "Andrew Skurka",
                "bushwhacking",
                "shortcuts",
                "Sierra Designs",
                "Steripen",
                "switchbacks",
                "trail construction"
            ]
        },
        {
            "title": "051: HEEL TO TOE: The Sock Episode",
            "datePublished": "Tue, 03 Nov 2015 14:00:46 +0000",
            "description": "<p>Today on The First 40 Miles, HEEL TO TOE: The Sock Episode! On the Top 5 List, we’ll share the top 5 non-traditional hiking socks. Then on the SUMMIT Gear Review, the socks have invited a special guest to join them on the show. Next, on the Backpack Hack of the Week, what to do if a forest creature takes off with your socks. We have a Backpacker Q+A about compression socks. And we’ll wrap up the show with a little trail wisdom from a Russian who probably knew a thing or two about Portyankis.</p>",
            "length": "29536768",
            "sourceUrl": "http://media.blubrry.com/thefirst40miles/content.blubrry.com/thefirst40miles/TFFM051.mp3",
            "categories": [
                "Uncategorized",
                "compression socks",
                "portiyanki",
                "recovery shoes",
                "Russian Army",
                "socks"
            ]
        },
        {
            "title": "050: Secrets, Vampires, and Fake Spiders",
            "datePublished": "Tue, 27 Oct 2015 13:00:19 +0000",
            "description": "<p>Today on The First 40 Miles, how to hoard massive amounts of simple carbs for your next backpacking trip. On the Top 5 List, we’ll share the top five secrets you should never keep from your trail mates. Then on the SUMMIT Gear Review, an ultralight backpacking staple that will cut both your pack weight <em>and</em> your pack volume. Next, on the Backpack Hack of the Week, you’ll learn how to dry your fly. And we’ll wrap up the show with a little trail wisdom from a man who loves adventure. Or maybe he doesn’t.</p>",
            "length": "30570496",
            "sourceUrl": "http://media.blubrry.com/thefirst40miles/content.blubrry.com/thefirst40miles/TFFM050.mp3",
            "categories": [
                "Uncategorized",
                "candy",
                "compression sacks",
                "Halloween",
                "Sea to Summit",
                "secrets"
            ]
        },
        {
            "title": "049: Mom’s Advice",
            "datePublished": "Tue, 20 Oct 2015 13:00:32 +0000",
            "description": "<p>Today on The First 40 Miles, Heather’s mom celebrates a milestone birthday and gets the spotlight! We share a letter she wrote to Heather that has some great backpacking advice. Then on the SUMMIT Gear Review, play music for days without recharging! On the Backpack Hack of the Week, you’ll learn how to use a common bathroom item to prep for your next trip.</p>",
            "length": "27469696",
            "sourceUrl": "http://media.blubrry.com/thefirst40miles/content.blubrry.com/thefirst40miles/TFFM049.mp3",
            "categories": [
                "Uncategorized",
                "advice",
                "bathroom scale",
                "mom",
                "pack weight",
                "ukulele"
            ]
        },
        {
            "title": "048: Quick Change of Plans",
            "datePublished": "Tue, 13 Oct 2015 13:00:37 +0000",
            "description": "<p>Today on The First 40 Miles, what are those crazy backpackers up to next? We’ll find out when we check the news for stories. On today’s SUMMIT Gear Review, find out what happens when we ditch the traditional mummy bag. Then, on the Backpack Hack of the Week, we’ll teach you an ultralight hack for shoes to wear around camp. And we’ll wrap up the show with a little trail wisdom from a poet who must have spent a little time on the trail.</p>",
            "length": "34824448",
            "sourceUrl": "http://media.blubrry.com/thefirst40miles/content.blubrry.com/thefirst40miles/TFFM048.mp3",
            "categories": [
                "Uncategorized",
                "backpacking news",
                "quilt",
                "shoes"
            ]
        },
        {
            "title": "047: WILD: The Bear Episode",
            "datePublished": "Tue, 06 Oct 2015 13:00:21 +0000",
            "description": "<p>Today on The First 40 Miles, what do a diminutive military leader and a thousand pound grizzly bear have in common? Today’s Top 5 List may have the answer. Then in today’s SUMMIT Gear Review, a simple knot along with bullet proof fabric that can protect your food. Then on today’s Backpack Hack of the Week, if you’ve seen bear scat with bells in it, then we have the zero gram solution for you. And we’ll wrap up the show with a little trail wisdom from our good friend on the trail, Craig Childs.</p>",
            "length": "30554752",
            "sourceUrl": "http://media.blubrry.com/thefirst40miles/content.blubrry.com/thefirst40miles/TFFM047.mp3",
            "categories": [
                "Uncategorized",
                "bear bells",
                "bear country",
                "bears",
                "black bears",
                "Donald Trump",
                "grizzly bears",
                "Napoleon",
                "Ursack"
            ]
        },
        {
            "title": "046: You Can’t Beat a Classic",
            "datePublished": "Tue, 29 Sep 2015 13:00:58 +0000",
            "description": "<p>Today on The First 40 Miles, when dreams of a toasty fire turn to sour grapes, what’s a backpacker to do? You’ll learn 5 ways to deal with cancelled campfires. Then on the SUMMIT Gear Review, instead of reviewing the latest piece of gear, we’re bringing back a 20 year old classic that’s trail beaten and is still trail worthy. For the Backpack Hack of the Week, the ugliest snack. Ever. And we’ll wrap up the show with a little trail wisdom from a guy who apparently does not own a van, we found out.</p>",
            "length": "25533952",
            "sourceUrl": "http://media.blubrry.com/thefirst40miles/content.blubrry.com/thefirst40miles/TFFM046.mp3",
            "categories": [
                "Uncategorized",
                "backpacking food",
                "Chuglies",
                "LNT",
                "sleeping pad",
                "Thermarest",
                "Vincent van Gogh"
            ]
        },
        {
            "title": "045: First, Second and Third Time’s a Charm",
            "datePublished": "Tue, 22 Sep 2015 13:00:36 +0000",
            "description": "<p>Today on The First 40 Miles, what are those last minute things you need right before a trip? Believe or not, there are <em>five</em> pre-trip incidentals that will help with pre-trip prep! Next, on the SUMMIT Gear Review, we review a tent that we purchased not, once, not twice, but three times. The Backpack Hack of the Week is a simple way to mark maps without leaving a mess. And we’ll wrap up the show with a little trail wisdom from a man with a van.</p>",
            "length": "32747008",
            "sourceUrl": "http://media.blubrry.com/thefirst40miles/content.blubrry.com/thefirst40miles/TFFM045.mp3",
            "categories": [
                "Uncategorized",
                "tents",
                "washi tape"
            ]
        },
        {
            "title": "044: Wanna Go Stoveless?",
            "datePublished": "Tue, 15 Sep 2015 13:00:30 +0000",
            "description": "<p>Today on The First 40 Miles, you may be prepared for your next backpacking trip, but are you prepared for a natural disaster? You may be more prepared than you think! Then, we share the top 5 benefits of leaving behind one of my favorite pieces of gear. On our Ready for Adventure segment, we prep for a hypothetical trip with two friends and the kids for a fun 24 hour trip. Next, get out your x-acto knife and get creative with your closed cell foam pad!</p>",
            "length": "34689664",
            "sourceUrl": "http://media.blubrry.com/thefirst40miles/content.blubrry.com/thefirst40miles/TFFM044.mp3",
            "categories": [
                "Uncategorized",
                "72 hour kit",
                "backpacking food tips",
                "backpacking with kids",
                "city water",
                "closed cell foam pad",
                "disaster",
                "Matador",
                "preparedness",
                "Ready for Adventure",
                "stoveless"
            ]
        },
        {
            "title": "043: Trends in Backpacking",
            "datePublished": "Tue, 08 Sep 2015 13:00:42 +0000",
            "description": "<p>Today on The First 40 Miles, learn about the upcoming trends in backpacking gear. Then, on The SUMMIT Gear Review, the headlamp that illuminates without a lot of complicated button pushing. Next, the Backpack Hack of the week will show you how to sleep like a baby. Then, we’ll wrap up the show with very little humor and a bit of trail wisdom.</p>",
            "length": "30505984",
            "sourceUrl": "http://media.blubrry.com/thefirst40miles/content.blubrry.com/thefirst40miles/TFFM043.mp3",
            "categories": [
                "Uncategorized",
                "Andy Rooney",
                "headlamp",
                "Lifestyle",
                "Outdoor Retailer Show",
                "pillow",
                "UCO",
                "Unknown",
                "You Might Be a Backpacker..."
            ]
        },
        {
            "title": "042: SPARK: The Fire Episode",
            "datePublished": "Tue, 01 Sep 2015 13:00:27 +0000",
            "description": "<p>Today on The First 40 Miles, fire has met its match. Learn five ways to light a fire that you may not have heard of before. Then on the SUMMIT Gear Review, Heather’s obsession with stoves is fueled with a piece of gear that not only burns sticks, but burns smoke as well. On the Backpack Hack of the Week, learn how to make a cotton ball into a charpuff that can be the slow-burning nucleus for the perfect fire. Then we’ll leave you with a little trail wisdom from a man of few words—<em>six</em> words to be exact.</p>",
            "length": "32967808",
            "sourceUrl": "http://media.blubrry.com/thefirst40miles/content.blubrry.com/thefirst40miles/TFFM042.mp3",
            "categories": [
                "Uncategorized",
                "chipmunks with Bic lighters",
                "fire",
                "forest fire",
                "meteorites",
                "Smokey Bear",
                "Solo Stove"
            ]
        },
        {
            "title": "041: Rescue on the Trail",
            "datePublished": "Tue, 25 Aug 2015 13:00:27 +0000",
            "description": "<p>Today on The First 40 Miles, whether you lost your food to a hungry chipmunk, or you got a flat tire at the trail head, there are good people out on the trail who want to help. We’ll show you five ways you can pay that kindness forward. On the SUMMIT Gear Review, you may want to think twice about what insects you allow in your pack—especially the FireAnt. For the Backpack Hack of the Week, Revlon has 72 glamorous ways to make sure you never lose a tent stake again.   And we’ll wrap up the show with a little trail wisdom that applies to just about everyone.</p>",
            "length": "31980160",
            "sourceUrl": "http://media.blubrry.com/thefirst40miles/content.blubrry.com/thefirst40miles/TFFM041.mp3",
            "categories": [
                "Uncategorized",
                "backpacking stove",
                "FireAnt",
                "Gary Chapman",
                "love languages",
                "nail polish",
                "rescue",
                "tent stakes"
            ]
        },
        {
            "title": "040: THE FIRST 40th EPISODE!",
            "datePublished": "Tue, 18 Aug 2015 13:00:37 +0000",
            "description": "<p>Today on The First 40 Miles, we’re celebrating our 40<sup>th</sup> episode!! The 40th episode isn’t typically a great achievement or milestone for most podcasts out there, but since our show is the First <strong><em>40</em></strong> Miles, then you bet your potatoes our 40<sup>th</sup> episode is exciting for us! We decided to do something a little crazy and different today, and give you an unedited, raw footage episode of The First 40 Miles. You’ll hear the behind the scenes chatter, the outtakes as they happen, and the odd noises from Subarus and helicopters that get normally edited out.</p>",
            "length": "32749312",
            "sourceUrl": "http://media.blubrry.com/thefirst40miles/content.blubrry.com/thefirst40miles/TFFM040.mp3",
            "categories": [
                "Uncategorized",
                "backpacking food",
                "beef jerky",
                "burfy",
                "first trip"
            ]
        },
        {
            "title": "039: How to Revive a Dead Pack",
            "datePublished": "Tue, 11 Aug 2015 13:00:16 +0000",
            "description": "<p>Today on The First 40 Miles, what kind of backpacker are you? Find out your type! Then on the SUMMIT Gear Review, a ten essential basic that may require a little educating to use. On the Backpack Hack of the Week, you’ll learn how a simple pinch may save your life. And we’ll wrap up the show with a little trail wisdom from a man who would probably spur some fascinating discussions around the campfire.</p>",
            "length": "36808192",
            "sourceUrl": "http://media.blubrry.com/thefirst40miles/content.blubrry.com/thefirst40miles/TFFM039.mp3",
            "categories": [
                "Uncategorized",
                "backpacker types",
                "backpacks",
                "budget",
                "compass",
                "dehydration",
                "Gregory",
                "orienteering",
                "Silva"
            ]
        },
        {
            "title": "038: GRUB: The Food Episode",
            "datePublished": "Tue, 04 Aug 2015 13:00:35 +0000",
            "description": "<p>Today on The First 40 Miles, GRUB: The Food Episode! We’ll give you 5 great ways to protect yourself and future hikers in your outdoor kitchen. Then on the SUMMIT Gear Review, a squirrel would have to be nuts to try to chew through this amazing food sack. On the Backpack Hack of the Week, we’ll teach you how to stockpile your arsenal of high calorie grab-and-go foods for your next trip. We’ll share some info on the good kind of dehydration in our backpackers Q+A, and we’ll wrap up the show with a little trail wisdom from a man who probably never missed a meal in his life.</p>",
            "length": "35861632",
            "sourceUrl": "http://media.blubrry.com/thefirst40miles/content.blubrry.com/thefirst40miles/TFFM038.mp3",
            "categories": [
                "Uncategorized",
                "Backpackers Q+A",
                "calories per ounce",
                "food",
                "food safety",
                "Outsak UL",
                "trekkers trots"
            ]
        },
        {
            "title": "037: Questions for Newbies",
            "datePublished": "Tue, 28 Jul 2015 13:00:16 +0000",
            "description": "<p>Today on The First 40 Miles, the Top 5 Questions Every New Backpacker Should Ask. On the SUMMIT Gear Review, you’ll find a nice budget option for keeping your ten essentials in perfect order. Then, on the Backpack Hack of the Week, <em>tenemos un pastel que es muy delicioso y es perfecto para mochileros</em>! And we’ll wrap up the show with a little trail wisdom from the most quoted man in the woods.</p>",
            "length": "31330816",
            "sourceUrl": "http://media.blubrry.com/thefirst40miles/content.blubrry.com/thefirst40miles/TFFM037.mp3",
            "categories": [
                "Uncategorized",
                "backpacking food",
                "John Muir",
                "organizer bags",
                "questions"
            ]
        },
        {
            "title": "036: Blessed, Honored Pioneer!",
            "datePublished": "Tue, 21 Jul 2015 13:00:40 +0000",
            "description": "<p>Today on The First 40 Miles, The Top 5 backpacking tips from some hearty Americans who lived in the days before ibuprofen (1961), freeze dried food (1905), or even the zipper (1893). On the SUMMIT Gear Review, you’ll learn the ins and outs of the minimalist hiker’s dream stove. Then, the Backpack Hack of the Week will send your arteries running with a to-die-for Cheddar Bacon Bannock, And we’ll wrap up the show with some “You Might Be a Backpacker” jokes and a piece of Trail Wisdom.</p>",
            "length": "26721280",
            "sourceUrl": "http://media.blubrry.com/thefirst40miles/content.blubrry.com/thefirst40miles/TFFM036.mp3",
            "categories": [
                "Uncategorized",
                "backpacking food",
                "pioneers",
                "QiWiz",
                "stove",
                "trek",
                "You Might Be a Backpacker..."
            ]
        },
        {
            "title": "035: Close to Home",
            "datePublished": "Tue, 14 Jul 2015 13:00:22 +0000",
            "description": "<p>Today on The First 40 Miles, the Top 5 Things You Need to Know to Beat the Sun. Then on the SUMMIT Gear Review, we’ll show you the perfect pouch that will help you transport your grandma’s famous jalapeno jelly to your favorite outdoor spot. Then our Backpack Hack of the Week will either singe your fingers or melt your gloves—all in the hope of having rope that won’t unravel! And we’ll wrap up the show with a little trail wisdom from our good friend on the trail, British Historian, Sir George Trevelyan.</p>",
            "length": "26199808",
            "sourceUrl": "http://media.blubrry.com/thefirst40miles/content.blubrry.com/thefirst40miles/TFFM035.mp3",
            "categories": [
                "Uncategorized",
                "backpacking food tips",
                "rope",
                "summer",
                "sun",
                "sunscreen"
            ]
        },
        {
            "title": "034: PRIVY: The Bathroom Episode",
            "datePublished": "Tue, 07 Jul 2015 13:00:28 +0000",
            "description": "<p>Today on The First 40 Miles, PRIVVY: The Bathroom Episode. Find out why this episode made it on our list of evergreen episodes. Then, learn the answers to the Top 5 Potty Questions: Things to Know Before You Go. Then, the SUMMIT Gear Review turns into the SUMMIT Smackdown as two trowels go head to head as they battle for a place in your pack. On the Backpack Hack of the Week, we’ll teach you a skill that Asians have known about for centuries--if not millennia. And we’ll wrap up the show with a little twist on trail wisdom.</p>",
            "length": "34760704",
            "sourceUrl": "http://media.blubrry.com/thefirst40miles/content.blubrry.com/thefirst40miles/TFFM034.mp3",
            "categories": [
                "Uncategorized",
                "Asian squat",
                "potty",
                "STP device",
                "toilet paper",
                "trowels"
            ]
        },
        {
            "title": "033: Show America Some Love",
            "datePublished": "Tue, 30 Jun 2015 13:00:24 +0000",
            "description": "<p>Today on The First 40 Miles, the Top 5 ways to show your love for America’s public lands. Then on the SUMMIT Gear Review we’ll show you how to sleep in pure comfort on a pad the size of a Nalgene bottle. Then ditch the toothpaste and try this simple DIY option for a clean mouth. Then we’ll leave you with a little trail wisdom from a brilliant German theoretical physicist.</p>",
            "length": "33585280",
            "sourceUrl": "http://media.blubrry.com/thefirst40miles/content.blubrry.com/thefirst40miles/TFFM033.mp3",
            "categories": [
                "Uncategorized",
                "America",
                "backpacking",
                "Klymit",
                "sleeping pad",
                "tooth powder",
                "trail service",
                "volunteer vacations"
            ]
        },
        {
            "title": "032: Jocks, Fancy Pants and Hobbits",
            "datePublished": "Tue, 23 Jun 2015 13:00:28 +0000",
            "description": "<p>Today on The First 40 Miles, the Top 5 reasons not to sweat It on the trail. Then on the SUMMIT Gear Review™, we’ll show you a pair of pants that will stand up to unexpected rain storms and puddle jumps. On the Backpack Hack of the Week™, we’ll introduce you to the classics. And we’ll wrap up the show with a little trail wisdom from a guy who does NOT live in a hole in the ground filled with the ends of worms and an oozy smell, nor yet a dry, bare, sandy hole with nothing in it to sit down on or to eat.</p>",
            "length": "33457024",
            "sourceUrl": "http://media.blubrry.com/thefirst40miles/content.blubrry.com/thefirst40miles/TFFM032.mp3",
            "categories": [
                "Uncategorized",
                "athleticism",
                "audiobooks",
                "pants",
                "sweat"
            ]
        },
        {
            "title": "031: Summertime",
            "datePublished": "Tue, 16 Jun 2015 13:00:09 +0000",
            "description": "<p>Today on The First 40 Miles, the Top 5 List for Totally Fun Summertime Backpacking Gear. Then on the SUMMIT Gear Review, we’ll show you the simplest way to drink 500 liters of water. On the Backpack Hack of the Week, we’ll explain a cool trick that dads can do to impress their kids while on their next backpacking adventure. And we’ll wrap up the show with a little trail wisdom from a quotologist.</p>",
            "length": "30460288",
            "sourceUrl": "http://media.blubrry.com/thefirst40miles/content.blubrry.com/thefirst40miles/TFFM031.mp3",
            "categories": [
                "Uncategorized",
                "Aquabot",
                "Father's Day",
                "Lightload Towels",
                "NUUN",
                "Popticals",
                "summertime",
                "sunscreen",
                "Vapur Microfilter",
                "You Might Be a Backpacker..."
            ]
        },
        {
            "title": "030: The Farmer and the Cowman",
            "datePublished": "Tue, 09 Jun 2015 13:00:04 +0000",
            "description": "<p>Today on The First 40 Miles, The Top 5 way to kick the stories and the one-upping into high gear around the campfire. Then on the SUMMIT Gear Review, we’ll share a multi-use bear canister that may help you cook dinner. On The Backpack Hack of the Week, we’ll show you how to carry oil in a way that is 99.99% leak-proof. An we’ll wrap up the show with a little trail wisdom from our good friend, science fiction writer Frank Herbert.</p>",
            "length": "33852544",
            "sourceUrl": "http://media.blubrry.com/thefirst40miles/content.blubrry.com/thefirst40miles/TFFM030.mp3",
            "categories": [
                "Uncategorized",
                "bear canisters",
                "bikers",
                "equestrian",
                "hikers",
                "leak proof",
                "Oklahoma",
                "Rodgers and Hammerstein",
                "storytelling"
            ]
        },
        {
            "title": "029: SHORT AND SWEET: The Children + Backpacking Episode",
            "datePublished": "Tue, 02 Jun 2015 13:00:28 +0000",
            "description": "<p>Today on The First 40 Miles, SHORT AND SWEET: The Children + Backpacking Episode. We have The Top 5 Outdoor Skills Every Child Should Know. Then we review a backpacking essential that will last your kids from age 10 to age 18. For the Backpack Hack of the Week, we’ll share our recipe for the #1 kid- requested trail energy bar. And we’ll leave you with some trail wisdom and some dates to put in your calendar!</p>",
            "length": "32983168",
            "sourceUrl": "http://media.blubrry.com/thefirst40miles/content.blubrry.com/thefirst40miles/TFFM029.mp3",
            "categories": [
                "Uncategorized",
                "backpacking",
                "backpacking food",
                "base layer",
                "children",
                "energy bars",
                "Gregory",
                "kids packs",
                "Mirazyme",
                "Myraz",
                "outdoor skills",
                "Terramar Sports"
            ]
        },
        {
            "title": "028: It’s All Uphill From Here",
            "datePublished": "Tue, 26 May 2015 13:00:38 +0000",
            "description": "<p>Today on The First 40 Miles, The Top 5 Tips that will help you make it through the tough uphill climbs. On the SUMMIT Gear Review, we’ll show you a vast improvement to the humble hiking stick. For the Backpack Hack of the Week, noodles noodle everywhere. And we’ll wrap up the show with a little trail wisdom from Mr. Emerson.</p>",
            "length": "30820096",
            "sourceUrl": "http://media.blubrry.com/thefirst40miles/content.blubrry.com/thefirst40miles/TFFM028.mp3",
            "categories": [
                "Uncategorized",
                "backpacking food",
                "Girls Camp",
                "mantras",
                "music",
                "rest step",
                "rice vermicelli",
                "survival",
                "trekking poles",
                "uphill"
            ]
        },
        {
            "title": "027: You’ll Never Stand in Line for A View",
            "datePublished": "Tue, 19 May 2015 13:00:56 +0000",
            "description": "Today on The First 40 Miles, The Top 5 New Things Heather Wants to Try on a Future Backpacking Trip. The SUMMIT Gear Review will show you the best place to take a nap on the trail. On the Backpack Hack of the Week, we will teach you a paradox of the trail—how to clean with dirt. We’ll share a little redneck style humor and then wrap up the show with a little trail wisdom from a man with the longest resume in the west!",
            "length": "30131200",
            "sourceUrl": "http://media.blubrry.com/thefirst40miles/content.blubrry.com/thefirst40miles/TFFM027.mp3",
            "categories": [
                "Uncategorized",
                "barefoot hiking",
                "dishes",
                "fishing",
                "foraging",
                "future trips",
                "increase in backpacking",
                "Xero Shoes"
            ]
        },
        {
            "title": "026: Backpacking Gifts for Grads and Newlyweds",
            "datePublished": "Tue, 12 May 2015 13:00:13 +0000",
            "description": "<p>Today on The First 40 Miles, we discover how a simple glitch submarined a recent Kickstarter campaign we shared with you. Then, school graduation is coming up and we have the perfect gear guide for your backpacking grad! On the SUMMIT Gear Review, we offer a simple solution to warmth, comfort and light on the trail. The Backpack Hack of the Week may save you some extra cash to put toward a new gear purchase. And the Backpackers Q + A will make sense of the piles of gear, stuff sacks and mayo packets. All this, and that’s about it…today on The First 40 Miles.</p>",
            "length": "31333504",
            "sourceUrl": "http://media.blubrry.com/thefirst40miles/content.blubrry.com/thefirst40miles/TFFM026.mp3",
            "categories": [
                "Uncategorized",
                "candle",
                "FOGO",
                "gifts",
                "kickstarter",
                "lantern",
                "magazines",
                "organization",
                "UCO Micro Candle Lantern"
            ]
        },
        {
            "title": "025: AHEAD OF THE CURVE: The Women + Backpacking Episode",
            "datePublished": "Tue, 05 May 2015 13:00:05 +0000",
            "description": "<p>Today on The First 40 Miles, it’s our Women + Backpacking Episode! We’ll share the top 5 questions about Women and Backpacking and what to do to prepare for a successful trip. On the SUMMIT™ Gear Review, we’ll teach you the Mayan name for Bonefish and why it matters! On The Backpack Hack of the Week™ we’ll share a $1 solution to the most common female complaint on the trail. Then we’ll answer a question that applies to folks with long hair.</p>",
            "length": "31812736",
            "sourceUrl": "http://media.blubrry.com/thefirst40miles/content.blubrry.com/thefirst40miles/TFFM025.mp3",
            "categories": [
                "Uncategorized",
                "backpacking",
                "DIY",
                "dry shampoo",
                "hiking skirt",
                "menstrual cup",
                "stand-to-pee",
                "urination",
                "washing hair",
                "women"
            ]
        },
        {
            "title": "024: Shoulder Season Backpacking",
            "datePublished": "Tue, 28 Apr 2015 13:00:53 +0000",
            "description": "<p>Today on The First 40 Miles, we’ll take a peak at the magical time between peak season and off peak season. On the SUMMIT Gear Review, you’ll meet the short, powerful cousin of the JetBoil Flash. Next, if you’ve always wanted to try Canadian cuisine, but were afraid to ask, we’ll give you the perfect recipe on the Backpack Hack of the Week. On the Backpackers Q+A, Mike from Utah has some questions about packs for all ages. Then we’ll wrap up the show with a little trail wisdom from our good friend on the trail, writer and outspoken man with a beard: Edward Abbey.</p>",
            "length": "29821696",
            "sourceUrl": "http://media.blubrry.com/thefirst40miles/content.blubrry.com/thefirst40miles/TFFM024.mp3",
            "categories": [
                "Uncategorized",
                "backpacking food",
                "JetBoil",
                "should season",
                "stoves"
            ]
        },
        {
            "title": "023: Spring Break 2015",
            "datePublished": "Tue, 21 Apr 2015 13:00:01 +0000",
            "description": "<p>Today on The First 40 Miles, we’ll take you on our Spring Break backpacking trip through the amazing Redwood Forest. Then we’ll talk a little trash and answer the question “What do I do with my garbage on the trail?” On the SUMMIT Gear Review™, we’ll review the #1 most popular backpacking item on our family’s Spring Break trip. Then on the Backpack Hack of the Week™ we’ll teach you a $2 trick that will get your fire started in seconds. We’ll wrap up the show with a little trail wisdom from a US President who maybe should have been in our Backpacking Pranks episode.</p>",
            "length": "30100168",
            "sourceUrl": "http://media.blubrry.com/thefirst40miles/content.blubrry.com/thefirst40miles/TFFM023.mp3",
            "categories": [
                "Uncategorized",
                "backpacking",
                "bear canisters",
                "family",
                "firestarter",
                "hammock",
                "kids",
                "Richard Nixon",
                "rodent proof bags",
                "Spring Break",
                "trash"
            ]
        },
        {
            "title": "022: If You Know Four Notes",
            "datePublished": "Tue, 14 Apr 2015 13:00:10 +0000",
            "description": "<p>Today on The First 40 Miles, Heather shares a little trail wisdom she picked up from an airplane magazine. Next, the top 5 reasons why wearing pants is a good idea (do we need 5 reasons to wear pants?) On the SUMMIT Gear Review™, we’ll show you a quick way to make fire. On the Backpack Hack of the Week™, you’ll save some grams and gain some peace of mind with disposable documents. And we’ll wrap up the show with a little trail wisdom from our good friend on the trail, Pulitzer Prize Winning Poet, Wallace Stevens</p>",
            "length": "29782519",
            "sourceUrl": "http://media.blubrry.com/thefirst40miles/content.blubrry.com/thefirst40miles/TFFM022.mp3",
            "categories": [
                "Uncategorized",
                "BIC lighter",
                "documents",
                "Girls Camp",
                "pants"
            ]
        },
        {
            "title": "021: Freeze Dried Meal Options",
            "datePublished": "Tue, 07 Apr 2015 13:00:54 +0000",
            "description": "<p>Today on The First 40 Miles, We have a big announcement to make that we know you’ll love! Then on our Top 5 List you’ll learn the secrets that Willie Nelson has known for years. Then the Backpack Hack of the Week, we’ll combine chocolate, almond butter and coconut in a way that is guaranteed to bring you joy—almond joy. The Backpackers Q+A give you three options for freeze dried meals, but you’ll have to take the quiz to find out which one fits. And we’ll wrap up the show with a little trail wisdom from our good friend on the trail, Mr. John Keats.</p>",
            "length": "29160832",
            "sourceUrl": "http://media.blubrry.com/thefirst40miles/content.blubrry.com/thefirst40miles/TFFM021.mp3",
            "categories": [
                "Uncategorized",
                "backpacking food",
                "bandanas",
                "chocolate",
                "freeze dried meals"
            ]
        },
        {
            "title": "020: Pranks on the Trail",
            "datePublished": "Tue, 31 Mar 2015 13:00:44 +0000",
            "description": "<p>We’re excited to share some Kickstarter stories that will spotlight creativity that benefits backpackers. Then, in celebration of April Fools Day, we give you 5 cringe-worthy pranks that will leave your trail mates wondering why they invited you. Then the SUMMIT™ Gear Review features a puffy that retains 96% of its warmth—even when wet! The Backpack Hack of the Week™ will show you a simple trick to win the Man vs Paracord battle. And we’ll wrap up the show with a little trail wisdom from a random snarky person on the internet.</p>",
            "length": "27114112",
            "sourceUrl": "http://media.blubrry.com/thefirst40miles/content.blubrry.com/thefirst40miles/TFFM020.mp3",
            "categories": [
                "Uncategorized",
                "innovation",
                "kickstarter",
                "paracord",
                "Patagonia",
                "pranks"
            ]
        },
        {
            "title": "019: This Land Was Made for You and Me",
            "datePublished": "Tue, 24 Mar 2015 14:00:08 +0000",
            "description": "<p>This land was made for you and me and 132,000 acres of Redwood trees in the Redwood National and State Park. Next, we share our top 5 tips for planning backpacking trips in the National Forests. The SUMMIT Gear Review will show you a first aid essential that is lighter than a band-aid. For the Backpack Hack of the Week, you’ll learn a simple trick to reduce pack bulk. And we’ll wrap up the show with a little trail wisdom from our good friend on the trail, writer and anthropologist, Richard Nelson.</p>",
            "length": "24166528",
            "sourceUrl": "http://media.blubrry.com/thefirst40miles/content.blubrry.com/thefirst40miles/TFFM019.mp3",
            "categories": [
                "Uncategorized",
                "National Forests",
                "National Parks",
                "thermometer",
                "trip planning"
            ]
        },
        {
            "title": "018: Don’t Blow the Budget!",
            "datePublished": "Tue, 17 Mar 2015 14:00:16 +0000",
            "description": "<p>Today on The First 40 Miles we’ll talk about combining backpacking with trail service. Next, the Top 5 ways to blow your backpacking budget. The SUMMIT Gear Review™ we’ll show you how to protect dry stuff from wet stuff. Then for the Backpack Hack of the Week™ will show you an easy way to keep grit on the trail and out of your shoes. And we’ll wrap up the show with a little Trail Wisdom from our good friend on the trail, Ralph.</p>",
            "length": "27766528",
            "sourceUrl": "http://media.blubrry.com/thefirst40miles/content.blubrry.com/thefirst40miles/TFFM018.mp3",
            "categories": [
                "Uncategorized",
                "budget",
                "dry bag",
                "gaiters",
                "service"
            ]
        },
        {
            "title": "017: How to Find Awesome Trails",
            "datePublished": "Tue, 10 Mar 2015 15:00:32 +0000",
            "description": "<p>Today we celebrate International Day of Awesomeness!  We talk about finding awesome \"backpackable\" trails.  Next, Heather shares her current bucket list of hikes.  Then, learn about an ultralight food prep bag, and get a recipe to go with it.  Fictitious listener, Dale in Oklahoma sends in a question about water filtering.</p>",
            "length": "27240832",
            "sourceUrl": "http://media.blubrry.com/thefirst40miles/content.blubrry.com/thefirst40miles/TFFM017.mp3",
            "categories": [
                "Uncategorized",
                "backpacking food"
            ]
        },
        {
            "title": "016: Say Goodbye to Sore Muscles",
            "datePublished": "Tue, 03 Mar 2015 16:00:39 +0000",
            "description": "<p>Want to avoid muscle soreness? It may be preventable! Next, on the Ready for Adventure segment, we’ll see if TSA is ready for Heather’s backpacking trip to Tuscon. On the Backpack Hack of the Week™ you’ll learn the French word for “Pony” and why it matters on the trail. Then we’ll answer a REAL listener question in Backpackers Q+A. And we’ll wrap up the show with a little Trail Wisdom from an American poet who must love you very much.</p>",
            "length": "27146752",
            "sourceUrl": "http://media.blubrry.com/thefirst40miles/content.blubrry.com/thefirst40miles/TFFM016.mp3",
            "categories": [
                "Uncategorized",
                "bidet",
                "children",
                "Gabe Zimmerman Trail",
                "muscles",
                "National Parks",
                "soreness"
            ]
        },
        {
            "title": "015: Alpaca: A Fiber to be Reckoned With",
            "datePublished": "Tue, 24 Feb 2015 16:00:49 +0000",
            "description": "<p>Heather shares a reason to listen to some brotherly advice. Then, we have a new feature that will get you Ready for Adventure! On the Backpack Hack of the Week™ you’ll learn how to have the nicest looking waterproof matches on the trail.  A fictitious listener sends in a question to the First 40 Miles.  And we’ll wrap up the show with a little Trail Wisdom from an absolute saint.</p>",
            "length": "27800308",
            "sourceUrl": "http://media.blubrry.com/thefirst40miles/content.blubrry.com/thefirst40miles/TFFM015.mp3",
            "categories": [
                "Uncategorized",
                "alpaca",
                "apps",
                "backpacking food",
                "camera",
                "phone",
                "search and rescue",
                "wool"
            ]
        },
        {
            "title": "014: One More Use for Duct Tape",
            "datePublished": "Tue, 17 Feb 2015 16:00:32 +0000",
            "description": "<p>What’s the view like out of a motel room window? We bet any tent view can beat that! Next, if today’s Top 5 list doesn’t work, then maybe some well-placed duct tape over the mouth will. The SUMMIT™ Gear Review will review The Weather-Proof Paper that Wasn’t. The Backpack Hack of the Week™ will show you a simple solution that will keep your your muddy shoes from deteriorating your valuable gear. And we’ll wrap up the show with a little Trail Wisdom from a well-known doctor.</p>",
            "length": "25256320",
            "sourceUrl": "http://media.blubrry.com/thefirst40miles/content.blubrry.com/thefirst40miles/TFFM014.mp3",
            "categories": [
                "Uncategorized",
                "attitude",
                "backpacking",
                "Dr Seuss",
                "duct tape",
                "Rite in the Rain",
                "shoes"
            ]
        },
        {
            "title": "013: Are You Hiking Your Own Hike?",
            "datePublished": "Tue, 10 Feb 2015 16:00:05 +0000",
            "description": "<p>Sometimes the hardest part of a hike is the eight hours when your feet <em>aren’t </em>moving. Learn some tried and true tips for sleeping while on your next backpacking trip. The Top 5 List will give you some great insights for “hiking your own hike” to maximize personal growth. Next, Heather and Josh review a lightning fast way to boil water for your next freeze dried meal. Then, the humble dollar store liquid laundry detergent bottle comes to the rescue to help banish the dreaded 'trail stank'.</p>",
            "length": "27920512",
            "sourceUrl": "http://media.blubrry.com/thefirst40miles/content.blubrry.com/thefirst40miles/TFFM013.mp3",
            "categories": [
                "Uncategorized",
                "HYOH",
                "laundry",
                "men in Togas",
                "Mother Nature",
                "sleep",
                "water"
            ]
        },
        {
            "title": "012: Inventors, Innovators, and Backpackers",
            "datePublished": "Tue, 03 Feb 2015 16:00:06 +0000",
            "description": "<p>Heather and Josh share some innovative backpacking gear from <a title=\"Kickstarter\" href=\"https://www.kickstarter.com/\">Kickstarter.com</a>. Next, you’ll learn about the top 5 pack messes and how to avoid them. Then we’ll review a pair of socks made by some hard-working worms. The Backpack Hack of the Week™ features an easy way to keep a lid on leftovers.</p>",
            "length": "29559808",
            "sourceUrl": "http://media.blubrry.com/thefirst40miles/content.blubrry.com/thefirst40miles/TFFM012.mp3",
            "categories": [
                "Uncategorized",
                "cheese",
                "chocolate",
                "kickstarter",
                "liner socks",
                "olive oil",
                "pack messes",
                "peanut butter"
            ]
        },
        {
            "title": "011: Beware the Raccoons",
            "datePublished": "Tue, 27 Jan 2015 16:30:05 +0000",
            "description": "<p>In this episode, we’ll talk about common fears on the trail and how to deal with them. Then we’ll share some high calorie trail snacks from a specialty food store that has been nicknamed “The Backpackers 7-Eleven.” The SUMMIT™ Gear Review will review a trail luxury that will keep you pumped up (without caffeine!). Next, the Backpack Hack of the Week™ will show you a sweet and simple way to add fuel to your internal furnace.</p>",
            "length": "28644736",
            "sourceUrl": "http://media.blubrry.com/thefirst40miles/content.blubrry.com/thefirst40miles/TFFM011.mp3",
            "categories": [
                "Uncategorized",
                "backpacking food",
                "fears",
                "hot chocolate",
                "mp3",
                "snacks"
            ]
        },
        {
            "title": "010: The Shake Down",
            "datePublished": "Tue, 20 Jan 2015 16:00:31 +0000",
            "description": "<p>The Shake Down: a trendy new dance move or a backpacking pre-trip? Next, learn a few tricks from the Boy Scouts from their iconic Merit Badge Pamphlets. Then, the Leglers revisit some rain gear that went through some blackberry vines and lived to tell the story. Lastly, Heather has invented a perfect solution to the messy bar of soap—and we promise it doesn’t use nylon stockings! You’ll love it!</p>",
            "length": "32576512",
            "sourceUrl": "http://media.blubrry.com/thefirst40miles/content.blubrry.com/thefirst40miles/TFFM010.mp3",
            "categories": [
                "Uncategorized",
                "backpacking",
                "Boy Scouts",
                "BSA",
                "first aid",
                "hike",
                "hiking",
                "orienteering",
                "rain gear",
                "shake down",
                "soap",
                "soap tube",
                "wilderness survival"
            ]
        },
        {
            "title": "009: Backpacking with a Blind Chicken",
            "datePublished": "Tue, 13 Jan 2015 16:24:20 +0000",
            "description": "<p>Would you give a six year old child a box of matches and some stove fuel? The Leglers talk about how they decided what went into each of their children’s packs. Then, you’ll learn five recipes that will get you fueled up without unpacking your stove. We’ll review a multitasking piece of clothing that will change the way you keep your head protected! Then, we’ll share a no-cook breakfast recipe that comes in at 1,058 calories!</p>",
            "length": "31927552",
            "sourceUrl": "http://media.blubrry.com/thefirst40miles/content.blubrry.com/thefirst40miles/TFFM009.mp3",
            "categories": [
                "Uncategorized",
                "backpacking food"
            ]
        },
        {
            "title": "008: Lewis and Clark Have Met Their Map",
            "datePublished": "Tue, 06 Jan 2015 16:00:11 +0000",
            "description": "<p>Learn how to outwit pesky, hungry trail rodents <em>without</em> dangling your food from a tree. Then, we’ll expose five ridiculous ultralight fails (HINT: Bubble wrap is for heirloom vases and vintage china). Next we review a lightweight, super durable map that would leave Lewis and Clark and Sacagawea a little jealous. And you’ll learn the trick to making unscented hand sanitizer that costs less than the gel hand sanitizer you keep in your glove box.</p>",
            "length": "27784960",
            "sourceUrl": "http://media.blubrry.com/thefirst40miles/content.blubrry.com/thefirst40miles/TFFM008.mp3",
            "categories": [
                "Uncategorized",
                "hand sanitizer",
                "maps",
                "rodents",
                "ultralight"
            ]
        },
        {
            "title": "007: When It Rains, You’re Covered",
            "datePublished": "Tue, 30 Dec 2014 08:30:45 +0000",
            "description": "<p>Recent research by a Kansas State physicist proves that petite folks have the advantage on the trail.  Next, be sure to pack an umbrella (is this a joke?) on your next backpacking trip.  On the SUMMIT™ Gear Review, we review a basic hat that left Heather’s ears out cold.  And you’ll learn how to make a simple breakfast that will take you back to your idyllic childhood in the Swiss Alps.</p>",
            "length": "23085568",
            "sourceUrl": "http://media.blubrry.com/thefirst40miles/content.blubrry.com/thefirst40miles/TFFM007.mp3",
            "categories": [
                "Uncategorized",
                "backpacking food",
                "micro shelter",
                "muesli",
                "parasol",
                "rain",
                "sun shade",
                "umbrella",
                "wool"
            ]
        },
        {
            "title": "006: Pipe Organs vs Harmonicas",
            "datePublished": "Tue, 23 Dec 2014 08:30:18 +0000",
            "description": "<p>Are you planning on bringing a musical instrument on your next backpacking trip?  This episode may have you rethinking that “unitasker” harmonica.  Next, backpackers grab an unusual piece of wood to burn to stay warm while they wait to be rescued.  We'll review a women's pack, then end with the perfect calorie-dense trail dessert: chocolate!</p>",
            "length": "29166976",
            "sourceUrl": "http://media.blubrry.com/thefirst40miles/content.blubrry.com/thefirst40miles/TFFM006.mp3",
            "categories": [
                "Uncategorized",
                "backpacking food",
                "backpacks",
                "musical instruments",
                "news",
                "Osprey",
                "Pacific Crest Trail",
                "PCT",
                "REI"
            ]
        },
        {
            "title": "005: Pick Any Two",
            "datePublished": "Tue, 16 Dec 2014 16:55:24 +0000",
            "description": "<p>Buying backpacking gear can be confusing, but it doesn't have to be! Learn the one trick that will help you buy great gear. Next, find out why you need to pack a one ounce bottle of alcohol your next trip (Hint: It's not what you think). We'll review a piece of clothing that would make your grandma jealous. And the Backpack Hack of the Week™ features a must-have item that pairs perfectly with your tube of sunscreen.</p>",
            "length": "22078720",
            "sourceUrl": "http://media.blubrry.com/thefirst40miles/content.blubrry.com/thefirst40miles/TFFM005.mp3",
            "categories": [
                "Uncategorized",
                "alcohol",
                "backpacking",
                "fuel",
                "gear",
                "merino wool",
                "socks",
                "sunglasses"
            ]
        },
        {
            "title": "004: How to Close the Backpack Gap",
            "datePublished": "Tue, 16 Dec 2014 16:44:04 +0000",
            "description": "<p>When was your last hiking or backpacking adventure? We'll talk about how to close the gap between your last adventure and your next one. Next, learn the secrets to avoid losing your backpacking gear on the trail. We'll review a low cost, lightweight piece of truly breathable rain gear. And you'll learn how to make a high calorie Mediterranean favorite on the trail that will go perfectly with that smashed pita bread in your pack.</p>",
            "length": "25667584",
            "sourceUrl": "http://media.blubrry.com/thefirst40miles/content.blubrry.com/thefirst40miles/TFFM004.mp3",
            "categories": [
                "Uncategorized",
                "backpacking food",
                "borrowed gear",
                "hikes",
                "rain gear"
            ]
        },
        {
            "title": "003: Shave the Ounces and the Pounds Will Follow",
            "datePublished": "Tue, 16 Dec 2014 16:41:56 +0000",
            "description": "<p>Get ready to lose some excess pack weight--and then add it back a few grams at a time. We'll also review a budget sleeping pad and find out how it actually worked on a recent camp out. If you're planning on making your next backpacking trip a creative retreat, then stay tuned to learn how to make an ultralight DIY Plein Air Watercolor Kit to toss into your pack for when creativity strikes on the trail!</p>",
            "length": "23313280",
            "sourceUrl": "http://media.blubrry.com/thefirst40miles/content.blubrry.com/thefirst40miles/TFFM003.mp3",
            "categories": [
                "Uncategorized",
                "backpacking",
                "DIY",
                "essential oils",
                "lightweight",
                "painting",
                "plein air",
                "sleeping pad",
                "watercolor"
            ]
        },
        {
            "title": "002: Surprising Places to Find Backpacking Stuff",
            "datePublished": "Tue, 16 Dec 2014 16:41:16 +0000",
            "description": "<p>In this episode we talk about trail magic and surprising places to find hiking and backpacking stuff. We'll also review a waterproof hiking shoe that won't give you \"squeaky toes\". The show wraps up with a super fast recipe that will keep you fueled up on the trail.</p>",
            "length": "26980480",
            "sourceUrl": "http://media.blubrry.com/thefirst40miles/content.blubrry.com/thefirst40miles/TFFM002.mp3",
            "categories": [
                "Uncategorized",
                "backpacking food",
                "gear",
                "hiking shoes",
                "trail magic",
                "waterproof shoes"
            ]
        },
        {
            "title": "001: Are You Really Bringing That Screwdriver?",
            "datePublished": "Tue, 16 Dec 2014 16:27:04 +0000",
            "description": "<p>If you’re new to hiking and backpacking then this podcast is for you. We’ll talk about the essentials, how to lighten your load and how to make the most of your time on the trail. This episode features the top 5 things you can leave home on your next backpacking trip, we'll review a piece of survival gear that should go with you on every outdoor adventure, and you'll learn how to make a trail essential out of something from your recycle bin. Welcome to The First 40 Miles!</p>",
            "length": "28016641",
            "sourceUrl": "http://media.blubrry.com/thefirst40miles/content.blubrry.com/thefirst40miles/TFFM001.mp3",
            "categories": [
                "Uncategorized",
                "backpacking",
                "bivvy",
                "DIY",
                "lightweight",
                "sink"
            ]
        }
    ]
}