{
    "artwork": "http://is1.mzstatic.com/image/thumb/Music117/v4/05/75/2d/05752d0c-0c21-cbaf-cb12-5f67da5bfab5/source/100x100bb.jpg",
    "description": "Significant international thinkers deliver the BBC's flagship annual lecture series",
    "feedURL": "https://podcasts.files.bbci.co.uk/b00729d9.rss",
    "podcastURL": "http://www.bbc.co.uk/programmes/b00729d9",
    "title": "The Reith Lectures",
    "episodes": [
        {
            "title": "5/5. Shifting the Foundations",
            "datePublished": "Tue, 18 Jun 2019 09:00:00 +0000",
            "description": "Jonathan Sumption argues against Britain adopting a written constitution as a response to political alienation. The former UK Supreme Court Justice  has argued that politics is in decline partly, at least, because the courts and the law is increasingly doing what politicians used to do. This has indirectly contributed to the electorate’s increasing rejection of the political process.  There is growing resentment against the political elite.  So what can we do?  Lord Sumption makes some suggestions to restore faith in democracy – starting by fixing the party system and changing the way we vote. \n\nThe programme is recorded in front of an audience at Cardiff University.\n\nThe Reith Lectures are presented and chaired by Anita Anand and produced by Jim Frank \n\nEditor: Hugh Levinson",
            "length": "40688000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p07c8ngp.mp3"
        },
        {
            "title": "4/5. Rights and the Ideal Constitution",
            "datePublished": "Tue, 11 Jun 2019 09:00:00 +0000",
            "description": "Jonathan Sumption assesses the US and UK’s constitutional models. He describes Britain's unwritten constitution as a political institution. The US Constitution is by contrast essentially a legal document.  This has led Americans to address what should be political questions – such as the right to abortion – via the courts, rather than through politics. Britain, Lord Sumption argues, should learn from the United States be careful about which rights should be put beyond democratic choice. \n\nThe programme is recorded in front of an audience at George Washington University in Washington DC.   \n\nThe Reith Lectures are presented and chaired by Anita Anand and produced by Jim Frank.  \nEditor: Hugh Levinson",
            "length": "40672000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p07c8yyk.mp3"
        },
        {
            "title": "3/5. Human Rights and Wrongs",
            "datePublished": "Tue, 04 Jun 2019 08:45:00 +0000",
            "description": "Jonathan Sumption argues that judges - especially those of the European Court of Human Rights - have usurped power by expanding the interpretation of human rights law. Lord Sumption argues that concepts of human rights have a long history in the common law. But by contrast, the European Convention on Human Rights has become a dynamic treaty, taking on new interpretations and powers. Article 8 – the right to private and family life – is the most striking example.  Should these decisions be made by judges or parliament? The lecture is recorded before an audience in the old Parliament House in Edinburgh.  \n\nThe Reith Lectures are presented and chaired by Anita Anand and produced by Jim Frank.  \nEditor: Hugh Levinson",
            "length": "40832000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p07bj30v.mp3"
        },
        {
            "title": "2/5. In Praise of Politics",
            "datePublished": "Tue, 28 May 2019 08:45:00 +0000",
            "description": "Jonathan Sumption explains how democratic processes have the power to accommodate opposition opinions and interests. But he argues that in recent years that politics has shied away from legislating and now the courts have taken on more and more of the role of making law. Lord Sumption was until recently a justice of the UK’s Supreme Court and is a distinguished historian.  This lecture is recorded in front of an audience at Birmingham University.\n\nThe Reith Lectures are presented and chaired by Anita Anand and produced by Jim Frank. \nEditor: Hugh Levinson",
            "length": "40832000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p07b6mgm.mp3"
        },
        {
            "title": "1/5. Law's Expanding Empire",
            "datePublished": "Tue, 21 May 2019 15:05:00 +0000",
            "description": "Jonathan Sumption argues that the law is taking over the space once occupied by politics. Lord Sumption was until recently a justice of the UK’s Supreme Court, as well as being a distinguished historian. In this lecture, recorded before an audience at Middle Temple in London, Lord Sumption says that until the 19th century, law only dealt with a narrow range of human problems.  That has now changed radically.  And he argues that the growth of the law, driven by demand for greater personal security and less risk, means we have less liberty.\nThe Reith Lectures are presented and chaired by Anita Anand and produced by Jim Frank \nEditor: Hugh Levinson",
            "length": "55360000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p079x1sd.mp3"
        },
        {
            "title": "War's Fatal Attraction",
            "datePublished": "Tue, 24 Jul 2018 08:30:00 +0000",
            "description": "Historian Margaret MacMillan looks at representations of war: can we really create beauty from horror and death? Speaking at the Canadian War Museum, she discusses the paradox of commemoration. She questions attempts to capture the essence and meaning of war through art. The programme is presented by Anita Anand in front of an audience and includes a question and answer session. \n\nProducer: Jim Frank \nEditor: Hugh Levinson.",
            "length": "40592000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p06f5wh0.mp3"
        },
        {
            "title": "Managing the Unmanageable",
            "datePublished": "Tue, 17 Jul 2018 09:00:00 +0000",
            "description": "Historian Margaret MacMillan assesses how the law and international agreements have attempted to address conflict. Speaking to an audience at the Northern Irish Parliament Buildings at Stormont in Belfast, Professor MacMillan outlines how both states and the people have sought to justify warfare - from self-defence to civil war - focusing on examples from Irish and British history. The programme, including a question and answer session, is presented by Anita Anand. \n\nProducer: Jim Frank \nEditor: Hugh Levinson.",
            "length": "54944000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p06dgxm4.mp3"
        },
        {
            "title": "Civilians and War",
            "datePublished": "Tue, 10 Jul 2018 09:00:00 +0000",
            "description": "Historian Margaret MacMillan dissects the relationship between war and the civilian. Speaking to an audience in Beirut, she looks back at the city's violent past and discusses the impact of conflict on noncombatants throughout the centuries. She explores how civilians have been deliberately targeted, used as slaves and why women are still often singled out in mass rapes. And she addresses the proposition that human beings are becoming less, not more violent. The programme is chaired by Anita Anand.\n\nProducer: Jim Frank \nEditor: Hugh Levinson.",
            "length": "55232000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p06cyl19.mp3"
        },
        {
            "title": "Fearing and Loving: Making Sense of the Warrior",
            "datePublished": "Tue, 03 Jul 2018 09:00:00 +0000",
            "description": "Historian Margaret MacMillan asks why both men and women go to war. \"We are both fascinated and repulsed by war and those who fight,\" she says. In this lecture, recorded at York University, she explores looks at the role of the warrior in history and culture and analyses how warriors are produced. And she interrogates the differences that gender plays in war. Anita Anand presents the programme recorded in front of an audience, including a question and answer session. \n\nProducer: Jim Frank\nEditor: Hugh Levinson.",
            "length": "55152000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p06cng4d.mp3"
        },
        {
            "title": "War and Humanity",
            "datePublished": "Tue, 26 Jun 2018 08:45:00 +0000",
            "description": "Is war an essential part of being human? Are we destined to fight? That is the central question that historian Professor Margaret Macmillan addresses in five lectures recorded in the UK, Lebanon and in Canada. In her series, called The Mark of Cain, she will explore the tangled history of war and society and our complicated feelings towards it and towards those who fight.\n\nShe begins by asking when wars first broke out. Did they start with the appearance of homo sapiens, or when human beings first organised themselves into larger groupings such as tribes, clans, or nations? She assesses how wars bring about change in society and, conversely, how social and political change influences how wars start and are fought. And she discusses that dark paradox of war: that it can bring benefits and progress. \n\nThe programme is recorded before an audience at the BBC Radio Theatre in London and includes a question and answer session chaired by Anita Anand. \n\nMargaret MacMillan is emeritus professor of international history at Oxford University and professor of history at the University of Toronto. She says: \"We like to think of war as an aberration, as the breakdown of the normal state of peace. This is comforting but wrong. War is deeply woven into the history of human society. Wherever we look in the past, no matter where or how far back we go, groups of people have organised themselves to protect their own territory or ways of life and, often, to attack those of others. Over the centuries we have deplored the results and struggled to tame war, even abolish it, while we have also venerated the warrior and talked of the nobility and grandeur of war. We all, as human beings, have something to say about war.\"\n\nProducer: Jim Frank\nEditor: Hugh Levinson.",
            "length": "40672000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p06c3xnx.mp3"
        },
        {
            "title": "Angela Stent on George Kennan",
            "datePublished": "Fri, 29 Sep 2017 13:33:00 +0000",
            "description": "Significant international thinkers deliver the BBC's flagship annual lecture series",
            "length": "14208000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p05hkqxl.mp3"
        },
        {
            "title": "Grayson Perry on Nikolaus Pevsner",
            "datePublished": "Thu, 28 Sep 2017 14:22:00 +0000",
            "description": "Significant international thinkers deliver the BBC's flagship annual lecture series",
            "length": "15248000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p05hhb5c.mp3"
        },
        {
            "title": "Brian Cox on Robert Oppenheimer",
            "datePublished": "Wed, 27 Sep 2017 13:33:00 +0000",
            "description": "Significant international thinkers deliver the BBC's flagship annual lecture series",
            "length": "27056000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p05hctkn.mp3"
        },
        {
            "title": "Anand Menon on Robert Birley",
            "datePublished": "Wed, 27 Sep 2017 10:40:00 +0000",
            "description": "Significant international thinkers deliver the BBC's flagship annual lecture series",
            "length": "15072000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p05hcp2x.mp3"
        },
        {
            "title": "Michael Sandel on Bertrand Russell",
            "datePublished": "Wed, 27 Sep 2017 10:37:00 +0000",
            "description": "Significant international thinkers deliver the BBC's flagship annual lecture series",
            "length": "20624000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p05hcp5q.mp3"
        },
        {
            "title": "Adaptation",
            "datePublished": "Tue, 11 Jul 2017 08:50:00 +0000",
            "description": "Hilary Mantel on how fiction changes when adapted for stage or screen. Each medium, she says, draws a different potential from the original. She argues that fiction, if written well, doesn't betray history, but enhances it. When fiction is turned into theatre, or into a film or TV, the same applies - as long as we understand that adaptation is not a secondary process or a set of grudging compromises, but an act of creation in itself. And this matters. \"Without art, what have you to inform you about the past?\" she asks. \"What lies beyond is the unedited flicker of closed-circuit TV.\"\n\nThe programme is recorded in Stratford-Upon-Avon in front of an audience, with a question and answer session, chaired by Sue Lawley. The producer is Jim Frank.",
            "length": "55136000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p0581lmn.mp3"
        },
        {
            "title": "Can These Bones Live?",
            "datePublished": "Tue, 04 Jul 2017 08:50:00 +0000",
            "description": "Hilary Mantel analyses how historical fiction can make the past come to life. She says her task is to take history out of the archive and relocate it in a body. \"It's the novelist's job: to put the reader in the moment, even if the moment is 500 years ago.\" She takes apart the practical job of \"resurrection\", and the process that gets historical fiction on to the page. \"The historian will always wonder why you left certain things out, while the literary critic will wonder why you left them in,\" she says. How then does she try and get the balance right? \n\nThe lecture is recorded in front of an audience in Exeter, near Mantel's adopted home in East Devon, followed by a question and answer session. The Reith Lectures are chaired by Sue Lawley and produced by Jim Frank.",
            "length": "47808000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p057k3rf.mp3"
        },
        {
            "title": "Silence Grips the Town",
            "datePublished": "Tue, 27 Jun 2017 08:45:00 +0000",
            "description": "The story of how an obsessive relationship with history killed the young Polish writer Stanislawa Przybyszewska, told by best-selling author, Hilary Mantel. The brilliant Przybyszewska wrote gargantuan plays and novels about the French Revolution, in particular about the revolutionary leader Robespierre. She lived in self-willed poverty and isolation and died unknown in 1934. But her work, so painfully achieved, did survive her. Was her sacrifice worthwhile? \"She embodied the past until her body ceased to be,\" Dame Hilary says. \"Multiple causes of death were recorded, but actually she died of Robespierre.\" \n\nOver the course of these five lectures, she discusses the role that history plays in our lives. How do we view the past, she asks, and what is our relationship with the dead? The lecture is recorded before an audience in the ancient Vleeshuis in Antwerp, a city which features in Mantel's novels about Thomas Cromwell and the cosmopolitan world of the early Tudors. The lecture is followed by a question and answer session chaired by Sue Lawley. \n\nThe producer is Jim Frank.",
            "length": "47856000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p056rtzw.mp3"
        },
        {
            "title": "The Iron Maiden",
            "datePublished": "Tue, 20 Jun 2017 08:50:00 +0000",
            "description": "How do we construct our pictures of the past, including both truth and myth, asks best-selling author Hilary Mantel. Where do we get our evidence? She warns of two familiar errors: either romanticising the past, or seeing it as a gory horror-show. It is tempting, but often condescending, to seek modern parallels for historical events. \"Are we looking into the past, or looking into a mirror?\" she asks. \"Dead strangers...did not live and die so we could draw lessons from them.\" Above all, she says, we must all try to respect the past amid all its strangeness and complexity. \n\nOver the course of the lecture series, Dame Hilary discusses the role that history plays in our culture. She asks how we view the past and what our relationship is with the dead.\n\nThe programme is recorded in front of an audience at Middle Temple in London, followed by a question and answer session. \n\nThe Reith Lectures are chaired by Sue Lawley and produced by Jim Frank.",
            "length": "47776000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p0562nf1.mp3"
        },
        {
            "title": "The Day Is for the Living",
            "datePublished": "Tue, 13 Jun 2017 08:50:00 +0000",
            "description": "Art can bring the dead back to life, argues the best-selling novelist Hilary Mantel, starting with the story of her own great-grandmother. \"We sense the dead have a vital force still,\" she says. \"They have something to tell us, something we need to understand. Using fiction and drama, we try to gain that understanding.\" She describes how and why she began to write fiction about the past, and how her view of her trade has evolved. We cannot hear or see the past, she says, but \"we can listen and look\". \n\nOver this series of five lectures, Dame Hilary discusses the role that history plays in our culture. How can we understand the past, she asks, and how can we convey its nature today? Above all, she believes, we must all try to respect the past amid all its strangeness and complexity. \n\nThe lecture is recorded in front of an audience at Halle St Peter's in Manchester, and is followed by a question and answer session chaired by Sue Lawley. \nThe producer is Jim Frank.",
            "length": "48080000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p055q4qz.mp3"
        },
        {
            "title": "Culture",
            "datePublished": "Tue, 08 Nov 2016 09:10:00 +0000",
            "description": "The philosopher and cultural theorist Kwame Anthony Appiah says the idea of \"Western civilization\" or \"Western culture\" is a mistaken one and that we should abandon it.\n\nHe uncovers the history of the idea from its roots at the time of the Crusades to its modern incarnation in the second half of the 20th century. However, we have very little culturally in common with our forebears in say the England of Chaucer's time. And indeed much of the knowledge supposedly at the heart of Western civilisation was actually transmitted via Islamic scholarship. No-one, he argues, can claim exclusive ownership of culture. \"The values European humanists like to espouse belong just as easily to an African or an Asian who takes them up with enthusiasm as to a European,\" he says.\n\nThe lecture is recorded in front of an audience at New York University in Appiah's adopted home city. The series is presented and chaired by Sue Lawley\n\nThe producer is Jim Frank.",
            "length": "54272000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p04fhn65.mp3"
        },
        {
            "title": "Colour",
            "datePublished": "Tue, 01 Nov 2016 09:30:00 +0000",
            "description": "The philosopher and cultural theorist Kwame Anthony Appiah argues for a world free of racial fixations. \n\nHe tells the story of Anton Wilhelm Amo Afer. He was five years old when he was brought from the Gold Coast to Germany in 1707, educated at a royal court and became an eminent philosopher. He argues that this elaborate Enlightenment experiment illuminates a series of mistaken ideas , including that there is a \"racial essence\" which all members of that race carry. Modern science long ago disproved this, as almost all of the world's genetic variation is found within every so-called racial group. Instead, \"race is something we make; not something that makes us.\"\n\nThe lecture is recorded in front of an audience at the British Council in Accra, Ghana. The series is presented and chaired by Sue Lawley\n\nThe producer is Jim Frank.",
            "length": "54288000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p04drmrn.mp3"
        },
        {
            "title": "Country",
            "datePublished": "Tue, 25 Oct 2016 08:45:00 +0000",
            "description": "The philosopher and cultural theorist Kwame Anthony Appiah argues against a mythical, romantic view of nationhood, saying instead it should rest on a commitment to shared values.\n\nHe explores the history of the idea, born in the 19th century, that there are peoples who are bound together by an ancient common spirit and that each of these nations is entitled to its own state. He says this idea is a mistaken one, illustrating his argument through the life story of the writer who took the pen name Italo Svevo - meaning literally Italian Swabian. He was born a citizen of the Austro-Hungarian Empire and became a citizen of the new republic of Italy, all without leaving his home city of Trieste. Appiah argues that states exist as a set of shared beliefs rather than membership of some sort of mythical and ancient group. \"What binds citizens together is a commitment,\" he says, \"to sharing the life of a modern state, united by its institutions, procedures and precepts.\"\n\nThe lecture is recorded in front of an audience at the University of Glasgow. The series is presented and chaired by Sue Lawley. Future lectures will examine the themes of colour and culture.\n\nThe producer is Jim Frank.",
            "length": "54272000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p04d0wwg.mp3"
        },
        {
            "title": "Creed",
            "datePublished": "Tue, 18 Oct 2016 10:24:00 +0000",
            "description": "Philosopher and cultural theorist Kwame Anthony Appiah argues that when considering religion we overestimate the importance of scripture and underestimate the importance of practice.\n\nHe begins with the complexities of his own background, as the son of an English Anglican mother and a Ghanaian Methodist father. He turns to the idea that religious faith is based around unchanging and unchangeable holy scriptures. He argues that over the millennia religious practice has been quite as important as religious writings. He provides examples from Jewish, Christian, Islamic and Buddhist texts to show that they are often contradictory and have been interpreted in different ways at different times, for example on the position of women and men in Islam. He argues that fundamentalists are a particularly extreme example of this mistaken scriptural determinism.\n\nThe lecture is recorded in front of audience at the London School of Economics and Political Science. The series is presented and chaired by Sue Lawley. Future lectures will examine identity in the contexts of country, colour and culture.\n\nThe producer is Jim Frank.",
            "length": "54304000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p04cdf90.mp3"
        },
        {
            "title": "Black holes ain't as black as they are painted",
            "datePublished": "Tue, 02 Feb 2016 09:01:00 +0000",
            "description": "The Cambridge cosmologist Professor Stephen Hawking delivers the second of his BBC Reith Lectures on black holes. \n\nProfessor Hawking examines scientific thinking about black holes and challenges the idea that all matter and information is destroyed irretrievably within them. He explains his own hypothesis that black holes may emit a form of radiation, now known as Hawking Radiation. He discusses the search for mini black holes, noting that so far \"no-one has found any, which is a pity because if they had, I would have got a Nobel Prize.\" And he advances a theory that information may remain stored within black holes in a scrambled form.\n\nThe programmes are recorded in front of an audience of Radio 4 listeners and some of the country's leading scientists at the Royal Institution of Great Britain in London. \n\nSue Lawley introduces the evening and chairs a question-and-answer session with Professor Hawking. Radio 4 listeners submitted questions in their hundreds, of which a selection were invited to attend the event to put their questions in person to Professor Hawking.\n\nProducer: Jim Frank.",
            "length": "28224000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p03gnm5d.mp3"
        },
        {
            "title": "Do black holes have no hair?",
            "datePublished": "Tue, 26 Jan 2016 16:56:00 +0000",
            "description": "Professor Stephen Hawking delivers the first of his two BBC Reith Lectures on black holes. \n\nThese collapsed stars challenge the very nature of space and time, as they contain a singularity - a phenomenon where the normal rules of the universe break down. They have held an enduring fascination for Professor Hawking throughout his life. Rather than see them as a scary, destructive and dark he says if properly understood, they could unlock the deepest secrets of the cosmos. \n\nProfessor Hawking describes the history of scientific thinking about black holes, and explains how they have posed tough challenges to conventional understanding of the laws which govern the universe.\n\nThe programmes are recorded in front of an audience of Radio 4 listeners and some of the country's leading scientists at the Royal Institution of Great Britain in London. \n\nSue Lawley introduces the evening and chairs a question-and-answer session with Professor Hawking. Radio 4 listeners submitted questions in their hundreds, of which a selection were invited to attend the event to put their questions in person to Professor Hawking.\n\nProducer: Jim Frank.",
            "length": "28672000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p03gnl47.mp3"
        },
        {
            "title": "The Idea of Wellbeing",
            "datePublished": "Tue, 16 Dec 2014 09:45:00 +0000",
            "description": "The surgeon and writer Atul Gawande calls for a new focus on medical systems to ensure doctors work more effectively, alongside far greater transparency about their performance.\n\nSpeaking to an audience at the India International Centre in Delhi, he describes the story of medicine over the last century through the prism of his own family. From a grandmother who died in rural India from malaria - a preventable disease - to the high-tech medicine of today. He argues that despite its scientific advances, medicine has failed to exploit its knowledge successfully. In both the developed and developing world doctors do not carry out basic procedures effectively and often do not act in the best interests of their patients. He calls for wide-ranging research into the systems by which medical care is delivered, alongside far greater transparency about performance.\n\nThe Reith Lectures are introduced and chaired by Sue Lawley and produced by Jim Frank.",
            "length": "40400000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02qgfhm.mp3"
        },
        {
            "title": "The Problem of Hubris",
            "datePublished": "Tue, 09 Dec 2014 09:45:00 +0000",
            "description": "Surgeon and writer Atul Gawande calls for a new approach to the two great unfixable problems in life and healthcare - ageing and death. He tells the story of how his daughter's piano teacher faced up to terminal cancer and the crucial choices she made about how to spend her final days. He says the teacher was only able to do this because of an essential honesty from her physicians and the people around her. Dr. Gawande argues that the common reluctance of society and medical institutions to recognise the limits of what professionals can do can end up increasing the suffering of patients towards the end of life. He proposes that both doctors and individuals ask a series of simple but penetrating questions to decide what kind of treatment is appropriate - or whether treatment is appropriate at all. And he praises the values of the hospice movement, in putting quality of life before prolonging life.\n\n\nThe programme was recorded at The Royal Society in Edinburgh in front of an audience.\n\nThe Reith Lectures are introduced and chaired by Sue Lawley and produced by Jim Frank.",
            "length": "40144000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02qf2x4.mp3"
        },
        {
            "title": "The Century of the System",
            "datePublished": "Tue, 02 Dec 2014 09:45:00 +0000",
            "description": "The surgeon and writer Atul Gawande argues that better systems can transform global healthcare by radically reducing the chance of mistakes and increasing the chance of successful outcomes.\n\nHe tells the story of how a little-known hospital in Austria managed to develop a complex yet highly effective system for dealing with victims of drowning. He says that the lesson from this dramatic narrative is that effective systems can provide major improvements in success rates for surgery and other medical procedures. Even a simple checklist - of the kind routinely used in the aviation industry - can be remarkably effective. And he argues that these systems have the power to transform care from the richest parts of the world to the poorest.\n\nThe programme was recorded at The Wellcome Collection in London before an audience.\n\nThe Reith Lectures are chaired and introduced by Sue Lawley and produced by Jim Frank.",
            "length": "40048000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02qhxz8.mp3"
        },
        {
            "title": "Why Do Doctors Fail?",
            "datePublished": "Tue, 25 Nov 2014 09:45:00 +0000",
            "description": "Surgeon and writer Atul Gawande explores the nature of fallibility and suggests that preventing avoidable mistakes is a key challenge for the future of medicine.\n\nThrough the story of a life-threatening condition which affected his own baby son, Dr. Gawande suggests that the medical profession needs to understand how best to deploy the enormous arsenal of knowledge which it has acquired. And his challenge for global health is to address the inequalities in access to resources and expertise both within and between countries.\n\nThis first of four lectures was recorded before an audience at the John F Kennedy Presidential Library and Museum in Dr. Gawande's home town of Boston in Massachusetts. The other lectures are recorded in London, Edinburgh and Delhi.\n\nThe series is introduced and chaired by Sue Lawley. The producer is Jim Frank.",
            "length": "40160000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02qj03q.mp3"
        },
        {
            "title": "I Found Myself in the Art World",
            "datePublished": "Tue, 05 Nov 2013 09:40:00 +0000",
            "description": "In the last of his four Reith Lectures, recorded in front of an audience at Central St Martins School of Art in London, the artist Grayson Perry discusses his life in the art world; the journey from the unconscious child playing with paint, to the award-winning successful artist of today. He talks about being an outsider and how he struggles with keeping his integrity as an artist. Perry looks back and asks why men and women throughout history, despite all the various privations they suffered, have always made art. And he discusses the central purpose of creating art - to heal psychic wounds and to make meaning. \n \nPerry was awarded the Turner Prize in 2003 and is well known for his ceramic works, printmaking, drawing, sculpture and tapestry. He is also known as one of Britain's most famous cross-dressers as alter ego Claire.\n \nThe Reith Lectures are presented by Sue Lawley and produced by Jim Frank.\n",
            "length": "40176000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02qj64d.mp3"
        },
        {
            "title": "Nice Rebellion, Welcome In!",
            "datePublished": "Tue, 29 Oct 2013 09:40:00 +0000",
            "description": "In the third of four lectures, recorded in front of an audience at The Guildhall in Londonderry, the artist Grayson Perry asks if revolution is a defining idea in art, or has it met its end?\n\nPerry says the world of art seems to be strongly associated with novelty. He argues that the mainstream media seems particularly drawn to the idea of there being an avant-garde: work is always described as being \"cutting edge,\" artists are \"radical,\" shows are \"mould-breaking,\" ideas are \"ground-breaking,\" \"game-changing\" or \"revolutionary,\" We are forever being told that a new paradigm is being set. \n \nPerry says we have reached the final state of art. Not an end game, as there will always be great new art, but that art has lost one of its central tenets: its ability to shock. We have seen it all before.\n\nGrayson Perry was awarded the Turner Prize in 2003 and is the first contemporary artist to deliver the Reith Lectures. He is best known for his ceramic works, print making, drawing, sculpture and tapestries as well as being a flamboyant cross-dresser.\n\nThe Reith Lectures are presented and chaired by Sue Lawley and produced by Jim Frank.\n ",
            "length": "40208000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02qf63l.mp3"
        },
        {
            "title": "Beating the Bounds",
            "datePublished": "Tue, 22 Oct 2013 08:40:00 +0000",
            "description": "The award-winning artist Grayson Perry asks whether it is really true that anything can be art. We live in an age when many contemporary artists follow the example of Marcel Duchamp, who famously declared that a urinal was a work of art. It sometimes seems that anything qualifies, from a pile of sweets on a gallery floor to an Oscar-winning actress asleep in a box. How does the ordinary art lover decide?\nIn a lecture delivered amidst the Victorian splendour of St. George's Hall in Liverpool, Perry analyses with characteristic wit the common tests - from commercial worth to public popularity to aesthetic value. He admits the inadequacies of such yardsticks, especially when applied to much conceptual and performance art. And he concludes that in his opinion, the quality most valued in the art world is seriousness.\nProducer: Jim Frank",
            "length": "40240000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02qf129.mp3"
        },
        {
            "title": "Democracy has bad taste",
            "datePublished": "Tue, 15 Oct 2013 09:23:00 +0000",
            "description": "In the first of four lectures, recorded in front of an audience at Tate Modern in London in 2013, the artist Grayson Perry reflects on the idea of quality and examines who and what defines what we see and value as art. He argues that there is no empirical way to judge quality in art. Instead the validation of quality rests in the hands of a tightknit group of people at the heart of the art world including curators, dealers, collectors and critics who decide in the end what ends up in galleries and museums. Often the last to have a say are the public.\nPerry examines the words and language that have developed around art critique, including what he sees as the growing tendency to over-intellectualise the response to art. He analyses the art market and quotes – with some irony – an insider who says that certain colours sell better than others. He queries whether familiarity makes us like certain artworks more, and encourages the public to learn to appreciate different forms of art through exploration and open-mindedness. \nPerry was awarded the Turner Prize in 2003, and is known for his ceramic works, printmaking, drawing, sculpture and tapestry as well as for his cross-dressing and alter-ego, Claire. \nThe lecture series is presented and chaired by Sue Lawley. \nProducer: Jim Frank",
            "length": "41264000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02qhqgp.mp3"
        },
        {
            "title": "Civil and Uncivil Societies",
            "datePublished": "Tue, 10 Jul 2012 08:30:00 +0000",
            "description": "The historian Niall Ferguson examines institutions outside the political, economic and legal realms, whose primary purpose is to preserve and transmit particular knowledge and values. In a lecture delivered at the Royal Society of Edinburgh, he asks if the modern state is quietly killing civil society in the Western world? And what can non-Western societies do to build a vibrant civil society?\n\nProducer: Jane Beresford.",
            "length": "54736000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02r83zq.mp3"
        },
        {
            "title": "The Landscape of the Law",
            "datePublished": "Tue, 03 Jul 2012 08:30:00 +0000",
            "description": "The historian Niall Ferguson delivers a lecture at Gresham College in the heart of legal London, addressing the relationship between the nature of law and economic success. He examines the rule of law in comparative terms, asking how far the common law's claims to superiority over other systems are credible. Are we living through a time of creeping legal degeneration in the English-speaking world? \n\nProducer: Jane Beresford.",
            "length": "51088000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02r80x3.mp3"
        },
        {
            "title": "The Darwinian Economy",
            "datePublished": "Tue, 26 Jun 2012 08:30:00 +0000",
            "description": "The eminent economic historian Niall Ferguson travels to the world's financial centre to deliver a lecture at the New-York Historical Society. He reflects on the causes of the global financial crisis, and argues that many people have drawn erroneous conclusions from it about the role of regulation. Is regulation, he asks, in fact \"the disease of which it purports to be the cure\"?\nProducer: Jane Beresford.",
            "length": "50848000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02r80zp.mp3"
        },
        {
            "title": "The Human Hive",
            "datePublished": "Tue, 19 Jun 2012 08:30:00 +0000",
            "description": "The eminent economic historian Professor Niall Ferguson argues that institutions determine the success or failure of nations. In a lecture delivered at the London School of Economics and Political Science, he says that a society governed by abstract, impersonal rules will become richer than one ruled by personal relationships. The rule of law is crucial to the creation of a modern economy and its early adoption is the reason why Western nations grew so powerful in the modern age.\n\nBut are the institutions of the West now degenerating? Professor Ferguson asks whether the democratic system has a fatal flaw at its heart. In the West young people are confronting the fact that they must live with the huge financial debt generated by their parents, something they had no control over despite the fact that they were born into a democracy. Is there a way of restoring the compact between different generations?\n\nProducer: Jane Beresford.",
            "length": "50944000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02r81jv.mp3"
        },
        {
            "title": "Eliza Manningham-Buller: Freedom",
            "datePublished": "Tue, 20 Sep 2011 08:30:00 +0000",
            "description": "In this third and final Reith lecture the former Director General of the security service (MI5), Eliza Manningham-Buller, discusses policy priorities since 9.11. She reflects on the Arab Spring, and argues that the West's support of authoritarian regimes did, to some extent, fuel the growth of Al-Qaeda. The lecture also considers when we should talk to \"terrorists\".",
            "length": "51232000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02r7t10.mp3"
        },
        {
            "title": "Eliza Manningham-Buller: Security",
            "datePublished": "Tue, 13 Sep 2011 08:30:00 +0000",
            "description": "The former Director-General of the Security Service (MI5), Eliza Manningham-Buller gives the second of her BBC Reith Lectures 2011. In this lecture called \" Security\" she argues that the security and intelligence services in a democracy have a good record of protecting and preserving freedom.",
            "length": "40640000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02r831s.mp3"
        },
        {
            "title": "Eliza Manningham-Buller: Terror",
            "datePublished": "Tue, 06 Sep 2011 08:40:00 +0000",
            "description": "The former Director-General of the Security Service (MI5), Eliza Manningham-Buller gives the first of her BBC Reith Lectures 2011 called \" Terror.\" On the tenth anniversary of the attacks on the United States on September 11th she reflects on the lasting significance of that day. Was it a \"terrorist\" crime, an act of war or something different?",
            "length": "40768000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02r7smf.mp3"
        },
        {
            "title": "Aung San Suu Kyi: Dissent",
            "datePublished": "Tue, 05 Jul 2011 08:40:00 +0000",
            "description": "The pro-democracy leader, Aung San Suu Kyi, examines what drives people to dissent in the second of the 2011 Reith Lecture series. 'Securing Freedom'.\n\nReflecting on the history of her own party, the National League for Democracy, Aung San Suu Kyi, examines the meaning of opposition and dissident. She also explains her reasons for following the path of non-violence.",
            "length": "40640000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02r81hr.mp3"
        },
        {
            "title": "Aung San Suu Kyi: Liberty",
            "datePublished": "Tue, 28 Jun 2011 08:15:00 +0000",
            "description": "The Burmese pro-democracy leader, Aung San Suu Kyi, explores what freedom means in the first of the 2011 Reith Lecture series, 'Securing Freedom'. \n\nReflecting on her own experience under house arrest in Burma, she explores the universal human aspiration to be free and the spirit which drives people to dissent. She also comments on the Arab Spring, comparing the event that triggered last December's revolution in Tunisia with the death of a student during a protest in Burma in 1988.",
            "length": "51488000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02r815v.mp3"
        },
        {
            "title": "The Runaway World",
            "datePublished": "Tue, 22 Jun 2010 08:40:00 +0000",
            "description": "THE REITH LECTURES 2010\n4. The Runaway World \n\nIn the last Reith Lecture of 2010, Martin Rees, President of the Royal Society and Astronomer Royal, explores how fast our world is moving in the 21st century. Speaking at the Open University in Milton Keynes, the home of online learning, he acknowledges how the internet and other technologies have transformed our lives. Now he calls on politicians and other authorities to provide the funding that will keep the UK among the world's front runners in scientific research and discovery. Without money and without education to attract young people into science, the UK is in danger of falling behind China and other countries in the Far East that are investing heavily in their science and technology sectors. Professor Rees ends his series of lectures evoking memories of the 'glorious' Ely Cathedral, near Cambridge, a monument built to last a thousand years.  If we, like the cathedral builders, redirect our energies and focus on the long-term, he believes together we can solve the problems that face our planet, and secure its future for billions of people worldwide and for generations to come. \nProducer: Kirsten Lass\nEditor: Sue Ellis.",
            "length": "40224000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02r7xdg.mp3"
        },
        {
            "title": "What We'll Never Know",
            "datePublished": "Tue, 15 Jun 2010 08:45:00 +0000",
            "description": "3. What We'll Never Know\n\nIn the third of this year's Reith Lectures, recorded at the Royal Society during its 350th anniversary year, its President Martin Rees continues to explore the challenges facing science in the 21st century. He stresses there are things that will always lie beyond our sphere of comprehension and we should accept these limits to our knowledge. On the other hand, there are things we've never even dreamt of that will one day be ours to explore and understand. The outcome of the quest for alien life will revolutionise our sense of self in the next two decades. But some things -- like travelling back in time -- will never happen.",
            "length": "40080000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02r80zb.mp3"
        },
        {
            "title": "Surviving the Century",
            "datePublished": "Tue, 08 Jun 2010 08:40:00 +0000",
            "description": "Lecture 2: 'Surviving the Century'\n\nIn the second of this year's Reith Lectures, recorded for the first time in Wales in the National Museum Cardiff, Martin Rees, President of the Royal Society and Astronomer Royal, continues to explore the challenges facing science in the 21st century. Our planet is coming under increasing strain from climate change, population explosion and food shortages. How can we use science to help us solve the crisis that we are moving rapidly towards, as we use up our natural resources ever more quickly? \nProfessor Rees explores the urgent need to substantially reduce our global CO2 emissions, or the atmospheric concentration will reach truly threatening levels. To do this, we need international cooperation, and global funding for clean and green technologies. He calls for the UK to keep one step ahead of other countries by developing technologies to reduce emissions, and says we should take the lead in wave and tidal energy, among other solutions. Science brings innovation but also risk, and random elements including fanatics can abuse new technologies to threaten our planet in ways we never dreamt of. The challenge, for our scientists, governments and people, is to confront the threats to our planet and find the solutions in science.",
            "length": "40192000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02r7t8f.mp3"
        },
        {
            "title": "The Scientific Citizen",
            "datePublished": "Tue, 01 Jun 2010 08:15:00 +0000",
            "description": "Lecture 1: ''The Scientific Citizen'\n\nIn the first of this year's Reith Lectures, entitled Scientific Horizons, Martin Rees, President of the Royal Society, Master of Trinity College and Astronomer Royal, explores the challenges facing science in the 21st century. We are increasingly turning to government and the media to explain the risks we face. But in the wake of public confusion over issues like climate change, the swine 'flu vaccine and, more recently, Iceland's volcanic ash cloud, Martin Rees calls on scientists to come forward and play a greater role in helping us understand the science that affects us all.",
            "length": "41104000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02r83w9.mp3"
        },
        {
            "title": "A New Politics of the Common Good",
            "datePublished": "Tue, 30 Jun 2009 08:00:00 +0000",
            "description": "Professor Michael Sandel delivers four lectures about the prospects of a new politics of the common good. The series is presented and chaired by Sue Lawley. \n\nSandel makes the case for a moral and civic renewal in democratic politics. Recorded at George Washington University in Washington DC, he calls for a new politics of the common good and says that we need to think of ourselves as citizens, not just consumers.",
            "length": "41152000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02r7sny.mp3"
        },
        {
            "title": "Genetics and Morality",
            "datePublished": "Tue, 23 Jun 2009 08:00:00 +0000",
            "description": "Professor Michael Sandel delivers four lectures about the prospects of a new politics of the common good. The series is presented and chaired by Sue Lawley. \n\nRecorded at the Centre for Life in Newcastle, Sandel considers how we should use our ever-increasing scientific knowledge. New genetic technologies hold great promise for treating and curing disease, but how far we should go in using them to manipulate muscles, moods and gender?",
            "length": "41184000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02r84fn.mp3"
        },
        {
            "title": "Morality in Politics",
            "datePublished": "Tue, 16 Jun 2009 08:00:00 +0000",
            "description": "Professor Michael Sandel delivers four lectures about the prospects of a new politics of the common good. The series is presented and chaired by Sue Lawley. \n\nSandel considers the role of moral argument in politics. He believes that it is often not possible for government to be neutral on moral questions and calls for a more engaged civic debate about issues such as commercial surrogacy and same-sex marriage.",
            "length": "41072000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02r7scb.mp3"
        },
        {
            "title": "Markets and Morals",
            "datePublished": "Tue, 09 Jun 2009 08:00:00 +0000",
            "description": "Michael Sandel, Harvard Professor of Government, delivers four lectures about the prospects of a new politics of the common good. The series is presented and chaired by Sue Lawley. \n\nSandel considers the expansion of markets and how we determine their moral limits. Should immigrants, for example, pay for citizenship? Should we pay schoolchildren for good test results, or even to read a book? He calls for a more robust public debate about such questions, as part of a 'new citizenship'.",
            "length": "41168000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02r7t4r.mp3"
        },
        {
            "title": "The Body Beautiful",
            "datePublished": "Tue, 24 Jun 2008 08:00:00 +0000",
            "description": "Chinese Vistas: Jonathan Spence lectures about China.\n\nRecorded at Lord's cricket ground.\n\nSpence discusses how Chinese ideas of sport and athleticism have slowly evolved over the centuries, from languorous courtship and formalised martial arts to the demanding arenas of team sports and the ultimate Olympic challenges that China will controversially host in August.",
            "length": "50496000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02r80rl.mp3"
        },
        {
            "title": "American Dreams",
            "datePublished": "Tue, 17 Jun 2008 08:00:00 +0000",
            "description": "Chinese Vistas: Jonathan Spence lectures about China.\n\nRecorded at The Asia Society in New York.\n\nSpence explores the two centuries in which the United States gradually moved from its position as a dominant beacon of freedom and democracy for China, to becoming a more demanding global rival during and since World War II. Is America right to be wary of the emerging superpower or can the two economic and military giants co-exist happily?",
            "length": "41360000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02r827h.mp3"
        },
        {
            "title": "English Lessons",
            "datePublished": "Tue, 10 Jun 2008 08:00:00 +0000",
            "description": "Jonathan Spence lectures about China.\n\nSpence examines China's relations with the United Kingdom through three centuries of trade, warfare, unequal treaties and missionary endeavours that shaped their mutual perceptions.",
            "length": "41312000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02r84db.mp3"
        },
        {
            "title": "Confucian Ways",
            "datePublished": "Tue, 03 Jun 2008 08:00:00 +0000",
            "description": "Chinese Vistas: In a lecture recorded at the British Library in London, Jonathan Spence reflects on China's most enduring thinker, Confucius. Who was this man, what did he believe in, and what contemporary relevance does his message have, nearly 2,500 years after his death? The Confucian message has survived countless attacks and is being recycled by the Chinese Communist leadership today.",
            "length": "41392000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02r82pv.mp3"
        },
        {
            "title": "Global Politics in a Complex Age",
            "datePublished": "Wed, 09 May 2007 08:00:00 +0000",
            "description": "Jeffrey Sachs delivers the last of five lectures. He calls for a new Enlightenment to help make globalisation work for all and lays out a blueprint for global co-operation.",
            "length": "41456000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02r84fv.mp3"
        },
        {
            "title": "Economic Solidarity for a Crowded Planet",
            "datePublished": "Wed, 02 May 2007 08:00:00 +0000",
            "description": "Jeffrey Sachs delivers the fourth of five lectures. He considers the challenges of extreme poverty and the worry of the developed world which fears for its own prosperity.",
            "length": "41376000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02r80v0.mp3"
        },
        {
            "title": "The Great Convergence",
            "datePublished": "Wed, 25 Apr 2007 08:00:00 +0000",
            "description": "Jeffrey Sachs delivers the third of five lectures from the Earth Institute at Columbia University, New York. He talks about the need for international co-operation.",
            "length": "41376000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02r7t3m.mp3"
        },
        {
            "title": "Survival in the Anthropocene",
            "datePublished": "Wed, 18 Apr 2007 08:00:00 +0000",
            "description": "Jeffrey Sachs delivers the second lecture from the University in Beijing. He discusses China's emergence as an economic superpower and asks what this means for the challenges ahead.",
            "length": "41232000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02r7sdj.mp3"
        },
        {
            "title": "Bursting at the Seams",
            "datePublished": "Wed, 11 Apr 2007 08:00:00 +0000",
            "description": "Jeffrey Sachs delivers the first of five lectures, recorded at The Royal Society, London. Sachs outlines the challenges facing mankind and argues that we must adapt to the new age.",
            "length": "40304000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02r7x63.mp3"
        },
        {
            "title": "The Power of Music",
            "datePublished": "Fri, 05 May 2006 08:00:00 +0000",
            "description": "This year's lecturer is Daniel Barenboim, who has become known as one of the most versatile pianists of his generation. His skill as a conductor and a musician has led him to world recognition and the appointment as Chief Conductor for Life by the Staatskapelle Berlin. He has also won a Grammy for his recording of Wagner's Tannhäuser and received the Wilhelm Furtwängler Prize for his work with the Staatskapelle Berlin.\n\nIn his final lecture, delivered in Jerusalem's International YMCA, Daniel Barenboim discusses the power music has beyond words. Music is more than just a physical power it is also has an emotional strength. He explores the hold music has over us and the association that music can evoke. He distinguishes between the substance of music and our perceptions of it.",
            "length": "40464000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02r818c.mp3"
        },
        {
            "title": "Meeting in Music",
            "datePublished": "Fri, 28 Apr 2006 08:00:00 +0000",
            "description": "This year's lecturer is Daniel Barenboim, who has become known as one of the most versatile pianists of his generation. His skill as a conductor and a musician has led him to world recognition and the appointment as Chief Conductor for Life by the Staatskapelle Berlin. He has also won a Grammy for his recording of Wagner's Tannhäuser and received the Wilhelm Furtwängler Prize for his work with the Staatskapelle Berlin.\n\nIn his fourth Reith Lecture, delivered from Jerusalem, Daniel Barenboim talks about co-founding the West Eastern Divan Orchestra and how it represents his central belief that music has the power to bring people together. He explains how his chance meeting with the late Palestinian-born writer Edward Said attempted to changed the political and musical landscape of the Middle East by promoting music and co-operation through projects targeted at young Arabs and Israelis.",
            "length": "40304000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02r84ty.mp3"
        },
        {
            "title": "The Magic of Music",
            "datePublished": "Fri, 21 Apr 2006 08:00:00 +0000",
            "description": "This year's lecturer is Daniel Barenboim, who has become known as one of the most versatile pianists of his generation. His skill has led him to world recognition and the appointment as Chief Conductor for Life by the Staatskapelle Berlin. He has also won a Grammy for his recording of Wagner's Tannhäuser and received the Wilhelm Furtwängler Prize for his work with the Staatskapelle Berlin.\n\nSpeaking from Berlin, Daniel Barenboim argues in his third Reith Lecture that classical music is not an exclusive language. He explains that given the right attitude it can be understood by everyone and not just the musical elite. He also examines how political correctness and bad education have caused the inability to make value judgements about public standards in music appreciation.",
            "length": "40208000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02r7skq.mp3"
        },
        {
            "title": "The Neglected Sense",
            "datePublished": "Fri, 14 Apr 2006 08:00:00 +0000",
            "description": "This year's lecturer is Daniel Barenboim, who has become known as one of the most versatile pianists of his generation. His skill as a conductor and a musician has led him to world recognition and the appointment as Chief Conductor for Life by the Staatskapelle Berlin. He has also won a Grammy for his recording of Wagner's Tannhäuser and received the Wilhelm Furtwängler Prize for his work with the Staatskapelle Berlin.\n\nIn his second lecture, delivered from Chicago, Daniel Barenboim argues that we rarely listen to the music of our choosing and that too often we hear music which we have no control over. He argues that this unwelcome 'muzak' is largely responsible for encouraging people not just to neglect the ear but to repress it. ",
            "length": "40368000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02r842v.mp3"
        },
        {
            "title": "In the Beginning was Sound ",
            "datePublished": "Fri, 07 Apr 2006 08:00:00 +0000",
            "description": "This year's lecturer is Daniel Barenboim, who has become known as one of the most versatile pianists of his generation. His skill as a musician and a conductor has led him to world recognition and the appointment as Chief Conductor for Life by the Staatskapelle Berlin. He has also won a Grammy for his recording of Wagner's Tannhäuser and received the Wilhelm Furtwängler Prize for his work with the Staatskapelle Berlin.\n\nIn the first of his five Reith Lectures, Daniel Barenboim explores the physical phenomenon of sound. He contends that: In the beginning was sound. ",
            "length": "41216000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02r7tj4.mp3"
        },
        {
            "title": "Risk and Responsibility ",
            "datePublished": "Wed, 04 May 2005 08:00:00 +0000",
            "description": "This year's Reith Lecturer is the distinguished engineer, Lord Broers. Alec Broers is President of the Royal Academy of Engineering and Chairman of the House of Lords Science and Technology Committee. \n\nIn his fifth and final lecture, Lord Broers explores the responsibilities of the technologist and questions their role in society. Who regulates technology? Is it up to the individual technologist or for companies, or governments to decide? \n\nHe also examines the areas where we are likely to see the most significant advances in the next decades, and asks: who will be the winners in the race to develop future technologies? ",
            "length": "41216000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02r81gk.mp3"
        },
        {
            "title": "Nanotechnology and Nanoscience ",
            "datePublished": "Wed, 27 Apr 2005 08:00:00 +0000",
            "description": "This year's Reith Lecturer is the distinguished engineer, Lord Broers. He is President of the Royal Academy of Engineering and Chairman of the House of Lords Science and Technology Committee. He was a pioneer of nanotechnology and the first person to use the scanning electron microscope for the fabrication of micro-miniature structures.\n\nIn his fourth Reith Lecture, Lord Broers examines nanotechnology - the manipulation of matter at an atomic or molecular scale. He believes it has captured the public's imagination and given rise to the full range of emotions from admiration to fear. He explores the origins of nanotechnology with its roots in electronics and uses the relationship between it and nanoscience to illustrate the more general relationship between science and technology.",
            "length": "41072000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02r83ty.mp3"
        },
        {
            "title": "Innovation and Management",
            "datePublished": "Wed, 20 Apr 2005 08:00:00 +0000",
            "description": "This year's Reith Lecturer is the distinguished engineer, Lord Broers. He is President of the Royal Academy of Engineering and Chairman of the House of Lords Science and Technology Committee.\n\nIn his third Reith lecture Lord Broers argues that profound changes have taken place in the development of ideas and their translation in to the market place. This innovation revolution demands a new approach to research and product development. \n\nSome argue that technology threatens our way of life and must be controlled through regulation, however, Lord Broers believes that this is rarely necessary. He argues that it is better to allow the market - and the customers - to decide whether technologies succeed or not. ",
            "length": "41232000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02r84kc.mp3"
        },
        {
            "title": "Collaboration ",
            "datePublished": "Wed, 13 Apr 2005 08:00:00 +0000",
            "description": "This year's Reith Lecturer is the distinguished engineer, Lord Broers. He is President of the Royal Academy of Engineering and Chairman of the House of Lords Science and Technology Committee. \n\nIn the second of his Reith Lectures, Lord Broers explores the origins of modern technologies and argues that global collaboration is essential for success. He argues that advancement must take in to account, social, environmental, economic, and political factors on a world level. ",
            "length": "41024000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02r853g.mp3"
        },
        {
            "title": "Technology will Determine the Future of the Human Race",
            "datePublished": "Wed, 06 Apr 2005 08:00:00 +0000",
            "description": "This year's Reith Lecturer is the distinguished engineer, Lord Broers. Alec Broers is President of the Royal Academy of Engineering and Chairman of the House of Lords Science and Technology Committee. He was a pioneer of nanotechnology and the first person to use the scanning electron microscope for the fabrication of micro-miniature structures.\n\nLord Broers delivers the first of his five Reith Lectures in which he sets out his belief that technology can and should hold the key to the future. He argues that man's way of life has depended on technology since the beginning of civilization - the flint stone, the control of fire, the wheel, the printing press, but are we coping with the newest cascade of technological advances that are happening now? \n\nLord Broers examines the social implications of the advances and argues that it has become essential that we study their social consequences. He believes that if poverty and disease are to be alleviated and the environment sustained, then technology must be harnessed on a vast and all inclusive scale.",
            "length": "41232000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02r855w.mp3"
        },
        {
            "title": "I am Right; You are Dead ",
            "datePublished": "Wed, 05 May 2004 08:00:00 +0000",
            "description": "In his fifth and final Reith Lecture, the Nobel Laureate, playwright, poet and political activist Wole Soyinka examines the causes and impact of fanaticism.\n\nWhen Osama Bin Laden declares that the world is divided between believers and non-believers, it is easy to identify the menace of the fanatical mind but, in what other company can we place George Bush when we hear him declare that 'you are either with us or you are on the side of the terrorists'? We fail at our peril to recognize a twin strain of the same fanatic spore that threatens to consume the world in its messianic fires. What could be the role of the 'invisible' religions and world views in tempering the forces that seek to dichotomise the world?",
            "length": "41072000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02r8179.mp3"
        },
        {
            "title": "A Quest for Dignity ",
            "datePublished": "Wed, 28 Apr 2004 08:00:00 +0000",
            "description": "The Nobel Laureate, playwright, poet and political activist Wole Soyinka explores the notion of dignity within a climate of fear.\n\nEven in defeat, negotiating terms of surrender, a defeated nation pleads: 'Leave us something of our dignity'. Denied this little consideration, a doomed struggle is promptly resumed. \nWhat exactly is this 'dignity' that even nations enshrine in their constitutions and Bills of Human Rights? Is it a basic core of volition? Or is it a sense of freedom? Obviously human dignity involves both, and encompasses more. No matter the mask that is worn to hide the reality of fear, dignity remains incompatible with the entry of fear into the human psyche.",
            "length": "41312000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02r7snl.mp3"
        },
        {
            "title": "Rhetoric that Binds and Blinds ",
            "datePublished": "Wed, 21 Apr 2004 08:00:00 +0000",
            "description": "In his third Reith Lecture, the Nobel Laureate, playwright, poet and political activist Wole Soyinka examines the power of political and religious rhetoric.\n\nBetween God and Nation, and Sieg Heil, a complex set of social impulses and goals are reduced to mere sound. It is a potent tool that moves to vibrate a collective chord and displace reason. A willed hypnosis substitutes for individual will and the ecstasy of losing oneself in a sound-cloned crowd drives the most ordinary person to throw away all moral code and undertake hitherto unthinkable acts. Is the language of Political Correctness aiding and abetting its proliferation?",
            "length": "40992000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02r7svq.mp3"
        },
        {
            "title": "Power and Freedom ",
            "datePublished": "Wed, 14 Apr 2004 08:00:00 +0000",
            "description": "In his second Reith Lecture, the Nobel Laureate, playwright, poet and political activist Wole Soyinka examines how difficult it can be to tell friend from foe in a climate of fear. Organisations that are set up to overthrow dictatorships can themselves turn into tyrannical regimes. Liberation movements may be forced to seek help from dangerous quarters and these days it is not just countries that control and direct the lives of their citizens. \n\nWole Soyinka looks at the recent history of two countries - Algeria and Nigeria - both plagued by political turmoil. He considers what has become one of the most difficult tests for democracy - when the ballot box produces 'the wrong result' - when the people vote for a party that is fundamentally opposed to democracy? ",
            "length": "41264000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02r8167.mp3"
        },
        {
            "title": "The Changing Mask of Fear",
            "datePublished": "Wed, 07 Apr 2004 08:00:00 +0000",
            "description": "The Nigerian born writer, Wole Soyinka, is a playwright, poet and a political activist. His novel, The Man Died: The Prison Notes of Wole Soyinka, recounts his experience of his unlawful imprisonment and the effects of solitary confinement over a period of 22 months during the Nigerian Civil war. Subsequently he has been an outspoken critic of many military dictators and in 1986 was awarded the Nobel Prize for Literature.\n\nIn his first lecture, Wole Soyinka considers the changes since the Cold War, the nature of fear and its impact on individuals and society. He explores how fear is used for positive motives as well as negative and how it's changed over time. He outlines that there is a new era of fear that pre-dates the events of 11th September. Wole Soyinka explains why for him 1989 was the moment when the world first appeared to have stood still. ",
            "length": "41264000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02r81mh.mp3"
        },
        {
            "title": "Neuroscience - the New Philosophy",
            "datePublished": "Wed, 30 Apr 2003 08:00:00 +0000",
            "description": "This year's Reith Lecturer is Vilayanur S Ramachandran, Director of the Centre for Brain and Cognition. He has lectured widely on art and visual perception of the brain and is Editor-in-chief of the Encyclopaedia of Human Behaviour. Professor Ramachandran's work has concentrated on investigating phenomena such as phantom limbs, anosognosia and anorexia nervosa. \n\nIn his final Reith Lecture, Professor Ramachandran argues that neuroscience, perhaps more than any other discipline, is capable of transforming man's understanding of himself and his place in the cosmos.",
            "length": "41216000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02r7s9f.mp3"
        },
        {
            "title": "Purple Numbers and Sharp Cheese",
            "datePublished": "Wed, 23 Apr 2003 08:00:00 +0000",
            "description": "This year's Reith Lecturer is Vilayanur S Ramachandran, Director of the Centre for Brain and Cognition. He has lectured widely on art and visual perception of the brain and is Editor-in-chief of the Encyclopaedia of Human Behaviour. Professor Ramachandran's work has concentrated on investigating phenomena such as phantom limbs, anosognosia and anorexia nervosa. \n\nIn his fourth Reith Lecture, Professor Ramachandran demonstrates experimentally that the phenomenon of synesthesia is a genuine sensory effect. For example, some people literally 'see' red every time they see the number 5 or green when they see 2.",
            "length": "41344000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02r7t24.mp3"
        },
        {
            "title": "The Artful Brain",
            "datePublished": "Wed, 16 Apr 2003 08:00:00 +0000",
            "description": "This year's Reith Lecturer is Vilayanur S Ramachandran, Director of the Centre for Brain and Cognition. He has lectured widely on art and visual perception of the brain and is Editor-in-chief of the Encyclopaedia of Human Behaviour. Professor Ramachandran's work has concentrated on investigating phenomena such as phantom limbs, anosognosia and anorexia nervosa. \n\nIn his third lecture, which is the most speculative one in the series of five, Professor Ramachandran takes up one of the most ancient questions in philosophy, psychology and anthropology, namely, what is art? To do this he draws on neurological case studies and works from ethology (animal behaviour) to present a new framework for understanding how the brain creates and responds to art, and uses examples from Indian art and Cubism to illustrate these ideas.",
            "length": "41168000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02r853y.mp3"
        },
        {
            "title": "Synapses and the Self",
            "datePublished": "Wed, 09 Apr 2003 08:00:00 +0000",
            "description": "This year's Reith Lecturer is Vilayanur S Ramachandran, Director of the Centre for Brain and Cognition. He has lectured widely on art and visual perception of the brain and is Editor-in-chief of the Encyclopaedia of Human Behaviour. Professor Ramachandran's work has concentrated on investigating phenomena such as phantom limbs, anosognosia and anorexia nervosa. \n\nIn his second Reith Lecture Professor Ramachandran examines the process we call 'seeing'; how we become consciously aware of things around us. How does the activity of the 100 billion little wisps of protoplasm - the neurons in the brain - give rise to all the richness of our conscious experience, including the 'redness' of red, the painfulness of pain or the exquisite flavour of Marmite or Vindaloo?",
            "length": "41168000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02r7wwc.mp3"
        },
        {
            "title": "Phantoms in the Brain",
            "datePublished": "Wed, 02 Apr 2003 08:00:00 +0000",
            "description": "This year's Reith Lecturer is Vilayanur S Ramachandran, Director of the Centre for Brain and Cognition. He has lectured widely on art and visual perception of the brain and is Editor-in-chief of the Encyclopaedia of Human Behaviour. Professor Ramachandran's work has concentrated on investigating phenomena such as phantom limbs, anosognosia and anorexia nervosa. \n\nProfessor Ramachandran begins his Reith Lecture series on 'The Emerging Mind' by arguing that scientists need no longer be afraid to ask the big questions about what it means to be human. With empirical evidence, science can now answer ancient philosophical questions about meaning and existence. By studying neurological syndromes that have been largely ignored as curiosities or mere anomalies, we can sometimes acquire novel insights into the functions of the brain. Many of the functions of the brain, he says, are best understood from an evolutionary vantage point. ",
            "length": "41264000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02r83h0.mp3"
        },
        {
            "title": "Licence to Deceive",
            "datePublished": "Wed, 01 May 2002 08:00:00 +0000",
            "description": "This year's Reith Lecturer is Onora O'Neill. She became Principal of Newnham College, Cambridge, in l992 and has chaired the Nuffield Council on Bioethics and the Human Genetics Advisory Commission. She is currently chair of the Nuffield Foundation and she has been President of the Aristotelian Society, and a member of the Animal Procedures (Scientific) Committee. In 1999 she was made a life peer as Baroness O'Neill of Bengarve, and sits as a crossbencher. She has written widely on political philosophy and ethics, international justice, bioethics and the philosophy of Immanuel Kant.\n\nIn her final Reith Lecture Onora O'Neill asks, how do we decide who to trust when we search for inform about the wider world? Information technologies are ideal for spreading reliable information, but they dislocate us from our ordinary ways of judging one another's claims and deciding where to place our trust. We may reasonably worry not only about the written word, but also about broadcast speech, film and television. These technologies are designed for one-way communication with minimal interaction. Those who control and use them may or may not be trustworthy. How are we to check what they tell us?",
            "length": "41248000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02r80w1.mp3"
        },
        {
            "title": "Trust and Transparency",
            "datePublished": "Wed, 24 Apr 2002 08:00:00 +0000",
            "description": "This year's Reith Lecturer is Onora O'Neill. She became Principal of Newnham College, Cambridge, in l992 and has chaired the Nuffield Council on Bioethics and the Human Genetics Advisory Commission. She is currently chair of the Nuffield Foundation and she has been President of the Aristotelian Society, and a member of the Animal Procedures (Scientific) Committee. In 1999 she was made a life peer as Baroness O'Neill of Bengarve, and sits as a crossbencher. She has written widely on political philosophy and ethics, international justice, bioethics and the philosophy of Immanuel Kant.\n\nIn her fourth Reith Lecture Onora O'Neill discusses the issue of transparency. As well as improving trust, she argues, it can also add to the ways in which the public can be deceived. She asks, \"how can we tell which claims and counterclaims, reports and supposed facts are trustworthy when so much information swirls around us?\" She argues a crisis of trust cannot be overcome by a blind rush to place more trust. Transparency certainly destroys secrecy: but it may not limit the deception and deliberate misinformation that undermine relations of trust. If we want to restore trust we need to reduce deception and lies rather than secrecy.",
            "length": "41152000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02r81s6.mp3"
        },
        {
            "title": "Called to Account",
            "datePublished": "Wed, 17 Apr 2002 08:00:00 +0000",
            "description": "This year's Reith Lecturer is Onora O'Neill. She became Principal of Newnham College, Cambridge, in l992 and has chaired the Nuffield Council on Bioethics and the Human Genetics Advisory Commission. She is currently chair of the Nuffield Foundation and she has been President of the Aristotelian Society, and a member of the Animal Procedures (Scientific) Committee. In 1999 she was made a life peer as Baroness O'Neill of Bengarve, and sits as a crossbencher. She has written widely on political philosophy and ethics, international justice, bioethics and the philosophy of Immanuel Kant.\n\n\nIn her third Reith Lecture Onora O'Neill looks at the quest for greater accountability in government, institutions and professionals and explores whether the instruments for control, regulation, monitoring and enforcement have worked.",
            "length": "41200000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02r8209.mp3"
        },
        {
            "title": "Trust and Terror",
            "datePublished": "Wed, 10 Apr 2002 08:00:00 +0000",
            "description": "This year's Reith Lecturer is Onora O'Neill. She became Principal of Newnham College, Cambridge, in l992 and has chaired the Nuffield Council on Bioethics and the Human Genetics Advisory Commission. She is currently chair of the Nuffield Foundation and she has been President of the Aristotelian Society, and a member of the Animal Procedures (Scientific) Committee. In 1999 she was made a life peer as Baroness O'Neill of Bengarve, and sits as a crossbencher. She has written widely on political philosophy and ethics, international justice, bioethics and the philosophy of Immanuel Kant.\n\nOnora O'Neill examines the search for justice in conditions where the basis for trust, is threatened by violence and intimidation. Trust often is reciprocal and when it is, we have virtuous spirals. However, trust can also open the door to betrayal, and betrayal leads to mistrust which in turn creates vicious spirals. In the most extreme situations where danger and terror undermine trust, it starts spiralling downwards and we might lose it all together.",
            "length": "41152000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02r83jd.mp3"
        },
        {
            "title": "Spreading Suspicion",
            "datePublished": "Wed, 03 Apr 2002 08:00:00 +0000",
            "description": "This year's Reith Lecturer is Onora O'Neill. She became Principal of Newnham College, Cambridge, in l992 and has chaired the Nuffield Council on Bioethics and the Human Genetics Advisory Commission. She is currently chair of the Nuffield Foundation and she has been President of the Aristotelian Society, and a member of the Animal Procedures (Scientific) Committee. In 1999 she was made a life peer as Baroness O'Neill of Bengarve, and sits as a crossbencher. She has written widely on political philosophy and ethics, international justice, bioethics and the philosophy of Immanuel Kant.\n\nIn the first of her Reith Lectures, philosopher Onora O'Neill examines the nature of trust, its role in society, and asks if there is real evidence of a crisis of trust.\nConfucius told his disciple Tsze-kung that three things are needed for government: weapons, food and trust. If a ruler can't hold on to all three, he should give up the weapons first and the food next and trust should be guarded to the end. Confucius' philosophy, Baroness O'Neill argues, is still convincing and she argues why.",
            "length": "41168000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02r7x21.mp3"
        },
        {
            "title": "New Directions",
            "datePublished": "Wed, 02 May 2001 08:00:00 +0000",
            "description": "Tom Kirkwood, Professor of Medicine and head of the Department of Gerontology at the University of Newcastle presents his final of five Reith Lectures investigating new insights from the frontiers of science and the choices and decisions we face in the uncharted territories of a greying world.\n\nIn this lecture, Professor Kirkwood challenges science and society to look afresh at what is happening in our world, to recognise the opportunities, as well as the threats to future stability, that stem from the revolution in longevity. We know where we've come from and why, he argues, but we don't have a clear plan of where to go now. The longevity revolution has reached a turning-point and the decisions we take in the next few years will have far-reaching consequences for the state of future society",
            "length": "40928000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02r817l.mp3"
        },
        {
            "title": "Making Choices",
            "datePublished": "Wed, 25 Apr 2001 08:00:00 +0000",
            "description": "Tom Kirkwood, Professor of Medicine and head of the Department of Gerontology at the University of Newcastle presents the fourth of five Reith Lectures investigating new insights from the frontiers of science and the choices and decisions we face in the uncharted territories of a greying world. \n\nIn this lecture, recorded at Berryhill retirement village, near Stoke-on-Trent, Professor Kirkwood discusses making choices in ageing. He argues that the freedom to make, and continue making choices is perhaps the greatest single index of well-being. Choice matters in ageing for two very powerful reasons. First, although many fruits of the scientific revolution lie in the future, scientific understanding of the ageing process tells us already that there is a great deal we can do now by making the right choices. Second, as we get older, choice often seems to be taken away, however the revolution in longevity puts choice high up the list of priorities. Professor Kirkwood argues that we need to recognise that when we make choices about initiatives to meet the challenge of an older population, it is not 'them and us' we are dealing with, but 'us and us', and that we should be more robust in confronting the reality of our longer lives. ",
            "length": "41184000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02r81zk.mp3"
        },
        {
            "title": "Sex and Death",
            "datePublished": "Wed, 18 Apr 2001 08:00:00 +0000",
            "description": "Tom Kirkwood, Professor of Medicine and head of the Department of Gerontology at the University of Newcastle presents the third of five Reith Lectures investigating new insights from the frontiers of science and the choices and decisions we face in the uncharted territories of a greying world.\n\nIn this lecture Professor Kirkwood tackles the subject of sex. Does sex shorten our lives? Can it be, as some have suggested, that ageing and death are the price we pay for sex? Does it make sense to think in terms of a 'reproductive duty' to the species, leaving us surplus to requirement when duty is done? And what, if these worrying notions are true, are we to make of the post-menopausal woman? These are the questions he examines; revealing that the answers are not only reassuring, (on the whole), but also, that they tell us a great deal about the biological background to our revolution in longevity.",
            "length": "42096000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02r819v.mp3"
        },
        {
            "title": "Thread of Life",
            "datePublished": "Wed, 11 Apr 2001 08:00:00 +0000",
            "description": "Tom Kirkwood, Professor of Medicine and head of the Department of Gerontology at the University of Newcastle presents his second of five Reith Lectures investigating new insights from the frontiers of science and the choices and decisions we face in the uncharted territories of a greying world.\n\nIn this lecture he looks at a revolution in the life sciences; a revolution that has unfolded with breathtaking speed over the last half century and which has accelerated greatly of late. It is this revolution, he argues, that will allow us to understand the role of DNA in the ageing process.\n\nWe sometimes say, in extremis, that a person's life hangs by a thread. In fact, all our lives hang by a thread all the time. The thread in question is DNA, the medium through which we inherit our genetic destiny. DNA directs our growth and all of the vital processes on which we depend for survival. DNA is the thread of life, but is it also the thread of death? Does DNA control our end as it controls our beginning?",
            "length": "41200000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02r84xp.mp3"
        },
        {
            "title": "Brave Old World",
            "datePublished": "Wed, 04 Apr 2001 08:00:00 +0000",
            "description": "Tom Kirkwood, Professor of Medicine and head of the Department of Gerontology at the University of Newcastle presents the first of five Reith Lectures investigating new insights from the frontiers of science and the choices and decisions we face in the uncharted territories of a greying world. \n\nIn his first lecture, recorded at the Royal Institution, Professor Kirkwood explores the revolution in human longevity. Science, he says, has new things to tell us about the process of ageing. We know now that ageing is neither inevitable nor necessary. We now understand that our cells are not programmed with some unavoidable sell-by date; we are not programmed to die.",
            "length": "40976000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02r7wsf.mp3"
        },
        {
            "title": "Poverty & Globalisation",
            "datePublished": "Wed, 10 May 2000 08:00:00 +0000",
            "description": "To mark the new millennium, this year's Reith Lectures are delivered by five different thinkers, each eminent in a different field. At the end of the run, the Prince of Wales presents his own views on the topic in a roundtable discussion with all five lecturers. \n\nThe Millennium Reith Lectures deal with one of the most pressing issues of our time - sustainable development. The fifth lecture, delivered from Delhi, is by the Founder Director of the New Delhi Research Foundation for Science, Technology and Ecology, Dr Vandana Shiva.\n\nDr Vandana Shiva, who is the founder of Navdanya, a national movement promoting diversity and use of native seeds, examines Poverty and Globalisation, and talks about the recognition and legitimisation of authority in society. She believes that we are wrong to be smug about the new global economy and that thinking about the impact of globalisation on the lives of ordinary people is vital to achieving sustainability. world systems should move away from ones based on fear and scarcity, monocultures and monopolies, and appropriation and dispossession.",
            "length": "41248000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02r81jg.mp3"
        },
        {
            "title": "Health & Population",
            "datePublished": "Wed, 03 May 2000 08:00:00 +0000",
            "description": "To mark the new millennium, this year's Reith Lectures are delivered by five different thinkers, each eminent in a different field. At the end of the run, the Prince of Wales presents his own views on the topic in a roundtable discussion with all five lecturers. \n\nThe Millennium Reith Lectures deal with one of the most pressing issues of our time - sustainable development. The fourth lecture, delivered from Geneva, is by the Director General of the World Health Organisation, Dr Gro Harlem Brundtland.\n\nDr Gro Harlem Brundtland is a qualified medical doctor specialising in child and public health. She is also former Minister of the Environment and Prime Minister of Norway. In her lecture on Health and Population, Dr Gro Harlem Brundtland raises issues about accepting and carrying out sustainable behaviour. She believes that issues of women, poverty, education and population are intrinsically linked, and that health should be seen as part of our investment in developing countries, rather than a dividend to be reaped later.",
            "length": "41392000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02r81ts.mp3"
        },
        {
            "title": "Business",
            "datePublished": "Wed, 26 Apr 2000 08:00:00 +0000",
            "description": "To mark the new millennium, this year's Reith Lectures are delivered by five different thinkers, each eminent in a different field. At the end of the run, the Prince of Wales presents his own views on the topic in a roundtable discussion with all five lecturers. \n\nThe Millennium Reith Lectures deal with one of the most pressing issues of our time - sustainable development. The third lecture is by Sir John Browne. \n\nSir John Browne is Chief Executive Officer of BP Amoco, Britain's largest company and the third largest oil corporation in the world. He is also a trustee of the British Museum and chairman of Stanford Business School's Advisory Council. \n\nSpeaking from Edinburgh, Sir John Browne's lecture examines business. He raises issues of stewardship and responsible management, and demonstrates how governments, industry, economy and individuals interact and interconnect in a dynamic fashion. He believes that business plays a fundamental role in delivering sustainable development through the principle of enlightened self-interest, and argues that technology is the key to tackling the growing threat of climate change without undermining economic growth.",
            "length": "54832000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02r838m.mp3"
        },
        {
            "title": "Biodiversity",
            "datePublished": "Wed, 19 Apr 2000 08:00:00 +0000",
            "description": "To mark the new millennium, this year's Reith Lectures are delivered by five different thinkers, each eminent in a different field. At the end of the run, the Prince of Wales presents his own views on the topic in a roundtable discussion with all five lecturers.\n\nThe Millennium Reith Lectures deal with one of the most pressing issues of our time - sustainable development. The second lecture, delivered from Los Angeles is by Tom Lovejoy. \n\nTom Lovejoy is Chief Biodiversity Advisor for the World Bank and Counsellor at the Smithsonian Institution, Washington. He is a former member of the White House Science Council and UN Environment Programme, and is a specialist in environmental biology of the tropics and Latin American region.\n\nIn his lecture about biodiversity, Tom Lovejoy raises issues about our treatment of creation and our status within it. He believes that biodiversity is the best single indicator of an area's long term biological and economic health.",
            "length": "41280000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02r81kv.mp3"
        },
        {
            "title": "Governance",
            "datePublished": "Wed, 12 Apr 2000 08:00:00 +0000",
            "description": "To mark the new millennium, this year's Reith Lectures are delivered by five different thinkers, each eminent in a different field. At the end of the run, the Prince of Wales presents his own views on the topic in a roundtable discussion with all five lecturers.\n\nThe Millennium Reith Lectures deal with one of the most pressing issues of our time - sustainable development. The first lecture, delivered from London is by Chris Patten. \n\nChris Patten is a European Commissioner and was the last Governor of Hong Kong. He was also a UK Minister for Overseas Development and Secretary of State for the Environment \n\nIn his lecture, Chris Patten discusses the source of authority, the role of law and the need for accountability.  He argues that sustainable development is about much more than environment policy defined in terms of departments, ministers and white papers. It requires a mosaic of institutions, policies and values.",
            "length": "41376000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02r83bz.mp3"
        },
        {
            "title": "Democracy: London",
            "datePublished": "Wed, 05 May 1999 08:00:00 +0000",
            "description": "Professor Giddens was director of the London School of Economics and he has been described as 'Britain's best-known social scientist since Keynes'. \n\nIn his fifth and final lecture, delivered from London, Professor Giddens examines one of the most powerful energising ideas of the 20th Century; democracy.  He argues that rather than thinking of democracy as a fragile flower, easily trampled underfoot, we should see it more as a sturdy plant, able to grow even on quite barren ground. The expansion of democracy is bound up with structural changes in world society, but Professor Giddens believes the furthering of democracy at all levels is worth fighting for and can be achieved. Our runaway world, he says doesn't need less, but more government which only democratic institutions can provide.",
            "length": "55424000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02r81kn.mp3"
        },
        {
            "title": "Family: Washington DC",
            "datePublished": "Wed, 28 Apr 1999 08:00:00 +0000",
            "description": "Professor Giddens was director of the London School of Economics and he has been described as 'Britain's best-known social scientist since Keynes'. \n\nThe lectures are delivered from five major cities around the world, locating the lectures themselves within the cultural variety of the world across which they were broadcast.\n\nIn his fourth lecture, delivered from Washington DC, Professor Giddens examines the roles within the family and argues that the persistence of aspects of the traditional family, in many parts of the world is more worrisome than its decline. Professor Giddens believes that the most important forces promoting democracy and economic development in poorer countries are the equality and education of women and it is the traditional family that must be changed to make these possible. Sexual equality is not just a core principle of democracy, he argues, it is also relevant to happiness and fulfilment.",
            "length": "55504000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02r7t0m.mp3"
        },
        {
            "title": "Tradition:Delhi",
            "datePublished": "Wed, 21 Apr 1999 08:00:00 +0000",
            "description": "Professor Giddens was director of the London School of Economics and he has been described as 'Britain's best-known social scientist since Keynes'. \n\nThe lectures are delivered from five major cities around the world, locating the lectures themselves within the cultural variety of the world across which they were broadcast.\n\nIn his third lecture, delivered from Delhi, Professor Giddens looks at the links between tradition and fundamentalism and argues that all traditions are invented traditions. Much of what we think of as traditional, and steeped in the mists of time, is actually a product, at most, of the last couple of centuries, and is often much more recent than that. It is a myth to think of traditions as impervious to change. Traditions, he says, evolve over time, but also can be quite suddenly altered or transformed. ",
            "length": "55696000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02r7wx6.mp3"
        },
        {
            "title": "Globalisation:London",
            "datePublished": "Wed, 07 Apr 1999 08:00:00 +0000",
            "description": "The 1999 Reith Lecturer is Professor Anthony Giddens. Professor Giddens was Director of the London School of Economics and his writings have been used by world leaders, including Tony Blair and Bill Clinton, to develop ideas on what become known as 'The Third Way' in politics. He was Professor of Sociology at the University of Cambridge from 1986-96 and took up the post as Director of the London School of Economics in 1997. He has been described as 'Britain's best-known social scientist since Keynes'. \n\nThe lectures are delivered from five major cities around the world, locating the lectures themselves within the cultural variety of the world across which they were broadcast.\n\nIn his first lecture, delivered from London, Professor Giddens examines the concept of globalisation and how it has affected our lives. ",
            "length": "41392000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02r7y1j.mp3"
        },
        {
            "title": "Can there be an end to war?",
            "datePublished": "Wed, 06 May 1998 08:00:00 +0000",
            "description": "This year's Reith lecturer is British military historian and journalist John Keegan. \n\nIn his fifth and final Reith lecture, recorded at the Broadcasting House, London, John Keegan considers the future of war. He argues that it will not be law that will keep the world's peace. Rather it will be because the United Nations retains the will to confront unlawful force with lawful force together with the capacity to resolve the conflicts in which wars originate. He believes that we must not shrink from seeing the causes of war addressed, but equally we must not shrink from seeing violence used when the threat of violence has failed.",
            "length": "41232000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02r7v4c.mp3"
        },
        {
            "title": "War And The Individual",
            "datePublished": "Wed, 29 Apr 1998 08:00:00 +0000",
            "description": "This year's Reith lecturer is British military historian and journalist John Keegan. \n\nIn his fourth Reith lecture, recorded at the Bute Hall, University of Glasgow, John Keegan considers the impact of battle on those who fight them and how it's altered the nature of war throughout history. He also examines how modern warfare has changed the role and experiences of the soldier.",
            "length": "41136000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02r7t2l.mp3"
        },
        {
            "title": "War and the State",
            "datePublished": "Wed, 22 Apr 1998 08:00:00 +0000",
            "description": "This year's Reith lecturer is British military historian and journalist John Keegan. \n\nIn his third Reith lecture, recorded at King's College London, John Keegan explores the evolving relationship between war and the nation state, the changing nature of sovereignty, and examines whether states need to cause conflict.",
            "length": "41152000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02r7scl.mp3"
        },
        {
            "title": "The Origins Of War",
            "datePublished": "Wed, 15 Apr 1998 08:00:00 +0000",
            "description": "This year's Reith lecturer is British military historian and journalist John Keegan\n\nIn his second lecture, recorded at the Royal Military Academy Sandhurst, John Keegan looks at the origins of warfare, when combat first became purposeful, and examines whether evidence of violence and the need for war is embedded in human nature, or if it is only present in the external factors which act upon human nature. He argues that the evolution of conflict is inextricably linked to the evolution of social groupings.",
            "length": "41824000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02r852q.mp3"
        },
        {
            "title": "War And Our World",
            "datePublished": "Wed, 08 Apr 1998 08:00:00 +0000",
            "description": "The Reith lecturer for the 50th anniversary series, is British military historian and journalist John Keegan. He has been a senior lecturer in Military History at the Royal Military Academy Sandhurst and also held a visiting professorship at Princeton University. Leaving the academy in 1986 John Keegan joined the Daily Telegraph as a Defence Correspondent and remains with the publication as Defence Editor, also writing for the American conservative website, National Review Online. His published work examines warfare throughout history, including human prehistory and the classical era; with the majority of his writing focussing on the 14th century onwards to modern conflict.\n\nIn his first Reith Lecture, recorded at the Royal Institution of Great Britain in London, John Keegan explores the great impact warfare has had on modern times. War has been the scourge of this century, but John Keegan argues that until very recently war was not among life's great enemies. War previously had occasionally had epidemic effects, but it always stood lower in peoples' fears than the arrival of famine and disease. The fear of war as a widespread killer, he says, only began in the 19th century, and only in the 20th century did the fear of war overtake the more primordial anxieties associated with sickness and deprivation.",
            "length": "41984000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02r7tmy.mp3"
        },
        {
            "title": "An Ordinary Brilliance: Parting the Waters, closing the wounds",
            "datePublished": "Tue, 25 Mar 1997 09:00:00 +0000",
            "description": "This year's Reith lecturer is Professor Patricia Williams, one of the most provocative intellectuals in American law.  \n\nIn her fifth and final Reith lecture, Professor Patricia Williams explores ways of preventing racism. She attempts to point the way forward by drawing out solutions which include developing the ability to resist racism's inevitability and reconciling racial tensions across the divide.",
            "length": "28512000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02r7t8q.mp3"
        },
        {
            "title": "The War Between The Worlds",
            "datePublished": "Tue, 18 Mar 1997 09:00:00 +0000",
            "description": "This year's Reith lecturer is Professor Patricia Williams, one of the most well known intellectuals in American law.  \n\nIn her fourth of five Reith lectures Professor Patricia Williams examines the impact of racialised science on attitudes to race. She argues that scientific statements about black people in terms of genetic attributes of, for example, athleticism or intelligence, nurture racial stereotyping; and she explains why it is so difficult to argue against what are supposedly scientific facts.",
            "length": "28592000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02r84bm.mp3"
        },
        {
            "title": "The Distribution Of Distress",
            "datePublished": "Tue, 11 Mar 1997 09:00:00 +0000",
            "description": "This year's Reith lecturer is Professor Patricia Williams, one of the most well known intellectuals in American law.  \n\nIn her third Reith lecture, Professor Patricia Williams looks at the juxtaposition of race and class and their interaction in society and argues that there is a tendency of the dominant society to conflate race and class, especially when constructing black stereotypes. Discussions of race and class often combine the two categories, leaving both these aspects of a problem inadequately addressed.",
            "length": "28720000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02r7xy7.mp3"
        },
        {
            "title": "The Pantomime of Race",
            "datePublished": "Tue, 04 Mar 1997 09:00:00 +0000",
            "description": "This year's Reith lecturer is Professor Patricia Williams, one of the most well known intellectuals in American law.  \n\nIn her second Reith lecture, Professor Patricia Williams explores how race related problems in society seem to be rendered invisible by 'colour blindness'. Using examples from American legal cases she analyses society's systemic denial of racial experiences. Discussing her expression 'racial voyeurism', she argues that all of these problems stem from racial and cultural domination. ",
            "length": "28784000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02r82h8.mp3"
        },
        {
            "title": "The Emperor's New Clothes",
            "datePublished": "Tue, 25 Feb 1997 09:00:00 +0000",
            "description": "This year's Reith lecturer is Professor Patricia Williams, one of the most well known intellectuals in American law.  She served as a deputy city attorney from 1976-1978 in the Los Angeles City Attorney's Office and as Staff Attorney for the Western Center on Law and Poverty in Los Angeles. She has been affiliated with Columbia University Law School since 1991, and has also taught at the University of Wisconsin at Madison and at the City University of New York in Queens. Professor Williams has published widely in the areas of race, gender, and law, and on other issues of legal theory and legal writing. Her highly regarded first book, \"The Alchemy of Race and Rights: A Diary of a Law Professor\" is an autobiographical work that illuminates some of America's most complex problems. \n\nIn her first lecture, Professor Patricia Williams examines how the issue of colour remains so powerfully determinative of everything from life circumstance to manner of death, in a world that is, by and large, officially 'colour blind'. She considers the tensions between ideological and social measures to eliminate racism and the material conditions experienced by individuals, and argues that the very notion of blindness about colour constitutes an ideological confusion at best and denial at worst. ",
            "length": "28864000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02r81rr.mp3"
        },
        {
            "title": "The World Wide Web",
            "datePublished": "Tue, 05 Mar 1996 09:00:00 +0000",
            "description": "This year's Reith Lecturer is Jean Aitchison, a Professor of Language and Communication in the Faculty of English Language and Literature at the University of Oxford and a Fellow of Worcester College, Oxford.\n\nIn her fifth and final lecture, Professor Jean Aitchison looks at the possibilities and the pitfalls of the way we use language, and how it can shape as well as distort our view of the world. She examines how the huge choice of words and sentences available to us also sets up possible snares and how humans may be subconsciously trapped by their language.",
            "length": "27216000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02r81fx.mp3"
        },
        {
            "title": "A Web Of Words",
            "datePublished": "Tue, 27 Feb 1996 09:00:00 +0000",
            "description": "This year's Reith Lecturer is Jean Aitchison, a Professor of Language and Communication in the Faculty of English Language and Literature at the University of Oxford and a Fellow of Worcester College, Oxford.\n\nIn her fourth lecture, Professor Jean Aitchison examines words themselves. An educated native speaker of English knows at least 50,000 words and word-learning ability is inbuilt in humans. Professor Aitchison explains how we manage to recall these words at speed when we need them, and how meaning and sound are interwoven.",
            "length": "28032000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02r816v.mp3"
        },
        {
            "title": "Building the Web",
            "datePublished": "Tue, 20 Feb 1996 09:00:00 +0000",
            "description": "This year's Reith Lecturer is Jean Aitchison, a Professor of Language and Communication in the Faculty of English Language and Literature at the University of Oxford and a Fellow of Worcester College, Oxford.\n\nIn her third lecture, Professor Aitchison examines the predictable way in which the language web develops. Language has a biologically organised schedule with children everywhere following a similar pattern. Children learn to talk so readily because they instinctively know in advance what languages are like; the outline is pre-programmed and the network is built up in a pre-ordained sequence. Professor Aitchinson looks at how adults can help and sometimes slow down a child's progress. ",
            "length": "28432000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02r7sbs.mp3"
        },
        {
            "title": "A Web Of Deceit",
            "datePublished": "Tue, 13 Feb 1996 09:00:00 +0000",
            "description": "This year's Reith Lecturer is Jean Aitchison, a Professor of Language and Communication in the Faculty of English Language and Literature at the University of Oxford and a Fellow of Worcester College, Oxford.\n\nIn her second lecture, Professor Aitchison examines the origin of language in the human species, and explores how a fresh look at the role of language has led to new ideas about how it started. By looking at behaviour which we share with our ape relatives, the original role of language can be uncovered. How did the use of sounds arise? And more importantly, how did particular sounds come to be used as symbols, with firm meanings?",
            "length": "26624000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02r81f6.mp3"
        },
        {
            "title": "A Web Of Worries",
            "datePublished": "Tue, 06 Feb 1996 09:00:00 +0000",
            "description": "This year's Reith Lecturer is Jean Aitchison, a Professor of Language and Communication in the Faculty of English Language and Literature at the University of Oxford and a Fellow of Worcester College, Oxford.\n\nIn her first lecture, Professor Aitchison asks: Is our language sick? She explores what troubles us most about the way in which our language is changing, who is responsible, and what rules are being discarded. She considers why many of these rules were artificially constructed in the first place and argues that we need to understand language, not try to control it. Informal speech is not intrinsically worse than formal speech, she says, but different, and that the ever-shifting nature of language, is what keeps it flexible. ",
            "length": "28336000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02r849l.mp3"
        },
        {
            "title": "Cities For A Small Planet",
            "datePublished": "Sun, 12 Mar 1995 09:00:00 +0000",
            "description": "This year's Reith lecturer is Richard Rogers, one of the most influential British architects of our time.  He has established himself and his practice at the forefront of today's architecture industry through such high-profile projects as the Pompidou Centre, the headquarters for Lloyds of London, the European Court of Human Rights in Strasbourg and the Millennium Dome in London.  His series of lectures is entitled 'Sustainable City' and each lecture focuses on architecture's social role and the sustainable urban development of towns and cities through social and environmental responsibility. \n\nIn his fifth and final Reith lecture, Richard Rogers compares some of the world's most sustainable cities with those of Britain and argues that we have still not grasped the economic importance of a thriving urban culture. He considers what practical steps governments, citizens, architects and planners could take in order to achieve change, and argues that equitable cities that are beautiful, safe and exciting are quite within our grasp.",
            "length": "28608000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02r7txl.mp3"
        },
        {
            "title": "London, the Humanist City",
            "datePublished": "Sun, 05 Mar 1995 09:00:00 +0000",
            "description": "This year's Reith lecturer is Richard Rogers, one of the most influential British architects of our time.  He has established himself and his practice at the forefront of today's architecture industry through such high-profile projects as the Pompidou Centre, the headquarters for Lloyds of London, the European Court of Human Rights in Strasbourg and the Millennium Dome in London.  His series of lectures is entitled 'Sustainable City' and each lecture focuses on architecture's social role and the sustainable urban development of towns and cities through social and environmental responsibility. \nIn his fourth Reith lecture, Richard Rogers turns his attention to London and examines some of the economic, social and ecological problems it currently faces. He argues that London offers every opportunity to create a cultured, balanced, and sustainable city but it urgently needs to adopt a new and sustainable approach that encourages its public life, discourages urban sprawl, and protects the environment for the future rather than being abandoned to the mercy of market forces. This, he believes, can only be realised by an overall authority for the capital. ",
            "length": "28640000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02r811s.mp3"
        },
        {
            "title": "Sustainable Architecture",
            "datePublished": "Sun, 26 Feb 1995 09:00:00 +0000",
            "description": "This year's Reith lecturer is Richard Rogers, one of the most influential British architects of our time.  He has established himself and his practice at the forefront of today's architecture industry through such high-profile projects as the Pompidou Centre, the headquarters for Lloyds of London, the European Court of Human Rights in Strasbourg and the Millennium Dome in London.  His series of lectures is entitled 'Sustainable City' and each lecture focuses on architecture's social role and the sustainable urban development of towns and cities through social and environmental responsibility. \n\nIn his third Reith lecture, Richard Rogers examines the ways in which buildings can enhance the public sphere and argues that our sometimes over-zealous preservation of buildings allows our architectural heritage to choke our future. Only by tailoring buildings to the changing needs of people and the environment, he says, can we sustain the public life of our cities.",
            "length": "28272000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02r7slg.mp3"
        },
        {
            "title": "Sustainable Cities",
            "datePublished": "Sun, 19 Feb 1995 09:00:00 +0000",
            "description": "This year's Reith lecturer is Richard Rogers, one of the most influential British architects of our time.  He has established himself and his practice at the forefront of today's architecture industry through such high-profile projects as the Pompidou Centre, the headquarters for Lloyds of London, the European Court of Human Rights in Strasbourg and the Millennium Dome in London.  His series of lectures is entitled 'Sustainable City' and each lecture focuses on architecture's social role and the sustainable urban development of towns and cities through social and environmental responsibility. \n\nIn his second lecture, Richard Rogers explores how cities have become, in his view, socially divisive and environmentally hazardous. In the beginning we built cities to overcome our environment; in the future we should build cities to nurture it. We must, he argues, reinvent a dense and diverse urban space that grows around social as well as commercial activity.  Strategies to improve the sustainability of our environment can fundamentally improve the social life of our cities. ",
            "length": "28560000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02r7syv.mp3"
        },
        {
            "title": "The Culture of Cities",
            "datePublished": "Sun, 12 Feb 1995 09:00:00 +0000",
            "description": "This year's Reith lecturer is Richard Rogers, one of the most influential British architects of our time.  He has established himself and his practice at the forefront of today's architecture industry through such high-profile projects as the Pompidou Centre, the headquarters for Lloyds of London, the European Court of Human Rights in Strasbourg and the Millennium Dome in London.  His series of lectures is entitled 'Sustainable City' and each lecture focuses on architecture's social role and the sustainable urban development of towns and cities through social and environmental responsibility. \n\nIn his first lecture, Richard Rogers explores the fundamental dichotomy of the city; that it has the potential to both civilise and brutalise. He argues that the decaying fabric of urban life must be transformed into a sustainable, civilising environment, through the greater emphasis on citizens' participation in city design and planning, if we are to avert catastrophe. By putting communal objectives centre-stage, he says, we can transform the fabric and environment of our cities through greater, genuine, public participation and committed government initiative.",
            "length": "26800000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02r7p4l.mp3"
        },
        {
            "title": "Home: our Famous Island Race",
            "datePublished": "Wed, 02 Mar 1994 09:00:00 +0000",
            "description": "This year's Reith lecturer is the Booker prize-nominated author Marina Warner. A writer of fiction, criticism and history, her works include novels and short stories as well as studies of art, myths, symbols, and fairytales. Her series of Reith Lectures entitled 'Managing Monsters' explore how myths express and shape our attitudes. \n\nIn her final Reith Lecture, Marina Warner looks at the relationship between myths of national identity and the home, and argues that at the heart of nationalism lies the interdependency of home, identity, heritage and women, and that this mythology of the hearth continues to flourish in the present nationalist revival.",
            "length": "27728000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02r7nn5.mp3"
        },
        {
            "title": "Cannibal Tales: The Hunger for Conquest",
            "datePublished": "Wed, 23 Feb 1994 09:00:00 +0000",
            "description": "This year's Reith lecturer is the Booker prize-nominated author Marina Warner. A writer of fiction, criticism and history, her works include novels and short stories as well as studies of art, myths, symbols, and fairytales. Her series of Reith Lectures entitled 'Managing Monsters' explore how myths express and shape our attitudes. \n\nIn her penultimate lecture, Marina Warner explores myths of cannibalism from The Tempest to Hannibal Lecter. She argues that it is really only in the last decade that historical study has established how deeply fantasy has shaped the story and the chronicles of conquest. She explores how the imagery of forbidden ingestion masked other powerful longings and fears such as that of mingling and hybridity, fears about a future loss of identity and about the changes that history itself brings, and how their message of 'either we eat them or they eat us' helped to justify the presence of the invader, the settler and the trader bringing civilisation.",
            "length": "27104000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02r82tg.mp3"
        },
        {
            "title": "Beautiful Beasts: The Call of the Wild",
            "datePublished": "Wed, 16 Feb 1994 09:00:00 +0000",
            "description": "This year's Reith lecturer is the Booker prize-nominated author Marina Warner. A writer of fiction, criticism and history, her works include novels and short stories as well as studies of art, myths, symbols, and fairytales. Her series of Reith Lectures entitled 'Managing Monsters' explore how myths express and shape our attitudes. \n\nThe desire for closeness to animal power may still stimulate the breeding of fighting dogs, but it also drives the rise in the variety of soft toys. Even dinosaurs are transformed by plush fabric and stuffing into reassuring, cuddly, domestic creatures and nursery talismans. Marina Warner examines the ancient, mythological roots of the symbolic value of the wild and looks at how these are intertwined with the definition of humanity's virtue.",
            "length": "26880000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02r7tbb.mp3"
        },
        {
            "title": "Little Angels, Little Devils: Keeping Children Innocent",
            "datePublished": "Wed, 09 Feb 1994 09:00:00 +0000",
            "description": "This year's Reith lecturer is the Booker prize-nominated author Marina Warner. A writer of fiction, criticism and history, her works include novels and short stories as well as studies of art, myths, symbols, and fairytales. Her series of Reith Lectures, entitled 'Managing Monsters', explores how myths express and shape our attitudes. \n\nIn her third lecture, Marina Warner examines the burden of dreams that children bear from Peter Pan to Poltergeist. The yearning desire to work back to a pristine state of goodness, an Eden of lost innocence, has focused on children. But Marina Warner argues that appalling social problems can arise from the concept that childhood and adult life are separate, when they are in fact, inextricably intertwined.",
            "length": "27792000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02r84f0.mp3"
        },
        {
            "title": "Boys Will Be Boys",
            "datePublished": "Wed, 02 Feb 1994 09:00:00 +0000",
            "description": "This year's Reith lecturer is the Booker prize-nominated author Marina Warner. A writer of fiction, criticism and history, her works include novels and short stories as well as studies of art, myths, symbols, and fairytales. Her series of Reith Lectures, entitled 'Managing Monsters', explores how myths express and shape our attitudes. \n\nIn her second lecture, Marina Warner examines the threads linking ancient myths and modern machismo and argues that ideas about masculinity are not naturally inculcated. Does the warrior ethic fit the needs of our civil society? Why does an age which believes in medical and scientific intervention, co-exist with a determinist philosophy about human nature and gender? ",
            "length": "27168000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02r80yh.mp3"
        },
        {
            "title": "Monstrous Mothers",
            "datePublished": "Wed, 26 Jan 1994 09:00:00 +0000",
            "description": "This year's Reith lecturer is the Booker prize-nominated author Marina Warner. A writer of fiction, criticism and history, her works include novels and short stories as well as studies of art, myths, symbols, and fairytales. Her series of Reith Lectures, entitled 'Managing Monsters', explores how myths express and shape our attitudes. \n\nIn the first of six lectures, Marina Warner examines the role of the bad mother in myth. From Medea to Jurassic Park, she looks at how the 'she-monster' has been depicted in fiction and the effect of those myths on society today.",
            "length": "26736000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02r7p28.mp3"
        },
        {
            "title": "Gods That Always Fail",
            "datePublished": "Wed, 28 Jul 1993 08:00:00 +0000",
            "description": "This year's Reith lecturer is the Palestinian American academic, political activist, and literary critic Edward Said. He joined the faculty of Columbia University in 1963 where he is now Professor of English and Comparative Literature. Regarded as one of the founders of post-colonial theory, his 1978 book Orientalism is one of the most influential scholarly books of the 20th century. \n\nIn his sixth and final lecture, Edward Said considers how far an intellectual should participate in the public sphere. He examines the dilemma of loyalty to a cause, the nature of belief, and the problems faced by those who publicly recant. The hardest aspect of being an intellectual, he says, is to represent what you profess through your work and interventions, without turning into an institution or acting at the behest of a system or method. ",
            "length": "28256000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02r7p0b.mp3"
        },
        {
            "title": "Speaking Truth To Power",
            "datePublished": "Wed, 21 Jul 1993 08:00:00 +0000",
            "description": "This year's Reith lecturer is the Palestinian American academic, political activist, and literary critic Edward Said. He joined the faculty of Columbia University in 1963 where he is now Professor of English and Comparative Literature. Regarded as one of the founders of post-colonial theory, his 1978 book Orientalism is one of the most influential scholarly books of the 20th century. \n\nIn his fifth lecture, Edward Said considers the basic question for the intellectual: how does one speak the truth? Is there some universal and rational set of principles that can govern how one speaks and writes? He examines the difficulties and sometimes loneliness of questioning authority, and argues that intellectuals should present a more principled stand in speaking the truth to power. ",
            "length": "28096000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02r7sg7.mp3"
        },
        {
            "title": "Professionals and Amateurs",
            "datePublished": "Wed, 14 Jul 1993 08:00:00 +0000",
            "description": "This year's Reith lecturer is the Palestinian American academic, political activist, and literary critic Edward Said. He joined the faculty of Columbia University in 1963 where he is now Professor of English and Comparative Literature. Regarded as one of the founders of post-colonial theory, his 1978 book Orientalism is one of the most influential scholarly books of the 20th century. \n\nIn his fourth lecture, Edward Said examines the possibility of amateur intellectuals and their influence on society. He explores the notion of the 'non-academic intellectual' and considers some of the current pressures on intellectuals to be marketable and uncontroversial as well as in areas of specialisation, political correctness and authority.",
            "length": "28272000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02r7phx.mp3"
        },
        {
            "title": "Intellectual Exiles",
            "datePublished": "Wed, 07 Jul 1993 08:00:00 +0000",
            "description": "This year's Reith lecturer is the Palestinian American academic, political activist, and literary critic Edward Said. He joined the faculty of Columbia University in 1963 where he is now Professor of English and Comparative Literature. Regarded as one of the founders of post-colonial theory, his 1978 book Orientalism is one of the most influential scholarly books of the 20th century. \n\nIn his third lecture, Edward Said looks at intellectuals both as expatriates and as people on the margins of their own society. He examines how exile inspires their thinking and considers representations of the intellectual as the permanent exile.",
            "length": "28592000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02r7twb.mp3"
        },
        {
            "title": "Holding Nations And Traditions At Bay",
            "datePublished": "Wed, 30 Jun 1993 08:00:00 +0000",
            "description": "This year's Reith lecturer is the Palestinian American academic, political activist, and literary critic Edward Said. He joined the faculty of Columbia University in 1963 where he is now Professor of English and Comparative Literature. Regarded as one of the founders of post-colonial theory, his 1978 book Orientalism is one of the most influential scholarly books of the 20th century. \n\nIn his second lecture, Edward Said explores the role of intellectuals from different cultures and backgrounds, and the choices that face them when deciding to side with the powerful or with the underdog. He examines that problems of loyalty and nationalism for intellectuals, and argues that their role is primarily to question.",
            "length": "28576000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02r81gy.mp3"
        },
        {
            "title": "Representations of the Intellectual",
            "datePublished": "Wed, 23 Jun 1993 08:00:00 +0000",
            "description": "This year's Reith lecturer is the Palestinian American academic, political activist, and literary critic Edward Said. He joined the faculty of Columbia University in 1963 where he is now Professor of English and Comparative Literature. Regarded as one of the founders of post-colonial theory, his 1978 book Orientalism is one of the most influential scholarly books of the 20th century. \n\nIn his first of six Reith Lectures, Edward Said examines how intellectuals have been defined by academics, sociologists and writers throughout history. He explores what their role should be in the modern world and looks at what the public and private versions of an intellectual are.",
            "length": "28096000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02r7ntl.mp3"
        },
        {
            "title": "The Evolution of Utopia",
            "datePublished": "Wed, 18 Dec 1991 09:00:00 +0000",
            "description": "Dr Steve Jones, Reader in Genetics at University College, London delivers his final Reith lecture, in a series about the new biological insight into humanity. \n\nIn this lecture, Dr Jones explores the long history of genetic engineering including Frances Galton's founding of the 'science' of eugenics and its consequences.\n\nThere has long been a history of attempted genetic engineering by parents trying to dictate the sex of their offspring by various, almost always futile, and often painful, methods. It is now possible to do this with almost 100% success by separating female and male eggs in the test tube. Dr Jones examines the moral implications and varying views on such procedures, and how gene-therapy provokes the same sort of moral questions.\n\nHe argues that the biology of the future will not be very different to that of the past and it may even be that humans are at the end of their evolutionary road; as near to our biological utopia as we're ever likely to get.",
            "length": "28352000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02r7pk2.mp3"
        },
        {
            "title": "Cousins Under the Skin",
            "datePublished": "Wed, 11 Dec 1991 09:00:00 +0000",
            "description": "Dr Steve Jones, Reader in Genetics at University College, London delivers his penultimate Reith lecture, in a series about the new biological insight into humanity. \n\nIn this lecture, Steve Jones examines how science has been used to discriminate, arguing that the history of race illustrates more than anything else the way science can be used to support prejudice.\n\nHe examines the limitations of biology in understanding human affairs and by using the example of the genetic differences between snails in two valleys in the Pyrenees, which he argues, are greater than between Australian aborigines and ourselves, he explains that there are far greater genetic differences between individuals than between countries or races. Humans, he says, are in fact a tediously uniform species.",
            "length": "28464000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02r82wy.mp3"
        },
        {
            "title": "The Economics of Eden",
            "datePublished": "Wed, 04 Dec 1991 09:00:00 +0000",
            "description": "Dr Steve Jones, Reader in Genetics at University College, London gives a series of lectures on the new biological insight into humanity.\n\nIn his fourth lecture, Dr Jones examines the correlation between genetic change and economic development. While society tends not to be driven by its genes, social and economic changes produce many of the genetic patterns seen in the world today. \n\nHe also draws parallels between the evolution of languages and the evolution of genes. Languages evolve, he argues, like genes, producing dialects and whole new languages and lines of descent can be produced using languages as well as genetics.",
            "length": "28400000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02r7nh8.mp3"
        },
        {
            "title": "In God's Image",
            "datePublished": "Wed, 27 Nov 1991 09:00:00 +0000",
            "description": "Dr Steve Jones, Reader in Genetics at University College, London gives a series of lectures on the new biological insight into humanity.\n\nIn his third lecture, Dr Jones explores the power and consequences of natural selection. Differences in animals' physical characteristics vary according to longitude. Creationists see this as evidence of God's subtle design whereas Darwinists point to natural selection. Dr Jones explains how selection works and argues that there is less chance of it in modern Western societies than even a century ago.",
            "length": "28512000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02r82c5.mp3"
        },
        {
            "title": "Change or Decay",
            "datePublished": "Wed, 20 Nov 1991 09:00:00 +0000",
            "description": "Dr Steve Jones, Reader in Genetics at University College, London gives a series of lectures on the new biological insight into humanity.\n\nIn his second lecture, Dr Jones explores the importance of mutation in the development of individuals and species. Recent advances in molecular biology have revolutionised the study of mutations in human DNA.\n\nDr Jones explains how mutation leads to diversity and change, some good, some bad, and argues that humanity is not a decayed remnant of a noble ancestor, but rather we are the products of evolution; a set of successful mistakes.",
            "length": "28240000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02r8556.mp3"
        },
        {
            "title": "A Message From Our Ancestors",
            "datePublished": "Wed, 13 Nov 1991 09:00:00 +0000",
            "description": "Dr Steve Jones, Reader in Genetics at University College, London gives the first of six Reith Lectures on the new biological insight into humanity.\n\nHe explains how the study of genetics has been transformed in recent decades and argues that while fossil records and ancient myths preserve some limited truths about humanity's origins; our genes hold a far more complete picture. Like anatomy, sociology or psychoanalysis, he says, genetics can give us a significant glimpse into aspects of our history and about what it means to be human. ",
            "length": "28656000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02r7sk8.mp3"
        },
        {
            "title": "A Community of Communities",
            "datePublished": "Wed, 19 Dec 1990 09:00:00 +0000",
            "description": "In his sixth and final Reith Lecture, Dr. Jonathan Sacks, Chief Rabbi of the United Hebrew Congregations of the Commonwealth, explains why faith will survive. \n\nDr. Jonathan Sacks explores in his lecture entitled 'A Community of Communities' the bond of religion. He explains that although the numbers of religious believers seems to be dwindling, religion will never totally fade away. He believes that the values it provides communities are still needed by the individual and the nation.",
            "length": "28144000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02r7nv4.mp3"
        },
        {
            "title": "Fundamentalism",
            "datePublished": "Wed, 12 Dec 1990 09:00:00 +0000",
            "description": "Dr. Jonathan Sacks, Chief Rabbi of the United Hebrew Congregations of the Commonwealth evaluates the effects of combining religious revival with nationalism in his fifth Reith Lecture. \n\nReviewing the topic of religious fanaticism in his lecture entitled 'Fundamentalism', he argues that when faith and national identity are united they create an explosive mix. Yet, paradoxically, he believes secularism does not provide a solution either.",
            "length": "27968000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02r840r.mp3"
        },
        {
            "title": "Paradoxes & Pluralism",
            "datePublished": "Wed, 05 Dec 1990 09:00:00 +0000",
            "description": "Dr. Jonathan Sacks, Chief Rabbi of the United Hebrew Congregations of the Commonwealth explores the language of religion in his fourth Reith Lecture on 'The Persistence of Faith'. \n\nIn this lecture Dr. Jonathan Sacks puts forward the idea of a society which speaks both a public language of citizenship as well as a local language of community in this lecture entitled 'Paradoxes of Pluralism'. Expanding on this concept of pluralism, he asks whether it has diluted religion or created cultural space for the individual. ",
            "length": "28160000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02r7t62.mp3"
        },
        {
            "title": "The Family",
            "datePublished": "Wed, 28 Nov 1990 09:00:00 +0000",
            "description": "Dr. Jonathan Sacks, Chief Rabbi of the United Hebrew Congregations of the Commonwealth explores the importance of the family relationship in his third Reith Lecture on 'The Persistence of Faith'. \n\nIn this lecture entitled 'The Family', Dr. Jonathan Sacks investigates the persistence of the religious institution of marriage in the modern secular age. He explores the values of the nuclear family as a framework for how we understand society and wonders how the new age of increased divorce, co-habitation, single parents and same sex relationships, will affect the concept of the family. He evaluates whether it is a good or bad thing for the family unit be eroded. ",
            "length": "26640000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02r81qh.mp3"
        },
        {
            "title": "The Demoralisation of Discourse",
            "datePublished": "Wed, 21 Nov 1990 09:00:00 +0000",
            "description": "Dr Jonathan Sacks, Chief Rabbi of the United Hebrew Congregations of the Commonwealth, explores religious ethics in his second Reith Lecture in the series 'The Persistence of Faith'. He investigates whether today's moral dramas centre more on the free-self than the saint or the hero. \n\nIn this lecture entitled 'The Demoralisation of Discourse', Dr Jonathan Sacks focuses on how modern morals are founded in faith. It is his belief that without the objective standards of religion we would have no coherent language of ethics.",
            "length": "28352000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02r7ssk.mp3"
        },
        {
            "title": "The Environment of Faith",
            "datePublished": "Wed, 14 Nov 1990 09:00:00 +0000",
            "description": "Dr Jonathan Sacks, Chief Rabbi of the United Hebrew Congregations of the Commonwealth, lectures in his first Reith Lecture on the 'The Persistence of Faith'. Explaining how he believes that the moral framework provided by religion is still the best alternative to the personalised, free-market ethics which prevail today.\n\nIn this lecture entitled 'The Environment of Faith', Dr Jonathan Sacks considers the state of Britain's religions. He asks; have modern cultures forgotten their faith forever? ",
            "length": "27520000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02r815g.mp3"
        },
        {
            "title": "Towards the Light",
            "datePublished": "Wed, 20 Dec 1989 09:00:00 +0000",
            "description": "French poet Jacques Darras delivers his final Reith Lecture from his series entitled 'Beyond the Tunnel of History'.\n\nIn his fifth and final Reith Lecture entitled 'Towards the Light', Jacques Darras finds a clue to our shared European future in an early cross-Channel cultural interaction: the 'School of Light'. The school was established by Irish monks in the medieval city of Laon and Jacque Darras explains that learning from the past will allow us to create a unified Europe.\n",
            "length": "28416000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02r7y26.mp3"
        },
        {
            "title": "Remembering the Somme",
            "datePublished": "Wed, 13 Dec 1989 09:00:00 +0000",
            "description": "French poet Jacques Darras delivers the fourth of his Reith Lectures entitled 'Beyond the Tunnel of History'. He explores the question: 'Have the enormities of the\nSecond World War, like the Holocaust and the dropping the atomic bomb, caused us to ignore the lessons of the First?'\n\nIn his fourth lecture entitled 'Remembering the Somme', Jacques Darras explores the memories of the First World War. He explains the importance of all parts of history and the need for them to be remembered.",
            "length": "26896000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02r7pq3.mp3"
        },
        {
            "title": "Highways of Freedom ",
            "datePublished": "Wed, 06 Dec 1989 09:00:00 +0000",
            "description": "French poet Jacques Darras delivers the third of his Reith Lectures entitled 'Beyond the Tunnel of History'. He argues that with the opening of the Channel tunnel a new age of mobility is within everyone's grasp. Many can now follow in the footsteps of the wealthy and literary by going on their very own 'Grand Tour' of Europe. This freedom, Darras argues, will bring cultures closer together and unify Europe. \n\nIn his third lecture entitled 'Highways of Freedom', Jacques Darras explores the new European nationality. He evaluates how Western and Eastern Europe alike are throwing into the melting-pot the old national territorialities of earlier history. He explains how this is creating a new mobility - and thus new freedoms - for all Europeans.",
            "length": "27024000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02r7nwv.mp3"
        },
        {
            "title": "The Golden Fleece",
            "datePublished": "Wed, 29 Nov 1989 09:00:00 +0000",
            "description": "French poet Jacques Darras delivers the second of his Reith Lectures entitled 'Beyond the Tunnel of History'. He explores the concept of multicultural cities and draws from examples. He highlights the city of Bruges during the Burgundian era as a beacon of advancement in European unification. \n\nIn his second lecture entitled 'The Golden Fleece', Jacque Darras argues that the reason why it was such a prosperous city is because it was multicultural. Its multilingual artists, merchants and bankers could spread their music, painting, wines and wools all over the world. His almost mythical description of Burgundy is used as an antidote to concept of nationalism.",
            "length": "26336000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02r7s9q.mp3"
        },
        {
            "title": "The Time Traveller",
            "datePublished": "Wed, 22 Nov 1989 09:00:00 +0000",
            "description": "French poet Jacques Darras delivers the first of his Reith Lectures entitled 'Beyond the Tunnel of History'.  Taking inspiration from the formation of the Channel Tunnel, Durras looks back through the shared history of France and Britain and suggests that their respective national pasts will need to be reinterpreted in the light of a shared future.\nIn his first lecture entitled 'The Time Traveller', Jacque Darras  asks the question, now that their destinies are increasingly converging within a wider Europe, how will the two cultures reconcile with each other? To answer this question he explores the embodiment of democracy within the civic squares of Europe. He uses the historic architectural landmarks to evaluate how France and Britain might still form a multicultural Europe. ",
            "length": "28144000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02r843x.mp3"
        },
        {
            "title": "The Paradox of Gorbachev's Reforms ",
            "datePublished": "Tue, 13 Dec 1988 09:00:00 +0000",
            "description": "Geoffrey Hosking, Professor of Russian History at University College London, debates the role of pluralist politics in the sixth of his Reith Lectures entitled 'The Rediscovery of Politics'.\n\nIn this lecture entitled 'The Paradox of Gorbachev's Reforms', Professor Hosking explores the role that Mikhail Gorbachev has played as the General Secretary of the Communist Party for the Soviet Union and what lasting effect he will have on the State. He considers how the state will develop and asks can a totalitarian system evolve straight into a democracy?",
            "length": "28464000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02r81c3.mp3"
        },
        {
            "title": "Religion and the Atheist State",
            "datePublished": "Tue, 06 Dec 1988 09:00:00 +0000",
            "description": "Geoffrey Hosking, Professor of Russian History at University College London, explores Soviet religion in the fifth of his Reith Lectures entitled 'The Rediscovery of Politics'.\n\nIn this lecture entitled 'Religion and the Atheist State', Professor Hosking analyses what part religion has to play in reuniting the Soviet peoples and explores the recent easing of tensions between the Soviet state and the Church. Can faith act as a potential antidote to the problem of demoralisation? \n",
            "length": "28224000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02r811c.mp3"
        },
        {
            "title": "The Flawed Melting Pot",
            "datePublished": "Tue, 29 Nov 1988 09:00:00 +0000",
            "description": "Geoffrey Hosking, Professor of Russian History at University College London, explores national aspirations in the fourth of his Reith Lectures entitled 'The Rediscovery of Politics'.\n\nIn this lecture entitled 'The Flawed Melting Pot', Professor Hosking discusses the national desires and ambitions of the various Soviet peoples. He explores how nationalism will affect the Soviet Union.",
            "length": "28288000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02r84sv.mp3"
        },
        {
            "title": "A Civil Society In Embryo",
            "datePublished": "Tue, 22 Nov 1988 09:00:00 +0000",
            "description": "Geoffrey Hosking, Professor of Russian History at University College London, explores changes in Soviet behaviour his third Reith lecture from his series entitled 'The Rediscovery of Politics'. \n\nIn this lecture entitled 'A Civil Society in Embryo', Professor Hosking examines a trend which could mark the beginning of the end of totalitarianism in the Soviet Union. He considers the civil rights movements and environmentally conscious industrialisation as turning points in society. He believes the Soviet Union now has the elements needed to form civil society and move away from an authoritarian state.\n",
            "length": "28080000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02r7p7k.mp3"
        },
        {
            "title": "The Return Of The Repressed",
            "datePublished": "Tue, 15 Nov 1988 09:00:00 +0000",
            "description": "Geoffrey Hosking, Professor of Russian History at University College London, explores the issues of a collective memory in his second Reith lecture from his series entitled 'The Rediscovery of Politics'. \n\nIn this lecture entitled 'The Return Of The Repressed', Professor Hosking describes how Soviet society is recovering from a state of communal amnesia. Only with a common history can a society move forward cohesively, but has Soviet society succumbed to a totalitarian rewriting of the past?\n",
            "length": "27872000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02r7tyx.mp3"
        },
        {
            "title": "A Great Power in Crisis",
            "datePublished": "Tue, 08 Nov 1988 09:00:00 +0000",
            "description": "Geoffrey Hosking, Professor of Russian History at University College London, discusses the changes in Soviet society in his first Reith lecture from the series entitled 'The Rediscovery of Politics'. \n\nIn this lecture entitled 'A Great Power in Crisis', Professor Hosking discusses the relationship between the Soviet economy and the 'glasnost'. This transparency of government institutions, introduced by Mikhail Gorbachev to reduce corruption, has had a fractious effect on society. He asks is this great power in a crisis?\n",
            "length": "28176000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02r7kgk.mp3"
        },
        {
            "title": "Stand Up and Be Misunderstood",
            "datePublished": "Sun, 27 Dec 1987 09:00:00 +0000",
            "description": "English composer Alexander Goehr gives his sixth Reith Lecture from the series entitled 'The Survival of the Symphony'. \n\nIn this lecture entitled 'Stand Up and Be Misunderstood', he concludes his series by stressing why musicians and the public alike should fight to renew the symphony. Extolling it as the greatest and yet most often rejected musical institution. Professor Goehr warns that the 'neglect of established cultural institutions can only further contribute to the neglect of city centres'. Will anyone hear his warning and save the symphony?\n",
            "length": "26544000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02r84c0.mp3"
        },
        {
            "title": "Let the People Sing",
            "datePublished": "Wed, 16 Dec 1987 09:00:00 +0000",
            "description": "English composer Alexander Goehr gives his fifth Reith Lecture from the series entitled 'The Survival of the Symphony'. \n\nIn this lecture entitled 'Let the People Sing', Professor Goehr looks at modern composers who aim to break down the barriers between the audience, the performer and the composer. This fracture allows for composers to create a 'community' of music, but can composers adequately fulfil a social ideal and produce enduring works of art?\n",
            "length": "25808000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02r7nyc.mp3"
        },
        {
            "title": "A Licence for Licence",
            "datePublished": "Wed, 09 Dec 1987 09:00:00 +0000",
            "description": "Once an iconoclastic force, the avant-garde is now comfortably absorbed into modem society. These are the sentiments of English composer Professor Alexander Goehr in his fourth Reith Lecture entitled 'A Licence for Licence'.\n\nSpeaking in his series 'The Survival of the Symphony', Professor Alexander Goehr warns of the creative death such acceptance can bring. Avant-garde is supposed to be nonconformist, modern and experimental but how can it be these things when the modern listeners find it educational and acceptable?\n",
            "length": "28080000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02r7n8h.mp3"
        },
        {
            "title": "Past and Present",
            "datePublished": "Wed, 02 Dec 1987 09:00:00 +0000",
            "description": "Professor of Music at the University of Cambridge and English composer Alexander Goehr gives his third Reith Lecture from his series 'The Survival of the Symphony'. He diagnoses the stifling and possibly fatal pressures of contemporary music-making.\n\nIn this lecture entitled 'Past and Present', Alexander Goehr explains that despite the near ubiquity of music, there is a drastic shortage of major new works available in the concert halls. He explores how tradition and innovation, previously necessary in forming new music, do not always create what the public are demanding.\n",
            "length": "27360000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02r7sjw.mp3"
        },
        {
            "title": "An Orchid In the Field of Technology",
            "datePublished": "Wed, 25 Nov 1987 09:00:00 +0000",
            "description": "Professor of Music at the University of Cambridge and English composer Alexander Goehr gives his second Reith Lecture from the series 'The Survival of the Symphony'. He examines the effect of recorded sound on our perception of music. \n\nIn this lecture entitled 'An Orchid in the Land of Technology', Professor Alexander Goehr asks whether a recording devalues the original performance. He explores how recorded performances are changing the way people listen to music. \n",
            "length": "27088000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02r7s7h.mp3"
        },
        {
            "title": "The Old Warhorse",
            "datePublished": "Wed, 18 Nov 1987 09:00:00 +0000",
            "description": "This year's lecturer is Professor of Music at the University of Cambridge Alexander Goehr. An English composer, his compositions, such as Psalm IV and The Deluge, have established him as an inspirational music creator. In his Reith Lecture series entitled 'The Survival of the Symphony', he explores what musicians have done to music. \n\nIn this lecture entitled 'The Old Warhorse', Alexander Goehr traces the importance of the symphony and its apparent fall from grace in the 20th century. He argues that despite many modern composers and performers being dissatisfied by the symphony, no one has been able to replace its richness and diversity.\n",
            "length": "27648000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02r7pc0.mp3"
        },
        {
            "title": "Lions Under the Throne",
            "datePublished": "Wed, 10 Dec 1986 09:00:00 +0000",
            "description": "Serving Judge Lord McCluskey gives his sixth Reith lecture from the series entitled 'Law, Justice and Democracy'.  \n\nIn his sixth and final Reith Lecture entitled 'Lions under the Throne', Lord McCluskey concludes his argument for separating law and justice. He argues that the functions of making the law and the function of applying it should not be held by the same people. He suggests some swift, sure and cheap measures that he believes would create a better justice system.",
            "length": "27888000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02r7l9h.mp3"
        },
        {
            "title": "An Enormous Power",
            "datePublished": "Wed, 03 Dec 1986 09:00:00 +0000",
            "description": "Serving Judge Lord McCluskey gives his fifth Reith lecture from the series entitled 'Law, Justice and Democracy'.  \n\nIn this lecture entitled 'An Enormous Power', Lord McCluskey debates the essential constitutional difference between the British and American higher judicial systems. Debating the merits and flaws of both systems, Lord McCluskey argues against the enactment of a Bill of Rights in the United Kingdom.\n\n",
            "length": "28528000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02r7t2z.mp3"
        },
        {
            "title": "Trusting the Judges",
            "datePublished": "Wed, 26 Nov 1986 09:00:00 +0000",
            "description": "Serving Judge Lord McCluskey gives his fourth Reith lecture from his series entitled 'Law, Justice and Democracy'.  \n\nIn this lecture, Lord McCluskey counters Lord Denning's exhortation of 'trust the judges' and argues instead for a simplification of the law. He argues that there should be predictable outcomes because the method of adjudication ought, as far as possible, to be the relatively mechanical process. It should apply a precise set of unambiguous rules to the facts and not take a wide-ranging philosophical approach.\n",
            "length": "28208000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02r7szm.mp3"
        },
        {
            "title": "Hard Cases and Bad Law",
            "datePublished": "Wed, 19 Nov 1986 09:00:00 +0000",
            "description": "Serving Judge Lord McCluskey gives his third Reith lecture from the series entitled 'Law, Justice and Democracy'.\n\nIn this lecture entitled 'Hard Cases and Bad Law', Lord McCluskey argues that Parliament, not the judiciary, must have ultimate responsibility for legislation. He argues that they must not abdicate the making of policy choices to \"a body of elderly men\".\n",
            "length": "27984000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02r7ts6.mp3"
        },
        {
            "title": "The Clanking of Medieval Chains",
            "datePublished": "Wed, 12 Nov 1986 09:00:00 +0000",
            "description": "Serving Judge Lord McCluskey gives his second Reith lecture from the series entitled 'Law, Justice and Democracy'. \n\nIn this lecture entitled 'The Clanking of Medieval Chains', Lord McCluskey examines how judges think. He asks how with precisely the same starting materials in terms of fact and legal tradition, judges can come to such diametrically opposite conclusions.",
            "length": "27888000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02r7nc6.mp3"
        },
        {
            "title": "The Chill and Distant Heights",
            "datePublished": "Wed, 05 Nov 1986 09:00:00 +0000",
            "description": "Serving Judge Lord McCluskey gives his first Reith lecture from his series entitled 'Law, Justice and Democracy'. \n\nIn his lecture entitled 'The Chill and Distant Heights', Lord McCluskey discusses whether it is right for judges to have sole responsibility for sentencing criminals. He argues that if judges were relieved of the responsibility for so-called sentencing policy, it could help them to play the role of administering a system of law.",
            "length": "28384000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02r7kx5.mp3"
        },
        {
            "title": "Markets, States & Economics ",
            "datePublished": "Wed, 11 Dec 1985 09:00:00 +0000",
            "description": "David Henderson, head of the Economics and Statistics Department at the Organisation for Economic Co-operation and Development (OECD), examines the influence of economic ideas on policy. He gives the sixth and final lecture in his series entitled 'Innocence and Design'.\n\nIn this lecture entitled 'Markets, States and Economics', David Henderson puts forward the uses of economics and concludes his comparison between orthodox economic and Do-It-Yourself Economics. Setting these arguments in a wider context Henderson considers the political as well as cultural effects these two systems have on society.",
            "length": "28544000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02r82wb.mp3"
        },
        {
            "title": "DIYE plus the Lobbies: Counting the Cost",
            "datePublished": "Wed, 04 Dec 1985 09:00:00 +0000",
            "description": "David Henderson, head of the Economics and Statistics Department at the Organisation for Economic Co-operation and Development (OECD), examines the influence of economic ideas on policy. He gives the fifth lecture in his series entitled 'Innocence and Design'.\n\nIn this lecture entitled 'DIYE plus the Lobbies: Counting the Cost', David Henderson puts forward two questions. The first: why do some professional economic ideas have so little influence? And secondly he questions: how much does this lack of influence matter? To answer these questions he evaluates the power of Do-It-Yourself Economics on policy makers and the current economic strategies.\n\nHe argues that the prosperity of countries depends on how far their governments are prepared to allow choices to be influenced by market forces. He highlights investment choices and international market opportunities in particular.\n",
            "length": "28464000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02r7v1y.mp3"
        },
        {
            "title": "Orthodox Economists versus the People",
            "datePublished": "Wed, 27 Nov 1985 09:00:00 +0000",
            "description": "David Henderson, head of the Economics and Statistics Department at the Organisation for Economic Co-operation and Development (OECD), examines the influence of economic ideas on policy. He gives the fourth lecture in his series entitled 'Innocence and Design'.\n\nIn this lecture entitled 'Orthodox Economists Versus the People', David Henderson further explores the contrasts between Do-It-Yourself Economics and Orthodox Economics. All over the world, trade intervention has been used, and continues to be used, as a means of promoting specific developments, and asserting national identity. To explore this issue Henderson evaluates the differences between international economic relations and trade policies. He questions the notions of where national interests lie in international trade.\n",
            "length": "28256000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02r7ndf.mp3"
        },
        {
            "title": "Needs, Centralism & Autarchy",
            "datePublished": "Wed, 20 Nov 1985 09:00:00 +0000",
            "description": "David Henderson, head of the Economics and Statistics Department at the Organisation for Economic Co-operation and Development (OECD), examines the influence of economic ideas on policy. He gives the third lecture in his series entitled 'Innocence and Design'.\n\nIn this lecture entitled 'Needs, Centralism & Autarchy', David Henderson highlights the contrast between Do-It-Yourself Economics (DIYE) and Orthodox Economics. He reflects on how economic policies might affect security, trade, markets and stocks. Using the example of British Nuclear Power, he evaluates how centralism and essentialism can affect situations at a national level.",
            "length": "28544000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02r80wh.mp3"
        },
        {
            "title": "Soap Opera in High Places",
            "datePublished": "Fri, 15 Nov 1985 09:00:00 +0000",
            "description": "David Henderson, head of the Economics and Statistics Department at the Organisation for Economic Co-operation and Development (OECD), examines the influence of economic ideas on policy. He gives the second lecture in his series entitled 'Innocence and Design'.\n\nIn this lecture entitled 'Soap Opera in High Places', David Henderson considers the leading elements of Do-It-Yourself Economics (DIYE) and explores how it differs from ideas that are widely accepted by trained economists. He asks, what are the implications of these different thoughts for economic policy? \n\nDrawing from his life experiences he serves to emphasise the point that DIYE has been, and continues to be, significant to people who are themselves influential. He shows that individual willingness to pay should be the main test of how resources are used.",
            "length": "28352000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02r7nxl.mp3"
        },
        {
            "title": "The Power of Do-it-Yourself Economics",
            "datePublished": "Wed, 06 Nov 1985 09:00:00 +0000",
            "description": "David Henderson, Head of the Economics and Statistics Department at the Organisation for Economic Co-operation and Development (OECD), examines the influence of economic ideas on policy. He gives the first of five lectures in his series entitled 'Innocence and Design'.\n\nIn this lecture entitled 'The Power of Do-It-Yourself Economics', David Henderson explores the phenomenon of economic DIY. Explained as the unprofessional or layman's view of finances, he describes how it can contradict with the professional views of economics. Using his own experience as a British civil servant, he questions both economic ideals.",
            "length": "27728000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02r7p6x.mp3"
        },
        {
            "title": "The Freedom of the Will",
            "datePublished": "Wed, 12 Dec 1984 09:00:00 +0000",
            "description": "In the final lecture of his series 'Minds, Brains and Science', John Searle, Professor of Philosophy at the University of California, examines the evidence for and against the existence of free will. \n\nIn this lecture entitled 'The Freedom of the Will' Professor Searle attempts to explain why human beings stubbornly believe in their own freedom of action and debates the philosophy of free will. He concludes his Reith Lectures trying to characterise the relationship between the perceptions of self and the world around us.",
            "length": "28528000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02r87lc.mp3"
        },
        {
            "title": "A Changing Reality",
            "datePublished": "Wed, 05 Dec 1984 09:00:00 +0000",
            "description": "In his fifth Reith Lecture from his series 'Minds, Brains and Science', John Searle, Professor of Philosophy at the University of California, Berkeley, considers the discipline of human behavioural science. \n\nIn this lecture entitled 'A Changing Reality', Professor Searle explores the limits to the insights that we can expect from a 'science' of human behaviour. He questions the success of the natural sciences. Why have they not given us more information about human behaviour? What makes the subject so different to sciences like physics and chemistry? ",
            "length": "28576000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02r7t9l.mp3"
        },
        {
            "title": "Walk to Patagonia",
            "datePublished": "Wed, 28 Nov 1984 09:00:00 +0000",
            "description": "In his fourth Reith Lecture from his series 'Minds, Brains and Science', John Searle, Professor of Philosophy at the University of California, Berkeley, analyses the structure of human actions. \n\nIn this lecture entitled 'Walk to Patagonia', Professor Searle draws together the mental and physical aspects to show how our mental activities can produce our behaviour. Can our ability to choose our movements be what separates us from machines? Professor Searle seeks to show how the structure of an action relates to the explanation of it.",
            "length": "28640000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02r7ttj.mp3"
        },
        {
            "title": "Grandmother Knew Best",
            "datePublished": "Wed, 21 Nov 1984 09:00:00 +0000",
            "description": "In the third Reith Lecture from his series 'Minds, Brains and Science', John Searle, Professor of Philosophy at the University of California, Berkeley, explores the discipline of cognitive science.\n\nIn this lecture entitled 'Grandmother Knew Best', Professor John Searle investigates how and why scientists are developing the field of cognitive science. Exploring how the human brain processes information in order to do the action of thinking, John Searle links back to his previous lectures to debate the differences between human thought and computerised artificial intelligence.",
            "length": "28704000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02r83xc.mp3"
        },
        {
            "title": "Beer Cans & Meat Machines",
            "datePublished": "Wed, 14 Nov 1984 09:00:00 +0000",
            "description": "In the second Reith Lecture of his series 'Minds, Brains and Science', John Searle, Professor of Philosophy at the University of California, Berkeley, considers artificial intelligence. He debates whether scientists could create a digital computer which has its own thoughts.\n\nIn this lecture entitled 'Beer Cans and Meat Machines', Professor Searle compares the relationship of the mind and the brain to that of computer programme software to computer hardware. But can a man-made machine ever think like a human?",
            "length": "28528000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02r7npq.mp3"
        },
        {
            "title": "A Froth on Reality",
            "datePublished": "Wed, 07 Nov 1984 09:00:00 +0000",
            "description": "In the first Reith Lecture of his series 'Minds, Brains and Science', John Searle, Professor of Philosophy at the University of California, Berkeley, examines the so-called 'mind body problem'. Searle uses this paradox of the conscious mind verses the scientific brain to explore our understanding of the world.\n\nIn this lecture entitled 'A Froth on Reality', Professor Searle considers how humans think of themselves as cognisant, free, rational beings but science tells us we are a chance occurrence, created in a world that consists entirely of mindless physical particles. From this viewpoint Professor Searle explores the question how can an essentially meaningless world contain meaning?",
            "length": "28576000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02r7km6.mp3"
        },
        {
            "title": "Participation - the Sole Bond",
            "datePublished": "Wed, 14 Dec 1983 09:00:00 +0000",
            "description": "Former Permanent Secretary to HM Treasury, Sir Douglas Wass explores the concept of authority in his series 'Government and the Governed'.\n\nIn his final lecture entitled 'Participation - the Sole Bond', Sir Douglas Wass concludes his discussion about responsive and effective governments with a suggestion for a single, permanent and more autonomous Royal Commission. He argues that this would be one way to promote a more open, participatory democracy.",
            "length": "28288000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02r7p1j.mp3"
        },
        {
            "title": "Opening Up Government.",
            "datePublished": "Wed, 07 Dec 1983 09:00:00 +0000",
            "description": "Former Permanent Secretary to HM Treasury, Sir Douglas Wass explores the concept of authority in his series 'Government and the Governed'.\n\nIn his fifth Lecture entitled 'Opening Up Government', Sir Douglas Wass discusses the need for, and the problems contingent on, greater public access to information affecting government decisions. He asks why there is a gap between the public and its representatives and questions the differences in perception of where public interest lies.",
            "length": "28400000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02r7tf5.mp3"
        },
        {
            "title": "Critical Opposition - Part of the Policy",
            "datePublished": "Wed, 30 Nov 1983 09:00:00 +0000",
            "description": "Former Permanent Secretary to HM Treasury, Sir Douglas Wass explores the concept of authority in his series 'Government and the Governed'.\n\nIn his fourth Reith Lecture entitled 'Critical Opposition - Part of the Policy', Sir Douglas Wass asks how effective Parliament is at exercising today the functions of supervision and control which the 17th-century reformers allotted to it.",
            "length": "28000000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02r7nyv.mp3"
        },
        {
            "title": "The Privileged Adviser",
            "datePublished": "Wed, 23 Nov 1983 09:00:00 +0000",
            "description": "Former Permanent Secretary to HM Treasury, Sir Douglas Wass explores the concept of authority in his series 'Government and the Governed'. \n\nIn his third Reith Lecture entitled 'The Privileged Adviser', Sir Douglas Wass explores the role of British Civil Servants. By tradition they should be neutral in their political philosophy, offer impartial advice to their political chiefs and pursue policies with energy, even when they disagree with them. In reality their definition is not so clear-cut; Ministers and civil servants often are in partnership and can only work together if there is mutual trust. That trust has now been questioned and Sir Wass asks which Civil Service reforms would strengthen it and which would weaken it.",
            "length": "28032000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02r7p6f.mp3"
        },
        {
            "title": "Cabinet: Directorate or Directory?",
            "datePublished": "Wed, 16 Nov 1983 09:00:00 +0000",
            "description": "In his second Reith Lecture entitled 'Cabinet: Directorate or Directory?', Sir Douglas Wass dissects the composition of the British Parliamentary Cabinet to answer the questions; how well does it do its job? And could it be more effective? \n\nSir Wass analyses that the British Cabinet is filled with high ranking parliamentary ministers who very rarely function as a collective group. He claims this is because each have their own proposals that they wish to promote and so they work as a group of individuals rather than a community of decision makers with a collective responsibility. He explains how this often can lead to stagnation and an abstraction of policy that cannot be put into practice. How can we increase cohesion in the Cabinet?",
            "length": "28320000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02r82z5.mp3"
        },
        {
            "title": "United Thoughts & Counsels",
            "datePublished": "Wed, 09 Nov 1983 09:00:00 +0000",
            "description": "Former Permanent Secretary to HM Treasury, Sir Douglas Wass explores the concept of authority in his series 'Government and the Governed'. \n\nIn his first Reith Lecture entitled 'United Thoughts and Counsels', Sir Douglas Wass discusses what we mean by 'government'. Are we referring to the system, to the component parts of the political and administrative machinery? Or do we mean the policies which governments try to follow? He questions whether it is right to equate good government with prosperity and bad government with poverty. \n",
            "length": "28320000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02r7kpv.mp3"
        },
        {
            "title": "A Talent For Conviction",
            "datePublished": "Wed, 15 Dec 1982 09:00:00 +0000",
            "description": "Irish literary critic Denis Donoghue gives the sixth Reith lecture in his series entitled 'The Mystery of Art'. The current Henry James Professor of English and American Letters at New York University explores societies' need to over analyse art. \n\nIn this lecture entitled 'A Talent for Conviction', Denis Donoghue debates how society can increase subjectivity into art without destroying its mystery. He blames critics and their desire to explain every structure of society for devastating the ambiguity of art and asks for the arts to be kept in the margins of society. He claims that it is only in these margins that people can reflect on the art and their own desires.  ",
            "length": "27856000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02r80vr.mp3"
        },
        {
            "title": "The Anxious Object",
            "datePublished": "Wed, 08 Dec 1982 09:00:00 +0000",
            "description": "Irish literary critic Denis Donoghue gives his fifth Reith lecture in his series entitled 'The Mystery of Art'. The current Henry James Professor of English and American Letters at New York University explores the presence and charisma of art. \n\nIn this lecture entitled 'The Anxious Object', Denis Donoghue argues that once critics are gone and titles are destroyed, art is left in its natural state. This intrinsic force and presence of art is the reason why society should give up all interpretations. He believes this is the only way that pretentiousness and vanity can be removed. ",
            "length": "28144000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02r830p.mp3"
        },
        {
            "title": "A Cherishing Bureaucracy",
            "datePublished": "Wed, 01 Dec 1982 09:00:00 +0000",
            "description": "Irish literary critic Denis Donoghue gives the fourth Reith lecture in his series entitled 'The Mystery of Art'. The current Henry James Professor of English and American Letters at New York University explores how critics influence perception of art.\n\nIn this lecture entitled 'A Cherishing Bureaucracy', Denis Donoghue identifies how the state has created a pluralist and populist approach to art. He believes that every piece of art can be enjoyed because they are sanctioned by the state. Art has become easily comprehendible and this understanding has lead to the death of mystery in art. He argues how the very act of naming pieces of art takes away peoples hesitancy; and without this hesitancy, the mystery art is lost.",
            "length": "28448000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02r7s8k.mp3"
        },
        {
            "title": "The Parade of Ideas",
            "datePublished": "Wed, 24 Nov 1982 09:00:00 +0000",
            "description": "Irish literary critic Denis Donoghue gives the third Reith lecture in his series entitled 'The Mystery of Art'. The current Henry James Professor of English and American Letters at New York University explores how critics influence perception of art.\n\nIn this lecture entitled 'The Parade of Ideas', Dennis Donoghue examines the confusing discourse surrounding art by explaining it from a critic's perspective. He explores the politics of pluralism and the sociology of the zeitgeist and calls for art to be challenged instead of adored. He argues that aesthetics must stay antagonistic and not become aligned to politics or psychology.",
            "length": "27552000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02r7mz0.mp3"
        },
        {
            "title": "The Domestication of Outrage",
            "datePublished": "Wed, 17 Nov 1982 09:00:00 +0000",
            "description": "Irish literary critic Denis Donoghue gives the second Reith lecture from his series entitled 'The Mystery of Art'. The current Henry James Professor of English and American Letters at New York University explores society's comprehension of art.\n\nIn this lecture titled 'The Domestication of Outrage', Denis Donoghue assesses how casual materials are transformed into pieces of art and how society evaluates the finished pieces. Donoghue argues that the greatness of art lies in this theological space. He looks at the way people view art and considers the relationship between artists and the art that they create. Is it an expression of character or is the individual unimportant?",
            "length": "28320000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02r83kp.mp3"
        },
        {
            "title": "The Zealots of Explanation",
            "datePublished": "Wed, 10 Nov 1982 09:00:00 +0000",
            "description": "The Mystery of Art is the title of the 1982 Reith lectures given by Irish literary critic Denis Donoghue.  The current Henry James Professor of English and American Letters at New York University explores how societies understand art in his first lecture entitled 'The Zealots of Explanation'.\n\nIn this lecture entitled 'The Zealots of Explanation', Denis Donoghue investigates the arts in relation to the mystery that surrounds them. He claims that the mystery is to be acknowledged but not resolved or else the value of its anonymity will be destroyed. He dismisses the zealots of explanation as destroyers of art.",
            "length": "28192000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02r8335.mp3"
        },
        {
            "title": "Who's Moving the Goal Post?",
            "datePublished": "Wed, 16 Dec 1981 09:00:00 +0000",
            "description": "Professor Laurence Martin, Vice-Chancellor of the University of Newcastle upon Tyne, considers the future of strategic policy in his series of Reith Lectures 'The Two-Edged Sword'\n\nIn his sixth and final lecture entitled 'Who's Moving the Goal Post?', Professor Laurence Martin explores the future development of strategic defence policies. Following the evolving political relationships that correspond to security, he questions how Europe and Britain will develop their defences in the future. ",
            "length": "28288000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02r7t7v.mp3"
        },
        {
            "title": "Not For the Sake of Their Blue Eyes",
            "datePublished": "Wed, 09 Dec 1981 09:00:00 +0000",
            "description": "Professor Laurence Martin, Vice-Chancellor of the University of Newcastle upon Tyne, considers the strategic policy of the nuclear age in his series of Reith Lectures 'The Two-Edged Sword' \n\nIn his fifth lecture entitled 'Not for the Sake of their Blue Eyes', Professor Martin debates the role that arms control and disarmament can play for a country. He questions how countries can reconcile the internal complexity of the modern military scene by asking whether diplomatic negotiation and an armament ceiling might be a better solution. ",
            "length": "28416000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02r87dj.mp3"
        },
        {
            "title": "Conflicts of the Third World",
            "datePublished": "Wed, 02 Dec 1981 09:00:00 +0000",
            "description": "Professor Laurence Martin, Vice-Chancellor of the University of Newcastle upon Tyne, considers the strategic policy of the nuclear age in his series of Reith Lectures 'The Two-Edged Sword'.\n\nIn his fourth lecture entitled 'Conflicts of the Third World', Professor Martin explores the East and West scrabble for the Middle East. The grab, which was instigated by the US and the Soviet Union in order to secure their ideologies and resources, places Europe and other nations in a tough strategic position. \n\nProfessor Martin evaluates America's request for Western Europe and Japan to reconsider their military abstention from Third World affairs. However the fear of the costs and the reprisals might be the biggest hindrance.",
            "length": "28400000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02r7h13.mp3"
        },
        {
            "title": "Shadow Over Europe",
            "datePublished": "Wed, 25 Nov 1981 09:00:00 +0000",
            "description": "Professor Laurence Martin, Vice-Chancellor of the University of Newcastle upon Tyne, considers the strategic policy of the nuclear age in his series of Reith Lectures 'The Two-Edged Sword'\n\nIn his third lecture entitled 'Shadow over Europe', Professor Martin explores the strategic and political implications of nuclear war between the United States and the Soviet Union for Europe. Can Europe survive in the fault-line between American and European interests? Professor Martin explains that nuclear deterrence depends on more than just nuclear weapons: it also depends on the proper marriage of those weapons to the infrastructure of military' and political power.",
            "length": "28480000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02r7tdc.mp3"
        },
        {
            "title": "Plausibility and Horror",
            "datePublished": "Wed, 18 Nov 1981 09:00:00 +0000",
            "description": "Professor Laurence Martin, Vice-Chancellor of the University of Newcastle upon Tyne, considers the strategic policy of the nuclear age in his series of Reith lectures 'The Two-Edged Sword'.\n\nIn his second lecture entitled 'Plausibility and Horror', Professor Martin questions how to avoid a nuclear war. Is the horror of mutually assured destruction enough to deter countries from using their nuclear weapons? Professor Martin debates how countries protect their own security at the same time as averting the total destruction of the world. Evaluating the role of the Strategic Arms Limitations Talks or SALT for short, he asks, can any policy provide absolute assurance of not allowing a nuclear war?",
            "length": "27984000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02r854w.mp3"
        },
        {
            "title": "If You Knows of a Better 'ole...",
            "datePublished": "Wed, 11 Nov 1981 09:00:00 +0000",
            "description": "Professor Laurence Martin, Vice-Chancellor of the University of Newcastle upon Tyne, evaluates the subject of war and peace in a nuclear age in his series of Reith Lectures entitled 'The Two-Edged Sword'. \n\nLooking at the question of nuclear armament, Professor Martin surveys the landscape of the strategic policies relating to nuclear weapons. In his first lecture entitled 'If you knows of a better 'ole…', he asks how we can avert all out nuclear war. \n\nHe brings in to question how nations govern and protect national security, whilst exploring the question; does an arms race naturally lead to war? He argues that new technology, rather than nastier technology, is not necessarily a bad thing for society. ",
            "length": "28016000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02r7phl.mp3"
        },
        {
            "title": "Let's Kill All the Lawyers",
            "datePublished": "Wed, 10 Dec 1980 09:00:00 +0000",
            "description": "British academic lawyer Professor Sir Ian Kennedy explores the concepts of modern medicine in his sixth Reith lecture from his series entitled 'Unmasking Medicine'.\n\nIn this lecture entitled 'Let's Kill All the Lawyers', Sir Ian Kennedy explores how consumerism can regulate the medical industry. He explains how consumerism sets standards, measures performances and provides sanctions for the medical profession. He compares Britain's free National Health Service with the privatised American Health Care System to analyse the best ways of managing the accountability of doctors. ",
            "length": "28000000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02r7p91.mp3"
        },
        {
            "title": "The Doors of Mental Illness",
            "datePublished": "Wed, 03 Dec 1980 09:00:00 +0000",
            "description": "British academic lawyer Professor Sir Ian Kennedy explores the concepts of modern medicine in the fifth Reith lecture from his series entitled 'Unmasking Medicine'.\n\nIn this lecture entitled 'The Doors of Mental Illness', Professor Kennedy explores the concepts of mental illness. Professor Kennedy questions the responsibility and power placed in the hands of medical experts and evaluates how mental differences are treated in society. He considers what mental health really is and demonstrates the shaky ground that the concept of mental illness rests on. Is it a medical complaint or is it a judgement created by society to highlight abnormalities? ",
            "length": "28048000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02r7l6l.mp3"
        },
        {
            "title": "If I Were You, Mrs B",
            "datePublished": "Wed, 26 Nov 1980 09:00:00 +0000",
            "description": "British academic lawyer Professor Sir Ian Kennedy explores the concepts of modern medicine in the fourth Reith lecture from his series entitled 'Unmasking Medicine'.\n\nIn this lecture entitled 'If I Were You, Mrs B', Professor Kennedy contemplates the ethical medical issues that doctors have to make and debates whether they are trained enough to decide such complex issues. He argues that doctors are making principled and moral decisions rather than just technically medical ones and with this blurring of boundaries comes consequences. He explores some examples to argue his point that doctors need to be trained in the humanities and not just the sciences.",
            "length": "28464000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02r810j.mp3"
        },
        {
            "title": "Suffer the Little Children",
            "datePublished": "Wed, 19 Nov 1980 09:00:00 +0000",
            "description": "British academic lawyer Professor Sir Ian Kennedy explores the concepts of modern medicine in the third Reith lecture from his series entitled 'Unmasking Medicine'.\n\nIn this lecture entitled 'Suffer the Little Children', Professor Kennedy considers how the National Health Service needs reforming and gives a conceptual blue print of how he believes improvements should be completed.  Exploring the political, economic and social decisions which influence the way the NHS is run, he questions whether more preventative measures could be taken to stop certain illnesses reaching hospitalisation level?",
            "length": "28368000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02r7gvw.mp3"
        },
        {
            "title": "The New Magicians",
            "datePublished": "Wed, 12 Nov 1980 09:00:00 +0000",
            "description": "British academic lawyer Professor Sir Ian Kennedy explores the concepts of modern medicine in the second Reith lecture in his series entitled 'Unmasking Medicine'.\n\nIn this lecture entitled 'The New Magicians', Sir Ian Kennedy compiles a list of the inappropriate directions that modern medicine has taken, revealing how he believes that it can be pinpointed to the medical education system. He complains medical practitioners have become driven by solving problems of science to the detriment of humanity.",
            "length": "27632000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02r84gw.mp3"
        },
        {
            "title": "The Rhetoric of Medicine",
            "datePublished": "Wed, 05 Nov 1980 09:00:00 +0000",
            "description": "This year's lecturer is the British academic lawyer Professor Sir Ian Kennedy. He founded of the Centre of Law, Medicine and Ethics in 1978 and has lectured at prestigious universities in London, California and Mexico. Professor Kennedy explores the concepts of modern medicine in his Reith lecture series entitled 'Unmasking Medicine'. \n\nIn his first lecture entitled 'The Rhetoric of Medicine', Professor Kennedy reviews how we define illnesses. Examining the role of the doctor in the modern world, Professor Kennedy questions the power medical authorities have over our minds and bodies. He calls for the public to become masters of medicine by learning its complicated language. He explores the political and social judgement centred on the definition of ill health, and asks, what is illness?",
            "length": "27840000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02r83n9.mp3"
        },
        {
            "title": "In Search of Pax Africana",
            "datePublished": "Wed, 12 Dec 1979 09:00:00 +0000",
            "description": "In his sixth Reith Lecture, Professor Ali Mazrui examines Africa's physical location on the globe in relation to its economic, political and military destiny. The Professor of Political Science at the University of Michigan gives his last lecture in the series entitled 'The African Condition'. \n\nIn this lecture entitled 'In Search of Pax Africana', Professor Mazrui explains that geographically, Africa is the most central of all continents, but politically and militarily it is probably the most marginal. What are the implications of this paradox, and how is Africa to get out of the prison-house of political dwarfs situated in the middle of the City of Man?",
            "length": "28608000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02r7nrc.mp3"
        },
        {
            "title": "Patterns of Identity",
            "datePublished": "Wed, 05 Dec 1979 09:00:00 +0000",
            "description": "Professor of Political Science at the University of Michigan, Ali Mazrui, explores Africa's lack of cohesion in his fifth Reith lecture from his series entitled 'The African Condition'. \n\nIn this lecture entitled 'Patterns of Identity', Professor Ali Mazrui argues that an understanding of the size and fragmentation of Africa is essential in diagnosing the nature of its aches and pains. ",
            "length": "28736000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02r7kxv.mp3"
        },
        {
            "title": "The Burden of Underdevelopment ",
            "datePublished": "Wed, 28 Nov 1979 09:00:00 +0000",
            "description": "Professor of Political Science at the University of Michigan, Ali Mazrui, considers Africa's lack of economic development in his fourth Reith lecture from his series entitled 'The African Condition'. \n\nIn this lecture entitled 'The Burden of Underdevelopment', Professor Ali Mazrui questions how such a resource rich region of the world accommodates some of the poorest countries in the world. ",
            "length": "28368000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02r7nbj.mp3"
        },
        {
            "title": " A Clash of Cultures",
            "datePublished": "Wed, 21 Nov 1979 09:00:00 +0000",
            "description": "Professor of Political Science at the University of Michigan, Ali Mazru, explores the conflict between African and Western cultures in his third Reith Lecture. Delivering his third lecture from his series entitled 'The African Condition' \n\nIn this lecture entitled 'A Clash of Cultures', Professor Mazrui argues that African societies are not the closest culturally to the Western world, yet they have been undergoing what is perhaps the most rapid pace of Westernisation of the 20th century.  He explains that Africans are therefore caught up between rebellion against the West and imitation of the West.",
            "length": "28512000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02r813k.mp3"
        },
        {
            "title": "The Cross of Humiliation ",
            "datePublished": "Wed, 14 Nov 1979 09:00:00 +0000",
            "description": "Professor of Political Science at the University of Michigan, Ali Mazrui considers the injustices that have been inflicted on the African people over time in his second Reith lecture. Delivering his lecture from the series entitled 'The African Condition' he explores the sufferances of the African people.\n\nIn this lecture entitled 'The Cross of Humiliation', Professor Ali Mazrui argues that Africans and people of African ancestry have suffered more humiliation in modern history than any other race.",
            "length": "28528000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02r7sb2.mp3"
        },
        {
            "title": "The Garden of Eden in Decay",
            "datePublished": "Wed, 07 Nov 1979 09:00:00 +0000",
            "description": "Professor of Political Science at the University of Michigan, Ali Mazrui gives the first Reith lecture from his series entitled 'The African Condition'. The Kenyan-born university lecturer questions why Africa is the last continent to be made truly habitable. \n\nIn this lecture entitled 'The Garden of Eden in Decay', Professor Mazuri analyses the problems Africa faces in his lecture and compares it to the Garden of Eden in decay. He argues that the long-term solutions to Africa's crisis of habitability depend on the continent acquiring two things: the capacity for self-pacification and the capacity for self-development.",
            "length": "28704000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02r7x7n.mp3"
        },
        {
            "title": "The In-Dwelling Christ",
            "datePublished": "Wed, 06 Dec 1978 09:00:00 +0000",
            "description": "Reverend Dr Edward Norman, Dean of Peterhouse, Cambridge, considers the Christian situation in Africa in his fifth Reith lecture. Speaking from his series entitled 'Christianity and the World Order' he considers the persistence of religion in a secular society.\n \nIn this lecture entitled 'The Indwelling Christ', Reverend Norman explores the contemporary understanding of Christianity. He evaluates its change from spiritual devotion to a sanctification of political morals. However, Reverend Norman explains that Christianity is far more than just morality and warns we should not forget the role of spirituality in our lives.  ",
            "length": "26176000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02r81xs.mp3"
        },
        {
            "title": "Not Peace, but a Sword",
            "datePublished": "Wed, 29 Nov 1978 09:00:00 +0000",
            "description": "Reverend Dr Edward Norman, Dean of Peterhouse, Cambridge, considers the Christian situation in Africa in his fifth Reith lecture. Speaking from his series entitled 'Christianity and the World Order' Norman explores the politicisation of Christianity in specific areas of Africa. \n\nHe investigates how political alignment of religion with politics is causing blurred boundaries between the two and asks how can acts of war be sanctified by religion?",
            "length": "27296000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02r81w9.mp3"
        },
        {
            "title": "The Imperialism of Political Religion",
            "datePublished": "Wed, 22 Nov 1978 09:00:00 +0000",
            "description": "Reverend Dr Edward Norman, Dean of Peterhouse, Cambridge, explores the imperialist perspective of Christianity in his fourth Reith lecture. Speaking from his series entitled 'Christianity and the World Order' Norman explores Christianity around the globe. \n\nHe evaluates the way in which Western Christians view the Latin-American radical churches and believe that they are listening to the Christian word of the Third World. But are they really hearing from the oppressed and exploited majority of its society?",
            "length": "25824000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02r7wys.mp3"
        },
        {
            "title": "A New Commandment - Human Rights",
            "datePublished": "Wed, 15 Nov 1978 09:00:00 +0000",
            "description": "Reverend Dr Edward Norman, Dean of Peterhouse, Cambridge, reflects on the close relationship between Christianity and Western liberal ideals in his third Reith lecture. Speaking from his series entitled 'Christianity and the World Order' Norman reviews how civil rights have followed the paths of religious doctrines.\n\nThere is no great dissimilarity between secular and religious outlooks on the moral question of human rights, but Reverend Norman asks, what happens when human rights violations happen under the authority of a Christian state? ",
            "length": "25904000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02r87hp.mp3"
        },
        {
            "title": "Ministers of Change",
            "datePublished": "Wed, 08 Nov 1978 09:00:00 +0000",
            "description": "Reverend Dr Edward Norman, Dean of Peterhouse, Cambridge, explores who the 'Ministers of Change' are in society in his second Reith lecture.\n\nSpeaking from the series entitled 'Christianity and the World Order' Norman investigates the effect of the secular states' political values on Christianity. Christianity preaches love thy neighbour but do Christian countries follow their own doctrine? Reverend Norman considers the link between religion and politics by investigating the increased influence of The World Council of Churches in developing countries. ",
            "length": "25488000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02r84rv.mp3"
        },
        {
            "title": "The Political Christ",
            "datePublished": "Wed, 01 Nov 1978 09:00:00 +0000",
            "description": "Reverend Dr Edward Norman, Dean of Peterhouse, Cambridge, discusses how and why faith has been transformed by political values in his first Reith lecture.\n\nSpeaking from his series entitled 'Christianity and the World Order' Norman examines the authenticity of religion and considers its potential decay as it becomes progressively aligned with a secularised state. \n\nHe explains that with the politicisation of Christianity, it is now essentially concerned with social morality rather than with the ethereal qualities of spirituality. Halsey questions what effect this has on the religion. ",
            "length": "26384000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02r83fm.mp3"
        },
        {
            "title": "The Social Order",
            "datePublished": "Wed, 15 Feb 1978 09:00:00 +0000",
            "description": "Sociologist A H Halsey is Professor of Social and Administrative studies at the University of Oxford. In his final lecture from his series 'Change in British Society', Halsey investigates the problem of fraternity in society. He argues that there are native traditions in social and political values which join people together. Yet, can social order in the shape of class, status and party affect these feelings of belonging? \n\nIn this lecture entitled 'The Social Order', Professor Halsey explains how societies are made through cohesion in group interests, but Societies are also broken by arguments and competition. He analyses how the authoritative power of the state presides over its society.",
            "length": "27360000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02r7sw7.mp3"
        },
        {
            "title": "Between the Generations",
            "datePublished": "Wed, 08 Feb 1978 09:00:00 +0000",
            "description": "Sociologist A H Halsey is Professor of Social and Administrative studies at the University of Oxford. In his fifth lecture from his series entitled 'Change in British Society', Halsey investigates the relation between the generations of the nuclear family and focuses in on the primordial link between parents and dependent children. \n\nIn this lecture entitled 'Between the Generations', Professor Halsey explains how the family is the basic unit of our society. He analyses how it is a miniature reproduction of the social cells of class, of status and of culture. In examining the history of the collective memory of family, one is able to discover the changes of social structure in Britain.",
            "length": "27552000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02r84tg.mp3"
        },
        {
            "title": "The Rise of Party",
            "datePublished": "Wed, 01 Feb 1978 09:00:00 +0000",
            "description": "Sociologist A H Halsey is Professor of Social and Administrative studies at the University of Oxford. He evaluates how the expansion of Britain's industrial and economic sectors changed the need for class and status for the fourth Reith lecture from his series entitled 'Change in British Society'.\n\nIn this lecture entitled 'The Rise of Party', Professor Halsey follows the growth of organisation in relation to the changing structure of class and status in Britain and explains that the growth of companies, trade unions and eventually the Labour Party changed the face of the British society. ",
            "length": "28144000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02r8362.mp3"
        },
        {
            "title": "The Reconstitution of Status",
            "datePublished": "Wed, 25 Jan 1978 09:00:00 +0000",
            "description": "Sociologist A H Halsey is Professor of Social and Administrative studies at the University of Oxford. He explores the concept of Status in Society for his third Reith lecture from his series entitled 'Change in British Society'.\n \nIn this lecture entitled 'The Reconstitution of Status', Professor Halsey looks at the theory of class and status in order to argue the importance of position and power in influencing social mobility. He investigates how class and status can either support or oppose each other and how persistent inequalities are less and less protected from challenge.",
            "length": "27344000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02r7v67.mp3"
        },
        {
            "title": "Class-Ridden Prosperity",
            "datePublished": "Wed, 18 Jan 1978 09:00:00 +0000",
            "description": "Sociologist A H Halsey is Professor of Social and Administrative studies at the University of Oxford. He explores the structures of class in Britain for his second Reith lecture from his series entitled 'Change in British Society'. \n\nIn this lecture entitled 'Class-Ridden Prosperity', Professor A H Halsey explores how far inequality can be explained by status. He evaluates the ways in which power and advantage form the stratified system of 'Class' and asks the question, why is there still social inequality in this developed and wealthy nation? ",
            "length": "28400000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02r82yk.mp3"
        },
        {
            "title": "To Know Ourselves",
            "datePublished": "Wed, 11 Jan 1978 09:00:00 +0000",
            "description": "Sociologist A H Halsey, Professor of Social and Administrative studies at the University of Oxford, explores the characteristics of the British culture in his first Reith lecture from the series entitled 'Change in British Society'. \n\nIn this lecture entitled 'To Know Ourselves' Professor Halsey explains that to know ourselves we must explore the sources of consensus and conflict. How are differences between classes, sexes, generations and ethnic groups to be depicted? How have they been changing? Considering different division of sociological thought, Professor Halsey evaluates how society tries to bond under the classifications of Liberty, Equality and Fraternity. ",
            "length": "28208000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02r82g6.mp3"
        },
        {
            "title": "Madness and Morality",
            "datePublished": "Wed, 15 Dec 1976 09:00:00 +0000",
            "description": "Neurobiologist and lecturer of Physiology at the University of Cambridge Colin Blakemore considers mental illness and morality in his sixth and final Reith lecture from his series 'Mechanics of the Mind'. He questions why society attempts to regulate the behaviour of its members and tries to order them into normal and abnormal. \n\nIn this lecture entitled 'Madness and Morality', Professor Colin Blakemore expands on the many ways cerebral irregularities have been treated throughout history; invasive psychosurgery and electro-therapy were the precursors to modern day medicines and psychiatry. ",
            "length": "28480000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02r87km.mp3"
        },
        {
            "title": "A Burning Fire",
            "datePublished": "Wed, 08 Dec 1976 09:00:00 +0000",
            "description": "Neurobiologist and lecturer of Physiology at the University of Cambridge Colin Blakemore explores speech as the vehicle of our language in the fifth Reith lecture from his series entitled 'Mechanics of the Mind'. He investigates how we evolved to speak and questions whether human brains are mentally better equipped to interpret the syntax of language. \n\nIn this lecture entitled 'A Burning Fire', Professor Blakemore moves between scientific experiments with chimpanzees using sign language to the legendary tales of children growing up without a language. Through these examples he tries to explain why humans have advanced their communications into the complicated language we have today.",
            "length": "28736000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02r7s83.mp3"
        },
        {
            "title": "A Child of the Moment",
            "datePublished": "Wed, 01 Dec 1976 09:00:00 +0000",
            "description": "Neurobiologist and lecturer of Physiology at the University of Cambridge Colin Blakemore explores the human memory in his fourth Reith lecture from his series entitled 'Mechanics of the Mind'.\n\nIn this lecture entitled 'A Child of the Moment', Professor Blakemore discusses how we create and store the memories which create our identity. He explains how scientists believe that memories consist of synthesized chemical molecules in the brain and reveals examples of how cerebral cortex damage can halt memory formation or lead to an overload.",
            "length": "28720000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02r7sgn.mp3"
        },
        {
            "title": "An Image of Truth",
            "datePublished": "Wed, 24 Nov 1976 09:00:00 +0000",
            "description": "Neurobiologist and lecturer of Physiology at the University of Cambridge explores human sight in his third Reith Lecture from his series entitled 'Mechanics of the Mind'. We build up a miraculous understanding of the world around us by interpreting the light that enters our eyes. Professor Blakemore explains how the brain interprets these lights to create sight. \n\nIn this lecture entitled 'An Image of Truth', Professor Blakemore argues that our perception provides us with a representation of our world, which we trust as a measure of reality, but what happens when this part of the brain is affected? To answer this question he shows how science uses case studies to investigate and develop our understanding.",
            "length": "28512000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02r80v7.mp3"
        },
        {
            "title": "Chang Tzu and the Butterfly",
            "datePublished": "Wed, 17 Nov 1976 09:00:00 +0000",
            "description": "Neurobiologist and lecturer of Physiology at the University of Cambridge Colin Blakemore explores the human need for sleep in his second Reith lecture from his series entitled 'Mechanics of the Mind'. \n\nIn this lecture entitled 'Chang Tzu and the Butterfly', Professor Colin Blakemore examines the human need for sleep. The study of human sleep remains the most direct experimental approach to the question of consciousness. Our nightly appointment with death is the most profound loss of awareness that most of us are likely to experience throughout our lives. We shall spend more than 20 years of our lifetime asleep-unconscious, almost oblivious to the demands, the joys and the dangers of the world around us. \n\nThe problem of human consciousness has stirred up fierce debate between the reductionists and holists and Professor Blakemore asks the question, why do we sleep? ",
            "length": "28592000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02r81cv.mp3"
        },
        {
            "title": "The Divinest Part of Us",
            "datePublished": "Wed, 10 Nov 1976 09:00:00 +0000",
            "description": "This year's lecturer is Neurobiologist Colin Blakemore. A Professor of Physiology at the University of Cambridge and Director of Medical Studies at Downing College, he is the youngest person to give the Reith lectures. He explores the concepts of the brain in his Reith series entitled 'Mechanics of the Mind' and evaluates how our brains have shaped our behaviour and our society. \n\nIn this lecture entitled 'The Divinest Part of Us', Professor Colin Blakemore discusses how the theory of the mind mirrors man's social development; from Plato's genetically-controlled meritocracy of the mind, to Franz Joseph Gall's view of character showing through the shape of the human skull. Professor Blakemore delves into the idea of miraculous mind and explains how the scientific world has not always thought that highly of the brain.  ",
            "length": "27664000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02r7sr3.mp3"
        },
        {
            "title": "The Birth of Exploration",
            "datePublished": "Wed, 12 Nov 1975 09:00:00 +0000",
            "description": "This year's Reith lecturer is distinguished Professor of American history, Dr Daniel J Boorstin, the twelfth Librarian of Congress. In his Reith lectures, entitled 'America and the World Experience', he explores how the USA developed into the superpower it is today.\n\nIn this first lecture entitled 'The Birth of Exploration', Dr Boorstin explains why the desire to journey to new and undiscovered lands was important in the development of the United States of America. He considers the difference between a 'frontier' and 'the wilderness' for the first colonisers of the continent and explains how a community spirit of adventure made it all possible. ",
            "length": "28128000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02r6l51.mp3"
        },
        {
            "title": "On Difference",
            "datePublished": "Wed, 04 Dec 1974 09:00:00 +0000",
            "description": "Professor of Sociology and Director of the London School of Economics Ralf Dahrendorf gives his fourth Reith lecture from his series entitled 'The New Liberty'.\n\nIn this lecture entitled 'On Difference', Professor Ralf Dahrendorf discusses the concept of diversity and averages. Evaluating the socialist philosophies of different countries, he dissects the averages that are found in society and contemplates what will happen when developing countries try to reassess their status as developed countries. ",
            "length": "28128000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02r7225.mp3"
        },
        {
            "title": "Justice Without Bondage",
            "datePublished": "Wed, 27 Nov 1974 09:00:00 +0000",
            "description": "Professor of Sociology and Director of the London School of Economics Ralf Dahrendorf gives his third Reith lecture from his series entitled 'The New Liberty'.\n\nIn this lecture entitled 'Justice Without Bondage', Professor Dahrendorf evaluates how liberty has been misinterpreted as equality and justice. He claims that advanced demographic societies are bound by a fear of political correctness. In this age, which he describes as 'the alienation of the enlightened progress', he argues that we have become the prisoners of our own good purpose. Society has taken the notion of justice and replaced it with equality. He contemplates whether we can weather the storm of 'social justice' in order to progress to a 'liberal justice' system.",
            "length": "28368000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02qsmv6.mp3"
        },
        {
            "title": "The Liberal Option",
            "datePublished": "Wed, 20 Nov 1974 09:00:00 +0000",
            "description": "Professor of Sociology and Director of the London School of Economics Ralf Dahrendorf gives his second Reith lecture from his series entitled 'The New Liberty'. \n\nIn this lecture entitled 'The Liberal Option', Professor Dahrendorf explores the liberal options available to society. He questions why recognised problems in society, which also have visible solutions, do not make any great progress. Who is it that prevents this potential from being realised? To answer these questions he explores how social-economic structures affect our liberty. ",
            "length": "28304000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02r5zc1.mp3"
        },
        {
            "title": "From Expansion to Improvement",
            "datePublished": "Wed, 13 Nov 1974 09:00:00 +0000",
            "description": "This year's Reith lecturer is the eminent German-British sociologist Ralf Dahrendorf.  Previously a Professor of Sociology at the Universities of Hamburg, Tübingen and Konstanz, he has been a leading figure for liberal politics and an authority on class divisions in modern society. In 1970 he became the European Commissioner in Brussels before taking over as Director of the London School of Economics and Political Science in 1974. In his Reith series entitled 'The New Liberty', he questions the definition of freedom.\n\nIn his first Reith lecture entitled 'From Expansion to Improvement', Ralf Dahrendorf argues that we should think about autonomy in a new light. He explores how philosophy, sociology and economics all affect our elemental desires and the definition of freedom. He reflects on the evolution of liberty and questions how we could improve our lives. ",
            "length": "28000000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02r4fn9.mp3"
        },
        {
            "title": "The Search For A New Order",
            "datePublished": "Wed, 19 Dec 1973 09:00:00 +0000",
            "description": "Alastair Francis Buchan, the Montague Burton Professor of International Relations for Oxford University, explores the concept of 'transnationalism' in his sixth Reith lecture. Speaking from his series entitled 'Change without War', he concludes his lectures on international relations.\n\nIn this lecture entitled 'The Search for a New Order', Professor Alastair Buchan speculates whether we might be able to control and adapt the dynamic process of change in order to reduce the eruptions of conflict around the globe. He explores whether functional co-operation and changes in national attitudes could lead to a more open, transnational society.  ",
            "length": "27648000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02r5vnc.mp3"
        },
        {
            "title": "The Troubled Giant",
            "datePublished": "Wed, 28 Nov 1973 09:00:00 +0000",
            "description": "Alastair Francis Buchan, the Montague Burton Professor of International Relations for Oxford University, reflects on the global power of the United States of America in his third Reith lecture. Speaking from his series entitled 'Change without War', he reflects on new international relations.\n\nIn this lecture entitled 'The Troubled Giant', Professor Alastair Buchan explores why the United States of America is still the largest and strongest world power. He analyses how its decisions continue to affect the climate of world politics more than any other country and asks why this continues to be true. He examines the USA's relationship with the power structures within the Soviet Union and China, as well as looking at the triangular economic relationship between the USA, Europe and Japan. ",
            "length": "27408000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02r8547.mp3"
        },
        {
            "title": "Wanted: An Instrument For Crisis Management",
            "datePublished": "Tue, 12 Dec 1972 09:00:00 +0000",
            "description": "Director of the Royal Institute of International Affairs and political economist Sir Andrew Shonfield gives the sixth of his Reith lectures from his series entitled 'Europe: Journey to an Unknown Destination'.\n\nIn this lecture entitled 'Wanted: An Instrument for Crisis Management', Sir Shonfield considers the long-term future of the European Community. Analysing the effect of Britain's entry, he also anticipates an adaptation of the role of the European Commission into the next level of European cohesion. Sir Shonfield concludes his series by exploring the practical measures which should be taken in order to create a democratic, forward thinking and cohesive Europe.\n",
            "length": "27328000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02qsl41.mp3"
        },
        {
            "title": "From Technocracy to Democracy",
            "datePublished": "Tue, 05 Dec 1972 09:00:00 +0000",
            "description": "Director of the Royal Institute of International Affairs and political economist Sir Andrew Shonfield gives the fifth of his Reith lectures from his series entitled 'Europe: Journey to an Unknown Destination'.\n\nIn this lecture entitled 'From Technocracy to Democracy?', Sir Shonfield considers how the inclusion of the British into the European Community could lead to a more politically democratic form of governance. Taking this into consideration, Sir Shonfield questions whether the European Community will achieve greater democratic legitimacy.",
            "length": "27376000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02r5qxg.mp3"
        },
        {
            "title": "European Foreign Policy Towards Asia & the Soviet Bloc",
            "datePublished": "Tue, 28 Nov 1972 09:00:00 +0000",
            "description": "Director of the Royal Institute of International Affairs and political economist Sir Andrew Shonfield gives the fourth of his Reith lectures from his series entitled 'Europe: Journey to an Unknown Destination'.\n\nIn this lecture entitled 'A European Foreign Policy towards Asia and the Soviet Bloc', Sir Shonfield explores the policy problems of the enlarged European Community in relation to the rest of the world. Shonfield explores how external economic relations and different foreign policies must be created for different areas. Exploring how this could be done, Sir Shonfield analyses industrial powers like Japan, underdeveloped countries in the Indian sub-continent and problematic Eastern European countries. ",
            "length": "27552000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02r5knc.mp3"
        },
        {
            "title": "The American Connection",
            "datePublished": "Tue, 21 Nov 1972 09:00:00 +0000",
            "description": "Director of the Royal Institute of International Affairs and political economist Sir Andrew Shonfield  gives the third of his Reith lectures from his series entitled 'Europe: Journey to an Unknown Destination'.\n\nIn this lecture entitled 'The American Connection: a Grumbling Alliance', Sir Shonfield explores the European Community's relations with the rest of the world and in particular, The United States. He explores how currency, business and trade all affect the working relationship between the two powers, and asks how the European attitude towards the United States might develop during the 1970s in the face of new American policy pressure.",
            "length": "27136000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02r5hsw.mp3"
        },
        {
            "title": "The French Spirit and the British Intruder",
            "datePublished": "Tue, 14 Nov 1972 09:00:00 +0000",
            "description": "Director of the Royal Institute of International Affairs and political economist Sir Andrew Shonfield gives the second of his Reith lectures from his series entitled 'Europe: Journey to an Unknown Destination'.\n\nIn this lecture entitled 'The French Spirit and the British Intruder', Sir Andrew Shonfield identifies the problems in creating a European Federation. He explores how political identity is mixed up with national identity, and explains why certain countries find it harder to join the European Community than others. Looking at the British and French feelings toward the union, he argues that compromise is the only way that the European Community can work effectively.",
            "length": "27424000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02r65vx.mp3"
        },
        {
            "title": "Melting Pot or Bag of Marbles?",
            "datePublished": "Tue, 07 Nov 1972 09:00:00 +0000",
            "description": "This year's Reith lecturer is political economist Sir Andrew Shonfield. Currently the Director of the Royal Institute of International Affairs (RIIA), he has previously worked as economic editor and foreign editor for The Observer (1958–61) and the Financial Times (1947–57). After fifteen years in journalism, he became the Director of Studies at the RIIA before a brief stint as Chairman of the Social Science Research Council from1969–70.\n\nIn his Reith series entitled 'Europe: Journey to an Unknown Destination', he debates British entry into the European Community. \n\nIn this lecture entitled 'Melting Pot or Bag of Marbles?', Sir Andrew Shonfield explores integration between the European nations and questions the reasons for of the European Community. He explores the power structures which create the Community's foundations and asks how joining the EC will affect Britain. He advances the debate about what the future will hold for all the European nations.",
            "length": "27296000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02r4gwq.mp3"
        },
        {
            "title": "A Common Ground",
            "datePublished": "Tue, 21 Dec 1971 09:00:00 +0000",
            "description": "The British academic and Assistant Director General of UNESCO Richard Hoggart explores the concepts of communication in his Reith lecture series entitled 'Only connect'.\n\nIn this lecture entitled 'Common Ground', Richard Hoggart evaluates the role of passing information to each other via a system of communication. He asks, now that we have developed at an almost unbelievable speed, what happens next? Are we really more in touch now than previously? How will new technologies bring us closer? Centralised mass societies are keen to show they understand the human scale  but can human societies remember to interact with each other in a fundamentally kind and moral way? ",
            "length": "27536000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02r685b.mp3"
        },
        {
            "title": "The Loss of the Stable State",
            "datePublished": "Sun, 15 Nov 1970 08:00:00 +0000",
            "description": "This year's Reith lecturer is the influential thinker Donald Schon. Previously a Professor of philosophy at the University of California, he was the director of the Institute for Applied Technology in the National Bureau of Standards, Department of Commerce. He is currently the co-founder and director of the Organization for Social and Technological Innovation (OSTI), a non-profit social research and development firm in Boston. \n\nHe delivers his Reith lecture on industrial technology and social change from his series entitled 'Change and the Industrial Society'.\n\nIn this lecture entitled 'The Loss of the Stable State', Donald Schon describes how society needs a belief in a calm and constant identity and structure. Exploring times when this stability has been lost, he analyses the human need for the belief of a better time. ",
            "length": "41584000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02r5793.mp3"
        },
        {
            "title": "Where Does Responsibility Lie?",
            "datePublished": "Sun, 14 Dec 1969 08:00:00 +0000",
            "description": "The Vice-President of the Conservation Foundation in Washington, DC and renowned ecologist Sir Frank Fraser Darling explores the concept of Man's responsibility for his natural environment in his Reith series entitled 'Wilderness and Plenty'.\n\nIn his final lecture entitled 'Where Does Responsibility Lie?', Sir Fraser Darling argues that population is almost certain to increase but pollution does not necessarily need to. He argues that technology should use its own inventiveness to decontaminate the world, but asks who would be responsible for enforcing such a policy. Without all nations taking the ethical responsibility for the environment, he concludes, it will take many years for intellectually-led change to filter through and become concrete action plans.\n",
            "length": "27760000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02r6hkt.mp3"
        },
        {
            "title": "The Forward Look in Conservation",
            "datePublished": "Sun, 07 Dec 1969 08:00:00 +0000",
            "description": "The Vice-President of the Conservation Foundation in Washington, DC and renowned ecologist Sir Frank Fraser Darling explores the concept of Man's responsibility for his natural environment in his Reith series entitled 'Wilderness and Plenty'.\n\nIn his fifth lecture entitled 'The Forward Look in Conservation', Sir Fraser Darling reflects on the art of conservation. He considers how technology and preservation of the world could work together in unison and highlights different countries' conservation contributions. He argues that science can be an enlightener if only industries and politics allow it to work.",
            "length": "27680000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02r7978.mp3"
        },
        {
            "title": "Global Changes - Actual and Possible",
            "datePublished": "Sun, 30 Nov 1969 08:00:00 +0000",
            "description": "The Vice-President of the Conservation Foundation in Washington, DC and renowned ecologist Sir Frank Fraser Darling explores the concept of Man's responsibility for his natural environment in his Reith series entitled 'Wilderness and Plenty'.\n\nIn his fourth lecture entitled 'Global Changes - Actual and Possible', Sir Frank Fraser Darling explores the problem of overpopulation  and its likely effect on the natural world. He considers the population problem in relation to other environmental factors such as increasing levels of carbon dioxide in the atmosphere, increased reliance on technology and the reduction in all natural environmental buffers. He ponders whether rises in prosperity and population might just signal the decline of the habitable world. ",
            "length": "26880000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02qsl58.mp3"
        },
        {
            "title": "The Technological Exponential",
            "datePublished": "Sun, 23 Nov 1969 08:00:00 +0000",
            "description": "The Vice-President of the Conservation Foundation in Washington, DC and renowned ecologist Sir Frank Fraser Darling explores the concept of Man's responsibility for his natural environment in his Reith series entitled 'Wilderness and Plenty'.\n\nIn his third lecture entitled 'The Technological Exponential', Sir Frank Fraser Darling examines the ecological consequences of technology since the industrial evolution. He reflects on the way the rapid guzzle of oil, coal and nuclear materials has affected the environment and touches on what this technology has done to Man as well. He scrutinises the enveloping character of advanced technology, and the choking side-effect of pollution.",
            "length": "27856000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02r6hg5.mp3"
        },
        {
            "title": "Impact of Man on His Environment",
            "datePublished": "Sun, 16 Nov 1969 08:00:00 +0000",
            "description": "The Vice-President of the Conservation Foundation in Washington, DC and renowned ecologist Sir Frank Fraser Darling explores the concept of Man's responsibility for his natural environment in his Reith series entitled 'Wilderness and Plenty'. \n\nIn his second lecture entitled 'Impact of Man on His Environment', Sir Fraser Darling explores the continuous affect of man on his natural habitat. Taking examples from prehistoric man, the industrial revolution and modern day technology, he considers whether man has taken all he can from the world to increase growth and development. He explores and criticises how politics and political policies have had a lasting affect on the contamination of the world and its ecology.",
            "length": "27808000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02qslk7.mp3"
        },
        {
            "title": "Man and Nature",
            "datePublished": "Sun, 09 Nov 1969 08:00:00 +0000",
            "description": "This year's Reith lecturer is English ecologist, conservationist and author Sir Frank Fraser Darling. He is the current Vice-President of the Conservation Foundation in Washington, DC and his ornithological ideas have marked him as a specialist on the topic of the natural environment. He also worked as a Senior Lecturer in Ecology and Conservation at the University of Edinburgh (1953-58) and was Chief Officer at the Imperial Bureau of Animal Genetics (1930–34). He is strongly associated with the highlands of Scotland, an area which he has often studied and written about.\n\nFrank Fraser Darling explores the concept of Man's responsibility for his natural environment in his Reith series entitled 'Wilderness and Plenty'. In his first lecture entitled 'Man and Nature', he considers how humans have dominated the natural world by constantly challenging it and altering it to their advantage. However, bringing together economics and ecology, he discusses what circumstances might lead to the need to conserve the human race.",
            "length": "27968000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02qsm0l.mp3"
        },
        {
            "title": "The United States of the World",
            "datePublished": "Sun, 01 Dec 1968 08:00:00 +0000",
            "description": "Nobel Peace Prize winner and former Canadian Prime Minister Lester Pearson contemplates the political world order in his Reith series entitled 'Peace in the Family of Man'. \n\nIn this lecture entitled 'The United States of the World', Lester Pearson contemplates the concept of nationalism. What is a national identity? How can we dispel the emotions and prejudices which are wrapped up in it? And how does internationalism change our perspectives? He explores why we create nations and explores how the concept is used at a political and social level.",
            "length": "28656000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02r5d73.mp3"
        },
        {
            "title": "'Only Connect...'",
            "datePublished": "Sun, 17 Dec 1967 09:00:00 +0000",
            "description": "This year's Reith lecturer is the British social anthropologist Professor Edmund Leach. He is the current Provost of King's College, Cambridge and throughout his academic career he has challenged received notions about cultural change. He explores the notion of 'relational structures' in his Reith series entitled 'A Runaway World?'\n\nIn this lecture entitled 'Only Connect', Professor Leach concludes his series by explaining the interconnectedness of humans with the natural world. He warns that without a fluid collective identity we might irrevocably destroy our environment and species. He argues that everyone needs to understand where they fit in to the system, and provide a collective attitude of protection by communicating with each other. He suggests that educating and stimulating the young to enlarge their expectations in imaginative ways could lead to a better future. He warns that whenever we assert dominance over the universe, we must also remember the interconnectedness of the universe. The good and the bad, the weak and the strong; all have a right to exist.",
            "length": "29168000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02r5sqs.mp3"
        },
        {
            "title": "Ourselves and Others",
            "datePublished": "Sun, 26 Nov 1967 09:00:00 +0000",
            "description": "This year's Reith lecturer is the British social anthropologist Professor Edmund Leach. He is the current Provost of King's College, Cambridge and throughout his academic career he has challenged received notions about cultural change. He explores the notion of 'relational structures' in his Reith series entitled 'A Runaway World?'\n\nIn this lecture entitled 'Ourselves and Others', Professor Edmund Leach asks why we kill each other. Where does our fear of the 'Other' come from? He explores how separation from nature and our neighbours has created this anxiety. He moves on examine how the composition of society has changed, asking why there is a generation gap and the consequential problems with the nuclear family. He questions how we can connect with others, and dispel the fear which constrains us.",
            "length": "29872000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02r56xf.mp3"
        },
        {
            "title": "The Role of the State",
            "datePublished": "Sun, 04 Dec 1966 09:00:00 +0000",
            "description": "Professor John Kenneth Galbraith is the Paul M Warburg Professor of Economics at Harvard University and is the author of 'The Affluent Society'. In his Reith series entitled 'The New Industrial State', he explores the economics of production.\n\nIn this lecture entitled 'The Role of the State', Professor Galbraith explores the relationship states have with large Corporations. He argues that the state and private industry are moving closer together and warns there is a danger that the state could become too involved with industry, and consequently policies could be influenced by these corporations. Galbraith looks at what the state should be providing for its citizens. ",
            "length": "28000000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02r6gj1.mp3"
        },
        {
            "title": "Economic Meetings",
            "datePublished": "Sun, 28 Nov 1965 09:00:00 +0000",
            "description": "Executive Secretary of the United Nations Economic Commission for Africa Robert Gardiner discusses the issues of race in his Reith series entitled 'A World of Peoples'. Born in Ghana, he has worked as the Head of the Ghana Civil Service, is a former Deputy Executive Secretary for the Economic Commission for Africa and has authored the book 'Development of Social Administration'.\n\nIn this lecture entitled 'Economic Meetings', Robert Gardiner explores how economic inequalities affect race relations. He analyses how race can interfere with economic forces by looking at economies for countries where different races live together. He asks, is there race equality within economics?",
            "length": "27616000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02r6fr7.mp3"
        },
        {
            "title": "Contemporary Racial Moods",
            "datePublished": "Sun, 21 Nov 1965 09:00:00 +0000",
            "description": "Executive Secretary of the United Nations Economic Commission for Africa Robert Gardiner discusses the issues of race in his Reith series entitled 'A World of Peoples'. Born in Ghana, he has worked as the Head of the Ghana Civil Service, is a former Deputy Executive Secretary for the Economic Commission for Africa and has authored the book 'Development of Social Administration'.\n\nIn this lecture entitled 'Contemporary Racial Moods', Robert Gardiner explains why the concept of race resists precise definition and why race theorists persist in searching for proofs of racial differences in mentality. He explores myths which purport to explain racial differences by investigating past history and current frustrations. He provides examples of misconceived ideas by both white and black people and asks, how much of the colour conflict is due to fear? And if these fears were gone, would there be a chance of solving racial problems? ",
            "length": "28432000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02r5v85.mp3"
        },
        {
            "title": "Industrial And Economic Consequences",
            "datePublished": "Sun, 13 Dec 1964 09:00:00 +0000",
            "description": "Leading British industrialist and pioneer of automation Sir Leon Bagrit continues his Reith lectures. He is the Chairman and Managing Director of Elliott Automation Ltd, one of the first companies in Europe devoted to automation, and speaks on this topic in his series entitled 'The Age of Automation'. \n\nIn this lecture entitled 'Automation: Industrial and Economic Consequences', Sir Bagrit asks how we can put automation into practice at a national level. How should it be assimilated in the lives of the British citizens? Sir Bagrit argues that the development of new machines will lead to a golden age of mass comfort and opportunity. Thus, he claims, technological advancement needs to be quickened and not slowed.",
            "length": "23392000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02r6dpn.mp3"
        },
        {
            "title": "The Fulfilment of Lives",
            "datePublished": "Sun, 01 Dec 1963 09:00:00 +0000",
            "description": "This year's Reith lecturer is Dr Albert E Sloman, Vice-Chancellor of the University of Essex. He was previously Gilmour Professor of Spanish at Liverpool University and Dean of the Faculty of Arts. Dr Sloman explores what is needed to make an institute for higher education in Essex in his series entitled 'A University in the Making'.\n\nIn this lecture entitled 'The Fulfilment of Lives', Dr Sloman explores how the newly built University of Essex will create accommodation for its students. Putting forward his concept of social cohesion for the college in the town of Colchester, he explains how small apartments, integrated recreational areas for students and lecturers and large sport areas will allow for the perfect work/life balance.  ",
            "length": "27696000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02qskqr.mp3"
        },
        {
            "title": "Vicissitudes of Adolescence",
            "datePublished": "Sun, 25 Nov 1962 09:00:00 +0000",
            "description": "Professor of Psychological Medicine at the University of Edinburgh Professor George Carstairs contemplates the patterns of social anthropology in his Reith series 'This Island Now'. \n\nIn this lecture entitled 'Vicissitudes of Adolescence', Professor Carstairs explores how violence and sex have been linked to teenage behaviour. Are adolescents more sexually promiscuous? Are teenagers more aggressive? To answer these questions he discusses his own field research in India to compare Hindu communities to British ones, in order to consider how social class affects teenage behaviour.  ",
            "length": "27312000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02r6pv1.mp3"
        },
        {
            "title": "The Problem of White Settlement",
            "datePublished": "Thu, 07 Dec 1961 09:00:00 +0000",
            "description": "African affairs writer and lecturer Margery Perham discusses the effects of colonialism in tropical Africa. In 1939 she became the first female fellow of Nuffield College at Oxford University before being appointed as Director of the Oxford Institute of Colonial Studies in 1945. In her Reith series entitled 'The Colonial Reckoning', she highlights problems of colonial rule.\n\nIn this lecture entitled 'The Problem of White Settlement', she considers the problem of the European colonists, and the delicate question of race relations. ",
            "length": "28144000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02r67vl.mp3"
        },
        {
            "title": "African Nationalism",
            "datePublished": "Thu, 23 Nov 1961 09:00:00 +0000",
            "description": "African affairs writer and lecturer Margery Perham discusses the effects of colonialism in tropical Africa. In 1939 she became the first female fellow of Nuffield College at Oxford University before being appointed as Director of the Oxford Institute of Colonial Studies in 1945. In her Reith series entitled 'The Colonial Reckoning', she highlights problems of colonial rule.\n\nIn this lecture entitled 'African Nationalism', she explores the positive side of anti-colonialism, which is emancipation. She discusses how and why this force has started and tries to explain how it has led to African freedom from British and French rule. She analyses some of the converging events and influences which have turned the world into a hot-house for the forced and rapid growth of African nationalism.",
            "length": "28144000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02r6696.mp3"
        },
        {
            "title": "The Mechanization of Art",
            "datePublished": "Sun, 11 Dec 1960 09:00:00 +0000",
            "description": "This year's lecturer is the first and current Professor of Art History at Oxford University, Edgar Wind. The German-born British professor specialises in iconology in the Renaissance era. In his Reith Series entitled 'Art and Anarchy', Edgar Wind explores the concepts of creative energies produced through turmoil.\n\nIn this lecture entitled 'The Mechanization of Art', Edgar Wind considers how machines have influenced art. He untangles conflicting opinions of how mechanics have influenced the production and evaluation of art now that works can be reproduced and multiplied. Professor Wind discusses how our experience of art is affected by the techniques of multiplication, and acknowledges that the creation, preservation and display of art can show signs of a mechanised style.",
            "length": "27664000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02r4jl6.mp3"
        },
        {
            "title": "The Fear of Knowledge",
            "datePublished": "Sun, 04 Dec 1960 09:00:00 +0000",
            "description": "This year's lecturer is the first and current Professor of Art History at Oxford University, Edgar Wind. The German-born British professor specialises in iconology in the Renaissance era. In his Reith Series entitled 'Art and Anarchy', Edgar Wind explores the concepts of creative energies produced through turmoil.\n\nIn this lecture entitled 'The Fear of Knowledge', Edgar Wind challenges the idea that intellect hurts the artistic imagination. This prejudice, which artists themselves have rarely shared, does not allow for the aesthetic perception of art to be heightened. He argues that art and intellect should not be separated into one or the other, because together they have created some of the greatest works of art. ",
            "length": "27936000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02r6dck.mp3"
        },
        {
            "title": "Future of Man",
            "datePublished": "Sun, 20 Dec 1959 09:00:00 +0000",
            "description": "This year's Reith lecturer is the Professor of Zoology and Comparative Anatomy at University College London, Peter Brian Medawar. His work on graft rejection and the discovery of acquired immune tolerance has been fundamental to the practice of tissue and organ transplants. In his Reith lecture series entitled 'The Future of Man', Professor PM Medawar considers how humans will continue to evolve in the future.\n\nIn his sixth lecture entitled 'The Future of Man', Professor PM Medawar discusses the possibility of a new, non-genetic, system of inheritance. He predicts that certain properties and activities of the brain will affect our evolution in the future.",
            "length": "28096000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02r5fwh.mp3"
        },
        {
            "title": "The Origin of the Universe 2",
            "datePublished": "Sun, 14 Dec 1958 09:00:00 +0000",
            "description": "This year's Reith Lecturer is Professor Bernard Lovell, the first Director of the Jodrell Bank Experimental Observatory, and Professor of Radio Astronomy at Manchester University. During the Second World War, he helped to develop radar systems for aircrafts, for which he received an OBE in 1946. He delivers six lectures on the wonders of the solar system in his series entitled 'The Individual and the Universe'.\n\nIn his final lecture entitled 'The Origin of the Universe 2', Professor Bernard Lovell considers the alternative theory which science can offer on the beginning of the universe. His exploration of the continuous creation theory concludes his Reith lectures. ",
            "length": "30832000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02r47mz.mp3"
        },
        {
            "title": "The Origin of the Universe 1",
            "datePublished": "Fri, 07 Nov 1958 09:00:00 +0000",
            "description": "This year's Reith Lecturer is Professor Bernard Lovell, the first Director of the Jodrell Bank Experimental Observatory, and Professor of Radio Astronomy at Manchester University. During the Second World War, he helped to develop radar systems for aircrafts, for which he received an OBE in 1946. He delivers six lectures on the wonders of the solar system in his series entitled 'The Individual and the Universe'.\n\nIn his fifth lecture entitled 'The Origin of the Universe 1', Professor Bernard Lovell explores how we observe the horizon of the universe, and contemplates how we formulate theories in terms of known physical laws. He gives examples of evolutionary models and explains the implications of this evolutionary theory.",
            "length": "28128000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02r724d.mp3"
        },
        {
            "title": "The Military Problem",
            "datePublished": "Sun, 01 Dec 1957 09:00:00 +0000",
            "description": "This year's Reith Lecturer is American adviser, diplomat, political scientist, and historian George Frost Kennan. He is best known as \"the father\" of the USA Containment Policy and is a leading authority on the Cold War. In his series 'Russia, the Atom, and the West', he considers the relationship between the two superpowers Russia and the USA. \n\nIn his fourth lecture entitled 'The Military Problem', Professor Kennan discusses the military aspect of the West's conflict with Soviet power. He considers how atomic weapons have changed the relationship between East and West, and confronts the problem of the 'mutually assured destruction' doctrine.",
            "length": "27984000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02r69gn.mp3"
        },
        {
            "title": "The Problem of Eastern and Central Europe",
            "datePublished": "Sun, 24 Nov 1957 09:00:00 +0000",
            "description": "This year's Reith Lecturer is American adviser, diplomat, political scientist, and historian George Frost Kennan. He is best known as \"the father\" of the USA Containment Policy and is a leading authority on the Cold War. In his series 'Russia, the Atom, and the West', he considers the relationship between the two superpowers Russia and the USA. \n\nIn his third lecture entitled 'The Problem of Eastern and Central Europe', Professor Kennan considers why disagreements about frontiers and the political control of territory are so potent. He explores the difficulties which have already arisen in Central and Eastern Europe over territorial conflict, and considers in detail the problems between Germany and the satellite states under Soviet rule. ",
            "length": "29024000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02r4xf1.mp3"
        },
        {
            "title": "Science and Education",
            "datePublished": "Sun, 16 Dec 1956 09:00:00 +0000",
            "description": "This year's Reith Lecturer is the Principal and Vice-Chancellor of the University of Edinburgh Sir Edward Appleton. From 1939 to 1949 he was Secretary of the Department of Scientific and Industrial Research, and in 1947 he was awarded the Nobel Prize in Physics for his contributions to the knowledge of the ionosphere, which led to the development of radar. In his Reith series entitled 'Science and the Nation', he considers the importance of science. \n\nIn his sixth lecture entitled 'Science and Education', Professor Appleton considers how we teach science. He analyses the functions of teaching institutions, and explores how universities teach both applied and pure science.",
            "length": "27472000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02r76xd.mp3"
        },
        {
            "title": "Industrial Science",
            "datePublished": "Sun, 09 Dec 1956 09:00:00 +0000",
            "description": "This year's Reith Lecturer is the Principal and Vice-Chancellor of the University of Edinburgh Sir Edward Appleton. From 1939 to 1949 he was Secretary of the Department of Scientific and Industrial Research, and in 1947 he was awarded the Nobel Prize in Physics for his contributions to the knowledge of the ionosphere, which led to the development of radar. In his Reith series entitled 'Science and the Nation', he considers the importance of science. \n\nIn his fifth lecture entitled 'Industrial Science', Professor Appleton considers the functional uses of science. He explores the scientific research work carried out by industries in order to produce better products, and analyses how automation is expanding this kind of science.",
            "length": "14672000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02r79k9.mp3"
        },
        {
            "title": "Architecture and Planning: The Functional Approach",
            "datePublished": "Sun, 27 Nov 1955 09:00:00 +0000",
            "description": "This year's Reith lecturer is Dr Nikolaus Pevsner, the German-born British scholar of history of art and architecture, and author of the county guide series, The Buildings of England (1951–74). In this series, Pevsner explores the qualities of art which he regards as particularly English, as illustrated in the works of several English artists, and what they say about the English national character.\n\nIn his final lecture, Dr Pevsner examines the particular aspects of Englishness which he believes are prevalent today, and what, by their means, England might achieve for her own benefit, and perhaps, that of other nations. He explores how England's towns and centres have been planned, and argues that traditional English planning theory takes into account the historical, social and aesthetic aspects of a site, as well as its pure geography. ",
            "length": "28160000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02r60g4.mp3"
        },
        {
            "title": "Constable and the Pursuit of Nature",
            "datePublished": "Sun, 20 Nov 1955 09:00:00 +0000",
            "description": "This year's Reith lecturer is Dr Nikolaus Pevsner, the German-born British scholar of history of art and architecture, and author of the county guide series, The Buildings of England (1951–74). In this series, Pevsner explores the qualities of art which he regards as particularly English, as illustrated in the works of several English artists, and what they say about the English national character.\n\nIn his sixth and penultimate Reith lecture, Dr Pevsner describes the attitude of the English Romantic painter John Constable (1776-1837) and some of his contemporaries to Italian art, and compares his Englishness with that of Blake and Hogarth.  He examines the sudden flowering of English landscape painting which began with Richard Wilson (1714–1782) and his Welsh landscapes, and argues that this concentration on landscape is a direct result of the temperate English climate. ",
            "length": "27392000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02r4x30.mp3"
        },
        {
            "title": "Blake and the Planing Line",
            "datePublished": "Sun, 13 Nov 1955 09:00:00 +0000",
            "description": "This year's Reith lecturer is Dr Nikolaus Pevsner, the German-born British scholar of history of art and architecture, and author of the county guide series, The Buildings of England (1951–74). In this series, Pevsner explores the qualities of art which he regards as particularly English, as illustrated in the works of several English artists, and what they say about the English national character.\n\nDr Pevsner explores the 'Decorated Style', which seems in every respect to be the opposite of the Perpendicular style which he examined in his previous lecture. Through illustrations ranging from English church architecture from 1290-1350 to the gentle curves of painters such as Gainsborough and Reynolds, Dr Pevsner places the artist William Blake (1757-1827) in the context of a very English tradition. ",
            "length": "27424000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02r5bmp.mp3"
        },
        {
            "title": "Perpendicular England",
            "datePublished": "Sun, 06 Nov 1955 09:00:00 +0000",
            "description": "This year's Reith lecturer is Dr Nikolaus Pevsner, the German-born British scholar of history of art and architecture, and author of the county guide series, The Buildings of England (1951–74). In this series, Pevsner explores the qualities of art which he regards as particularly English, as illustrated in the works of several English artists, and what they say about the English national character.\n\nIn his fourth lecture, Dr Pevsner examines the Perpendicular style, formed in England in about 1330, and which he calls 'the most English creation in architecture'. It represented a complete break with what had gone before, but once it had been established universally in the country by the 1380s, it remained virtually unchanged for 150 years, so much so that even specialists struggle to determine accurate dates for this style of work. ",
            "length": "27968000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02r7gfk.mp3"
        },
        {
            "title": "Reynolds and Detachment",
            "datePublished": "Sun, 30 Oct 1955 09:00:00 +0000",
            "description": "This year's Reith lecturer is Dr Nikolaus Pevsner, the German-born British scholar of history of art and architecture, and author of the county guide series, The Buildings of England (1951–74). In this series, Pevsner explores the qualities of art which he regards as particularly English, as illustrated in the works of several English artists, and what they say about the English national character.\n\nIn his third lecture, Dr Pevsner examines the work of the portrait painter Sir Joshua Reynolds (1723-1792), and argues that the far-reaching contrast between his promotion of painting in the Grand Manner, and how he actually painted, is eminently English. ",
            "length": "27648000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02r520p.mp3"
        },
        {
            "title": "Hogarth and Observed Life",
            "datePublished": "Sun, 23 Oct 1955 09:00:00 +0000",
            "description": "This year's Reith lecturer is Dr Nikolaus Pevsner, the German-born British scholar of history of art and architecture, and author of the county guide series, The Buildings of England (1951–74). In this series, Dr Pevsner explores the qualities of art which he regards as particularly English, as illustrated in the works of several English artists, and what they say about the English national character.\n\nIn his second lecture, Dr Pevsner considers the 'Englishness' of the artist and satirist William Hogarth (1697-1764). He explores the characteristics which he says make Hogarth a particularly English artist, and argues that his work embodies the ideals of the Age of Reason. ",
            "length": "27872000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02r6kl7.mp3"
        },
        {
            "title": "The Geography of Art",
            "datePublished": "Sun, 16 Oct 1955 09:00:00 +0000",
            "description": "This year's Reith lecturer is Dr Nikolaus Pevsner, the German-born British scholar of history of art and architecture, and author of the county guide series, The Buildings of England (1951–74). In this series, Dr Pevsner explores the qualities of art which he regards as particularly English, as illustrated in the works of several English artists, and what they say about the English national character.\n\nIn his first lecture, Dr Pevsner examines the reasons for the study of history of art. He argues that an understanding and appreciation of the work of the artist is truly life-enhancing, and he goes on to explore the English national character as it is expressed in terms of art.",
            "length": "27056000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02r5txp.mp3"
        },
        {
            "title": "The Atlantic Bridge",
            "datePublished": "Sun, 21 Nov 1954 09:00:00 +0000",
            "description": "This year's Reith Lecturer is the Chairman of Lloyds Bank, Sir Oliver Franks. He is the former Provost of Queen's College, Oxford, and the former Professor of Moral Philosophy at University of Glasgow. He was the British Ambassador in Washington, DC, between 1948 and 1952, and has been described as \"one of the founders of the post-war world\". He delivers his Reith series entitled 'Britain and Tide of World Affairs'.\n\nIn his third lecture entitled 'The Atlantic Bridge', Sir Oliver explores the relationship between the United States of America and Britain. He discusses the frictions between the two countries and their mutual interdependence. He analyses the discomforts of the passage of power, McCarthyism, and the fear that the United States will land us in a third world war. ",
            "length": "29200000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02r5g6n.mp3"
        },
        {
            "title": "The Sciences and Man's Community",
            "datePublished": "Sun, 20 Dec 1953 09:00:00 +0000",
            "description": "This year's Reith Lecturer is American theoretical physicist Robert Oppenheimer. Professor of Physics at the Institute for Advanced Study, Princeton, he has been described as the \"father of the atomic bomb\" for his role in the Manhattan Project while Director of Los Alamos Scientific Laboratory between 1943–45. In his Reith lectures entitled 'Science and the Common Understanding', he examines the impact of quantum and atomic theory on society.\n\nIn his sixth and final lecture entitled 'The Sciences and Man's Community', Professor Oppenheimer explains how the \"House of Science\" helps us to understand the underlying profundities of the earth and our lives. He draws parallels between the construction of human society and the atom: each man is dependent on the next, and through the power of the collective, Man's power grows with the shared knowledge of individuals.",
            "length": "29280000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02qslsf.mp3"
        },
        {
            "title": "The Psychology of Encounters",
            "datePublished": "Sun, 14 Dec 1952 09:00:00 +0000",
            "description": "This year's Reith Lecturer is British historian Arnold J Toynbee. The former Director of Studies at the Royal Institute of International Affairs, he is currently the Koraes Professor of History at London University. He considers how Europe interacts with other countries in his Reith Lecture series entitled 'The World and the West'.\n\nIn his fifth lecture entitled 'The Psychology of Encounters', Professor Toynbee examines ways in which countries respond to new cultures. He argues that the most important differences are invariably rejected, but that minor \"culture strands\" are often allowed to flourish, thus creating a patchwork of cultural identities. ",
            "length": "29360000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02qsjwq.mp3"
        },
        {
            "title": "British Rule In India",
            "datePublished": "Sun, 02 Dec 1951 09:00:00 +0000",
            "description": "This year's Reith Lecturer is British lawyer Lord Radcliffe. He was Director-General of the Ministry of Information during the Second World War, and is most famous for his role in Partition, the division of the British Indian Empire, His work led directly to the creation of Pakistan and India as independent nations. He examines the features of democratic society, and considers the problematic notions of power and authority in his series of seven Reith Lectures entitled 'Power and the State'.\nIn his fifth Reith lecture entitled 'British Rule in India', Lord Radcliffe examines the early years of British administration in India. He argues that period until the Indian Mutiny succeeded more as a result of the character of its institutions than their excellence. He suggests this offers a classic example of how men really respond to the stimulus of great authority.",
            "length": "27920000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02r7nzn.mp3"
        },
        {
            "title": "Individual and Social Ethics",
            "datePublished": "Sun, 30 Jan 1949 09:00:00 +0000",
            "description": "The inaugural Reith Lecturer is the philosopher, mathematician, and social reformer Bertrand Russell. One of the founders of analytic philosophy and a Nobel Laureate, he is the author of Principia Mathematica, and the bestselling History of Western Philosophy, written in 1946. His Reith lecture series is entitled 'Authority and the Individual'. \n\nIn his final lecture, entitled 'Individual and Social Ethics', he relates social and political doctrines to the individual ethics by which people guide their personal lives. He argues that Man needs a sense of personal morality to guide his conduct, and must learn to be critical of tribal customs and beliefs that may be generally accepted amongst his neighbours. Primitive impulses, he says, can find harmless outlets in adventure and creation. He suggests that Man has always been subject to two miseries: firstly, those imposed by external nature which are now largely diminished by science; and secondly, those that men inflict on each other, such as through war. Russell rejects the argument that human nature demands war, believing instead that the greed for possession will lessen as the fear of destitution is removed from society.",
            "length": "27584000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02r4lm4.mp3"
        },
        {
            "title": "Control and Initiative: Their Respective Spheres",
            "datePublished": "Sun, 23 Jan 1949 09:00:00 +0000",
            "description": "The inaugural Reith Lecturer is the philosopher, mathematician, and social reformer Bertrand Russell. One of the founders of analytic philosophy and a Nobel Laureate, he is the author of Principia Mathematica, and the bestselling History of Western Philosophy, written in 1946. His Reith lecture series is entitled 'Authority and the Individual'. \n\nIn his penultimate Reith lecture, entitled 'Control and Initiative: Their Respective Spheres', Bertrand Russell considers which matters should be controlled by the state in a healthy and progressive society, and what should be left to private initiative. He argues that in our complex world, there cannot be fruitful initiative without government, but nor can there be government without initiative.",
            "length": "28320000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02r5dv7.mp3"
        },
        {
            "title": "The Conflict of Technique and Human Nature",
            "datePublished": "Sun, 16 Jan 1949 09:00:00 +0000",
            "description": "The inaugural Reith Lecturer is the philosopher, mathematician, and social reformer Bertrand Russell. One of the founders of analytic philosophy and a Nobel Laureate, he is the author of Principia Mathematica, and the bestselling History of Western Philosophy, written in 1946. His Reith lecture series is entitled 'Authority and the Individual'. \n\nIn his fourth lecture, entitled 'The Conflict of Technique and Human Nature', he examines what part human nature has played in the development of civilised society, and argues that poverty, suffering and cruelty are no longer necessary to the existence of civilisation. He believes these can be eliminated with the help of modern science, provided it operates in a humane spirit, and with an understanding of the springs of happiness and life. ",
            "length": "27600000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02r5nfw.mp3"
        },
        {
            "title": "The Role of Individuality",
            "datePublished": "Sun, 09 Jan 1949 09:00:00 +0000",
            "description": "The inaugural Reith Lecturer is the philosopher, mathematician, and social reformer Bertrand Russell. One of the founders of analytic philosophy and a Nobel Laureate, he is the author of Principia Mathematica, and the bestselling History of Western Philosophy, written in 1946. His Reith lecture series is entitled 'Authority and the Individual'. \n\nIn his third lecture, entitled 'The Role of Individuality', he considers the importance of individual initiative to a community, and argues for flexibility, local autonomy, and less centralisation in society. Modern organisations, he says, must be more flexible and less oppressive to the human spirit if life is to be saved from boredom.",
            "length": "28064000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02r7t96.mp3"
        },
        {
            "title": "Social Cohesion and Government",
            "datePublished": "Sun, 02 Jan 1949 09:00:00 +0000",
            "description": "The inaugural Reith Lecturer is the philosopher, mathematician, and social reformer Bertrand Russell. One of the founders of analytic philosophy and a Nobel Laureate, he is the author of Principia Mathematica, and the bestselling History of Western Philosophy, written in 1946. His Reith lecture series is entitled 'Authority and the Individual'. \n\nIn his second lecture, entitled 'Social Cohesion and Government', he examines how forms of social cohesion have developed throughout history and considers the effects of increasing state control, as exemplified by Soviet Russia.",
            "length": "27808000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02r4gmc.mp3"
        },
        {
            "title": "Social Cohesion and Human Nature",
            "datePublished": "Fri, 24 Dec 1948 09:00:00 +0000",
            "description": "The inaugural Reith Lecturer is the philosopher, mathematician, and social reformer Bertrand Russell. One of the founders of analytic philosophy and a Nobel Laureate, Russell's pupils included Wittgenstein, and his most influential work, Principia Mathematica, set out to show how mathematics was grounded in logic. He also wrote On Denoting, one of the most significant philosophical essays of the 20th century, and the bestselling History of Western Philosophy, written in 1946. His Reith lecture series is entitled 'Authority and the Individual'. \n\nIn his first lecture, entitled 'Social Cohesion and Human Nature', Russell explores the role of impulses in human nature. He charts the way these impulses have manifested themselves throughout history, from very primitive communities through to more 'civilised' societies. ",
            "length": "26864000",
            "sourceUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p02r83pl.mp3"
        }
    ]
}