{
    "artwork": "http://is5.mzstatic.com/image/thumb/Music/v4/95/b0/78/95b078b5-67c9-e53c-a588-d6d46e9fc7b1/source/100x100bb.jpg",
    "description": "A typical episode of the HH podcast features interviews, commentary, news, and music. Notable guests have included Sir Salman Rushdie, Prof. Richard Dawkins, Sam Harris, Christopher Hitchens, E.O. Wilson, Alan Dershowitz, Neil deGrasse Tyson, Andy Rooney, Greg Graffin of Bad Religion, Holly Near, Dar Williams and Julia Sweeney.\nThe HH podcast is hosted and produced by Bo Bennett, PhD, from the American Humanist Association.",
    "feedURL": "http://feeds.feedburner.com/HNN_Podcast",
    "podcastURL": "http://www.americanhumanist.org/hnn/podcast",
    "publisher": "humanisthour@americanhumanist.org (American Humanist Association)",
    "title": "The Humanist Hour",
    "episodes": [
        {
            "title": "The Humanist Hour #218: Vickie Stangl on Etta Semple",
            "datePublished": "Wed, 09 Nov 2016 18:34:00 GMT",
            "description": "We act sometimes as though we think women are new to the freethought movement, to atheist and humanist leadership. We're not. We've been here all along, and we've never gone away. Our history has just sat in boxes, disregarded where it hasn't been thrown away altogether. Our stories have gone untold.\r\n\r\nThis week's guest, Vickie Stangl, did something about that. In her book, Etta Semple: Kansas Freethinker and \"Ideal\" Woman, she took that history out of the archives and made it live. Etta Semple was the founder of the Kansas Freethought Association and a leader of both that organization and the American Secular Union. She started the Freethought Idea newspaper to challenge the ideas of a nation and managed to do it so successfully that she received death threats and a probable attempt on her life.\r\n\r\nSemple is far too interesting to be lost to history. This week, Vickie Stangl joins Peggy Knudtson to talk about the book and about what we need to know to protect Semple's legacy.\r\n",
            "length": "0",
            "sourceUrl": "http://feedproxy.google.com/~r/HNN_Podcast/~5/cTUUeRMZalY/HH218.mp3"
        },
        {
            "title": "The Humanist Hour #217: Vic Wang and Benita Malone on Humanists of Houston",
            "datePublished": "Wed, 02 Nov 2016 13:41:00 GMT",
            "description": "The Humanists of Houston are American Humanist Association's largest local chapter and they're on pace to become the largest secular movement Meetup group very shortly. They've achieved that growth largely through reaching out to groups that we don't often see at humanist meetings, through executing strategies that some people try to tell us will drive people away.\r\n\r\nThis week, Vic Wang, president of Humanists of Houston, and Benita Malone, volunteer coordinator, join the Humanist Hour to talk about embracing diversity and social justice, making meetings and volunteer opportunities welcoming to younger members, implementing a code of conduct, and adopting a transparency that's radical for local groups.",
            "length": "0",
            "sourceUrl": "http://feedproxy.google.com/~r/HNN_Podcast/~5/9e_xG5mc3Ts/HH217.mp3"
        },
        {
            "title": "The Humanist Hour #216: Susan Jacoby on \"Strange Gods: A Secular History of Conversion\"",
            "datePublished": "Wed, 19 Oct 2016 13:39:00 GMT",
            "description": "We tend to think of the process of converting from one religion to another as a religious experience, but how much of that reflects the outlook of the people who usually talk about conversion? When author Susan Jacoby set out to explore conversion from the perspective of an atheist, she found, by contrast, that many if not most religious conversions are undertaken for frankly pragmatic reasons. From politics to position in society, she details many of the reasons people convert in her latest book, Strange Gods: A Secular History of Conversion.\r\n\r\nThis week, she joins Peggy Knudtson to talk about the book and what the current political season tells us about the influence of religion on the hearts, minds, and ballots of Americans.\r\n",
            "length": "0",
            "sourceUrl": "http://feedproxy.google.com/~r/HNN_Podcast/~5/m0PPDdY9OBU/HH216.mp3"
        },
        {
            "title": "The Humanist Hour #215: What Humanists Can Bring to Interfaith Dialogue?",
            "datePublished": "Wed, 12 Oct 2016 13:45:00 GMT",
            "description": "\"Interfaith\" is not a word that comes easily to all humanists. Even more difficult for some is the idea of partnering with religious leaders and believers to work together on the world's problems. However, a panel composed of humanist minister Rebecca Armstrong, past American Humanist Association president Mel Lipman, former AHA board member Paula Rochelle, and former AHA regional coordinator Ben Wade came together at the AHA's national conference in Chicago this past May to argue that we should. They tell us that interfaith work is both an opportunity and responsibility that at least some humanists should pick up. \r\n\r\nThis podcast features audio from that panel presentation.",
            "length": "0",
            "sourceUrl": "http://feedproxy.google.com/~r/HNN_Podcast/~5/uQ04YGvL1XQ/HH215.mp3"
        },
        {
            "title": "The Humanist Hour #214: Annie Laurie Gaylor on Anne Nicol Gaylor and FFRF",
            "datePublished": "Wed, 28 Sep 2016 13:48:00 GMT",
            "description": "If anyone in today's secular movement should require no introduction, it's Annie Laurie Gaylor, co-founder and now co-president of the Freedom From Religion Foundation (FFRF). Fresh off a speech this past weekend at the Women in Secularism conference about her mother, Anne Nicol Gaylor, Annie Laurie joins us to talk more about her mother's accomplishments. She talks to us about how feminism requires secularism and how FFRF is carrying on Anne Nicol's outspoken legacy.",
            "length": "0",
            "sourceUrl": "http://feedproxy.google.com/~r/HNN_Podcast/~5/QLrrC3ht4b4/HH214.mp3"
        },
        {
            "title": "The Humanist Hour #213: Growing Up Humanist",
            "datePublished": "Wed, 21 Sep 2016 13:38:00 GMT",
            "description": "Today's adolescent humanists in the U.S. aren't the first generation of young people to be raised in a nonreligious philosophy. They are, however, the largest in modern times here – and the demographic shift means the generations that follow will likely be even larger. That means it's time for us to pay attention to the challenges and opportunities faced by teenaged humanists.\r\n\r\nAt the American Humanist Association's annual conference in Chicago this past May, the AHA convened a panel of familiar names. At least the last names of the panelists were familiar. This was a new set of humanists, however, the teen-aged children of humanist leaders and other longtime humanists. They came together to discuss the challenges of being a minority among their religious peers, charting their own paths, and finding ways to live up to their humanitarian ideals. We're sharing audio from that panel this week.",
            "length": "0",
            "sourceUrl": "http://feedproxy.google.com/~r/HNN_Podcast/~5/7DWncV6SbS8/HH213.mp3"
        },
        {
            "title": "The Humanist Hour #212: Lauren Lane on Skepticon and Rethinking Conferences",
            "datePublished": "Wed, 14 Sep 2016 13:41:00 GMT",
            "description": "Skepticon is an unusual conference in several ways. It started as a student-run event that survived its founders' graduation. It's an independent event, run as its own nonprofit organization. It's a free conference and vows to remain that way. In any given year, roughly half its speakers are women. It's held in a smaller city in the middle of the country in a very religious area. It attracts a younger audience on average, many of whom bring their families. It blends religious skepticism with what proponents call scientific skepticism with a minimum of friction.\r\n\r\nIn short, Skepticon meets many of the demographic and other challenges the secular and skeptical movements have identified. It's no surprise, then, that it's the largest annual conference in either of these movements. \r\n\r\nThis week, we talk with Skepticon co-founder and president Lauren Lane about Skepticon's past and its future. We talk about its history of innovation, and what’s changing this year. Lauren will tell you what you can expect at this year's Skepticon, November 11-13, 2016. We'll also laugh rather a lot.",
            "length": "0",
            "sourceUrl": "http://feedproxy.google.com/~r/HNN_Podcast/~5/bh8FXkxfG_g/HH212.mp3"
        },
        {
            "title": "The Humanist Hour #211: Noelle George on Foundation Beyond Belief",
            "datePublished": "Wed, 07 Sep 2016 13:49:00 GMT",
            "description": "We like to say that we’re “good without a god,” but the fact of the matter is that we’re not always very organized about it. One of the good things organized religion has introduced to the world is ways to encourage giving and volunteering to help those in need. Foundation Beyond Belief is a secular nonprofit organization that provides a similar structure to help those of us who have left religion or who never had religion in the first place when we want to give.\r\n\r\nNoelle George is the executive director of Foundation Beyond Belief and the former head of the Beyond Belief Network, Foundation Beyond Belief's program that supports secular volunteers across the country. She joins us this week to discuss the history of the organization, its various programs, and how people can contribute time, money, or word of mouth to Foundation Beyond Belief. She also talks about the matching grant that American Humanist Association is offering this month to support the Humanist Service Corps' work in Ghana.",
            "length": "0",
            "sourceUrl": "http://feedproxy.google.com/~r/HNN_Podcast/~5/Bek0cGeAp1w/HH211.mp3"
        },
        {
            "title": "The Humanist Hour #210: Miri Mogilevsky on Sex Positivity and Teaching Consent",
            "datePublished": "Wed, 31 Aug 2016 14:21:00 GMT",
            "description": "Sex positivity sounds like a wonderful thing, but do you really know what it is? As a social movement, it's older than you might think. It can be traced back through the Free Love movement. No, not the one in the 1960s: the Victorian Free Love movement. In its more modern incarnation, sex positivity has been associated with LGBTQ liberation and the battles within feminism over pornography and sex work. It's also closely tied to movements to destigmatize kink and polyamory.\r\n\r\nWith all these associations, perhaps it shouldn't be surprising that not everyone agrees about what sex positivity is and what it looks like in practice. Sex positivity fills different roles for lots of people. And while, at its heart, sex positivity is an intellectual tradition, not everyone relates to it on an intellectual level. \r\n\r\nMiri Mogilevsky is a licensed therapist, a writer, and a long-time provider of sex education for adults. With articles having appeared in xoJane, Salon, and Everyday Feminism, she's a recognized resource on mental health, feminism, and consent. In recent years, she's offered a workshop at secular movement conferences titled, \"Getting It On at the Con: How to Get Lucky Consensually\". She's recently written about some of the common misperceptions about sex positivity, and she joins us this week to clear the air.\r\n\r\nOne note: This is a show about sex. While it doesn't get graphic, it may still be inappropriate for work for other reasons, such as the swearing.",
            "length": "0",
            "sourceUrl": "http://feedproxy.google.com/~r/HNN_Podcast/~5/BBjY1iKPNOw/HH210.mp3"
        },
        {
            "title": "The Humanist Hour #209: The Intersection of Humanism and Social Justice Work",
            "datePublished": "Wed, 24 Aug 2016 13:45:00 GMT",
            "description": "The concept of social justice is enjoying a renaissance. That doesn't necessarily translate into action, however. Even people who support social justice may find themselves uncertain how to put their principles into practice. They may be unsure what is needed from them.\r\n\r\nAt the American Humanist Association's 75th Anniversary Conference in Chicago this year, Sincere Kirabo, social justice coordinator of the AHA, moderated a panel on this problem. Diane Burkholder, co-founder of Kansas City Freethinkers of Color; James Croft, outreach director of the Ethical Society of St. Louis; and Randall Jenson, executive director of SocialScope Productions, a nonprofit focused on LGBTQ and gender documentary projects, discussed the practical impediments to social justice in the humanist movement and our broader society. They talked about the needs we don't see and the solutions that allow us to put our time and money where our mouths are.",
            "length": "0",
            "sourceUrl": "http://feedproxy.google.com/~r/HNN_Podcast/~5/BPDU4IM6xlM/HH209.mp3"
        },
        {
            "title": "The Humanist Hour #208: Juhem Navarro-Rivera on Changing Demographics and Changing Politics",
            "datePublished": "Wed, 17 Aug 2016 13:48:00 GMT",
            "description": "There is a significant portion of the U.S. electorate this year who seem determined to \"take back their country\". It's rare, however, that these people are willing to explicitly state who they want to take the country back from. In reality their political fears reflect a voting population that is less white, less male, and less religious than it has ever been before.\r\n\r\nJuhem Navarro-Rivera is a political scientist who studies the political behavior of many of the groups within this rising American electorate. He specializes in studying Latino voters and the religious Nones. This week, he joins Stephanie Zvan to talk about the concerns and behavior of these groups, as well as the concerns and behaviors of the largely white, male, and religious voters who are resisting their participation in the political process.",
            "length": "0",
            "sourceUrl": "http://feedproxy.google.com/~r/HNN_Podcast/~5/V4LNlUnDg-4/HH208.mp3"
        },
        {
            "title": "The Humanist Hour #207: Kelly McCullough on Building Religion through Stories",
            "datePublished": "Wed, 10 Aug 2016 13:56:00 GMT",
            "description": "Kelly McCullough is a fantasy and science fiction author with twelve novels under his belt to date. Despite being raised outside religion, his work often focuses on what it means to exist in a world where gods are real. In his WebMage series, McCullough’s protagonist is the descendent of one of the Greek Fates. His Fallen Blade series follows what happens when the goddess of justice is killed by the other gods in her pantheon.\r\n\r\nThis week, Kelly McCullough talks to Stephanie Zvan about why he explores the themes of religion in his books. He also talks about having accidentally created a religion outside his writing and how he managed to become one of those nearly mythical atheist politicians in the U.S.",
            "length": "0",
            "sourceUrl": "http://feedproxy.google.com/~r/HNN_Podcast/~5/1WSu1-cVOTA/HH207.mp3"
        },
        {
            "title": "The Humanist Hour #206: Alix Jules on the Politics of Racial Resentment",
            "datePublished": "Wed, 03 Aug 2016 13:50:00 GMT",
            "description": "The 2016 U.S. presidential election has turned into something that wasn't supposed to be able to happen anymore. We’re supposed to be past this kind of open racism, yet here we are. So much for living in a “post-racial” America.\r\n\r\nAlix Jules is a secular activist, writer, and sometimes co-host on Dogma Debate. He's also on the advisory council of American Humanist Association's Black Humanist Alliance. This week, he joins us to talk about the politics of racial resentment. We'll talk about Alix's visit to a Trump rally, but acknowledge that racial resentment reaches far beyond one party or candidate. We'll also discuss Alix's experience trying to talk about racial issues within the secular movement.\r\n\r\nPlease be aware that the final segment of the show contains mention of a racial slur.",
            "length": "0",
            "sourceUrl": "http://feedproxy.google.com/~r/HNN_Podcast/~5/zk1KF8C_1Lc/HH206.mp3"
        },
        {
            "title": "The Humanist Hour #205: Examining Honor Culture and Violence in Islam",
            "datePublished": "Wed, 27 Jul 2016 13:53:00 GMT",
            "description": "Earlier this month, model and activist Qandeel Baloch was found dead in her home in Pakistan. She'd been drugged and murdered by her brother in what he claimed was an honor killing. Baloch was a feminist and a pop star who didn't adhere to local Islamic modesty standards. Her brother claimed that this brought shame upon their family.\r\n\r\nBaloch's murder was more widely reported in the U.S. than most honor killings. Reactions to the news were varied but demonstrated a broad lack of understanding of the ways in which honor killings are distinct from domestic violence in more individualistic societies. This past May, Muhammad Syed, Sarah Haider, and Mya Saleem of the Ex-Muslims of North America explored those differences in a panel titled, \"Examining Honor Culture and Violence in Islam\" at the AHA’s 75th Anniversary Conference in Chicago. This week, we bring you that panel and part of the Q&A that followed. The full Q&A can be found on the video on the AHA’s YouTube channel.",
            "length": "0",
            "sourceUrl": "http://feedproxy.google.com/~r/HNN_Podcast/~5/7_OcW7SpPyk/HH205.mp3"
        },
        {
            "title": "The Humanist Hour #204: Callie Wright on the “Gaytheist Manifesto”",
            "datePublished": "Wed, 20 Jul 2016 13:52:00 GMT",
            "description": "When Callie Wright came out as a trans woman in 2013, there weren't a lot of queer voices in the secular movement that focused on issues affecting queer people. She set out to change that. With her partner in crime Ari Stillman, she now runs The Gaytheist Manifesto podcast and the blog of the same name. She is also co-chair of the American Humanist Association's LGBTQ Humanist Alliance.\r\n\r\nCallie joins Jenn Wilson this week to talk about founding the podcast and its mission to support the LGBTQ community within the secular movement. They discuss Callie's outlook on activism, her goals for the LGBTQ Humanist Alliance, and even a recent controversy in LGBTQ media representation. After we hear from Callie and Jenn, we'll also give you a quick sample of the work Callie does educating humanists at conferences.",
            "length": "0",
            "sourceUrl": "http://feedproxy.google.com/~r/HNN_Podcast/~5/A3gvi9NxPr0/HH204.mp3"
        },
        {
            "title": "The Humanist Hour #202: Amanda Marcotte on Feminist Topics in Current Politics",
            "datePublished": "Wed, 06 Jul 2016 13:53:00 GMT",
            "description": "Any year in which we have the first female major party presumptive nominee for president is going to be a busy one in feminist politics. Beyond Hillary Clinton, however, there's still plenty going on in current political discourse that's of interest to feminists. From the misogyny of Donald Trump to the recent Supreme Court decision on abortion, we have a lot to talk about.\r\n\r\nTo cover these topics—as well as Clinton's rise to nominee—Stephanie Zvan talks this week with Amanda Marcotte, a political writer for Salon with more than a decade of experience covering these kinds of topics. Listen and catch up on the presidential campaigns, online discourse, and the state of abortion rights.\r\n\r\n(Marcotte photo by Brian Engler)",
            "length": "0",
            "sourceUrl": "http://feedproxy.google.com/~r/HNN_Podcast/~5/JHysyaAlgTE/HH202.mp3"
        },
        {
            "title": "The Humanist Hour #201: David Niose & Monica Miller on the Appignani Humanist Legal Center",
            "datePublished": "Wed, 29 Jun 2016 13:39:00 GMT",
            "description": "This year, the American Humanist Association's Appignani Humanist Legal Center celebrates a decade of service. The center provides legal assistance to defend the constitutional rights of religious and secular minorities by directly challenging clear violations of the Establishment Clause and seeking equal rights for humanists, atheists and other freethinkers. Through a combination of staff and pro bono attorneys, the center engages in amicus activity, litigation, and other legal advocacy.\r\n\r\nThis May, at the American Humanist Association's annual conference, David Niose, legal director for the center, and Monica Miller, senior counsel, spoke about the center. They talked about its victories and challenges, and the cases in front of it today. \r\n\r\nTheir discussion is presented here for those interested in the mission of the Appignani Humanist Legal Center. It has been modified slightly for this format, and the question and answer period has been truncated. To hear the full Q&A, please watch the panel video on the American Humanist Association's YouTube channel.",
            "length": "0",
            "sourceUrl": "http://feedproxy.google.com/~r/HNN_Podcast/~5/elRGyRHH0Zc/HH201.mp3"
        },
        {
            "title": "The Humanist Hour #200: Women in Secularism & Secular Woman",
            "datePublished": "Wed, 22 Jun 2016 13:39:00 GMT",
            "description": "In spring of 2012, the secular movement was a different place for women. We were grossly underrepresented on stage, in print, and in the membership of our organizations. In a movement that prides itself on asking questions, the people asking why this under-representation was happening were being shouted down. The Center for Inquiry's (CFI) Women in Secularism conference in Washington, D.C. was created to address these problems. The brain child of Melody Hensley, the conference featured a weekend of only women speakers, and it changed the movement.\r\n\r\nThis week, Stephanie Zvan talks to Debbie Goddard, Director of Outreach at CFI and Director of African Americans for Humanism, about the history of the conference and what people can look forward to this year. Debbie is organizing the fourth Women in Secularism conference, taking place September 23–25, 2016.\r\n\r\nStephanie also talks with Monette Richards, president of CFI Northeast Ohio and co-president of Secular Woman, an organization that was born at the first Women in Secularism conference. We'll catch up on what it's been up to, as well as its hopes and plans for the future.",
            "length": "0",
            "sourceUrl": "http://feedproxy.google.com/~r/HNN_Podcast/~5/XpKCrj2SBrY/HH200.mp3"
        },
        {
            "title": "The Humanist Hour #199: Greta Christina on \"The Way of the Heathen\"",
            "datePublished": "Wed, 15 Jun 2016 13:37:00 GMT",
            "description": "\"So you're an atheist. Now what? The way we deal with life—with love and sex, pleasure and death, reality and making stuff up—can change dramatically when we stop believing in gods, souls, and afterlives. When we leave religion—or if we never had it in the first place—where do we go? With her unique blend of compassion and humor, thoughtfulness and snark, Greta Christina most emphatically does not propose a single path to a good atheist life. She offers questions to think about, ideas that may be useful, and encouragement to choose your own way. She addresses complex issues in an accessible, down-to-earth style, including: Why we're here, Sexual transcendence, How humanism helps with depression—except when it doesn’t, Stealing stuff from religion, and much more. Aimed at new and not-so-new atheists, questioning and curious believers, Christina shines a warm, fresh light on the only life we have.\"\r\n\r\nThat's the publisher's blurb for Greta Christina's new book, The Way of the Heathen: Practicing Atheism in Everyday Life. This book is a distillation of more than a decade of thinking and writing about atheism. Greta joins us on this week's show to talk with Peggy Knudtson and Jenn Wilson about how the book came to be and why she's been wanting to write this particular one for so long.",
            "length": "0",
            "sourceUrl": "http://feedproxy.google.com/~r/HNN_Podcast/~5/C3UgckvAt_M/HH199.mp3"
        },
        {
            "title": "The Humanist Hour #198: Humanist Alliance Advisor Interviews, Part 1",
            "datePublished": "Wed, 08 Jun 2016 13:49:00 GMT",
            "description": "Just before the American Humanist Association's 75th Anniversary Conference a couple of weeks ago, the organization announced that it was launching a new Black Humanist Alliance and the revamped and revitalized Feminist Humanist Alliance and LGBTQ Humanist Alliance. Stephanie Zvan caught up with several alliance advisory council members at and after the conference. In this show, we bring you the first of those interviews.\r\n\r\nAndy Semler is a trans nonbinary activist working in rural Indiana. They are a new member of the LGBTQ Humanist Alliance with a special interest in homelessness in the trans community. \r\n\r\nHeina Dadabhoy is a nonbinary writer and speaker who is new to organizational secular activism. They are part of the Feminist Humanist Alliance, looking forward to broadening our ideas on reproductive justice.\r\n\r\nDiane Burkholder is an HIV and Black Lives Matter activist out of Kansas City. She's one of the new co-chairs of the LGBTQ Humanist Alliance, working to get us looking past marriage equality.",
            "length": "0",
            "sourceUrl": "http://feedproxy.google.com/~r/HNN_Podcast/~5/ojnzuWhofQM/HH198.mp3"
        },
        {
            "title": "The Humanist Hour #197: Josiah Mannion and Baba Brinkman on Art and Activism",
            "datePublished": "Wed, 01 Jun 2016 13:33:00 GMT",
            "description": "Art has the potential to reach people in ways no simple argument can. As such, it's always been harnessed for activist pursuits. From design that adds impact to a message, to providing the sugar coating on an educational pill, to telling us stories we need to hear – activism needs art. Humanist activism is no exception. On this week's show, we talk to two artists whose art exists for far more than art's sake.\r\n\r\nStephanie Zvan talks to Josiah Mannion about his photography and his motto, \"I take pictures of humans. This is my Humanism.\" Later, Kim Ellington talks with Baba Brinkman about his album \"The Rap Guide to Religion\" and about having his work peer-reviewed by scientists.\r\n\r\n(Photo of Josiah courtesy of Lindsey Ford)",
            "length": "0",
            "sourceUrl": "http://feedproxy.google.com/~r/HNN_Podcast/~5/b3uYvPUt8j4/HH197.mp3"
        },
        {
            "title": "The Humanist Hour #196: HB2, The Public Facilities Privacy & Security Act",
            "datePublished": "Wed, 25 May 2016 13:50:00 GMT",
            "description": "Of all the recent \"religious freedom\" legislation passed around the country, perhaps none is so restrictive as North Carolina's \"Act to Provide for Single-sex Multiple Occupancy Bathroom and Changing Facilities in Schools and Public Agencies and to Create Statewide Consistency in Regulation of Employment and Public Accommodations\". The short version of the bill's name is the \"Public Facilities Privacy & Security Act,\" but it quickly became infamous as HB2. \r\n\r\nPassed as a response to a non-discrimination ordinance enacted by the city of Charlotte, HB2 removed the protections under that law and others like it, attempted to redefine \"sex\" under the law, and barred transgender people from using restrooms on state property that conform to their gender. The legal and economic consequences to North Carolina were swift, but so far, neither the legislature nor the governor shows any willingness to overturn the bill.\r\n\r\nOn this week's show, Jenn Wilson and Peggy Knudtson talk to Chris Brook, Legal Director of the American Civil Liberties Union of North Carolina, about the ACLU's suit against the state. Peggy Knudtson and Stephanie Zvan also speak with Danielle White, a transgender activist engaging in civil disobedience against HB2.",
            "length": "0",
            "sourceUrl": "http://feedproxy.google.com/~r/HNN_Podcast/~5/aiuffoMqwzg/HH196.mp3"
        },
        {
            "title": "The Humanist Hour #195: David Cobb on Corporate Personhood",
            "datePublished": "Wed, 18 May 2016 13:32:00 GMT",
            "description": "David Cobb is a lawyer and co-founder of Move to Amend, a coalition dedicated to winning a constitutional amendment to firmly establish that money is not speech, and that human beings, not corporations, are persons entitled to constitutional rights. He has sued corporate polluters, lobbied elected officials, run for political office himself, and been arrested for non-violent civil disobedience. He believes we must use every tool available to effect the systemic social change we so desperately need. In 2002, David ran for Attorney General of Texas, pledging to use the office to revoke the charters of corporations that repeatedly violate health, safety, and environmental laws. In 2004, he ran for President of the United States on the Green Party ticket and successfully campaigned for the Ohio recount.\r\n\r\nAt the AHA’s 2015 Annual Conference in Denver, David discussed the legal doctrine of \"corporate constitutional rights\" and the idea that money should be treated as speech. He contended that these illegitimate, irrational, court-created concepts have allowed a small ruling elite to hijack the social, political, and economic institutions of this country. He described the growing efforts of Move to Amend, a multi-racial, multi-ethnic, intergenerational mass movement demanding a constitutional amendment to abolish these doctrines. David also made the case that humanists are uniquely positioned to attack and discredit these concepts. He provided concrete ways members of the AHA might get involved as individuals or through their existing local chapters.\r\n\r\nIn this week's show, we bring you the audio from David's speech to introduce him and his ideas to a broader audience.\r\n",
            "length": "0",
            "sourceUrl": "http://feedproxy.google.com/~r/HNN_Podcast/~5/W9vb1qkbDwU/HH195.mp3"
        },
        {
            "title": "The Humanist Hour #194: American Humanist Association’s 75th Anniversary Conference",
            "datePublished": "Wed, 04 May 2016 13:28:00 GMT",
            "description": "This year is a special one for the American Humanist Association – it marks 75 years since our founding. To celebrate, our annual conference returns to the AHA's original home of Chicago this May 26–29 with lots to do for everyone.\r\n\r\nIn addition to being AHA's Director of Development and Communications, Maggie Ardiente also organizes AHA's annual conference. She took time this week out of her busy schedule to talk to us about the history of the conference, what attendees can expect, how to make the most of your conference experience, and the kinds of political considerations that go into creating a conference like this. ",
            "length": "0",
            "sourceUrl": "http://feedproxy.google.com/~r/HNN_Podcast/~5/_mQBmY4Ml6I/HH194.mp3"
        },
        {
            "title": "The Humanist Hour #193: Carrie Poppy and Ross Blocher",
            "datePublished": "Wed, 20 Apr 2016 13:41:00 GMT",
            "description": "\"We show up so you don't have to.\"\r\n\r\nThat's the tagline for the Oh No, Ross and Carrie podcast. If you've ever wanted to get out and experience all the world's weirdness for yourself, this podcast might not be for you. If, however, you've been dying to have other people put themselves through that and then tell you about it, you're in the right place. Skeptics Ross Blocher and Carrie Poppy are ready to experience it all (or almost all) for you and share all the best stories afterward.\r\n\r\nOn this week's Humanist Hour, Carrie and Ross join us to talk about how they got started, the roles compassion and honesty play in their skepticism, and a few of their favorite episodes. They also tell us just what they are and aren't willing to do for an episode.",
            "length": "0",
            "sourceUrl": "http://feedproxy.google.com/~r/HNN_Podcast/~5/APawV_Xeij8/HH193.mp3"
        },
        {
            "title": "The Humanist Hour #192: The Humanism of Star Trek, with Susan Sackett & Scott Lohman",
            "datePublished": "Wed, 06 Apr 2016 13:42:00 GMT",
            "description": "Gene Roddenberry was openly humanist, and his best-known creation, Star Trek, reflects his views in many ways. Our guests this week talk about how Star Trek informed their humanism and how they use the show to educate others about humanism.\r\n\r\nSusan Sackett became Roddenberry's executive assistant in the mid-1970s and a humanist shortly thereafter. She contributed story ideas for two episodes of Star Trek: The Next Generation and worked with Roddenberry until his death. She joins us to talk about her career with Roddenberry, working with some of the Star Trek original series actors, and her career in humanism after Roddenberry's death. Sackett also serves on the AHA Board of Directors.\r\n\r\nScott Lohman is the former president of the Humanists of Minnesota and a self-professed “serious geek.” He runs Diversicon, a science fiction convention in Minnesota, and gives presentations on humanist principles using examples from Star Trek. He joins us to talk about teaching Star Trek to children at Camp Quest.",
            "length": "0",
            "sourceUrl": "http://feedproxy.google.com/~r/HNN_Podcast/~5/PD6DchTcNWU/HH192.mp3"
        },
        {
            "title": "The Humanist Hour #191: Sincere Kirabo on Building Social Justice",
            "datePublished": "Wed, 23 Mar 2016 13:32:00 GMT",
            "description": "Over the past year or so, the American Humanist Association has been making changes to reflect its commitment to social justice. These changes can be found in the pages of The Humanist magazine and the words of its leaders. Change can also be found more recently in the announcement that Sincere Kirabo would be stepping into the role of the AHA's social justice coordinator.\r\n\r\nThis week, we welcome Sincere back to the show. He speaks with Peggy Knudtson and Jenn Wilson about his new role, what social justice and intersectionality mean, and the ways that social media can be used to further the cause of social justice.",
            "length": "0",
            "sourceUrl": "http://feedproxy.google.com/~r/HNN_Podcast/~5/5RbNNO1zYTk/HH191.mp3"
        },
        {
            "title": "The Humanist Hour #190: Getting \"SciCurious\" with Bethany Brookshire",
            "datePublished": "Wed, 09 Mar 2016 14:53:00 GMT",
            "description": "On this week's show, Stephanie Zvan interviews Dr. Bethany \"SciCurious\" Brookshire about effective strategies for convincing people of scientific truths, the common mistakes we make when we set out to teach people about science. Brookshire recently co-edited Science Blogging: The Essential Guide.\r\n\r\nFor nearly a decade, former neuroscientist Dr. Bethany Brookshire has been writing about science for online audiences. Best known to science-blogging fans as \"SciCurious,\" Dr. Brookshire writes about – among other topics – neurotransmitters (the chemicals that make our brains run), evaluating scientific results in context, rats in tiny pants, and duck penises. You can't forget the duck penises.",
            "length": "0",
            "sourceUrl": "http://feedproxy.google.com/~r/HNN_Podcast/~5/E5E1aOdaryk/HH190.mp3"
        },
        {
            "title": "The Humanist Hour #189: Justin Scott on Interviewing Presidential Candidates",
            "datePublished": "Wed, 24 Feb 2016 14:31:00 GMT",
            "description": "In this week's show, Stephanie Zvan introduces interviewer Peggy Knudtson, and Peggy and Jenn Wilson talk to Justin Scott about his work to get politicians on record on the separation of church and state.\r\n\r\nAs an Iowan, activist, and atheist, Justin Scott has had a unique opportunity to represent nontheists in the political process. The timing of the Iowa caucuses means that 2016 presidential candidates spend a lot of time answering questions from average citizens, and Scott has used this opportunity to press the candidates on church-state separation and issues of religious privilege. His YouTube videos of the candidate's answers have propelled the debate over religion in the public sphere into the headlines.",
            "length": "0",
            "sourceUrl": "http://feedproxy.google.com/~r/HNN_Podcast/~5/JkCe-pfsTfc/HH189.mp3"
        },
        {
            "title": "The Humanist Hour #188: Black Nonbelievers: The Author's Circle",
            "datePublished": "Wed, 10 Feb 2016 14:53:00 GMT",
            "description": "In this episode, Jenn Wilson introduces our new producer, Stephanie Zvan, and Kim Ellington talks to Frank Edwards, Ronald F. Murphy, Cheryl Abram, and Darrell Smith – authors who presented at the Black Nonbelievers fifth anniversary celebration in Atlanta last month.\r\n\r\nOn January 16, 2016, Black Nonbelievers from all over gathered together in Atlanta to celebrate the organization’s five year anniversary. One of the day's panels focused on black atheist and humanist authors. Kim Ellington attended the anniversary celebration and took the opportunity to talk to these panelists. \r\n\r\n---\r\n\r\nFrank Edwards is the author of the Jupiter Strong series, books designed for children and parents. The focus of this series was to showcase images of African people in dignifying terms and rebuild family values. From our series, children will learn critical thinking skills, self love, communal responsibility and have fun doing it!\r\n\r\n---\r\n\r\nRonald F. Murphy, one of three children born to Raymond and Catherine Murphy, was raised in the quiet town of Maplewood, New Jersey. Having parents as educators, his upbringing was layered with the clichéd notions that education is the key to a better future, and moreover a necessity for acceptance in our modern society. Thus, it was Mr. Murphy’s inquisitive nature and desire for learning that bred in him a healthy skepticism and ultimately led to his pragmatic search for answers to life’s biggest questions.\r\n\r\n---\r\n\r\nCheryl Abram was born in 1975 in Houma, Louisiana. She is a mother of four and currently lives in Northern Virginia. A graduate of the Catholic University of America in Washington D.C. she holds a Master's degree in Social Work and a Master's of Science in Quality Systems Management. A life-long learner, Cheryl is an Army veteran working as a learning and development specialist in a federal government agency in Washington DC. Firing God is Cheryl's memoir of her \"leap of doubt\" that led her to fire God.\r\n\r\n---\r\n\r\nDarrell Smith is an educator, author, writer, lecturer, and atheist advocate. When he came out atheist to his children, they told him he couldn't be an atheist because there were no black atheist. You Are Not Alone was Darrell's answer to that charge.",
            "length": "0",
            "sourceUrl": "http://feedproxy.google.com/~r/HNN_Podcast/~5/C9vd8UShT9o/HH188.mp3"
        },
        {
            "title": "The Humanist Hour #187: Critically Thinking About the Self-Help Genre",
            "datePublished": "Wed, 27 Jan 2016 14:47:00 GMT",
            "description": "In this episode, Bo Bennett has a conversation with Dr. Michael Britt about the genre of books and programs known as “self-help,” a roughly $11 billion industry. As Bo says, the self-help movement is not much different from many religious movements, and, like many religions, self-help does have some good things to offer. The key is to be knowledgeable in this area and to think critically.\r\n\r\nBo’s guest, Michael Britt, has a Ph.D. in psychology from The State University of New York at Albany (specialization in social and industrial/organizational psychology). He is an adjunct professor in psychology and runs the most popular psychology podcast, The Psych Files.\r\n",
            "length": "0",
            "sourceUrl": "http://feedproxy.google.com/~r/HNN_Podcast/~5/0Q-sntAX6ns/HH187.mp3"
        },
        {
            "title": "The Humanist Hour #186: Mark Smith on Secular Faith: How Culture Has Trumped Religion in American Politics",
            "datePublished": "Wed, 20 Jan 2016 14:52:00 GMT",
            "description": "In this episode, Kim Ellington welcomes new Humanist Hour co-host Jenn Wilson to the podcast and they both speak with author Dr. Mark Smith about his new book, \"Secular Faith: How Culture Has Trumped Religion in American Politics.\"\r\n\r\nMark A. Smith provocatively argues that religion is not nearly the unchanging conservative influence in American politics that we have come to think it is. In fact, in the long run, religion is best understood as responding to changing political and cultural values rather than shaping them. Smith makes his case by charting five contentious issues in America’s history: slavery, divorce, homosexuality, abortion, and women’s rights. For each, he shows how the political views of even the most conservative Christians evolved in the same direction as the rest of society—perhaps not as swiftly, but always on the same arc. During periods of cultural transition, Christian leaders do resist prevailing values and behaviors, but those same leaders inevitably acquiesce—often by reinterpreting the Bible—if their positions become no longer tenable. Secular ideas and influences thereby shape the ways Christians read and interpret their scriptures.",
            "length": "0",
            "sourceUrl": "http://feedproxy.google.com/~r/HNN_Podcast/~5/boYovF8Yjgs/HH186.mp3"
        },
        {
            "title": "The Humanist Hour #185: The Sociology of Religion, with Dr. Ryan T. Cragun",
            "datePublished": "Wed, 13 Jan 2016 14:38:00 GMT",
            "description": "In this episode, Bo Bennett and Kim Ellington speak with Associate Professor of Sociology Ryan T. Cragun about the sociology of religion. Are religious people more generous than the non-religious? Smarter? Better looking? (Actually, we don’t ask that last one)\r\n\r\nRyan T. Cragun is a husband, father, and sociologist of religion (in order of importance). Originally from Utah, he now lives in Florida and works at the University of Tampa. His research and writing focuses on religion, with an emphasis on Mormonism and the nonreligious. His research has been published in a variety of academic journals, including: Journal for the Scientific Study of Religion, Sociology of Religion, Nova Religio, Journal of Religion and Health, and Journal of Contemporary Religion. When he's not working, he's spending time with his wife and son, watching science fiction, hiking, playing soccer, or tinkering with FOSS, Gnu/Linux, or computer hardware.\r\n\r\nCragun is the author of two books: What You Don’t Know About Religion (but Should) (2013), and How to Defeat Religion in 10 Easy Steps: A Toolkit for Secular Activists (2015).",
            "length": "0",
            "sourceUrl": "http://feedproxy.google.com/~r/HNN_Podcast/~5/eXhmrVivjgU/HH185.mp3"
        },
        {
            "title": "The Humanist Hour #184: White Nights, Black Paradise, with Dr. Sikivu Hutchinson",
            "datePublished": "Wed, 06 Jan 2016 14:54:00 GMT",
            "description": "In this episode, Kim Ellington speaks with author and activist Dr. Sikivu Hutchinson about her latest book, \"White Nights, Black Paradise\", and the state of race in America today. Later, Peggy Knudtson speaks with Dr. Richard Carrier about the “evidence” of miracles.\r\n\r\nDr. Sikivu Hutchinson is an American feminist, atheist and author. She is the author of \"Godless Americana: Race and Religious Rebels\" (2013), \"Moral Combat: Black Atheists, Gender Politics, and the Values Wars\" (2011), and \"Imagining Transit: Race, Gender, and Transportation Politics in Los Angeles (Travel Writing Across the Disciplines)\" (2003). Moral Combat is the first book on atheism to be published by an African-American woman. In 2013 she was named Secular Woman of the year.\r\n\r\nDr. Richard Carrier is a world-renowned author and speaker. As a professional historian, published philosopher, and prominent defender of the American freethought movement, Dr. Carrier has appeared across the U.S., Canada and the U.K., and on American television and London radio, defending sound historical methods and the ethical worldview of secular naturalism. \r\n",
            "length": "0",
            "sourceUrl": "http://feedproxy.google.com/~r/HNN_Podcast/~5/I6r1yXjUejI/HH184.mp3"
        },
        {
            "title": "The Humanist Hour #183: Dr. Dan Everett—Don’t Sleep, There Are Snakes",
            "datePublished": "Tue, 29 Dec 2015 21:29:00 GMT",
            "description": "In this episode, Bo Bennett and Peggy Knudtson speak with author Dr. Daniel Everett. Dr. Everett is an American author and academic best known for his study of the Amazon Basin's Pirahã people and their language. He serves as Dean of Arts and Sciences at Bentley University in Waltham, Massachusetts.\r\n\r\nDaniel L. (Dan) Everett holds a ScD and a Masters of Linguistics from the Universidade Estadual in Campinas (UNICAMP), both based upon years of field research among the Pirahã people of the Brazilian Amazon jungle. He taught as an instructor and later Assistant Professor at UNI-CAMP, 1981-1986, until leaving Brazil to return to the USA. He next was appointed full professor of linguistics and anthropology at the University of Pittsburgh, where he also chaired the Department of Linguistics until 1999. At that time, Dan moved to the Amazon to live the majority of the next three years in the jungle among the Pirahãs. He left the jungle when the University of Manchester, England, offered him the position of Professor of Phonetics and Phonology. ",
            "length": "0",
            "sourceUrl": "http://feedproxy.google.com/~r/HNN_Podcast/~5/2P8lqoQkcBk/HH183.mp3"
        },
        {
            "title": "The Humanist Hour #182: Secular Comedy with Stewart Huff",
            "datePublished": "Wed, 23 Dec 2015 14:00:00 GMT",
            "description": "In this episode, Bo Bennett and Peggy Knudtson speak with comedian Stewart Huff about the joys and pains of performing liberal, secular comedy across the country, especially in places that aren’t so, well… liberal or secular.\r\n\r\nStewart Huff was born in Campbellsville, Kentucky and grew up in Knoxville, Tennessee. He has been performing comedy for over 15 years, beginning when he decided to drop out of college to become a writer. Currently touring theatres, comedy clubs and special events across the country, Huff reaches past the norm for his genuine — and genuinely unexpected — comedy. His knack for embracing the foibles of humanity and his refreshing originality make him as likeable as he is hilarious. A storyteller at heart, Huff continues to amaze with his clever material and personal wit.\r\n\r\nHuff has performed in comedy clubs nationally and internationally, including the Improv in Los Angeles and New York, the Punchline in Atlanta and the Funny Bone in Omaha, as well as countless others.\r\n\r\nA finalist in the 2006 Boston Comedy Festival, Huff was also invited to perform in the HBO Las Vegas Festival, where his act can be viewed on pay-per-view.\r\n\r\nHe currently lives in Atlanta, Georgia with his girlfriend. There he drops off the various items he collects while on the road, including an antique barber chair, countless vintage photographs, and an extensive collection of LP’s. She likes this.\r\n\r\nHe is featured in the documentary Road Comics: Big Work on Small Stages, which was released in Fall 2009.",
            "length": "0",
            "sourceUrl": "http://feedproxy.google.com/~r/HNN_Podcast/~5/8T5nJXqk3RA/HH182.mp3"
        },
        {
            "title": "The Humanist Hour #181: Atheist Meditation and Spirituality, with Mark W. Gura",
            "datePublished": "Wed, 16 Dec 2015 14:33:00 GMT",
            "description": "In this episode, Bo Bennett and Kim Ellington speak with Mark W. Gura, a Secular Buddhist, humanist, and freethinker. They talk about a “woo-free” version of mediation and spirituality. \r\n\r\nMark W. Gura has more than 20 years of experience in practicing mindfulness meditation. He is the Executive Director of the nonprofit Association of Mindfulness Meditation and Secular Buddhism. He is also an atheist, humanist, freethinker and practitioner of vipassana, a mindfulness meditation technique that was developed more than 2,500 years ago and does not require faith in gurus, religion, God(s), or the supernatural.",
            "length": "0",
            "sourceUrl": "http://feedproxy.google.com/~r/HNN_Podcast/~5/aZdsAsWOuXk/HH181.mp3"
        },
        {
            "title": "The Humanist Hour #180: Everybody is Wrong About God, with Dr. James A. Lindsay",
            "datePublished": "Wed, 09 Dec 2015 14:31:00 GMT",
            "description": "In this episode, Bo Bennett and Peggy Knudtson speak with author James A, Lindsay about his new book, Everybody is Wrong About God. Later, Kim Ellington speaks with Derek Colanduno, director of the Skeptical track at DragonCon.\r\n\r\nJames A. Lindsay is an author and outspoken atheist voice who holds degrees in physics and mathematics, including a doctorate in the latter. Motivated by a love of knowledge and learning, along with his life experience of growing up and living in the Southeastern United States--on the buckle of the Bible Belt, as they say--he writes and speaks in an attempt to clarify our religious and cultural landscape and by doing so to help heal the related harms.",
            "length": "0",
            "sourceUrl": "http://feedproxy.google.com/~r/HNN_Podcast/~5/Y2UVuq0r1OE/HH180.mp3"
        },
        {
            "title": "The Humanist Hour #179: The Myths that Stole Christmas, with Dr. David Kyle Johnson",
            "datePublished": "Wed, 02 Dec 2015 14:38:00 GMT",
            "description": "In this episode, Bo Bennett and Kim Ellington interview Dr. David Kyle Johnson about his new book, \"The Myths that Stole Christmas: Seven Misconceptions that Hijacked the Holiday (and How We Can Take It Back)\". Later, Humanist Hour correspondent Patty Traynor interviews Kevin Davis, executive director of Young Skeptics.\r\n\r\nDr. David Kyle Johnson is an associate professor of philosophy at King’s College in Wilkes-Barre, Pennsylvania, and is also a professor for The Great Courses. His courses include Exploring Metaphysics (2014) and The Big Questions of Philosophy (2016). In addition to being the author of The Myths that Stole Christmas, he also blogs for Psychology Today, has written and edited extensively for Wiley-Blackwell’s Philosophy and Pop Culture series, and has a popular Authors@Google talk on the movie Inception. He has published work in journals such as Religious Studies, Sophia, Philo, Think, and Science, Religion and Culture regarding metaphysics and philosophy of religion.\r\n\r\nKevin Davis is the head writer and editor at DividedUnderGod.com, and the author of \"Understanding an Atheist: A Practical Guide to Relating to Nonbelievers\", a book aimed at improving relationships between the religious and their atheist loved ones.",
            "length": "0",
            "sourceUrl": "http://feedproxy.google.com/~r/HNN_Podcast/~5/JXX4tgDuGuk/HH179.mp3"
        },
        {
            "title": "The Humanist Hour #178: Dr. Abby Hafer on Unintelligent Design",
            "datePublished": "Wed, 25 Nov 2015 14:38:00 GMT",
            "description": "In this episode, Bo Bennett speaks with Dr. Abby Hafer live, in studio, about her new book, \"The Not-So-Intelligent Designer: Why Evolution Explains the Human Body and Intelligent Design Does Not.\"\r\n\r\nDr. Hafer is a speaker, writer, and humorist who particularly loves taking about Intelligent Design & Creationism, the politics surrounding them, and science denialism in general.\r\n\r\nA few years ago she realized that Intelligent Design is a political pressure group, not a scientific issue. With this figured out, she realized that what we need are political-style arguments in defense of evolution. Her presentations contain bulletproof science, and she uses humor to puncture bad arguments. Crucial questions are raised, such as, “Why do men's testicles have such a bad location?” and, “Who does God like better, us—or squid?” She finds that once she mentions testicles, everybody pays attention.\r\n\r\nDr. Hafer has given talks at the American Humanist Association’s Annual Conferences in 2009 and 2011, and at the American Atheists' 50th Anniversary Conference in 2013. She has a doctorate in zoology from Oxford University, and teaches human anatomy and physiology at Curry College in Milton, MA.",
            "length": "0",
            "sourceUrl": "http://feedproxy.google.com/~r/HNN_Podcast/~5/tV8xbW73GXM/HH178.mp3"
        },
        {
            "title": "The Humanist Hour #177: Amanda Knief on America's \"Right to Know\" and the \"Atheist Voter\"",
            "datePublished": "Wed, 18 Nov 2015 14:33:00 GMT",
            "description": "In this episode, Bo Bennett and Kim Ellington interview Amanda Knief, the National Legal and Public Policy Director for American Atheists, touching on several issues relating to law and politics. Later, correspondent Gina James interviews Joe Dougherty about the militarization of American law enforcement and the psychological effect it can have on police officers and civilians.\r\n\r\nAmanda Knief is a public policy and constitutional expert on religious freedom and civil liberties. She is the author of The Citizen Lobbyist: A How-to Manual for Making Your Voice Heard in Government. Knief has a JD from Drake University Law School and a BS in journalism and science communication from Iowa State University. She has previously worked as a legal counsel and legislative drafter for the Iowa Legislature and the lobbyist for the Secular Coalition for America. Currently, she serves as the National Legal and Public Policy Director for American Atheists, where she directs policy advocacy, legal strategy, and serves and In-House Counsel.",
            "length": "0",
            "sourceUrl": "http://feedproxy.google.com/~r/HNN_Podcast/~5/kqIQ9DBoWEE/HH177.mp3"
        },
        {
            "title": "The Humanist Hour #176: LIVE at FREEFLO 2015!",
            "datePublished": "Tue, 10 Nov 2015 20:05:00 GMT",
            "description": "In this episode, Bo Bennett teams up with guest co-host Peggy Knudtson at FREEFLO in Orlando, Florida for a live Humanist Hour recording. They begin with Woo Jeopardy, featuring an all-star panel of contestants including Matt Dillahunty, Seth Andrews, and Sarah Morehead. Keep listening for a religious jokes contest followed by a “wackiest beliefs” contest!\r\n\r\nFREEFLO is the annual conference of the Florida Humanist Association.",
            "length": "0",
            "sourceUrl": "http://feedproxy.google.com/~r/HNN_Podcast/~5/w17cgmzvXsg/HH176.mp3"
        },
        {
            "title": "The Humanist Hour #175: The “Regressive Left” and Safe Spaces, with Dr. Peter Boghossian",
            "datePublished": "Wed, 04 Nov 2015 14:40:00 GMT",
            "description": "In this episode, Bo Bennett and Kim Ellington speak with Dr. Peter Boghossian about the “Regressive Left,” safe spaces, trigger warnings, and what appears to be an alarming change in American university culture.\r\n\r\nDr. Peter Boghossian’s main focus is bringing the tools of professional philosophers to people in a wide variety of contexts. Peter has a teaching pedigree spanning more than 20 years and 30 thousand students – in prisons, hospitals, public and private schools, seminaries, colleges and universities, Fortune 100 companies, and small businesses. His fundamental objective is to teach people how to think through what often seem to be intractable problems.\r\n\r\nDr. Boghossian’s primary research areas are critical thinking and moral reasoning. His doctoral research studies, funded by the State of Oregon and supported by the Oregon Department of Corrections, consisted of using the Socratic method to help prison inmates to increase their critical thinking and moral reasoning abilities and to increase their desistance to criminal behavior. \r\n",
            "length": "0",
            "sourceUrl": "http://feedproxy.google.com/~r/HNN_Podcast/~5/6nkAdC2FXYo/HH175.mp3"
        },
        {
            "title": "The Humanist Hour #174: Good Thinking, with Guy P. Harrison",
            "datePublished": "Wed, 28 Oct 2015 13:42:00 GMT",
            "description": "In this episode, Bo Bennett speaks with Guy P. Harrison about his latest book, Good Thinking: What You Need to Know to be Smarter, Safer, Wealthier, and Wiser. Later, Peggy Knudtson speaks with Dr. Jeffrey Jarman at The Skeptics of Oz conference about the art and science of debate.\r\n\r\nGuy P. Harrison has held numerous positions in the news industry, including editorial writer, world news editor, sports editor, photographer, page designer, and columnist. He is a veteran travel writer, having visited and written about more than 25 countries on five continents. He has also had some very rewarding jobs teaching history and science to bright kids.Guy holds a degree in history and anthropology from the University of South Florida. He has won many awards for his writing, including the World Health Organization Award for Health Reporting and the Commonwealth Media Award for Excellence in Journalism.\r\n\r\nDr. Jeffrey Jarman teaches courses in strategic communications at Wichita State University’s Elliott School of Communication, including communication analysis and criticism, argumentation and advocacy, and various seminars on political communication.",
            "length": "0",
            "sourceUrl": "http://feedproxy.google.com/~r/HNN_Podcast/~5/V0EZrVxFRaI/HH174.mp3"
        },
        {
            "title": "The Humanist Hour #173: Chris Shelton Talks Scientology",
            "datePublished": "Wed, 21 Oct 2015 13:40:00 GMT",
            "description": "In this episode, Peggy Knudtson speaks with former scientologist Chris Shelton at The Skeptics of Oz conference. Later, correspondent Jenn Wilson speaks with Dr. John Hawks, one of the lead scientists on the Rising Star Expedition, about the practice of open science and how it has benefited this work.\r\n\r\nChris Shelton used to be a Scientologist and got himself out of that situation in late 2013. As part of his road out of that mess, he discovered skepticism and the whole subject of critical thinking. It was an epiphany for Chris and a very important step on his road to recovery. No one wants to think that they were duped or made a fool of, and no one wants to think that they could be so easily deceived. Once he started learning about logic and reason, he made it his mission in life to spread this new “gospel” so as to help others in their lives.\r\n\r\nJohn Hawks is an associate professor of anthropology at the University of Wisconsin–Madison. He also is the author of a widely read paleoanthropology blog.",
            "length": "0",
            "sourceUrl": "http://feedproxy.google.com/~r/HNN_Podcast/~5/5edt3N922QQ/HH173.mp3"
        },
        {
            "title": "The Humanist Hour #172: The History of Humanism & a Primer on Ethics, with Michael Werner",
            "datePublished": "Wed, 14 Oct 2015 13:40:00 GMT",
            "description": "In this episode, Bo Bennett interviews Michael Werner about the history of humanism and dis-cuss ethics from a secular perspective. Werner is a cofounder of SMART Recovery, a past president of the American Humanist Association, and currently a member of the AHA chapter Humanists and Freethinkers of Cape Fear.\r\n\r\nLater, Humanist Hour contributor Ron Steelman interviews Ron Flannery on artificial intelligence.",
            "length": "0",
            "sourceUrl": "http://feedproxy.google.com/~r/HNN_Podcast/~5/iMhUWZkQcyo/HH172.mp3"
        },
        {
            "title": "The Humanist Hour #171: Disaster Capitalism: Making a Killing out of Catastrophe, with Antony Lowenstein",
            "datePublished": "Wed, 07 Oct 2015 13:27:00 GMT",
            "description": "In this episode, Bo Bennett speaks with author and journalist Antony Lowenstein about his latest book, Disaster Capitalism, dealing with a broken political system in need of fixing.\r\n\r\nAntony Loewenstein is an Australian independent freelance journalist, author, documentarian and blogger. He has written for the The Guardian, Washington Post, New Statesman, Al Jazeera, Huffington Post, The Daily Star, Le Monde Diplomatique English, Foreign Policy, The National, Al Akhbar English, Dawn, Haaretz, The Nation, New Internationalist, Sydney Morning Herald, The Australian, BBC World Service, Adbusters, Al Masry Alyoum, Juan Cole, Mondoweiss, Tehelka, Sydney’s Sun-Herald, New Zealand Herald, Sydney Ideas Quarterly, The Australian Financial Review, Crikey, Melbourne’s Age, Brisbane’s Courier Mail, Canberra Times, Online Opinion, New Matilda, The Conversation, ABC Unleashed/The Drum, Amnesty International Australia, Green Left Weekly, Eureka Street, Kill Your Darlings, Tikkun, Adelaide’s Advertiser, The Bulletin, Znet, Overland, Sydney PEN, The Big Issue, Counterpunch and many others.",
            "length": "0",
            "sourceUrl": "http://feedproxy.google.com/~r/HNN_Podcast/~5/ww9eG270nfA/HH171.mp3"
        },
        {
            "title": "The Humanist Hour #170: Live at the Harvard Humanist Hub: A Better Life, with Chris Johnson",
            "datePublished": "Wed, 30 Sep 2015 13:35:00 GMT",
            "description": "In this episode, Chris Johnson, author of the book A Better Life and producer of the movie with the same title, talks about his experience creating these works and what it means to have “a better life.”\r\n\r\nChris is a New York-based photographer and filmmaker. He received his undergraduate degree in film production (along with a minor in religious studies) from Concordia University in Montreal, Quebec. His photography has been seen in various outlets, including The New York Times. He has spent the last three years working on A Better Life, traveling across the United States, Canada, the UK, Ireland, and other countries. Apart from his own film and photographic work, he has also collaborated with artists and directors in various roles and capacities from assistant director and stage manager, for theatre, film, and print.\r\n\r\nFor the book and film of A Better Life, he interviewed many prominent atheist figures such as Richard Dawkins, Steven Pinker, Dan Dennett, Derren Brown, Pat Churchland, Julia Sweeney, Penn & Teller, and many more. He has given talks on atheism and his work at the Humanist Community at Harvard, New York Society for Ethical Culture, PA State Atheist/Humanist Conference, Sunday Assembly - New York, the Atheist Community of Austin, Freedom from Religion Foundation Annual Conference, and more. In addition, he has also been a guest on various podcasts and TV shows such as The Humanist Hour, Atheist Airwaves, The Phil Ferguson Show, The Atheist Experience, and Pivot TV’s TakePart Live.",
            "length": "0",
            "sourceUrl": "http://feedproxy.google.com/~r/HNN_Podcast/~5/Tgf2IMxpP7Q/HH170.mp3"
        },
        {
            "title": "The Humanist Hour #169: How to Defend the Christian Faith – Advice from an Atheist, with John Loftus",
            "datePublished": "Wed, 23 Sep 2015 13:40:00 GMT",
            "description": "In this episode, Bo Bennett and Kim Ellington speak with author John Loftus about his new book, How to Defend the Christian Faith: Advice from an Atheist – the first book on Christian apologetics written by a leading atheist figure that teaches Christians the best and worst arguments for defending their faith against attack.\r\n\r\nFrom Amazon.com: \r\n\r\nThe Christian faith has been vigorously defended with a variety of philosophical, historical, and theological arguments, but many of the arguments used in an earlier age no longer resonate in today’s educated West. Where has apologetics gone wrong? What is the best response to the growing challenge presented by scientific discovery and naturalistic thought? Unlike every work on Christian apologetics that has come before, How to De-fend the Christian Faith is the first one written by an atheist for Christians. As a former Christian defender who is now a leading atheist thinker, John Loftus answers these questions and more. He tells would-be apologists how to train properly, where to study, what to study, what issues they should concern themselves with, and how poorly the professors who currently train them practice their craft. In the process, he shows readers why Christian apologists have failed to reach the intelligent nonbeliever. For those Christian apologists who think this book will provide a secret formula to convert the nonbelieving mass-es, be warned: as an exposé of the present state of Christian apologetics, it can just as easily be used by atheists to refute apologetic arguments. Thus, this book presents both an opportunity and a challenge to Christians: they must either change how apologetics is done, or quit doing apologetics altogether.",
            "length": "0",
            "sourceUrl": "http://feedproxy.google.com/~r/HNN_Podcast/~5/t6JrsNjU79E/HH169.mp3"
        },
        {
            "title": "The Humanist Hour #168: The Story of God, with Chris Matheson",
            "datePublished": "Wed, 16 Sep 2015 13:34:00 GMT",
            "description": "In this episode, Bo Bennett speaks with writer Chris Matheson about his book, \"The Story of God: A Biblical Comedy about Love (and Hate).\"\r\n\r\nFrom Amazon.com: \r\n\r\nThe Bible offers some clues to God’s personality—he’s alternately been called vindictive and just, bloodthirsty and caring, all-powerful and impotent, capricious and foresighted, and loving and hateful. But no one has ever fully explored why God might be such a figure of contrasts. Nor has anyone ever satisfactorily explained what guides his relationship not just with angels, the devil, and his son, but also with all of creation. Might he be completely misunderstood, a mystery even to himself? Might his behavior and actions toward humankind tell us much more about him than it does about us? Enter the mind of the creator of the universe, travel with him through the heavenly highs and hellish lows of his story, from Genesis to Revelation, to better understand his burdensome journey: being God isn’t easy. After hearing his story—at times troubling and tragic but always hilarious in its absurdity and divine in its comedy—you’ll never look at a miracle or catastrophe—or at our place in the universe, or God’s—the same way again.\r\n",
            "length": "0",
            "sourceUrl": "http://feedproxy.google.com/~r/HNN_Podcast/~5/HmcvwycR6rQ/HH168.mp3"
        },
        {
            "title": "The Humanist Hour #167: Bo and Kim Chat about DragonCon, The Reason Rally, and GMOs!",
            "datePublished": "Wed, 09 Sep 2015 13:36:00 GMT",
            "description": "In this episode, Bo Bennett and Kim Ellington have a casual chat about several topics: some fun, some exciting, and some that can have a significant impact on humanity. Listen in and enjoy!",
            "length": "0",
            "sourceUrl": "http://feedproxy.google.com/~r/HNN_Podcast/~5/lUUnTz4j_Qg/HH167.mp3"
        },
        {
            "title": "The Humanist Hour #166: Exploring Humanism through Science Fiction, with Scott Burdick",
            "datePublished": "Wed, 02 Sep 2015 13:44:00 GMT",
            "description": "In this episode, Bo Bennett and Kim Ellington speak with world-renowned artist and humanist science fiction author Scott Burdick about how his travels led him to a humanistic world view, and how his latest science-fiction novel, Nihala, explores many humanistic issues.\r\n\r\nScott’s bio from Amazon.com: \r\n\r\nScott Burdick studied art at Chicago's American Academy of Art and then film and writing at Chicago's Columbia College, where his short story \"Fear\" was published in the Hair Trigger anthology while a student. Burdick subsequently illustrated covers for TSR's Dungeon and Dragon magazines, as well as working on the development team for Dreamworks' animated feature film, Spirit (uncredited).\r\n\r\nUnsatisfied with the prospect of living in Chicago or LA and working for others, Scott and his wife, fellow artist Susan Lyon, moved to rural NC in the foothills of the Appalachian mountains, as a home base between traveling extensively across the world--researching many cultures and indigenous tribes for his artworks, novels, and short stories.\r\n\r\nBurdick's paintings are widely shown in galleries and museums across the country, and he's directed three independent documentaries on religion--In God we Trust?, Sophia Investigates the Good News Club, and In Reason We Trust, (featuring Richard Dawkins, Adam Savage of Myth Busters, Eddie Izzard, Dan Barker, Annie Laurie Gaylor, Lawrence Krause, Greg Graffin of the band Bad Religion, and a dozen other prominent free-thinkers from the 2012 Reason Rally in Washington DC.)\r\n\r\nMany of the themes of his films overlap those of his novels--religion, science, philosophy, the direction of technology, and morality.\r\n\r\nNihala description from Amazon.com: \r\n\r\nSteven Hawking recently warned that artificial intelligence poses an existential threat to the human species. And yet, how to stop such a singularity without halting scientific advancement itself? Some claim that humanity should abandon the enslavement of technology altogether for a return to nature and a way of life more in sync with our psychological needs. But who is to say exactly how much technology is too much? And who will ensure none crosses some arbitrary line of demarcation?\r\n\r\nKayla Nighthawk, crippled and orphaned from birth, has been raised in the theocratic society of Potemia. Hundreds of years have passed since the Neo-Luddite War cut Potemia off from the rest of mankind. The Founder predicted that sciencecraft would destroy those on the Outside, but what if the pursuit of scientific advancement has created wonders beyond imagining? Will Kayla risk leaving her homeland in search of the forbidden knowledge that might cure her—even at the cost her immortal soul?\r\n\r\nThrough a series of dialogues with the strange creatures she encounters, Kayla’s religious convictions come under attack. Her search for the divine, an absolute basis for morality, and the meaning of existence itself becomes a matter of life or death for Kayla—as well as for all of humanity.\r\n\r\nThis is the history of the next millennia. An epic tale of technology and the backlash against it. A journey of war, love, revenge, and heartbreak—a philosophical adventure story. ",
            "length": "0",
            "sourceUrl": "http://feedproxy.google.com/~r/HNN_Podcast/~5/FJ9xAQjjWFs/HH166.mp3"
        },
        {
            "title": "The Humanist Hour #165: Humanistic Considerations in the Digital Age, with Derek Ellington",
            "datePublished": "Wed, 26 Aug 2015 13:40:00 GMT",
            "description": "In this episode, Kim Ellington speaks with Certified Forensic Examiner Derek Ellington on a host of issues in the digital age including the recent hack of online dating/affair service Ashley Madison. What should parents be aware of in the digital age? What should we all be aware of?\r\n\r\nDerek Ellington is a Certified Forensic Examiner with over twenty years of IT experience and over ten years of forensic experience. He is a court-recognized expert witness and regularly testifies in varying courts and jurisdictions. He conducts seminars and trainings, and is a contributor to family law and legal publications on the subject of digital forensics.",
            "length": "0",
            "sourceUrl": "http://feedproxy.google.com/~r/HNN_Podcast/~5/CaZxHSECLcw/HH165.mp3"
        },
        {
            "title": "The Humanist Hour #164: Sacred Cows, with Seth Andrews",
            "datePublished": "Wed, 19 Aug 2015 13:34:00 GMT",
            "description": "In this episode, Bo Bennett speaks with author Seth Andrews about his latest book Sacred Cows:  A Lighthearted Look at Belief and Tradition Around the World. “[I]nto the 21st century, our species continues to participate in beliefs and customs that seem more suited to the Bronze Age than the Information Age, some of which involve poisonous snakes, holy smoke, urine bubbles, crystals, tarot cards, aliens, costumed virgins and, of course, an offering plate.”\r\n\r\nA Christian of 30 years and former religious broadcaster, Seth Andrews ultimately found himself dissatisfied with the explanations and doctrines of scripture and the church. His search for answers let him to reject, completely, Christianity and all other religions, and Seth now hosts one of the largest online atheist communities in the world, The Thinking Atheist.\r\n\r\nHis \"everyman\" approach and skills as a broadcaster and video producer have brought, literally, millions into the conversation regarding religious beliefs and the benefits/damage they do in the name of their respective deities, especially in regard to the indoctrination of children.\r\n\r\nThe Thinking Atheist is on YouTube, Facebook, Twitter and BlogTalkRadio.",
            "length": "0",
            "sourceUrl": "http://feedproxy.google.com/~r/HNN_Podcast/~5/GWET_LxVA4c/HH164.mp3"
        },
        {
            "title": "The Humanist Hour #163: Back to School Advice for Humanist Students, Parents, and Teachers, with David Niose",
            "datePublished": "Wed, 12 Aug 2015 13:29:00 GMT",
            "description": "In this episode, Bo Bennett speaks with AHA Legal Director David Niose about many of the issues humanist students can face in public school, and more importantly, what can be done about these issues.\r\n\r\nDavid Niose's background includes experience in law and mass communication. Having practiced law in Massachusetts since 1990, Niose has also worked in print and broadcast media, taught both history and law, and written extensively on a wide array of issues. Upon joining the AHA board in 2005, Niose initiated and helped develop the AHA's media campaign.\r\n\r\nNiose has appeared in national media and spoken to groups around the country, emphasizing the importance of utilizing mass media to inject humanist ideas into the public dialogue, improve the public image of humanists, and sway public opinion away from the religious right.\r\n\r\nAs an attorney, Niose has advocated for church/state separation and the rights of humanists and other nontheists, and he is currently involved in implementing a legal strategy to enforce the rights of humanists and other nontheists via the avenue of equal protection law. He has worked with the Secular Coalition for America in various positions to help advocate for the rights of Secular Americans, and has served on the boards of Greater Worcester Humanists and Greater Boston Humanists.",
            "length": "0",
            "sourceUrl": "http://feedproxy.google.com/~r/HNN_Podcast/~5/bDfLf_kGH8c/HH163.mp3"
        },
        {
            "title": "The Humanist Hour #162: Lessons on Race, Atheism, and White Privilege, with Greg Epstein",
            "datePublished": "Wed, 05 Aug 2015 13:45:00 GMT",
            "description": "In this episode, Bo Bennett speaks with Greg Epstein, Humanist Chaplain at Harvard University and Executive Director of the Humanist Hub, about his recent article in Salon, \"Ta-Nehisi Coates woke me up: Lessons on race, atheism, and white privilege\".\r\n\r\nFrom HumanistHub.org: \r\n\r\nGreg M. Epstein serves as the Humanist Chaplain at Harvard University, and is author of the New York Times Bestselling book, Good Without God: What a Billion Nonreligious People Do Believe. He sits on the executive committee of the 36-member corps Harvard Chaplains. In 2005 he received ordination as a Humanist Rabbi from the International Institute for Secular Humanistic Judaism, where he studied in Jerusalem and Michigan for five years.",
            "length": "0",
            "sourceUrl": "http://feedproxy.google.com/~r/HNN_Podcast/~5/erqw3d5pxZI/HH162.mp3"
        },
        {
            "title": "The Humanist Hour #161: On the Historicity of Jesus, with Dr. Richard Carrier",
            "datePublished": "Wed, 29 Jul 2015 13:41:00 GMT",
            "description": "In this episode, Kim Ellington speaks with Dr. Richard Carrier about the historicity of Jesus. They discuss the fine line between history, philosophy, and science and why Jesus was more likely just a literary figure than a real person.\r\n\r\nFrom Dr. Carrier’s website: \r\n\r\nRichard Carrier is a world-renowned author and speaker. As a professional historian, published philosopher, and prominent defender of the American freethought movement, Dr. Carrier has appeared across the U.S., Canada and the U.K., and on American television and London radio, defending sound historical methods and the ethical worldview of secular naturalism. His books and articles have received international attention. With a Ph.D. from Columbia University in ancient history, he specializes in the intellectual history of Greece and Rome, particularly ancient philosophy, religion, and science, with emphasis on the origins of Christianity and the use and progress of science under the Roman empire. He is also a published expert in the modern philosophy of naturalism as a worldview. He is the author of On the Historicity of Jesus, Proving History, Sense and Goodness without God, Not the Impossible Faith, Why I Am Not a Christian, and Hitler Homer Bible Christ, and a contributor to The Empty Tomb, The Christian Delusion, The End of Christianity, and Christianity Is Not Great, as well as copious work in history and philosophy, online and in print. He is currently working on several upcoming projects, but also teaching affordable online courses in secular philosophy, history, and methodology at Partners for Secular Activism, and blogging and speaking about history, philosophy, feminism, and other moral causes, as well as his past in the military and his current life in polyamory. ",
            "length": "0",
            "sourceUrl": "http://feedproxy.google.com/~r/HNN_Podcast/~5/RPjF1JUzim8/HH161.mp3"
        },
        {
            "title": "The Humanist Hour #160: The Art of Debate, with Matt Dillahunty",
            "datePublished": "Wed, 22 Jul 2015 07:02:00 GMT",
            "description": "In this episode, Bo Bennett speaks with Matt Dillahunty, host of the Atheist Experience cable access television show broadcast from Austin, Texas. The discussion covers many aspects of debate and common Christian argument, along with some suggestions on how to respond and how not to respond.\r\n\r\nFrom The Atheist Experience website: \r\n\r\nI was raised in a loving, Southern Baptist home and was a fundamentalist Christian for over 20 years. After 8 years in the Navy and several years in the hi-tech game, I set out to re-affirm my faith with designs on attending seminary and continuing with a life in the ministry. What began as an attempt to bolster my faith became a continuing investigation into more topics than I ever suspected I'd enjoy.\r\n\r\nAfter the first couple of years, reason forced me to acknowledge that my faith had not only been weakened by my studies - it had been utterly destroyed. The thoughts, writings and wisdom of people like; Robert Ingersoll, Voltaire, Dan Barker, Richard Dawkins, Farrell Till and many others, helped free my mind from the shackles of religion without a single moment of despair. I continue to study philosophy, religion, science, history and the many other topics which have helped me to understand reality and enjoy my life.\r\n\r\nHaving spent the majority of my life compartmentalizing my religious beliefs to keep them safe from skepticism, it's thrilling to leave the critical, investigative, hungry portion of my brain turned \"on\". While my own pursuit of knowledge is a powerful driving force in my life, I'd also like to prevent others from wasting another day on irrational beliefs. Education is the key ...and if my work manages to educate even one person, I'm satisfied.\r\n\r\nAnyone interested in reading further is encouraged to visit the counter-apologetics encyclopedia, Iron Chariots (wiki.ironchariots.org). Russell Glasser and I started the wiki and we encourage others to help us build it into a great resource for anyone interested in apologetics and theological debate.",
            "length": "0",
            "sourceUrl": "http://feedproxy.google.com/~r/HNN_Podcast/~5/A7ifHxNLmds/HH160.mp3"
        },
        {
            "title": "The Humanist Hour #159: The Failed War on Drugs, with Johann Hari",
            "datePublished": "Wed, 15 Jul 2015 14:06:00 GMT",
            "description": "In this episode, Bo Bennett speaks with author and journalist Johann Hari about the failed war on drugs, its history, and a proposed solution that has been tested. Hari’s new book, \"Chasing the Scream,\" explores the war on drugs through the stories of people across the world whose lives have been transformed by this war.\r\n\r\nFrom ChasingTheScream.com:\r\n \r\nJohann Hari is a British journalist. He has written for many of the world’s leading newspapers and magazines, including the New York Times, Le Monde, the Guardian, the Los Angeles Times, the New Republic, Nation, Slate, El Mundo, and the Sydney Morning Herald. He was a lead op-ed columnist for the Independent, one of Britain’s leading newspapers, for nine years.\r\n\r\nHe was born in 1979 in Glasgow, Scotland, and has lived in London since he was a baby. His mother is from the Scottish tenements and his father is from the Swiss mountains. He graduated from King’s College, Cambridge with a double first in Social and Political Sciences in 2001.\r\n\r\nJohann was named ‘National Newspaper Journalist of the Year’ by Amnesty International twice. He was named ‘Environmental Commentator of the Year’ at the Editorial Intelligence awards, and ‘Gay Journalist of the Year’ at the Stonewall awards. He has also won the Martha Gellhorn Prize for political writing.\r\n\r\nHe is currently working on his next book, and he is a Visiting Fellow with Purpose, the New York-based progressive campaigning group.",
            "length": "0",
            "sourceUrl": "http://feedproxy.google.com/~r/HNN_Podcast/~5/jQfx_UrMwzs/HH159.mp3"
        },
        {
            "title": "The Humanist Hour #158: Neuroscience and the Science of Self, with Dr. Ginger Campbell",
            "datePublished": "Wed, 08 Jul 2015 13:44:00 GMT",
            "description": "In this episode, Bo Bennett speaks with Dr. Ginger Campbell, host of the Brain Science Podcast, about neuroscience and the many issues that science can shed light on such as the concepts of self, freewill, belief, consciousness, morality, and others.\r\n\r\nDr. Campbell is an experienced emergency physician with a long-standing interest in mind-body medicine, the brain, and consciousness. She is also interested in a wide variety of other topics including the history of science and ideas. She began podcasting in 2006 and has discovered that it is a great way to share ideas with people from around the world.\r\n\r\nIn July 2014, Dr. Campbell left emergency medicine to begin a Fellowship in Palliative Care at the University of Alabama School of Medicine. She has continued to produce her Brain Science Podcast fairly regularly.\r\n\r\nIn May, Dr. Campbell spoke at the 2015 American Humanist Association Annual Conference in Denver, CO, delivering a talk on “What Every Humanist Needs to Know about Palliative Care.” ",
            "length": "0",
            "sourceUrl": "http://feedproxy.google.com/~r/HNN_Podcast/~5/up9T5RxPWNw/HH158.mp3"
        },
        {
            "title": "The Humanist Hour #157: Interview an Atheist at Church Day, with Kile Jones",
            "datePublished": "Wed, 01 Jul 2015 13:42:00 GMT",
            "description": "In this episode, Bo Bennett speaks with Kile Jones, creator of the “Interview an Atheist at Church Day” project. Listen as they discuss what the project is about & why it is needed, and marvel as Bo channels his inner preacher by conducting a “mock interview” with Kile, who demonstrates what it is like to be an atheist in church.\r\n\r\nFrom Kile’s website: \r\n\r\nInterview an Atheist at Church Day is a project created by Kile Jones, a Ph.D student at Claremont Lincoln University, an inter-religious school to train ministers. Kile is an atheist who is interested in helping liberal religious people work together with unbelieving communities for the betterment of society.\r\n\r\nInterview an Atheist at Church Day is a community project aimed at bettering the under-standing between atheists and religious persons. We hope to connect atheists who are willing to be interviewed with congregations in their area that are interested in developing ties with atheists in their area. The “day” represents our desire to grow into something far-reaching and beneficial to atheists and churchgoers alike.\r\n\r\nAs unbelieving populations around the world continue to rise, dialogue and understanding between atheists and people of faith is more important than ever. We live and work in the same world: understanding better what both unites and divides religious and non-religious people can only help us make this world a better place.",
            "length": "0",
            "sourceUrl": "http://feedproxy.google.com/~r/HNN_Podcast/~5/j7qgwMBMNmY/HH157.mp3"
        },
        {
            "title": "The Humanist Hour #156: Creating Change Through Humanism, with Roy Speckhardt",
            "datePublished": "Wed, 24 Jun 2015 13:52:00 GMT",
            "description": "In this episode, Bo Bennett speaks with American Humanist Association Executive Director Roy Speckhardt about his brand new book, \"Creating Change Through Humanism\". Bo also speaks briefly with AHA Legal Director David Niose about his article in Psychology Today exploring anti-intellectualism and how it can be seen as a major factor in the recent church shooting tragedy.\r\n\r\nAbout Roy: \r\n\r\nRoy Speckhardt has served as the executive director of the American Humanist Association since 2005. He is a frequent media commentator who has appeared on Good Morning America, CNN Headline News, Fox News, and National Public Radio, among others. He writes a regular column for The Huffington Post and has written for Patheos, Washington Post's On Faith, and other publications. He has spoken at universities from Stanford to Oxford, and given speeches at national conferences across the United States. Speckhardt holds a Masters in Business Administration from George Mason University and a Bachelor of Arts in sociology from Mary Washington College.",
            "length": "0",
            "sourceUrl": "http://feedproxy.google.com/~r/HNN_Podcast/~5/Kx6evmXgkmQ/HH156.mp3"
        },
        {
            "title": "The Humanist Hour #155: On Being Certain, with Dr. Robert Burton",
            "datePublished": "Wed, 17 Jun 2015 13:33:00 GMT",
            "description": "In this episode, Bo Bennett speaks with neurologist Dr. Robert Burton about what it means (or doesn’t mean) to be \"certain.\" Wars have been fought and people murdered because people are claim certainty about \"what they feel is right,\" whether that be following a god's commands or simply following a passionate and convincing human leader.\r\n\r\nDr. Robert Burton graduated from Yale University and the University of California, San Francisco’s School of Medicine, where he also completed his neurology residency. At age thirty-three, he was appointed chief of the Division of Neurology at Mt. Zion-UCSF Hospital, where he subsequently became Associate Chief of the Department of Neurosciences. His writings include \"On Being Certain: Believing You Are Right Even When You're Not,\" three critically acclaimed novels and a neuroscience and culture column at Salon.com, \"Mind Reader\" (2008-2009). He lives in the San Francisco Bay Area. His new book, \"A Skeptic's Guide to the Mind; What Neuroscience Can and Cannot Tell Us About Ourselves,\" is now available. ",
            "length": "0",
            "sourceUrl": "http://feedproxy.google.com/~r/HNN_Podcast/~5/M8SkIefGIrQ/HH155.mp3"
        },
        {
            "title": "The Humanist Hour #154: Humanistic Psychology, with Dr. Tom Greening",
            "datePublished": "Wed, 10 Jun 2015 13:33:00 GMT",
            "description": "In this episode, Bo Bennett speaks with Dr. Tom Greening about Humanistic Psychology: how it differs from modern day humanism, its origins, its relationship to positive psychology and the self-help movement, and much more.\r\n\r\nDr. Greening received his B.A. from Yale University, spent a year in Vienna on a Fulbright Fellowship, and attended graduate school at the University of Michigan, receiving his Ph.D. in 1958. ",
            "length": "0",
            "sourceUrl": "http://feedproxy.google.com/~r/HNN_Podcast/~5/nbLwfzCyBuI/HH154.mp3"
        },
        {
            "title": "The Humanist Hour #153: 2015 AHA Annual Conference Interviews, Part II",
            "datePublished": "Wed, 03 Jun 2015 13:21:00 GMT",
            "description": "In this special extended episode,  we hear from several humanists on a variety of humanist issues. Listen as Kim Ellington interviews Andy Norman, Teresa MacBain, Sheila Malcolm, Richard Howse, Jason Torpy, Roland Halpern, Kelley Freeman, and Ed Gogol.",
            "length": "0",
            "sourceUrl": "http://feedproxy.google.com/~r/HNN_Podcast/~5/zqJtZQ6AtR0/HH153.mp3"
        },
        {
            "title": "The Humanist Hour #152: 2015 AHA Annual Conference Interviews, Part I",
            "datePublished": "Wed, 27 May 2015 14:11:00 GMT",
            "description": "In this special hour and a half episode, we hear from several humanists on a variety of issues covered this past May 7-10 at the AHA’s 74th Annual Conference in Denver, CO. Listen as Kim Ellington interviews Gretta Vosper, Kevin Jagoe, Steve Hill, Joe Brady, Dr. Calvin and Tonda Kelly, Stephanie Downs Hughes, Juhem Navarro-Rivera, and Bishop McNeil.",
            "length": "0",
            "sourceUrl": "http://feedproxy.google.com/~r/HNN_Podcast/~5/DpqTlShFk2I/HH152.mp3"
        },
        {
            "title": "The Humanist Hour #151: Soul Beliefs, with Dan Ogilvie",
            "datePublished": "Wed, 20 May 2015 13:28:00 GMT",
            "description": "In this episode, Bo Bennett and Kim Ellington speak with Professor Dan Ogilvie about the concept of the soul and how to teach this concept to both secular and religious students. \r\n\r\nAfter 45 years of teaching, Dan has been engaged in removing the wraps from the topic of soul and afterlife beliefs. He is a personality and social psychologist who formed a partnership with his brain scientist colleague, Leonard Hamilton, and together the two have been exploring the riches of a new field of inquiry. The topic of soul and afterlife beliefs provides an easy entrance into the disciplines of psychology, history, philosophy, brain evolution, child development, cognitive development, anthropology, religion, mythology, and other fields of inquiry. \r\n\r\nAbout Dan’s course (from coursera.org): \r\n\r\nThroughout history, the vast majority of people around the globe have believed they have, however defined, a “soul.” While the question of whether the soul exists cannot be answered by science, what we can study are the causes and consequences of various beliefs about the soul and its prospects of surviving the death of the body. Why are soul and afterlife beliefs so common in human history? Are there adaptive advantages to assuming souls exist?  Are there brain structures that have been shaped by environmental pressures that provide the foundation of body/mind dualism that is such a prominent feature of many religions? How do these beliefs shape the worldviews of different cultures and our collective lives? What is the role of competing afterlife beliefs in religion, science, politics, and war? This course explores several facets of this relatively unexplored but profoundly important aspect of human thought and behavior. ",
            "length": "0",
            "sourceUrl": "http://feedproxy.google.com/~r/HNN_Podcast/~5/T79ukMezPSk/HH151.mp3"
        },
        {
            "title": "The Humanist Hour #150: On Being Openly Secular, with John Davidson",
            "datePublished": "Wed, 13 May 2015 14:02:00 GMT",
            "description": "In this episode, Bo Bennett interviews singer, actor, and gameshow host John Davidson on being openly secular. They discuss Davidson’s decades-spanning career, religion, and how he manages to still be so good looking in his seventies.\r\n\r\nFrom Wikipedia: \r\n\r\nDavidson was born to two Baptist ministers in Pittsburgh, Pennsylvania and graduated from high school in White Plains, New York before entering Denison University. His boyish good looks, broad smile, and telegenic charm gained him entry to such television venues as sitcoms, game shows, variety shows, and talk shows. He is perhaps best known for hosting 1980–84's \"That's Incredible!\", a human interest/stunt-themed series created in the tradition of the 1950s television show \"You Asked for It\".",
            "length": "0",
            "sourceUrl": "http://feedproxy.google.com/~r/HNN_Podcast/~5/xXe1_Ei2EoA/HH150.mp3"
        },
        {
            "title": "The Humanist Hour #149: Feminism, Religion, and Science Communication, with Matthew Facciani",
            "datePublished": "Wed, 06 May 2015 13:39:00 GMT",
            "description": "In this episode, Bo Bennett answers some listener feedback about critical thinking and interviews humanist Matthew Facciani about his activism & research in the areas of feminism, religion, and science communication. \r\n\r\nFrom Matt’s website: \r\n\r\nMatthew Facciani is a PhD candidate in cognitive neuroscience at the University of South Carolina. He completed his undergraduate education at Westminster College, PA receiv-ing a B.A. in Psychology with honors. Facciani has done research on neuroimaging methods and is currently studying the themes of race, class, and gender in comic books. His dissertation will be on the neuroscience of religiosity.  He is also an instructor at the University of South Carolina where he teaches psychological statistics. \r\n\r\nFacciani's writing has been featured on Faith Street, The Good Men Project, The Feminist Observer, Patheos, Skeptical Raptor, Feministing, Secular Nation, and others which are linked in the writing section of this site. \r\n\r\nAs for activism, Facciani is involved with various organizations and projects which pro-mote gender equality and religious tolerance. Facciani also travels around the country to give talks about gender equality and the psychology of religious belief.\r\n\r\nOnce Facciani finishes his PhD, he plans to complete a post-doctoral fellowship furthering his cognitive neuroscience research and become a college professor and science communicator.",
            "length": "0",
            "sourceUrl": "http://feedproxy.google.com/~r/HNN_Podcast/~5/MSkT32bzNEI/HH149.mp3"
        },
        {
            "title": "The Humanist Hour #148: Addiction Education and SMART Recovery with Drs. Joe Gerstein and Bill Abbott",
            "datePublished": "Wed, 29 Apr 2015 13:26:00 GMT",
            "description": "In this episode, Bo Bennett speaks with Drs. Joe Gerstein and Bill Abbott about a secular approach to addiction education and recovery via the SMART Recovery® program.\r\n\r\nFrom SmartRecovery.org:\r\n\r\nSMART Recovery® is the leading self-empowering addiction recovery support group. Our participants learn tools for addiction recovery based on the latest scientific research and participate in a world-wide community which includes free, self-empowering, secular and science-based, mutual-help support groups.\r\n\r\nSMART Recovery® helps people recover from all types of addiction and addictive behaviors, including: alcoholism, drug abuse, drug addiction, substance abuse, alcohol abuse, gambling ad-diction, cocaine addiction, and addiction to other substances and activities.\r\n\r\nSMART Recovery sponsors face-to-face meetings around the world, and daily online meetings. In addition, our online message board and 24/7 chat room are excellent forums to learn about SMART Recovery and obtain addiction recovery support.",
            "length": "0",
            "sourceUrl": "http://feedproxy.google.com/~r/HNN_Podcast/~5/sOabHE9iIYA/HH148.mp3"
        },
        {
            "title": "The Humanist Hour #147: Critical Thinking and Anti-Intellectualism, with Dr. Michael Britt",
            "datePublished": "Wed, 22 Apr 2015 13:18:00 GMT",
            "description": "In this episode, Bo Bennett speaks with Dr. Michael Britt, host of The Psych Files podcast. Listen as they discuss critical thinking and anti-intellectualism--—why it’s a problem, examples, and what we can do about it.\r\n\r\nDr. Britt has a Ph.D. in psychology from The State University of New York at Albany (with a specialization in social and industrial/organizational psychology), and a B.A. in Psychology from Marist College in Poughkeepsie, NY. He attended L’Ecole des Psychologues Praticiens in Paris, France.\r\n\r\nDr. Britt taught psychology at Marist for 10 years at the graduate and undergraduate level. He currently runs B & E Productions, LLC – a mobile app and social media firm – from his home in Rhinebeck, NY.",
            "length": "0",
            "sourceUrl": "http://feedproxy.google.com/~r/HNN_Podcast/~5/_8d5jhemuyE/HH147.mp3"
        },
        {
            "title": "The Humanist Hour #146: A Conversation with Lisa Montoya, Seminary Student",
            "datePublished": "Wed, 15 Apr 2015 13:29:00 GMT",
            "description": "In this episode, Bo Bennett speaks with Lisa Montoya, organizational development coach and current seminary student. \r\n\r\nFrom Lisa’s website: \r\n\r\nLisa Montoya is pursuing her own personal and spiritual development by attending One Spirit Interfaith Seminary. As a soon-to-be ordained interfaith/interspiritual minister, she is also a volunteer pastoral care visitor at the Leonard Morse Hospital at MetroWest Medical Center in Natick, MA. \r\n\r\nAdditionally, she is a certified Grief Recovery Specialist, helping people work through the pain of major life losses (divorce, death, job loss, etc.). This grief work ties directly to her work with organizations going through major change. Lisa is especially skilled at helping managers assist their employees with the emotional aspect of change which, if not acknowledged and handled properly, can delay or derail the change efforts, regardless of how rational they may be.\r\n\r\nWhen not working, Lisa enjoys yoga, walks in nature, spending time with family and friends, and traveling.\r\n",
            "length": "0",
            "sourceUrl": "http://feedproxy.google.com/~r/HNN_Podcast/~5/umROcl61ZU4/HH146.mp3"
        },
        {
            "title": "The Humanist Hour #145: Graphic Non-Fiction, with Humanist Author Sean Michael Wilson",
            "datePublished": "Wed, 08 Apr 2015 13:42:00 GMT",
            "description": "In this episode, Bo Bennett speaks with Sean Michael Wilson, author of the graphic non-fiction \"Goodbye God?\", exploring the art of graphic illustrations, church-state separation in England and Scotland, and several other humanist issues.\r\n\r\nSean Michael Wilson has written around 20 books, published by a variety of US, UK and Japanese publishers and translated into eight languages. As well as writing 'western' style graphic novels, he often works with Japanese and Chinese artists on manga style books. Japanese publisher Kodansha has published 3 of his manga books so far, and he has had work published in the keitai/mobile phone manga format in Japan - both very unusual for a British creator. His comic books are different from the normal superhero/fantasy brands in collaboration with a variety of 'non-comic book' organizations, such as charities and museums. His main influences include British and American creators, such as Alan Moore, Grant Morrison, Eddie Campbell and Harvey Pekar.",
            "length": "0",
            "sourceUrl": "http://feedproxy.google.com/~r/HNN_Podcast/~5/N0egWfarheA/HH145.mp3"
        },
        {
            "title": "The Humanist Hour #144: Recovering From Religion, with Sarah Morehead",
            "datePublished": "Wed, 01 Apr 2015 13:55:00 GMT",
            "description": "In this episode, Bo Bennett speaks with Sarah Morehead, Executive Director of Recovering From Religion about her personal journey from religion, the Secular Therapist Project, and the Hotline Project.\r\n\r\nA life-long evangelical Southern Baptist, Sarah spent years as a dutiful wife and mother before finding the courage to leave an abusive marriage. She ultimately let go of her faith, becoming a passionate advocate for growing the secular community by developing resources for practical support as people reconsidering the role of religion in their life.\r\n\r\nIn 2011 she joined the leadership of Recovering From Religion and in 2012 she was appointed the Executive Director. Thanks to her tireless efforts, Recovering From Religion is well known as the bridge of hope for those negatively impacted by religion. In 2014 she was honored with the American Atheists “Atheist of the Year” award for her activism throughout the secular movement and in January 2015 she was elected President of the Reason Rally Coalition.\r\n\r\nWhen she is not busy directing RR and organizing events like Apostacon, she enjoys spending time with her family and homeschooling her many children.",
            "length": "0",
            "sourceUrl": "http://feedproxy.google.com/~r/HNN_Podcast/~5/UVYhtsGPWTM/HH144.mp3"
        },
        {
            "title": "The Humanist Hour #143: What I Gained When I Lost My Religion, with Neil Carter",
            "datePublished": "Wed, 25 Mar 2015 13:38:00 GMT",
            "description": "In this episode, Bo Bennett and Kim Ellington interview Mr. “Godless in Dixie,” Neil Carter. They discuss what it is like to be an atheist in the Deep South, and more generally, the benefits that come with living the secular life.\r\n\r\nFrom Neil’s website:  \r\n\r\nWhat you’ll find here are mostly my thoughts and ramblings about living as a skeptic in the Deep South. If you’re not from around here, you probably wouldn’t believe how central religion is to life in the South. I was raised in this culture, and I spent two decades of my life passionately pursuing the ideals of evangelical Christianity.  Around age 35 I changed my mind, however, and now I find myself daily wrestling with the implications of unbelief and skepticism amidst a culture which praises faith in the unseen.  I am not by nature a confrontational person (in fact, I’m pathologically conciliatory) so if the opinions expressed herein strike you as unduly antagonistic towards some aspects of religion in general, and evangelical/fundamentalist Christian faith in particular, I would encourage you to consider the possibility that circumstances around me have inspired that posture.\r\n\r\nI wear many hats (and none of them pay well!):  I am a school teacher, a tutor, a personal trainer, a supplement pusher, a driving instructor, and a father of five.  I also help moderate a growing discussion group of more than 450 atheists in Mississippi and I’ve recently started a more public forum for anyone interested in discussing issues related to skepticism and/or life in the Deep South.",
            "length": "0",
            "sourceUrl": "http://feedproxy.google.com/~r/HNN_Podcast/~5/I_o9oac8bE0/HH143.mp3"
        },
        {
            "title": "The Humanist Hour #142: Having Fun with Superstitions, with Margaret Downey",
            "datePublished": "Wed, 18 Mar 2015 13:34:00 GMT",
            "description": "In this episode, Bo interviews former AHA board member Margaret Downey about several humanistic issues as well as her famous anti-superstition parties.\r\n\r\nDowney has been active in a variety of causes including feminism and anti-smoking campaigns before becoming a public representative of atheism, and has known for her activities in this area. \r\n\r\nHer first major involvement as a publicly active nontheist was when her son Matthew was not allowed to renew his membership in the Boy Scouts of America since he was raised in a nontheist household. This led to Margaret Downey v. Boy Scouts of America, which did not go far in the courts before the United States Supreme Court's 2000 decision in Boy Scouts of America v. Dale that the Boy Scouts constituted a private organization and could thus choose their own membership criteria, preventing Downey from taking her case further. Since then Downey has been a prominent public representative of atheism in the United States as well as representing atheists and other non-theists at United Nations conferences. Her work has been incorporated into United Nations reports on religious discrimination. ",
            "length": "0",
            "sourceUrl": "http://feedproxy.google.com/~r/HNN_Podcast/~5/WpBaXh3hybE/HH142.mp3"
        },
        {
            "title": "The Humanist Hour #141: What Is Polyamory All About?",
            "datePublished": "Wed, 11 Mar 2015 13:26:00 GMT",
            "description": "In this episode, Bo Bennett and Kim Ellington interview Susan Porter and Rose McDonnell from PolyColumbus.org. Listen as they discuss polyamory – the practice of having multiple simultaneous sexual and/or romantic partners.\r\n\r\nFrom the PolyColumbus.org website:  \r\n\r\nPolyColumbus empowers individuals that either self-identify as polyamorous, open, or ethically non-monogamous, or are exploring such possibilities. We build community to provide a safe and inclusive place to not only be ourselves, but also meet like-minded individuals from all backgrounds.\r\n\r\nWe advocate for the equal treatment of the ethically non-monogamous under law, and for broader societal acceptance of the same. We serve organizations with similar goals by documenting best practices and creating other resources for successfully running such an organization.\r\n\r\nFinally, we educate each other, allied organizations, and the broader community on what it means to be ethically non-monogamous.",
            "length": "0",
            "sourceUrl": "http://feedproxy.google.com/~r/HNN_Podcast/~5/IwLwaZnsAp0/HH141.mp3"
        },
        {
            "title": "The Humanist Hour #140: Awkward Moments in the Bible, with Horus Gilgamesh",
            "datePublished": "Wed, 04 Mar 2015 14:28:00 GMT",
            "description": "In this episode, Bo Bennett interviews Horus Gilgamesh, author of the \"Awkward Moments (not found in your average) Children's Bible\" series.\r\n\r\nFrom Horus’ website:  \r\n\r\nHorus was raised Catholic before being \"born again\" in college when he began following a calling toward full-time ministry. Early on, his efforts were focused on youth evangelism and Biblical literacy around the world. When he was on a missions trip to Africa, a fearless young boy approached, pleading, \"Chakula? Maji?\" - the Swahili words for “food” and \"water.\" Unfortunately, Horus had no food or water to offer the poor child – only Bibles.\r\n\r\nA few days later, Horus met a humanitarian relief worker from Spain who shared five simple words of wisdom that would change his life forever – \"Empty stomachs have no ears.\"  Horus realized that he was not meeting the very real needs of the people he was hoping to help – he was struggling to finding a purpose in his own life, as a self righteous servant of his Creator.\r\n\r\nTo many Christians, the most important gift you could ever give to a man is a chance at eternal life through the Gospel of Jesus Christ – the Living Water. But what about this life? There are billions who would give anything for a drink of regular old H2O.\r\n\r\nOver the years, Horus became more interested in critical needs and social justice initiatives, helping those at risk of severe poverty, disease, or violence. The pain and suffering he saw first hand  led him to be more and more troubled by God's apparent disregard for the children of His creation. This led Horus to years of re-studying the Bible for himself, away from the \"rose-colored\" teachings of any church or seminary. He never returned.\r\n\r\n",
            "length": "0",
            "sourceUrl": "http://feedproxy.google.com/~r/HNN_Podcast/~5/pMHcoPJrnEE/HH140.mp3"
        },
        {
            "title": "The Humanist Hour #139: Faith Beyond Belief, with Margaret Placentra Johnston",
            "datePublished": "Wed, 25 Feb 2015 14:24:00 GMT",
            "description": "In this episode, Bo Bennett interviews Margaret Placentra Johnston, author of the book 'Faith Beyond Belief.'\r\n\r\nFrom Margaret’s Patheos blog:  \r\n\r\nWhile the word spirituality can mean many different things to different people, on this site we consider it less as a supernatural (and perhaps escapist) concept, and more about living more authentically in this life. Rather than sequester herself away on a mountain-top, a spiritual person as I am using the word, involves herself fully in the world, faces its questions and problems honestly and directly and does what she can to help out.\r\n\r\nSpecifically the term spiritual development, as used on this site, refers to the intention to move forward spiritually in three ways – Spiritual strength, spiritual maturity and spiritual courage.\r\n\r\nIf you would welcome a broader perspective about religious belief versus nonbelief, please join me here for a bird’s eye view of the unitive and non-literal belief stance that often develops in true spiritual maturity.",
            "length": "0",
            "sourceUrl": "http://feedproxy.google.com/~r/HNN_Podcast/~5/YtRLsFDS-Ys/HH139.mp3"
        },
        {
            "title": "The Humanist Hour #138: Intentional Insights with Gleb Tsipursky, PhD",
            "datePublished": "Wed, 18 Feb 2015 14:28:00 GMT",
            "description": "In this episode, Bo Bennett and Kim Ellington discuss discovering meaning and purpose with Gleb Tsipursky, co-founder and chief insights officer at Intentional Insights.\r\n\r\nFrom his bio at IntentionalInsights.org: \r\n\r\nGleb's passion for helping people use science to find purpose and meaning, evaluate reality rationally, and make effective decisions to led him and his wife, Agnes Vishnevkin, to co-found Intentional Insights in the Spring of 2014. Since that time, Gleb has collaborated with a group of like-minded enthusiasts to translate complex academic research on rational thinking and emotional intelligence into pragmatic tools and strategies relevant to a broad public. He was always excited about studying and promoting such ideas, leading him to get a PhD in history, and to research and teach students about meaning and purpose, decision making, emotions, and agency in various historical contexts. As a historian, he is in the fortunate position of having scholarly expertise in combining research from many different fields into a cohesive whole, and translation of this information for a broad audience. Gleb currently holds a tenure-track professorship at The Ohio State University as a faculty in the History Department and a member of the Behavioral Decision-Making Initiative there. He is also a member of the International Network on Personal Meaning.",
            "length": "0",
            "sourceUrl": "http://feedproxy.google.com/~r/HNN_Podcast/~5/fWzktwtWqJI/HH138.mp3"
        },
        {
            "title": "The Humanist Hour #137: The Good Side of Prejudice & the Secular Side of Morality, with Dr. Paul Bloom",
            "datePublished": "Wed, 11 Feb 2015 14:45:00 GMT",
            "description": "In this episode, Bo Bennett interviews Yale professor Dr. Paul Bloom on the upside of prejudice and the secular side of morality.\r\n\r\nDr. Bloom is the Brooks and Suzanne Ragen Professor of Psychology at Yale University. His research explores how children and adults understand the physical and social world, with special focus on morality, religion, fiction, and art. He has won numerous awards for his research and teaching. He is past-president of the Society for Philosophy and Psychology and co-editor of 'Behavioral and Brain Sciences', one of the major journals in the field.\r\n\r\nDr. Bloom has written for scientific journals such as 'Nature' and 'Science', and for popular outlets such as 'The New York Times', 'The Guardian', 'The New Yorker', and 'The Atlantic Monthly'. He is the author or editor of six books, including 'Just Babies: The Origins of Good and Evil'.",
            "length": "",
            "sourceUrl": ""
        },
        {
            "title": "The Humanist Hour #136 Social Justice & Private Parts, with Sam Killermann",
            "datePublished": "Wed, 04 Feb 2015 14:42:00 GMT",
            "description": "In this episode, Bo Bennett interviews social justice comedian and advocate Sam Killermann on gender issues, feminism, humanism, and intolerance. Also, find out how NOT to make small talk with Bo!\r\n\r\nSam loves and appreciates all people, and hopes to someday live in a world where everyone shares those views and we all stop being jerks. He uses humor as a “social lubricant” to put people at ease confronting difficult issues, drawing on his master’s education in college student development from Bowling Green State University and his eight years of experience working stand-up comedian for guidance.\r\n\r\nSam is a dedicated ally and advocate for social justice. Ultimately, he would prefer shows and websites like “It’s Pronounced Metrosexual” to become unnecessary and irrelevant, even at the cost of his dream job. Unfortunately, we have a long way to go before he has to worry about that.",
            "length": "0",
            "sourceUrl": "http://feedproxy.google.com/~r/HNN_Podcast/~5/DIeeNW1PIf4/HH136.mp3"
        },
        {
            "title": "The Humanist Hour #135: Scientific Paranormal Investigation with Benjamin Radford",
            "datePublished": "Wed, 28 Jan 2015 14:39:00 GMT",
            "description": "In this episode, Bo Bennett interviews author Benjamin Radford about his book, \"Scientific Para-normal Investigation: How to Solve Unexplained Mysteries.\" Ben is deputy editor of Skeptical Inquirer science magazine and a Research Fellow with the non-profit educational organization the Committee for Skeptical Inquiry. He has written over a thousand articles on a wide variety of topics, including urban legends, the paranormal, critical thinking, and media literacy.\r\n\r\nHe is author of six books: \"Hoaxes, Myths, and Manias: Why We Need Critical Thinking\" (with sociologist Robert Bartholomew); \"Media Mythmakers: How Journalists, Activists, and Advertisers Mislead Us,\" examining the ways in which deception is used in various media to influence decision making and public policy; \"Lake Monster Mysteries: Investigating the World’s Most Elusive Creatures\" (with Joe Nickell), a scientific examination of lake monsters around the world; \"Scientific Paranormal Investigation: How to Solve Unexplained Mysteries;\" \"Tracking the Chupacabra: The Vampire Beast in Fact, Fiction, and Folklore\" and \"The Martians Have Landed! A History of Media-Driven Panics and Hoaxes\" (with Robert Bartholomew).",
            "length": "0",
            "sourceUrl": "http://feedproxy.google.com/~r/HNN_Podcast/~5/2ESlCTMsqBY/HH135.mp3"
        },
        {
            "title": "The Humanist Hour #134: How “God” Works, with Marshall Brain",
            "datePublished": "Wed, 21 Jan 2015 14:26:00 GMT",
            "description": "In this episode, Bo Bennett interviews author Marshall Brain about his book, \"How 'God' Works: A Logical Inquiry on Faith\".\r\n\r\nFrom the book description:\r\n\r\n\"Does God exist? Using an intellectually rigorous, scientific approach, Marshall Brain—the founder of HowStuffWorks.com and author of the How Stuff Works series—sets out to resolve the eternal debate once and for all. With a compelling sense of curiosity, he breaks down mankind's search for a higher power, tackling such quandaries as: Who is God? What are his attributes? What is God doing and why? How does God interact with humanity? And ultimately, how can humans know with certainty whether God is real or imaginary? 'How God Works' is an enlightening journey in critical thinking that challenges readers to boldly approach the subject of personal faith and put aside intuition in favor of objectivity and logic.\"\r\n\r\nMarshall Brain is best known as the founder of HowStuffWorks.com, and is the bestselling author of the How Stuff Works book series. He has appeared on Oprah, Dr. Oz, Good Morning America, CNN, Modern Marvels, and in many other media outlets to apply his signature approach to unraveling the mysteries of life. He is also the host of the National Geographic Channel's \"Factory Floor with Marshall Brain\". He lives in Cary, North Carolina.",
            "length": "0",
            "sourceUrl": "http://feedproxy.google.com/~r/HNN_Podcast/~5/A5VkNSt7rdk/HH134.mp3"
        },
        {
            "title": "The Humanist Hour #133: Jeff Rasley on Being Godless and Living a Valuable Life beyond Beliefs",
            "datePublished": "Wed, 14 Jan 2015 14:41:00 GMT",
            "description": "In this episode, Bo Bennett interviews author Jeff Rasley about his book, \"Godless -- Living a Valuable Life beyond Beliefs\". The history of religious and political ideologies is bloody. Crusaders and Islamic-Jihadist terrorists divide the world into believers and heretics. Their propaganda has persuaded followers to torture and slaughter unbelievers. \"Godless\" proposes a cure for the pathology of fanatical religious beliefs and political ideologies. \r\n\r\nJeff Rasley lives on the White River in Indianapolis with Alicia and Bandit. Jeff is the author of eight books. He wrote bad poetry as a teenager and short stories in college. Newsweek, Chicago Magazine, ABA Journal, and other periodicals eventually published his feature articles. Jeff's commitment to social activism and philanthropy began in high school when he co-founded the Goshen Walk for Hunger. In law school he fought for renters' rights, and organized the first rent strike in Indiana as president of the Indianapolis Tenants Association. He was lead counsel on class action suits for prisoners which resulted in the construction of two new jails in central Indiana. Jeff was plaintiff in a class action requiring clean-up of the White River after it was polluted by an industrial chemical spill. Jeff is president of the Basa Village Foundation, which funds culturally sensitive development in Nepal. He is the director of five nonprofits. He is U.S. liaison for the Himalayan expedition company Adventure GeoTreks Ltd, and teaches philosophy of philanthropy at Butler University.",
            "length": "",
            "sourceUrl": ""
        },
        {
            "title": "The Humanist Hour #132: The Truth about the Sunday Assembly, with Ian Dodd and Amy Boyle",
            "datePublished": "Wed, 07 Jan 2015 14:34:00 GMT",
            "description": "In this episode, Bo Bennett and Kim Ellington interview Ian Dodd and Amy Boyle from the Sunday Assembly in Los Angeles, CA. They talk how it got started, what it is, what it is not, and how they are keeping it going strong.\r\n\r\nFrom SundayAssemblyLA.org: \r\n\r\nSunday Assembly Los Angeles is a new godless community that meets monthly to hear great talks, connect for service projects, sing songs and generally celebrate life. Assemblies are free to attend, and everyone is welcome.  \r\n\r\nThe Sunday Assembly:\r\n1) Is 100% celebration of life. We are born from nothing and go to nothing. Let’s en-joy it together. \r\n2) Has no doctrine. We have no set texts so we can make use of wisdom from all sources. \r\n3) Has no deity. We don’t do supernatural but we also won’t tell you you’re wrong if you do. \r\n4) Is radically inclusive. Everyone is welcome, regardless of their beliefs – this is a place of love that is open and accepting. \r\n5) Is free to attend, not-for-profit and volunteer run. We ask for donations to cover our costs and support our community work. \r\n6) Has a community mission. Through our Action Heroes (you!), we will be a force for good. \r\n7) Is independent. We do not accept sponsorship or promote outside businesses, organizations or services. \r\n8) Is here to stay. With your involvement, The Sunday Assembly will make the world a better place. \r\n9) We won’t tell you how to live, but will try to help you do it as well as you can. \r\n10) And remember point 1… The Sunday Assembly is a celebration of the one life we know we have.\r\n",
            "length": "0",
            "sourceUrl": "http://feedproxy.google.com/~r/HNN_Podcast/~5/9PGvXzUtIcQ/HH132.mp3"
        },
        {
            "title": "The Humanist Hour #131: Positive Humanism, with Bo Bennett",
            "datePublished": "Wed, 31 Dec 2014 14:57:00 GMT",
            "description": "This is a special live presentation episode of a presentation on positive humanism, given by Bo Bennett to the Concord Humanists in Concord, MA on December 3, 2014.\r\n\r\nWhat is positive humanism? Positive humanism is an applied humanistic philosophy based on the scientific findings of positive psychology that focuses on personal, professional, and societal flourishing.\r\n\r\nTranslation: As an applied philosophy it offers practical solutions to increase well-being.  As a humanistic philosophy, there are no appeals to the supernatural, the magical, or the mystical—the philosophy is founded on reason and critical thinking.  The philosophy is science-based, meaning it is void of the unsupported and/or exaggerated claims and the constant confusing of correlation with causality often found in the self-help genre.  The philosophy is grounded in the theories of positive psychology, which is the study of the other side of the mental health spectrum—human thriving.  The philosophy focuses on concrete strategies to help individuals in all areas of personal growth and professional success, primarily through being of prosocial acts and through distributed kindness.\r\n\r\nBo’s Links: \r\nPositive Humanism: http://www.positivehumanism.com\r\nAbout Bo: http://www.bobennett.com\r\nTwitter: @bobennett\r\n",
            "length": "0",
            "sourceUrl": "http://feedproxy.google.com/~r/HNN_Podcast/~5/wJd4GBArgg8/HH131.mp3"
        },
        {
            "title": "The Humanist Hour #130: Sincere Kirabo on the Complex Issues of Ferguson (Part II)",
            "datePublished": "Wed, 24 Dec 2014 14:05:00 GMT",
            "description": "In this episode, Kim Ellington interviews Sincere Kirabo, continuing the conversation from last week. Kirabo is a Board Member with Black Nonbelievers and a Regional Director for American Atheists. He has an insatiable thirst for knowledge and understanding, and interested only in the cerebral. Kirabo’s hope is to dissect every observation, grasp the fundamentals of executing knowledge in his daily walk, and question the very fabric of reality.\r\n\r\nKirabo on Skepticism: \r\n\r\n\"Skepticism goes beyond doubt or disbelief. It is not close-mindedness or being negative about every new or controversial idea. Skepticism is a process of critical thinking and analyzing evidence to determine the validity of a hypothesis. It is a rational and an open-minded process to find a conclusion that is supported by evidence. It is not used to justify preconception. It is not used to irrationally reject evidence based on a personal desire for only one conclusion.\"",
            "length": "0",
            "sourceUrl": "http://feedproxy.google.com/~r/HNN_Podcast/~5/Ekp3nQNt2vU/HH130.mp3"
        },
        {
            "title": "The Humanist Hour #129: James Croft on the Complex Issues of Ferguson",
            "datePublished": "Wed, 17 Dec 2014 14:43:00 GMT",
            "description": "In this episode, Bo Bennett and Kim Ellington interview James Croft, humanist activist involved in the events unfolding in Ferguson, MO.\r\n\r\nJames Croft is the Leader in Training at the Ethical Culture Society of St. Louis - one of the largest humanist congregations in the world. He is a graduate of Cambridge and Harvard Universities, and is currently writing his doctoral dissertation as a student at the Harvard Graduate School of Education. He is a public speaker, teacher, and a passionate activist for human rights. James was raised on Shakespeare, Sagan and Star Trek, and is a proud, gay humanist. His upcoming book \"The Godless Congregation\", co-authored with New York Times bestselling author Greg Epstein, is being published by Simon & Schuster.",
            "length": "0",
            "sourceUrl": "http://feedproxy.google.com/~r/HNN_Podcast/~5/AZpJWEuoy7I/H129.mp3"
        },
        {
            "title": "The Humanist Hour #128: Scammers and Skeptics with Brian Brushwood",
            "datePublished": "Wed, 10 Dec 2014 14:28:00 GMT",
            "description": "In this episode, Bo Bennett interviews entertainer and career skeptic Brian Brushwood. Brian is an American magician, podcaster, author, lecturer and comedian. He is known for the series Scam School, a show where he teaches the audience entertaining tricks at bars so they can \"scam\" a free drink from their friends. In addition to Scam School Brushwood co-hosts the podcasts Weird Things, Too Long Didn't Listen, Cordkillers and Night Attack. Brushwood is also a regular guest on the This Week in Tech podcast. Brushwood performs his Bizarre Magic stage show across the United States and is the author of six books. Brushwood has appeared on national television numerous times including on The Tonight Show with Jay Leno, CNN and Food Network.\r\n\r\nFrom Brian’s website: \r\n\r\nEver wonder how those guys on TV seem to talk to the dead? What about ESP and psychic surgery? How do street scams and cons work? Want to know how YOU can trick your friends into believing you have psychic powers?\r\n\r\nAs a magician, Brian’s wise to all the tricks used by frauds, tricksters, and scam artists …and now he’s ready to take YOU to scam school. This is no ordinary lecture: we’re talking hands-on experiments, a live performance of psychic surgery, free giveaways of cash and prizes, and all the secrets TV psychics DON’T want you to know.",
            "length": "0",
            "sourceUrl": "http://feedproxy.google.com/~r/HNN_Podcast/~5/8b8wB3mQmA8/HH128.mp3"
        },
        {
            "title": "The Humanist Hour #127: Critical Thinking with Dr. Kevin deLaplante",
            "datePublished": "Wed, 03 Dec 2014 14:21:00 GMT",
            "description": "In this episode, Bo Bennett interviews Kevin deLaplante, philosophy and religious studies professor at Iowa State University. They discuss several aspects of critical thinking, including it is so important in everyday life.\r\n\r\nFrom Dr. deLaplante’s website, Critical Thinking Academy:  \r\n\r\nWhen I’m not working on the Academy I teach at Iowa State University in the Depart-ment of Philosophy & Religious Studies. I was Chair of that department from 2009-2013.\r\n\r\nMy early training was in physics. In graduate school I focused my studies on the history and philosophy of science.\r\n\r\nOver the years I’ve taught courses on Introduction to Philosophy, Ethics, Symbolic Log-ic, Logic and Scientific Reasoning, Philosophy of Science, Philosophy of Physics, Phi-losophy of Biology, Philosophy of Ecology, Philosophy of Mathematics, and others.\r\n\r\nI’ve always had an interest in critical thinking, human (ir)rationality and the psychology of belief and judgment. The Academy is a place where I can indulge my interests in this area and share what I’ve learned with a broader audience.",
            "length": "0",
            "sourceUrl": "http://feedproxy.google.com/~r/HNN_Podcast/~5/2ocdR0xGJvY/HH127.mp3"
        },
        {
            "title": "The Humanist Hour #126: David Niose on “Fighting Back the Right”",
            "datePublished": "Wed, 26 Nov 2014 16:11:00 GMT",
            "description": "In this episode, Bo Bennett speaks with David Niose about his new book, Fighting Back the Right: Reclaiming America from the Attack on Reason. David is the immediate past president of the American Humanist Association. He currently serves as the legal director of the Appignani Humanist Legal Center, running the AHLC's Massachusetts office.\r\n\r\nFrom Amazon: The political scene is changing rapidly in America. The religious right is on the defensive, acceptance of gay rights is at an all-time high, social conservatives are struggling for relevance, and more Americans than ever identify as nonreligious. What does this mean for the country and the future? With these demographic shifts, can truly progressive, reason-based public policy finally gain traction? Or will America continue to carry a reputation as anti-intellectual and plutocratic, eager to cater to large corporate interests but reluctant to provide universal health care to all its citizens? Fighting Back the Right reveals a new alliance in the making, a progressive coalition committed to fighting for rational public policy in America and reversing the damage inflicted by decades of conservative dominance. David Niose, Legal Director of the American Humanist Association (AHA), examines this exciting new dynamic, covering not only the rapidly evolving culture wars but also the twists and turns of American history and politics that led to this point, and why this new alliance could potentially move the country in a direction of sanity, fairness, and human-centered public policy.",
            "length": "0",
            "sourceUrl": "http://feedproxy.google.com/~r/HNN_Podcast/~5/vgrtW-lTp_c/HH126.mp3"
        },
        {
            "title": "The Humanist Hour #125: John Figdor, Atheist Mind, Humanist Heart",
            "datePublished": "Wed, 19 Nov 2014 14:37:00 GMT",
            "description": "In this episode, Bo Bennett speaks with John Figdor, the current Humanist Chaplain at Stanford University where he organizes events and programs for both students and community members of the San Francisco Bay Area. He is the first Humanist Chaplain on the West Coast serving a university community. \r\n\r\nJohn received his B.A. with honors in Philosophy from Vassar College and holds a master’s degree (MDiv) in Humanism and Interfaith Dialogue from Harvard Divinity School. He was an Organizing Fellow of the Humanist Chaplaincy at Harvard University and former Assistant Humanist Chaplain at Harvard, working with Greg Epstein. John is a former Board Member of the Secular Student Alliance, and his work has been discussed in the San Francisco Chronicle, The Huffington Post and The Washington Post. \r\n\r\nIn 2014, John coauthored with Lex Bayer the book \"Atheist Mind, Humanist Heart: Rewriting the Ten Commandments for the Twenty-First Century\". ",
            "length": "0",
            "sourceUrl": "http://feedproxy.google.com/~r/HNN_Podcast/~5/miv1BUVp5Ok/HH125.mp3"
        },
        {
            "title": "The Humanist Hour #124: James Woods, Too Sensible to Be Electable",
            "datePublished": "Wed, 12 Nov 2014 14:32:00 GMT",
            "description": "In this episode, Bo Bennett speaks with James Woods, an openly-atheist congressional candidate for Arizona’s 5th district. Though he lost in the November 4 general election, his trailblazing campaign helped pave the way for other openly secular candidates in the future. \r\n\r\nRead about James Woods (in his own words): \r\n\r\nI’ve lived in Arizona my whole life. I was born in the Arizona East Valley and raised by good-hearted working class parents. My dad is one of my best friends and supporters. We lost my mom to cancer in 2002, but I think she would be proud of how close and strong our family has remained. I graduated from Dobson High in ‘97 and went to Mesa Community College, working toward a career in the tech industry. I wanted the kind of job where I could support myself and a family, but also contribute to the quality of life in Arizona by developing technology-based solutions to the problems our state faces. \r\n\r\nA month before my 27th birthday, I was hospitalized for a rare illness that nearly killed me. I didn’t have health coverage. I survived organ failure and amputations. While my medical team fought to keep me alive, my vision started fading. On a Monday I told the doctor that things were starting to look dim, and by Friday I never saw again. I ended up on dialysis and even spent time in hospice. I would not be alive today without all the people who invested in me. You invested in me through your contributions to government programs like Medicaid, Social Security Disability and Nutrition Assistance. My dad invested in me and became my caregiver. And someone I never met gave me a new chance at a healthy life through organ donation. After all of that generosity and support, it's time for me to start giving back. \r\n\r\nLast February I received a new kidney, and from my hospital bed in Phoenix I signed the paperwork to run for the US Congress in Arizona’s CD5. After my long struggle to get the health care I needed and the losses I experienced when I couldn’t get it, I knew I had an opportunity to start advocating for change. There is a damaging disparity between the decision-makers in Washington and the people who have to live with the decisions they make. We deserve representatives who know what it’s like to face hard times and what’s needed to overcome them. I can provide that representation. I have already overcome some tough odds, and I believe it’s time to overcome the conservative ideology that hurts the most vulnerable among us.",
            "length": "0",
            "sourceUrl": "http://feedproxy.google.com/~r/HNN_Podcast/~5/JFsYtEthzA0/HH124.mp3"
        },
        {
            "title": "The Humanist Hour #123: Bart Campolo, a Humanist Preacher with Passion",
            "datePublished": "Wed, 05 Nov 2014 14:19:00 GMT",
            "description": "In this episode, Bo Bennett and Kim Ellington speak with Bart Campolo, the Humanist Chaplain at the University of Southern California who recently left Christianity and became a “preacher of reason.” Bart talks about his journey and offers advice on how secular groups can use some of the “secret sauce” used by many religious groups to build communities.\r\n\r\nAfter receiving his BA in Religious Studies from Brown University, Bart served as youth pastor of the Park Avenue United Methodist Church in Minneapolis before returning to his hometown of Philadelphia to found Mission Year, which recruits Christian young adults to live and work among the poor in urban neighborhoods across the country. During his fifteen years in that role, Bart became a popular writer and speaker in evangelical Christian circles, focusing on interpersonal relationships, community development, and social justice. In 2005 he returned to street-level ministry as leader of the Walnut Hills Fellowship, a missional, interfaith community in inner-city Cincinnati, and also began consulting with a variety of non-profit organizations. Most recently, he worked with the Abraham Path Initiative and the Telos Group, educating American faith leaders about the causes of and potential remedies for the modern Israeli-Palestinian conflict.\r\n\r\nOver the course of his ministry career, Bart gradually transitioned from Christianity to secular humanism. As the first Humanist Chaplain at USC, he is committed to developing a community that offers regular inspiration, pastoral care, supportive fellowship, and service opportunities to students, faculty, staff members, local families, and individuals exploring or actively pursuing secular goodness as a way of life. Bart and his wife, artist Marty Thorpe Campolo, have three adult children.",
            "length": "0",
            "sourceUrl": "http://feedproxy.google.com/~r/HNN_Podcast/~5/D85nidCozm4/HH123.mp3"
        },
        {
            "title": "The Humanist Hour #122: A Discussion on the Psychology of the Paranormal with Dr. Susan Blackmore",
            "datePublished": "Wed, 29 Oct 2014 13:22:00 GMT",
            "description": "In this episode, Bo Bennett and Todd Stiefel interview Dr. Susan Blackmore about near death experiences, the paranormal, consciousness, and memes. \r\n\r\nDr. Blackmore is an English freelance writer, lecturer, sceptic, and broadcaster on psychology and the paranormal, and is best known for her book The Meme Machine. She has written and contributed to over 40 books and 60 scholarly articles and is a contributor to The Guardian newspaper.",
            "length": "0",
            "sourceUrl": "http://feedproxy.google.com/~r/HNN_Podcast/~5/bulmoqJeJPY/HH122.mp3"
        },
        {
            "title": "The Humanist Hour #121: George Eighmey on Death with Dignity ",
            "datePublished": "Wed, 22 Oct 2014 13:26:00 GMT",
            "description": "In this episode, Bo Bennett interviews George Eighmey, officer and spokesperson for the Death with Dignity National Center. The mission of the Center is to promote Death with Dignity laws based on their model legislation, the Oregon Death with Dignity Act, both to provide an option for dying individuals and to stimulate nationwide improvements in end-of-life care.\r\n\r\nGeorge was an Oregon state legislator in 1997 when opponents to the Death with Dignity Act were working to dismantle the citizen's initiative passed in 1994, and he was instrumental in blocking this opposition. After the law was implemented, he took up a leadership role as the executive director of Compassion in Dying of Oregon which later became Compassion & Choices of Oregon. After twelve years helping terminally ill patients navigate Oregon's Death with Dignity Act, George retired in 2010.",
            "length": "0",
            "sourceUrl": "http://feedproxy.google.com/~r/HNN_Podcast/~5/kXkLJ3c5v48/HH121.mp3"
        },
        {
            "title": "The Humanist Hour #120: Should Humanists Criticize Islam? The Pros and Cons, with Muhammad Syed and Sarah Haider",
            "datePublished": "Wed, 15 Oct 2014 14:05:00 GMT",
            "description": "In this episode. Bo Bennett speaks with Muhammad Syed and Sarah Haider on the issue of criticizing Islam and analyzing some of the recent comments made by people such as Sam Harris, Bill Maher, Reza Aslan, and Ben Affleck.\r\n\r\nMuhammad Syed is a resident of the Washington, DC metro area. Due to the desire to better understand his faith, he embarked on a long period of research and study culminating in the inevitable conclusion that Islam, like other religions, is nothing more than bronze-age mythology. He decided to be public about his apostasy in 2007 in a desire to engage in open dialogue and break the apostasy taboo, encouraging other like-minded individuals to follow suit. In 2012, following the lead of the groups in London and Toronto, he started organizing an Ex-Muslim Community in the Washington, DC area.\r\n\r\nSarah Haider, a recent transplant to DC, was born in Pakistan and raised in the US. She grew up on a diet of debating and reading which, as a surprise to no-one, led to her atheism. Muhammad and Sarah had a long-standing friendship based on their similar background and she was involved in launching the DC-area Ex-Muslim Community. Her tireless efforts were instrumental in creating Ex-Muslims of North America (EXMNA) and she has been involved in public relations with EXMNA from the start. Sarah has been active in atheist and secular circles. Inspired by FreeThoughtBlogs, she conceived the idea of ExMuslim Blogs. ",
            "length": "0",
            "sourceUrl": "http://feedproxy.google.com/~r/HNN_Podcast/~5/jnVHPEf6xJY/HH120.mp3"
        },
        {
            "title": "The Humanist Hour #119, From the Archives: An Interview with Kurt Vonnegut",
            "datePublished": "Wed, 08 Oct 2014 13:33:00 GMT",
            "description": "In this episode, TheHumanist.com contributor Dan Moran shares his 1992 interview with the late Kurt Vonnegut.\r\n\r\nKurt Vonnegut, Jr. (1922 – 2007) was an American writer of noted works such as Cat's Cradle (1963), Slaughterhouse-Five (1969), and Breakfast of Champions (1973). Known for his humanist beliefs, he was awarded the AHA’s Humanist of the Year award in 1992 and served as the AHA’s honorary president. \r\n\r\nVonnegut grew up in a family of German-American freethinkers. His great-grandfather was the first president of the Freethinkers Society of Indianapolis and he maintained the family tradition of rejecting religious dogma in favor of humanism. \r\n\r\nThe sarcastic tone of Vonnegut's work came from major personal traumas, including his mother's suicide and witnessing first-hand the 1945 bombing of Dresden, Germany while a prisoner of war. Despite such experiences, Vonnegut never felt the need to fall back on irrational beliefs to explain irrational actions. He maintained his belief in a humanist worldview throughout his life.\r\n\r\n\"I am a humanist,\" Vonnegut wrote in a letter to AHA members, \"which means, in part, that I have tried to behave decently without expectations of rewards or punishments after I am dead.\"\r\n\r\nDaniel Thomas Moran served as Poet Laureate of Suffolk County, New York from 2005 to 2007. His work has appeared in The New York Times, National Forum, and the Poetry Salzburg Review. He is a Clinical Assistant Professor at Boston University’s School of Dental Medicine. His website is www.danielthomasmoran.net.",
            "length": "0",
            "sourceUrl": "http://feedproxy.google.com/~r/HNN_Podcast/~5/eLU9zwgvzUs/HH119.mp3"
        },
        {
            "title": "The Humanist Hour #118: Openly Secular with the Humanist Hour’s Own Todd Stiefel",
            "datePublished": "Wed, 01 Oct 2014 13:28:00 GMT",
            "description": "In this episode, Bo and Kim discuss the Openly Secular campaign with the chairman of the campaign, Todd Stiefel.\r\n\r\nTodd lives in Raleigh, NC. He is a secular humanist, an atheist and full-time freethought activist. He serves as an advisor to many of the top nontheistic organizations. He has given over $4.5 million dollars to charities in the Freethought Movement. This is highlighted by $3.5 million to found the Stiefel Freethought Foundation.\r\n\r\nTodd graduated cum laude from Duke University. He worked 12 years for Stiefel Laboratories, holding positions in marketing, sales operations and strategy. During his tenure, the company’s revenues quadrupled. He was the Chief Strategy Officer, the Enterprise Leadership Team chairman and member of the executive committee of the Board. ",
            "length": "0",
            "sourceUrl": "http://feedproxy.google.com/~r/HNN_Podcast/~5/rBw1fjT6JzI/HH118.mp3"
        },
        {
            "title": "The Humanist Hour #117: Roy and Maggie—Up Close and Personal",
            "datePublished": "Wed, 24 Sep 2014 13:22:00 GMT",
            "description": "In this episode, Bo Bennett has the honor of getting to know Maggie Ardiente and Roy Speckhardt from the American Humanist Association, when they drop by the recording studio for a live, wide-ranging discussion.\r\n\r\nMaggie Ardiente is the director of development and communications at the American Humanist Association and senior editor of TheHumanist.com. She graduated with a B.S. in sociology from James Madison University and served as Vice President of the JMU Freethinkers, a student group for atheists, agnostics, and humanists. She is a former board member of the Secular Student Alliance and a graduate (Class 15) and board member of The Humanist Institute.\r\n\r\nRoy Speckhardt has served as executive director of the American Humanist Association since 2005. He is a frequent media commentator, having appeared on Good Morning America, CNN, Fox News, and NPR, among others. He also writes a regular column for The Huffington Post, and has given speeches at colleges, conferences, and local humanist groups across the country. Speckhardt also serves on the boards of The Institute for Humanist Studies, the United Coalition of Reason, The Humanist Institute, and the Secular Coalition for America Education Fund. He served as deputy director of The Interfaith Alliance from 1995 to 2001. Speckhardt holds an M.B.A. from George Mason University and B.A. in sociology from Mary Washington College. ",
            "length": "0",
            "sourceUrl": "http://feedproxy.google.com/~r/HNN_Podcast/~5/ub3Tgk_sPfY/HH117.mp3"
        },
        {
            "title": "The Humanist Hour #116: From Fundamentalism to Reality and Beyond, with Jason Eden",
            "datePublished": "Wed, 17 Sep 2014 13:19:00 GMT",
            "description": "In this episode, Bo interviews Jason Eden, a guy who was about as “Christian” as a Christian can get, yet recently left Christianity for atheism with a Humanist worldview.\r\n\r\nEden is a former Southern Baptist preacher, youth minister, worship leader, and Christian apologist. Now a humanist celebrant, he resides near St. Louis, Missouri with his wife and two children. He wrote about his journey away from faith and his coming-out in the book That’s Me in the Corner: Coming Out as an Atheist on Facebook. Professionally, he works in corporate education capacities in the fields of big data and cloud computing, and sometimes writes at TheHumanist.com and at TheBookofWonder.org.",
            "length": "0",
            "sourceUrl": "http://feedproxy.google.com/~r/HNN_Podcast/~5/3FjzUTQPgKA/HH116.mp3"
        },
        {
            "title": "The Humanist Hour #115: Live at Dragon Con with Dr. Steven Novella",
            "datePublished": "Wed, 10 Sep 2014 14:06:00 GMT",
            "description": "In this episode, Todd and Kim interview Dr. Steven Novella live at the 2014 Dragon Con. They discuss a variety of topics, but mostly cover what being a good skeptic is all about!\r\n\r\nDr. Novella is an academic neurologist at Yale University School of Medicine. In addition to being the host of The Skeptics’ Guide podcast, he is the president and co-founder of the New England Skeptical Society. He is also the author of NeuroLogicaBlog, a popular science blog that covers news and issues in neuroscience, but also general science, scientific skepticism, philosophy of science, critical thinking, and the intersection of science with the media and society. Dr. Novella also contributes every Sunday to The Rogues Gallery, the official blog of the SGU; every Monday to SkepticBlog; and every Wednesday to Science-Based Medicine, a blog dedicated to issues of science and medicine. \r\n\r\nDr. Novella a fellow of the Committee for Skeptical Inquiry (CSI) and a founding fellow of the Institute for Science in Medicine. His column “The Science of Medicine” appears regularly in the Skeptical Inquirer. Dr. Novella is also a Senior Fellow for the James Randi Educational Foundation and directs their Science-Based Medicine program. \r\n\r\nDragon Con is a multi-media, popular culture convention focusing on science fiction & fantasy, gaming, comics, literature, art, music, and film in the universe. \r\n\r\nSpecial thanks to AbruptMedia, LLC and Skeptrack 2014 for providing the audio file for this podcast.",
            "length": "",
            "sourceUrl": ""
        },
        {
            "title": "The Humanist Hour #114: Talkin’ Humanist Politics with Senator Jamie Raskin",
            "datePublished": "Wed, 03 Sep 2014 13:22:00 GMT",
            "description": "In this episode, Bo Bennett interviews Maryland State Senator Jamie Raskin about being a Humanist in politics. Raskin serves on the Maryland Senate Judicial Proceedings Committee and is a professor of constitutional law and the first amendment at American University’s Washington College of Law. He is the bestselling author of \"Overruling Democracy: The Supreme Court versus the American People\", and \"We the Students: Supreme Court Cases For and About Students\". \r\n\r\nAs a freshman senator, Raskin has seen more than a dozen of his bills pass into law, including a statewide civil rights law, the National Popular Vote plan for presidential elections, a law protecting tenants in condo conversions, a law establishing September 17th as Constitution and Bill of Rights Day, and a farm-to-schools initiative to get locally grown farm food into public schools.",
            "length": "0",
            "sourceUrl": "http://feedproxy.google.com/~r/HNN_Podcast/~5/WQdNuA2alLA/HH114.mp3"
        },
        {
            "title": "The Humanist Hour #113: The “Gray Area” of Belief, with Jeremy Chappell",
            "datePublished": "Wed, 27 Aug 2014 13:16:00 GMT",
            "description": "In this episode, Bo Bennett interviews his good friend, Jeremy Chappell, about his \"spiritual\" journey from fundamentalist Christianity to… well, we're still not sure where he is, but the conversation is fascinating! We hear all the time from nonbelievers about their journeys, but rarely do we hear from a critical thinker in the process of giving up long-held beliefs.\r\n\r\nJeremy is a crime scene supervisor at the Kansas City police department. He studied criminal justice at the University of Illinois at Springfield, and spends much of his free time contemplating philosophical issues and actively debating controversial issues.",
            "length": "0",
            "sourceUrl": "http://feedproxy.google.com/~r/HNN_Podcast/~5/-xU6jezBA7A/HH113.mp3"
        },
        {
            "title": "The Humanist Hour #112: The Camp Quest Experience, with Bob Ready and Sarah Henry",
            "datePublished": "Wed, 20 Aug 2014 13:17:00 GMT",
            "description": "In this episode, Bo Bennett interviews Bob Ready, Chair of Camp Quest, along with Sarah Henry, a long time camper. Camp Quest, the secular summer camp, is a place for fun, friends, and freethought for kids ages 8-17. They provide a traditional sleep-away summer camp experience with a wide range of activities including sports, crafts, games, swimming, and campfires. In addition to traditional summer camp activities, Camp Quest offers educational activities focused on critical thinking, ethics, scientific inquiry, philosophy, and comparative religion.\r\n\r\nCamp Quest is open to all children and teenagers, but it is particularly geared towards building a community for children from atheist, agnostic, humanist and other freethinking families. Their goal is to provide a place where children can explore their developing worldviews, ask questions, and make friends in an environment that is supportive of critical thinking and skepticism.",
            "length": "0",
            "sourceUrl": "http://feedproxy.google.com/~r/HNN_Podcast/~5/-CeI_xdPYC0/HH112.mp3"
        },
        {
            "title": "The Humanist Hour #111: 10 Things Everyone Should Know About the Bible, with Dr. Robert M. Price",
            "datePublished": "Wed, 13 Aug 2014 13:28:00 GMT",
            "description": "In this episode, Bo talks with Dr. Robert M. Price about the 10 things everyone should know about the Bible. \r\n\r\nRobert M. Price is Professor of Biblical Criticism at the Center for Inquiry Institute as well as the editor of The Journal of Higher Criticism. His books include Beyond Born Again, The Widow Traditions in Luke-Acts: A Feminist-Critical Scrutiny, Deconstructing Jesus, and The Incredible Shrinking Son of Man. Other titles are The Crisis of Biblical Authority, Jesus Christ Superstar: A Redactional Study of a Modern Gospel, The Da Vinci Controversy and The Amazing Colossal Apostle. \r\n\r\nLinks:\r\nDr. Price’s webpage: http://www.robertmprice.mindvendor.com/\r\nFollow Dr. Price on Facebook: https://www.facebook.com/robert.m.price.77\r\n\r\n",
            "length": "",
            "sourceUrl": ""
        },
        {
            "title": "The Humanist Hour #110: Public Speaking (Secular Style), with Pat Johnson",
            "datePublished": "Wed, 06 Aug 2014 13:25:00 GMT",
            "description": "In this episode, Bo Bennett interviews Pat Johnson, DTM, Past International President for Toastmasters International, a world leader in communication and leadership development comprising over 292,000 members in 122 countries.  \r\n\r\nAs Humanists, we have important messages to share, but are we doing effectively? Scientists are notorious for their lack of communication skills, and those who value reason and logic tend to not connect to audiences as well as those who are not afraid to connect emotionally with audiences. Listen as Bo and Pat discuss their experiences as professional public speakers and give five tips to those wanted to be more persuasive and effective to an audience, a family, or even just a single person.\r\n\r\nPat Johnson is a seasoned executive who has been a leader in corporate, government, not-for-profit and entrepreneurial industries. She was the fifth woman ever to serve as Toastmasters International President from 2010-2011. ",
            "length": "",
            "sourceUrl": ""
        },
        {
            "title": "The Humanist Hour #109: Critical Comedy with Ian Harris",
            "datePublished": "Wed, 30 Jul 2014 13:15:00 GMT",
            "description": "In this episode, Bo interviews professional comedian Ian Harris. Fresh off the taping of his ground breaking new comedy TV special, Ian Harris is hitting the road with his Critical & Thinking tour. Ian’s debut hour special, Ian Harris: Critical & Thinking, is a skeptic take on religion and common beliefs in the form of an incredibly smart and charged comedy. \r\n\r\nOriginally a San Francisco Bay-area comic, Ian has been a top headliner for years, touring na-tionally as well on the nearby Los Angeles alternative comedy scene. Winner of many major competitions, he has been seen on Jimmy Kimmel Live, Comedy Central and as a headliner on the Evolution of Comedy Tour. Ian was even ranked #25 on Entertainment Journal's Top 100 Comedians list. \r\n\r\nIan’s comedy is cutting edge, thought provoking, and cleverly crafted, often eliciting compari-sons to greats like Lenny Bruce and George Carlin. With a unique point of view, Ian delivers a style of stand-up all his own.",
            "length": "",
            "sourceUrl": ""
        },
        {
            "title": "The Humanist Hour #108: Coming Out Ex-Muslim with Muhammad Syed and Hiba Krisht",
            "datePublished": "Wed, 23 Jul 2014 13:15:00 GMT",
            "description": "In this episode, Bo interviews Muhammad Syed, co-founder and director of operations for Ex-Muslims of North America, and Hiba Krisht, ex-Muslim blogger. The Ex-Muslims of North America are a group of people dedicated to supporting and helping ex-Muslims. The primary reason for our group’s existence is to build a community and provide a sense of solidarity for ‘ex-Muslims’ – people who used to follow Islam or identify as Muslim, and who no longer do so. As such, this group is only for ex-Muslims, primarily those located in or from North America.",
            "length": "",
            "sourceUrl": ""
        },
        {
            "title": "The Humanist Hour #107: On Being a “Faitheist” with Chris Stedman",
            "datePublished": "Wed, 16 Jul 2014 13:32:00 GMT",
            "description": "In this episode, Bo interviews Chris Stedman: interfaith leader, author, and humanist. \r\n\r\nChris is the author of \"Faitheist: How an Atheist Found Common Ground\" with the Religious. Booklist calls the book \"an intimate and deeply affecting portrait... [that] proves [he is] an activist in the truest sense and one to watch.\" Currently the Executive Director and Coordinator of Humanist Life for the Yale Humanist Community, Chris was formerly the Assistant Humanist Chaplain at Harvard University and the Values in Action Coordinator for the Humanist Community at Harvard. \r\n\r\nHe is also the atheist columnist for Religion News Service, Emeritus Managing Director of State of Formation at the Journal of Inter-Religious Dialogue, and founder of the first blog dedicated to exploring atheist-interfaith engagement, NonProphet Status. ",
            "length": "",
            "sourceUrl": ""
        },
        {
            "title": "The Humanist Hour #106: Black Nonbelievers with Mandisa Thomas",
            "datePublished": "Wed, 09 Jul 2014 13:22:00 GMT",
            "description": "In this episode, Todd and Kim interview Mandisa Thomas, Founder and current President of Black Nonbelievers, Inc., a non-profit fellowship of nonbelievers in the Atlanta area that is dedicated to providing an informative, caring, festive and family-friendly environment.\r\n\r\nAlthough never formally indoctrinated into belief, Mandisa was heavily exposed to Christianity, Black Nationalism and a bit of Islam. As a child she loved reading, and enjoyed various tales of gods from different cultures, including Greek and Ghanaian. “Through reading these stories and being taught about other cultures at an early age, I quickly noticed that there were similarities and differences between those deities and the God of the Christian Bible. I couldn’t help but wonder what made this God so special that he warrants such prevalence in today’s society,” she recalls.\r\n\r\nMandisa has been a guest on such programs as The Critical Eye, Ask an Atheist, and the Black Freethinkers Blogtalk Radio Show. As the president of Black Nonbelievers, Inc., she works to encourage more Blacks to come out and stand strong with their nonbelief in the face of such strong religious overtones. \"The more we make our presence known, the better our chances of working together to turn around some of the disparities we face. We are NOT alone.\"",
            "length": "",
            "sourceUrl": ""
        },
        {
            "title": "The Humanist Hour #105: Humanistic Parenting and Charity with Dale McGowan",
            "datePublished": "Wed, 02 Jul 2014 13:28:00 GMT",
            "description": "In this episode, Bo interviews Dale McGowan, Executive Director of Foundation Beyond Belief, a humanist charitable foundation based in Atlanta. \r\n\r\nIn 2006, Dale left a 15-year career as a college professor to pursue writing full-time. He edited and co-authored Parenting Beyond Belief (2007) and Raising Freethinkers (2009), the first com-prehensive resources for nonreligious parents, as well as Voices of Unbelief (2012) and Atheism For Dummies (2013). Dale also writes the secular parenting blog \"The Meming of Life\" and teaches nonreligious parenting seminars across the US.\r\n\r\nIn 2008, Dale was named Harvard Humanist of the Year for his work in nonreligious parenting. He holds degrees in physical anthropology and music theory from UC Berkeley as well as a Ph.D. in music composition and theory from the University of Minnesota. He and his wife Becca, a second grade teacher, live near Atlanta with their three children.",
            "length": "",
            "sourceUrl": ""
        },
        {
            "title": "The Humanist Hour #104: David Silverman, “Mr. Atheist Pants”",
            "datePublished": "Wed, 25 Jun 2014 13:27:00 GMT",
            "description": "In this episode, Bo interviews David Silverman, President of American Atheists and the creator & Executive Producer of the 2012 Reason Rally. Silverman attended Brandeis University, where he completed a Bachelor's Degree in Computer Science while honing his debate skills with theists in numerous informal debates. He previously served as a professional inventor at Bell Labs for eight years (with 74 issued patents) and a marketing director for Natural Microsystems.\r\n\r\nSilverman has been an atheist since he was six years old. He became an activist in 1996 and soon began his tenure at American Atheists, first serving as New Jersey State. Around this time, he also founded the Alliance of Lucent and AT&T Atheists and Secularists, the first employee club of its kind. He was tapped to be the National Spokesperson in 2004, and then was named Vice President in 2008. The Board of Directors elected Silverman as President in September of 2010.",
            "length": "",
            "sourceUrl": ""
        },
        {
            "title": "The Humanist Hour #103: The Myth of Gay Reparative Therapy with Dr. Michael LaSala",
            "datePublished": "Wed, 18 Jun 2014 13:50:00 GMT",
            "description": "In this episode, Bo interviews Dr. Michael LaSala on the topic of reparative therapy—attempts to convert primarily gay men and lesbian women to heterosexuals.  \r\n\r\nMichael C. LaSala, PhD is an associate professor and director of the Master of Social Work program at the School of Social Work at Rutgers University. His research examines the family relationships of gay men and lesbians and his current work looks at the role of gay and lesbian family relationships in coping with stigma and parental influence on gay youth's safe sex behaviors. ",
            "length": "",
            "sourceUrl": ""
        },
        {
            "title": "The Humanist Hour #102: Live at the 73rd Annual Conference in Philadelphia!",
            "datePublished": "Wed, 11 Jun 2014 13:22:00 GMT",
            "description": "In this episode, Bo, Kim, and Todd host this episode in front of a live audience at the 73rd Annual AHA Conference in Philadelphia. \r\n\r\nOur guest for the first half of the show is AHA Lifetime Achievement Award recipient Dr. Eugenie Scott, former Executive Director of the National Center for Science Education. For the second half of the show, Bo, Todd, and Kim interview the audience. They ask some thought-provoking and some light-hearted Humanist-related questions, provoking interesting and often amusing answers.",
            "length": "",
            "sourceUrl": ""
        },
        {
            "title": "The Humanist Hour #101: Exploring Naturalism with Tom Clark",
            "datePublished": "Wed, 04 Jun 2014 13:29:00 GMT",
            "description": "In this episode, Bo interviews Tom Clark from Naturalism.org. Tom is currently a research associate at the Institute for Behavioral Health with the Heller School at Brandeis University. He is the founder and director of the Center For Naturalism, conducting public education, policy development, and community building to promote worldview naturalism. Tom is also the editor of Naturalism.org, which is among the Web’s most comprehensive resources on worldview natural-ism, its implications and applications.",
            "length": "",
            "sourceUrl": ""
        },
        {
            "title": "The Humanist Hour #100: “Trying On Atheism” with Ryan Bell",
            "datePublished": "Wed, 28 May 2014 13:23:00 GMT",
            "description": "In this episode, Bo interviews Dr. Ryan J. Bell.  For 19 years Dr. Bell was a pastor, most recently the senior pastor of the Hollywood Seventh-day Adventist Church. In March 2013 he resigned his position due to theological and practical differences. As an adjunct professor he has taught subjects ranging from intercultural communication to bioethics.",
            "length": "0",
            "sourceUrl": "http://feedproxy.google.com/~r/HNN_Podcast/~5/c9evZrIkxLU/HH100.mp3"
        },
        {
            "title": "The Humanist Hour #99: Rockin’ Humanistic Values with Taylor Muse of Quiet Company",
            "datePublished": "Wed, 21 May 2014 13:22:00 GMT",
            "description": "In this episode, Todd and Kim interview Taylor Muse—singer, songwriter, and guitarist for the band Quiet Company. Hailing from Austin, TX, Quiet Company has been making a name for themselves nationally for their energetic live shows and anthemic, dynamic, indie-rock -- which critics have called a mix of The Beatles, Death Cab for Cutie, Arcade Fire & Weezer -- with attention from the likes of the New York Times, Paste Magazine, NPR (Top 5 Bands to See at SXSW), Last Call with Carson Daly, Houston Chronicle, Austin Chronicle and more.",
            "length": "",
            "sourceUrl": ""
        },
        {
            "title": "The Humanist Hour #98: How Jesus Became God with Dr. Bart Ehrman",
            "datePublished": "Wed, 14 May 2014 13:31:00 GMT",
            "description": "In this episode, Bo interviews Dr. Bart Ehrman, the James A. Gray Distinguished Professor at the University of North Carolina at Chapel Hill and author of the recent book, How Jesus Became God: The Exaltation of a Jewish Preacher from Galilee.",
            "length": "",
            "sourceUrl": ""
        },
        {
            "title": "The Humanist Hour #97: Science and Skepticism with Michael Shermer",
            "datePublished": "Wed, 07 May 2014 13:32:00 GMT",
            "description": "In this episode, Bo and Kim interview Dr. Michael Shermer. Dr. Shermer is the Founding Publisher of Skeptic magazine, the Executive Director of the Skeptics Society, a monthly columnist for Scientific American, the host of the The Skeptics Society’s Distinguished Science Lecture Series, and Adjunct Professor at Claremont Graduate University and Chapman University.",
            "length": "",
            "sourceUrl": ""
        },
        {
            "title": "The Humanist Hour #96: A Better Life: 100 Atheists Speak Out on Joy & Meaning in a World Without God",
            "datePublished": "Wed, 30 Apr 2014 13:38:00 GMT",
            "description": "In this episode, Bo interviews Chris Johnson, author of \"A Better Life: 100 Atheists Speak Out on Joy & Meaning in a World Without God.\"",
            "length": "",
            "sourceUrl": ""
        },
        {
            "title": "The Humanist Hour #95: Greta Christina on 'Coming Out Atheist\"",
            "datePublished": "Wed, 23 Apr 2014 13:37:00 GMT",
            "description": "In this episode, Todd and Kim interview Greta Christina, author of \"Coming Out Atheist: How to Do It, How to Help Each Other, and Why.\"",
            "length": "0",
            "sourceUrl": "http://feedproxy.google.com/~r/HNN_Podcast/~5/ZHfw7tKyV14/THH095.mp3"
        },
        {
            "title": "The Humanist Hour #94: Guy P. Harrison on Skepticism and Reason",
            "datePublished": "Wed, 09 Apr 2014 13:33:00 GMT",
            "description": "In this month’s show, Bo interviews Guy P. Harrison, author and advocate for science and reason. Listen as they discuss Guy’s latest book: \"Think: Why You Should Question Everything.\"",
            "length": "",
            "sourceUrl": ""
        },
        {
            "title": "The Humanist Hour #93: Jamila Bey",
            "datePublished": "Wed, 26 Mar 2014 14:39:00 GMT",
            "description": "Todd and Kim interview Jamila Bey, journalist and communications director for the Secular Student Alliance.  ",
            "length": "0",
            "sourceUrl": "http://feedproxy.google.com/~r/HNN_Podcast/~5/dCQWhE-csgk/THH93.mp3"
        },
        {
            "title": "The Humanist Hour #92: Dr. Anthony B. Pinn",
            "datePublished": "Thu, 27 Feb 2014 02:06:00 GMT",
            "description": "Todd and Kim interview Humanist leader, professor and author Dr. Anthony B. Pinn.",
            "length": "0",
            "sourceUrl": "http://feedproxy.google.com/~r/HNN_Podcast/~5/95E5yfDpui4/THH92.mp3"
        },
        {
            "title": "The Humanist Hour #91, Sanderson Jones",
            "datePublished": "Thu, 30 Jan 2014 13:55:00 GMT",
            "description": "In this month’s show, Todd and Kim interview Sanderson Jones, co-founder of The Sunday Assembly.",
            "length": "0",
            "sourceUrl": "http://feedproxy.google.com/~r/HNN_Podcast/~5/0GBbaCgGD9g/THH91.mp3"
        },
        {
            "title": "The Humanist Hour #90: Dr. Peter Boghossian",
            "datePublished": "Mon, 30 Dec 2013 11:03:00 GMT",
            "description": "In this month’s show, Todd and Kim interview Dr. Peter Boghossian, philosopher and the author of A Manual for Creating Atheists.",
            "length": "0",
            "sourceUrl": "http://feedproxy.google.com/~r/HNN_Podcast/~5/HgfhaXFQNxg/THH90.mp3"
        },
        {
            "title": "The Humanist Hour #89: Four Humanist Press authors",
            "datePublished": "Wed, 27 Nov 2013 10:26:00 GMT",
            "description": "Todd and Kim interview four Humanist Press authors, discovering the diversity of quality books being offered by the publishing arm of the American Humanist Association, including fiction, poetry and history.",
            "length": "0",
            "sourceUrl": "http://feedproxy.google.com/~r/HNN_Podcast/~5/TcTRcy6lJmo/THH89.mp3"
        },
        {
            "title": "The Humanist Hour #88: Nikki Stern",
            "datePublished": "Wed, 23 Oct 2013 09:00:00 GMT",
            "description": "In this month’s podcast, Todd and Kim interview author, speaker and humanist advocate Nikki Stern.",
            "length": "0",
            "sourceUrl": "http://feedproxy.google.com/~r/HNN_Podcast/~5/suy0BJ_p1Mw/THH88.mp3"
        },
        {
            "title": "The Humanist Hour #87: Dr. Marty Klein",
            "datePublished": "Wed, 25 Sep 2013 12:16:00 GMT",
            "description": "In this month’s podcast, Todd and Kim interview author and sex therapist Dr. Marty Klein.",
            "length": "0",
            "sourceUrl": "http://feedproxy.google.com/~r/HNN_Podcast/~5/sAd_f3doc_U/THH87.mp3"
        },
        {
            "title": "The Humanist Hour #86: Dan Savage",
            "datePublished": "Wed, 28 Aug 2013 13:36:00 GMT",
            "description": "In this month’s podcast, Dan Savage, 2013 Humanist of the Year, is interviewed by Dr. Marty Klein during the American Humanist Association's 72nd Annual Conference held May 30-June 2, 2013 in San Diego, CA.",
            "length": "0",
            "sourceUrl": "http://feedproxy.google.com/~r/HNN_Podcast/~5/xHu6xv-Fmio/THH86.mp3"
        },
        {
            "title": "The Humanist Hour #85: Katha Pollitt",
            "datePublished": "Wed, 31 Jul 2013 10:00:00 GMT",
            "description": "In this month’s podcast, Todd Stiefel and co-host Jamila Bey welcome Katha Pollitt, the recipient of the American Humanist Association's 2013 Humanist Heroine Award.",
            "length": "0",
            "sourceUrl": "http://feedproxy.google.com/~r/HNN_Podcast/~5/tJvFEZed3Pk/THH85.mp3"
        },
        {
            "title": "The Humanist Hour #84: Dr. Sean M. Carroll",
            "datePublished": "Wed, 26 Jun 2013 09:41:00 GMT",
            "description": "In this month’s podcast, Todd Stiefel welcomes Maggie Ardiente, Director of Development and Communications at the American Humanist Association, and Dr. Sean M. Carroll, theoretical physicist at Caltech and keynote speaker at the American Humanist Association 72nd Annual Conference held May 30-June 2, 2013 in San Diego, CA.",
            "length": "",
            "sourceUrl": ""
        },
        {
            "title": "The Humanist Hour #83: Julia Galef",
            "datePublished": "Wed, 22 May 2013 10:58:00 GMT",
            "description": "In this month’s podcast, Todd Stiefel’s co-host is Amanda K. Metskas. Together they interview Julia Galef, the president of the Center for Applied Rationality.",
            "length": "0",
            "sourceUrl": "http://feedproxy.google.com/~r/HNN_Podcast/~5/7wI699CMhHs/THH83.mp3"
        },
        {
            "title": "The Humanist Hour #82: A. C. Grayling ",
            "datePublished": "Thu, 25 Apr 2013 09:10:00 GMT",
            "description": "In this month’s podcast Todd Stiefel’s co-host is Kim Ellington. Together they interview A. C. Grayling.",
            "length": "0",
            "sourceUrl": "http://feedproxy.google.com/~r/HNN_Podcast/~5/azwChxEGG4A/THH82.mp3"
        },
        {
            "title": "The Humanist Hour #81: The Clergy Project",
            "datePublished": "Wed, 27 Mar 2013 09:04:00 GMT",
            "description": "In this month’s podcast, Todd Stiefel and Margaret Downy interview three members of The Clergy Project.",
            "length": "0",
            "sourceUrl": "http://feedproxy.google.com/~r/HNN_Podcast/~5/F-A4avmHrEE/THH81.mp3"
        },
        {
            "title": "The Humanist Hour #80: AHA President Rebecca Hale",
            "datePublished": "Tue, 26 Feb 2013 11:35:00 GMT",
            "description": "In this month’s podcast, Todd Stiefel interviews Rebecca Hale, the newly elected president of the American Humanist Association. ",
            "length": "0",
            "sourceUrl": "http://feedproxy.google.com/~r/HNN_Podcast/~5/kmP6uTeWMdA/THH80.mp3"
        },
        {
            "title": "THH Web Special: Cecil Bothwell",
            "datePublished": "Sat, 05 Jan 2013 20:59:00 GMT",
            "description": "In this THH Web Special, Todd and Jes speak with Cecil Bothwell about his experience as an atheist politician in Asheville, NC.",
            "length": "",
            "sourceUrl": ""
        },
        {
            "title": "The Humanist Hour #79: The Evolution of Comedy",
            "datePublished": "Fri, 30 Nov 2012 11:35:00 GMT",
            "description": "Todd and Jes speak with comedians Ian Harris and Jason Resler about their show, the Evolution of Comedy: Intelligently Designed Humor.",
            "length": "0",
            "sourceUrl": "http://feedproxy.google.com/~r/HNN_Podcast/~5/Sj3t0gafoVY/THH79.mp3"
        },
        {
            "title": "The Humanist Hour #78: Gloria Steinem, 2012 Humanist of the Year",
            "datePublished": "Fri, 28 Sep 2012 22:16:00 GMT",
            "description": "Jennifer Bardi, editor of the Humanist, interviews world famous author and activist Gloria Steinem. “It’s not about not believing,” says the 2012 Humanist of the Year. “It’s about rejecting a god who looks like the ruling class.”",
            "length": "0",
            "sourceUrl": "http://feedproxy.google.com/~r/HNN_Podcast/~5/rNF7jA-f6DI/THH78.mp3"
        },
        {
            "title": "The Humanist Hour #77: Nonbeiver Nation",
            "datePublished": "Fri, 31 Aug 2012 15:48:00 GMT",
            "description": "Jes and Todd interview AHA President, freethought activist, blogger and author David Niose, about his book, Nonbeliever Nation: The Rise of Secular Americans.",
            "length": "0",
            "sourceUrl": "http://feedproxy.google.com/~r/HNN_Podcast/~5/gWOd7dGlySY/THH77.mp3"
        },
        {
            "title": "The Humanist Hour #76: Cenk Uygur",
            "datePublished": "Wed, 01 Aug 2012 19:25:00 GMT",
            "description": "Jes and Todd interview the Young Turks main host and co-founder Cenk Uygur about the relationship between humanism, the media, and politics.  Cenk was awarded with the Humanist Media Award at the AHA's 71st Annual Conference.",
            "length": "0",
            "sourceUrl": "http://feedproxy.google.com/~r/HNN_Podcast/~5/JkSuU1BkMOQ/THH76.mp3"
        },
        {
            "title": "The Humanist Hour #75: America's War on Sex",
            "datePublished": "Tue, 10 Jul 2012 14:28:00 GMT",
            "description": "Jes and Todd interview Marty Klein, Ph.D.,  who suggests a humanist approach to healthy sexuality.",
            "length": "0",
            "sourceUrl": "http://feedproxy.google.com/~r/HNN_Podcast/~5/R75350G6F6c/THH75.mp3"
        },
        {
            "title": "The Humanist Hour #74: Bad Religion",
            "datePublished": "Thu, 31 May 2012 12:37:00 GMT",
            "description": "Todd Stiefel and guest co-host, Scott Burdick, interview Bad Religion lead vocalist, Greg Graffin, and bassist, Jay Bentley backstage at the Reason Rally.",
            "length": "0",
            "sourceUrl": "http://feedproxy.google.com/~r/HNN_Podcast/~5/4_6Ve7eUodQ/THH74.mp3"
        },
        {
            "title": "The Humanist Hour #73: the Reason Rally (part 2)",
            "datePublished": "Thu, 03 May 2012 20:56:00 GMT",
            "description": "In this month's podcast, experience even more of the Reason Rally, the largest gathering of the secular movement in the world, with: British stand up comedian Eddie Izzard, youTube activist Cristina Rad, long time humanist activist and leader \"the Amazing\" James Randi, best-selling author Richard Dawkins, and our very own Todd Stiefel.",
            "length": "",
            "sourceUrl": ""
        },
        {
            "title": "The Humanist Hour #72: the Reason Rally",
            "datePublished": "Fri, 30 Mar 2012 17:42:00 GMT",
            "description": "Experience the Reason Rally, the largest gathering of the secular movement in the world: Author and blogger Greta Christina tells us why she is angry, Taslima Nasrin describes her experience of fighting for secularism in a country from which she has been exiled, Mythbuster Adam Savage describes his definition of reason, with Australian musicians Tim Minchin and Shelley Segal.",
            "length": "0",
            "sourceUrl": "http://feedproxy.google.com/~r/HNN_Podcast/~5/fzkiU7Dk9PE/THH72.mp3"
        },
        {
            "title": "The Humanist Hour #71: On location in Cranston, Rhode Island",
            "datePublished": "Wed, 07 Mar 2012 15:51:00 GMT",
            "description": "Jes Constantine heads to Cranston, RI to hear the local residents, students, and teachers voice their opinion about the Cranston High School West prayer banner.  Also, listen to Ellery Schempp tell the story of his landmark US Supreme Court case from over 50 years ago, ruling government sanctioned prayer unconstitutional.",
            "length": "0",
            "sourceUrl": "http://feedproxy.google.com/~r/HNN_Podcast/~5/v66E-IMPjQo/THH71.mp3"
        },
        {
            "title": "The Humanist Hour #70: Humanist Community Project",
            "datePublished": "Fri, 27 Jan 2012 13:29:00 GMT",
            "description": "Jes Constantine and Todd Stiefel speak with Harvard University's Humanist Chaplain, Greg Epstein, about the Humanist Community Project.  Plus, hear a followup interview with Dr. Darrel Ray about his new book: Sex and God: How Religion Distorts Sexuality.",
            "length": "0",
            "sourceUrl": "http://feedproxy.google.com/~r/HNN_Podcast/~5/rJQ_i0B90zs/THH70.mp3"
        },
        {
            "title": "The Humanist Hour #69: Freethought Mixtape",
            "datePublished": "Wed, 28 Dec 2011 08:06:00 GMT",
            "description": "Jes Constantine and Todd Stiefel interview satirical musician Roy Zimmerman, Australian freethought singer / songwriter Shelley Segal, and rational rocker Bruce Harris from Words Such As Burn, about their experience as atheist artists in the music industry.",
            "length": "",
            "sourceUrl": ""
        },
        {
            "title": "THH #68: Serving the Humanist Community",
            "datePublished": "Fri, 02 Dec 2011 11:18:00 GMT",
            "description": "Jes Constantine and Todd Stiefel interview Rabbi Binyamin Biber about his services to the community as a Humanist Celebrant and Humanist Chaplain at American University. Also, we highlight the AHA’s recent “Naughty” Awareness Campaign, aimed to raise awareness of discrimination against nonbelievers in America.",
            "length": "0",
            "sourceUrl": "http://feedproxy.google.com/~r/HNN_Podcast/~5/UyNl__D402g/THH68.mp3"
        },
        {
            "title": "THH #67: Reason Rally",
            "datePublished": "Thu, 27 Oct 2011 02:10:00 GMT",
            "description": "Jes Constantine and Todd Stiefel interview American Atheists' president, David Silverman, about the largest secular event in world history-the Reason Rally.  Jes and Todd also discuss a listener comment about the proposed personhood amendment.",
            "length": "0",
            "sourceUrl": "http://feedproxy.google.com/~r/HNN_Podcast/~5/x1Qq9PYcF7o/THH67.mp3"
        },
        {
            "title": "THH #66: Steve Wozniak and American teenage atheists",
            "datePublished": "Thu, 29 Sep 2011 19:51:00 GMT",
            "description": "Todd Stiefel interviews Apple's Co-Founder, author, and the 2011 recipient of the American Humanist Association's Isaac Asimov Science award, Steve Wozniak about the importance of skepticism in today's youth. Also, hear about the experience of two American teenagers who are out as atheists.",
            "length": "0",
            "sourceUrl": "http://feedproxy.google.com/~r/HNN_Podcast/~5/T2pOOzdiOIM/THH66.mp3"
        },
        {
            "title": "THH #65: Hemant Mehta, the Friendly Atheist",
            "datePublished": "Thu, 01 Sep 2011 15:13:00 GMT",
            "description": "Jes Constantine and Todd Stiefel talk to Hemant Mehta, the Friendly Atheist, about his activism in the freethought movement. Hemant also gives Jes and Todd a brief public speaking lesson and pop quiz. Plus, learn about the latest news with Rock Beyond Belief and the Reason Rally!",
            "length": "",
            "sourceUrl": ""
        },
        {
            "title": "THH #64: Matthew Chapman and The Ledge",
            "datePublished": "Thu, 28 Jul 2011 02:31:00 GMT",
            "description": "Jes Constantine and Todd Stiefel interview writer, director, and producer, Matthew Chapman about the release of his film, The Ledge and also Science Debate 2012.",
            "length": "",
            "sourceUrl": ""
        },
        {
            "title": "THH #63: Sex and Secularism",
            "datePublished": "Thu, 23 Jun 2011 01:08:00 GMT",
            "description": "Jes Constantine and Todd Stiefel interview organizational psychologist, Dr. Darrell Ray, about his recent empirical study, called Sex and Secularism: What Happens When You Leave Religion? Also, listen to an interview with movie writer and producer, Matthew Chapman, about his upcoming film, The Ledge.\r\n\r\nThis episode contains explicit content and listener discretion is advised.",
            "length": "",
            "sourceUrl": ""
        },
        {
            "title": "THH #62: Candace Gingrich-Jones: Humanist Pride",
            "datePublished": "Wed, 25 May 2011 22:10:00 GMT",
            "description": "Jes Constantine and Todd Stiefel reflect on the AHA 70th Annual Conference, highlighting the acceptance speech by Candace Gingrich-Jones, the first ever awardee of the LGBT Humanist Pride Award. Also, listen to an interview with Candace and some special guest interviewers.  Tune in next month for our sex episode!\r\n",
            "length": "",
            "sourceUrl": ""
        },
        {
            "title": "THH #61: Rebecca Goldstein, Humanist of the Year",
            "datePublished": "Mon, 02 May 2011 16:24:00 GMT",
            "description": "Jes Constantine and Todd Stiefel reflect on the AHA 70th Annual Conference, highlighting the acceptance speech by Humanist of the Year, Rebecca Goldstein. Also, listen to an interview with a very special surprise guest.  Don’t forget to celebrate the National Day of Reason on Thursday, May 5, 2011!",
            "length": "0",
            "sourceUrl": "http://feedproxy.google.com/~r/HNN_Podcast/~5/yRHrKPVghLg/thh61.mp3"
        },
        {
            "title": "THH #60: Shining the Light of Reason",
            "datePublished": "Thu, 24 Mar 2011 10:45:00 GMT",
            "description": "Jes Constantine and Todd Stiefel interview Fred Edwords of United Coalition of Reason, debate the concept that vegan priorities are humanist priorities with surprise special guest, Jason Torpy, and highlight the AHA 70th Annual Conference with AHA staffer, Maggie Ardiente. ",
            "length": "0",
            "sourceUrl": "http://feedproxy.google.com/~r/HNN_Podcast/~5/9KEJUUQJauo/thh60.mp3"
        },
        {
            "title": "THH #59: Introducing Todd Stiefel",
            "datePublished": "Wed, 23 Feb 2011 23:48:00 GMT",
            "description": "Listen to Jes Constantine interview her new co-host, Todd Stiefel.  Todd Stiefel lives in Raleigh, NC. He is a secular humanist, an atheist and full-time freethought activist.",
            "length": "",
            "sourceUrl": ""
        },
        {
            "title": "THH #58: Soldier Spiritual Fitness, Rock Beyond Belief, and Darwin Day",
            "datePublished": "Thu, 27 Jan 2011 15:41:00 GMT",
            "description": "Jes Constantine and guest interviewer, Todd Stiefel, speak with Justin Griffith about his experience as an atheist in the U.S. Army and, more specifically, about failing the Spiritual Fitness component of the Comprehensive Soldier Fitness test and turning that experience into a freethought activist opportunity with Rock Beyond Belief.  Also: don't forget to celebrate Darwin Day this February 12th!  Happy Birthday, Charles!",
            "length": "0",
            "sourceUrl": "http://feedproxy.google.com/~r/HNN_Podcast/~5/-MKfND0nR1o/thh58.mp3"
        },
        {
            "title": "THH #57: Jean Shepherd, In God We Trust (All Others Pay Cash)",
            "datePublished": "Wed, 22 Dec 2010 23:39:00 GMT",
            "description": "Listen to the magical monologist, Jean Shepherd, read an excerpt from his 1966 book, \"In God We Trust (All Others Pay Cash)\", which originally appeared in the December 1965 edition of Playboy.",
            "length": "0",
            "sourceUrl": "http://feedproxy.google.com/~r/HNN_Podcast/~5/nE_1l81e2WI/thh_57.mp3"
        },
        {
            "title": "THH #56: Onward Christian Athletes",
            "datePublished": "Wed, 24 Nov 2010 11:40:00 GMT",
            "description": "\"Onward Christian Athletes\" author, Tom Krattenmaker, presents his book to AHA's 69th Annual Conference attendees.  Also learn more about the largest non-religious ad campaign, launched earlier in November by the American Humanist Association.",
            "length": "0",
            "sourceUrl": "http://feedproxy.google.com/~r/HNN_Podcast/~5/qsJNT1J-7cA/thh56.mp3"
        },
        {
            "title": "THH#55: Barefoot rEVOLUTION?",
            "datePublished": "Wed, 27 Oct 2010 21:37:00 GMT",
            "description": "Jes Constantine interviews Dr. Daniel Lieberman, a professor of Human Evolutionary Biology at Harvard and Dr. Daniel Howell, author of The Barefoot Book about the benefits of barefoot living and how it relates to humanism.",
            "length": "0",
            "sourceUrl": "http://feedproxy.google.com/~r/HNN_Podcast/~5/Md8C0aLDrA0/thh55.mp3"
        },
        {
            "title": "The Humanist Hour #54: Q+A with Bill Nye the Science Guy and LGBT Humanist Council update",
            "datePublished": "Wed, 22 Sep 2010 23:46:00 GMT",
            "description": "In this month's audio podcast, Jes Constantine plays another clip from AHA's 69th Annual Conference, which took place earlier this summer in San Jose, CA.  Listen to Bill Nye the Science Guy answer questions from the conference attendees, after accepting our Humanist of the Year award.  Also hear Jes Constantine's interview with Jason Frye of the Humanist Association of San Diego and the LGBT Humanist Council.",
            "length": "0",
            "sourceUrl": "http://feedproxy.google.com/~r/HNN_Podcast/~5/8pZi-j4E5Fc/thh_54.mp3"
        },
        {
            "title": "The Humanist Hour #53: Bill Nye the Science Guy, Humanist of the Year",
            "datePublished": "Wed, 25 Aug 2010 21:17:00 GMT",
            "description": "Jes Constantine and guest co-host Jennifer Bardi introduce and discuss clips from AHA's 69th Annual Conference, which took place earlier this summer in San Jose, CA. Listen to Bill Nye the Science Guy accepting our Humanist of the Year award.",
            "length": "",
            "sourceUrl": ""
        },
        {
            "title": "HNN#52: Humanist Heroines",
            "datePublished": "Thu, 29 Jul 2010 06:33:00 GMT",
            "description": "Jes Constantine and guest co-host Jennifer Bardi introduce and discuss clips from AHA's 69th Annual Conference, which took place earlier this summer in San Jose, CA. Listen to clips of Meg Bowman and Annie Laurie Gaylor accepting our Humanist Heroine award. Also, learn about the exciting news regarding the HNN podcast.",
            "length": "0",
            "sourceUrl": "http://feedproxy.google.com/~r/HNN_Podcast/~5/m--3AWPnwFM/hnn52.mp3"
        },
        {
            "title": "HNN#51: Wendy Liu, Humanist Pioneer",
            "datePublished": "Wed, 23 Jun 2010 19:15:00 GMT",
            "description": "Jes Constantine introduces clips from AHA's 69th Annual Conference.",
            "length": "0",
            "sourceUrl": "http://feedproxy.google.com/~r/HNN_Podcast/~5/LToDp75R0UY/HNN51.mp3"
        },
        {
            "title": "HNN#50: Special Anniversary Show and Farewell, Jende!",
            "datePublished": "Wed, 26 May 2010 21:00:00 GMT",
            "description": "Jende Huang, Jes Constantine, and a special guest host discuss some of their favorite moments from the past 49 episodes of the Humanist Network News podcast.",
            "length": "0",
            "sourceUrl": "http://feedproxy.google.com/~r/HNN_Podcast/~5/gJcTThIjq7s/HNN50.mp3"
        },
        {
            "title": "HNN#49: Foundation Beyond Belief",
            "datePublished": "Tue, 27 Apr 2010 20:17:00 GMT",
            "description": "In this episode, Jende Huang and Jes Constantine speak with Dale McGowan, founder and executive director of the Foundation Beyond Belief.",
            "length": "0",
            "sourceUrl": "http://feedproxy.google.com/~r/HNN_Podcast/~5/4r54ZtA-8wI/HNN49.mp3"
        },
        {
            "title": "HNN#48: Ethical Focus",
            "datePublished": "Wed, 24 Mar 2010 19:26:00 GMT",
            "description": "In this month's audio podcast, Jende Huang and Jes Constantine visit the Ethical Culture Society of Bergen County in Teaneck, NJ and are the speakers at the society's Sunday platform.",
            "length": "0",
            "sourceUrl": "http://feedproxy.google.com/~r/HNN_Podcast/~5/lyViLegrCRo/HNN48.mp3"
        },
        {
            "title": "HNN#47: Sebastian Velez in Haiti",
            "datePublished": "Wed, 24 Feb 2010 11:24:00 GMT",
            "description": "In this month's audio podcast, Jes Costantine and Jende Huang\r\ninterview Sebastian Velez about his recent experiences in Haiti,\r\nfollowing the earthquake that struck on Jan 12, 2010. Velez, a member\r\nof the Harvard Atheists, Skeptics and Humanists, as well as a leader\r\nof Children of the Border, was on his way to the island nation, when\r\nthe earthquake struck. Hear him speak about what he saw on the ground\r\nin Jacmel, as well as the broader situation in Haiti, and how you can\r\ncontinue to help the people of Haiti.",
            "length": "",
            "sourceUrl": ""
        },
        {
            "title": "HNN 46: The HEADS Meeting",
            "datePublished": "Wed, 27 Jan 2010 19:39:00 GMT",
            "description": "Jende Huang drops in on the HEADS meeting and speaks to some leaders from across the movement about their upcoming plans for 2010.",
            "length": "11000",
            "sourceUrl": "http://feedproxy.google.com/~r/HNN_Podcast/~5/6Gda-WK1BMM/HNN46.mp3"
        },
        {
            "title": "HNN 45: Good without God",
            "datePublished": "Wed, 23 Dec 2009 17:01:00 GMT",
            "description": "In this month's audio podcast, Jende speaks with Harvard Humanist Chaplain Greg Epstein about his new book “Good without God: What a Billion Nonreligious People Do Believe.”",
            "length": "20000",
            "sourceUrl": ""
        },
        {
            "title": "HNN 44: HumanLight",
            "datePublished": "Wed, 25 Nov 2009 07:50:00 GMT",
            "description": "In this month's audio podcast, Jende speaks with Patrick Colucci, the vice chair of the HumanLight committee. The two discuss this humanist holiday, now in its 8th year of celebration. Learn more about why it is celebrated, how it is celebrated, and how your family and community can take part!",
            "length": "23",
            "sourceUrl": "http://feedproxy.google.com/~r/HNN_Podcast/~5/PMi-2A098GQ/Humanist_Network_News_44.mp3"
        },
        {
            "title": "HNN 43: AAI '09 Darwin Legacy Convention + The Atheist Camel",
            "datePublished": "Wed, 28 Oct 2009 07:24:00 GMT",
            "description": "In this month's audio podcast, Jende attends the Atheist Alliance International Convention in Burbank, CA, and hears from an assorted number of conference attendees who make up our movement. Listen in as he talks with an Objectivist-influenced rock band, a leader from a Ethical Culture Society, the founder of a freethought film festival, an Arab atheist, and a Pilates instructor--all who came together in California to take part in AAI's annual conference. Also, Jes interviews one of the founders of Eternal Earth-Bound Pets, a post-rapture pet rescue program run by atheists.",
            "length": "30",
            "sourceUrl": "http://feedproxy.google.com/~r/HNN_Podcast/~5/tHNGAPOm9X0/Humanist_Network_News_43.mp3"
        },
        {
            "title": "HNN 42: Unscientific America",
            "datePublished": "Wed, 23 Sep 2009 19:34:00 GMT",
            "description": "In this month's podcast, hear from Chris Mooney and Sheril\r\nKirshenbaum, co-authors of the recently released Unscientific America:\r\nHow Scientific Illiteracy Threatens Our Future as they speak with\r\nJennifer Bardi, editor of the Humanist magazine. Kirshenbaum and\r\nMooney will discuss what scientific illiteracy means for our society,\r\npossible ways to combat it, and the disagreements they have with the\r\nso-called New Atheists over religion.",
            "length": "31",
            "sourceUrl": "http://feedproxy.google.com/~r/HNN_Podcast/~5/iQznYzhtqk4/Humanist_Network_News_42.mp3"
        },
        {
            "title": "HNN 41: Crossing the Streams",
            "datePublished": "Wed, 26 Aug 2009 15:42:00 GMT",
            "description": "In this month's audio podcast, Humanist Network News airs its final installment from the American Humanist Association's 68th Annual Conference in Phoenix, AZ. Hear from Norma Ramos, the co-executive director of the Coalition Against Trafficking of Women, as she discusses the perils women face in the sex industry; the Rev. Barry Lynn, executive director of Americans United for Separation of Church and State as he discusses the role that religious believers and humanists can play in defending separation of religion and government; Hillary Matfes, a high school activist that's leading the way with the Secular Principles Pinky Swear and from 2009 Humanist of the Year PZ Myers, as he discusses what happened to him as a child that tore down the wall between his religious beliefs and his love for science.",
            "length": "",
            "sourceUrl": ""
        },
        {
            "title": "HNN 40: Popularizing Science",
            "datePublished": "Wed, 22 Jul 2009 14:10:00 GMT",
            "description": "In this month's audio podcast, Humanist Network News offers even more footage from the American Humanist Association's 68th Annual Conference in Phoenix, AZ.  Hear our interviews with astrophysicist Neil deGrasse Tyson, director of the Hayden Planetarium, as he talks about his approach to communicating science to the public; and Barbara Forrest, as she discusses the current state of the intelligent design movement; as well as a talk by Donald Johanson, offering his take on the controversy of popularizing science by touring ancient hominid fossils.",
            "length": "",
            "sourceUrl": ""
        },
        {
            "title": "HNN 39: Neil deGrasse Tyson",
            "datePublished": "Fri, 17 Jul 2009 11:17:00 GMT",
            "description": "In this month's audio podcast, Humanist Network News travels to Phoenix, AZ and take spart in the 68th annual conference of the American Humanist Association. Hear \"keynote remarks\" from noted astrophysicist Neil deGrasse Tyson, director of the Hayden Planetarium, as he reflects on science and culture in American life.",
            "length": "0",
            "sourceUrl": "http://feedproxy.google.com/~r/HNN_Podcast/~5/Mb0x5so1JT8/Humanist_Network_News__39.mp3"
        },
        {
            "title": "HNN 38: Meet the American Humanist Association",
            "datePublished": "Fri, 17 Jul 2009 11:16:00 GMT",
            "description": "In this month's audio podcast, Jes Costantine and new co-host Jende Huang are in Washington D.C. to interview staff members of the American Humanist Association. Learn what goes on behind the scenes at one of the largest humanist organizations in the world, and hear what AHA staffers have planned for the future. ",
            "length": "0",
            "sourceUrl": "http://feedproxy.google.com/~r/HNN_Podcast/~5/v8MKc-QK3q8/Humanist_Network_News__38.mp3"
        },
        {
            "title": "HNN 31: HNN Highlights",
            "datePublished": "Fri, 17 Jul 2009 11:15:00 GMT",
            "description": "This month's Humanist Network News podcast is a special promotional show recorded for the World Humanist Congress of the International Humanist and Ethical Union which will be held in Washington DC from June 5-8, 2008. The program contains excerpts from dozens previously released HNN interviews, including Sir Salman Rushdie, Richard Dawkins, E.O. Wilson and many other notable humanists. Old interviews are re-mastered for improved sound quality. ",
            "length": "0",
            "sourceUrl": "http://feedproxy.google.com/~r/HNN_Podcast/~5/Qekjx2FqXAk/Humanist_Network_News__31.mp3"
        },
        {
            "title": "Humanist Network News Podcast Promo",
            "datePublished": "Fri, 17 Jul 2009 11:13:00 GMT",
            "description": "The Humanist Network News (HNN) Audio Podcast is a monthly one-hour talk show produced by the American Humanist Association.\r\n\r\nEvery episode of the HNN Audio Podcast explores a different area of humanist thought, from politics to pop culture.\r\n\r\nHumanism is a philosophy of life inspired by humanity and guided by reason. Humanists strive to lead ethical and joyful lives without supernatural belief in gods, heaven or hell.\r\n\r\nA typical episode of the HNN Audio Podcast features interviews, commentary, news, music, and listener comments recorded on our Toll Free HNN Listener Comment Line. Notable guests have included Sir Salman Rushdie, Prof. Richard Dawkins, Sam Harris, Christopher Hitchens, E.O. Wilson, Alan Dershowitz, Holly Near, Dar Williams and Julia Sweeney.\r\n\r\nThe HNN Audio Podcast is hosted and produced by American Humanist Association staffers (as of 5/2009) Jende Huang and Jessica Constantine.",
            "length": "5",
            "sourceUrl": "http://feedproxy.google.com/~r/HNN_Podcast/~5/3DWlcI0TAdM/HumanistNetworkNews_promo44.mp3"
        }
    ]
}