{
    "artwork": "http://is5.mzstatic.com/image/thumb/Music71/v4/e3/63/81/e36381a1-1ed8-0c5d-1f40-1e6c0c013bc0/source/100x100bb.jpg",
    "description": "Proudly Unemployable - Where host Michael O'Neal chats with other unemployable people like himself to learn how to take your skills and hobbies and turn them into a business. Nominated As \"Best New Show of 2013\" by Stitcher Radio, Our range of guests takes us from comedy, to acting, to the NFL, to UFC and MMA,  to Top Music Stars, to Millionaires, to Business Experts, to Real Estate moguls, and everything in between. Guests like James Altucher, Adam Carolla, Hines Ward, Sam Jones, Tucker Max, Jonathan Fields, Derek Halpern, Pat Flynn, Amy Porterfield, John Lee Dumas, Chris Ducker, Chris Brogan, Guy Kawasaki, Mike Johnston, Rich Franklin, Jack Canfield, Michael Gerber, and many more, these casual conversations contain tons of action-inducing content wrapped up in an entertaining candy shell.",
    "feedURL": "https://solopreneurhour.com/?feed=podcast",
    "podcastURL": "https://solopreneurhour.com",
    "title": "The Solopreneur Hour Podcast with Michael O'Neal - Proudly Unemployable™",
    "episodes": [
        {
            "title": "818: The Ultimate COVID Pivot: Turning Your Brain Inside Out, with Gary Arndt",
            "datePublished": "Mon, 02 Nov 2020 19:14:17 +0000",
            "description": "So, what if you made your living by traveling around the world and taking pictures, then they shut they world down?  Well, that’s what today’s guest, Gary Arndt (http://everything-everywhere.com) had to do.  Listen in to see how he solved the problem by “turning his brain inside out” and creating monetizable content. Check out his new […]",
            "length": "77577949",
            "sourceUrl": "https://traffic.libsyn.com/secure/solohour/818.mp3",
            "categories": [
                "Podcast"
            ]
        },
        {
            "title": "817: Matt Farah, Pivoting, and Westside Collector Car Storage",
            "datePublished": "Fri, 16 Oct 2020 19:19:01 +0000",
            "description": "Today’s returning guest is Matt Farah from Westside Collector Car Storage, a first class car storage facility he’s spent the last 5 years wrangling the City of Los Angeles to build.   His whole business model changed when he decided to simplify his (1 million sub) YouTube channel and branched off into this entrepreneurial venture. Check […]",
            "length": "95606263",
            "sourceUrl": "https://traffic.libsyn.com/secure/solohour/817.mp3",
            "categories": [
                "Podcast"
            ]
        },
        {
            "title": "816: Build Your Amazon Empire From Home – Incredible Tips from Amazon Megaseller, Ashley Armstrong",
            "datePublished": "Tue, 15 Sep 2020 20:06:48 +0000",
            "description": "Ashley Armstrong (http://amazauthority.com) was raised a world-class athlete, and has applied that same mentality to not only growing multiple 7 figure Amazon businesses, but helping A-listers and budding entrepreneurs as well.  In this episode she shares her journey as well as tricks of the trade. She’s also got an incredible bit of software, http://productinfographic.com that […]",
            "length": "101695654",
            "sourceUrl": "https://traffic.libsyn.com/secure/solohour/816.mp3",
            "categories": [
                "Podcast"
            ]
        },
        {
            "title": "815: Are You Coachable?  How to Be A Great Student",
            "datePublished": "Fri, 28 Aug 2020 19:32:14 +0000",
            "description": "On this episode I chat about a recent experience I had with someone that was tough to coach, which opened up the conversation about “being coachable”.",
            "length": "39910172",
            "sourceUrl": "https://traffic.libsyn.com/secure/solohour/815.mp3",
            "categories": [
                "Podcast"
            ]
        },
        {
            "title": "814: Operating “Normally” Despite Life’s MAJOR Curveballs, with J Ryan",
            "datePublished": "Tue, 18 Aug 2020 16:52:26 +0000",
            "description": "My buddy J Ryan (Late Night Playset) stopped by to talk about how he got into TV production, what happened when he stole David Letterman’s microphone (for real) and how to operate “normally” when life hands you a hurricane. Check out Late Night Playset on Youtube:  https://www.youtube.com/channel/UC1EtbLjzhUQ4_z0JP-0_KJw?sub_confirmation=1 And on IG: http://instagram.com/latenightplayset",
            "length": "103776404",
            "sourceUrl": "https://traffic.libsyn.com/secure/solohour/814.mp3",
            "categories": [
                "Podcast"
            ]
        },
        {
            "title": "813: Passion & Persistence Are The Key To Your Success",
            "datePublished": "Thu, 06 Aug 2020 19:54:50 +0000",
            "description": "On today’s quickie episode, I talk about how having a true passion for something, and persistence in spite of adversity is the real key to success.  If you are passionate about something, you are going to want to create content and build a community around it. If you are persistent, inevitably, your goal will be […]",
            "length": "29779573",
            "sourceUrl": "https://traffic.libsyn.com/secure/solohour/813.mp3",
            "categories": [
                "Podcast"
            ]
        },
        {
            "title": "812: Ant Anstead of Wheeler Dealers/Master Mechanic – The Passion Behind The Work",
            "datePublished": "Wed, 27 May 2020 20:01:16 +0000",
            "description": "Ant Anstead (http://antanstead.com) hosted me in his garage (Pronounced “Gare Edge”) for a sit down about his career, his current projects, and the real passion behind the work.  We talked about overcoming adversity, the “solace” of being in the garage and making something from scratch, as well as making the leap from a police officer […]",
            "length": "99905914",
            "sourceUrl": "https://traffic.libsyn.com/secure/solohour/812.mp3",
            "categories": [
                "Podcast"
            ]
        },
        {
            "title": "811: How to Build An Incredible Coaching Business From Scratch with Marni Battista",
            "datePublished": "Mon, 18 May 2020 18:34:11 +0000",
            "description": "Today we’ve got powerhouse dating coach Marni Battista (http://datingwithdignity.com) on the show talking about how to build an incredible coaching business, how she helps her clients find love and connection, and tips for coping with Zoom and Facetime during the Pandemic.  ",
            "length": "84194933",
            "sourceUrl": "https://traffic.libsyn.com/secure/solohour/811.mp3",
            "categories": [
                "Podcast"
            ]
        },
        {
            "title": "810: The TRUE Power of Positivity, with David TS Wood",
            "datePublished": "Tue, 12 May 2020 01:41:35 +0000",
            "description": "My old friend/mentor (friendtor?) David TS Wood stopped by to chat about his new YouTube show, My Extra Mile, Conversations with David TS Wood. (Click to subscribe) Readily apparent, amongst other things, is that David has a real knack for staying positive during situations that would make most of us fly off the handle.  You […]",
            "length": "97516316",
            "sourceUrl": "https://traffic.libsyn.com/secure/solohour/810.mp3",
            "categories": [
                "Podcast"
            ]
        },
        {
            "title": "809: Your Questions, Answered!",
            "datePublished": "Fri, 08 May 2020 21:01:05 +0000",
            "description": "On today’s episode of free coaching Friday we talk pivoting when events and live performance is your jam, and lots of other stuff. Featured ads on this episode: This episode is brought to you by private coaching with Michael O’Neal! CLICK HERE to check out the options.",
            "length": "47165630",
            "sourceUrl": "http://traffic.libsyn.com/solohour/809.mp3",
            "categories": [
                "Podcast"
            ]
        },
        {
            "title": "808: Steve Sims on Being Authentic & How to Properly Build Your Personal Brand",
            "datePublished": "Mon, 04 May 2020 20:26:38 +0000",
            "description": "My old bud Steve Sims (http://stevedsims.com) chatted us up today about COVID pivots (he speaks a lot), how he’s branched out from BlueFish, how he’s growing his personal brand, and his Friday virtual happy hour. Steve: Many speakers who claim to be “onions” – i.e. wrapped in mystical and magical layers of enigmatic meaning – […]",
            "length": "79987003",
            "sourceUrl": "http://traffic.libsyn.com/solohour/808.mp3",
            "categories": [
                "Podcast"
            ]
        },
        {
            "title": "807: Free Coaching Friday, COVID Edition!",
            "datePublished": "Fri, 01 May 2020 20:48:17 +0000",
            "description": "On today’s, episode, we cover pricing, automation, English as a 2nd language, YouTube, Podcasting, lighting, product prototyping, and more! If you purchase anything from Amazon, consider using http://solohour.com/amazon first (That’s my affiliate link) before you buy.  It won’t cost you anything, but it will put a bit of wind in our sails!",
            "length": "63605467",
            "sourceUrl": "http://traffic.libsyn.com/solohour/807.mp3",
            "categories": [
                "Podcast"
            ]
        },
        {
            "title": "806: COVID Reality Check with Brad Costanzo. Conspiracy Theories, oh My!",
            "datePublished": "Wed, 29 Apr 2020 22:38:42 +0000",
            "description": "My pal Brad Costanzo virtually stopped by for a chat about Covid 19, conspiracy theories, how he’s pivoting, and a million other subjects. Check out Bacon Wrapped Business.   ",
            "length": "92561305",
            "sourceUrl": "http://traffic.libsyn.com/solohour/806.mp3",
            "categories": [
                "Podcast"
            ]
        },
        {
            "title": "805: Keeping Your Head in the Game During the COVID-19 Crisis, With Toby Salgado",
            "datePublished": "Mon, 20 Apr 2020 19:53:11 +0000",
            "description": "Today we brought our old buddy back, Toby Salgado, host of the super agents live podcast. We were sort of all over the map in the show, but a common theme was just keeping your head in the game and remember that you ultimately have control of your life right now, even though at times […]",
            "length": "83985849",
            "sourceUrl": "https://traffic.libsyn.com/solohour/805.mp3",
            "categories": [
                "Life Coaching",
                "Mindset & Overcoming Adversity",
                "Podcast",
                "Podcasting"
            ]
        },
        {
            "title": "804: (CoronaVirus Tips) How to Pivot Your Career, Learn Anything New, or Start a New Hobby",
            "datePublished": "Mon, 23 Mar 2020 22:31:04 +0000",
            "description": "In these troubled times, many of us wish we had a skill sets week could accomplish from home or if you’ve been guilty of saying “I always wanted to do Blanck, but I never had the time”, this show is for you. Relevant Links: https://www.solohourbook.com Featured ads on this episode: This episode is brought to […]",
            "length": "28133593",
            "sourceUrl": "https://traffic.libsyn.com/solohour/804.mp3",
            "categories": [
                "Podcast"
            ]
        },
        {
            "title": "803: Does Your Past Have to Dictate Your Future? With Dr. Benjamin Hardy",
            "datePublished": "Thu, 06 Feb 2020 22:17:32 +0000",
            "description": "Do your past experiences have to inform your future life, or can you create your own reality? Today we talk to organizational psychologist Dr. Benjamin Hardy about how do you radically change your life in as little as 30 days. I’ll takes is the right mindset, and some consistency. Relevant Links: https://www.benjaminhardy.com PRE order Ben’s […]",
            "length": "85764077",
            "sourceUrl": "https://traffic.libsyn.com/solohour/803.mp3",
            "categories": [
                "Podcast"
            ]
        },
        {
            "title": "802: THE Conference You Should Attend in 2020, with Chris Krimitsos, and Why You Should Start Ugly.",
            "datePublished": "Thu, 23 Jan 2020 00:41:48 +0000",
            "description": "My buddy Chris Krimitsos was on the show today, talking about what I consider to be the best conference of the year, which is Vig Fest and pod fest in Orlando Florida, from March 6 to the eighth. We talked about YouTube, starting a podcast with a great niche and why it matters, why are […]",
            "length": "49191920",
            "sourceUrl": "https://traffic.libsyn.com/solohour/802.mp3",
            "categories": [
                "Podcast"
            ]
        },
        {
            "title": "801: Building a 1 Million Subscriber YouTube Channel, with Sean Cannell from Think Media",
            "datePublished": "Thu, 09 Jan 2020 22:13:59 +0000",
            "description": "Sean Cannell from Think Media and I sat down in the lobby of the Mirage Hotel during CES 2020, and dug into how Sean is on the brink of 1 million subscribers on YouTube.  Sean gives SUCH tremendous value on all of his YouTube videos…you often can’t believe that they are free! Think Media on […]",
            "length": "62917208",
            "sourceUrl": "https://traffic.libsyn.com/solohour/801.mp3",
            "categories": [
                "Podcast"
            ]
        },
        {
            "title": "800: Evolution, Commitment, and Growth With Mike Johnston",
            "datePublished": "Mon, 23 Dec 2019 20:18:06 +0000",
            "description": "I struggled a bit on what to do for this epic episode 800. I finally settled on interviewing one of my good buddies who inspires me daily, professional educator and Drummer Mike Johnston. He’s one of the OG’s of this show, and I’m always amazed how he continually innervates in the entrepreneurial space. Typically I […]",
            "length": "70502960",
            "sourceUrl": "https://traffic.libsyn.com/solohour/800.mp3",
            "categories": [
                "Podcast"
            ]
        },
        {
            "title": "799: How I Increased My YouTube Views by Over 999%!",
            "datePublished": "Mon, 16 Dec 2019 21:41:41 +0000",
            "description": "In the special YouTube episode, I talk about the strategies and research I used to grow my YouTube channel rapidly in the last couple of weeks. One of the most important lessons we can learn in the solopreneur space is patience. I have been plugging away for a couple of years, and on this episode […]",
            "length": "21537087",
            "sourceUrl": "https://traffic.libsyn.com/solohour/799.mp3",
            "categories": [
                "Podcast"
            ]
        },
        {
            "title": "798: A Massive YouTube Hack to Increase Views, and Your Questions",
            "datePublished": "Mon, 09 Dec 2019 20:03:38 +0000",
            "description": "On today’s show I describe a hack I implemented to increase the views on my YouTube channel I over 620%. Then I cruise through all of your questions, and I got to tell you, it was great to be back! Relevant Links: https://www.rennch.com/YouTube Featured ads on this episode: My favorite all in one marketing platform […]",
            "length": "37165412",
            "sourceUrl": "https://traffic.libsyn.com/solohour/798.mp3",
            "categories": [
                "Podcast"
            ]
        },
        {
            "title": "797: How to Become a Stock Market, Forex, or Options Trader with Anmol Singh",
            "datePublished": "Tue, 26 Nov 2019 05:38:15 +0000",
            "description": "Stock market guru Anmol Singh from livetrader.com is on the show today. He talks about how he got his start trading, what kind of person is the perfect profile to become a traitor, how much money you need to do it, what you were expected returns could be, and gives us some great resources and […]",
            "length": "78669847",
            "sourceUrl": "https://traffic.libsyn.com/solohour/797.mp3",
            "categories": [
                "Podcast"
            ]
        },
        {
            "title": "796: Steve Weatherford Will Make You Want to Run Through a Brick Wall",
            "datePublished": "Mon, 04 Nov 2019 05:55:46 +0000",
            "description": "Former New York Giants kicker Steve Weatherford was in Studio today. After retiring from the NFL, Steve has become a motivational and mindset coach that will make you re-frame and re-think most of the decisions you make during the course of the day. His mindset is of a true champion, and if you are in […]",
            "length": "65941264",
            "sourceUrl": "https://traffic.libsyn.com/solohour/796.mp3",
            "categories": [
                "Podcast"
            ]
        },
        {
            "title": "795:  How to Create Your Own Mobile App, With Sean Casto of PreApps.com",
            "datePublished": "Mon, 28 Oct 2019 22:24:10 +0000",
            "description": "Have you ever thought “Man, I wish there was an app for that!”. Today’s guest, Sean Casto of https://preapps.com, has helped hundreds of people create apps. Today we chat about how he got into the app game, and the steps necessary to create your own app! Sean Casto is the founder of the premier app […]",
            "length": "40814456",
            "sourceUrl": "https://traffic.libsyn.com/solohour/795.mp3",
            "categories": [
                "Podcast"
            ]
        },
        {
            "title": "794: CRASH Course for Success With Jason Aldean Drummer, Rich Redmond",
            "datePublished": "Mon, 07 Oct 2019 20:46:08 +0000",
            "description": "This morning, I jammed with Jason Aldean Drummer Rich Redmond at an undisclosed studio in LA. Rich has been playing with Jason for over 20 years. But… He’s not just a drummer. He’s an author, actor, entrepreneur, and motivational speaker. We had a great chat about how he keeps such a positive attitude, and what […]",
            "length": "53856096",
            "sourceUrl": "https://traffic.libsyn.com/solohour/794.mp3",
            "categories": [
                "Podcast"
            ]
        },
        {
            "title": "793: Liz Germain on Starting Over From Scratch, Mega YouTube Tips, and Your Own Peanut Butter and Jelly",
            "datePublished": "Mon, 16 Sep 2019 21:00:42 +0000",
            "description": "Today we have Liz Germain in Studio. Liz is an absolute YouTube wizard, in addition to being a former fitness professional, and mega amateur rapper. We chat about her transition of moving from a partnership business to a solo endeavor, growing up in Michigan, and she gives my Rennch YouTube Channel a quick assessment. Relevant […]",
            "length": "88143675",
            "sourceUrl": "https://traffic.libsyn.com/solohour/793.mp3",
            "categories": [
                "Podcast"
            ]
        },
        {
            "title": "792: Turning Trauma Into Triumph: The Story Behind Food Heals with Allison Melody",
            "datePublished": "Thu, 12 Sep 2019 00:40:11 +0000",
            "description": "Filmmaker and Podcaster Allison Melody stops by to share her entrepreneurial journey of starting her brand, Food Heals. After losing both her parents to cancer in her 20’s Allison saw Western Medicine fail them decided there had to be a better way to heal and went on a mission to find it. She started a film production […]",
            "length": "47317238",
            "sourceUrl": "https://traffic.libsyn.com/solohour/792.mp3",
            "categories": [
                "Podcast"
            ]
        },
        {
            "title": "791: How to Make Your Hobby Into a Successful Business",
            "datePublished": "Tue, 27 Aug 2019 23:43:26 +0000",
            "description": "On today’s episode, I take you through the process of how I am taking one of my favorite hobbies, and making a solopreneur business out of it. It’s a really fun process that I’ve done over and over again, but this one I’m having an absolute blast with! Relevant Links: My Rennch Youtube Channel: https://www.rennch.com/youtube […]",
            "length": "30052091",
            "sourceUrl": "https://traffic.libsyn.com/solohour/791.mp3",
            "categories": [
                "Podcast"
            ]
        },
        {
            "title": "790: How to Make People Think Your Idea Is Their Idea With Oren Klaff",
            "datePublished": "Mon, 19 Aug 2019 22:09:50 +0000",
            "description": "Author Oren Klaff of “Pitch Anything” stops by today to chat about his new book, “Flip the Script”. This book promises to not only teach you the art of persuasion, but to help people think that your idea is actually their idea, thus agreeing with it and pushing it through. Get a free day of […]",
            "length": "49459859",
            "sourceUrl": "https://traffic.libsyn.com/solohour/790.mp3",
            "categories": [
                "Podcast"
            ]
        },
        {
            "title": "789: Pat Flynn Behind the Scenes at FlynnCon1",
            "datePublished": "Tue, 13 Aug 2019 19:52:17 +0000",
            "description": "Today’s episode was recorded in Pat Flynn’s new studio at WeWork in La Jolla California. We used a road pro caster which is a phenomenal bit of Kit. I thought it would be cool to find out what he was thinking and how he prepared for his first real conference, so we jumped in and […]",
            "length": "55604758",
            "sourceUrl": "https://traffic.libsyn.com/solohour/789.mp3",
            "categories": [
                "Podcast"
            ]
        },
        {
            "title": "788: Talking Events, Entrepreneurship, and Business with Rich Brooks from Agents of Change.",
            "datePublished": "Mon, 05 Aug 2019 19:28:46 +0000",
            "description": "Rich Brooks from the entrepreneurial conference Agents of Change, joins us on the show today. We cover topics like how he started the AOC conference, what to expect this year, podcasting, different business ventures, and much more. Hope to see you in September in Maine! Relevant Links: https://solohour.com/aoc Featured ads on this episode: Kartra is […]",
            "length": "53475563",
            "sourceUrl": "https://traffic.libsyn.com/solohour/788.mp3",
            "categories": [
                "Podcast"
            ]
        },
        {
            "title": "787: If You Haven’t Started Yet… Just begin, with AJ Roberts",
            "datePublished": "Wed, 31 Jul 2019 23:18:18 +0000",
            "description": "AJ Roberts from Genesis digital (otherwise known as Kartra), was in studio today, and we covered a bunch of awesome topics including how simple online business could be, how to create an easy infrastructure, and why not knowing everything should not stop you from beginning the process. Relevant Links: https://solohour.com/kartra Featured ads on this episode: […]",
            "length": "59654297",
            "sourceUrl": "https://traffic.libsyn.com/solohour/787.mp3",
            "categories": [
                "Podcast"
            ]
        },
        {
            "title": "786: Why SEO Still Matters, with Tommy Griffith",
            "datePublished": "Wed, 24 Jul 2019 21:02:27 +0000",
            "description": "Tommy Griffith has been doing search engine optimization for more than 10 years. He previously managed SEO at PayPal and Airbnb, and now runs ClickMinded, a digital marketing training platform for marketers and entrepreneurs. Tommy started ClickMinded as a side project while working full-time at Airbnb. He grew it until it started generating more revenue […]",
            "length": "49413586",
            "sourceUrl": "https://traffic.libsyn.com/solohour/786.mp3",
            "categories": [
                "Podcast"
            ]
        },
        {
            "title": "785: Facing Your Past So You Can Succeed In Your Future, With Amber Spears",
            "datePublished": "Mon, 15 Jul 2019 19:40:12 +0000",
            "description": "I promise this was going to be a show about affiliate marketing. Amber Spears from East 5th Ave., one of the worlds premier affiliate management firms, was in studio to talk about affiliate marketing. But then we went down a rabbit hole of facing your demons, how to be honest with your friends and relationshiops, […]",
            "length": "618708",
            "sourceUrl": "https://traffic.libsyn.com/solohour/785.mp3",
            "categories": [
                "Podcast"
            ]
        },
        {
            "title": "784: Brain Hacking, Compression Coaching, and Quantifying Your Skillsets with Brad Costanzo",
            "datePublished": "Wed, 10 Jul 2019 02:24:03 +0000",
            "description": "My boy Brad Costanzo of Bacon Wrapped Business (https://bradcostanzo.com | https://baconwrappedbusiness.com) was in studio. We chatted about dialing in your hormones, how to microdose and focus your brain for better results, and touched on a concept he calls “compression coaching”, which offers a compact learning experience if you are on the move or like to […]",
            "length": "52012647",
            "sourceUrl": "https://traffic.libsyn.com/solohour/784.mp3",
            "categories": [
                "Podcast"
            ]
        },
        {
            "title": "783: The 9 Triangles of Business Success, with Blitzmetrics Dennis Yu (Best of)",
            "datePublished": "Mon, 01 Jul 2019 21:38:05 +0000",
            "description": "Today we have Blitz Metrics (https://blitzmetrics.com) founder and CEO, Dennis Yu on the show. We were also joined by Jordan Paris, who wrote Growth Mindset University, and hosts the Growth Mindset University Podcast.  Dennis shared with us something he’s never shared on a show before, which is his “9 triangles” concept. (I added “of destiny”…because […]",
            "length": "46030992",
            "sourceUrl": "https://traffic.libsyn.com/solohour/783.mp3",
            "categories": [
                "Podcast"
            ]
        },
        {
            "title": "782: — 38 Life Tips to Improve The World Around Us —",
            "datePublished": "Tue, 25 Jun 2019 15:59:35 +0000",
            "description": "This is a random list of how I go through life. Some are lessons from my mom, some are just common sense and common courtesy, both of which seem to be lost in 2019. I think if we irritated each other a bit less, and were a bit more thoughtful, we could create a society […]",
            "length": "66018381",
            "sourceUrl": "https://traffic.libsyn.com/solohour/782.mp3",
            "categories": [
                "Podcast"
            ]
        },
        {
            "title": "781: Running a Solopreneur Business During Massive Health or Life Challenges, with Paul Higgins",
            "datePublished": "Mon, 17 Jun 2019 18:12:46 +0000",
            "description": "Today’s guest is my good friend Paul Higgins. Paul has been living with a rare kidney disorder for his whole life. A few years ago, he left his job at corporate Coca-Cola to live the life of a solo producer, despite massive health challenges. This show is about prioritizing what’s important, staying positive, and extracting […]",
            "length": "63647652",
            "sourceUrl": "https://traffic.libsyn.com/solohour/781.mp3",
            "categories": [
                "Podcast"
            ]
        },
        {
            "title": "780: Reprogramming Your Brain for Happiness & Success w/ Andy Murphy (BEST OF)",
            "datePublished": "Mon, 10 Jun 2019 19:44:21 +0000",
            "description": "Neuro-linguistic programming or NLP as it’s commonly called: what is it and why the heck does it matter for your business and your life? You may have heard of it or perhaps you’ve even tried it, but do you know how impactful it can be on your solopreneurial journey? Our guest for episode 780, Andy […]",
            "length": "94653295",
            "sourceUrl": "https://traffic.libsyn.com/solohour/780.mp3",
            "categories": [
                "Career Advice",
                "Finance & Money",
                "Great Books",
                "Guests",
                "Health",
                "Life Coaching",
                "Man",
                "Mindset & Overcoming Adversity",
                "Offline Marketing",
                "Outsourcing",
                "Podcast",
                "Real Estate",
                "Social Media",
                "Coaching",
                "Entrepreneur",
                "Marketing",
                "podcast"
            ]
        },
        {
            "title": "779: Influencer Marketing, Thinking Big, and Social Media Like the Pros with Arron Shepherd of The Goat Agency",
            "datePublished": "Wed, 05 Jun 2019 03:42:13 +0000",
            "description": "Today we chat with Arron Shepherd, co-founder of The Goat Agency, the biggest influencer marketing agency in the world.  We chat about how he came up, and dig into some strategies Goat uses for their clients that can translate into the solopreneur world.",
            "length": "69678108",
            "sourceUrl": "https://traffic.libsyn.com/solohour/779.mp3",
            "categories": [
                "Podcast"
            ]
        },
        {
            "title": "778: A Long Overdue Catch Up",
            "datePublished": "Wed, 29 May 2019 21:30:42 +0000",
            "description": "On today’s episode I catch you up with an epic car show, meeting a couple of legends, and being at the right placOn today’s episode I catch you up with an epic car show, meeting a couple of legends, and being at the right place at the right time, as well as the implications of […]",
            "length": "39222332",
            "sourceUrl": "https://traffic.libsyn.com/solohour/778.mp3",
            "categories": [
                "Podcast"
            ]
        },
        {
            "title": "777: How To Grow a Massive Mailing List Using Virtual Summits, with Dr. Mark Wade",
            "datePublished": "Thu, 09 May 2019 04:30:42 +0000",
            "description": "Today I got to chat with my good friend Dr. Mark Wade, who has just launched a brand new podcast, the Virtual Summit Podcast. We talked about, amongst other things, how to grow a huge mailing list and influence using virtual summits. This strategy is tried and true, and is something you can employ right […]",
            "length": "71661054",
            "sourceUrl": "https://traffic.libsyn.com/solohour/777.mp3",
            "categories": [
                "Podcast"
            ]
        },
        {
            "title": "776: How To Identify Your Business, Find Your Perfect Audience, and Nail Your Brand (Best Of)",
            "datePublished": "Tue, 30 Apr 2019 01:43:38 +0000",
            "description": "Today’s Best Of episode is a culmination of questions and case studies from various coaching calls I’ve done over the last few weeks.  Some of the most common questions or problems have to do with identifying your perfect business, defining your audience, and truly nailing your brand, which will completely illuminate the correct path for you […]",
            "length": "58595576",
            "sourceUrl": "https://traffic.libsyn.com/solohour/776.mp3",
            "categories": [
                "Podcast"
            ]
        },
        {
            "title": "775: The Art of Making Things Happen with Ken Kragen",
            "datePublished": "Mon, 22 Apr 2019 18:06:34 +0000",
            "description": "Ken Kragen may not be a household name to you, but if you mention his name in Hollywood, people will respond with “legend”. Ken is responsible for “We Are The World”, “Hands Across America”, and innumerable other huge projects in Hollywood and worldwide. Featured ads on this episode: This episode is brought to you by […]",
            "length": "70284511",
            "sourceUrl": "https://traffic.libsyn.com/solohour/775.mp3",
            "categories": [
                "Podcast"
            ]
        },
        {
            "title": "734: Free Coaching Friday. Or Saturday. :-)",
            "datePublished": "Sat, 20 Apr 2019 16:33:29 +0000",
            "description": "On today’s episode of free coaching Friday we talk podcast hosting, how to make money as a singer/songwriter, bespoke blazers for men, and awesome customer service. Featured ads on this episode: This episode is brought to you by private coaching with Michael O’Neal! CLICK HERE to check out the options.",
            "length": "15142663",
            "sourceUrl": "https://traffic.libsyn.com/solohour/774.mp3",
            "categories": [
                "Podcast"
            ]
        },
        {
            "title": "773: Mastering Linkedin for Leads and Sales with Viveka von Rosen",
            "datePublished": "Tue, 16 Apr 2019 00:37:51 +0000",
            "description": "Today we’re breaking new ground on The Solopreneur Hour…Linkedin.  I don’t know a thing about Linkedin, so I brought on one of the world’s foremost experts in Linkedin sales and marketing, Viveka von Rosen.  She has a brand new course on how to create more sales conversations on Linkedin called sellingwithlinkedin.com, available right this second. (go grab […]",
            "length": "52065464",
            "sourceUrl": "https://traffic.libsyn.com/solohour/773.mp3",
            "categories": [
                "Podcast"
            ]
        },
        {
            "title": "772: Mike Brewer from Wheeler Dealers is Movin’ on, and Movin’ Up",
            "datePublished": "Mon, 08 Apr 2019 18:12:55 +0000",
            "description": "Today we’re chatting with the hardest working man in the automotive show business, Mike Brewer.  As the creator and the host of the #1 automotive show in the world, Wheeler Dealers, Mike has seen and heard a lot since 2003!  After a very public breakup with the original mechanic of the show, Edd China, Wheeler […]",
            "length": "43264427",
            "sourceUrl": "https://traffic.libsyn.com/solohour/772.mp3",
            "categories": [
                "Podcast"
            ]
        },
        {
            "title": "771:  How To Think About Your Business Like An Investor",
            "datePublished": "Fri, 05 Apr 2019 20:06:38 +0000",
            "description": "On this show, which I recorded at 85 miles an hour while driving to Las Vegas, I go through the process of how I’m going to use my new car for my business, not only writing the entire thing off but how to make it a win-win for everybody involved. Relevant Links: Kit.com/solohour Featured ads […]",
            "length": "33718998",
            "sourceUrl": "https://traffic.libsyn.com/solohour/771.mp3",
            "categories": [
                "Podcast"
            ]
        },
        {
            "title": "770: A Road Trip Adventure Part I and Your Questions!",
            "datePublished": "Sat, 30 Mar 2019 02:09:02 +0000",
            "description": "On this exciting free coaching Friday episode, I relay my adventure of buying a car in Chicago and the challenges that I faced. Then I got into some great questions from you, fellow listeners! Go to Conferencetopia.com for my free course on how to conference better and the ability to submit your questions for free […]",
            "length": "27157951",
            "sourceUrl": "https://traffic.libsyn.com/solohour/770.mp3",
            "categories": [
                "Podcast"
            ]
        },
        {
            "title": "769: Instagram Growth in 2019 with Sue B. Zimmerman",
            "datePublished": "Mon, 25 Mar 2019 06:29:37 +0000",
            "description": "Sue B Zimmerman and I sat down at social media marketing world San Diego for a killer chat on what’s working on Instagram in 2019. Not only is it about your brand, but your strategy and execution play a paramount role in how your account grows. Relevant Links: https://SueBZimmerman.com/3keys https://SueBZimmerman.com/guide https://SueBZimmerman.com/YouTube Featured ads on this […]",
            "length": "35171380",
            "sourceUrl": "https://traffic.libsyn.com/solohour/769.mp3",
            "categories": [
                "Podcast"
            ]
        },
        {
            "title": "768: How To Build a Successful Dropshipping E-Commerce Business in 2019, with Anton Crowley",
            "datePublished": "Tue, 19 Mar 2019 19:20:12 +0000",
            "description": "Today’s guest is Anton Crowley from dropshiplifestyle.com. We talked about how the four hour work week completely changed his life and business, how he is created and sold multiple dropship businesses, how to research and create your own dropship e-commerce business in 2019, and how crazy it is to cross the street in Vietnam! Relevant […]",
            "length": "50956529",
            "sourceUrl": "https://traffic.libsyn.com/solohour/768.mp3",
            "categories": [
                "Podcast"
            ]
        },
        {
            "title": "767: Free Coaching Friday! Answering Your Solopreneur Questions!",
            "datePublished": "Fri, 15 Mar 2019 20:59:00 +0000",
            "description": "Today I cover some of the jokes I told at the John Lee Dumas roast at Podfest in Orlando, and answer a bunch of your questions, including which app to use to run your business, whether or not you should rent your motorcycle out, and some of my favorite applications to use as an entrepreneur. […]",
            "length": "22890004",
            "sourceUrl": "https://traffic.libsyn.com/solohour/767.mp3",
            "categories": [
                "Podcast"
            ]
        },
        {
            "title": "766: Andi Lew on 21st-Century Relationships and How to Build Them.",
            "datePublished": "Mon, 04 Mar 2019 23:23:53 +0000",
            "description": "Australian relationship expert Andi Lew and I sit down at the Grafton hotel in Los Angeles to talk about how to cultivate romantic relationships in the 21st-century. Social media has done good in the world, but it has also made relationships more complicated. Andi’s new book, Instalovers, breaks down how to connect with a romantic […]",
            "length": "39649936",
            "sourceUrl": "https://traffic.libsyn.com/solohour/766.mp3",
            "categories": [
                "Podcast"
            ]
        },
        {
            "title": "765: Ryan Levesque On How to Choose the Right Business for You",
            "datePublished": "Mon, 25 Feb 2019 17:20:08 +0000",
            "description": "It’s been a few years since Ryan Levesque’s worldwide sensation “Ask” launched his career into the stratosphere.  His brand new book, “Choose”, helps people pick the perfect business to start. You can get a TON of free swag at this URL:  https://choosethebook.com/solohour a FREE copy for a limited time (just pay S&H) plus over $200 […]",
            "length": "49361795",
            "sourceUrl": "https://traffic.libsyn.com/solohour/765.mp3",
            "categories": [
                "Podcast"
            ]
        },
        {
            "title": "764: Solopreneur Q&A, Greatest Hits with Michael O’Neal",
            "datePublished": "Mon, 18 Feb 2019 22:02:13 +0000",
            "description": "On today’s show I grab a few questions from the archives which are still quite relevant today.  We talk about staying on brand, keeping your mindset straight, how to save more time, when to automate and outsource, and a lot more! Have a listen on your fave podcast player!  ",
            "length": "27175148",
            "sourceUrl": "https://traffic.libsyn.com/solohour/764.mp3",
            "categories": [
                "Podcast"
            ]
        },
        {
            "title": "763: 10 Ways to Stay Healthy While Working HARD, with Melissa Ramos",
            "datePublished": "Mon, 11 Feb 2019 01:09:15 +0000",
            "description": "As solopeneurs one of the keys to our success is our health. We’ve talked about this subject a few times because without health and vitality solopreneurship is an even more difficult path. Joining us to share her expertise is Melissa Ramos of Sexy Food Therapy. She’s a certified nutritionist with a background in Chinese medicine […]",
            "length": "61763030",
            "sourceUrl": "https://traffic.libsyn.com/solohour/763.mp3",
            "categories": [
                "Branding & Identity",
                "Fitness & Health",
                "Health",
                "Internet Marketing",
                "Man",
                "Melissa Ramos",
                "Mindset & Overcoming Adversity",
                "Outsourcing",
                "Podcast",
                "Woman"
            ]
        },
        {
            "title": "762: Pat Flynn on How To Become an Inventor",
            "datePublished": "Sat, 02 Feb 2019 22:37:05 +0000",
            "description": "Mr. Pat Flynn of Smart Passive Income (https://smartpassiveincome.com) stopped by to talk about his new invention, The Switchpod. (Available on Kickstarter right now at https://switchpod.co)  We talked about the entire process of how to get something manufactured, how to go from an idea to a prototype, and how much all of that costs.  We also […]",
            "length": "51299745",
            "sourceUrl": "https://traffic.libsyn.com/solohour/762.mp3",
            "categories": [
                "Podcast"
            ]
        },
        {
            "title": "761: Business Automation 101",
            "datePublished": "Thu, 24 Jan 2019 03:03:26 +0000",
            "description": "Well, it’s time for a brain dump.  I’ve been immersing myself in automating my business, and I thought I’d give you a breakdown of how I think about automation, what apps and services I use, my philosophy on automation, and how it can open up doors you haven’t even thought of yet. I’ve also made […]",
            "length": "35095629",
            "sourceUrl": "https://traffic.libsyn.com/solohour/761.mp3",
            "categories": [
                "Podcast"
            ]
        },
        {
            "title": "760: Solopreneur Q&A – Free Coaching Monday!",
            "datePublished": "Mon, 21 Jan 2019 21:13:14 +0000",
            "description": "Welcome to our weekly Q&A edition of The Solopreneur Hour. If you haven’t been here before on Fridays we publish an episode devoted to answering YOUR questions dear listeners! To submit a question join the mailing list, contact me via the Contact page on the site or join our Proudly Unemployable Facebook group. You can […]",
            "length": "22904988",
            "sourceUrl": "https://traffic.libsyn.com/solohour/760.mp3",
            "categories": [
                "Podcast"
            ]
        },
        {
            "title": "759: Iron Man, Star Wars, and More – Jayse Hansen on Creating A New Reality In Virtual Worlds",
            "datePublished": "Mon, 14 Jan 2019 18:31:34 +0000",
            "description": "",
            "length": "49349035",
            "sourceUrl": "https://traffic.libsyn.com/solohour/759.mp3",
            "categories": [
                "Podcast"
            ]
        },
        {
            "title": "758: Live from CES with Joel Comm, talking new tech, pivoting, and his new show!",
            "datePublished": "Fri, 11 Jan 2019 16:53:25 +0000",
            "description": "Joel Comm (@joelcomm) and I sit down at CES to talk about new tech, pivoting when your business changes, and having the b*lls to “just start!”",
            "length": "38262403",
            "sourceUrl": "https://traffic.libsyn.com/solohour/758.mp3",
            "categories": [
                "Podcast"
            ]
        },
        {
            "title": "757: Systematize Your Biz with Jaime Masters",
            "datePublished": "Mon, 07 Jan 2019 20:09:33 +0000",
            "description": "Systems, Systems, Systems. We know we need ’em.  We don’t know how to do ’em. Fortunately for us, there’s Jaime Masters to help us out with such things.  Her new brand, OwnerBox (https://ownerbox.com), helps solopreneurs and business owners systematize their biz by working with Jaime’s world class team. Have a look at https://eventualmillionaire.com/sh for some […]",
            "length": "53428263",
            "sourceUrl": "https://traffic.libsyn.com/solohour/757.mp3",
            "categories": [
                "Podcast"
            ]
        },
        {
            "title": "756: Answers to Your Questions!",
            "datePublished": "Fri, 04 Jan 2019 23:38:51 +0000",
            "description": "On today’s show, I run down some questions featured on the Proudly Unemployable Facebook Group and answer them on the show.  Note:  This episode is straight FIRE…so don’t burn your ears!  ",
            "length": "23278780",
            "sourceUrl": "https://traffic.libsyn.com/solohour/756.mp3",
            "categories": [
                "Podcast"
            ]
        },
        {
            "title": "755:  Another Year In Your Earballs",
            "datePublished": "Mon, 31 Dec 2018 20:42:47 +0000",
            "description": "Howdy.  On today’s rambling episode, I chat about coaching, investing in one’s self, fat-shaming, and goal setting. email me at michael@solopreneurhour.com for coaching special info. Here’s the 9 minute HIIT workout I’m doing: https://www.nytimes.com/guides/well/strength-training-plyometrics And here’s the app I’m using: https://itunes.apple.com/us/app/seconds-interval-timer-hiit/id475816966?mt=8",
            "length": "31721957",
            "sourceUrl": "https://traffic.libsyn.com/solohour/755.mp3",
            "categories": [
                "Podcast"
            ]
        },
        {
            "title": "Test – Conferencetopia Intro",
            "datePublished": "Fri, 28 Dec 2018 00:36:54 +0000",
            "description": "test podcast",
            "length": "5242880",
            "sourceUrl": "https://solopreneurhour.com/wp-content/uploads/2018/12/1.intro_.mp3",
            "categories": [
                "Conferencetopia"
            ]
        },
        {
            "title": "754: Margaritas, Weight Loss, and Pivoting, with Cassie Bjork",
            "datePublished": "Mon, 17 Dec 2018 21:09:52 +0000",
            "description": "Today’s in Studio Guest is (former) Dietitian Cassie Bjork.  (Cassie.net) We thought “Hey, it’s noon during holiday season, we might as well have a margarita or two and record a podcast”.  So, here’s that.  🙂 Get Cassie’s Rulebreakers Weight Loss Coaching Program – Cassie.net/rulebreakers Get the book: Why Am I Still Fat? ",
            "length": "52307089",
            "sourceUrl": "https://traffic.libsyn.com/solohour/754.mp3",
            "categories": [
                "Podcast"
            ]
        },
        {
            "title": "753: Solopreneur Q&A – Free Coaching Friday!",
            "datePublished": "Sat, 15 Dec 2018 22:01:28 +0000",
            "description": "Welcome to our weekly Q&A edition of The Solopreneur Hour. If you haven’t been here before on Fridays we publish an episode devoted to answering YOUR questions dear listeners! To submit a question join the mailing list, contact me via the Contact page on the site or join our Proudly Unemployable Facebook group. You can […]",
            "length": "14113609",
            "sourceUrl": "https://traffic.libsyn.com/solohour/753.mp3",
            "categories": [
                "Podcast"
            ]
        },
        {
            "title": "752: Clay Hebert & John Lee Dumas: 2 Brilliant Marketing Minds, Some Tequila, and Some Single Malt",
            "datePublished": "Wed, 05 Dec 2018 19:59:36 +0000",
            "description": "Today we have a special show.  Myself, JLD (https://instagram.com/johnleedumas) and Clay Hebert (https://instagram.com/clayhebert) talk about all things marketing, from how you introduce yourself, to improving your chops, to having great conversations.",
            "length": "50293362",
            "sourceUrl": "https://traffic.libsyn.com/solohour/752.mp3",
            "categories": [
                "Podcast"
            ]
        },
        {
            "title": "751: Free Coaching Fri-Saturday! Productivity, YouTube Growth, and More…",
            "datePublished": "Sat, 01 Dec 2018 21:15:53 +0000",
            "description": "Free Coaching Friday from The Solopreneur Hour! If you’re new and don’t know how this works here goes: once a week I ask you to send me your questions and I answer them on Friday. If you want to be part of the fun for next week’s Q&A show join us in the Facebook group here or […]",
            "length": "26545974",
            "sourceUrl": "https://traffic.libsyn.com/solohour/751.mp3",
            "categories": [
                "Podcast"
            ]
        },
        {
            "title": "750: 3 Steps to a GREAT Online Business w/ Chris Farrell (best of)",
            "datePublished": "Tue, 27 Nov 2018 18:13:38 +0000",
            "description": "As a solopreneur we all start somewhere. Sometimes we start with a topic we know a lot about, sometimes we see an opening and we go for it, learning along the way. Our guest for today saw an opening to serve his audience in a simpler, more effective way than email: a membership site. Chris […]",
            "length": "56207988",
            "sourceUrl": "https://traffic.libsyn.com/solohour/750.mp3",
            "categories": [
                "Branding & Identity",
                "Career Advice",
                "Chris Farrell",
                "Internet Marketing",
                "Man",
                "Mindset & Overcoming Adversity",
                "Podcast",
                "Podcasting"
            ]
        },
        {
            "title": "749: (Hot Air) BalloonCast with Glen Ledwell (best of…kinda)",
            "datePublished": "Wed, 21 Nov 2018 22:09:22 +0000",
            "description": "Sometimes a solopreneur is a solopreneur from birth. They hustle themselves right out of the crib and into the thick of the next opportunity that crosses their path. Our guest for episode 749, Mr. Glen Ledwell, falls into that category. Glen is a serial entrepreneur who had multiple successful businesses in several industries before finding […]",
            "length": "65624445",
            "sourceUrl": "https://traffic.libsyn.com/solohour/749.mp3",
            "categories": [
                "Career Advice",
                "Finance & Money",
                "Glen Ledwell",
                "Guests",
                "Internet Marketing",
                "Man",
                "Men's Style",
                "Mindset & Overcoming Adversity",
                "Network Marketing",
                "Outsourcing",
                "Podcast",
                "Podcasting",
                "Website / Search Engine Optimization",
                "Business",
                "Entrepreneur",
                "Hustle",
                "San Diego"
            ]
        },
        {
            "title": "748: Creating a Six-Figure Side Gig, with Dr. Mark Costes (best of)",
            "datePublished": "Tue, 13 Nov 2018 17:47:07 +0000",
            "description": "As solopreneurs making the transition from doing what we know to teaching and sharing our knowledge is typically the difference between burnout and bliss. To start that transition we often create a side gig. The man who has made multiple six figures doing just that: taking side gigs and turning them into multiple streams of […]",
            "length": "47937253",
            "sourceUrl": "https://traffic.libsyn.com/solohour/748.mp3",
            "categories": [
                "Career Advice",
                "Internet Marketing",
                "Man",
                "Mark Costes",
                "Mindset & Overcoming Adversity",
                "Podcast",
                "Podcasting",
                "Real Estate",
                "Social Media"
            ]
        },
        {
            "title": "747: The MOST IMPORTANT (and most overlooked) Piece of the Success Puzzle",
            "datePublished": "Tue, 06 Nov 2018 20:09:03 +0000",
            "description": "On today’s show it’s just you and me, kid.  And we (and by “we”, I mean “I”) talk about what I consider to be the most overlooked, yet most important part of a successful solopreneur business. To book your clarity call, click here: https://solohour.com/clarity   ",
            "length": "43930150",
            "sourceUrl": "https://traffic.libsyn.com/solohour/747.mp3",
            "categories": [
                "Podcast"
            ]
        },
        {
            "title": "746: Choosing Your Own Freedom with Natalie Sisson",
            "datePublished": "Wed, 24 Oct 2018 20:24:07 +0000",
            "description": "Returning back onto the show is Natalie Sisson, with her new book, The Freedom Plan. (https://thefreedomplan.co) – how to reclaim your time, streamline your business, and be more profitable while living your ideal lifestyle and feeling on purpose!  Natalie spent many years as “The Suitcase Entrepreneur”, traveling all over the world for 6.5 years.  Now settled […]",
            "length": "48272169",
            "sourceUrl": "https://traffic.libsyn.com/solohour/746.mp3",
            "categories": [
                "Podcast"
            ]
        },
        {
            "title": "745: You Asked. I Answered | Solopreneur Q&A",
            "datePublished": "Tue, 23 Oct 2018 20:49:39 +0000",
            "description": "If you’re new and don’t know how this works here goes: once a week I ask you to send me your questions and I answer them. If you want to be part of the fun for next week’s Q&A show join us in the Facebook group here or grab my free course called CONFERENCETOPIA.  Look for […]",
            "length": "33992536",
            "sourceUrl": "https://traffic.libsyn.com/solohour/745.mp3",
            "categories": [
                "Podcast"
            ]
        },
        {
            "title": "744: Allison Maslan on How To Scale Your Business, Build Your Team, and Explode Your Growth",
            "datePublished": "Tue, 16 Oct 2018 19:15:29 +0000",
            "description": "Serial entrepreneur (and trapeze-ist?) Allison Maslan joins us for a great episode speaking about her new book, Scale or Fail, How to Build Your Dream Team, Explode Your Growth, and Let Your Business Soar.  Allison has an amazing history of entrepreneurship, and really has the midas touch.  She got some great advice from her father, […]",
            "length": "47848357",
            "sourceUrl": "https://traffic.libsyn.com/solohour/744.mp3",
            "categories": [
                "Podcast"
            ]
        },
        {
            "title": "743:  The Secret to Successful Sales, and the Power of the Mastermind, with Travis Chappell",
            "datePublished": "Mon, 08 Oct 2018 19:39:15 +0000",
            "description": "Travis Chappell (https://www.buildyournetwork.co) and @travischappell stops by the show today to talk about some core fundamentals of successful “network explosion”, and building your online business. We talk about The secret to great sales the power of masterminds and learning groups the ultimate power of networking how to “show up” for friends in need relationship fundamentals, and […]",
            "length": "52757700",
            "sourceUrl": "https://traffic.libsyn.com/solohour/743.mp3",
            "categories": [
                "Podcast"
            ]
        },
        {
            "title": "742: Defeating Overwhelm, and The Recipe for Choosing Your ONE Thing",
            "datePublished": "Fri, 05 Oct 2018 18:33:45 +0000",
            "description": "On today’s FCF, I answer all these awesome questions: Not a question but some feedback. Your latest episode about Rennch EXPLODED over the airwaves. That was the sound of passion, goals, doer, fun, creativity – the very essence of sloopreneur life – I raise a cup of tea in your name.  OK – Here’s 1 […]",
            "length": "25656653",
            "sourceUrl": "https://traffic.libsyn.com/solohour/742.mp3",
            "categories": [
                "Podcast"
            ]
        },
        {
            "title": "741: A CRAZY Entrepreneurial Story, starring the Rennch “Jack in The Bag”.",
            "datePublished": "Mon, 01 Oct 2018 22:21:17 +0000",
            "description": "On this episode I document the craziness of going from concept to finished product with an absurd timeline.  Proof positive that you don’t have to know what you’re doing to make something happen.  You just have to do it!",
            "length": "26327399",
            "sourceUrl": "https://traffic.libsyn.com/solohour/741.mp3",
            "categories": [
                "Podcast"
            ]
        },
        {
            "title": "740: Taking Responsibility for your own Happiness, with Adam Lewis Walker",
            "datePublished": "Wed, 26 Sep 2018 21:59:39 +0000",
            "description": "Adam Lewis Walker (AYAlpha.com) has a brand new book, Awaken Your Alpha, available October 3rd 2018.  First and foremost, my apologies for the audio quality.  We had an equipment breakdown and had to make due.  Adam and I talk about the journey of being a man, and taking responsibility for your own life.  Sorry for […]",
            "length": "50546044",
            "sourceUrl": "https://traffic.libsyn.com/solohour/740.mp3",
            "categories": [
                "Podcast"
            ]
        },
        {
            "title": "739: Start Your Own AMAZON Business Without Making A Product with Brian Creager",
            "datePublished": "Mon, 24 Sep 2018 17:56:45 +0000",
            "description": "This was a REALLY fun episode, because I didn’t know this business model existed.  You can think of a product, find a manufacturer to make it for you, brand it, and sell it on Amazon without carrying a warehouse full of inventory and shipping it yourself.  This was a really interesting, informative show. 6:08 May […]",
            "length": "51116896",
            "sourceUrl": "https://traffic.libsyn.com/solohour/739.mp3",
            "categories": [
                "Branding & Identity",
                "Bryan Creager",
                "Podcast",
                "Private Labelling",
                "Amazon",
                "Private Label",
                "White Labelling"
            ]
        },
        {
            "title": "738: Philip McKernan – One Last Talk: Why YOUR TRUTH Matters, and How to Speak It",
            "datePublished": "Mon, 17 Sep 2018 21:54:52 +0000",
            "description": "Amazing, remarkable, life-changing.  That’s what this episode is. Since I originally introduced him at the Thrive 2016 conference in San Diego, I’ve been following Philip McKernan and his incredible message.  I finally got him to sit down and record a deep-dive interview about why sharing your truth is arguably the best thing you can do as a […]",
            "length": "47285818",
            "sourceUrl": "https://traffic.libsyn.com/solohour/738.mp3",
            "categories": [
                "Podcast"
            ]
        },
        {
            "title": "737: How to Start A World Class Podcast, Step By Step",
            "datePublished": "Wed, 12 Sep 2018 22:20:37 +0000",
            "description": "In this episode, I take you through the 8 week launch process of a world class podcast. For gear:  https://kit.com/solohour For supplemental YouTube videos: https://youtube.com/solohour  ",
            "length": "57577206",
            "sourceUrl": "https://traffic.libsyn.com/solohour/737.mp3",
            "categories": [
                "Podcast"
            ]
        },
        {
            "title": "736: What Solopreneurs Are Struggling With This Week | Solopreneur Q&A",
            "datePublished": "Tue, 11 Sep 2018 07:50:41 +0000",
            "description": "Free Coaching Monday from The Solopreneur Hour! If you’re new and don’t know how this works here goes: once a week I ask you to send me your questions and I answer them. If you want to be part of the fun for next week’s Q&A show join us in the Facebook group here or grab my […]",
            "length": "18739222",
            "sourceUrl": "https://traffic.libsyn.com/solohour/736.mp3",
            "categories": [
                "Podcast"
            ]
        },
        {
            "title": "735: Dan Kuschell Will Change How You Conduct Business.",
            "datePublished": "Wed, 05 Sep 2018 19:34:47 +0000",
            "description": "Solopreneurs.  This was one of those conversations that I physically had to cut off, because it was so good it could have gone on forever. Dan Kuschell is the CEO of Joe Polish’s Genius Network, and is insightful, bright, and brilliant.  This is an instant best-of. Check out the Growth to Freedom podcast every Monday […]",
            "length": "60281852",
            "sourceUrl": "https://traffic.libsyn.com/solohour/735.mp3",
            "categories": [
                "Career Advice",
                "Dan Kuschell",
                "Internet Marketing",
                "Man",
                "Mindset & Overcoming Adversity",
                "Podcast",
                "Podcasting"
            ]
        },
        {
            "title": "734: Travis Houston from Superfunnel and a Marketing Hack You’ve NEVER Heard Of",
            "datePublished": "Thu, 30 Aug 2018 07:17:20 +0000",
            "description": "Today we welcome Travis Houston (https://superfunnel.com) into Studio 86 to talk all things marketing.  After telling us a really compelling story about “finding himself” in India, he wound up in the most incredible whirlwind of 18 months of mentors. Travis then breaks down one of the most amazing marketing tactics I’ve ever heard.  You won’t […]",
            "length": "50159917",
            "sourceUrl": "https://traffic.libsyn.com/solohour/734.mp3",
            "categories": [
                "Podcast"
            ]
        },
        {
            "title": "733: 5 Year Anniversary Show! How To Do This Solopreneur Thing",
            "datePublished": "Wed, 22 Aug 2018 19:13:05 +0000",
            "description": "Happy birthday Solohour! On today’s ep, I talk about the B.A.M concept, how to create a tier 1, tier 2, or tier 3 business (and what that means), and how to get your mindset right to be a solopreneur.",
            "length": "36948017",
            "sourceUrl": "https://traffic.libsyn.com/solohour/733.mp3",
            "categories": [
                "Podcast"
            ]
        },
        {
            "title": "732: How To DEconstruct Success with Jase Bennett of The Ohana Adventure",
            "datePublished": "Mon, 20 Aug 2018 19:20:01 +0000",
            "description": "Today’s show is a doozy.  Jase Bennett of The Ohana Adventure (1.7 Million Subs on YouTube), Prouduct (Did the Freedom, Mastery, and Podcast Journals with John Lee Dumas, and many more…) Jase Boards, chats with us about being a serial entrepreneur, what it’s like to have a super-successful YouTube channel, and how he used to […]",
            "length": "45780933",
            "sourceUrl": "https://traffic.libsyn.com/solohour/732.mp3",
            "categories": [
                "Podcast"
            ]
        },
        {
            "title": "731: What’s The Next Thing You’re Working On? Free Coaching Friday with Special Guest Jase Bennett!",
            "datePublished": "Fri, 17 Aug 2018 19:58:57 +0000",
            "description": "Check out Jase Bennett at The Ohana Adventure on YouTube Free Coaching Friday from The Solopreneur Hour! If you’re new and don’t know how this works here goes: once a week I ask you to send me your questions and I answer them on Friday. If you want to be part of the fun for next […]",
            "length": "26400037",
            "sourceUrl": "https://traffic.libsyn.com/solohour/731.mp3",
            "categories": [
                "Podcast"
            ]
        },
        {
            "title": "730: Cole Hatter on Creating The Best Conference, Real Estate Investing, and Surrounding Yourself with Smarter People",
            "datePublished": "Wed, 15 Aug 2018 06:23:59 +0000",
            "description": "Cole Hatter is the founder of Thrive: Make Money Matter (https://attendthrive.com – Use Promo code “solo” for 20% off) which is, in my opinion, the best entrepreneurial conference out there today.  We dig into surrounding yourself with smarter people, getting your mental game right, real estate investing, and a bunch of other topics to make […]",
            "length": "47390512",
            "sourceUrl": "https://traffic.libsyn.com/solohour/730.mp3",
            "categories": [
                "Podcast"
            ]
        },
        {
            "title": "729: The Nuts & Bolts of Successful Public Speaking, with Kenyon Salo",
            "datePublished": "Mon, 13 Aug 2018 20:30:44 +0000",
            "description": "Kenyon Salo (https://kenyonsalo.com) joins us today to talk about how we began our public speaking career, and what it’s like to pay attention to the technical side of speaking.  Public speaking is a learned behavior as much as an art form, and we dig deep into some of the tips and tricks of building a great performance and engaging […]",
            "length": "59207735",
            "sourceUrl": "https://traffic.libsyn.com/solohour/729.mp3",
            "categories": [
                "Podcast"
            ]
        },
        {
            "title": "727: 10 Things I Did Right When I launched The Solopreneur Hour (best of)",
            "datePublished": "Tue, 07 Aug 2018 18:31:10 +0000",
            "description": "Solopreneurs! Don’t let the title fool you. This isn’t about “hey, check me out, look what I did!”. It’s essentially a primer on how to launch a business and brand from scratch. I take you through the steps I took (sort of, in no particular order) to launch the podcast and brand. This is one […]",
            "length": "46788615",
            "sourceUrl": "https://traffic.libsyn.com/solohour/727.mp3",
            "categories": [
                "Branding & Identity",
                "Man",
                "Michael O'Neal Solo",
                "Mindset & Overcoming Adversity",
                "Network Marketing",
                "Podcast",
                "Podcasting",
                "Social Media",
                "Branding",
                "Hour",
                "Solopreneur"
            ]
        },
        {
            "title": "726: How To FOCUS",
            "datePublished": "Sat, 04 Aug 2018 22:44:11 +0000",
            "description": "Today we’re talking about Focus.  What are some of the supplements and methodologies YOU use to focus.  Find out on today’s show!",
            "length": "21995368",
            "sourceUrl": "https://traffic.libsyn.com/solohour/726.mp3",
            "categories": [
                "Podcast"
            ]
        },
        {
            "title": "725: Answering Your Most Pressing Solopreneur Questions!",
            "datePublished": "Mon, 30 Jul 2018 22:34:20 +0000",
            "description": "Free Coaching Monday from The Solopreneur Hour! If you’re new and don’t know how this works here goes: once a week I ask you to send me your questions and I answer them on Friday. If you want to be part of the fun for next week’s Q&A show join us in the Facebook group here or […]",
            "length": "17542815",
            "sourceUrl": "https://traffic.libsyn.com/solohour/725.mp3",
            "categories": [
                "Podcast"
            ]
        },
        {
            "title": "724: TODAY You’re Learning How To Invest in Real Estate, with Rod Khleif",
            "datePublished": "Wed, 25 Jul 2018 17:00:00 +0000",
            "description": "Today’s show is with Rod Khleif, multimillionaire and real estate investor. He breaks down exactly what we need to do to learn how to invest in Real Estate. Website Address: www.RodKhleif.com Find him on Facebook: https://www.facebook.com/rodkhleiffan/ https://multifamilycommunity.com The Lifetime CashFlow through Real Estate Podcast https://rodkhleif.com/lifetime-cashflow-podcast/ Chicago Multifamily Bootcamp https://rodkhleif.com/bootcamp August 24-26 Free Book: Text “rod” […]",
            "length": "51455014",
            "sourceUrl": "https://traffic.libsyn.com/solohour/724.mp3",
            "categories": [
                "Podcast"
            ]
        },
        {
            "title": "723: The Psychology of Success, with Roland Frasier of Digital Marketer",
            "datePublished": "Mon, 23 Jul 2018 16:19:31 +0000",
            "description": "Traffic and Conversion is one of my favorite conferences.  It’s simply the most tactical, “rubber meets the road” conference I’ve been to.  I met Roland at a mastermind in San Diego, and loved his presentation.  A former lawyer turned marketer, the reason for his success is very apparent in this great conversation.  It’s all about the approach […]",
            "length": "55919712",
            "sourceUrl": "https://traffic.libsyn.com/solohour/723b.mp3",
            "categories": [
                "Podcast"
            ]
        },
        {
            "title": "723: Q&A, Solopreneur Style!",
            "datePublished": "Sun, 22 Jul 2018 23:52:46 +0000",
            "description": "On today’s Solopreneur Q&A we talk about sound quality, niching (pronounced “neeshing”) down, and a follow up to the Sophie Howard Amazon show.",
            "length": "14841212",
            "sourceUrl": "https://traffic.libsyn.com/solohour/723.mp3",
            "categories": [
                "Podcast"
            ]
        },
        {
            "title": "722: How To Build A Successful Amazon Business with Sophie Howard",
            "datePublished": "Wed, 18 Jul 2018 21:37:35 +0000",
            "description": "On today’s ep I’ve got Sophie Howard, who is an absolute Amazon-selling beast! (https://aspiringentrepreneurs.com) She’s an excellent product “sourcer” and loves the launch process.  We have a fabulous chat about what makes an Amazon product work, and how to become a seller and even build a channel that someone might buy from you. Check out […]",
            "length": "54427706",
            "sourceUrl": "https://traffic.libsyn.com/solohour/722.mp3",
            "categories": [
                "Podcast"
            ]
        },
        {
            "title": "721: Making Time For New Projects, Driving Traffic To Local Biz, and More, with Special Guest, Elyse Parker",
            "datePublished": "Mon, 16 Jul 2018 19:56:06 +0000",
            "description": "On today’s Q&A show, we talk about driving local traffic to a biz, (including Google Places hacking), how to make time (and decide when to…) for new projects, and how to deal with limited capacity.  Special guest is internet marketing extraordinaire Elyse Parker.",
            "length": "24756107",
            "sourceUrl": "https://traffic.libsyn.com/solohour/721.mp3",
            "categories": [
                "Podcast"
            ]
        },
        {
            "title": "720: The Number One Way To Grow Your Brand And Business",
            "datePublished": "Mon, 09 Jul 2018 17:41:22 +0000",
            "description": "You’re a podcaster…you just don’t know it yet.  Statistically, podcasting is on a hockey stick rise of adoption.  It also remains the most “bang for the buck” in terms of building brand authority.  Today I share my podcasting origin story…see if your life sounds familiar. Right this second, go to https://eventualmillionaire.com/solohour and subscribe to Jaime’s […]",
            "length": "32771865",
            "sourceUrl": "https://traffic.libsyn.com/solohour/720.mp3",
            "categories": [
                "Podcast"
            ]
        },
        {
            "title": "719: Launching Your Podcast, How To Price Yourself, How To Allocate Your Time, and More…",
            "datePublished": "Sat, 07 Jul 2018 01:27:27 +0000",
            "description": "Today’s FCF is brought to you by the PLG – Podcast Launch Group.  Get 50% off until June 10! https://podcastlaunchgroup.com  ",
            "length": "23809769",
            "sourceUrl": "https://traffic.libsyn.com/solohour/719.mp3",
            "categories": [
                "Podcast"
            ]
        },
        {
            "title": "718: Giving It All Away For FREE…for Profit, with Shane and Jocelyn Sams",
            "datePublished": "Thu, 05 Jul 2018 17:53:02 +0000",
            "description": "We’ve got Shane and Jocelyn Sams from flippedlifestyle.com on today’s episode. We chatted about all kinds of stuff, including their innovative marketing tactic to promote their membership: One month FREE membership to our Flip Your Life Community – our community driven, step-by-step blueprint that helps you start your online business and change your family’s future!  […]",
            "length": "48684230",
            "sourceUrl": "https://traffic.libsyn.com/solohour/718.mp3",
            "categories": [
                "Podcast"
            ]
        },
        {
            "title": "717: Webinar Masterclass with Anthony “AJ” Joiner (best of)",
            "datePublished": "Mon, 02 Jul 2018 21:53:56 +0000",
            "description": "Today’s episode is with Anthony “AJ” Joiner, who designs and executes webinars for radio and media personalities in Atlanta.  He also happens to be a Sololab member, joining my group around 18 months ago.  When we first chatted, he had many business ideas (As most of us do), and we got him focused on one […]",
            "length": "66663494",
            "sourceUrl": "https://traffic.libsyn.com/solohour/717.mp3",
            "categories": [
                "Anthony \"AJ\" Joiner",
                "Guests",
                "Man",
                "Podcast",
                "Webinars"
            ]
        },
        {
            "title": "716: The Art of Facebook Ads and Paid Traffic with Rick Mulready",
            "datePublished": "Wed, 27 Jun 2018 17:54:11 +0000",
            "description": "He’s “your Facebook ads guy’s favorite Facebook ads guy”.  And the one that the pros turn to.  On today’s episode, we chat with Rick Mulready (https://rickmulready.com) about Facembook ads, YouTube ads, Instagram ads…you name it. We answer the question…is Facebook relevant anymore? Where you should be spending your ad money. How Rick would make money […]",
            "length": "62791015",
            "sourceUrl": "https://traffic.libsyn.com/solohour/716.mp3",
            "categories": [
                "Podcast"
            ]
        },
        {
            "title": "715: Your Biggest Challenges As A Solopreneur…",
            "datePublished": "Mon, 25 Jun 2018 19:44:27 +0000",
            "description": "…and how to fix them. On today’s show, I run down some questions featured on the Proudly Unemployable Facebook Group and answer them on the show.  Note:  This episode is straight FIRE…so don’t burn your ears!  ",
            "length": "25552651",
            "sourceUrl": "https://traffic.libsyn.com/solohour/715.mp3",
            "categories": [
                "Podcast"
            ]
        },
        {
            "title": "714: What To Do with Your Million Dollar Idea, with Stephen Key (best of)",
            "datePublished": "Wed, 20 Jun 2018 21:03:33 +0000",
            "description": "If you’re reading this you’ve probably had the idea for an invention. Have you wondered what’s the best way to take your idea and make it into a viable product? Our returning guest for episode 359, Mr. Stephen Key, can help you. Stephen is an inventor extraordinaire as well as an author and a speaker. […]",
            "length": "45740152",
            "sourceUrl": "https://traffic.libsyn.com/solohour/714.mp3",
            "categories": [
                "Authors",
                "Branding & Identity",
                "Career Advice",
                "Man",
                "Mindset & Overcoming Adversity",
                "Podcast",
                "Social Media",
                "Stephen Key"
            ]
        },
        {
            "title": "713: How To Make a Landing Page, Join a Mastermind, and More…",
            "datePublished": "Mon, 18 Jun 2018 19:51:34 +0000",
            "description": "on this Solopreneur 1/3 hour I catch you up on some news, talk about how to make a landing page, join a mastermind, and stop making excuses for why you haven’t built your business or had your fun yet.",
            "length": "16182369",
            "sourceUrl": "https://traffic.libsyn.com/solohour/713.mp3",
            "categories": [
                "Podcast"
            ]
        },
        {
            "title": "712: Why Time Freedom Is Your MOST Important Asset",
            "datePublished": "Wed, 13 Jun 2018 18:22:05 +0000",
            "description": "We focus so much energy around making more money, when it’s really the time freedom that we seek.  Tune into this (abridged) episode to learn how important time freedom can be in your life, and how it should be your primary focus.",
            "length": "13625067",
            "sourceUrl": "https://traffic.libsyn.com/solohour/712.mp3",
            "categories": [
                "Podcast"
            ]
        },
        {
            "title": "711: Social Media Day with Erin Cell from Socially Powered!",
            "datePublished": "Mon, 11 Jun 2018 22:14:24 +0000",
            "description": "Today Erin Cell and I chat about what’s working in 2018 for Social Media, chatbots, and Social Media Day Denver! Follow Erin @sociallypowered everywhere. https://socialmediadaydenver.com.  Use promo code “solohour50” for 50 bucks off your ticket!!  ",
            "length": "30402577",
            "sourceUrl": "https://traffic.libsyn.com/solohour/711.mp3",
            "categories": [
                "Podcast"
            ]
        },
        {
            "title": "710: YouTube Masterclass [Part 3] with Sunny Lenarduzzi",
            "datePublished": "Fri, 08 Jun 2018 05:45:13 +0000",
            "description": "The imitable Sunny Lenarduzzi (youtube for bosses https://sunnylenarduzzi.com/youtube4bosses) joins us for part III of the YouTube Masterclass series.  Today we talk some serious STRATEGY, channel optimization, apps, and tons more about how to get your first 100,000 subscribers. free webinar: www.bossyoutubestrategy.com guide: 0-100,000 in under 12 months www.sunnylenarduzzi.com/subscribers Resources:  https://sunnylenarduzzi.com/youtubechannelchecklist Apps to check out: Keywords Everywhere VID […]",
            "length": "50519152",
            "sourceUrl": "https://traffic.libsyn.com/solohour/710.mp3",
            "categories": [
                "Podcast"
            ]
        },
        {
            "title": "709: YouTube Channel Masterclass [Part 2] with Brian G Johnson",
            "datePublished": "Wed, 06 Jun 2018 06:15:02 +0000",
            "description": "On this Topic-based miniseries, this is part 2 of how to create grow and monetize a YouTube channel.  This episode features the first half of my conversation with Brian G. Johnson, and we dig deep into how to initially set up your youtube channel, your brand and your artwork, and how to deconstruct the analytics […]",
            "length": "34894251",
            "sourceUrl": "https://traffic.libsyn.com/solohour/709.mp3",
            "categories": [
                "Podcast"
            ]
        },
        {
            "title": "708: YouTube Channel Masterclass [Part 1] with Brian G Johnson",
            "datePublished": "Mon, 04 Jun 2018 22:09:37 +0000",
            "description": "On this Topic-based miniseries, this is part 1 of how to create grow and monetize a YouTube channel.  This episode features the first half of my conversation with Brian G. Johnson, and we dig deep into how to initially set up your youtube channel, your brand and your artwork, and how to deconstruct the analytics […]",
            "length": "34335843",
            "sourceUrl": "https://traffic.libsyn.com/solohour/708.mp3",
            "categories": [
                "Podcast"
            ]
        },
        {
            "title": "707: 9 Million Downloads Celebration Show!",
            "datePublished": "Sat, 02 Jun 2018 17:16:56 +0000",
            "description": "On today’s episode (which is a DOOZY!) we celebrate 9 Million Downloads together.  (Warning:  This episode is FULL of actionable advice that you will probably end up taking to move your life forward…sorry about that.)",
            "length": "29233259",
            "sourceUrl": "https://traffic.libsyn.com/solohour/707.mp3",
            "categories": [
                "Podcast"
            ]
        },
        {
            "title": "706: From Teacher and Librarian to Digital Entrepreneurs, with Shane and Jocelyn Sams (best of)",
            "datePublished": "Wed, 30 May 2018 17:51:22 +0000",
            "description": "Welcome to episode 706 of The Solopreneur Hour! I love episodes like today’s when I get to speak to not just one guest, but two. And today’s duo is even better: they are a married couple who now run a super successful online business helping other couples do the same. Shane and Jocelyn Sams of […]",
            "length": "54414688",
            "sourceUrl": "https://traffic.libsyn.com/solohour/706.mp3",
            "categories": [
                "Career Advice",
                "Love & Relationships",
                "Man",
                "Mindset & Overcoming Adversity",
                "Podcast",
                "Podcasting",
                "Website / Search Engine Optimization",
                "Entrepreneur Training",
                "flipped lifestyle"
            ]
        },
        {
            "title": "705: 10 Ways To Monetize Your Solopreneur Business",
            "datePublished": "Mon, 28 May 2018 19:39:28 +0000",
            "description": "Today I go over 10 ways to monetize your solopreneur business, whether you’re running a podcast, youtube channel, blog, or any other solopreneur biz!",
            "length": "28990352",
            "sourceUrl": "https://traffic.libsyn.com/solohour/705.mp3",
            "categories": [
                "Podcast"
            ]
        },
        {
            "title": "704: FREE COACHING FRIDAY! Solopreneur Q&A",
            "datePublished": "Fri, 25 May 2018 18:56:26 +0000",
            "description": "Free Coaching Friday from The Solopreneur Hour! If you’re new and don’t know how this works here goes: once a week I ask you to send me your questions and I answer them on Friday. If you want to be part of the fun for next week’s Q&A show join us in the Facebook group here or […]",
            "length": "34142185",
            "sourceUrl": "https://traffic.libsyn.com/solohour/704.mp3",
            "categories": [
                "Podcast"
            ]
        },
        {
            "title": "703: How To Make A Living AND Have FUN At The Same Time, with Joel Comm",
            "datePublished": "Wed, 23 May 2018 17:27:10 +0000",
            "description": "Joel Comm stops by the show to talk about his new book: The Fun Formula – How Curiousity, Risk-Taking, and Serendipity Can Revolutionize How You Work., in stores June 5. Pre-order Joel’s Book Here On this episode we chat about Joel’s career, and how “fun” is the connective tissue between all of his projects, between […]",
            "length": "58268820",
            "sourceUrl": "https://traffic.libsyn.com/solohour/703.mp3",
            "categories": [
                "Podcast"
            ]
        },
        {
            "title": "702: Start A Successful Solopreneur Business with the B.A.M. Formula, and your Q’s…",
            "datePublished": "Mon, 21 May 2018 06:31:12 +0000",
            "description": "In this “Free Coaching Monday” Episode, I define the acronym B.A.M., and how following it will all but ensure your solopreneur success.  I also discuss my new YouTube Channel, Rennch. Then I dig into your questions for Free Coaching Monday! Rennch™ on YouTube Rennch™ on Instagram",
            "length": "21117253",
            "sourceUrl": "https://traffic.libsyn.com/solohour/702.mp3",
            "categories": [
                "Podcast"
            ]
        },
        {
            "title": "701: The Solopreneur Gig You Can Start TODAY, with Abbey Ashley",
            "datePublished": "Mon, 14 May 2018 18:59:32 +0000",
            "description": "Abbey Ashley has created an amazing Virtual Assistant business.  Can you write?  Can you talk on the phone?  Can you send an email?  Then you can become a virtual assistant too! Get her Virtual Assistant Launch Checklist and Starter Kit – This checklist contains the exact method that she took to go from $0 to […]",
            "length": "45786206",
            "sourceUrl": "https://traffic.libsyn.com/solohour/701.mp3",
            "categories": [
                "Podcast"
            ]
        },
        {
            "title": "700: How To Spend $1000, Staying Motivated, and Your Questions",
            "datePublished": "Fri, 11 May 2018 19:04:02 +0000",
            "description": "Welcome to an epic Free Coaching Friday episode 700 from The Solopreneur Hour! If you’re new and don’t know how this works here goes: once a week I ask you to send me your questions and I answer them on Friday. If you want to be part of the fun for next week’s Q&A show join […]",
            "length": "33364078",
            "sourceUrl": "https://traffic.libsyn.com/solohour/700.mp3",
            "categories": [
                "Podcast"
            ]
        },
        {
            "title": "699: 10 Ways to Stay Healthy While Working HARD, with Melissa Ramos (best of)",
            "datePublished": "Thu, 10 May 2018 17:37:07 +0000",
            "description": "As solopreneurs one of the keys to our success is our health. We’ve talked about this subject a few times because without health and vitality solopreneurship is an even more difficult path. Joining us to share her expertise is Melissa Ramos of Sexy Food Therapy. She’s a certified nutritionist with a background in Chinese medicine […]",
            "length": "62981666",
            "sourceUrl": "https://traffic.libsyn.com/solohour/699.mp3",
            "categories": [
                "Branding & Identity",
                "Fitness & Health",
                "Health",
                "Internet Marketing",
                "Life Coaching",
                "Melissa Ramos",
                "Outsourcing",
                "Podcast",
                "Woman"
            ]
        },
        {
            "title": "698: Surrounding Yourself with Success and Becoming an Agent of Change with Rich Brooks",
            "datePublished": "Mon, 07 May 2018 20:45:26 +0000",
            "description": "Rich Brooks is the founder of the premier digital marketing conference on the east coast, which will be celebrating it’s 7th annual https://www.theagentsofchange.com/ in Portland Maine Sept. 20-21. On today’s show we talk about becoming an “agent of change”, and what that actually means.  He also gives insights as to what makes a great conference.",
            "length": "48591666",
            "sourceUrl": "https://traffic.libsyn.com/solohour/698.mp3",
            "categories": [
                "Podcast"
            ]
        },
        {
            "title": "697: How To Reset and Recharge, and Your Questions for Free Coaching Friday!",
            "datePublished": "Fri, 04 May 2018 19:15:09 +0000",
            "description": "Free Coaching Friday from The Solopreneur Hour! If you’re new and don’t know how this works here goes: once a week I ask you to send me your questions and I answer them on Friday. If you want to be part of the fun for next week’s Q&A show join us in the Facebook group here or […]",
            "length": "20153932",
            "sourceUrl": "https://traffic.libsyn.com/solohour/697.mp3",
            "categories": [
                "Podcast"
            ]
        },
        {
            "title": "696: Stephen Warley On How To Begin Your Solopreneur Journey",
            "datePublished": "Mon, 30 Apr 2018 18:38:11 +0000",
            "description": "Stephen Warley is the former co-founder of Unstuckable.  His new business is https://lifeskillsthatmatter.com/  where he’s helping 9-5’ers become Solopreneurs.  On this chat, we talk about the pivot from Unstuckable, and how he had to come to grips with his true calling, which is teaching people how they can pivot from their 9-5, start working from home, […]",
            "length": "47964502",
            "sourceUrl": "https://traffic.libsyn.com/solohour/696.mp3",
            "categories": [
                "Podcast"
            ]
        },
        {
            "title": "695: The Best Solopreneur Business, and More Q&A",
            "datePublished": "Sat, 28 Apr 2018 16:18:11 +0000",
            "description": "Free Coaching Friday from The Solopreneur Hour! If you’re new and don’t know how this works here goes: once a week I ask you to send me your questions and I answer them on Friday. If you want to be part of the fun for next week’s Q&A show join us in the Facebook group here or […]",
            "length": "21842949",
            "sourceUrl": "https://traffic.libsyn.com/solohour/695.mp3",
            "categories": [
                "Podcast"
            ]
        },
        {
            "title": "694: How to Massively Uplevel Your Coaching Business, with Ajit Nawalkha",
            "datePublished": "Wed, 25 Apr 2018 21:36:40 +0000",
            "description": "Ajit Nawalkha is the Co-Founder of Mindvalley.com and the Host of Evercoach. His life was transformed by smart, gifted coaches and mentors, and this motivated him to become a coach himself. His mission is to empower dedicated educators, coaches and teachers to facilitate positive change in the world. On today’s episode we talk all about […]",
            "length": "49421681",
            "sourceUrl": "https://traffic.libsyn.com/solohour/694.mp3",
            "categories": [
                "Podcast"
            ]
        },
        {
            "title": "693: The ART of Scaling Yourself with Sean Dietrich",
            "datePublished": "Mon, 23 Apr 2018 19:16:06 +0000",
            "description": "You’re a Solopreneur. Talented, creative, inspired. You work your butt off, and work well one-on-one. But how do you scale that into a larger business? How do you remove yourself from the equation? It’s especially hard if you’re in a creative field, like being an artist, musician, or performer.  On today’s show, artist Sean Dietrich shares how […]",
            "length": "47215854",
            "sourceUrl": "https://traffic.libsyn.com/solohour/693.mp3",
            "categories": [
                "Podcast"
            ]
        },
        {
            "title": "692: A Special New Program, and Your Questions Answered!",
            "datePublished": "Fri, 20 Apr 2018 19:54:36 +0000",
            "description": "On today’s show we bang out your free coaching Friday questions, and I announce a new Pilot program:  A group podcast launch. 8 weeks until your first world class episode.  To become one of the limited (and discounted first time members, click here!) Program starts May 3.  ",
            "length": "23872517",
            "sourceUrl": "https://traffic.libsyn.com/solohour/692.mp3",
            "categories": [
                "Podcast"
            ]
        },
        {
            "title": "691: Affiliate Marketing MasterClass with Matt McWilliams",
            "datePublished": "Mon, 16 Apr 2018 18:55:56 +0000",
            "description": "Affiliate Marketing.  What is it?  Should you do it? How do you make any money?  Do you need to have money to make money in affiliate marketing?  How long does it take?  How large should my list be?  We answer all these questions and more on today’s episode of the Solopreneur Hour! Find Matt McWilliams […]",
            "length": "46907735",
            "sourceUrl": "https://traffic.libsyn.com/solohour/691.mp3",
            "categories": [
                "Podcast"
            ]
        },
        {
            "title": "690: What Solopreneurs Are Struggling With | Solopreneur Q&A",
            "datePublished": "Sat, 14 Apr 2018 22:13:59 +0000",
            "description": "Free Coaching Saturday from The Solopreneur Hour! If you’re new and don’t know how this works here goes: once a week I ask you to send me your questions and I answer them on Friday. If you want to be part of the fun for next week’s Q&A show join us in the Facebook group here or […]",
            "length": "28719198",
            "sourceUrl": "https://traffic.libsyn.com/solohour/690.mp3",
            "categories": [
                "Podcast"
            ]
        },
        {
            "title": "689: Greg Smith of Thinkific on Creating an Online Course Platform, and Leadership Development",
            "datePublished": "Wed, 11 Apr 2018 19:52:25 +0000",
            "description": "Today we’ve got Greg Smith, lawyer turned coursemaker turned founder of Thinkific, to talk about how Thinkific started, why and how you should start your own course, how he developed into a leader, and a lot more! If you want to take a crack at your own online course, you can do it for free […]",
            "length": "50254188",
            "sourceUrl": "https://traffic.libsyn.com/solohour/689.mp3",
            "categories": [
                "Podcast"
            ]
        },
        {
            "title": "688: The Dynamic Duo of Fitness, Chris & Eric Martinez",
            "datePublished": "Mon, 09 Apr 2018 21:09:52 +0000",
            "description": "Check Chris and Eric out at dynamicduotraining.com. Get the book, The New Era of Fitness here: theneweraoffitness.com Identical twins, Chris and Eric Martinez have a different, modern take on health, fitness, and eating well.  On this episode we talk about some of the myths surrounding what to eat, how to tailor your program to your age and […]",
            "length": "49033296",
            "sourceUrl": "https://traffic.libsyn.com/solohour/688.mp3",
            "categories": [
                "Podcast"
            ]
        },
        {
            "title": "687: Let’s Answer Your Questions! It’s FREE COACHING FRIDAY! (kind of)",
            "datePublished": "Mon, 09 Apr 2018 21:05:39 +0000",
            "description": "Free Coaching Monday from The Solopreneur Hour! If you’re new and don’t know how this works here goes: once a week I ask you to send me your questions and I answer them on Friday. Except today.  Which is Monday. If you want to be part of the fun for next week’s Q&A show join us […]",
            "length": "22374746",
            "sourceUrl": "https://traffic.libsyn.com/solohour/687.mp3",
            "categories": [
                "Podcast"
            ]
        },
        {
            "title": "686: Angie Lee – Personality and Perserverance Equal Huge Success",
            "datePublished": "Wed, 04 Apr 2018 06:40:11 +0000",
            "description": "Angie Lee is your hilarious + wicked smart business bestie you’ve always wanted. Warning; You will laugh your butt off & be inspired to make your bank account not suck. $100k in debt to 7 figures under 30, Angie is dedicated to sharing her story & showing women how to upgrade their relationship with money […]",
            "length": "47080791",
            "sourceUrl": "https://traffic.libsyn.com/solohour/686.mp3",
            "categories": [
                "Podcast"
            ]
        },
        {
            "title": "685: Awesome SEO Hacks, YouTube Channel Growth, with Brian Dean (best of)",
            "datePublished": "Mon, 02 Apr 2018 20:29:49 +0000",
            "description": "Brian Dean from Backlinko.com joins us today to talk about his journey from black hat SEO to white hat SEO, a great infographic guest post strategy, beginner SEO strategies and tips, and how to get more views and grow your YouTube channel. SEM Rush #1 tool for SEO. ",
            "length": "47749574",
            "sourceUrl": "https://traffic.libsyn.com/solohour/685.mp3",
            "categories": [
                "Podcast"
            ]
        },
        {
            "title": "684: New Instagram Tips, Best Conferences, and More! | Free Coaching Friday!",
            "datePublished": "Fri, 30 Mar 2018 21:38:22 +0000",
            "description": "Welcome to our weekly Q&A edition of The Solopreneur Hour. If you haven’t been here before on Fridays we publish an episode devoted to answering YOUR questions dear listeners! To submit a question join the mailing list, contact me via the Contact page on the site or join our Proudly Unemployable Facebook group. You can […]",
            "length": "19381271",
            "sourceUrl": "https://traffic.libsyn.com/solohour/684.mp3",
            "categories": [
                "Podcast"
            ]
        },
        {
            "title": "683: Locating & Connecting with Your IDEAL Customer with Jeffrey Shaw",
            "datePublished": "Wed, 21 Mar 2018 19:09:47 +0000",
            "description": "Jeffrey Shaw, author of Lingo, stopped by the show today.  A photographer by trade, Jeffrey is great at identifying and speaking to an audience in the most optimal way.  His new book Lingo, breaks down exactly how to do that. Find Jeffrey https://jeffreyshaw.com https://creativewarriorsunite.com/ Twitter @jeffreyshaw1 Creative Warriors Podcast, Monday and Wednesday on itunes The […]",
            "length": "44371238",
            "sourceUrl": "https://traffic.libsyn.com/solohour/683.mp3",
            "categories": [
                "Podcast"
            ]
        },
        {
            "title": "682: 10 Awesome Books, 10 Awesome Lessons, with AJ Roberts",
            "datePublished": "Mon, 19 Mar 2018 07:16:11 +0000",
            "description": "AJ Roberts reads a book every 2 or 3 days.  He was asked about his top 10 books on his Facebook page, and had this answer: Top 10 Books Of The Year Got the following message in my inbox “AJ, what are the Top 10 books you’d recommend?” Sounds like a simple question right… …but […]",
            "length": "57589939",
            "sourceUrl": "https://traffic.libsyn.com/solohour/682.mp3",
            "categories": [
                "Podcast"
            ]
        },
        {
            "title": "681: Teaching Luddites to Instagram, Launching a Podcast, and more… | Solopreneur Q&A",
            "datePublished": "Sun, 18 Mar 2018 22:39:00 +0000",
            "description": "Your questions for Free coaching (Sunday!) Welcome to our weekly Q&A edition of The Solopreneur Hour. If you haven’t been here before on Fridays we publish an episode devoted to answering YOUR questions dear listeners! To submit a question join the mailing list, contact me via the Contact page on the site or join our […]",
            "length": "22978607",
            "sourceUrl": "https://traffic.libsyn.com/solohour/681.mp3",
            "categories": [
                "Podcast"
            ]
        },
        {
            "title": "680: Gary Leland on Starting Multiple Solopreneur Businesses | Just DO it!",
            "datePublished": "Wed, 14 Mar 2018 17:50:46 +0000",
            "description": "Today’s show is with podcast legend Gary Leland.  Not only is he in the podcasting hall of fame, but he has started multiple businesses in just about every industry you can imagine.  If there’s one thing about this episode, it should help you get over the fear of starting, and get out of your own […]",
            "length": "45269267",
            "sourceUrl": "https://traffic.libsyn.com/solohour/680.mp3",
            "categories": [
                "Podcast"
            ]
        },
        {
            "title": "679: Maneesh Sethi | Create New Good Habits, Break Old Bad Ones",
            "datePublished": "Mon, 12 Mar 2018 07:54:35 +0000",
            "description": "Maneesh Sethi, serial entrepreneur, digital nomad, and fellow procrastinator, was in studio to talk about Pavlok, his “accountibility” company.  Maneesh is famous for hiring a Craigslist girl to smack him across the face if he got off task.  You see…he has the same procrastination and distraction bug that many of us do.  Fortunately for us, […]",
            "length": "52706015",
            "sourceUrl": "https://traffic.libsyn.com/solohour/679.mp3",
            "categories": [
                "Podcast"
            ]
        },
        {
            "title": "678: Podcast planning, Instagram tips, Live Events, and More… | Solopreneur Coaching",
            "datePublished": "Sat, 10 Mar 2018 01:12:24 +0000",
            "description": "Today’s FCF is brought to you by…me! After 15 years making a living as a designer and branding guy, I started a social media consulting agency in 2009, and a podcast consulting agency in 2012. It dawned on me the other day that many of you don’t know what I actually do for a living. […]",
            "length": "23303714",
            "sourceUrl": "https://traffic.libsyn.com/solohour/678.mp3",
            "categories": [
                "Podcast"
            ]
        },
        {
            "title": "677: Dana Malstaff Live From Social Media Marketing World 2018",
            "datePublished": "Sat, 03 Mar 2018 00:16:45 +0000",
            "description": "Every time I sit with Dana Malstaff I learn something…and so will you. Dana Malstaff is the CEO and Founder of Boss Mom. She is a mother, author, speaker, business strategist, podcaster, blind spot reducer, and movement maker. She launched the Boss Mom brand with her first book Boss Mom: The Ultimate Guide to Raising […]",
            "length": "30288601",
            "sourceUrl": "https://traffic.libsyn.com/solohour/677.mp3",
            "categories": [
                "Podcast"
            ]
        },
        {
            "title": "676: Jordan Harbinger on Reinventing, and the Fear of Starting Over | The Solopreneur Hour",
            "datePublished": "Wed, 28 Feb 2018 19:42:50 +0000",
            "description": "Jordan Harbinger (formerly of The Art of Charm) talks about leaving AoC, his fear around starting over, and his vision for the Jordan Harbinger Show. Do us all a favor…subscribe to The Jordan Harbinger Show",
            "length": "52782422",
            "sourceUrl": "https://traffic.libsyn.com/solohour/676.mp3",
            "categories": [
                "Podcast"
            ]
        },
        {
            "title": "675: How To Launch Your Own Event, and Sales Won’t Save Your Business, with Joe Pardo",
            "datePublished": "Mon, 26 Feb 2018 18:24:05 +0000",
            "description": "My buddy Joe Pardo, creator of MAPCON, (Mid atlantic podcast conference) stopped by to chat about his new book, Sales Won’t Save Your Business (available on Amazon for pre-order NOW).  We dug into what it’s like to create a conference from scratch, what kind of problems you can expect, and how much it costs. In Sales […]",
            "length": "46120376",
            "sourceUrl": "https://traffic.libsyn.com/solohour/675.mp3",
            "categories": [
                "Podcast"
            ]
        },
        {
            "title": "674: Building Leadership Skills with Freshbooks’ Founder & CEO, Mike McDerment",
            "datePublished": "Fri, 23 Feb 2018 23:01:45 +0000",
            "description": "What would you do if you built a piece of software to solve a problem you had, then it grew into a thriving, multimillion dollar company?  CEO and co-founder of Freshbooks, Mike McDerment has the answer today.  We talk about evolving your business, growing as a leader, handling adversity and tough situations, and not being overly […]",
            "length": "41534204",
            "sourceUrl": "https://traffic.libsyn.com/solohour/674.mp3",
            "categories": [
                "Podcast"
            ]
        },
        {
            "title": "673: Do Things That Don’t Scale, and A Million Other Business Tips, with John Lee Dumas",
            "datePublished": "Tue, 20 Feb 2018 01:51:13 +0000",
            "description": "JLD is in the house for a fun episode, that, is completely value-packed.  Enjoy.",
            "length": "58066023",
            "sourceUrl": "https://traffic.libsyn.com/solohour/673.mp3",
            "categories": [
                "Podcast"
            ]
        },
        {
            "title": "672: Tony Robbins’ Right Hand Man, Eli Wilhide, on the Solopreneur Mindset",
            "datePublished": "Wed, 14 Feb 2018 20:11:40 +0000",
            "description": "As solopreneurs we face many battles, not the least of which is our own internal state and mindset. Joining us to talk about this very topic is the brilliant (and hunky) Eli Wilhide. We have a great chat about growing up in a tough environment, winning the lottery (it’s true!) and how he came to […]",
            "length": "60997214",
            "sourceUrl": "https://traffic.libsyn.com/solohour/672.mp3",
            "categories": [
                "Podcast"
            ]
        },
        {
            "title": "671: Connection, Relationships, & Stories – Why we become Podcast Junkies, with Harry Duran",
            "datePublished": "Mon, 12 Feb 2018 21:45:59 +0000",
            "description": "I sat down in Orlando with Harry Duran, the host of Podcast Junkies, (every Wednesday on iTunes) and had a great chat about what makes podcasting great, what his journey to the microphone was, and all kinds of other juicy business tidbits.",
            "length": "55544658",
            "sourceUrl": "https://traffic.libsyn.com/solohour/671.mp3",
            "categories": [
                "Podcast"
            ]
        },
        {
            "title": "670: Venturing on your own, Network Marketing, and More of Your Questions",
            "datePublished": "Mon, 12 Feb 2018 19:56:57 +0000",
            "description": "Free Coaching Friday from The Solopreneur Hour! If you’re new and don’t know how this works here goes: once a week I ask you to send me your questions and I answer them on Friday. If you want to be part of the fun for next week’s Q&A show join us in the Facebook group here or […]",
            "length": "29527780",
            "sourceUrl": "https://traffic.libsyn.com/solohour/670.mp3",
            "categories": [
                "Podcast"
            ]
        },
        {
            "title": "669: 7 Tips for Success with Legendary Drummer Kenny Aronoff",
            "datePublished": "Wed, 07 Feb 2018 06:13:11 +0000",
            "description": "John Cougar Mellencamp, Bob Dylan, John Fogerty, Avril Levigne, Alanis Morrissette, Elton John, Bon Jovi, Meatloaf, Melissa Etheridge, Joe Cocker, Randy Newman, Brian Setzer, Iggy Pop, Belinda Carlisle…the list goes on and on. What do they have in common? Kenny Aronoff was their drummer. Literally one of the most recorded drummers of all time. He’s […]",
            "length": "55709778",
            "sourceUrl": "https://traffic.libsyn.com/solohour/669.mp3",
            "categories": [
                "Podcast"
            ]
        },
        {
            "title": "668: Solopreneur Taxes, Business Structure, and Planning with The Cashflow Doctor, Eric Nghiem",
            "datePublished": "Mon, 05 Feb 2018 20:56:36 +0000",
            "description": "Eric Nghiem recognized his “entrepreneur gene” early on, by becoming an eBay Power Seller with used paintball equipment.  As his fascination with business and entrepreneurship grew, so did his bank account.  He became a true “numbers” guy, and now focuses his efforts on helping solopreneurs and small businesses save more of the money they’ve worked […]",
            "length": "44308185",
            "sourceUrl": "https://traffic.libsyn.com/solohour/668.mp3",
            "categories": [
                "Podcast"
            ]
        },
        {
            "title": "667: Repurposing Content, Saying “Yes”, How To Outsource, Working with Your Significant Other, and more…",
            "datePublished": "Mon, 05 Feb 2018 19:47:01 +0000",
            "description": "Free Coaching Friday from The Solopreneur Hour! If you’re new and don’t know how this works here goes: once a week I ask you to send me your questions and I answer them on Friday. If you want to be part of the fun for next week’s Q&A show join us in the Facebook group here or […]",
            "length": "25670824",
            "sourceUrl": "https://traffic.libsyn.com/solohour/667.mp3",
            "categories": [
                "Podcast"
            ]
        },
        {
            "title": "666: Pink Floyd? (Not The Devil.)  My Favorite Episode From 2017 with Legendary Sax Player Scott Page",
            "datePublished": "Sun, 28 Jan 2018 19:51:08 +0000",
            "description": "Well, this is a treat.  We get to hear from a rock legend on today’s show. In this one-on-one conversation with sax player Scott Page (Pink Floyd, Supertramp, Toto) who has not only played music for millions…but is arguably more successful as a solopreneur after his main music career. This was so much fun to record. I could have […]",
            "length": "69720671",
            "sourceUrl": "https://traffic.libsyn.com/solohour/666.mp3",
            "categories": [
                "Podcast"
            ]
        },
        {
            "title": "665: Patrick Norton – Making a Career in Tech by Saying “Yes”",
            "datePublished": "Tue, 23 Jan 2018 01:17:11 +0000",
            "description": "Patrick Norton (@patricknorton) has been a technology writer and television presenter for close to 25 years.  On this episode, we chat about his journey from writing tech reviews for magazines to starring in a technology television show with over 45 million viewers, because of saying “yes” to opportunity, whether it was scary or not! Check […]",
            "length": "51603268",
            "sourceUrl": "https://traffic.libsyn.com/solohour/665.mp3",
            "categories": [
                "Podcast"
            ]
        },
        {
            "title": "664: Should You Charge For Your Time? | Solopreneur Coaching",
            "datePublished": "Sat, 20 Jan 2018 21:13:18 +0000",
            "description": "Welcome to our weekly Q&A edition of The Solopreneur Hour. If you haven’t been here before on Fridays we publish an episode devoted to answering YOUR questions dear listeners! To submit a question join the mailing list, contact me via the Contact page on the site or join our Proudly Unemployable Facebook group. You can […]",
            "length": "23743245",
            "sourceUrl": "https://traffic.libsyn.com/solohour/664.mp3",
            "categories": [
                "Podcast"
            ]
        },
        {
            "title": "663: Find Your Swing (Solopreneur Coaching) with Matthew Kimberley (Best Of)",
            "datePublished": "Wed, 17 Jan 2018 07:58:41 +0000",
            "description": "Solopreneurs! Thanks for joining us on another installment of Find Your Swing (Solopreneur Coaching). It’s been a minute! I’ve missed doing these with you all so I’m extra excited to bring these type of shows back. Today’s episode brings us an extra special co-host, Matthew Kimberley from episode 274. I say extra special because it’s his […]",
            "length": "72801763",
            "sourceUrl": "https://traffic.libsyn.com/solohour/663.mp3",
            "categories": [
                "Career Advice",
                "Podcast"
            ]
        },
        {
            "title": "662: How To Tell When Your Business Has Momentum",
            "datePublished": "Mon, 15 Jan 2018 08:43:15 +0000",
            "description": "I’m just back from CES Las Vegas after a busy conference week.  Some remarkable things happened regarding my Beginner Audiophile (https://beginneraudiophile.com) brand, and I’d like to share them with you. In this episode, we talk about how to recognize when your business has momentum, and what to do about it.",
            "length": "35357877",
            "sourceUrl": "https://traffic.libsyn.com/solohour/662.mp3",
            "categories": [
                "Podcast"
            ]
        },
        {
            "title": "661: From Photographer to 100% Time & Financial Freedom, with Vincent Pugliese",
            "datePublished": "Mon, 08 Jan 2018 05:25:30 +0000",
            "description": "Our friend Vincent Pugliese is back on the show with his new book, Freelance to Freedom.  After catching up a bit about the Steelers’ James Harrison defecting to the evil New England Patriots, we dug into his book writing process, what “Freelance to Freedom” means, and talked about his new national tour (That he’s bringing […]",
            "length": "43256247",
            "sourceUrl": "https://traffic.libsyn.com/solohour/661.mp3",
            "categories": [
                "Podcast"
            ]
        },
        {
            "title": "660: Chris Harder on Reframing Our Money Mindset | The Solopreneur Hour",
            "datePublished": "Wed, 03 Jan 2018 18:07:29 +0000",
            "description": "Chris Harder lives a life that many of us would call our “dream life”.  Surrounded by a loving family, beautiful wife, beautiful home in one of the nicest cities in the country.  He’s the kind of guy that, when he speaks, we should listen. I interviewed Chris and his wife Lori on Episode 3 of […]",
            "length": "36789937",
            "sourceUrl": "https://traffic.libsyn.com/solohour/660.mp3",
            "categories": [
                "Podcast"
            ]
        },
        {
            "title": "659: Solopreneur Coaching Show – Train Your Dog, Plan Your Content, & Social Media Marketing World",
            "datePublished": "Fri, 29 Dec 2017 23:44:35 +0000",
            "description": "Free Coaching Friday from The Solopreneur Hour! If you’re new and don’t know how this works here goes: once a week I ask you to send me your questions and I answer them on Friday. If you want to be part of the fun for next week’s Q&A show join us in the Facebook group here or […]",
            "length": "20143759",
            "sourceUrl": "https://traffic.libsyn.com/solohour/659.mp3",
            "categories": [
                "Podcast"
            ]
        },
        {
            "title": "658: John Dennis is The Guy Behind The Scenes of Your Favorite Conferences",
            "datePublished": "Thu, 21 Dec 2017 09:09:31 +0000",
            "description": "My good buddy John Dennis stopped by episode 658 of the Solopreneur Hour.  John is the guy behind the scenes at the Thrive (one of my favorite) conference, and is a co-owner of Podfest Multimedia Expo. Today we talk about the conferences, how to get into Facebook ads (and why they matter), and a bunch […]",
            "length": "48371985",
            "sourceUrl": "https://traffic.libsyn.com/solohour/658.mp3",
            "categories": [
                "Podcast"
            ]
        },
        {
            "title": "657: Let’s Answer Your Questions!  It’s FREE COACHING FRIDAY!",
            "datePublished": "Sat, 16 Dec 2017 02:40:59 +0000",
            "description": "Free Coaching Friday from The Solopreneur Hour! If you’re new and don’t know how this works here goes: once a week I ask you to send me your questions and I answer them on Friday. If you want to be part of the fun for next week’s Q&A show join us in the Facebook group here or […]",
            "length": "22215632",
            "sourceUrl": "https://traffic.libsyn.com/solohour/657.mp3",
            "categories": [
                "Podcast"
            ]
        },
        {
            "title": "656: How to Systematize Your Solopreneur Business with Dana Malstaff | The Solopreneur Hour Podcast",
            "datePublished": "Wed, 13 Dec 2017 22:31:01 +0000",
            "description": "Today our good friend Dana Malstaff (https://boss-mom.com) stops by to talk about the basics of systematizing your solopreneur biz.  She runs a veritable empire over there at Boss Mom, and had to get started somewhere. A few things we covered: a GREAT tip about setting up your schedule How and when to create content What […]",
            "length": "54834240",
            "sourceUrl": "https://traffic.libsyn.com/solohour/656.mp3",
            "categories": [
                "Podcast"
            ]
        },
        {
            "title": "655: How YOU Can Build A Business From Your Existing Skillset (Find Your Swing™ Episode 1) Best Of | The Solopreneur Hour Podcast",
            "datePublished": "Mon, 11 Dec 2017 08:52:48 +0000",
            "description": "In this replay of this inaugural episode of “FIND YOUR SWING™”, Dawnmarrs.com and I review 6 listener submissions, and try to help them figure out how they can build a business, scale themselves, or break out of the 9-5.  In this show, we touch on the arts and crafts world, the music industry, the programming/computer industry, […]",
            "length": "43903714",
            "sourceUrl": "https://traffic.libsyn.com/solohour/655.mp3",
            "categories": [
                "Podcast"
            ]
        },
        {
            "title": "654: Travel Adventures in Australia, and YOUR Questions! | The Solopreneur Hour Podcast",
            "datePublished": "Sat, 09 Dec 2017 23:30:48 +0000",
            "description": "Free Coaching Friday from The Solopreneur Hour! If you’re new and don’t know how this works here goes: once a week I ask you to send me your questions and I answer them on Friday. If you want to be part of the fun for next week’s Q&A show join us in the Facebook group here or […]",
            "length": "25185227",
            "sourceUrl": "https://traffic.libsyn.com/solohour/654.mp3",
            "categories": [
                "Podcast"
            ]
        },
        {
            "title": "653: How To Build A Business from Your Hobby, w/ Melbourne Watch Co. Founder Sujain Krishnan – The Solopreneur Hour Podcast",
            "datePublished": "Mon, 04 Dec 2017 05:03:30 +0000",
            "description": "The concept of The Solopreneur Hour has always been to feature people that have made a business out of their hobbies and their skill sets. There’s no more evident example of that then today’s guest, Sujain Krishnan. Just a few short years ago, he went down the rabbit hole of collecting affordable automatic watches. Watch […]",
            "length": "45273834",
            "sourceUrl": "https://traffic.libsyn.com/solohour/653.mp3",
            "categories": [
                "Podcast"
            ]
        },
        {
            "title": "652: How To Turn Your Million Dollar Idea Into…A Million Dollars",
            "datePublished": "Mon, 27 Nov 2017 13:43:45 +0000",
            "description": "Do you think inventors are born or can any solopreneur come up with a new idea? Our guest on today’s show says anyone can do it. And he would know, his name is Stephen Key and he’s been the force behind such smash hits as Teddy Ruxpin and Laser-tag, among many other inventions and creations you […]",
            "length": "56830550",
            "sourceUrl": "https://traffic.libsyn.com/solohour/652.mp3",
            "categories": [
                "Podcast"
            ]
        },
        {
            "title": "651: Listening To Your Audience, YouTube Growth, & Taking Chances, with Jeff Micklem of Home Built By Jeff",
            "datePublished": "Wed, 22 Nov 2017 15:01:51 +0000",
            "description": "Today we’re recording from Jeff Micklem’s (Home Built By Jeff on Youtube) beautiful house in Bowral Australia, about 2 hours south of Sydney. We had a great chat, spanning topics from Youtube growth, where to get made to order t-shirts, sucking at the beginning, being resourceful and why it’s so important, how he generates capital […]",
            "length": "58123390",
            "sourceUrl": "https://traffic.libsyn.com/solohour/651.mp3",
            "categories": [
                "Podcast"
            ]
        },
        {
            "title": "650: James Schramko Will 10x Your Business",
            "datePublished": "Mon, 20 Nov 2017 13:17:38 +0000",
            "description": "Another really inspirational chat with James Schramko of https://superfastbusiness.com (and JamesSchramko.com) at his house in Sydney. James has undergone a “simplified” makeover over the last few years, and relishes in the elimination of things, distraction, and bad influences. His simplified, practical approach to business (and life) garners consistent results with his clients, and makes him […]",
            "length": "46410164",
            "sourceUrl": "https://traffic.libsyn.com/solohour/650.mp3",
            "categories": [
                "Podcast"
            ]
        },
        {
            "title": "649: Free Coaching Fri-(Sunday)-Day!",
            "datePublished": "Mon, 20 Nov 2017 06:30:46 +0000",
            "description": "Free Coaching Friday from The Solopreneur Hour! If you’re new and don’t know how this works here goes: once a week I ask you to send me your questions and I answer them on Friday. If you want to be part of the fun for next week’s Q&A show join us in the Facebook group here or […]",
            "length": "17730937",
            "sourceUrl": "https://traffic.libsyn.com/solohour/649.mp3",
            "categories": [
                "Podcast"
            ]
        },
        {
            "title": "648: Upping Your Audio Game with Anna Vocino (Best of)",
            "datePublished": "Fri, 17 Nov 2017 00:29:18 +0000",
            "description": "Ever wonder how those people speaking on movie trailers, audio books and commercials get their work? Here to tell us the secrets of the voiceover world is the lovely and talented, Anna Vocino. Anna’s making her second appearance on the show, you can listen to her maiden voyage here. In episode 121, our chit-chat covers […]",
            "length": "73408436",
            "sourceUrl": "https://traffic.libsyn.com/solohour/648.mp3",
            "categories": [
                "Podcast"
            ]
        },
        {
            "title": "647: Productivity and Life Hacks with Hugh Culver (Best Of)",
            "datePublished": "Mon, 13 Nov 2017 10:11:30 +0000",
            "description": "Ever notice how the most successful people also DO the most with their days? Hugh Culver is no exception. (2017 Note: Be sure to check out Hugh’s new brand which is “Business of Speaking” on https://hughculver.com) He spent 18 years growing a successful coaching, speaking and consulting business, Hugh is also a seminar leader and […]",
            "length": "52709677",
            "sourceUrl": "https://traffic.libsyn.com/solohour/647.mp3",
            "categories": [
                "Podcast"
            ]
        },
        {
            "title": "646: Free Coaching Friday! Answering Your Questions | The Solopreneur Hour",
            "datePublished": "Sat, 11 Nov 2017 08:34:19 +0000",
            "description": "Free Coaching (Saturday, kinda)  from The Solopreneur Hour! If you’re new and don’t know how this works here goes: once a week I ask you to send me your questions and I answer them on Friday. If you want to be part of the fun for next week’s Q&A show join us in the Facebook group […]",
            "length": "17454766",
            "sourceUrl": "https://traffic.libsyn.com/solohour/646.mp3",
            "categories": [
                "Podcast"
            ]
        },
        {
            "title": "645: Jordan Harbinger is a Personality on the Mic | The Solopreneur Hour Podcast",
            "datePublished": "Wed, 08 Nov 2017 07:59:29 +0000",
            "description": "One of the biggest challenges of doing online business, or running a podcast or youtube channel, is “finding your voice”.  Sitting on a bench with Jordan Harbinger from Art of Charm, it was clearly evident that he was confident in his personality and his voice.  I suppose that’s what you get when you do something […]",
            "length": "38676210",
            "sourceUrl": "https://traffic.libsyn.com/solohour/645.mp3",
            "categories": [
                "Podcast"
            ]
        },
        {
            "title": "644: Nathan Chan from Foundr on Listening to Your Customers, “Value”, and What’s Working on Instagram in 2017.",
            "datePublished": "Mon, 06 Nov 2017 07:59:00 +0000",
            "description": "Sitting on a rooftop deck in Brisbane Australia, Foundr Founder (I couldn’t resist) Nathan Chan and I sit down for a chat about listening to your customers, providing “value”, transitioning Foundr from digital to hard copy, and of course, what’s working RIGHT NOW to grow your Instagram account.  (btw…he has over a million followers on […]",
            "length": "48599671",
            "sourceUrl": "https://traffic.libsyn.com/solohour/644.mp3",
            "categories": [
                "Podcast"
            ]
        },
        {
            "title": "643: Ready for a Quickie? Free Coaching Friday in 15 minutes.",
            "datePublished": "Sat, 04 Nov 2017 00:24:05 +0000",
            "description": "Free Coaching Friday from The Solopreneur Hour! If you’re new and don’t know how this works here goes: once a week I ask you to send me your questions and I answer them on Friday. If you want to be part of the fun for next week’s Q&A show join us in the Facebook group here or […]",
            "length": "12421849",
            "sourceUrl": "https://traffic.libsyn.com/solohour/643.mp3",
            "categories": [
                "Podcast"
            ]
        },
        {
            "title": "642: How To Transition to Your Dream Job, with Natalie Sisson",
            "datePublished": "Wed, 01 Nov 2017 06:57:59 +0000",
            "description": "Best of Episode: Natalie Sisson was the co-Founder of the successful startup Fundrazr when she packed it in, and packed up and decided to travel the world. That was over 3.5 years ago, and she’s still traveling!  She’s built a mega-successful online brand and has now been traveling (with no permanent home) teaching, podcasting, and […]",
            "length": "51566910",
            "sourceUrl": "https://traffic.libsyn.com/solohour/642.mp3",
            "categories": [
                "Podcast"
            ]
        },
        {
            "title": "641: James Schramko Will Help Your Business Grow…Super Fast",
            "datePublished": "Mon, 30 Oct 2017 07:11:25 +0000",
            "description": "I met James Schramko when we both spoke at Tropical Think Tank (Chris Ducker’s Event) in May of 2015.  James is a quiet dude, but has an almost childlike optimism about him.  He loves to surf, he loves his family, and he loves his time freedom.  Today we get to explore not only his journey […]",
            "length": "59645025",
            "sourceUrl": "https://traffic.libsyn.com/solohour/641.mp3",
            "categories": [
                "Podcast"
            ]
        },
        {
            "title": "640: Solopreneur Coaching – Researching a Podcast Niche, Looking Stylish, and Staying Focused",
            "datePublished": "Fri, 27 Oct 2017 20:22:30 +0000",
            "description": "Free Coaching Friday from The Solopreneur Hour! If you’re new and don’t know how this works here goes: once a week I ask you to send me your questions and I answer them on Friday. If you want to be part of the fun for next week’s Q&A show join us in the Facebook group here or […]",
            "length": "23471181",
            "sourceUrl": "https://traffic.libsyn.com/solohour/640.mp3",
            "categories": [
                "Podcast"
            ]
        },
        {
            "title": "639: Do What You’re GREAT at, with BMX Legend Eddie Fiola",
            "datePublished": "Wed, 25 Oct 2017 07:23:01 +0000",
            "description": "Today I had a chance to sit down in Temecula CA with “The King of The Skateparks” himself, Eddie Fiola.  BMX champion turned Hollywood Stuntman, Eddie took his talent for riding (and falling) to the big screen on such movies as The Hangover, Independence Day, The Italian Job, Indiana Jones, and more. In this episode, […]",
            "length": "64837597",
            "sourceUrl": "https://traffic.libsyn.com/solohour/639.mp3",
            "categories": [
                "Podcast"
            ]
        },
        {
            "title": "638: How To Badass Your Brand with Pia Silva",
            "datePublished": "Mon, 23 Oct 2017 05:40:32 +0000",
            "description": "Brooklyn native Pia Silva (https://worstofalldesign.com/) stops by the show today to talk about your brand…and how she loves it.  Her new book, Badass Your Brand: The Impatient Entrepreneur’s Guide to Turning Expertise into Profit helps us create a unique brand out of your unique skillsets (kinda like we do around these parts). We dig into all […]",
            "length": "40903098",
            "sourceUrl": "https://traffic.libsyn.com/solohour/638.mp3",
            "categories": [
                "Podcast"
            ]
        },
        {
            "title": "637: Meetups for Profit, How to Finish Courses & Books, Automation, and More…",
            "datePublished": "Fri, 20 Oct 2017 19:34:57 +0000",
            "description": "Free Coaching Friday from The Solopreneur Hour! If you’re new and don’t know how this works here goes: once a week I ask you to send me your questions and I answer them on Friday. If you want to be part of the fun for next week’s Q&A show join us in the Facebook group here or […]",
            "length": "30492044",
            "sourceUrl": "https://traffic.libsyn.com/solohour/637.mp3",
            "categories": [
                "Podcast"
            ]
        },
        {
            "title": "636: How to MAKE THINGS HAPPEN with Steve Sims",
            "datePublished": "Wed, 18 Oct 2017 06:35:07 +0000",
            "description": "When it comes to “making things happen“, Steve Sims is THE man! I met Steve a couple of years ago, and was fascinated by his story from a modest East London upbringing, to working his way up as a door guy in various Hong Kong clubs. That evolved into a high-end a concierge service for […]",
            "length": "40746256",
            "sourceUrl": "https://traffic.libsyn.com/solohour/636.mp3",
            "categories": [
                "Podcast"
            ]
        },
        {
            "title": "635: Josh Trent on The SINGLE Most Important Thing You Can Do For Your Health, PLUS Quantum Physics, Multiple Lives, and More",
            "datePublished": "Mon, 16 Oct 2017 07:00:49 +0000",
            "description": "Josh Trent of Wellness Force Radio (https://wellnessforce.com) stops by Studio 86 for an existential chat about quantum physics, multiple lives, the most important piece of your health, and a bunch more.  When I started The Solopreneur Hour, I sort of thought of it as the “Joe Rogan” show for entrepreneurs.  This show lives up to […]",
            "length": "50055508",
            "sourceUrl": "https://traffic.libsyn.com/solohour/635.mp3",
            "categories": [
                "Podcast"
            ]
        },
        {
            "title": "634: Free Coaching…Sunday!",
            "datePublished": "Mon, 16 Oct 2017 05:32:33 +0000",
            "description": "Free Coaching Friday from The Solopreneur Hour!  Or at least…that’s what it was supposed to be.  Due to a little snafu, I posted it on Sunday.  It’s ok…now you can binge! If you’re new and don’t know how this works here goes: once a week I ask you to send me your questions and I answer […]",
            "length": "5242880",
            "sourceUrl": "https://traffic.libsyn.com/solohour/634.mp3",
            "categories": [
                "Podcast"
            ]
        },
        {
            "title": "633: From Ugly Duckling to Beauty Queen to Serial Solopreneur, with Brittany Michalchuk",
            "datePublished": "Wed, 11 Oct 2017 07:29:54 +0000",
            "description": "Brittany Michalchuk grew up in an entrepreneurial family in Calgary Alberta.  She’s the founder of Bracelets For Humanity (https://bracelets4humanity.com), a serial entrepreneur, and is heavily focused on keeping a positive mindset.  She’s also about to star in Canada’s version of The Bachelor. On today’s show we chat about: Growing up in a really entrepreneurial house […]",
            "length": "46760695",
            "sourceUrl": "https://traffic.libsyn.com/solohour/633.mp3",
            "categories": [
                "Podcast"
            ]
        },
        {
            "title": "632: Identifying and Taking Advantage of Trends, with Joel Comm",
            "datePublished": "Mon, 09 Oct 2017 03:13:14 +0000",
            "description": "It’s one thing to put out content that you love that coordinates with an industry you want to be in…it’s another thing to correctly identify a trend, and apply your skillsets to it, and turn it into a smash hit.  But that’s exactly what Joel Comm has done over and over again.  Today, live from […]",
            "length": "54623698",
            "sourceUrl": "https://traffic.libsyn.com/solohour/632.mp3",
            "categories": [
                "Podcast"
            ]
        },
        {
            "title": "631: Your Wins, and Your Questions!!",
            "datePublished": "Sat, 07 Oct 2017 20:29:41 +0000",
            "description": "Today on Free coaching Saturday, I wanted to not only help you with your questions, but because of the awfulness of what happened in Vegas, I wanted to celebrate some wins as well.  It can’t be only questions…let’s celebrate you! If you’re new and don’t know how this works here goes: once a week I […]",
            "length": "22255588",
            "sourceUrl": "https://traffic.libsyn.com/solohour/631.mp3",
            "categories": [
                "Podcast"
            ]
        },
        {
            "title": "630: 7 Tips To Conference Better, Build Relationships, & Make More Money!",
            "datePublished": "Wed, 04 Oct 2017 19:15:26 +0000",
            "description": "What if every time you went to a conference or event, you made killer new connections with the speakers and influencers, established rapport with other like-minded people, and answered your businesses biggest questions and challenges? On today’s episode, I go through 7 tips to ensure you do just that. This is one of those blatant “actionable” shows…sorry […]",
            "length": "31092745",
            "sourceUrl": "https://traffic.libsyn.com/solohour/630.mp3",
            "categories": [
                "Podcast"
            ]
        },
        {
            "title": "629: Jennifer Paige – Behind The Scenes of a Mega Pop Star (Best Of)",
            "datePublished": "Mon, 02 Oct 2017 18:09:39 +0000",
            "description": "When you were a kid, did you ever sing-along to the radio and dream of being a pop star? I’m betting more than a few of us did! My guest, Jennifer Paige, was blessed enough to live out that fantasy. She talks about her pop star experiences and shares the wisdom she’s gained during her […]",
            "length": "71044055",
            "sourceUrl": "https://traffic.libsyn.com/solohour/629.mp3",
            "categories": [
                "Podcast"
            ]
        },
        {
            "title": "628: Public Speaking Tips, and Podcast Recording Without A Recorder (Free Coaching Friday!)",
            "datePublished": "Fri, 29 Sep 2017 16:24:37 +0000",
            "description": "Free Coaching Friday from The Solopreneur Hour! If you’re new and don’t know how this works here goes: once a week I ask you to send me your questions and I answer them on Friday. If you want to be part of the fun for next week’s Q&A show join us in the Facebook group here or […]",
            "length": "18279877",
            "sourceUrl": "https://traffic.libsyn.com/solohour/628.mp3",
            "categories": [
                "Podcast"
            ]
        },
        {
            "title": "627: Healthy Things You Should Have In Your Fridge, with Vinnie Tortorich",
            "datePublished": "Wed, 27 Sep 2017 19:48:28 +0000",
            "description": "Returning for his second visit with The Solopreneur Hour, is Vinnie Tortorich. Dubbed The World’s Angriest Trainer, Vinnie has come back to share his battle and triumph over leukemia, as well as why the world is getting fatter despite our overabundance of healthy supermarkets, gyms and organic foods. Join us as we have banter about […]",
            "length": "88387917",
            "sourceUrl": "https://traffic.libsyn.com/solohour/627.mp3",
            "categories": [
                "Podcast"
            ]
        },
        {
            "title": "626: Dana Malstaff on Coaching, Sales Funnels, and How To Structure Your Online Course",
            "datePublished": "Mon, 25 Sep 2017 06:24:48 +0000",
            "description": "Dana Malstaff is the CEO and Founder of Boss Mom. (https://boss-mom.com) She is a mother, author, business strategist, podcaster, blind spot reducer, and movement maker. She is the author of Boss Mom: The Ultimate Guide to Raising a Business & Nurturing Your Family Like a Pro. Dana sits down for a one-on-one interview during the […]",
            "length": "72256536",
            "sourceUrl": "https://traffic.libsyn.com/solohour/626.mp3",
            "categories": [
                "Podcast"
            ]
        },
        {
            "title": "625: Influencer Marketing Strategy, Conferencing Techniques, and More…",
            "datePublished": "Fri, 22 Sep 2017 17:14:03 +0000",
            "description": "Free Coaching Friday from The Solopreneur Hour! If you’re new and don’t know how this works here goes: once a week I ask you to send me your questions and I answer them on Friday. If you want to be part of the fun for next week’s Q&A show join us in the Facebook group here or […]",
            "length": "24017101",
            "sourceUrl": "https://traffic.libsyn.com/solohour/625.mp3",
            "categories": [
                "Podcast"
            ]
        },
        {
            "title": "624: Love Over Metrics – How To Grow A Community And Your Business by CARING, with Jadah Sellner",
            "datePublished": "Wed, 20 Sep 2017 07:24:49 +0000",
            "description": "I finally got a chance to catch up with Jadah Sellner on today’s show.  Jadah and her partner Jen saw huge success with the launch and growth of Simple Green Smoothies, writing a bestselling book and garnering hundreds of thousands of followers on Instagram and Facebook. On today’s episode, we share how to use challenges to grow your business […]",
            "length": "49844542",
            "sourceUrl": "https://traffic.libsyn.com/solohour/624.mp3",
            "categories": [
                "Podcast"
            ]
        },
        {
            "title": "623: Find Your Greatness and Optimize Your Instagram with Mike Sherbakov",
            "datePublished": "Mon, 18 Sep 2017 07:31:27 +0000",
            "description": "My buddy Mike Sherbakov with The Greatness Foundation stopped by to talk about helping people build “on purpose businesses” and what the Greatness Foundation is up to.  Then we dig into a tutorial/background on Cryptocurrency and why we’re so excited about it.  Finally, Mike shares how to optimize your Instagram Account for more engagement and followers! […]",
            "length": "72522850",
            "sourceUrl": "https://traffic.libsyn.com/solohour/623.mp3",
            "categories": [
                "Podcast"
            ]
        },
        {
            "title": "622: How I Focus with A.D.D., and Your Questions!",
            "datePublished": "Fri, 15 Sep 2017 19:11:11 +0000",
            "description": "Free Coaching Friday from The Solopreneur Hour! If you’re new and don’t know how this works here goes: once a week I ask you to send me your questions and I answer them on Friday. If you want to be part of the fun for next week’s Q&A show join us in the Facebook group here or […]",
            "length": "21333277",
            "sourceUrl": "https://traffic.libsyn.com/solohour/622.mp3",
            "categories": [
                "Podcast"
            ]
        },
        {
            "title": "621: Hacking The Entrepreneur, with Jonny Nastor (Best of)",
            "datePublished": "Wed, 13 Sep 2017 22:33:30 +0000",
            "description": "As a solopreneur you’re probably a fan of podcasts. If that’s the case you’re aware of the avalanche of entrepreneurial-based inspirational shows that have launched in the last 6 months of 2014. One of the most notable is Hack the Entrepreneur with John “call me Jonny” Nastor. His show has been ranked consistently at #1 […]",
            "length": "59166916",
            "sourceUrl": "https://traffic.libsyn.com/solohour/621.mp3",
            "categories": [
                "Podcast"
            ]
        },
        {
            "title": "620: Creating Your Own “Agency” & Traveling The World with Hannah Wiley",
            "datePublished": "Tue, 12 Sep 2017 00:05:09 +0000",
            "description": "For years I ran a digital agency from my laptop.  I’d sign on a new client, give them a proposal, then outsource 90% of the work.  The job got done faster, and I was able to handle more clients.  It was a great system! On today’s show, internet marketer extraordinaire Hannah Wiley shows us how […]",
            "length": "55985938",
            "sourceUrl": "https://traffic.libsyn.com/solohour/620.mp3",
            "categories": [
                "Podcast"
            ]
        },
        {
            "title": "BONUS EPISODE! 2017 Internet Marketing Fantasy Draft!",
            "datePublished": "Fri, 08 Sep 2017 23:32:08 +0000",
            "description": "It’s Fantasy Football season for those afflicted, nerdy souls, where we yell at the TV to cheer on players that aren’t even on the team we root for. But…we wouldn’t have it any other way! There is, however, a twist to this ultimate fantasy draft. In this case, we are drafting the top internet marketers […]",
            "length": "34978641",
            "sourceUrl": "https://traffic.libsyn.com/solohour/618_bonus.mp3",
            "categories": [
                "Podcast"
            ]
        },
        {
            "title": "619: Cloning One’s Self, FB Group to Email List Tips, and More!",
            "datePublished": "Fri, 08 Sep 2017 20:25:20 +0000",
            "description": "Free Coaching Friday from The Solopreneur Hour! If you’re new and don’t know how this works here goes: once a week I ask you to send me your questions and I answer them on Friday. If you want to be part of the fun for next week’s Q&A show join us in the Facebook group here or […]",
            "length": "17577430",
            "sourceUrl": "https://traffic.libsyn.com/solohour/619.mp3",
            "categories": [
                "Podcast"
            ]
        },
        {
            "title": "618: Talking Social Media with Brian Fanzo",
            "datePublished": "Wed, 06 Sep 2017 08:15:31 +0000",
            "description": "On this epic episode (Almost 2 hours!) of The Solopreneur Hour, online influencer, fellow Steelers fan, and all around good egg Brian Fanzo and I catch up and talk all things social media, then get into the meat and potatoes of the show: It’s Fantasy Football season for those afflicted, nerdy souls, where we yell […]",
            "length": "84679783",
            "sourceUrl": "https://traffic.libsyn.com/solohour/618.mp3",
            "categories": [
                "Podcast"
            ]
        },
        {
            "title": "617: Solopreneur Q&A – Free Coaching Friday!",
            "datePublished": "Fri, 01 Sep 2017 16:00:18 +0000",
            "description": "Free Coaching Friday from The Solopreneur Hour! If you’re new and don’t know how this works here goes: once a week I ask you to send me your questions and I answer them on Friday. If you want to be part of the fun for next week’s Q&A show join us in the Facebook group here or […]",
            "length": "30240980",
            "sourceUrl": "https://traffic.libsyn.com/solohour/617.mp3",
            "categories": [
                "Podcast"
            ]
        },
        {
            "title": "616: How to Travel The World And Be A Digital Nomad, with Natalie Sisson",
            "datePublished": "Wed, 30 Aug 2017 07:40:40 +0000",
            "description": "On today’s show we catch up with the one and only Natalie Sisson. It’s been many years since we got to talk, and now the suitcase entrepreneur has settled down and bought two houses in two different countries! If you are one of those people that always says “I want to travel the world” when […]",
            "length": "54460813",
            "sourceUrl": "https://traffic.libsyn.com/solohour/616.mp3",
            "categories": [
                "Podcast"
            ]
        },
        {
            "title": "615: Tipsy Business Episode 1, with Matthew Kimberley",
            "datePublished": "Mon, 28 Aug 2017 07:09:07 +0000",
            "description": "Today’s is a special show.  It’s a preview, if you will, of the Tipsy Business podcast with myself and master salesman Matthew Kimberley.  He’s a sales ninja, and has the best voice in podcasting.  Join us for episode 1 of a possible podcast about the world of internet marketing, sales, and whatever else we’d like […]",
            "length": "39761087",
            "sourceUrl": "https://traffic.libsyn.com/solohour/615.mp3",
            "categories": [
                "Podcast"
            ]
        },
        {
            "title": "614: Answering YOUR Questions on Free Coaching Friday!",
            "datePublished": "Fri, 25 Aug 2017 16:18:05 +0000",
            "description": "Free Coaching Friday from The Solopreneur Hour! If you’re new and don’t know how this works here goes: once a week I ask you to send me your questions and I answer them on Friday. If you want to be part of the fun for next week’s Q&A show join us in the Facebook group here or […]",
            "length": "32532763",
            "sourceUrl": "https://traffic.libsyn.com/solohour/614.mp3",
            "categories": [
                "Podcast"
            ]
        },
        {
            "title": "613: How to Become Profitably Unemployable – The Epic 4-Year Anniversary Show!",
            "datePublished": "Wed, 23 Aug 2017 20:07:14 +0000",
            "description": "On today’s show, celebrating 4 years of The Solopreneur Hour since we launched August 23, 2013, I break down step-by-step how to become Profitably Unemployable™.   This is a pretty epic show, if I do say so myself. I’d love to hear back from you about this (and any other) episodes: Twitter: https://twitter.com/solohour Instagram: https://instagram.com/solohour […]",
            "length": "52410462",
            "sourceUrl": "https://traffic.libsyn.com/solohour/613.mp3",
            "categories": [
                "Podcast"
            ]
        },
        {
            "title": "612: How to Create a Six-Figure Side Gig, with Dr. Mark Costes (best of)",
            "datePublished": "Tue, 22 Aug 2017 21:33:05 +0000",
            "description": "As solopreneurs making the transition from doing what we know to teaching and sharing our knowledge is typically the difference between burnout and bliss. To start that transition we often create a side gig. The man who has made multiple six figures doing just that: taking side gigs and turning them into multiple streams of […]",
            "length": "59244584",
            "sourceUrl": "https://traffic.libsyn.com/solohour/612.mp3",
            "categories": [
                "Podcast"
            ]
        },
        {
            "title": "611: Fighting a “Lack” Mentality, The Sexy Seven, and More…",
            "datePublished": "Sat, 19 Aug 2017 18:11:57 +0000",
            "description": "Free Coaching Saturday from The Solopreneur Hour! If you’re new and don’t know how this works here goes: once a week I ask you to send me your questions and I answer them on Friday. If you want to be part of the fun for next week’s Q&A show join us in the Facebook group here or […]",
            "length": "24150057",
            "sourceUrl": "https://traffic.libsyn.com/solohour/611.mp3",
            "categories": [
                "Podcast"
            ]
        },
        {
            "title": "610: Building Relationships with Influencers, w/ John Corcoran (best of)",
            "datePublished": "Wed, 16 Aug 2017 17:40:10 +0000",
            "description": "For today’s best of episode, we’ve got an actionable doozy with John Corcoran.  As I’m at an event in Monterey, I’m reminded of how important relationship-building is in life.  This is a GREAT episode to sharpen your relationship chops. If you’ve been around the planet for a while, you know that relationships are the true […]",
            "length": "68357630",
            "sourceUrl": "https://traffic.libsyn.com/solohour/610.mp3",
            "categories": [
                "Podcast"
            ]
        },
        {
            "title": "609: A Great Email Hack, Playing With BitCoin, and Free Coaching Monday",
            "datePublished": "Mon, 14 Aug 2017 07:34:20 +0000",
            "description": "Hola. Back from Vegas, sore ankle and all.  Today’s episode is a short, but fun Free Coaching Monday.  I begin by telling you a great email hack you can use for multiple mailing lists, or to test out your landing pages.  Then, I dig a bit into BitCoin and CryptoCurrency by introducing you to CoinBase. […]",
            "length": "23459605",
            "sourceUrl": "https://traffic.libsyn.com/solohour/609.mp3",
            "categories": [
                "Podcast"
            ]
        },
        {
            "title": "608: Repurposing Your Skills into New Ventures, with John Spencer Ellis (And a Special Announcement!)",
            "datePublished": "Wed, 09 Aug 2017 06:59:34 +0000",
            "description": "Today’s returning champion is John Spencer Ellis. (https://johnspencerellis.com) John’s an icon in the fitness industry, and after his fitness success has made millions in various ventures, including real estate, SEO, mindset/cognitive development, entrepreneur coaching, and more.  On today’s show we talk about how to “port” your skillset to different industries, and lay the groundwork for […]",
            "length": "52273745",
            "sourceUrl": "https://traffic.libsyn.com/solohour/608.mp3",
            "categories": [
                "Podcast"
            ]
        },
        {
            "title": "607: Solopreneur Style Revisited, and How To Map Your Goals with JJ Collier",
            "datePublished": "Mon, 07 Aug 2017 05:35:37 +0000",
            "description": "Our good pal JJ Collier joins us again to talk men’s style, the state of the relationship between brands and buyers, how he concepts his new lines (and how it looks a lot like what we do on a vision board) and how he mindmaps his goals.  Personally, I don’t know a more meticulous planner, […]",
            "length": "60160405",
            "sourceUrl": "https://traffic.libsyn.com/solohour/607.mp3",
            "categories": [
                "Podcast"
            ]
        },
        {
            "title": "606: A KILLER Advertising Deal, How I set It Up, and Your Questions",
            "datePublished": "Fri, 04 Aug 2017 23:08:05 +0000",
            "description": "Free Coaching Saturday from The Solopreneur Hour! EXPERIMENT: it dawned on me today that most people that really want to get their name out there and advertise their business probably can’t afford to do it on a big podcast. Advertising on my show costs over $2500 per month. My idea behind the show has always been […]",
            "length": "32375236",
            "sourceUrl": "https://traffic.libsyn.com/solohour/606.mp3",
            "categories": [
                "Podcast"
            ]
        },
        {
            "title": "605: Bill Allen (Cru Jones) from the Movie RAD Talks Acting, Hollywood, and Hustle",
            "datePublished": "Wed, 02 Aug 2017 10:59:57 +0000",
            "description": "If you’re a dude in his 40’s, chances are, you probably rode a BMX bike as a kid.  Back in the 80’s, BMX and freestyle weren’t nearly as ubiquitous as they are today in 2017.  Getting big “media coverage” was a big deal.  The fact that they made a major motion picture about BMX in […]",
            "length": "54458428",
            "sourceUrl": "https://traffic.libsyn.com/solohour/605.mp3",
            "categories": [
                "Podcast"
            ]
        },
        {
            "title": "604: Why RIGHT NOW is The Best Time, with Brett Campbell (Encore)",
            "datePublished": "Mon, 31 Jul 2017 19:15:34 +0000",
            "description": "Sometimes it takes a traumatic experience or a poignant life lesson to get us to pivot and shift gears in our life.  Such was the case for returning guest Brett Campbell, who tells a sad story about losing a friend that really shifted his perspective on life and success.  Brett joins us with new insights, […]",
            "length": "59215707",
            "sourceUrl": "https://traffic.libsyn.com/solohour/604.mp3",
            "categories": [
                "Podcast"
            ]
        },
        {
            "title": "603: What I Learned In My Mastermind, A Potty Mouthed “Episode Zero” Rant, and More of your Questions…",
            "datePublished": "Sat, 29 Jul 2017 20:17:05 +0000",
            "description": "Free Coaching Saturday from The Solopreneur Hour! If you’re new and don’t know how this works here goes: once a week I ask you to send me your questions and I answer them on Friday. If you want to be part of the fun for next week’s Q&A show join us in the Facebook group here or […]",
            "length": "35103125",
            "sourceUrl": "https://traffic.libsyn.com/solohour/603.mp3",
            "categories": [
                "Podcast"
            ]
        },
        {
            "title": "602: Joel Comm on What To Do When Everything Goes Right!",
            "datePublished": "Wed, 26 Jul 2017 08:09:44 +0000",
            "description": "There are a lot of shows and blogs dedicated to teaching you how to get over the mindset when everything goes wrong and your launch fails. But, what do you do when everything goes right? From idea to implementation, Joel Comm’s new podcast has taken only two weeks. But, all indications point towards it being […]",
            "length": "50708551",
            "sourceUrl": "https://traffic.libsyn.com/solohour/602.mp3",
            "categories": [
                "Podcast"
            ]
        },
        {
            "title": "601: Mike Sherbakov Inspires Greatness From All Of Us.",
            "datePublished": "Mon, 24 Jul 2017 09:49:51 +0000",
            "description": "Today on Patio 86 I got a chance to chat with a good buddy of mine who’s focused his life’s work on making a huge impact in the world. The Greatness Foundation (https://greatness.ngo) is a platform for altruistic game-changers worldwide.  Whether it’s building homes in Mexico, assisting refugees in Greece, opening schools in Nicauragua, or […]",
            "length": "62465855",
            "sourceUrl": "https://traffic.libsyn.com/solohour/601.mp3",
            "categories": [
                "Podcast"
            ]
        },
        {
            "title": "600: Instagram Marketing Basics, How to Learn ANY New Skill, and More!",
            "datePublished": "Fri, 21 Jul 2017 20:19:35 +0000",
            "description": "Free Coaching Friday from The Solopreneur Hour! If you’re new and don’t know how this works here goes: once a week I ask you to send me your questions and I answer them on Friday. If you want to be part of the fun for next week’s Q&A show join us in the Facebook group here or […]",
            "length": "42472560",
            "sourceUrl": "https://traffic.libsyn.com/solohour/600.mp3",
            "categories": [
                "Podcast"
            ]
        },
        {
            "title": "599: Comedian John Heffron Can Remote Control You From The Stage. Kind of.",
            "datePublished": "Wed, 19 Jul 2017 09:21:56 +0000",
            "description": "Every once in a while, I’m lucky enough to have a guest on the show that truly brings out the essence of what I think this show is all about. It’s about deep dive conversations with people in all walks of life. In this case, A standup comedian named John Heffron.  John’s had an amazing […]",
            "length": "54538273",
            "sourceUrl": "https://traffic.libsyn.com/solohour/599.mp3",
            "categories": [
                "Podcast"
            ]
        },
        {
            "title": "598: Solving Your Money Problems with Jordan Goodman (Part 2!)",
            "datePublished": "Mon, 17 Jul 2017 08:08:25 +0000",
            "description": "Today we chat with Jordan Goodman once again, by popular demand (See episode 590) and talk about how to solve all of your money problems.  This episode is once again packed with resources, so get your Evernote ready to rock for this one! Some of the stuff we talked about: How to establish credit. Where to register […]",
            "length": "52827608",
            "sourceUrl": "https://traffic.libsyn.com/solohour/598.mp3",
            "categories": [
                "Podcast"
            ]
        },
        {
            "title": "597: How To Launch Just About Anything, and Your Questions…",
            "datePublished": "Mon, 17 Jul 2017 01:54:06 +0000",
            "description": "In today’s Free Coaching Saturday, I reiterate the launch process, and how you can have success with your first solopreneur biz.  Then I answer a few of your questions before wrapping up!",
            "length": "32365178",
            "sourceUrl": "https://traffic.libsyn.com/solohour/597.mp3",
            "categories": [
                "Podcast"
            ]
        },
        {
            "title": "596: Building a YouTube Channel from Scratch with Jeff Miklem (Home Built By Jeff)",
            "datePublished": "Wed, 12 Jul 2017 06:41:32 +0000",
            "description": "If you’ve ever thought about starting a YouTube Channel, this is the show for you.  In fact, the content of this show applies whether you’re starting a YouTube Channel, livestreaming, podcasting, blogging, or anything else related to creating your own content. Jeff Micklem (https://youtube.com/homebuiltbyjeff) is a firefighter by trade…vintage Porsche fixer-upper in his spare time. […]",
            "length": "60783576",
            "sourceUrl": "https://traffic.libsyn.com/solohour/596.mp3",
            "categories": [
                "Podcast"
            ]
        },
        {
            "title": "595: Setbacks and Success with Chris Farrell, LIVE from a Car in LA!",
            "datePublished": "Mon, 10 Jul 2017 07:52:11 +0000",
            "description": "Chris Farrell is a former radio/TV presenter turned Lifestyle Entrepreneur. Chris is also one of the most respected and successful internet marketers in the industry today. Chris’s training products and websites have already helped tens of thousands of people create and grow their online business. Chris is a popular in demand public speaker – having worked with and […]",
            "length": "48839792",
            "sourceUrl": "https://traffic.libsyn.com/solohour/595.mp3",
            "categories": [
                "Podcast"
            ]
        },
        {
            "title": "594: Dealing With Haters, Being Productive on The Road, Ad Reading Basics, and More…",
            "datePublished": "Fri, 07 Jul 2017 22:41:08 +0000",
            "description": "Free Coaching Friday from The Solopreneur Hour! If you’re new and don’t know how this works here goes: once a week I ask you to send me your questions and I answer them on Friday. If you want to be part of the fun for next week’s Q&A show join us in the Facebook group here or […]",
            "length": "37814297",
            "sourceUrl": "https://traffic.libsyn.com/solohour/594.mp3",
            "categories": [
                "Podcast"
            ]
        },
        {
            "title": "593: Tim Sanders Shares The Secret to Long-Term Success…and it’s KILLER.",
            "datePublished": "Wed, 05 Jul 2017 06:22:08 +0000",
            "description": "Tim Sanders (“Love Is The Killer App“) stops by to chat about music, entrepreneurship, and the secret sauce to building relationships and opening doors for yourself. Stop by his website for some free swag just for Solopreneur Hour listeners: https://timsanders.com/solopreneur @sanderssays",
            "length": "56502749",
            "sourceUrl": "https://traffic.libsyn.com/solohour/593.mp3",
            "categories": [
                "Podcast"
            ]
        },
        {
            "title": "592: How To Get Paid to Travel with Mia Voss, Live from Social Media Day Denver!",
            "datePublished": "Sun, 02 Jul 2017 19:37:25 +0000",
            "description": "In person at the Renaissance Hotel in downtown Denver, I sat down 1 on 1 with travel blogger Mia Voss to learn how she got started, how we can start travel blogging, how to establish relationships with larger entities (hint: share a lot of their content on your social media), and how important the connection […]",
            "length": "31455766",
            "sourceUrl": "https://traffic.libsyn.com/solohour/592.mp3",
            "categories": [
                "Podcast"
            ]
        },
        {
            "title": "591: Brian Scrone Made Millions. Then Lost It All.  Then Made it Again.  Then He Learned What Matters Most.",
            "datePublished": "Wed, 28 Jun 2017 07:22:02 +0000",
            "description": "Today we’re joined by author, and baller real estate investor Brian Scrone, to talk about his new book “What Matters Most – Finding Your Focus with the 5F’s” This was an interesting episode…I had a thought that it would go one way, and it went completely another way. After making a boatload of money in […]",
            "length": "61824954",
            "sourceUrl": "https://traffic.libsyn.com/solohour/591.mp3",
            "categories": [
                "Podcast"
            ]
        },
        {
            "title": "590: Mastering Your Finances Once And For All, with Jordan Goodman (part 1)",
            "datePublished": "Mon, 26 Jun 2017 07:27:12 +0000",
            "description": "No matter what level of your solopreneur success, managing your finances needs to be high on your priority list.  Now, I was never properly trained in the world of finance, so everything has been “learn as I go”.  This episode was ABSOLUTELY eye-opening.  So eye-opening, in fact, that I’m going to have Jordan on for […]",
            "length": "61912590",
            "sourceUrl": "https://traffic.libsyn.com/solohour/590.mp3",
            "categories": [
                "Podcast"
            ]
        },
        {
            "title": "589: Free Coaching Friday! Connecting with Influencers, Getting Local Business and more…",
            "datePublished": "Fri, 23 Jun 2017 20:15:32 +0000",
            "description": "Free Coaching Friday from The Solopreneur Hour! If you’re new and don’t know how this works here goes: once a week I ask you to send me your questions and I answer them on Friday. If you want to be part of the fun for next week’s Q&A show join us in the Facebook group here or […]",
            "length": "35740436",
            "sourceUrl": "https://traffic.libsyn.com/solohour/589.mp3",
            "categories": [
                "Podcast"
            ]
        },
        {
            "title": "588: Talking Hollywood and Hustle with Anna Vocino",
            "datePublished": "Fri, 23 Jun 2017 20:07:52 +0000",
            "description": "The lovely and talented Anna Vocino (Eat Happy, available on Amazon) stops by to chat Hollywood Hustle, her new project with her hubby, her awesome cookbook, comedy, and a lot more. Anna’s Bio: I make my living as an actor. I like hiking, books, vodka, and going to Italy, and I love my husband, daughter, […]",
            "length": "39888715",
            "sourceUrl": "https://traffic.libsyn.com/solohour/588.mp3",
            "categories": [
                "Podcast"
            ]
        },
        {
            "title": "587: Where You Start Isn’t Where You Have To Finish…and More. (Free Coaching Friday)",
            "datePublished": "Fri, 16 Jun 2017 18:58:57 +0000",
            "description": "Free Coaching Friday from The Solopreneur Hour! If you’re new and don’t know how this works here goes: once a week I ask you to send me your questions and I answer them on Friday. If you want to be part of the fun for next week’s Q&A show join us in the Facebook group here or […]",
            "length": "34380287",
            "sourceUrl": "https://traffic.libsyn.com/solohour/587.mp3",
            "categories": [
                "Podcast"
            ]
        },
        {
            "title": "586: Leadership, Health, and Taking Big Leaps for Big Results with Bryon Jaymes",
            "datePublished": "Wed, 14 Jun 2017 09:22:45 +0000",
            "description": "Today my buddy Bryon Jaymes and I get to sit down and talk about leadership by example, how to build a great team by creating relationships versus sales, and taking big leaps of faith for big results in your journey.",
            "length": "60448398",
            "sourceUrl": "https://traffic.libsyn.com/solohour/586.mp3",
            "categories": [
                "Podcast"
            ]
        },
        {
            "title": "585: Following Your Passion To Get Paid For What You Love, with Matt Farah",
            "datePublished": "Mon, 12 Jun 2017 06:13:54 +0000",
            "description": "Sometimes we know from a very early age what our true solopreneurial passions are. That was the case for today’s guest, Matt Farah of The Smoking Tire. On episode 585 (Best of) of The Solopreneur Hour Matt talks with us about his very early love of cars, and how he parlayed that into a successful […]",
            "length": "63958263",
            "sourceUrl": "https://traffic.libsyn.com/solohour/585.mp3",
            "categories": [
                "Podcast"
            ]
        },
        {
            "title": "584: Personal Branding, SEO Tips, How Long ’til You Find Your Voice (Free Coaching Saturday)",
            "datePublished": "Sat, 10 Jun 2017 16:04:15 +0000",
            "description": "Free Coaching Friday  SATURDAY from The Solopreneur Hour! If you’re new and don’t know how this works here goes: once a week I ask you to send me your questions and I answer them on Friday. If you want to be part of the fun for next week’s Q&A show join us in the Facebook […]",
            "length": "19038954",
            "sourceUrl": "https://traffic.libsyn.com/solohour/584.mp3",
            "categories": [
                "Podcast"
            ]
        },
        {
            "title": "583: Talking Social Media Day Denver, and Live Streaming Tips with Joel Comm",
            "datePublished": "Wed, 07 Jun 2017 06:40:31 +0000",
            "description": "Returning Champion Joel Comm discusses Social Media Day Denver (Get your discounted ticket by using promo code “solohour” here) and how it can impact your business.  Plus, I’m speaking there, so you should join us.  We also talk about the “hot hand” in Social Media right now, and dig into some livestreaming tips!  ",
            "length": "46358776",
            "sourceUrl": "https://traffic.libsyn.com/solohour/583.mp3",
            "categories": [
                "Podcast"
            ]
        },
        {
            "title": "582: 3 Steps to a GREAT Online Business with Chris Farrell",
            "datePublished": "Mon, 05 Jun 2017 20:12:51 +0000",
            "description": "As a solopreneur we all start somewhere. Sometimes we start with a topic we know a lot about, sometimes we see an opening and we go for it, learning along the way. Our guest for today saw an opening to serve his audience in a simpler, more effective way than email: a membership site. Chris […]",
            "length": "70121023",
            "sourceUrl": "https://traffic.libsyn.com/solohour/582.mp3",
            "categories": [
                "Podcast"
            ]
        },
        {
            "title": "581: Saying “Yes”, How To Get In Front Of People, Scaling Your Service Biz (Free Coaching Friday!)",
            "datePublished": "Fri, 02 Jun 2017 15:37:00 +0000",
            "description": "Free Coaching Friday from The Solopreneur Hour! If you’re new and don’t know how this works here goes: once a week I ask you to send me your questions and I answer them on Friday. If you want to be part of the fun for next week’s Q&A show join us in the Facebook group here or […]",
            "length": "20099110",
            "sourceUrl": "https://traffic.libsyn.com/solohour/581.mp3",
            "categories": [
                "Podcast"
            ]
        },
        {
            "title": "580: Jordan Harbinger Interviews Michael O’Neal on The Art of Charm",
            "datePublished": "Fri, 02 Jun 2017 02:23:54 +0000",
            "description": "This is a special episode where returning champion Michael O’Neal was interviewed on The Art of Charm Podcast.  I thought it was a great representation of my story, and that Jordan did a stellar job interviewing me.  So, here’s the Solopreneur Hour with Michael O’Neal, starring Michael O’Neal.  And Jordan Harbinger.  Listen to The Art of […]",
            "length": "50468106",
            "sourceUrl": "https://traffic.libsyn.com/solohour/580.mp3",
            "categories": [
                "Podcast"
            ]
        },
        {
            "title": "579: Tyler Anderson From Social Media Day SD Talks Social Media",
            "datePublished": "Tue, 30 May 2017 06:47:14 +0000",
            "description": "My boy Tyler Anderson (https://casualfridays.com) was nice enough to have me into his office for a great chat about social media, Social Media Day San Diego, some Instagram hacks, and a ton more!",
            "length": "60232500",
            "sourceUrl": "https://traffic.libsyn.com/solohour/579.mp3",
            "categories": [
                "Podcast"
            ]
        },
        {
            "title": "578: The Sexy Seven, Live Recording Setup, and More on Free Coaching Friday! (Entrepreneur Coaching)",
            "datePublished": "Fri, 26 May 2017 20:09:33 +0000",
            "description": "Free Coaching Friday from The Solopreneur Hour! If you’re new and don’t know how this works here goes: once a week I ask you to send me your questions and I answer them on Friday. If you want to be part of the fun for next week’s Q&A show join us in the Facebook group here or […]",
            "length": "32872482",
            "sourceUrl": "https://traffic.libsyn.com/solohour/578.mp3",
            "categories": [
                "Podcast"
            ]
        },
        {
            "title": "577: John Buultjens Faced Insurmountable Odds…And Now Lives His Dream Life",
            "datePublished": "Thu, 25 May 2017 08:04:29 +0000",
            "description": "“BMX Saved My Life” – John Buultjens Today show is about incredible resilience in the face of insurmountable odds. John Buultjens is the brand manager for Haro bicycles… A dream job for him considering his background. From an abused kid in Scotland, to living on the street as a homeless 5 year old, to now […]",
            "length": "50601549",
            "sourceUrl": "https://traffic.libsyn.com/solohour/577.mp3",
            "categories": [
                "Podcast"
            ]
        },
        {
            "title": "576: Stage Speaking Tips, Creating Your Brand, and More…",
            "datePublished": "Mon, 22 May 2017 17:51:05 +0000",
            "description": "Free Coaching MONDAY from The Solopreneur Hour! If you’re new and don’t know how this works here goes: once a week I ask you to send me your questions and I answer them on Friday. If you want to be part of the fun for next week’s Q&A show join us in the Facebook group here or […]",
            "length": "31996323",
            "sourceUrl": "https://traffic.libsyn.com/solohour/576.mp3",
            "categories": [
                "Podcast"
            ]
        },
        {
            "title": "575: Meeting A Legend, Smashing it on Social Media, and More…",
            "datePublished": "Fri, 19 May 2017 18:58:16 +0000",
            "description": "Free Coaching Friday from The Solopreneur Hour! If you’re new and don’t know how this works here goes: once a week I ask you to send me your questions and I answer them on Friday. If you want to be part of the fun for next week’s Q&A show join us in the Facebook group […]",
            "length": "40774277",
            "sourceUrl": "https://traffic.libsyn.com/solohour/575.mp3",
            "categories": [
                "Podcast"
            ]
        },
        {
            "title": "574: How To Give Your Audience EXACTLY What They Want, with Ryan Levesque",
            "datePublished": "Wed, 17 May 2017 17:38:31 +0000",
            "description": "The author of the bestselling book “ASK” is on The Solopreneur Hour. One of the most important aspects of any solopreneur’s business is connecting with their audience. Here to share the neuroscience secrets to doing so is Ryan Levesque. Ryan is a former neuroscience instructor at Brown University, and has used his innate knowledge of psychology […]",
            "length": "52147761",
            "sourceUrl": "https://traffic.libsyn.com/solohour/574.mp3",
            "categories": [
                "Podcast"
            ]
        },
        {
            "title": "573: Twitter Automation Hacks with Tim Fargo",
            "datePublished": "Mon, 15 May 2017 17:22:53 +0000",
            "description": "Are you ascared of Twitter? You shant be anymore. Private investigator turned Twitter automation guru Tim Fargo joins us on the show today. We chat about his history as a private investigator, and managing a team of a few hundred people, exiting that company with Millions, and creating a really useful Twitter automation tool. Social […]",
            "length": "5242880",
            "sourceUrl": "https://traffic.libsyn.com/solohour/573.mp3",
            "categories": [
                "Podcast"
            ]
        },
        {
            "title": "572: How To Plan For Your Next Move, and More Free Coaching Friday Questions!",
            "datePublished": "Fri, 12 May 2017 20:13:17 +0000",
            "description": "Free Coaching Friday from The Solopreneur Hour! If you’re new and don’t know how this works here goes: once a week I ask you to send me your questions and I answer them on Friday. If you want to be part of the fun for next week’s Q&A show join us in the Facebook group […]",
            "length": "20639029",
            "sourceUrl": "https://traffic.libsyn.com/solohour/572.mp3",
            "categories": [
                "Podcast"
            ]
        },
        {
            "title": "571: Talking Clients from Hell with Bryce Bladon",
            "datePublished": "Wed, 10 May 2017 04:41:46 +0000",
            "description": "Today Bryce Bladon from Clients from Hell stops by to talk about…clients from hell.  Also, how to protect yourself as a freelancer, how to be a good client, what to do if you decide to stop working with a client, and much more. Get 50% off your entire web hosting program by using the promo code “solo50” at […]",
            "length": "47958035",
            "sourceUrl": "https://traffic.libsyn.com/solohour/571.mp3",
            "categories": [
                "Podcast"
            ]
        },
        {
            "title": "570: How to Grow Your YouTube Audience & Beginner SEO Hacks, with Brian Dean",
            "datePublished": "Mon, 08 May 2017 17:18:33 +0000",
            "description": "Brian Dean from Backlinko.com joins us today to talk about his journey from black hat SEO to white hat SEO, a great infographic guest post strategy, beginner SEO strategies and tips, and how to get more views and grow your YouTube channel.   SEM Rush #1 tool for SEO.  Get 50% off your entire web hosting […]",
            "length": "46264371",
            "sourceUrl": "https://traffic.libsyn.com/solohour/570.mp3",
            "categories": [
                "Podcast"
            ]
        },
        {
            "title": "569: Adapting When Things Don’t Go As Planned, Lessons Learned From My Car, and More…",
            "datePublished": "Fri, 05 May 2017 18:00:12 +0000",
            "description": "Free Coaching Friday from The Solopreneur Hour! If you’re new and don’t know how this works here goes: once a week I ask you to send me your questions and I answer them on Friday. If you want to be part of the fun for next week’s Q&A show join us in the Facebook group […]",
            "length": "24021833",
            "sourceUrl": "https://traffic.libsyn.com/solohour/569.mp3",
            "categories": [
                "Podcast"
            ]
        },
        {
            "title": "568: Steve Sims Will Make Your Dreams Come True",
            "datePublished": "Wed, 03 May 2017 06:21:04 +0000",
            "description": "Back on the show once again is America’s angriest teddy bear, Steve Sims, The Bluefish Group.  After we catch up a bit, we talk about being the Willy Wonka for rich people, staying grounded, how comfortable we are in “networking” circles, his new membership site, and lots more. Check out FRESHBOOKS, the world’s easiest cloud […]",
            "length": "41175113",
            "sourceUrl": "https://traffic.libsyn.com/solohour/568.mp3",
            "categories": [
                "Podcast"
            ]
        },
        {
            "title": "567: Shortcuts to Success, with Daniel DiPiazza",
            "datePublished": "Mon, 01 May 2017 18:18:25 +0000",
            "description": "Daniel DiPiazza from Rich 20 Something (https://rich20something.com) stops by to talk about his new book, “Rich20Something: Ditch Your Average Job, Start an Epic Business, and Score the Life You Want”, available now.  We first chatted with Daniel  2 years ago about how to grow your Instagram account, (He has over 250k followers) and today’s focus […]",
            "length": "51504202",
            "sourceUrl": "https://traffic.libsyn.com/solohour/567.mp3",
            "categories": [
                "Podcast"
            ]
        },
        {
            "title": "566: How To Make A Landing Page, Combating “Writers Block”, and More…",
            "datePublished": "Fri, 28 Apr 2017 19:56:30 +0000",
            "description": "Free Coaching Friday from The Solopreneur Hour! If you’re new and don’t know how this works here goes: once a week I ask you to send me your questions and I answer them on Friday. If you want to be part of the fun for next week’s Q&A show join us in the Facebook group […]",
            "length": "28876534",
            "sourceUrl": "https://traffic.libsyn.com/solohour/566.mp3",
            "categories": [
                "Podcast"
            ]
        },
        {
            "title": "565: From A Curious Kid to a Leadership Coach, Lolly Daskal Has Bridged The Gap",
            "datePublished": "Wed, 26 Apr 2017 17:29:44 +0000",
            "description": "As a childhood spent as an innately curious,  voracious reader, Lolly Daskal could be found with a philosophy book in her hand as she grew up in Brooklyn.  That studious, curious mind has propelled her into high level mindset and leadership coaching for the majority of her life.  Her new book, The Leadership Gap, highlights […]",
            "length": "42433864",
            "sourceUrl": "https://traffic.libsyn.com/solohour/565.mp3",
            "categories": [
                "Podcast"
            ]
        },
        {
            "title": "564: Monetizing Your Facebook Group, Hosting Retreats, and Rocking, with Katie Krimitsos",
            "datePublished": "Mon, 24 Apr 2017 04:54:55 +0000",
            "description": "I first met Katie at Podfest (Podfest.us) where I spoke in Orlando.  She was running around making sure everyone was doing ok, and handling fires as they came up.  Sounds a lot like being a solopreneur! Katie is the founder of Biz Women Rock, empowering women entrepreneurs all over the world. On this show, we […]",
            "length": "48494394",
            "sourceUrl": "https://traffic.libsyn.com/solohour/564.mp3",
            "categories": [
                "Podcast"
            ]
        },
        {
            "title": "563: Getting Tipsy, Working for no $$, & British English",
            "datePublished": "Sat, 22 Apr 2017 15:00:05 +0000",
            "description": "Free Coaching Friday from The Solopreneur Hour! If you’re new and don’t know how this works here goes: once a week I ask you to send me your questions and I answer them on Friday. If you want to be part of the fun for next week’s Q&A show join us in the Facebook group […]",
            "length": "30202405",
            "sourceUrl": "https://traffic.libsyn.com/solohour/563.mp3",
            "categories": [
                "Podcast"
            ]
        },
        {
            "title": "562: How to Fix Your Finances with Mike Michalowicz (best of)",
            "datePublished": "Wed, 19 Apr 2017 08:45:58 +0000",
            "description": "Financial discipline is essential as a Solopreneur, knowing where every dollar goes in your life can help you grow your business and will allow you first and foremost to profit from your business. A lot of Solopreneurs suffer from a distinct lack of financial education when it comes to paying themselves while taking into account, […]",
            "length": "62419925",
            "sourceUrl": "https://traffic.libsyn.com/solohour/562.mp3",
            "categories": [
                "Podcast"
            ]
        },
        {
            "title": "561: Killer Solopreneur Marketing Hacks With Clay Hebert",
            "datePublished": "Mon, 17 Apr 2017 07:17:34 +0000",
            "description": "My buddy Clay Hebert was in studio today. (https://clayhebert.com)  Clay is a crowdfunding and marketing genius.  I was way overdue having him on the show! It was one of those shows that could have gone for hours! and we talked how to introduce yourself at a conference, the sales process, how to hack Amazon to get […]",
            "length": "56448681",
            "sourceUrl": "https://traffic.libsyn.com/solohour/561.mp3",
            "categories": [
                "Podcast"
            ]
        },
        {
            "title": "560: Your Sob Story & A Quarter Will Get You A Gumball",
            "datePublished": "Fri, 14 Apr 2017 21:17:54 +0000",
            "description": "Free Coaching Friday from The Solopreneur Hour! If you’re new and don’t know how this works here goes: once a week I ask you to send me your questions and I answer them on Friday. If you want to be part of the fun for next week’s Q&A show join us in the Facebook group […]",
            "length": "34574879",
            "sourceUrl": "https://traffic.libsyn.com/solohour/560.mp3",
            "categories": [
                "Podcast"
            ]
        },
        {
            "title": "559: From BMX Legend to Entrepreneur: Dennis Langlais of 5-Minute Bark",
            "datePublished": "Wed, 12 Apr 2017 07:48:45 +0000",
            "description": "Today was fun, because I got to (seriously) nerd out with one of my childhood heroes, BMX Legend Dennis Langlais.  After chatting about his history in BMX, we talk about how it helped shape his entrepreneurial life, what he was able to do because of BMX, and how it’s dovetailed him into his current business, […]",
            "length": "50230205",
            "sourceUrl": "https://traffic.libsyn.com/solohour/559.mp3",
            "categories": [
                "Podcast"
            ]
        },
        {
            "title": "558: DATA. The SECRET Sauce of Success, with Andy Crestodina",
            "datePublished": "Mon, 10 Apr 2017 08:24:00 +0000",
            "description": "Andy Crestodina is a cofounder and the strategic director of Orbit Media Studios, an award-winning web design company, which has completed more than 1,000 successful website projects. He is a top-rated speaker at national conferences who is dedicated to the teaching of marketing. His favorite topics include search engine optimization, social media, analytics, and content strategy. He […]",
            "length": "50645712",
            "sourceUrl": "https://traffic.libsyn.com/solohour/558.mp3",
            "categories": [
                "Podcast"
            ]
        },
        {
            "title": "557: Build Your Biz Like The 80’s, Network Marketing Gets a Bad Rap, Traveling Abroad, and More…",
            "datePublished": "Fri, 07 Apr 2017 18:48:17 +0000",
            "description": "Free Coaching Friday from The Solopreneur Hour! If you’re new and don’t know how this works here goes: once a week I ask you to send me your questions and I answer them on Friday. If you want to be part of the fun for next week’s Q&A show join us in the Facebook group […]",
            "length": "35982033",
            "sourceUrl": "https://traffic.libsyn.com/solohour/557.mp3",
            "categories": [
                "Podcast"
            ]
        },
        {
            "title": "556: Noah Kagen of AppSumo is Cool, Fun, and Funny. And Wicked Smaht, Dude.",
            "datePublished": "Wed, 05 Apr 2017 06:50:30 +0000",
            "description": "Noah Kagan is cool, fun, and funny.  He’s also one of the original employees at Facebook, Mint.com, and is the founder of Sumo and Appsumo.com.  This show was great, and we talked about taking action, building your business like it’s 1987, your mindset, what it was like to create AppSumo, how to repurpose all of […]",
            "length": "55715180",
            "sourceUrl": "https://traffic.libsyn.com/solohour/556.mp3",
            "categories": [
                "Podcast"
            ]
        },
        {
            "title": "555: Master Storyteller & Speaker, Cal Fussman from Esquire Magazine",
            "datePublished": "Mon, 03 Apr 2017 06:19:30 +0000",
            "description": "Muhammad Ali. Robert Deniro. Woody Allen, Richard Branson…the list goes on and on.  What do they have in common?  Cal Fussman has interviewed them.  Since his early 20’s, Cal Fussman has been interviewing the icons of sport, media and entertainment, and writing deep, in depth pieces about his subjects.  Today he gets to be on […]",
            "length": "60418391",
            "sourceUrl": "https://traffic.libsyn.com/solohour/555.mp3",
            "categories": [
                "Podcast"
            ]
        },
        {
            "title": "554: Raising Your Prices by adding VIP, Growing Your Podcast, and More Solopreneur Free Coaching Friday Goodness!",
            "datePublished": "Fri, 31 Mar 2017 21:27:20 +0000",
            "description": "Free Coaching Friday from The Solopreneur Hour! If you’re new and don’t know how this works here goes: once a week I ask you to send me your questions and I answer them on Friday. If you want to be part of the fun for next week’s Q&A show join us in the Facebook group […]",
            "length": "45299856",
            "sourceUrl": "https://traffic.libsyn.com/solohour/554.mp3",
            "categories": [
                "Podcast"
            ]
        },
        {
            "title": "553: Bringing Out Your Stylish, Solopreneur Self, with JJ Collier (BEST OF)",
            "datePublished": "Wed, 29 Mar 2017 18:57:32 +0000",
            "description": "JJ Collier is a lot of things: Pro Snowboarder, Top Apparel Designer, Family Man.  He also happens to be my best friend.  Over the years, I’ve grown to understand how important it is for us to be well-presented as Solopreneurs. Opportunities in everyday life open up if you’re well-presented, and you “get it”. As someone […]",
            "length": "58439637",
            "sourceUrl": "https://traffic.libsyn.com/solohour/553.mp3",
            "categories": [
                "Podcast"
            ]
        },
        {
            "title": "552: FB Groups, FB Ads, Advanced Twitter Strategies, New or Patinaed, & More! Bonus Free Coaching Monday!",
            "datePublished": "Mon, 27 Mar 2017 07:49:02 +0000",
            "description": "I had so many questions from free coaching Friday last week, that I decided to do free coaching Monday as well! A lot of really interesting questions today, including how to use Twitter and Facebook ads to increase local business, what social media will be important in 2017, which is better: patina or brand-new? Also, […]",
            "length": "27404667",
            "sourceUrl": "https://traffic.libsyn.com/solohour/552.mp3",
            "categories": [
                "Podcast"
            ]
        },
        {
            "title": "551: Michelle Levitt from Heil Sound, Amy Schmittauer from Savvy Sexy Social, & Free Coaching Friday!",
            "datePublished": "Sat, 25 Mar 2017 19:43:06 +0000",
            "description": "Welcome to a special FCF episode with some special guests, live from Social Media Marketing World in San Diego.  First, we are joined by Michelle Levitt from Heil Sound (who makes my microphones) for a great chat about what makes a good mic a good mic, then Amy Schmittauer stops by to chat about live […]",
            "length": "31664185",
            "sourceUrl": "https://traffic.libsyn.com/solohour/551.mp3",
            "categories": [
                "Podcast"
            ]
        },
        {
            "title": "550: How To Build Massive Community, w/Jill & Josh Stanton, Kate Erickson, & John Lee Dumas",
            "datePublished": "Wed, 22 Mar 2017 06:57:44 +0000",
            "description": "Today’s episode, live in studio, was recorded with Jill and Josh Stanton from Screw The Nine to Five (https://screwtheninetofive.com) and Kate Erickson and John Lee Dumas from EO Fire (https://eofire.com).  We talked about how they’ve each created an incredible community around their brands, both online and off.  They shared tons of stories and tips about […]",
            "length": "51924782",
            "sourceUrl": "https://traffic.libsyn.com/solohour/550.mp3",
            "categories": [
                "Podcast"
            ]
        },
        {
            "title": "549: Derek Halpern Returns, and Talks The Art of Storytelling",
            "datePublished": "Mon, 20 Mar 2017 09:15:27 +0000",
            "description": "Anyone who’s followed Derek Halpern’s Facebook page over the last couple of years has read numerous amusing anecdotes from his coffee shop escapades.  It’s not the fact that interesting things happen to him…it’s that he’s great at telling the story.  A master copywriter, we chat about being unemployable, being irritated in the world, some of […]",
            "length": "46602755",
            "sourceUrl": "https://traffic.libsyn.com/solohour/549.mp3",
            "categories": [
                "Podcast"
            ]
        },
        {
            "title": "548: Happy St. Patty’s Day Free Coaching Friday!",
            "datePublished": "Fri, 17 Mar 2017 20:08:38 +0000",
            "description": "Welcome to episode 548 of The Solopreneur Hour, glad to have you here! It’s our usual Friday Q&A roundup, but today it’s much greener on St. Patty’s day! If you’re new and don’t know how this works here goes: once a week I ask you to send me your questions and I answer them on Friday. […]",
            "length": "32816193",
            "sourceUrl": "https://traffic.libsyn.com/solohour/548.mp3",
            "categories": [
                "Podcast"
            ]
        },
        {
            "title": "547: Ronsley Vaz – From over 400k in Debt to a 7-Figure Business in 3 Years",
            "datePublished": "Wed, 15 Mar 2017 08:02:14 +0000",
            "description": "Today we’ve got Ronsley Vaz from https://mustamplify.com, a full service digital agency.  Ronsley was a Sololab member with over 400k in debt a few years ago.  He took some fantastic steps and said “yes” at the right times, and now the Amplify agency has over 7 figures in client work.  Hear today how he decided […]",
            "length": "50946043",
            "sourceUrl": "https://traffic.libsyn.com/solohour/547.mp3",
            "categories": [
                "Podcast"
            ]
        },
        {
            "title": "546: Conquering Huge Fears in Life and Business with Keith Yackey",
            "datePublished": "Mon, 13 Mar 2017 07:37:18 +0000",
            "description": "Keith Yackey runs a great event called Amplify Live (https://theampledlife.com) , which is a microcosm of how he’s spent the last few years of his life.  He had never run an event before, and didn’t have a huge list of marketers…but he figured it out and did it anyway.  There’s a great theme of this […]",
            "length": "50978088",
            "sourceUrl": "https://traffic.libsyn.com/solohour/546.mp3",
            "categories": [
                "Podcast"
            ]
        },
        {
            "title": "545: An Epic Free Coaching Friday!",
            "datePublished": "Fri, 10 Mar 2017 21:07:06 +0000",
            "description": "Welcome to our weekly Q&A edition of The Solopreneur Hour. If you haven’t been here before on Fridays we publish an episode devoted to answering YOUR questions dear listeners! To submit a question join the mailing list, contact me via the Contact page on the site or join our Proudly Unemployable Facebook group. You can […]",
            "length": "50720725",
            "sourceUrl": "https://traffic.libsyn.com/solohour/545.mp3",
            "categories": [
                "Podcast"
            ]
        },
        {
            "title": "544: Scott Page of Pink Floyd Returns to Talk Entrepreneurship after Rock",
            "datePublished": "Wed, 08 Mar 2017 20:43:15 +0000",
            "description": "We are joined once again by legendary Pink Floyd saxophone player Scott Page. This episode is all about entrepreneurship, setting your business up the right way, and following the correct steps for success. Scott outlines his “space” protocol for successful start up implementation. We chat a bit about music, creating an app, and developing this […]",
            "length": "37455540",
            "sourceUrl": "https://traffic.libsyn.com/solohour/544.mp3",
            "categories": [
                "Podcast"
            ]
        },
        {
            "title": "543: How to be MORE Productive with Mike Vardy the Productivityist (Best of)",
            "datePublished": "Mon, 06 Mar 2017 07:42:05 +0000",
            "description": "As solopreneurs it’s up to us to choose how and when we work on our business or our side projects. This can be a blessing and a curse because some of us can organize ourselves and our time while others of us need help. But no matter how organized we are (or not), we can always be better. And […]",
            "length": "50353013",
            "sourceUrl": "https://traffic.libsyn.com/solohour/543.mp3",
            "categories": [
                "Podcast"
            ]
        },
        {
            "title": "542: FREEEE Coaching Friday",
            "datePublished": "Fri, 03 Mar 2017 07:40:15 +0000",
            "description": "Welcome to our weekly Q&A edition of The Solopreneur Hour. If you haven’t been here before on Fridays we publish an episode devoted to answering YOUR questions dear listeners! To submit a question join the mailing list, contact me via the Contact page on the site or join our Proudly Unemployable Facebook group. You can […]",
            "length": "17554067",
            "sourceUrl": "https://traffic.libsyn.com/solohour/542.mp3",
            "categories": [
                "Podcast"
            ]
        },
        {
            "title": "541: How To Launch Just About Anything in a Few Easy Steps",
            "datePublished": "Wed, 01 Mar 2017 18:36:23 +0000",
            "description": "On today’s show, I deconstruct my most recent launch of the Beginner Audiophile podcast, and walk you through some steps that should be included in every single launch, no matter what platform you choose. While these are not hard and fast rules, it is a good outline to work from. It doesn’t matter if you are […]",
            "length": "40844232",
            "sourceUrl": "https://traffic.libsyn.com/solohour/541.mp3",
            "categories": [
                "Podcast"
            ]
        },
        {
            "title": "540: Lou Mongello – Abandoning The Legal World for Walt Disney World",
            "datePublished": "Mon, 27 Feb 2017 09:24:19 +0000",
            "description": "Imagine spending years studying to go to law school, building a super successful law practice, and then abandoning all of it to start a podcast about Walt Disney World. Well, that’s exactly what today’s guest on the show has done. This is a great episode about starting something simply because you want to talk about […]",
            "length": "53854348",
            "sourceUrl": "https://traffic.libsyn.com/solohour/540.mp3",
            "categories": [
                "Podcast"
            ]
        },
        {
            "title": "539: Free Coaching Friday LIVE from Orlando!",
            "datePublished": "Fri, 24 Feb 2017 22:42:13 +0000",
            "description": "Welcome to our weekly Q&A edition of The Solopreneur Hour. If you haven’t been here before on Fridays we publish an episode devoted to answering YOUR questions dear listeners! To submit a question join the mailing list, contact me via the Contact page on the site or join our Proudly Unemployable Facebook group. You can […]",
            "length": "30173072",
            "sourceUrl": "https://traffic.libsyn.com/solohour/539.mp3",
            "categories": [
                "Podcast"
            ]
        },
        {
            "title": "538: From Overcoming Massive Adversity to Solopreneur Success, with Pejman Ghadimi",
            "datePublished": "Wed, 22 Feb 2017 10:17:20 +0000",
            "description": "From growing up in Iran with missiles destroying buildings next to him, to being ignored by a deadbeat dad his whole life, Pejman Ghadimi has faced adversity that many of us would use as an excuse for mediocrity.     His will and drive drove him to success, no matter what obstacle came before him. […]",
            "length": "50694916",
            "sourceUrl": "https://traffic.libsyn.com/solohour/538.mp3",
            "categories": [
                "Podcast"
            ]
        },
        {
            "title": "537: Launching A Successful Niche-Based Solopreneur Business with Nick Ruffini from Drummer’s Resource",
            "datePublished": "Mon, 20 Feb 2017 08:21:07 +0000",
            "description": "Today, Drummer’s Resource founder Nick Ruffini talks to us about transitioning from a professional musician to serving thousands of musicians.  We talk about how he came up with the name, why he decided to start DR, how to serve a niche audience, and how to monetize what you’ve done.",
            "length": "56356096",
            "sourceUrl": "https://traffic.libsyn.com/solohour/537.mp3",
            "categories": [
                "Podcast"
            ]
        },
        {
            "title": "536: My Latest Obsession, and Free Coaching Friday.",
            "datePublished": "Fri, 17 Feb 2017 23:36:22 +0000",
            "description": "Welcome to our weekly Q&A edition of The Solopreneur Hour. If you haven’t been here before on Fridays we publish an episode devoted to answering YOUR questions dear listeners! To submit a question join the mailing list, contact me via the Contact page on the site or join our Proudly Unemployable Facebook group. You can […]",
            "length": "32709262",
            "sourceUrl": "https://traffic.libsyn.com/solohour/536.mp3",
            "categories": [
                "Podcast"
            ]
        },
        {
            "title": "535: Anna Vocino – Forging Multiple Solopreneur Gigs in Hollywood",
            "datePublished": "Wed, 15 Feb 2017 06:27:37 +0000",
            "description": "Anna Vocino needs no introduction.  She’s been on the show multiple times. This conversation we talk about the various ways she keeps her solopreneur career going in Hollywood, what kind of mindset it takes for success, her new stand up career, and what’s coming up next. FYI…the Louis CK show was unbelievable.  SO good.  ",
            "length": "45025081",
            "sourceUrl": "https://traffic.libsyn.com/solohour/535.mp3",
            "categories": [
                "Podcast"
            ]
        },
        {
            "title": "534:  Mastering The Art of Sales, with John Livesay",
            "datePublished": "Mon, 13 Feb 2017 09:07:38 +0000",
            "description": "Arguably the most important skill a solopreneur can have, sales, is also one of the most commonly misunderstood.  A lot of people might think “Hey, I’m not in sales, so I don’t really need that skillset”.  And oh, gentle listener…you’d be wrong.  You need sales all the time as a solopreneur.  Whether you are booking appointments, writing emails, […]",
            "length": "51195035",
            "sourceUrl": "https://traffic.libsyn.com/solohour/534.mp3",
            "categories": [
                "Podcast"
            ]
        },
        {
            "title": "533: A Drill Through The Thumb…Free Coaching Saturday!",
            "datePublished": "Sat, 11 Feb 2017 21:47:19 +0000",
            "description": "Hi all! Welcome to our weekly Q&A edition of The Solopreneur Hour. If you haven’t been here before on Fridays we publish an episode devoted to answering YOUR questions dear listeners! To submit a question join the mailing list, contact me via the Contact page on the site or join our Proudly Unemployable Facebook group. […]",
            "length": "27749438",
            "sourceUrl": "https://traffic.libsyn.com/solohour/533.mp3",
            "categories": [
                "Podcast"
            ]
        },
        {
            "title": "532: How To MASTER Productivity, Focus, and Discipline, with John Lee Dumas",
            "datePublished": "Wed, 08 Feb 2017 08:38:44 +0000",
            "description": "Whenever JLD is on the show, he overdelivers and knocks it out of the park.  This episode is no exception. So, do you ever wish you could end each and every day PROUD of what you’ve accomplished?  It is absolutely my achilles’ heel. Trouble is, (my friends) while you might wish you could end each […]",
            "length": "41114951",
            "sourceUrl": "https://traffic.libsyn.com/solohour/532.mp3",
            "categories": [
                "Podcast"
            ]
        },
        {
            "title": "531: How To Invest in Real Estate for Less Than $1000, with Mark Podolsky",
            "datePublished": "Mon, 06 Feb 2017 08:37:30 +0000",
            "description": "Have you ever wanted to invest in Real Estate, but thought it required too much money?  Think again. Today, Mark Podolsky, of The Land Geek (https://thelandgeek.com) joins us to talk about how we can invest in Real Estate for as little as $1000!  (sometimes less!)  I know it sounds too good to be true, but […]",
            "length": "5242880",
            "sourceUrl": "https://traffic.libsyn.com/solohour/531.mp3",
            "categories": [
                "Podcast"
            ]
        },
        {
            "title": "530: Free Coaching Friday, Your Solopreneur Q&A",
            "datePublished": "Fri, 03 Feb 2017 22:48:06 +0000",
            "description": "Welcome to our weekly Q&A edition of The Solopreneur Hour. If you haven’t been here before on Fridays we publish an episode devoted to answering YOUR questions dear listeners! To submit a question join the mailing list, contact me via the Contact page on the site or join our Proudly Unemployable Facebook group. You can […]",
            "length": "38015987",
            "sourceUrl": "https://traffic.libsyn.com/solohour/530.mp3",
            "categories": [
                "Podcast"
            ]
        },
        {
            "title": "529: Nick Unsworth on Transformation and Patience as a Solopreneur",
            "datePublished": "Wed, 01 Feb 2017 09:46:21 +0000",
            "description": "We’ve all heard that patience is a virtue.  That’s especially true in the Solopreneur game.  We see people parading across the stage, or across our social media networks, and it’s hard to tell how long they’ve been working at it.  (HINT: It’s longer than you think) Today my pal Nick Unsworth (https://lifeonfire.com) stops by Studio […]",
            "length": "39489781",
            "sourceUrl": "https://traffic.libsyn.com/solohour/529.mp3",
            "categories": [
                "Podcast"
            ]
        },
        {
            "title": "528: Scott Page – From Pink Floyd To Entrepreneur",
            "datePublished": "Mon, 30 Jan 2017 09:48:57 +0000",
            "description": "Well, this is a treat.  We get to hear from a rock legend on today’s show. In this one-on-one conversation with sax player Scott Page (Pink Floyd, Supertramp, Toto) who has not only played music for millions…but is arguably more successful as a solopreneur after his main music career. This was so much fun to record. I could have […]",
            "length": "64465774",
            "sourceUrl": "https://traffic.libsyn.com/solohour/528.mp3",
            "categories": [
                "Podcast"
            ]
        },
        {
            "title": "527: It’s Free! It’s Coaching! It’s Friday!",
            "datePublished": "Fri, 27 Jan 2017 20:51:41 +0000",
            "description": "Welcome to our weekly Q&A edition of The Solopreneur Hour. If you haven’t been here before on Fridays we publish an episode devoted to answering YOUR questions dear listeners! To submit a question join the mailing list, contact me via the Contact page on the site or join our Proudly Unemployable Facebook group. You can […]",
            "length": "33050560",
            "sourceUrl": "https://traffic.libsyn.com/solohour/527.mp3",
            "categories": [
                "Podcast"
            ]
        },
        {
            "title": "526: Dawn Marrs talks Growing & Evolving, and New Apps & Websites That Will Improve Your Life",
            "datePublished": "Wed, 25 Jan 2017 21:28:41 +0000",
            "description": "Our old friend Dawn Marrs (https://marrsmarketing.com) swings by Studio 86 to talk marketing, evolving as a solopreneur, making decisions that will improve your quality of life, and we do another round of the latest apps and websites we’ve discovered. Things We Talked Aboot.  (She’s Canadian) Lens Kit for iphone – Olloclip – https://kit.com/solohour Voxer – […]",
            "length": "47342795",
            "sourceUrl": "https://traffic.libsyn.com/solohour/526.mp3",
            "categories": [
                "Podcast"
            ]
        },
        {
            "title": "525: Living Life to the Fullest, and Building A Passive Income Stream, with Matt Miller",
            "datePublished": "Mon, 23 Jan 2017 10:30:31 +0000",
            "description": "Today’s episode almost didn’t happen.  I almost didn’t have a guest to interview.  Matt Miller, who’s forged a small empire from vending machines, had a heart attack the day we were supposed to record our show in December.  Thankfully, higher powers decided he wasn’t finished with us yet, and he’s lived to tell the tale. […]",
            "length": "5242880",
            "sourceUrl": "https://traffic.libsyn.com/solohour/525.mp3",
            "categories": [
                "Podcast"
            ]
        },
        {
            "title": "524: Free Coaching Friday, ROCK STAR EDITION",
            "datePublished": "Sat, 21 Jan 2017 08:44:59 +0000",
            "description": "An absolute bombastic Friday today, full of your great questions, and brushes with rock stars.  If you like Pink Floyd, Toto, or Supertramp…have a listen to this show!",
            "length": "32344668",
            "sourceUrl": "https://traffic.libsyn.com/solohour/524.mp3",
            "categories": [
                "Podcast"
            ]
        },
        {
            "title": "523: The Sexyfit Struggle with Zlata Sushchik",
            "datePublished": "Wed, 18 Jan 2017 07:56:52 +0000",
            "description": "Zlata Sushchik of Sexyfit.com stops by Studio 86 to talk about her new book, The Sexyfit Method.  Zlata, a Russian native who only spoke two words when she immigrated to the United States at 16, has competed in 26 fitness competitions, and now built a multiple six-figure business with Sexyfit, her coaching program for female […]",
            "length": "67496653",
            "sourceUrl": "https://traffic.libsyn.com/solohour/523.mp3",
            "categories": [
                "Podcast"
            ]
        },
        {
            "title": "522: Sales – The Most Underrated Solopreneur Talent, with Matthew Kimberley",
            "datePublished": "Mon, 16 Jan 2017 07:55:53 +0000",
            "description": "Matthew Kimberley (https://matthewkimberley.com) returns in this episode and we talk about his body transformation for 2017 before we dig into the science and nuance of sales. Four Part Sales Convo  What do you want? Why is that important to you? Would you like someone to help you get that? Would you like that person to […]",
            "length": "60932479",
            "sourceUrl": "https://traffic.libsyn.com/solohour/522.mp3",
            "categories": [
                "Podcast"
            ]
        },
        {
            "title": "521: Free Coaching Friday (Halfie).  Answering Your Solopreneur Questions",
            "datePublished": "Fri, 13 Jan 2017 22:45:36 +0000",
            "description": "Hi all!  Welcome to another Free Coaching Friday…the day I answer your questions about business, life, and everything in between.  Today we talk Thailand, hypothetical sophie’s choice, managing your time as a solopreneur, good books to read about finances and productivity, my new drum purchase, and a lot more. Sorry about the coughing.",
            "length": "24364247",
            "sourceUrl": "https://traffic.libsyn.com/solohour/521.mp3",
            "categories": [
                "Podcast"
            ]
        }
    ]
}