{
    "artwork": "http://is1.mzstatic.com/image/thumb/Music122/v4/fd/fa/d4/fdfad49a-6cbd-c528-7056-17c935e138e6/source/100x100bb.jpg",
    "description": "On \"The Pat McAfee Show\" Pat McAfee and his friends deliver one of a kind opinions that won't be heard anywhere else. Pat's a recently retired NFL All Pro who has zero filter. A common man who has experience in an extremely uncommon professional athlete lifestyle is a beautiful concoction of hilarity for the average Joe. Both relatable and ridiculous, \"The Pat McAfee Show\" promises to inform, intrigue, and entertain at least twice a week. Thanks for listening. Cheers. #Viva",
    "feedURL": "http://feeds.feedburner.com/ThePatMcafeeShowPresentedByBarstoolSports",
    "podcastURL": "http://PodcastOne.com",
    "publisher": "Barstool Sports",
    "title": "The Pat McAfee Show presented by Barstool Sports",
    "episodes": [
        {
            "title": "PMS 215 - A Star Studded Fantasy Friday",
            "datePublished": "Fri, 31 Aug 2018 07:00:00 GMT",
            "description": "<p>On today's, Pat and the crew sit down with four different guests for a couple of incredible conversations. First, 2X Pro Bowler, 3X Super Bowl Champion, and host of The Stinkin' Truth Podcast, Mark Schlereth, joins the show. They chat about his outlook on his kids and grandkids, internet trolls coming after his bench press form, what he expects from the Denver Broncos this year, what it was like playing with and hanging out with John Elway, how he thinks given the rules, he could play in the NFL still, and he gives an incredible take on CTE from a players perspective (2:41-23:29). Next, adult film icon, SiriusXM host, and fantasy sports expert, Lisa Ann calls into the show. They discuss how she got into the adult film business, what she thinks about Jimmy G going on a date with a pornstar this offseason and what the protocol for that is, what she's doing to help younger stars in the industry, and she highlights some of her favorite fantasy sleepers for the upcoming NFL season (26:43-42:53). Later, NFL Insider, Ian Rapoport joins the show. He gives some updates on the Aaron Donald contract situation, how he cultivates sources, if he's ever been burned by a source to the point of ex-communication, what the biggest news story he's broken in his career has been, and he looks ahead to the NFL season (49:19-1:01:41). Lastly, coming off a bareknuckle boxing victory in Biloxi, Mississippi, UFC legend Chris &quot;Lights Out&quot; Lytle joins the show. He talks about his experience competing in a bareknuckle boxing event for the second time, how little he knew about his opponent going in, whether he thinks that promotion can compete with the UFC, his mindset while in the ring, and he looks ahead to his next bareknuckle fight (1:04:47-1:21:23). As always, Nick selects a couple of Friday Bangerz to help send you into the week in fantastic fashion. Come laugh with us, cheers.</p>",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/landmark.barstoolsports.net/pat-mcafee-show/pms8.31.mp3",
            "categories": [
                "Talk Radio"
            ]
        },
        {
            "title": "PMS 214 - Brian Urlacher",
            "datePublished": "Thu, 30 Aug 2018 07:00:00 GMT",
            "description": "<p>On today's show, Pat is joined by Digs, Nick, Todd, and Zito has they break down everything that happened in the 4th episode of Hard Knocks including Todd Haley disrespecting The Brand, whether or not Tyrod Taylor is feeling the heat with Baker Mayfield at his heels, Myles Garrett loving jazz music and dismantling offenses, and Mychal Hendricks going after his former teammates (and subsequently being indicted on insider trading), and everything else you need to know about the Cleveland Browns. Also joining the show is 8X Pro Bowler, 4X 1st Team All-Pro, former Defensive Player of the Year and Defensive Rookie of the Year, and newly minted Hall of Famer, Brian Urlacher. They chat about his Hall of Fame experience and why he was nervous leading up to it, some of his craziest locker room gambling stories, what he thinks of the Bears as they seek to discover a new identity, what he's been up to since he retired, and who he thinks is going to be the best team in the NFL this year, and who is going to underperform in an absolutely hilarious interview (30:13-50:11). Later, sports marketing agent Darren Prince, whose clients have included Magic Johnson, Muhammed Ali, Joe Frazier, Dennis Rodman, and many more, joins the show to promote his new book, &quot;Aiming High.&quot; He chats about how he was instrumental in setting up Dennis Rodman's trip to North Korea to meet Kim Jong Un, how he got started in the sports marketing business, his struggles with alcohol and opioid addiction and what he's doing to combat it now, and what he thinks the defining moment in his career thus far (53:39-1:09:04). After the show, stick around for a throwback Thursday comedy clip of Pat retelling the infamous Peyton Manning &quot;bet on Red 18,&quot; story. It's a good one. Come laugh with us, cheers.</p>",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/landmark.barstoolsports.net/pat-mcafee-show/pms8.30.mp3",
            "categories": [
                "Talk Radio"
            ]
        },
        {
            "title": "PMS 213 - Le'Veon Bell",
            "datePublished": "Tue, 28 Aug 2018 07:00:00 GMT",
            "description": "<p>On today's show, Pat is joined by Nick, Digs, Todd, and Zito as they recap what happened over the weekend, including Pat wondering if the Patriots might be in trouble this year after a couple of lackluster showings into the preseason, and Tom Brady's recent drama with ending an interview with WEEI's Kirk &amp; Callahan after being asked questions about his fitness guru, Alex Guerrero. Pat also recounts his hilarious time at a Pentecostal church over the weekend and witnessing the pastor delivering the Holy Spirit to people first hand. Also joining the show is the CEO of The Sports Entertainment group and the agent of Le'Veon Bell, Adisa Bakari. They chat about working to get Le'Veon a new deal during the offseason, how exactly the franchise tag works in this particular situation and what will happen if the Steelers try to franchise him again, if time off during the preseason has hurt his market value, what he thinks about Le'Veon's rap career, and he talks a couple of the potential teams interested in Le'Veon if they are unable to work out a deal with the Steelers (23:19-40:53). Later, IndyCar and now NASCAR driver and friend of the show, Conor Daly, calls in to talk about his crazy weekend involving being dropped by his chief sponsor, Lilly Diabetes, what it was like getting behind the wheel in a NASCAR and how it differs from driving an IndyCar, and what his plans for the future are with this season coming to a close (43:32-53:50). Come laugh with us, cheers.</p>",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/landmark.barstoolsports.net/pat-mcafee-show/pms8.28.mp3",
            "categories": [
                "Talk Radio"
            ]
        },
        {
            "title": "PMS 212 - Kyle Rudolph & Bruce Arians",
            "datePublished": "Fri, 24 Aug 2018 07:00:00 GMT",
            "description": "<p>On today's show, Pat is out of town on another top secret business meeting, but we've still got two incredible interviews to cap off the week. First, 2X Pro Bowler and one of the best TE's in the NFL, Kyle Rudolph, joins the show. They discuss how the Vikings have looked so far in the preseason with Kirk Cousins at the helm, what it's been like adjusting to new offensive coordinator John DeFilippo's system, whether or not Mike Zimmer is really as hard-nosed as he seems, how he thinks Teddy Bridgewater is going to fair with the New York Jets, and if Notre Dame football is ever going to be any good again (8:56-21:43). Next, former Head Coach of the Arizona Cardinals and interim Head Coach for the Indianapolis Colts and current broadcaster for CBS, Bruce Arians, joins the show for another electric conversation. They chat about how he's adapted to not coaching football and what CBS has been doing to prepare him for his first gig when the Browns and Steelers square off week 1, whether or not he's going to have trouble not going after refs, how much he thinks the new rules are going to impact the game, and who the best athlete he's ever coached is (25:19-38:10). To close out the show, the guys each pick a Friday Banger to help send you into the weekend. Come laugh with us, cheers.</p>",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/landmark.barstoolsports.net/pat-mcafee-show/pmsaug24_01.mp3",
            "categories": [
                "Talk Radio"
            ]
        },
        {
            "title": "PMS 211 - Aaron Rodgers",
            "datePublished": "Thu, 23 Aug 2018 07:00:00 GMT",
            "description": "<p>On today's show, Pat finally lands his white whale as 6X Pro Bowler, 2X NFL MVP, and Super Bowl XLV Champion, Aaron Rodgers joins the show for an incredible conversation. They chat about his expectations for the coming season, whether or not coming back from injury makes him appreciate the game more, his thoughts on the new helmet rules and how it affects play, what he likes to do to have fun, and how he expects his contract negotiations to play out (44:20-1:01:24). The guys also do another deep dive on this week's Hard Knocks episode including everything they loved about it, and the emergence of possibly the greatest character in Hard Knocks history, O-Line coach Bob Wylie. Also joining the show is VP of Production for HBO Sports and Senior Producer on Hard Knocks, Dave Harmon. He gives everyone a look behind the curtain of Hard Knocks and discusses what goes into making the show, whether or not the producers make any suggestions for content, if the Browns have final cut and get to choose what gets omitted from the episode, and he gives his opinion on who the best character on Hard Knocks has been (20:00-39:12). Today's a great one. Come laugh with us, cheers.</p>",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/landmark.barstoolsports.net/pat-mcafee-show/pmsaug23_01.mp3",
            "categories": [
                "Talk Radio"
            ]
        },
        {
            "title": "PMS 210 - The World's Strongest Hero",
            "datePublished": "Tue, 21 Aug 2018 07:00:00 GMT",
            "description": "<p>On today's show, Pat is joined by Todd, Digs, Nick, and Zito as they cover everything that happened over the weekend including Pat's crazy couple of days in Brooklyn for NXT Takeover and a hilarious story about The World's Strongest Man, Mark Henry, having to carry him home from Times Square. They also cover Josh Gordon returning to the Browns and what his absence could have possibly been, and they dive deeper into the new helmet rule and how it may be ruining the NFL. WWE Superstar Bobby Lashley also joins the show for an incredible conversation. They chat about his road to the WWE, how being the victim of a botched bank robbery ended his Olympic wrestling career and started his sports entertainment career, how he keeps his body looking the way it does, and Pat gives him a few pointers on how to grow his social media brand (41:42-1:06:57). Later, current Smackdown Women's Champion and one of the biggest stars in the WWE, Charlotte Flair, joins the show. They chat about what it's been like establishing herself in her father's shadow, how trying to save her brother's life got her into the wrestling business, and what its been like being at the forefront of the women's evolution movement in the WWE (1:07:31-1:15:09). It's a good one. Come laugh with us, cheers.</p>",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/landmark.barstoolsports.net/pat-mcafee-show/pmsaug21_02.mp3",
            "categories": [
                "Talk Radio"
            ]
        },
        {
            "title": "PMS 209 - Another Beautiful Friday",
            "datePublished": "Fri, 17 Aug 2018 08:00:00 GMT",
            "description": "<p>On today's show, Pat, Digs, Todd, Nick, and Zito discuss Lavar Ball's recent comments about Lonzo and LeBron coexisting together in Los Angeles, they cover Hue Jackson's recent comments that Drew Stanton will be the backup quarterback ahead of Baker Mayfield and whether or not that's a good decision, Pat explains how he's started to love cooking and how that differs from where he used to be as well as wondering how he can be on a meat exclusive keto diet and lose the same amount of as a vegan. Pat also breaks down the current animal situation in his house, they battle some adversity as more construction goes on directly behind the studio, and Pat breaks down one of his favorite shows on TV, America's Got Talent. Later, cohost of the Around The NFL podcast, NFL Network analyst Chris Wesseling joins the show. They discuss his recent article about Jon Gruden and Martavis Bryant's relationship and whether or not the Raiders are going to be any good, who some of his picks for surprise team in the NFL this year is, his thoughts on this season of Hard Knocks so far, and he breaks down his path to writing for the NFL and chats about recently becoming cancer free (38:20-50:01). As always, Nick selects a couple of  Friday Bangerz to help send you into the weekend. Come laugh with us, cheers.</p>",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/landmark.barstoolsports.net/pat-mcafee-show/pmsaug17.mp3",
            "categories": [
                "Talk Radio"
            ]
        },
        {
            "title": "PMS 208 - \"I Smell Weed In The Car\"",
            "datePublished": "Thu, 16 Aug 2018 07:00:00 GMT",
            "description": "<p>On today's show, Pat, Digs, Nick, Todd, and Zito cover everything going on in the NFL including Pat doing a complete 180 on his thoughts about the Browns after watching the 2nd episode of Hard Knocks. The guys are also joined by a trio of incredible guests to talk all things NFL. First, Mike Florio of Pro Football Talk joins the show to talk about his article on how the Browns are dealing with Antonio Callaway getting pulled over with a suspended license and weed in his car, and his thoughts on Jalen Ramsey taking shots at almost every quarterback in the NFL (33:08-48:06). Next, Super Bowl Champion, 2x Pro Bowler, and one of the best kickers in the league, Justin Tucker of the Baltimore Ravens joins the show. They chat about how his training camp has been so far, how singing opera and football are similar, whether or not he's superstitious before kicks, what he thinks of some of the rule changes and how they'll affect kickers, and what he thinks of fantasy football (50:28-1:08:50). Lastly, former offensive lineman and 2nd round pick of the Indianapolis Colts, Jack Mewhort, calls in to discuss what he's been doing since he retired, how one of his mistakes started one of the greatest field goal streaks in NFL history, whether or not he's worried about CTE down the road, and what he's going to miss most about playing football (1:12:46-1:21:18). It's a good one. Come laugh with us, cheers.</p>",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/landmark.barstoolsports.net/pat-mcafee-show/pmsaug16.mp3",
            "categories": [
                "Talk Radio"
            ]
        },
        {
            "title": "PMS 207 - Live From Colts Training Camp",
            "datePublished": "Tue, 14 Aug 2018 07:00:00 GMT",
            "description": "<p>On today's show, Pat, Todd, Nick, Digs, and Zito are live from training camp with the Indianapolis Colts with a couple of incredible football conversations. Joining the show first is Colts GM Chris Ballard, new Head Coach Frank Reich, and 4x Pro Bowl WR T.Y. Hilton to discuss everything that has been going on so far in training camp, what the Colts plan on doing with all of their cap space, who some of the standout rookies have been so far in camp, how Ballard and Reich have tried to create a new culture and identity in Indianapolis, whether or not they like Andrew Luck's mustache, and more (2:25-21:52). Later, 4x Super Bowl Champ, the greatest kicker who has ever lived, Adam Vinatieri, joins the guys on set. They discuss whether or not he ever gets nervous anymore, how camp changes from year to year, what it's like having his son out on the field being a ball boy, he chats about one of his passion projects, Record Breaking Ranch, his new all-inclusive hunting cabin in Missouri, what he plans on doing once he's retired, and which team he will decide to be inducted into Canton with (25:58-54:13). Come laugh with us, cheers.</p>",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/landmark.barstoolsports.net/pat-mcafee-show/pmsaug14.mp3",
            "categories": [
                "Talk Radio"
            ]
        },
        {
            "title": "PMS 206 - Canada Invades Friday Bangerz",
            "datePublished": "Fri, 10 Aug 2018 07:00:00 GMT",
            "description": "<p>On today's show, Pat is joined by Nick, Todd, Zito, and everyone's favorite Canadian, Gump, is with the fellas in studio. They cover how Gumpy went from caller on The Pat McAfee Show to being pals with everyone at the Heartland, how his travel into Indianapolis was, and the guys talk a little preseason football. Also joining the show is former Colts, Cardinals, and Ravens cornerback Jerraud Powers to chat about what he's been doing in his time off from football, he recalls Pat getting ready to play quarterback in an actual NFL game, he gives his opinion about the new NFL rules and whether he likes them or not, and questions whether Pat is achieving his Caucasian Rock look naturally (4:42-22:52). Later, NFL reporter Steve Wyche joins the show to discuss everything going on around the NFL. They cover Andrew Luck's comeback, the Leveon Bell/Steelers situation, who some of his teams to look out for are this upcoming season, what he thinks about the Browns and Hard Knocks, and why no one ever talks about the Saints (28:01-45:11). To close out the show, Gump helps Nick select a couple of Friday Bangerz to help send you into the weekend. Come laugh with us, cheers.</p>",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/landmark.barstoolsports.net/pat-mcafee-show/pms_810.mp3",
            "categories": [
                "Talk Radio"
            ]
        },
        {
            "title": "PMS 205 - Action Packed Nude Dude Brawl",
            "datePublished": "Thu, 09 Aug 2018 07:00:00 GMT",
            "description": "<p>On today's show, Pat is joined by Nick, Digs, Todd, and Zito as Pat breaks down everything there is to know about the Browns and what he thinks of them after watching the first episode of HBO's Hard Knocks. He dives into what he thinks about Hue Jackson, Todd Haley, Jarvis Landry, Baker Mayfield, and gives his thoughts on what the Browns will be doing this upcoming season. Also joining the show is former Iowa Hawkeye legend and middle linebacker for the Indianapolis Colts, Pat Angerer, for an incredible conversation. They chat about what he's been doing since he retired from the NFL, his concussion and injury issues and what he thinks of the direction of the new NFL, how much he got made fun of for being a white guy, and he tells an absolutely hilarious story about a naked locker room brawl he was involved in and Pat witnessed (52:52-1:14:40). It's a good one. Come laugh with us, cheers.</p>",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/landmark.barstoolsports.net/pat-mcafee-show/pmsaug9.mp3",
            "categories": [
                "Talk Radio"
            ]
        },
        {
            "title": "PMS 204 - I Met Bill Burr",
            "datePublished": "Tue, 07 Aug 2018 07:00:00 GMT",
            "description": "<p>On today's show, Pat is joined by Nick, Digs, Todd, Zito, and Jourdyn to recap everything from Rough 'N' Rowdy 4 in Youngstown, OH including all the best moments from Bill Burr to the fights themselves and a recap of Pat's electric night on the microphone. Pat also does a deep dive into the newest Avengers movie and tries to make sense of it all after watching it over the weekend, and the guys chat about Last Chance U, and how it shares some parallels with Pat's West Virginia experience, and how it shines a light on some of the issues with the NCAA. Also joining the show is former Patriots 2nd round pick and Colts cornerback/safety, one of the smoothest athletes alive, Darius Butler for a great conversation. They cover what he's been up to while being a free agent, he educates the people about what his job was on the football field, how he feels about all the helmet/concussion issues and new rules, and whether or not he's considered joining one of the many new professional basketball leagues (47:26-58:45). Come laugh with us, cheers.</p>",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/landmark.barstoolsports.net/pat-mcafee-show/pmsaug8.mp3",
            "categories": [
                "Talk Radio"
            ]
        },
        {
            "title": "PMS 203 - An Incredible Friday",
            "datePublished": "Fri, 03 Aug 2018 07:00:00 GMT",
            "description": "<p>On today's show, Pat is joined by Digs, Todd, Nick, and Zito as they share their favorite news stories of the week including Tiger vs. Phil over Thanksgiving weekend in Vegas, the NFL returning with the Hall of Fame game, how getting cheated on can actually be beneficial financially, and Matt Damon and Ben Affleck making a movie about the McDonald's Monopoly scandal. Stopping by in studio is Bellator Heavyweight Grand Prix favorite Matt Mitrione and former UFC legend and current bareknuckle boxing championship contender, Chris Lytle for an incredible chat with the guys. They cover Mitrione's recent bender in Vegas, what he and Lytle have been doing training wise for their respective fights, what the difference between an NFL training camp and a fight camp is, and each guy gives an insight into their upcoming fights (19:48-43:30). As always, Nick selects some Friday Bangerz to help send you into the weekend. After the show, stick around for a couple of interviews with two of the marquee fighters featured on this weekend's Rough 'N' Rowdy card. First, Barstool blogger Pat McAuliffe joins the show to talk about his matchup in the main event on the card, a little bit about his training regimen leading up to the fight, and what he did prior to joining Barstool. Next, former Youngstown police officer, Ryan Young, joins the show to discuss his situation and the scandal he's been involved in leading up to the fight, what his prediction for the fight is, and what he plans on doing after Rough 'N' Rowdy (1:01:51-1:32:15). Come laugh with us, cheers. </p>",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/landmark.barstoolsports.net/pat-mcafee-show/pmsaug3.mp3",
            "categories": [
                "Talk Radio"
            ]
        },
        {
            "title": "PMS 202 - Richie Incognito",
            "datePublished": "Thu, 02 Aug 2018 07:00:00 GMT",
            "description": "<p>On today's show, Pat is joined by Todd, Digs, Nick, and Zito as they turn their attention towards the start of the NFL season in an episode heavy on NFL talk. First, former scout for the Eagles, Ravens, and Browns, analyst for NFL Network, and current LA Chargers color analyst, Daniel Jeremiah joins the show. They cover everything going on at training camp and some of the players he's most excited keeping an eye on, what he expects from this NFL season, and who his contenders in the AFC and NFC are in an interview that covers everything you need to know about the coming NFL season (8:30-24:40). Next, 4x Pro Bowler and former offensive lineman for the St. Louis Rams, Miami Dolphins, and Buffalo Bills, Richie Incognito joins the show in an absolutely wild interview. They chat about his recent run in with police that was all over TMZ, whether or not he really plans on pursuing a career in politics, he does a deep dive and gives his side of the Jonathan Martin situation and how it affected everything, and he explains what he's been up to these days (38:06-1:00:31). It's a good one. Come laugh with us, cheers.</p>",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/landmark.barstoolsports.net/pat-mcafee-show/pmsaug2.mp3",
            "categories": [
                "Talk Radio"
            ]
        },
        {
            "title": "PMS 201 - It's Great To Be Back BAY BAY",
            "datePublished": "Tue, 31 Jul 2018 07:00:00 GMT",
            "description": "<p>On today's show, Pat is back from vacation in the Bahamas and is joined by Todd, Nick, Zito, and Jourdyn to chat about what they did with their time off. They also cover the McDonald's Monopoly scandal, Alex Trebek's upcoming retirement from Jeopardy! and Pat recommends a couple of documentaries that he watched while on vacation. Also joining the show in studio is Colts linebacker Najee Goode on his day off to discuss how the things have been going from Colts training camp, whether or not Andrew Luck is really back, and who some of the standouts have been so far (49:52-1:07:21). Come laugh with us, Cheers.</p>",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/landmark.barstoolsports.net/pat-mcafee-show/pmsjuly31.mp3",
            "categories": [
                "Talk Radio"
            ]
        },
        {
            "title": "PMS 200 - Pat's NFL Draft Story, Pardon My Take, And Adam Vinatieri",
            "datePublished": "Fri, 27 Jul 2018 07:00:00 GMT",
            "description": "<p>On today's show, Nick fills in for Pat and selects some of his favorite stories and interviews from the first 199 episodes of the Pat McAfee Show. He selects a couple of classic stories including Pat's hilarious NFL Draft Day story that inevitably changed everything (2:21-10:19), and one of the original Behind The Badge stories where Todd tells the now infamous chicken story (29:10-37:23). Also included is an interview with Big Cat and PFT Commenter of Pardon My Take where Pat and Big Cat's relationship is explained a little more and how Pat details how he eventually found himself working for Barstool (13:03-26:00). Nick's final selection is the incredible interview Pat did with the most clutch athlete of all time, the GOAT, Adam Vinatieri, in their first extended conversation since Pat's retirement. They cover what it was like being teammates, how Vinny reacted to Pat retiring, and Pat tells his favorite Adam Vinatieri story of all-time detailing his kicking battle with Matt Stover while Vinny was injured (41:17-1:16:48). As always, Nick picks a couple of Bangerz to help send you into the weekend the right way. Come and laugh with us, cheers.</p>",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/landmark.barstoolsports.net/pat-mcafee-show/nickpmsbestofjuly27.mp3",
            "categories": [
                "Talk Radio"
            ]
        },
        {
            "title": "PMS 199 - Seth Rogen, Bert Kreischer, And The Birth Of The Jim Kong Update",
            "datePublished": "Thu, 26 Jul 2018 07:00:00 GMT",
            "description": "<p>On today's show, Zito fills in to choose his favorite moments from the Pat McAfee Show while Pat is on vacation. He selects a couple of his favorite segments including the episode that birthed the Kim Jong Update and broke down Pat's interview style with guests, Pat's incredible rant about Simpson's creator Matt Groening being a time traveler, and the infamous Chuck Pagano press conference from episode 60. Zito also chooses two of his favorite interviews to close out the show. First is Pat's hilarious conversation with arguably the funniest man in Hollywood, Seth Rogen. They chat about his creative process, his favorite ways to smoke, and how he got to the position he's in right now (25:21-37:54). Last is the incredible conversation with comedy legend, &quot;The Machine,&quot; Bert Kreischer. They cover his insane life, starting with being the genesis for the film, &quot;Van Wilder,&quot; his story about becoming &quot;The Machine,&quot; in Russia, his relationship with Will Smith, and his wild night out with Tracy Morgan (39:52-1:04:25). Come laugh with us. Cheers.</p>",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/landmark.barstoolsports.net/pat-mcafee-show/zeetbestofpmsjuly26.mp3",
            "categories": [
                "Talk Radio"
            ]
        },
        {
            "title": "PMS 198 - Dave Portnoy, Bruce Arians, And Chase Rice",
            "datePublished": "Tue, 24 Jul 2018 07:00:00 GMT",
            "description": "<p>Pat's on vacation this week, so on today's show, Todd fills in and selects his favorite moments and interviews from the first 197 episodes of The Pat McAfee Show. Todd's first pick is an interview with Barstool Sports founder, Dave Portnoy. Pat and the guys sit down with Dave and discuss how he created Barstool Sports brick by brick and how it has started to evolve over the last 10+ years. They also chat about Dave's love for horses, what it's like owning a racehorse, his gambling habits, and some of the controversies he's be in over the years (4:07-34:35). Todd's next pick is Pat's hysterical interview with one of his old coaches and former head coach of the Arizona Cardinals, Bruce Arians. They cover what it takes to be a great NFL quarterback, Bruce's philosophy towards refs, what it was like coaching Andrew Luck during his rookie year, and he shares some other hilarious stories (37:34-55:05). Todd's final pick is the incredible in-studio conversation with country superstar, Chase Rice. Pat and the guys go inside his creative process as Chase samples a demo off his upcoming album, they chat about what he does when he's not touring, how he got to this point in his country music career, and what he's got coming up in the future (58:56-1:22:28). Come laugh with us. Cheers.</p>",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/landmark.barstoolsports.net/pat-mcafee-show/toddpmsjuly24_01.mp3",
            "categories": [
                "Talk Radio"
            ]
        },
        {
            "title": "PMS 197 - A Super Bowl Champ, A Green Beret, And Bangerz",
            "datePublished": "Fri, 20 Jul 2018 07:00:00 GMT",
            "description": "<p>On today's show, Pat breaks the silence a little bit about his secret business trip yesterday and chats about Nick and Todd's trip down to Nashville to meet Mason Ramsey and his team. Also joining the show is former defensive end/outside linebacker and 2x Super Bowl Champion with the Patriots, Rob Ninkovich for a hilarious conversation. They discuss what he's been doing since he's retired, what the locker room was like in New England, and how his golf game is currently (14:41-34:45). Later, former Green Beret and long snapper for the Seattle Seahawks, Nate Boyer, joins the show. They chat about Pat's world record that Nate long snapped for, his foundation with Jay Glazer and what he's doing to help veterans and retired athletes, and his plan to climb Mount Kilimanjaro for 4th time (42:22-1:01:11). Pat also goes back into his playlist to choose a couple of Friday Bangerz to help send you into the weekend. Come laugh with us, cheers.</p>",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/landmark.barstoolsports.net/pat-mcafee-show/pmsjuly20.mp3",
            "categories": [
                "Talk Radio"
            ]
        },
        {
            "title": "PMS 196 - LOADED THURSDAY",
            "datePublished": "Thu, 19 Jul 2018 07:00:00 GMT",
            "description": "<p>Today's show is a loaded one featuring Pat, Nick, Todd, Digs, and Zito sitting down for three hilarious conversations. First, 5x Pro Bowler, 2x First-team All-Pro, 3x receptions leader and current assistant coach for the Houston Texans, Wes Welker, joins the show. They talk about the differences between Manning and Brady, what his coaching style is like, Wes recounts his incredible Kentucky Derby experience, and Pat explains the heat he would take on the sidelines after missing a tackle on a white returner (2:10-15:44). Next, former Ravens Pro Bowl RB and friend of the show, Justin Forsett calls in. They chat about his upcoming championship game in the AFFL finals and whether he thinks the amateur team has a chance, more about his experience going on Shark Tank with the Shower Pill, and Pat tries to convince him to record an album (22:54-33:13). To close out the show, 2x Super Bowl champion and former offensive tackle for the Steelers, Max Starks, calls in for an incredible convo. They discuss what he's been doing since he retired, the Le'Veon Bell situation, Big Ben being unhappy about his replacement being drafted, if he really had to borrow a pair of Shaq's shoes when he was in grade school in Orlando, and whether or not he's thought about slimming down since retirement (36:11-58:27). Come laugh with us, cheers.</p>",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/landmark.barstoolsports.net/pat-mcafee-show/pmsjuly19.mp3",
            "categories": [
                "Talk Radio"
            ]
        },
        {
            "title": "PMS 195 - Marshawn Lynch Was A Hero In The Story",
            "datePublished": "Tue, 17 Jul 2018 07:00:00 GMT",
            "description": "<p>On today's show, Pat, Digs, Nick, Todd, and Zito chat about the Le'Veon Bell situation with the Steelers and what some of their options are going forward. They also discuss Pat being courted for the next season of The Amazing Race, Todd going down to Nashville to meet Mason Ramsey and his grandma and grandpa on Thursday at his exclusive crawfish boil, Pussy Riot protesting under Putin's nose in the World Cup final, who took the biggest hits in the twitter follower purge, and the guys do a deeper dive into Pat's Italian heritage. Also joining the show is 9-year NFL veteran and former Bills and Seahawks running back, Fred Jackson. They chat about his experiences thus far in the AFFL, what he's doing now that he's retired from the NFL, whether or not he enjoyed playing in the cold weather in Buffalo, what he really thought about Bills Mafia, and the time TMZ reported that he and Marshawn Lynch got into a car accident while street racing (54:37-1:07:46). It's a good time. Come laugh with us, cheers.</p>",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/landmark.barstoolsports.net/pat-mcafee-show/pmsjuly17.mp3",
            "categories": [
                "Talk Radio"
            ]
        },
        {
            "title": "PMS 194 - Netflix Legend David S. Rudolf",
            "datePublished": "Fri, 13 Jul 2018 07:00:00 GMT",
            "description": "<p>On today's show, Pat, Nick, Digs, Todd, and Zito are joined by a couple of incredible guests. First, the undisputed star of the Netflix original series, &quot;The Staircase,&quot; Criminal Defense and Civil Rights Attorney, David S. Rudolf joins the show for an unbelievable conversation. They cover all the little details that made &quot;The Staircase&quot; as compelling as it was, whether or not David was apprehensive to have it all filmed, his thoughts on the Owl Theory, and Pat picks his brain some more about some of the more interesting aspects of the Michael Peterson case (7:17-31:41). Later, 11-year veteran and former quarterback for the Seattle Seahawks, Cleveland Browns, and the Green Bay Packers, Seneca Wallace joins the show. They chat about him tearing up the AFFL and look ahead to the championship game this weekend, who some of his favorite current quarterbacks to watch are, what he picked up playing with Aaron Rodgers, and what it's like owning a Wingstop (44:33-1:02:40). As always, the guys pick a couple of Friday Bangerz to help send you into the weekend. It's a great one. Come laugh with us, cheers.</p>",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/landmark.barstoolsports.net/pat-mcafee-show/july13pms.mp3",
            "categories": [
                "Talk Radio"
            ]
        },
        {
            "title": "PMS 193 - A Super Bowl Champion Joins Us",
            "datePublished": "Thu, 12 Jul 2018 07:00:00 GMT",
            "description": "<p>On today's show, Pat, Todd, Digs, Nick, and Zito discuss England coming home... without the World Cup and look ahead to the France and Croatia final, relive Zito losing in a 40 yesterday, chat about the return of the mafia, and break down Trump cutting WWE promos at the NATO summit. Also joining the show in studio is Pat's former West Virginia teammate, and current linebacker for the Indianapolis Colts, Najee Goode. They chat about him winning a Super Bowl, what he thought of the &quot;Philly Philly&quot; play, what the parade was like and whether Jason Kelce is still alive, the general feeling around the Colts building leading up to training camp, and what Najee plans to do after football as he is the co-owner of a burgeoning technology company (13:12-37:14). Also joining the show is Pro Bowler and first team All-Pro, current linebacker for the Tampa Bay Buccaneers, Lavonte David. The guys chat about what he thought about Jameis Winston's eating W's speech, what he expects the Bucs to do this year, what some of his favorite movies are, and what the Bucs do to stay competitive with each other in the locker room (51:36-1:06:00). Come laugh with us, cheers.</p>",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/landmark.barstoolsports.net/pat-mcafee-show/pmsjuly12.mp3",
            "categories": [
                "Talk Radio"
            ]
        },
        {
            "title": "PMS 192 - \"Lights Out\" With Shawne Merriman",
            "datePublished": "Tue, 10 Jul 2018 07:15:00 GMT",
            "description": "<p>On today's show, Pat is joined by Todd, Digs, Nick, and Zito as they discuss Tiger and Phil Mickelson's potential $10 million match play event, and give their suggestions on how to make it the most successful, recap everyone's week off including the guys heading back to Pittsburgh to play in the Plum hockey golf outing, Brock Lesnar returning to the UFC and immediately cutting a world class WWE promo. Pat also previews a couple of the guests that he's been trying to line up for upcoming shows, and the guys look ahead to the semifinals of the World Cup. Also joining the show is Chargers legend, former Defensive Rookie of the Year, 2x First-team All-Pro, and 3x Pro Bowler, Shawne &quot;Lights Out&quot; Merriman for an incredible conversation about what he's been up to since retiring, how his Lights Out Clothing Brand is doing, his involvement in the MMA world, his acting career, what he thinks of the current state of the NFL, and what player he hit the hardest in his career (18:21-34:29). Come laugh with us. Cheers.</p>",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/landmark.barstoolsports.net/pat-mcafee-show/pmsjuly10.mp3",
            "categories": [
                "Talk Radio"
            ]
        },
        {
            "title": "PMS 191 - Flashback Friday",
            "datePublished": "Fri, 06 Jul 2018 07:00:00 GMT",
            "description": "<p>On today's show, Pat recaps his 4th of July, chats about Darren Lovell's hot dog Twitter beef after the Nathan's Hot Dog Eating Contest, what some of the documentaries he's watched during his week off were, and breaks down what he thinks about people on Instagram and Facebook referring to themselves as public figures. Also included is a best of collection of interviews from the early days of the Pat McAfee show with guests including social media guru Gary Vaynerchuk (22:51-39:40), Pat's first conversation with PGA legend and good friend of the show, John Daly (39:41-54:37), and a hilarious conversation with future NFL Hall of Famer and one of the greatest RB's to ever live, Edgerrin James (54:38-1:12:35). It's a good one. Start your weekend off the right way. Come laugh with us, cheers.</p>",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/landmark.barstoolsports.net/pat-mcafee-show/pms7.6.mp3",
            "categories": [
                "Talk Radio"
            ]
        },
        {
            "title": "PMS 190 - An American Celebration",
            "datePublished": "Tue, 03 Jul 2018 07:00:00 GMT",
            "description": "<p>On today's show, Pat and Digs break down LeBron heading to LA and signing with the Lakers, chat about another crazy weekend of World Cup action, and react to some incredibly patriotic quotes to help you launch into the 4th of July the right way. Also included on today's show is an interview from a very early episode of The Pat McAfee Show. Pat, Todd, Nick, and Digs traveled to New York to interview Barstool personality, marine, and co-host of the Zero Blog Thirty podcast, Uncle Chaps. The guys recount how Chaps received his Purple Heart as he relives the night he got shot, and he also pays tribute to some of his other brothers-in-arms in an incredibly emotional and powerful conversation (33:35-55:57). Come laugh with us, and enjoy your 4th of July celebrating the greatness of our country. Cheers.</p>",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/landmark.barstoolsports.net/pat-mcafee-show/pmsjuly3mp3.mp3",
            "categories": [
                "Talk Radio"
            ]
        },
        {
            "title": "PMS 189 - Bangerz On Top Of Bangerz On Top of Bangerz",
            "datePublished": "Fri, 29 Jun 2018 07:00:00 GMT",
            "description": "<p>On today's show, Pat is joined by Digs, Nick, Todd, and Zito as they recap their favorite news stories of the week including Russian Burger King World Cup promotions, the blood moon to end the world, relief pitchers shitting their pants before having to pitch, and surviving the Permit Patty fallout, and check in on the state of the Oakland Raiders with Coach Gruden. Also joining the show is SI columnist, Greg Bishop, to discuss his incredibly powerful article on Washington State quarterback Tyler Hilinski's family coming to terms with his untimely death, what he did to put the piece together, how tough it was putting pen to paper, whether or not he'd let his son play football after all his research, and what the Hilinski family is doing in response to the situation (24:45-43:15). To wrap up the show, Pat has the aux cord for this edition of Friday Bangerz, and gives a nice little insight to what his everyday playlist includes. Let us help you start the weekend the right way. Come laugh with us, Cheers.</p>",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/landmark.barstoolsports.net/pat-mcafee-show/pms6.29.mp3",
            "categories": [
                "Talk Radio"
            ]
        },
        {
            "title": "PMS 188 - Incredible Conversations",
            "datePublished": "Thu, 28 Jun 2018 07:00:00 GMT",
            "description": "<p>On today's show, Pat, Nick, Digs, Todd, and Zito are joined by a couple of great guests for two incredible conversations. First, 11-year NFL veteran for the New England Patriots, 3 time Super Bowl Champion, 3 time Pro Bowler, former All-Pro, and member of the Patriots 50th anniversary team, former offensive tackle Matt Light joins the show from The Maid of the Mist to chat about his new vodka company, what it was like playing for the Patriots his entire career, who some of his toughest defensive assignments were, and what he thinks about the current state of the NFL (3:53-21:45). Also joining the show is 10 year NHL veteran and former All-Star game MVP, John Scott for one of the most hilarious conversations the guys have had. He chats about his disdain for Gary Bettman, what it was like being an enforcer in the NHL and why the position is vanishing, how he used to approach fights in games, what some of his future plans are including a book and new movie, and who he thinks the greatest NHL player of all-time is (28:39-45:08). The guys also discuss whether or not Kris Jenner could win the presidency, pay tribute to Bruce/Caitlyn Jenner as one of the greatest athletes of all-time, Pat learns that Alex Jones is not a comedian, and Zito takes another crack at an ad read. It's a good one. Come laugh with us, cheers.</p>",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/landmark.barstoolsports.net/pat-mcafee-show/pms6.28.mp3",
            "categories": [
                "Talk Radio"
            ]
        },
        {
            "title": "PMS 187 - A Conversation With Terry Crews",
            "datePublished": "Tue, 26 Jun 2018 07:00:00 GMT",
            "description": "<p>On today's show, Pat, Digs, Todd, Nick, Zito, and Jourdyn discuss everything that happened over the weekend. Pat also gives a public service announcement to Permit Patty and places her in a different class of caucasian people. They also discuss the insanity of the Mary Kay Letourneau story, chat a bit about what Slenderman is, and cover all the craziness of the World Cup including Germany's walk off, the budding super stardom of Icelandic midfielder Rúrik Gíslason, and how their bets have been faring. Also joining the show is Hollywood superstar and former NFL player Terry Crews, for an incredible conversation about how he stays in impeccable shape at 49, what some of his favorite films he's worked on are, what it was like being the Old Spice spokesman, and previews his new film &quot;Sorry to Bother You&quot; (2:16-16:36). Later, former captain of the 2000 Men's Olympic soccer team, MLS legend, and co-host of Counterattack on Sirius XM, Brian &quot;Dunny&quot; Dunseth joins the show to talk all things World Cup, what he thinks the problem with US men's soccer is, who he believes will be the next national team coach, and whether or not he thinks the MLS will ever achiever the same status as soccer overseas (26:36-41:22). Come laugh with us. Cheers.</p>",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/landmark.barstoolsports.net/pat-mcafee-show/pms6.26_01.mp3",
            "categories": [
                "Talk Radio"
            ]
        },
        {
            "title": "PMS 186 - Professional Baseball Debut And Dak Prescott",
            "datePublished": "Fri, 22 Jun 2018 07:00:00 GMT",
            "description": "<p>On today's show, Pat, Nick, Digs, Todd, and Zito break down everything about Pat's professional baseball debut with the Washington Wildthings including his Hall of Fame worthy on base percentage, an in depth breakdown of his at bats, and what some of his favorite moments of the night were. Also joining the show is current starting quarterback for the Dallas Cowboys, Dak Prescott, for an incredible conversation covering his expectations for this NFL season, what he and some of his teammates do to build chemistry, who some of his new weapons will be with the departure of Jason Witten and Dez Bryant, and his Ready, Raise, Rise campaign (40:14-52:26). As always, the guys select a few Friday Bangerz to help start your weekend the right way. Come laugh with us. Cheers</p>",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/landmark.barstoolsports.net/pat-mcafee-show/pms6.22_01.mp3",
            "categories": [
                "Talk Radio"
            ]
        },
        {
            "title": "PMS 185 - Absolutely Loaded Show",
            "datePublished": "Thu, 21 Jun 2018 07:00:00 GMT",
            "description": "<p>Today's show is a great one. Pat is joined by Nick, Digs, Todd, and Zito as they discuss his professional baseball debut, what he's been doing to prepare, and what some of his plans are for the game. Also joining the show are three incredible guests. First, Host of Dialed-In on Barstool Power 85, co-host of Starting 9, and former Oakland A's pitching great, Dallas Braden, joins the show to give Pat a couple of pointers on what to expect, whether he thinks Pat can get a hit, he walks the guys through his perfect game, and breaks down his relationship with A-Rod (12:47-38:06). Next, NBA Insider and co-host of The Jump and SportsNation, Amin Elhassan, joins the show to discuss the NBA draft, free agency, whether or not Jay-Z joining Puma matters, and where he expects guys like LeBron and Kawhi Leonard to end up (43:43-1:00:20). Lastly, memorabilia and collectible guru Brandon Steiner joins the show to chat about what some of his highest selling items are, what some of the hottest pieces of memorabilia are, how his company achieves authenticity, and where he sees the business going in the future (1:01:05-1:23:21). It's a good one. Come laugh with us, cheers.</p>",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/landmark.barstoolsports.net/pat-mcafee-show/pms6.21.mp3",
            "categories": [
                "Talk Radio"
            ]
        },
        {
            "title": "PMS 184 - An Incredible Weekend Recap",
            "datePublished": "Tue, 19 Jun 2018 07:00:00 GMT",
            "description": "<p>On today's show, Pat, Todd, Digs, Nick, Zito, and Jourdyn recap the weekend including Pat's wild weekend co-hosting the NXT Takeover preshow, the wild weekend at the US Open and what everyone thought about it including Phil Mickelson “offending” the entire golf world, and the guys ride the rails for a couple of World Cup games hoping their bets pay off as they are joined by a couple of soccer correspondents from the radio show. Also joining the show is Barstool's own wrestling aficionado, Robbie Fox, to discuss what he thought of the NXT Takeover and Money In The Bank pay-per-views, how he thought Pat did on the preshow, and what the general consensus from wrestling fans was (17:27-28:18). Later, Pat's co-host from the NXT Takeover event, the last professional broadcaster, Sam Roberts, joins the show to give his thoughts on how he thought the preshow went, what some of his favorite moments were, and what he expects from Pat's future with the WWE (35:00-43:45). It's a fun one. Come laugh with us, cheers.</p>",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/landmark.barstoolsports.net/pat-mcafee-show/pms6.19final_01_01.mp3",
            "categories": [
                "Talk Radio"
            ]
        },
        {
            "title": "PMS 183 - Fantastic Friday",
            "datePublished": "Fri, 15 Jun 2018 07:00:00 GMT",
            "description": "<p>On today's show, Pat, Todd, Digs, Nick, and Zito discuss their favorite news stories of the week including people getting their heads stuck in tailpipes, an African man being buried in a brand new BMW, some World Cup tidbits, Nick explains what's wrong with the internet in a rant for the ages, and Pat shares some of his unreleased interview with the NFL network post surgery. Everyone's favorite major champion, John Daly, joins the show to break down what to expect from this years US Open, who some of his favorites and dark horses are, whether or not he and Pat will continue their pro-am undefeated streak at The Greenbrier, and what he has been up to as of late (00:26-12:23). Also joining the show is the Last American Broadcaster, Sam Roberts, to chat about this weekend's NXT pre-show that he and Pat will both be on, what he is planning to wear, and whether he thinks Pat will wind up getting a shot at the North American title (01:02:16-01:12:14). As always, the guys select a few Friday Bangerz to help you kickstart the weekend. Come laugh with us, cheers.</p>",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/landmark.barstoolsports.net/pat-mcafee-show/pms6.15.mp3",
            "categories": [
                "Talk Radio"
            ]
        },
        {
            "title": "PMS 182 - Get Inside The Insider: Jay Glazer",
            "datePublished": "Thu, 14 Jun 2018 07:00:00 GMT",
            "description": "<p>On today's show, Pat, Todd, Nick, Digs, and Zito chat about the World Cup kicking off and the US getting the bid for the 2026 World Cup, what Dominos is doing that the government hasn't been able to, how steroid usage has changed in the NFL over time, and who some of the greatest college football players of all time are. NFL insider and Bellator MMA commentator Jay Glazer also joins the show to discuss how he's helping veterans and former athletes with his MVP organization, some of the celebrities that are currently working out at his gym, where he thinks Dez Bryant might wind up, and what he thinks of TO's Hall of Fame situation (5:07-25:23). Later, Cory Gregory of maxeffortmuscle.com and co-host of the Business and Biceps podcast calls in to chat about his revolutionary new pill that may sweep the nation, how they developed the pill, and how they tried advertising it with Pat (41:26-52:24). After the show, stick around for the wrestling recap as Robbie Fox joins the show to chat about this weekend's NXT and Money In The Bank event's in Chicago, how he thinks Pat will fare, and what he expects from the whole weekend (1:12:53-1:38:43). Come laugh with us, cheers. </p>",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/landmark.barstoolsports.net/pat-mcafee-show/pms6.14.mp3",
            "categories": [
                "Talk Radio"
            ]
        },
        {
            "title": "PMS 181 - Jake Johnson And Isaiah Pead",
            "datePublished": "Tue, 12 Jun 2018 07:00:00 GMT",
            "description": "<p>Today's show is loaded. Pat is joined by Nick, Digs, Zito, and Todd as they discuss Justify winning the Triple Crown and the outrageous stud fee that his trainers demand from other suitors, and what they think that process is exactly. They also dive into the new Netflix crime documentary series The Staircase as Pat breaks it down a little bit and explains why he is so interested in it, and why everyone else should be too. Big Cat also calls into the show (with a surprise drop-in from Rico Bosco) to explain his theory that he could beat any professional athlete in at least one sport, and why he thinks so (1:03:25-1:20:13). Also included are interviews with one of the stars of the hit show “The New Girl,” and the new film, “Tag,” Jake Johnson, as he and the guys chat about what drew him to doing Tag, what it was like having his family in Atlanta when they were filming, what things were like on set, and what some of his upcoming projects are (00:25-13:32) and former Cincinnati running back and 2nd round draft pick of the St. Louis Rams, Isaiah Pead, calls into the show to chat about how his focus has shifted from football to the winning a gold medal in the Paralympics after losing part of his left leg in a terrible car accident. He chats about his new outlook on things, what he's doing to prepare for the Paralympics, and how he's enjoying life one day at a time in an incredibly uplifting and inspiring interview (30:47-48:57). Come laugh with us. Cheers.</p>",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/landmark.barstoolsports.net/pat-mcafee-show/pms6.12.mp3",
            "categories": [
                "Talk Radio"
            ]
        },
        {
            "title": "PMS 180 - This Should Win An Award Of Some Sort",
            "datePublished": "Fri, 08 Jun 2018 07:00:00 GMT",
            "description": "<p>On today's show, Pat is joined by Nick, Digs, Todd, and Zito as they break down some of their favorite news stories of the week including IHOP changing its name to IHOB, crooked Fifa refs taking bribes before the World Cup, the absolute unit who is heading the kitchen staff at the White House, an Alabama woman's wild bank robbery attempt, and Zito breaks down his entrance into the Twitch world. Also joining the show is former Sports Illustrated columnist, author, HOF voter, and current NFL media member Jim Trotter for an incredibly insightful conversation covering some of the issues today's NFL is facing including his opinion on where the NFL goes from here with the anthem protests, his reaction and what he's hearing from the Eagles' White House invite being rescinded, why Hall of Fame voters haven't voted for more specialists, and the guys break the news that TO won't be attending his induction into Canton (12:09-32:27). As always, Nick selects a few Friday Bangerz to help send you into the weekend. Come laugh with us. Cheers.</p>",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/landmark.barstoolsports.net/pat-mcafee-show/pms6.8.mp3",
            "categories": [
                "Talk Radio"
            ]
        },
        {
            "title": "PMS 179 - Friend Of The Show, Jason",
            "datePublished": "Thu, 07 Jun 2018 07:00:00 GMT",
            "description": "<p>On today's show, Pat is joined by Nick, Digs, Todd, and Zito to discuss the guys past Father's Day experiences in Pittsburgh, pissing in pools, what sharks in Brazil have done to keep people out of the water, and the Grand Theft Auto situation out of Virginia where a soldier stationed there decided to steal a tank like vehicle, and what some of his motives may have been. Later, Pat, Jourdyn, and Zito make their way to Middletown, Indiana to visit friend of the Heartland, Jason Wheatley's (@hoosierfirebuff) house. They chat about how Jason battles his Duchenne Muscular Dystrophy and what exactly it is, what some of his interests and hobbies are, how he stays so positive and upbeat despite the challenges he faces, and who some of his favorite callers from the radio show are in an incredibly inspiring and powerful interview (24:11 - 1:01:36). It's a good one. Come laugh with us. Cheers.</p>",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/landmark.barstoolsports.net/pat-mcafee-show/pms6.7.mp3",
            "categories": [
                "Talk Radio"
            ]
        },
        {
            "title": "PMS 178 - A Conversation With TJ Lang",
            "datePublished": "Tue, 05 Jun 2018 07:00:00 GMT",
            "description": "<p>On today's show, Pat is joined by Digs, Nick, Todd, Zito, and Jourdyn as they chat about Pat trying to battle through his flu game while trying to regain his voice back, they find out who the winner of the weight loss challenge is as Digs and Zito get two opportunities to weigh in, give their takes on the man who claims he time traveled from the year 6491 to now and what some of the changes he's experienced have been and whether or not he'd be able to predict the winner of the NBA Finals, and Pat talks about proper wedding speech preparation after taking a call from the number one caller in terrestrial radio, Rico Bosco (36:17-38:52). Also joining the show is 2x Pro Bowler, Super Bowl Champ, former Green Bay Packer and current Detroit Lion offensive lineman TJ Lang, to chat about his tweets about the replacement refs and what he thinks of the state of refereeing in today's sports, what the outlook is in Detroit this year with Matt Patricia as head coach, who he'd rather have under center between Aaron Rodgers and Matthew Stafford, what his favorite weather to play in is, and how he's been telling Clay Matthews he needed a net in front of the mound in his charity softball game for years (49:10-1:09:01). It's a good one. Come laugh with us, cheers.</p>",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/landmark.barstoolsports.net/pat-mcafee-show/pms6.5.mp3",
            "categories": [
                "Talk Radio"
            ]
        },
        {
            "title": "PMS 177 - Wowwww, What A Friday",
            "datePublished": "Fri, 01 Jun 2018 07:00:00 GMT",
            "description": "<p>On today's show, Pat is joined by Nick, Digs, Todd, and Zito as they chat about Pat, Foxy, and Digs' performances in the Barstool Spelling Bee, the weight loss challenge coming down to the wire, some of the new march that is available and will be coming out in the future, and wrap up the show with some Friday Bangerz. Also included is a hilarious interviews with former “Workaholics” star and one of the stars of “I'm Dying Up Here,” Erik Griffin, joins the show to talk about his current standup tour and the debut of his new special “American Warrior,” what some of his goals are for his career at this stage, and how he feels about the Heartland crew (30:21-57:15). Later, co-host of the Jim and Sam show and WWE NXT panelist, the last professional broadcaster, Sam Roberts, joins the show to chat about Pat's involvement with the WWE, the Drake and Pusha T beef, Roseanne's racist comments, and more (1:01:51-1:23:25). Start your weekend the right way. Come laugh with us. Cheers.</p>",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/landmark.barstoolsports.net/pat-mcafee-show/pms6.1.mp3",
            "categories": [
                "Talk Radio"
            ]
        },
        {
            "title": "PMS 176 - Live From A Holiday Inn Patio In New York City",
            "datePublished": "Thu, 31 May 2018 07:00:00 GMT",
            "description": "<p>On today's show, Pat is joined by Nick, Todd, Digs, and Zito as they record the podcast Live from the patio of their hotel in New York City. The guys also welcome Lightswitch Lou Roberts and Matt Browner to the show as they discuss Zito getting booted off certain ad reads, what Louis thinks about Bryan Colangelo's burner accounts and what it means for the 76ers, who won the first round of the Pusha T/Drake beef, and are interrupted by several French tourists. Later, Hall of Fame WR Terrell Owens joins the show to chat about being on the cover of the newest Madden game, how he's still in great shape, which teams he would potentially consider for a comeback, and he tries to help settle the Jordan vs. LeBron debate (22:39-42:06). Today's show is a great time. Come laugh with us. Cheers.</p>",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/landmark.barstoolsports.net/pat-mcafee-show/pmsmay31.mp3",
            "categories": [
                "Talk Radio"
            ]
        },
        {
            "title": "PMS 175 - From Wheeler Walker To Will Smith",
            "datePublished": "Fri, 25 May 2018 07:00:00 GMT",
            "description": "<p>On today's show, Pat is joined by the Heartland Radio crew as they chat about dealing with finding out that Judge Judy is heavily produced, how Pat handled being heckled during NFL games, some potential guests that might be popping up on the radio show, and whether or not Zito could frisbee a pancake over 40 yards. Wheeler Walker Jr. also joins the show for a hilarious conversation about his hatred for Yodel Boy, his upcoming tour with Kid Rock, what he's thinking about doing for his next album, and why Brad Paisley wants to break his jaw (12:51-28:05). Later, former Pittsburgh Penguin, Nashville Predator, and current Winger for the Western Conference Champion Las Vegas Golden Knights, James Neal, joins the show to chat about how Vegas has made an improbable run to the Stanley Cup Finals, how Vegas compares to some of the other cities he's played in, and whether or not playing road games in Vegas poses as big of a challenge as you would think (59:22-1:12:07). As always, the crew gives you a banger or two to start your Memorial Day Weekend the right way. Come laugh with us. Cheers.</p>",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/landmark.barstoolsports.net/pat-mcafee-show/pms5.25.mp3",
            "categories": [
                "Talk Radio"
            ]
        },
        {
            "title": "PMS 174 - A Poolside Chat",
            "datePublished": "Thu, 24 May 2018 07:00:00 GMT",
            "description": "<p>On today's show, Pat is joined by Todd, Digs, Nick, and Zito as they record the podcast from Pat's backyard around the pool. They chat about the different roasts that Pat and Todd have participated in, and how difficult it can be to maneuver those waters when you're roasting someone you don't know that well, Todd breaks down his dreams of one day owning a house boat, and Pat explains how taxes work for an NFL player. Also joining the show is former 1st round pick, and current Defensive Tackle for the Los Angeles Chargers, Corey Liuget, for a great conversation about what he's doing to prepare for the upcoming NFL season, how he's expanded his portfolio since becoming an NFL player, what some of his hobbies are, and how some of the new NFL rules will affect his style of play (44:46-54:15). It's a great time. Come laugh with us. Cheers.</p>",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/landmark.barstoolsports.net/pat-mcafee-show/pms5.24.mp3",
            "categories": [
                "Talk Radio"
            ]
        },
        {
            "title": "PMS 173 - Live From The Barn Of Bad Decisions",
            "datePublished": "Tue, 22 May 2018 07:00:00 GMT",
            "description": "<p>On today's show, Pat is joined by Todd and Zito live from his barn of bad decisions as they battle the elements and a bad microphone from inside the barn. They discuss why kids have become so soft these days, and if there is anyway to fix it, chat a little about what Pat has been doing at the Indianapolis Motor Speedway so far this week getting ready for the Indy 500, cover a little NBA playoffs and chat about the Golden Knights improbable run to the Stanley Cup Finals.  They are also joined by former NFL and CFL punter, Josh Miller, as they discuss Johnny Football's prospects of becoming a CFL legend like Doug Flutie, and whether Josh is familiar with the sensation taking over the world known as K-Pop in a hilarious conversation (44:05) It's a fun one. Come laugh with us. Cheers.</p>",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/landmark.barstoolsports.net/pat-mcafee-show/pms5.22_01.mp3",
            "categories": [
                "Talk Radio"
            ]
        },
        {
            "title": "PMS 172 - Zito's Mom Is A Saint",
            "datePublished": "Fri, 18 May 2018 07:00:00 GMT",
            "description": "<p>On today's show, Pat is joined by the Heartland Radio crew as they talk about their favorite news stories of the week. They discuss the Pope's Lamborghini, getting the wrong name of your kid tattooed on your body, Ukranian dolphins refusing to work for Russia, and winning the lottery and deciding to dump $200,000 worth of manure in your boss's yard. Also joining the show is one of the most electric running back's of all-time, former Tennessee Titan and Arizona Cardinal, CJ2K Chris Johnson joins the show to discuss what he's currently doing preparing for the upcoming NFL season, how he ended up at East Carolina, the time he almost beat a cheetah in a foot race, and what it was like getting shot on the eve of free agency and how he bounced back (54:27). As always, the guys send in a couple new Friday Bangerz to help launch you into the weekend. It's a good time. Come laugh with us, cheers.</p>",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/landmark.barstoolsports.net/pat-mcafee-show/pms5.18_01.mp3",
            "categories": [
                "Talk Radio"
            ]
        },
        {
            "title": "PMS 171 - From The Front Lawn",
            "datePublished": "Thu, 17 May 2018 07:00:00 GMT",
            "description": "<p>On today's show, Pat and Zito record the episode live from the front yard of the McAfee estate and are joined by Pat's lady, Samantha. They chat about Pat's property and how he is beginning to become a big gardening guy, the different animals that roam the McAfee compound, Pat's early mornings while still playing with the Colts and how he tried to get them to change the pregame music for years, and Sam shares a hilarious story about her first date with Pat and how it couldn't have gone any worse. Friend of the show, 11 year NHL vet, and co-host of the Spittin' Chiclets podcast, Paul Bissonnette joins the show to give an NHL playoff update, chat about his new documentary series, &quot;BizNasty Does BC,&quot; and explains how Venmo has been breaking his bank as of late (52:09). Also joining the show is current Bellator MMA Light Heavyweight Champion, and Heavyweight Grand Prix semifinalist, Ryan &quot;Darth&quot; Bader to discuss his upcoming fight with Matt Mitrione, what Bellator has been doing right, and what it's like being a human cockfighter (1:15:17). It's a good time. Come laugh with us. Cheers.</p>",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/landmark.barstoolsports.net/pat-mcafee-show/pms5.17.mp3",
            "categories": [
                "Talk Radio"
            ]
        },
        {
            "title": "PMS 170 - Protests In The City",
            "datePublished": "Tue, 15 May 2018 07:00:00 GMT",
            "description": "<p>On today's show, Pat is joined by Todd, Zito, and Nick as they chat about the big time protest that Pat and Zito attended yesterday in downtown Indianapolis and what some of their observations were. Todd also tells a couple of stories about going after the Mexican drug cartel by going up the chain, and the process of dirtying up phones through wiretaps. The guys also do a deep dive into Indianapolis legend “Mr. Big” Jerry Hostetler and his ridiculous mansion that Pat's accountant thought he was going to buy, Pat looks back on some hilarious encounters with Chuck Pagano, and Zito attempts another ad read. It's a good time. Come laugh with us, cheers.</p>",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/landmark.barstoolsports.net/pat-mcafee-show/pms_5.15.mp3",
            "categories": [
                "Talk Radio"
            ]
        },
        {
            "title": "PMS 169 - Cool Convo With Chase Rice",
            "datePublished": "Fri, 11 May 2018 07:00:00 GMT",
            "description": "<p>On today's show, Pat is joined by the Heartland Radio crew and country superstar Chase Rice in studio to help send you into the weekend in a beautiful fashion. The guys discuss Chase's creative process, and he takes everyone through coming up with the concept of the song on a mountain in Italy to a debut demo he plays for the guys. They also chat about what his concert atmosphere is like, what he has planned for the summer, Pat and Chase reminisce on what it was like playing for Chuck Pagano, and Chase also gives out a couple of selections to be added onto the Friday Bangerz playlist (17:59). Today's show is a great time. Come laugh with us, cheers.</p>",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/landmark.barstoolsports.net/pat-mcafee-show/pmsmay11_01.mp3",
            "categories": [
                "Talk Radio"
            ]
        },
        {
            "title": "PMS 168 - Good Show, Good Show",
            "datePublished": "Thu, 10 May 2018 07:00:00 GMT",
            "description": "<p>On today's show, Pat is joined by the Heartland Radio guys and NASCAR driver Matt DiBenedetto as they chat about their favorite news stories of the week. They discuss cats being saved by firefighters, Pornhub getting into the sock game, admitting to a cocaine operation during a routine traffic stop, and Tiger and Lefty potentially facing off against each other (1:36). The guys are also joined by former NFL and CFL punter, and hilarious human, Josh Miller as they talk about Pat possibly joining a CFL roster to go after the record for most points scored by a punter in a CFL game, and he breaks down some basic CFL rules and regulations, and gives some advice on the best places to play in Canada (38:24). Today's show is a great time. Come laugh with us, cheers.</p>",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/landmark.barstoolsports.net/pat-mcafee-show/pmsmay10.mp3",
            "categories": [
                "Talk Radio"
            ]
        },
        {
            "title": "PMS 167 - A Dog Named Nipsy",
            "datePublished": "Tue, 08 May 2018 07:30:00 GMT",
            "description": "<p>On today's show, Pat is joined by Nick, Digs, Zito, Todd, and Vibbs as they chat about the new addition to Pat's family over the weekend, and gives a live look at how she is acclimating to the other animals in his house, and they break down the mini marathon in Indianapolis. Pat also chooses which superhero he plans on playing at some point in the future, and brainstorms how he is going to build the character. MMA legend Chris Lytle also joins the show to defend himself against the allegations that he clogged the toilet in the Heartland office and then left without telling anyone (27:40). Later, actor, comedic legend, and star of his own self-entitled TV show on NBC, Marlon Wayans, joins the show to chat about getting back into standup comedy, how he structures his act, what the differences between acting in movies and tv shows are, and some of the things that he has planned in the future (1:11:52). Let's have a Tuesday. Come laugh with us, cheers.</p>",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/landmark.barstoolsports.net/pat-mcafee-show/pmsmay8_01.mp3",
            "categories": [
                "Talk Radio"
            ]
        },
        {
            "title": "PMS 166 - Yodel Boy's Gonna Get His Heart Broke",
            "datePublished": "Fri, 04 May 2018 07:00:00 GMT",
            "description": "<p>On today's show, Pat is joined by the Heartland Radio crew as the guys break down their favorite news stories of the week. They chat about stalkers, superintendents taking dumps on school grounds, a Brinks truck losing hundreds of thousands of dollars on a highway in Indianapolis, and Yodel Boy taking the nation by storm. Also joining the show by phone is former Pittsburgh Penguin and Phoenix Coyote, and current cohost of the Spittin' Chiclets podcast, Paul Bissonnette, to chat with the boys about the NHL playoffs, what it was like having to fight over 20 guys in one of his first seasons, and some of the similarities between playing in the NHL and NFL (48:35). Friend of the Heartland, and IndyCar driver, Conor Daly also calls into the show to chat with the guys about what he's doing to prepare for the Indy 500, what he needs to do to win the race, and tries to defend his first pitch at the Cincinnati Reds game (1:03:13). As always, the guys pick a couple of fresh Friday Bangerz to send you into the weekend. Come laugh with us, cheers.</p>",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/landmark.barstoolsports.net/pat-mcafee-show/pms5.4.mp3",
            "categories": [
                "Talk Radio"
            ]
        },
        {
            "title": "PMS 165 - A Birthday Celebration",
            "datePublished": "Thu, 03 May 2018 07:00:00 GMT",
            "description": "<p>On today's show, Pat is joined by Nick, Digs, Vibbs, Todd, and Zito as they help celebrate Pat's birthday with the man, the myth, the legend, recurring caller on the Pat McAfee Show on Sirius Barstool Power 85, and everyone's favorite Canadian, Gump. The guys shoot the breeze and learn a little bit more about what Gump does up in Canada, how he differs from everyone's perception of him, why he roots for the sports teams that he does, and why he hasn't made a trip to Indianapolis yet. Pat's former teammate and current center for the Arizona Cardinals, AQ Shipley, also calls into the show to wish Pat a happy birthday and chat about the Penguins/Capitals series, whether he has talked to Josh Rosen at all, and how the Arizona weather has been treating him so far in camp (25:05). Also included is some of the best moments from today's Sirius show birthday celebration (42:37), and Zito attempts to do his first ad read with mixed results. It's a fun one. Come laugh with us, cheers.</p>",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/landmark.barstoolsports.net/pat-mcafee-show/pms5.3.mp3",
            "categories": [
                "Talk Radio"
            ]
        },
        {
            "title": "PMS 164 - Nice Little Tuesday With AJ Hawk",
            "datePublished": "Tue, 01 May 2018 07:00:00 GMT",
            "description": "<p>On today's show, Pat is joined by the guys as they chat about this week's 20 Dollar Chef cookout, the Titans offensive line putting on a show with the catfish in Nashville, Todd enlisting Shaun's help in order to catch a criminal, how the world might be coming to an end due to the eruption of the super volcano, and their thoughts on the T-Mobile and Sprint merger, which sends them down the memory lane of some older cell phones. Also, former Super Bowl Champion and friend of the show, AJ Hawk, joins the guys to chat about his thoughts on the NFL draft, what he's been up to in the last couple of months, his plans for the Kentucky Derby weekend, and he and Pat's relationships with Guy Fieri (16:56). Let's have a Tuesday. Come laugh with us, cheers.</p>",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/landmark.barstoolsports.net/pat-mcafee-show/pmsmay1_01.mp3",
            "categories": [
                "Talk Radio"
            ]
        },
        {
            "title": "PMS 163 - A Fantastic Friday",
            "datePublished": "Fri, 27 Apr 2018 09:00:00 GMT",
            "description": "<p>On today's show, Nick, Digs, Todd, Zito, and Booze join Pat in studio to help propel you into the weekend. They cover their favorite news stories of the week, including cry closets at the University of Utah, Kanye riding a real hot streak and being incredibly woke, Nick gives everyone a Kim Jong update, and China giving all of their citizens overall ratings, and much more. Pat also tells the story of being dangerously close to be the starting Quarterback of the Colts during a week 17 game. And as always, the guys each pick a banger to send you into the weekend. Today's show is a good time. Come laugh with us. Cheers.</p>",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/landmark.barstoolsports.net/pat-mcafee-show/pms4.27final.mp3",
            "categories": [
                "Talk Radio"
            ]
        },
        {
            "title": "PMS 162 - Crawl Across The World",
            "datePublished": "Thu, 26 Apr 2018 07:00:00 GMT",
            "description": "<p>On today's show, Pat, Digs, Nick, and Zito are joined in studio by The Big Easy, Eric Banks, a veteran of  multiple seasons of the Real World/Road Rules Challenge. He chats with the guys about what it was like filming the one of the most successful reality TV shows of all-time, how much of it is produced, who some of his favorite competitors and rivals were, and how he's transitioned into running a spring break experience for college kids. Pat also talks about his idea to do a bar crawl around in the world in 30 days and some other things he wants to do to enjoy his retirement. Later, Pat throws it over to Robbie Fox for an interview with WWE Intercontinental Champion, Seth Rollins, to discuss what he expects from his storylines the next couple months, what some of his favorite Royal Rumble moments are, and some of the WWE superstars that he enjoyed growing up and whether or not he listens to WWE entrance music (42:44). Come laugh with us. Cheers.</p>",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/landmark.barstoolsports.net/pat-mcafee-show/pms4.26.mp3",
            "categories": [
                "Talk Radio"
            ]
        },
        {
            "title": "PMS 161 - Ryan Whitney & Spice Adams",
            "datePublished": "Tue, 24 Apr 2018 07:00:00 GMT",
            "description": "<p>On today's show, Pat is joined by Nick, Digs, and Zito to chat more about Andrew Luck's recent book club Hall of Fame induction, the group's weekend in Louisville, and Pat's weekend trip to an animal shelter and his near death experience with a dog that was in solitary confinement. The guys also catch up with 11-year NHL vet, cohost of the Spittin' Chiclets podcast, and former Pittsburgh Penguin, Ryan Whitney, as they discuss the NHL playoffs, the odds of the Pens going back-t0-back-to-back, whether the Golden Knights can stay hot, and how the playoffs are different than the regular season (43:58). Also joining the show is one of the most electric humans on the internet, former defensive tackle of the Chicago Bears and San Francisco 49ers and friend of the show, Spice Adams, to chat about taking a punt to the house at the Penn State spring game, what he's got going on the next couple of months, what it was like brushing shoulders with Kevin Hart, and how his minivan is faring (1:05:17). Come laugh with us, cheers.</p>",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/landmark.barstoolsports.net/pat-mcafee-show/pms4.24.mp3",
            "categories": [
                "Talk Radio"
            ]
        },
        {
            "title": "PMS 160 - Happy 4-20",
            "datePublished": "Fri, 20 Apr 2018 07:00:00 GMT",
            "description": "<p>On today's show, Pat is joined by Shaun and the Heartland Radio crew as they help you send you into an incredible 4-20 weekend. They chat about their favorite news stories of the week including baboon's escaping from a zoo and setting up a potential Planet of the Apes situation, raccoon's consuming too much weed, they listen to a call a cop made to a dispatch center after eating too many edibles, and Pat gives a little PSA for those in a bad spot after consuming some. As always, the guys send you into the weekend with some more Friday Bangerz, and play another round of Payday Cuzzo Quizzo. It's a good time. Come laugh with us.</p>",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/landmark.barstoolsports.net/pat-mcafee-show/pms4.20.mp3",
            "categories": [
                "Talk Radio"
            ]
        },
        {
            "title": "PMS 159 - A Super Bowl Champ And A Reality TV Star",
            "datePublished": "Thu, 19 Apr 2018 07:00:00 GMT",
            "description": "<p>On today's show, Pat, Shaun, Nick, Digs, and Zito sit down in studio with friend of the Heartland, IndyCar driver, and runner up in the reality show The Amazing Race, Conor Daly to chat about what he's been doing to gear up for the busiest month in racing, what it's like living with diabetes and how he handles it, if he would do the Amazing Race process over again, and Conor teases some of the big things he's going to be doing in the near future. Also joining the show, one of the most hilarious comedians on earth, Gary Owen, calls in to talk about his career in comedy, what it was like trying to break in to the business while in the Navy, why he's jealous of his son when it comes to comedy, and much more (2:40). Later, former Pittsburgh Steelers and New England Patriots punter and Super Bowl Champ, Josh Miller drops in to tell a couple of hilarious stories and chat with Pat about what it is like holding Adam Vinatieri's balls (48:00). Today's show is a good one. Come laugh with us. Cheers.</p>",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/landmark.barstoolsports.net/pat-mcafee-show/pms4.19.mp3",
            "categories": [
                "Talk Radio"
            ]
        },
        {
            "title": "PMS 158 - A Very Vitamin Tuesday",
            "datePublished": "Tue, 17 Apr 2018 07:30:00 GMT",
            "description": "<p>On today's show, Pat, Nick, Digs, and Zito record the show the from home as they keep an eye on the playoff basketball and hockey and see what's happening on the superstar shakeup on RAW. They chat about Pat's weekend back in Pittsburgh with the guys, the sickness and allergies that are floating around the office. Pat also chats with his former Colts teammate and current WWE superstar, Baron Corbin, while down in New Orleans for Wrestlemania. They chat about what it was like being teammates together and how they used to talk about wrestling together, what it's been like to be in the WWE, and where he sees himself in the WWE world in the future (14:06). The guys also chat about Patrick Reed wearing his green jacket from the Masters everywhere and whether they'd do the same, and discuss the best way to attack a trip to the casino. Come laugh with us. Cheers.</p>",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/landmark.barstoolsports.net/pat-mcafee-show/april_18_pod.mp3",
            "categories": [
                "Talk Radio"
            ]
        },
        {
            "title": "PMS 157 - Fun Fact Friday",
            "datePublished": "Fri, 13 Apr 2018 07:00:00 GMT",
            "description": "<p>On today's show, Pat and Shaun are joined by the Heartland Radio crew to break down their favorite news stories of the week and shoot the breeze. They chat about Mark Zuckerberg testifying in front of Congress and how idiotic they sounded, mice allegedly eating over a ton of marijuana in Argentina, the NBA playoffs starting and whether or not the Cavs will be able to deal with the Tristan Thompson/Kardashian drama, and how the Polar Vortex may finally be gone for the year. As always, the guys add a couple songs to the Friday Bangerz playlist to help send you into the weekend. Come laugh with us. Cheers.</p>",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/landmark.barstoolsports.net/pat-mcafee-show/pms4.13.mp3",
            "categories": [
                "Talk Radio"
            ]
        },
        {
            "title": "PMS 156 - Voice Of God",
            "datePublished": "Thu, 12 Apr 2018 07:00:00 GMT",
            "description": "<p>On today's show, Pat, Shaun, Nick and Digs chat about Pat's experience flying home from Chicago earlier this week, and break down some of the things making waves in the news including Mark Zuckerberg testifying before Congress, whether or not the Penguins are going to win the Stanley Cup as the NHL playoffs begin, and Sister Jean potentially cursing the Cubs after her horrendous first pitch. Later, all the guys are joined by one of the most successful comedians in the world and the king of impressions, Frank Caliendo, as he chats about some of his upcoming tour locations and what he's doing with his current act, and of course runs through his rolodex of incredible impressions in an incredible interview (39:42-1:11:54). Also joining the guys is one of the most electrifying returners in the NFL, Cordarrelle Patterson, as he talks about what it's been like being a new dad, what he's expecting his role to be with the Patriots this season, and what it takes to be an elite returner in the NFL (1:12:26-1:23:32). After the show, stick around for the weekly wrestling recap with Rip Rogers, Nick, Vibbs, and Robbie Fox as they recap their weekend in New Orleans at Wrestlemania, and look ahead to some of the new story lines that will be dominating the next couple of months (1:37:32). It's a good time. Come laugh with us. Cheers.</p>",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/landmark.barstoolsports.net/pat-mcafee-show/pms4.12.mp3",
            "categories": [
                "Talk Radio"
            ]
        },
        {
            "title": "PMS 155 - Wrestlemania Was Wild",
            "datePublished": "Tue, 10 Apr 2018 07:30:00 GMT",
            "description": "<p>On today's show Pat is joined by everyone from the Heartland as the guys land back in Indianapolis after a wild weekend in New Orleans for Wrestlemania. Pat recaps his big weekend commentating the Preshow for NXT, some of the legends he met while down there, what he thought of Wrestlemania as a whole, and the guys relive a wild night on Bourbon Street (7:27). Later, the greatest Orator in the history of the WWE, and perhaps on the face of the earth, Paul Heyman, joins the show to talk about his start in the business, who some of his favorite current wrestlers are, what it's like interacting with Brock Lesnar, and he takes a couple of shots at Robbie Fox (57:41). It's been a wild couple of days. Come laugh with us. Cheers.</p>",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/landmark.barstoolsports.net/pat-mcafee-show/pms4.10.mp3",
            "categories": [
                "Talk Radio"
            ]
        },
        {
            "title": "PMS 154 - LIVE From New Orleans",
            "datePublished": "Fri, 06 Apr 2018 07:00:00 GMT",
            "description": "<p>On today's show, Pat, Nick, and Vibbs are joined by Robbie Fox as the guys record live from New Orleans in preparation for the NXT Preshow and Wrestlemania. The guys discuss Vibbs being put through a table by Nick, Pat's busy day rubbing elbows with WWE superstars, and how he handled calling in to the Sirius show from two separate airports today. The guys are also joined by Irish comedian and impressionist Al Foran as he breaks down Conor McGregor going scorched earth at the UFC media today, chats about his career in comedy and what some of his goals and aspirations are, and he does some of his best impressions for the guys in one of the most electric and hilarious interviews to date (50:30). It's a great time. Come laugh with us, cheers.</p>",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/landmark.barstoolsports.net/pat-mcafee-show/pms4.6.mp3",
            "categories": [
                "Talk Radio"
            ]
        },
        {
            "title": "PMS 153 - A Friday Like Thursday",
            "datePublished": "Thu, 05 Apr 2018 07:00:00 GMT",
            "description": "<p>On today's show, Pat, and Shaun are joined by the rest of the Heartland Radio guys before Pat leaves for New Orleans for his hosting gig live on Saturday night at the NXT Live Preshow before Wrestlemania. The guys discuss their favorite news stories of the week including kids pulling condoms through their noses and out of their mouths, Tim McAfee aka Block Dad's continued fame and Pat's appearance on Headline News to discuss the video, how excited everyone is for the Masters and whether Tiger can win another green jacket, and much more. After the show, stick around for this week's wrestling recap with Rip Rogers, Nick, Vibbs, and Robbie Fox live in studio to discuss everything you need to know about Wrestlemania and what they're looking forward to most about the weekend in New Orleans (1:03:26). It's a good time. Come laugh with us, cheers.</p>",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/landmark.barstoolsports.net/pat-mcafee-show/pms4.5.mp3",
            "categories": [
                "Talk Radio"
            ]
        },
        {
            "title": "PMS 152 - McAfeeBlockParty.com",
            "datePublished": "Tue, 03 Apr 2018 07:00:00 GMT",
            "description": "<p>On today's show, Pat, Shaun, Nick and Digs discuss the launch of Pat's new company, mcafeeblockparty.com, on the back of Tim McAfee going viral for pulling off the greatest Jenga move of all-time on Easter Sunday. The guys also discuss Pat watching Jesus Christ Superstar, as  he tries to piece together the story, whether or not hitmen would've used social media, and cover some other stories making waves in the news. Pat, Vibbs, and Nick also take a trip to Rip Rogers' wrestling school to get a better understanding of all the wrestling terminology ahead of Wrestlemania in New Orleans (37:07). Later, the guys are joined by Tom Segura in an absolutely hilarious interview about Pat's first time on his podcast, his new Netflix special, some of his favorite jokes to tell on stage, and what it's like being surrounded by and working with so many incredible comedians (1:12:38). It's a good time, come laugh with us. Cheers.</p>",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/landmark.barstoolsports.net/pat-mcafee-show/pms4.3.mp3",
            "categories": [
                "Talk Radio"
            ]
        },
        {
            "title": "PMS 151 - Big Baseball Fans",
            "datePublished": "Fri, 30 Mar 2018 07:00:00 GMT",
            "description": "<p>On today's show, Pat and Shaun are joined by the Heartland Radio crew as they leave the studio and record from the bar in the Heartland office so they can watch MLB Opening Day as Pat and the guys dive headfirst into betting MLB games. They also discuss the age old question: Whether or not a hamburger is a sandwich, and if an ice cream sandwich is technically a cookie. Pat also chats with the guys about some of his most recent dreams, and they come to the conclusion that his dreams are shaping up like an HBO crime series, and that his most recent dream was the first episode. To close out the show, the guys give you a couple more Friday Bangerz to add to your playlist heading into the weekend. Today is a good time. Come laugh with us. Cheers.</p>",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/landmark.barstoolsports.net/pat-mcafee-show/pms3.30.mp3",
            "categories": [
                "Talk Radio"
            ]
        },
        {
            "title": "PMS 150 - A Random Thursday",
            "datePublished": "Thu, 29 Mar 2018 07:00:00 GMT",
            "description": "<p>On today's show, Pat, Shaun, Nick, and Digs chat about Pat trying to trim a few pounds in preparation for his hosting role at NXT Live at Wrestlemania, and make phone calls to AQ Shipley to get some insight on what Pat can eat on a no carb diet (15:07) and Big Cat on the Evening Yak to get a better idea of what he did to lose weight and how he's been looking so slim lately (35:44). The guys also discuss Digs rollerblading to work and whether or not he'd be able to walk 2 miles. They also give The Machine, Bert Kreischer, a call to ask him if it was worth it running the LA Marathon, what it's like to possess the Mickey Mantle gene, and the ramifications of falling asleep in bed with a Snickers bar (43:01). Later, stick around for this week's wrestling recap as Rip Rogers, Robbie Fox, and Vibbs join Pat and Nick to discuss everything you may have missed in the WWE leading up to Wrestlemania (01:04:02). Come laugh with us. Cheers.</p>",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/landmark.barstoolsports.net/pat-mcafee-show/pms3.29.mp3",
            "categories": [
                "Talk Radio"
            ]
        },
        {
            "title": "PMS 149 - We Did A Gameshow",
            "datePublished": "Tue, 27 Mar 2018 07:00:00 GMT",
            "description": "<p>On today's show, Pat, Shaun, Nick, and Digs discuss Pat's thoughts on watching Goodfellas for the first time over the weekend, and do a deep dive into some movie talk. They also chat about Dig's complete disdain for Sister Jean, and break down what to expect from Pat's new game show, which premiered last night. Pat also recounts the few times that he's seen ghosts, and the guys break down some of the stories that are making waves in the world right now. Today's show is a great time. Come laugh with us, cheers.</p>",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/landmark.barstoolsports.net/pat-mcafee-show/pms3.27.mp3",
            "categories": [
                "Talk Radio"
            ]
        },
        {
            "title": "PMS 148 - Let's Have A Friday",
            "datePublished": "Fri, 23 Mar 2018 07:00:00 GMT",
            "description": "<p>On today's show, Pat and Shaun are joined by the Heartland Radio crew to wrap up the week and shoot the breeze a little bit. They discuss their favorite stories of the week including a brief recap of what it was like developing, planning, and shooting a game show, Vibbs' continued wrestling education, Joe Biden and Donald Trump's current feud, stealing cars while babies are laying in the backseat, and much more. As always, the guys select a couple of songs for Friday Bangerz to help send you into the weekend the right way. Today's show is a great time. Come laugh with us. Cheers.</p>",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/landmark.barstoolsports.net/pat-mcafee-show/pms3.23.mp3",
            "categories": [
                "Talk Radio"
            ]
        },
        {
            "title": "PMS 147 - 2018 MLB MVP",
            "datePublished": "Thu, 22 Mar 2018 07:15:00 GMT",
            "description": "<p>On today's show, Pat, Shaun, Nick, Digs, and Zito chat about some movies as Pat dives a little deeper into some of the recent films that he's enjoyed, cover some of the news stories that are making waves around the world, and chat a little bit about Pat's big announcement with the WWE. Cincinnati Reds catcher, and 2017 Gold Glove winner, Tucker Barnhart, also joins the show to chat with the guys about how he's dealing with the dog days of spring training, he gives a small preview of the upcoming season, and plays, &quot;are you a catcher or not?&quot; with Digs (43:58). Later, sports handicapper and electric factory, Brandon Lang, joins the show to tell a few hilarious stories, including how to deal with breakups and some tips about marriage, and he gives everyone a couple of picks for the Sweet Sixteen (1:09:18). After the show, Pat and Nick are joined by wrestling legend Rip Rogers, Vibbs, and Barstool's own wrestling aficionado Robbie Fox to break down Pat signing a contract with the WWE, Daniel Bryan returning to in-ring competition, and wrap up the week in wrestling as we creep closer and closer to Wrestlemania in New Orleans (1:25:00). Come laugh with us. Cheers.</p>",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/landmark.barstoolsports.net/pat-mcafee-show/pms3.22.mp3",
            "categories": [
                "Talk Radio"
            ]
        },
        {
            "title": "PMS 146 - AQ Shipley & Big Cat",
            "datePublished": "Tue, 20 Mar 2018 07:15:00 GMT",
            "description": "<p>On today's show, Pat, Shaun, Nick, and Digs are joined in studio by friend of Barstool Heartland, our resident little person, Colin (@whiskeynaps) as they talk about some of the gigs he's had including some films and music videos. The guys also discuss Pat's upcoming game show, as well as some other topical news including a recap of St. Patty's Day weekend, March Madness, and Vladimir Putin winning another election. Also calling into the show is the center for the Arizona Cardinals and good friend of the show, AQ Shipley, as he discusses what he's been doing in the offseason, how he feels about Sam Bradford being his new quarterback, and what he's done to prepare to become a father (11:00). Later, cohost of Pardon My Take (the #1 sports podcast on the planet), Big Cat, joins the guys in studio to talk about how he fared gambling during the first two rounds of the NCAA tournament, what its been like breaking news during the NFL offseason, and what he did for St. Patrick's Day (58:29). Come laugh with us. Cheers.</p>",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/landmark.barstoolsports.net/pat-mcafee-show/pms3.20_01.mp3",
            "categories": [
                "Talk Radio"
            ]
        },
        {
            "title": "PMS 145 - March Madness Mayhem",
            "datePublished": "Fri, 16 Mar 2018 07:00:00 GMT",
            "description": "<p>On today's show, Pat and Shaun are joined by the Heartland Radio crew as they chat about the start of March Madness, what the plans are for St. Patrick's Day, and discuss some of their favorite news stories of the week including a plane with over $300 million in gold crashing in Russia, a woman gouging her eyes out while high on meth, and Vibbs becoming the owner of a Little League Baseball team. As always, the guys send you into St. Patrick's Day weekend with some Friday Bangerz that will help set the mood for the holiday and March Madness. Come laugh with us. Cheers.</p>",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/landmark.barstoolsports.net/pat-mcafee-show/pms3.17final.mp3",
            "categories": [
                "Talk Radio"
            ]
        },
        {
            "title": "PMS 144 - Thank You To A Vet",
            "datePublished": "Thu, 15 Mar 2018 07:15:00 GMT",
            "description": "<p>On today's show, Pat, Shaun, Nick, and Digs are joined by coworker, veteran, and American badass @wizcauleyfa, Ryan Cauley, to chat about the project he is currently working on, and a little more background on his experiences while in Iraq serving for our country. The guys also chat about Digs almost dying after tying a cinder block to his ankle before walking on a frozen lake and Pat's brief but successful career playing hockey. Later, professional sports handicapper, and the source material for the gambling film &quot;Two for the Money,&quot; Brandon Lang joins the show to give a couple of NCAA tournament picks, and breaks down what to do to close with a stripper (42:51). After the show, stick around for the wrestling recap where Rip Rogers, Nick, Pat, and Vibbs are joined by WWE superfan Robbie Fox to discuss everything you might have missed in the WWE and the Road to Wrestlemania (1:10:36). Come laugh with us, cheers.</p>",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/landmark.barstoolsports.net/pat-mcafee-show/pms3.15.mp3",
            "categories": [
                "Talk Radio"
            ]
        },
        {
            "title": "PMS 143 - T's And P's To Taylor Swift",
            "datePublished": "Tue, 13 Mar 2018 07:45:00 GMT",
            "description": "<p>On today's show, Pat, Shaun, Nick, and Digs take some time to give Foxy some feedback on his shoes and whether or not Mr. Rogers would wear them, and chat about what Pat has under the hood of some of his vehicles. They dive in to the mindset of comedians that go on tour, and Pat discusses how his approach differs from most comedians. The guys also break down the lost OJ Simpson interview and his &quot;hypothetical&quot; confession, how Taylor Swift may have lost her mind and is entering a similar stage in her career to Britney Spears when she shaved her head, who created Daylight Savings Time, and discuss which movies Pat and has seen, and which ones he just gets. Today's show is a great time. Come laugh with us. Cheers.</p>",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/landmark.barstoolsports.net/pat-mcafee-show/pms3.13final.mp3",
            "categories": [
                "Talk Radio"
            ]
        },
        {
            "title": "PMS 142 - Country Friday",
            "datePublished": "Fri, 09 Mar 2018 07:00:00 GMT",
            "description": "<p>On today's show, Pat is joined by Shaun and the entire Heartland Radio crew as they go to the internet to answer some of the best questions that were submitted this week. The Polar Vortex also stops by to talk about his recent return to the Midwest, his European vacation, and what he plans to do now that spring and summer are approaching. They also chat about the consequences of Nick taking a massive kick to the head from Todd with a football helmet on, and how he may now be a permanent resident of CTE City. This week, the crew looks to diversify Friday Bangerz as they select all country songs to help send you into the weekend. It's a good one. Come laugh with us. Cheers. </p>",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/landmark.barstoolsports.net/pat-mcafee-show/pms142final.mp3",
            "categories": [
                "Talk Radio"
            ]
        },
        {
            "title": "PMS 141 - Mouthpiece Of The NFL, Rich Eisen",
            "datePublished": "Thu, 08 Mar 2018 07:30:00 GMT",
            "description": "<p>On today's show, Pat is joined by Shaun, Digs, and Nick for a couple of incredible conversations. One of the NFL network's biggest stars, host of The Rich Eisen Show, and mouthpiece of the NFL, Rich Eisen joins the guys to talk about the response he's getting from the letter he penned to the NFL as Ed Hochuli, gives a couple of updates from around the league, and addresses being called the mouthpiece of the NFL, and whether or not that's a bad thing (15:44). Later, one of the best radio producers in the world, former producer of the Jay Thomas Show, and producer of The Pat McAfee Show on Sirius XM Power 85, The Mighty Beast, Gonzo, joins the guys for an incredible conversation about his career in radio, how he reacted to learning about Barstool's new Sirius channel, and what he does for fun in New York City (26:09). After the show, wrestling legend Rip Rogers joins Pat and Nick in studio for this week's wrestling recap. They chat about Pat's wrestling debut at NXT in Indianapolis and what Rip thought of the night. They also cover everything that happened this week in the WWE, and Rip shares some hilarious stories (1:25:47). Today's show is a great one. Come laugh with us. Cheers.</p>",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/landmark.barstoolsports.net/pat-mcafee-show/pms3.8final.mp3",
            "categories": [
                "Talk Radio"
            ]
        },
        {
            "title": "PMS 140 - Brain Talk",
            "datePublished": "Tue, 06 Mar 2018 07:00:00 GMT",
            "description": "<p>On today's show, Pat, Shaun, Digs, Nick, and Zito chat about Pat's debut at the WWE NXT show in Indianapolis, AQ Shipley gives a surprise call to discuss his offseason thus far, Pat discusses the time he was involved in a high speed chase, and the guys discuss one of the worst park jobs on the face of the earth that happened right in front of the office. Later, former NFL WR, and teammate of Pat's, Austin Collie calls into the show to discuss going on a Mormon mission while playing college football at BYU, some of his experiences as Pat's teammate, and what he's been doing lately to help educate people about concussions at all levels of football (51:06) Also, Pro Football Talk's Mike Florio joins the guys in studio to discuss his start in the business, some of the things he learned at the combine, and how being a lawyer helped him create one of the most successful football blogs on the planet (01:17:47). Come laugh with us. Cheers.</p>",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/landmark.barstoolsports.net/pat-mcafee-show/pms140finalmp3.mp3",
            "categories": [
                "Talk Radio"
            ]
        },
        {
            "title": "PMS 139 - Olympic Gold Medalist Matty Hamilton",
            "datePublished": "Fri, 02 Mar 2018 07:15:00 GMT",
            "description": "<p>On today's show, Pat, Shaun, and the entire Heartland Radio crew get together to recap a very busy week. They discuss Laron Landry and his pet monkey Gucci, the history of the Ides of March, and their favorite news stories of the week including a very expensive Jim Kong update and the building feud between Pat and NXT wrestler Adam Cole ahead of Pat's debut as the ring announcer at this weekend's NXT event in Indianapolis. Later, the Big Unit of Curling, Olympic gold medalist, owner of one of the most glorious mustaches on the face of the earth, and one of Pat's best friends, Matty Hamilton, calls into the show for an incredible conversation. He and Pat chat about some different curling strategies that were used in South Korea, what the point of some of the equipment is, how he plans to celebrate his gold medal, and what's next for the future of US Curling (27:16). As always, the guys give you more Friday Bangerz to send you into the weekend in a fantastic fashion.  Come laugh with us. Cheers.</p>",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/landmark.barstoolsports.net/pat-mcafee-show/pmsmarch2.mp3",
            "categories": [
                "Talk Radio"
            ]
        },
        {
            "title": "PMS 138 - Pardon My Take",
            "datePublished": "Thu, 01 Mar 2018 07:00:00 GMT",
            "description": "<p>On today's show, Pat, Shaun, Digs, and Nick are joined by Big Cat and PFT Commenter of the number one sports podcast Pardon My Take to shoot the breeze. They discuss what PFT was doing before Barstool, and how he and Big Cat first met, Big Cat's passion for singing the National Anthem, what they've been doing this week at the NFL Combine in Indy, their thoughts on whether or not Jon Gruden will be successful with the Raiders, and much more (3:35-1:20:50). After the show, Pat, Nick, and Rip Rogers are joined by independent wrestling legend and WWE hopeful Dylan Bostic to chat about his long career in wrestling despite still being young, his recent tryout with the WWE, and what it was like being trained by Rip (1:27:38). Later, Barstool's own Robbie Fox joins Nick and Rip to cover everything you might have missed in the WWE this week (1:37:16). Today's show is a can't miss. Come laugh with us. Cheers.</p>",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/landmark.barstoolsports.net/pat-mcafee-show/pms138final.mp3",
            "categories": [
                "Talk Radio"
            ]
        },
        {
            "title": "PMS 137 - Mike Florio: Mafia Talk",
            "datePublished": "Tue, 27 Feb 2018 07:15:00 GMT",
            "description": "<p>On today's show, Pat is joined by Nick and Barstool Heartland's Director of Morale, Zito, as Shaun and Digs are each serving a one podcast suspension. The guys chat about Pat's experience at the movie theatre this weekend, where Pat is considering sending his future child for college, how elite PFT Commenter's brain is, and the guys help Zito brush up on his Yinzer accent. Later, Pro Football Talk's Mike Florio joins the show to talk about Roger Goodell fining Jerry Jones millions of dollars, what he's looking forward to the most from the NFL scouting combine, and what he thinks about some of the current Quarterback contracts in the NFL (59:04). Come laugh with us. Cheers.</p>",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/landmark.barstoolsports.net/pat-mcafee-show/pms137final.mp3",
            "categories": [
                "Talk Radio"
            ]
        },
        {
            "title": "PMS 136 - 4th Place In The Amazing Race",
            "datePublished": "Fri, 23 Feb 2018 07:00:00 GMT",
            "description": "<p>On today's show, Pat and Shaun are joined by the Heartland Radio crew and Indy Car driver and now reality TV star, Conor Daly, to discuss his experience on the Amazing Race, and what his plans are for the future with Indy Car, whether he wants to pursue more reality TV opportunities, and he and Tactical Digs see who will win in a common sense challenge. As always, the guys end the show by giving you some Friday Bangerz to send you into the weekend. Today's show is a great time. Come laugh with us. Cheers.</p>",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/landmark.barstoolsports.net/pat-mcafee-show/pms136final.mp3",
            "categories": [
                "Talk Radio"
            ]
        },
        {
            "title": "PMS 135 - Canceling A Surprise Shark Tank Pitch",
            "datePublished": "Thu, 22 Feb 2018 08:15:00 GMT",
            "description": "<p>On today's show, Pat, Shaun, Digs, and Nick discuss Pat going on Shark Tank to pitch a couple of different business plans to Mark Cuban. They also cover some of the news stories making waves around the world, including a Winter Olympics recap, football players putting M.D. on the back of their jersey's and the differences between different types of doctors, and Lucky Charms changing up their marshmallow selection. After the show, stick around for the weekly wrestling recap where wrestling legend Rip Rogers, and Barstool's MMA/WWE blogger Robbie Fox join the show to cover everything you may have missed in the WWE this week (1:34:14). Come laugh with us. Cheers.</p>",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/landmark.barstoolsports.net/pat-mcafee-show/pms135final.mp3",
            "categories": [
                "Talk Radio"
            ]
        },
        {
            "title": "PMS 134 - Rough N' Rowdy Recap",
            "datePublished": "Tue, 20 Feb 2018 07:30:00 GMT",
            "description": "<p>On today's show, Pat, Shaun, Digs, and Nick recap their wild weekend in West Virginia. They cover all the drama surrounding the decision in Shaun's fight, Smitty on steroids, and whether or not Shaun would be up for a rematch. They are also joined by Dave Portnoy who recaps Rough N' Rowdy with the guys, and discusses firing Michael Rapaport from his bed on Sunday morning (34:18). Later, the guys are joined by top Bellator Heavyweight and friend of the show, Matt Mitrione, who discusses his fight on Friday night against Roy Nelson, and why he lost respect for him after their fight. He also discusses who he thinks he'll be facing next in the Bellator Heavyweight Tournament, and what he said in his phone conversation with Shaun following each of their fights on Friday night (01:12:40). Come laugh with us. Cheers.</p>",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/landmark.barstoolsports.net/pat-mcafee-show/pms134final.mp3",
            "categories": [
                "Talk Radio"
            ]
        },
        {
            "title": "PMS 133 - Rough N' Rowdy",
            "datePublished": "Fri, 16 Feb 2018 08:30:00 GMT",
            "description": "<p>On today's show, Pat, Shaun, Digs, Nick, and Todd are live from a hotel lobby in Morgantown, West Virginia in preparation for The Big Homie's fight tonight against Smitty at Rough 'N Rowdy 2. They chat with several Barstool personalities including El Pres, Dave Portnoy, Caleb Pressley, Rone, Lightswitch Lou, and Smitty himself sits down with the guy. They cover what to expect from Rough N' Rowdy 2, their thoughts on the weigh-in's and how it swayed the betting odds, and also spotlight some other fighters that will be on the PPV undercard. The guys also give Shaun a couple of bangerz to consider listening to before his fight. It's a great time. Come laugh with us.</p>",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/landmark.barstoolsports.net/pat-mcafee-show/podcastrnrfinal.mp3",
            "categories": [
                "Talk Radio"
            ]
        },
        {
            "title": "PMS 132 - I'm A Big J Journalist Now",
            "datePublished": "Thu, 15 Feb 2018 07:30:00 GMT",
            "description": "<p>On today's show, Pat, Shaun, Digs, and Nick chat about Pat's breakthrough moment as a legitimate big J journalist during Frank Reich's introductory press conference for the Colts (8:40). They discuss the latest news from the winter Olympics, and also breakdown what Valentine's Day actually means, and Pat brings his Valentine's Day gift into the studio. They also discuss how Pat will be retiring from chugging beers, as he reflects on what an incredible run it has been (37:31). After the episode, Rip Rogers and Barstool's WWE/MMA blogger Robbie Fox join the show to recap everything that has been going on in the WWE and give a little preview of what to expect at Rough N' Rowdy 2 (57:26). Come laugh with us. Cheers.</p>",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/landmark.barstoolsports.net/pat-mcafee-show/pms2.14_01.mp3",
            "categories": [
                "Talk Radio"
            ]
        },
        {
            "title": "PMS 131 - Bert Kreischer - The Machine",
            "datePublished": "Tue, 13 Feb 2018 07:30:00 GMT",
            "description": "<p>On today's show, Pat, Shaun, Digs, and Nick recap what they've seen so far in the Winter Olympics, discuss where they stand on Johnny Football's comeback, spotlight how Shaun is feeling leading up to Rough N Rowdy 2, and Pat chats about how he's quickly becoming a big baseball guy. Later, comedian and party animal, The Machine Bert Kreischer, joins the show for a hilarious conversation. They chat about how he was the inspiration for the movie Van Wilder after being featured in Rolling Stone while in college, how Will Smith discovered him, Bert tells one of the greatest stories about Tracy Morgan of all-time, and whether or not he drinks on stage during his sets (39:15). Today's show is a great time. Come laugh with us. Cheers.</p>",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/landmark.barstoolsports.net/pat-mcafee-show/pmsfeb13finalfinal.mp3",
            "categories": [
                "Talk Radio"
            ]
        },
        {
            "title": "PMS 130 - A Deep Conversation With Gabriel Iglesias",
            "datePublished": "Fri, 09 Feb 2018 07:30:00 GMT",
            "description": "<p>On today's show, Pat and Shaun are joined by the Heartland Radio crew as they react to Jason Kelce's speech from the Eagles parade yesterday, and share their favorite news stories from this week including Gronk's house being broken into, and Quincy Jones commenting on Richard Pryor and Marlon Brando's relationship. Later, one of the most successful comedians in the world, the man known as Fluffy, Gabriel Iglesias, calls into the show for an absolutely incredible conversation that you don't want to miss. They chat about what Fluffy has been up to after taking a little time off, what his favorite city to perform in is, his most memorable onstage story, and what some of his goals for the future are (51:15). As always, they close out the show with Friday Bangerz to send you into the weekend. Come laugh with us. Cheers.</p>",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/landmark.barstoolsports.net/pat-mcafee-show/pms130final.mp3",
            "categories": [
                "Talk Radio"
            ]
        },
        {
            "title": "PMS 129 - My National Signing Day Situation",
            "datePublished": "Thu, 08 Feb 2018 07:00:00 GMT",
            "description": "<p>On today's show, Pat, Shaun, Digs, and Nick discuss National Signing Day, as Pat tells the story about his signing day which is one for the ages. They also cover some topical news stories around the globe. Later, starting TE of the newly crowned Super Bowl Champion Philadelphia Eagles, Zach Ertz, joins the show to talk about his catch that sealed the Super Bowl win, what he expects the parade to be like, and what it's like to be married to another incredible athlete (49:43). After the show, stick around for the weekly wrestling recap with Pat, Nick, Rip Rogers, and Barstool's resident wrestling/MMA blogger, Robbie Fox, cover everything going on in the WWE (01:26:17). To end the show, former WWE superstar James Ellsworth joins to the show to discuss what it was like getting into the WWE, what his plans for the future are, and how wrestlers from Rip's generation paved the way for current superstars like himself (02:04:31). Come laugh with us. Cheers.</p>",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/landmark.barstoolsports.net/pat-mcafee-show/pms129.mp3",
            "categories": [
                "Talk Radio"
            ]
        },
        {
            "title": "PMS 128 - Back In Beautiful Indianapolis, Indiana",
            "datePublished": "Tue, 06 Feb 2018 07:00:00 GMT",
            "description": "<p>On today's show, Pat, Shaun, Digs, and Nick break down everything about the Super Bowl, including what the Eagles will do now that they have a quarterback controversy on their hands, where the Patriots go from here and whether or not this is the end of a dynasty, Justin Timberlake's halftime performance and some of the backlash, and what some of the best commercials of the night were. They also look ahead to the Winter Olympics and chat about some of their favorite events, and recap the wild week in Minnesota for the Super Bowl. It's a good one. Come laugh with us. Cheers</p>",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/landmark.barstoolsports.net/pat-mcafee-show/pms128final.mp3",
            "categories": [
                "Talk Radio"
            ]
        },
        {
            "title": "PMS 127 - Broken Ass Chair ",
            "datePublished": "Fri, 02 Feb 2018 06:30:00 GMT",
            "description": "<p>On today's show, Pat, Shaun, Digs, and Nick record from the AirBnB in Minneapolis to take a look back at the week that was including a slate full of incredible interviews. Former Pro Bowl Running Back, Justin Forsett, joins the show as he is urged to sing a couple of tunes by Spice Adams (4:55). Next, Spice Adams sticks around to chat about bringing fanny packs back, what he's been up to at the Super Bowl, and how he brings out Hall of Fame talent from people (9:35). MMA legend Matt Mitrione also joins the show to discuss his upcoming fight against Roy Nelson, and what he's seen from Shaun leading up to Rough 'N' Rowdy (16:44). And Finally, Pro Bowl Linebacker, and the man who may have started Deflategate, D'Qwell Jackson joins the show to talk about some of his memories from being teammates with Pat, and hashing out everything related to Deflategate with Dave Portnoy himself (23:20) The guys wrap up the show with some locks for the Super Bowl, and some Friday Bangerz. Come laugh with us. Cheers.</p>",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/landmark.barstoolsports.net/pat-mcafee-show/pms128finalmp3.mp3",
            "categories": [
                "Talk Radio"
            ]
        },
        {
            "title": "PMS 126 - We're Ice Fishing",
            "datePublished": "Thu, 01 Feb 2018 07:00:00 GMT",
            "description": "<p>On today's show, Pat, Shaun, Digs, and Nick are joined by Young Pageviews from an ice castle on Lake Minnetonka as they record while doing a little ice fishing. Pat, Digs, and Nick try to keep pace with everyone else as they all discuss some of the best ways to catch some fish. Also included are interviews with future Hall of Famer, Terrell Owens, to discuss his thoughts on making a return to the XFL, and who he thinks is going to win the Super Bowl (8:32). Later, former NFL Running Back and Dancing With The Stars winner, Rashad Jennings, joins the show to discuss his life after football, how he almost predicted the Super Bowl before the season, and where he sees himself in the next couple of years (46:41). Today's show is a great time. Come laugh with us. Cheers.</p>",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/landmark.barstoolsports.net/pat-mcafee-show/pms126final.mp3",
            "categories": [
                "Talk Radio"
            ]
        },
        {
            "title": "PMS 125 - Hotel Room Concert",
            "datePublished": "Tue, 30 Jan 2018 07:30:00 GMT",
            "description": "<p>On today's show, Pat and Shaun are joined by Tactical Digs, World News Nick, and country superstar, Clayton Anderson, as they battle the elements from a hotel room from Minneapolis. They recap everything they've done in Minnesota so far, and what is planned for the rest of the week, chat about the results from the Grammy's, who some of Clayton's favorite current country performers are, come up with an outstanding idea for the XFL, talk a little more about Shaun's upcoming fight against Smitty at Rough 'N' Rowdy 2, and get an exclusive concert that was perhaps heard by the entire hotel. This episode is a can't miss. Come laugh with us. Cheers.</p>",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/landmark.barstoolsports.net/pat-mcafee-show/pms125final.mp3",
            "categories": [
                "Talk Radio"
            ]
        },
        {
            "title": "PMS 124 - Friday Trip To Space",
            "datePublished": "Fri, 26 Jan 2018 07:15:00 GMT",
            "description": "<p>On today's show, Pat and Shaun are joined in studio by the entire Heartland Radio crew. They discuss the XFL making its comeback and whether Pat might be able to get a gig, 50 Cent cashing in on his BitCoin investment, and how Pat missed the boat on his BitCoin opportunity, and go over their favorite news stories from this past week. Also on today's show, MMA legend, actor, and entrepreneur, &quot;The Huntington Beach Bad Boy&quot; Tito Ortiz, joins the show to chat with Pat about his career in the UFC, what Donald Trump told him about business, his strategy when playing Blackjack, and Tito also gives Shaun a couple of tips for his upcoming fight at Rough 'N' Rowdy 2 (11:16). To end the show, we add a couple new tracks to the best playlist on the internet with some Friday Bangerz to send you into the weekend. Come laugh with us. Cheers.</p>",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/landmark.barstoolsports.net/pat-mcafee-show/pms124final.mp3",
            "categories": [
                "Talk Radio"
            ]
        },
        {
            "title": "PMS 123 - Rip Rogers: Legendary Wrestler/Human",
            "datePublished": "Thu, 25 Jan 2018 08:00:00 GMT",
            "description": "<p>On today's show, Pat and Shaun are joined in studio by Tactical Digs, World News Nick, and wrestling legend Rip Rogers as the guys go beyond the ring with Rip and learn more about the wrestling business, including all the different places he's wrestled, the car accident that required him to get dentures, and recap this week in wrestling including RAW's 25th anniversary show. Later, former WWE superstar, Al Snow, joins the show to talk about how he created his in-ring gimmick, what he's been up to since leaving the WWE, and how he's got a side gig as a magician for the blind (26:22). Come laugh with us. Cheers.</p>",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/landmark.barstoolsports.net/pat-mcafee-show/pms123final.mp3",
            "categories": [
                "Talk Radio"
            ]
        },
        {
            "title": "PMS 122 - A Great Tuesday Conversation",
            "datePublished": "Tue, 23 Jan 2018 07:00:00 GMT",
            "description": "<p>On today's show, Pat and Shaun are joined in studio by Tactical Digs and World News Nick to shoot the breeze. They chat about going to Minnesota for the Super Bowl, give a little preview of what to expect on this week's Sirius shows, discuss Pat's super secret trip to LA, chat about Pat's experiences while ice fishing, and talk a little bit more about Shaun's fight at Rough 'N' Rowdy. Come laugh with us. Cheers.</p>",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/landmark.barstoolsports.net/pat-mcafee-show/pms122final.mp3",
            "categories": [
                "Talk Radio"
            ]
        },
        {
            "title": "PMS 121 - Dude's Name Is Shavago",
            "datePublished": "Fri, 19 Jan 2018 07:00:00 GMT",
            "description": "<p>On today's show, Pat and Shaun are joined by the Heartland radio guys and comedian Zhivago Blea to chat about drive through funeral services, the marriage between a woman and the 300 year old ghost of a pirate, and the spike in Pornhub activity after the false &quot;Hawaiian Missile Crisis.&quot; They also give out their locks for the AFC and NFC Conference Championships, and as always, keep adding to the best playlist available with some more Friday Bangerz. Come laugh with us. Cheers.</p>",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/landmark.barstoolsports.net/pat-mcafee-show/pms121final.mp3",
            "categories": [
                "Talk Radio"
            ]
        },
        {
            "title": "PMS 120 - Sirius Launch Celebration",
            "datePublished": "Thu, 18 Jan 2018 07:00:00 GMT",
            "description": "<p>On today's show, Pat and Shaun are joined by Tactical Digs and World News Nick as they recap the launch of the Sirius show on Barstool Power 85, talk about some of their favorite documentaries, check in on Pat's relationship with his best friend, Aaron Rodgers, and give you a little sample of what to expect on the radio show (33:24). After the show, Pat and Nick sit down for the ‘Post Show Wrestling Wrap Up With Rip Rogers' as they cover all the current events in the WWE (54:51). They are also joined by former WWE superstar, Santino, as they discuss how his character was created, what some of his favorite moments from his career were, and what Vince McMahon is really like (01:22:45). Come laugh with us. Cheers.</p>",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/landmark.barstoolsports.net/pat-mcafee-show/pms120final.mp3",
            "categories": [
                "Talk Radio"
            ]
        },
        {
            "title": "PMS 119 - What A Weekend, Bro",
            "datePublished": "Tue, 16 Jan 2018 07:00:00 GMT",
            "description": "<p>On today's show, Pat and Shaun are joined in studio by Tactical Digs and World News Nick  to chat about their long weekends and look ahead to the Sirius show, and have another short conversation with the Big Homie Polar Vortex. Later, Pardon My Take producer, Handsome Hank, and Shaun's opponent at Rough N' Rowdy 2, Smitty join the guys in studio to discuss everything pertaining to the fight. They also breakdown the incredible divisional playoff games and look ahead to the conference championship games (43:54). Today is a CAN'T MISS. Come laugh with us. Cheers.</p>",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/landmark.barstoolsports.net/pat-mcafee-show/pms119final.mp3",
            "categories": [
                "Talk Radio"
            ]
        },
        {
            "title": "PMS 118 - What A Week",
            "datePublished": "Fri, 12 Jan 2018 07:30:00 GMT",
            "description": "<p>On today's show, Pat and Shaun are joined by the Heartland Radio crew as they recap the week that was. They chat more about Shaun's Rough N' Rowdy fight, being in a staged police chase, the small zoo Pat is accumulating at his house, how to react to a cold craps table, and everyone shares their favorite news stories of the week. Plus some NFL locks for the divisional round of the playoffs, and as always, we send you into the weekend with another electric version of Friday Bangerz. Come laugh with us. Cheers. </p>",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/landmark.barstoolsports.net/pat-mcafee-show/pms118final.mp3",
            "categories": [
                "Talk Radio"
            ]
        },
        {
            "title": "PMS 117 - From The Amazing Race To Wrestling",
            "datePublished": "Thu, 11 Jan 2018 07:30:00 GMT",
            "description": "<p>On today's show, Pat and Shaun keep the doors in the studio open and are joined by World News Nick and Tactical Digs to cover everything including Shaun's Rough n' Rowdy fight announcement (including a call to Barstool Radio), the NFL divisional playoffs, cropdusting airplanes, why Digs can't stand the Kardashian family, and are also joined in studio by Mr. Polar Vortex himself (14:55). Later, Indy Car driver and one of the current stars of ‘The Amazing Race,' Conor Daly, stops by the studio to chat about what it was like filming 'The Amazing Race,' and his plans to make a NASCAR run soon (01:15:25). After the show, Pat is joined by World News Nick and wrestling legend Rip Rogers for a bonus conversation about all things wrestling including current events in the WWE, and a behind the scenes look at what goes on beyond the ring. They are also joined by former WWE superstar, Eugene, to chat about some of the best wrestlers he's ever faced off against, what he's currently doing, and where his WWE character came from (1:47:38). It's a great one. Come laugh with us. Cheers</p>",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/landmark.barstoolsports.net/pat-mcafee-show/pms117final.mp3",
            "categories": [
                "Talk Radio"
            ]
        },
        {
            "title": "PMS 116 - Tuesday With A Nostradamus",
            "datePublished": "Tue, 09 Jan 2018 07:00:00 GMT",
            "description": "<p>On today's show, Pat and Shaun are joined by Tactical Digs as he gives his 40 second NFL recap of Wildcard weekend. They also chat about Jeff Triplette's last game, what it's been like for Shaun training with Chris Lytle, and what it would be like to see Oprah and The Rock running together in 2020. Later, Barstool Pick Em' intern and all around Nostradamus, Black Jack Fletcher, joins the show for a hilarious conversation about his betting philosophy, what he does on a daily basis, and what he was doing prior to being a full-time gambling fiend (43:36). Come laugh with us. Cheers.</p>",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/landmark.barstoolsports.net/pat-mcafee-show/pms116final.mp3",
            "categories": [
                "Talk Radio"
            ]
        },
        {
            "title": "PMS 115 - Yeah, I Welcomed Eli Manning Into His House I Think",
            "datePublished": "Fri, 05 Jan 2018 07:00:00 GMT",
            "description": "<p>On today's show, Pat and Shaun are joined by the entire Heartland Radio team to shoot the breeze and send you into the first weekend of 2018. They discuss this weekend's NFL playoff games, heckling audience members at comedy shows, some of the more wild situations Pat has gotten into, including knocking back some red wine with Eli, Archie, Peyton, and Cooper Manning, and going to a golf outing that ended up morphing into a Playboy Playmate golf outing, and hanging out with Ron White. Also included are Pat and Shaun's NFL locks, and an incredible Friday Bangerz playlist curated by World News Nick (11:37). Come laugh with us. Cheers.</p>",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/landmark.barstoolsports.net/pat-mcafee-show/pms115final.mp3",
            "categories": [
                "Talk Radio"
            ]
        },
        {
            "title": "PMS 114 - Big Homie Polar Vortex Continues To Wreck America",
            "datePublished": "Thu, 04 Jan 2018 07:00:00 GMT",
            "description": "<p>On today's show, Pat and Shaun are joined by Tactical Digs and World News Nick as they recap yesterday's press conference that was held by  the Polar Vortex and the new arrival of the Bomb Cyclone that is creating havoc along the east coast. They also cover some topical things going on in the news, including another Jim Kong update, what some of their favorite Olympic sports are, which off brand products you can't skimp on, and chat a little more about the Sirius show starting January 15. Come laugh with us. Cheers.</p>",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/landmark.barstoolsports.net/pat-mcafee-show/pms114final.mp3",
            "categories": [
                "Talk Radio"
            ]
        },
        {
            "title": "PMS 113 - Real Hungover New Years Day",
            "datePublished": "Tue, 02 Jan 2018 07:00:00 GMT",
            "description": "<p>On today's show, Pat welcomes Shaun, Digs, Nick, and Todd as they try to pick up the pieces from Pat's New Years Eve show. They recap what happened throughout the night and try to work through their miserable hangovers. Later, magician Carl Michael stops by the studio to do a couple more magic tricks for Pat and the boys, and gives his recollection of events from the New Years Eve show (28:00). It's a good one. Come laugh with us, cheers.</p>",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/landmark.barstoolsports.net/pat-mcafee-show/newyearsdayfinalpms113mp3.mp3",
            "categories": [
                "Talk Radio"
            ]
        },
        {
            "title": "PMS 112 - 2017 Had A Good Run",
            "datePublished": "Fri, 29 Dec 2017 08:00:00 GMT",
            "description": "<p>On today's show, Pat joins the Heartland Radio guys in studio for a hilarious conversation about different craps techniques, predictions for the 20 Dollar Chef, The Big Homie, Shaun Latham's Rough N' Rowdy fight in February, chat about the upcoming radio show on Sirius, and do a round of mad libs (3:46). Also included are Pat's locks of the week, and World News Nick and Tactical Digs stick around with Pat and Shaun for an electric edition of Friday Bangerz to send you into the new year (01:04:46). Let us help you bring in 2018 the right way. Come laugh with us. Cheers.</p>",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/landmark.barstoolsports.net/pat-mcafee-show/pms112final.mp3",
            "categories": [
                "Talk Radio"
            ]
        },
        {
            "title": "PMS 111 - Human Cockfighting Conversation",
            "datePublished": "Thu, 28 Dec 2017 07:30:00 GMT",
            "description": "<p>On today's show, Pat and Shaun are joined by Tactical Digs as they discuss James Harrison signing with the Patriots, the havoc the polar vortex has been creating, and other topical things going on around the NFL including Digs' 40 second recap. Later, Matt Mitrione stops by the studio for an incredible conversation. They discuss his upcoming fight against Roy Nelson, what he does to mentally prepare for a fight, and the time he almost snapped Pat's leg in half with a leg kick (46:09). Also joining the show for an absolutely hilarious conversation is Darren McMullen, host of the new show, NFL Football Fanatic on USA. They chat about what it was like being an NFL fan growing up in Scotland, some of his favorite NFL cities, and what it was like meeting David Letterman (01:18:21). It's a good time. Come laugh with us. Cheers.</p>",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/landmark.barstoolsports.net/pat-mcafee-show/pms111final.mp3",
            "categories": [
                "Talk Radio"
            ]
        },
        {
            "title": "PMS 110 - Sally McAfee Is In The Building",
            "datePublished": "Fri, 22 Dec 2017 07:30:00 GMT",
            "description": "<p>On today's show, Pat worries about being killed due to the backlash from his Simpson's rant. Later, Pat and Shaun sit down with 4x Pro Bowler Antonio Cromartie for a hilarious conversation. They discuss his 14 kids, what it was like running Pat over, and Pat learning how to play dominoes for the first time (11:07). Also included are Pat's NFL locks of the weekend, and per usual, Friday Bangerz with the entire McAfee family to get your holiday weekend going. It's a good one. Come laugh with us. Cheers.</p>",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/landmark.barstoolsports.net/pat-mcafee-show/pms110.mp3",
            "categories": [
                "Talk Radio"
            ]
        },
        {
            "title": "PMS 109 - Chris 'Lights Out' Lytle",
            "datePublished": "Thu, 21 Dec 2017 07:30:00 GMT",
            "description": "<p>On today's show, Pat and Shaun discuss Tom Brady's health guru and his beef with Bill Belichick, Lane Kiffin living his best life getting a 10 year extension at FAU, Shaun fighting in the next Rough 'N' Rowdy event, and Lavar Ball going to war with the NCAA trying to start a new basketball league. Later, firefighter, family man, and one of the most entertaining UFC fighters of all-time, Chris ‘Lights Out' Lytle, stops by the studio for an incredible conversation. They chat about his experiences coming up in the UFC, how he feels before a fight, and what he's doing to prepare for his bare knuckle boxing match in London, January 13 (48:00). Come laugh with us. Cheers.</p>",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/landmark.barstoolsports.net/pat-mcafee-show/pms109finalmp3.mp3",
            "categories": [
                "Talk Radio"
            ]
        },
        {
            "title": "PMS 108 - Dude's A Time Traveler",
            "datePublished": "Tue, 19 Dec 2017 07:00:00 GMT",
            "description": "<p>On today's show, Pat and Shaun attempt to get to the bottom of Matt Groening and The Simpsons predicting so many things correctly about the future, and break down how he's a time traveler in an incredible rant. Later, Tactical Digs joins the show and gives his 40 second NFL recap, and chats about Marvin Lewis leaving the Bengals, Pat's experience with Rich Rod leaving and coming back at West Virginia, how miserable he was after the Pats beat the Steelers, and everything else that happened in the NFL this week. Stick around for another contest for a chance to win some free merch. Come laugh with us. Cheers.</p>",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/landmark.barstoolsports.net/pat-mcafee-show/pms108final.mp3",
            "categories": [
                "Talk Radio"
            ]
        },
        {
            "title": "PMS 107 - A Very Lit Friday",
            "datePublished": "Fri, 15 Dec 2017 07:00:00 GMT",
            "description": "<p>On today's show, Pat and Shaun sit down with Dan Orlovsky for another hilarious convo. They chat about him getting into breaking down film on Twitter, what is said in conversations between Quarterbacks during pregame, and his thoughts on what can be done to improve the Pro Bowl (11:02). Pat and Shaun also give out a few NFL locks, and are joined in studio by DJ Lemi Vice who lays down an incredible Friday Bangerz mix to help send you into the weekend (32:02). Stick around after the show for a potential contest. Come laugh with us. Cheers.</p>",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/landmark.barstoolsports.net/pat-mcafee-show/pms107final2.mp3",
            "categories": [
                "Talk Radio"
            ]
        },
        {
            "title": "PMS 106 - Seth Rogen",
            "datePublished": "Thu, 14 Dec 2017 07:00:00 GMT",
            "description": "<p>On today's show, Pat and Shaun welcome in Heartland Radio and Snipe Celly cohost, World News Nick, who breaks down Jim Kong being able to control the weather, and dishes on everything that has happened thus far in the NHL (24:30). Plus an interview with a guy who has starred in way too many classic films to list, one of the funniest humans on the planet, Seth Rogen, in an absolutely hilarious conversation. They discuss his creative process and where he draws some of his ideas from, what his preferred method of smoking is and if he's ever not high, and how he got his start in comedy (6:41) Later, one of the stars of the new Netflix series, 'She's Gotta Have it,' and an original cast member of a little play called Hamilton, Anthony Ramos, sits down with Pat and Shaun. They chat about his Hamilton audition process, what he did to get into shape for 8 three hour shows every week, and what it was like getting a voicemail from Spike Lee (48:12). This one is one for the ages. Come laugh with us, cheers.</p>",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/landmark.barstoolsports.net/pat-mcafee-show/pms106final.mp3",
            "categories": [
                "Talk Radio"
            ]
        },
        {
            "title": "PMS 105 - The Nature Boy, Ric Flair",
            "datePublished": "Tue, 12 Dec 2017 07:00:00 GMT",
            "description": "<p>On today's show, Pat and Shaun sit down with Tactical Digs who gives his 40 second NFL recap, and discusses Big Ben's resurgence, Josh Gordon's twitter war with Damarious Randall, and the Rams hiring actors and actresses to come to their home games (18:57). Later, Pat and Shaun talk to the Rolex wearing, diamond ring wearing, kiss stealing, wheeling dealing, limousine riding, jet flying son of a gun, the man who's having a hard time holding those alligators down, The Nature Boy, Ric Flair. They chat about what it takes to survive in today's WWE, how he decided how many shots he'd buy when in a bar, the craziest purchase he's ever made, and how he's been calling fans for four days straight (53:33). Come laugh with us. Cheers.</p>",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/landmark.barstoolsports.net/pat-mcafee-show/pms105final.mp3",
            "categories": [
                "Talk Radio"
            ]
        },
        {
            "title": "PMS 104 - Thunderstruck Waterfall",
            "datePublished": "Fri, 08 Dec 2017 07:00:00 GMT",
            "description": "<p>On today's show, Pat and Shaun remember Pearl Harbor, discuss who they think will win the Heisman trophy, and wonder if the Browns will ever be good again. Pat also delivers his NFL locks of the week, and as always, we give you some bangerz to throw on your playlist to help set the mood this weekend. Let us help you start your weekend the right way. Come laugh with us, cheers.</p>",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/landmark.barstoolsports.net/pat-mcafee-show/pms104final.mp3",
            "categories": [
                "Talk Radio"
            ]
        },
        {
            "title": "PMS 103 - AJ Hawk: Dad Of The Year",
            "datePublished": "Thu, 07 Dec 2017 07:30:00 GMT",
            "description": "<p>On today's show, Pat and Shaun discuss the aftermath of the bloodbath that was Steelers vs. Bengals, how gritty people moving to California during the gold rush were, how electric The Rock's promo's would be if he ran for president, Dog the Bounty Hunter's exploits in Hawaii, and some of their favorite Christmas movies. Later, AJ Hawk joins Pat and Shaun for one of the most hilarious conversations you'll hear. They chat about some of the lies he tells his kids to scare them into doing the right thing, what he thinks about Ohio State narrowly missing out on the College Football Playoff, and the gift he sent Pat for Christmas (45:57). After the show, Spice Adams stops by for a bonus conversation live from a hotel lobby in New York to chat about his new TV show, The Great American Baking Show, talk about his new peacoat, and request a song or two (1:25:23). Come laugh with us. Cheers.</p>",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/landmark.barstoolsports.net/pat-mcafee-show/pms103final.mp3",
            "categories": [
                "Talk Radio"
            ]
        },
        {
            "title": "PMS 102 - The Punter Who Got Decleated",
            "datePublished": "Tue, 05 Dec 2017 07:00:00 GMT",
            "description": "<p>On today's show, Pat and Shaun discuss Time Magazine's candidates for ‘Person of the Year,' and whether or not Tiger is actually back. Jaguars punter, Brad Nortman, also joins the show to talk about his fake punt pass on Sunday, what it felt like getting decleated into next week on a PAT attempt, and how he spends his victory Monday's (40:51). Later, Tactical Digs stops by the studio to give his 40 second recap of everything that happened in the NFL, talk about twerking robots, and discuss how excited he is for college bowl season (01:03:24). It's a good one. Come laugh with us. Cheers.</p>",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/landmark.barstoolsports.net/pat-mcafee-show/pms102final.mp3",
            "categories": [
                "Talk Radio"
            ]
        },
        {
            "title": "PMS 101 - A Future HOFer And Some Bangers",
            "datePublished": "Fri, 01 Dec 2017 07:00:00 GMT",
            "description": "<p>On today's show, Pat is joined by Hall of Fame finalist, Isaac Bruce, for an incredible interview. They discuss what it was like playing for the Greatest Show on Turf, how many yards he thinks he would have in today's NFL, and what his potential Hall of Fame party will be like (14:43). Also included are Pat's NFL locks of the week, and Spice Adams joining Pat and Shaun in studio for one of the most electric renditions of weekend bangers that you will ever hear (44:00). Come laugh with us and let us help you start your weekend the right way. Cheers.</p>",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/landmark.barstoolsports.net/pat-mcafee-show/pms101final.mp3",
            "categories": [
                "Talk Radio"
            ]
        },
        {
            "title": "PMS 100 - We Made It To One Hundo",
            "datePublished": "Thu, 30 Nov 2017 07:00:00 GMT",
            "description": "<p>Today's show is a special one. The guys from Pardon My Take and Heartland Radio join Pat to help celebrate hitting the century mark. They have a hilarious conversation about Pat and Shaun's 11 hour bus ride from New York to Indianapolis with the PMT crew, Big Cat and Pat's first interactions with one another, PFT Commenter's incredible song writing chops, what the proper technique for wiping after taking a dump is, and a preview of some of the stuff Barstool Heartland and Pardon My Take will be doing this week. It's a great time. Come laugh with us. Cheers.</p>",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/landmark.barstoolsports.net/pat-mcafee-show/pms100final.mp3",
            "categories": [
                "Talk Radio"
            ]
        },
        {
            "title": "PMS 099 - Live From New York",
            "datePublished": "Tue, 28 Nov 2017 07:00:00 GMT",
            "description": "<p>On today's show, Pat and Shaun are live from Barstool HQ in New York. They chat about the aftermath of last night's Cyber Monday telethon, discuss what is going on in the NFL, dive in to the psyche of internet porn commenters, and are joined by a special guest to decide what Shaun will be cooking on this week's 20 Dollar Chef. Later, Pat is joined by Steelers kicker, Chris Boswell, coming off a game winning field goal on Sunday night. They have a great conversation about his pre-kick ritual, what his night life is like during the season, and how Mike Tomlin loves talking sh*t to him (30:07). It's a great time. Come laugh with us, cheers.</p>",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/landmark.barstoolsports.net/pat-mcafee-show/20171127pms099final.mp3",
            "categories": [
                "Talk Radio"
            ]
        },
        {
            "title": "PMS 098 - Thanksgiving Celebration",
            "datePublished": "Thu, 23 Nov 2017 07:00:00 GMT",
            "description": "<p>On today's show, Pat and Shaun are joined by Spice Adams back in his minivan to help celebrate Thanksgiving. They chat about how Spice is handling his kids being off school, what his Thanksgiving menu is looking like and how to properly cook a turkey, and a possible upcoming collaboration with the 20 Dollar Chef (16:41). Later, the Heartland Radio crew stops by to talk about their Thanksgiving plans, and what they're thankful for (39:51). To close out the show, Pat selects a couple of bangerz to throw on your Thanksgiving playlist, and reflects on what he's thankful for. Come laugh with us. Cheers, and Happy Thanksgiving.</p>",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/landmark.barstoolsports.net/pat-mcafee-show/pmsthanksgivingfinal.mp3",
            "categories": [
                "Talk Radio"
            ]
        },
        {
            "title": "PMS 097 - Selfies With Stevie Wonder",
            "datePublished": "Tue, 21 Nov 2017 07:00:00 GMT",
            "description": "<p>On today's show, the 20 Dollar Chef, Shaun Latham, and Tactical Digs join Pat in studio to chat about some topical news stories. Shaun also gives a sneak peek of this week's 20 Dollar Chef meal, and Digs returns for another electric 40 second breakdown of everything that happened in the NFL. Pat is also joined by comedian Nick Thune, who chats about his recent movie premiere with Usher, taking pictures with Stevie Wonder, and what he does on a daily basis (46:15). Later, Dan Orlovsky stops by for a hilarious conversation including some of Dan's most miserable Thanksgiving memories playing football, some hysterical Matt Prater antics, and the least athletic teammate he's ever had (1:20:14). Come laugh with us. Cheers.</p>",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/landmark.barstoolsports.net/pat-mcafee-show/pms097final.mp3",
            "categories": [
                "Talk Radio"
            ]
        },
        {
            "title": "PMS 096 - I See Dead People",
            "datePublished": "Fri, 17 Nov 2017 06:00:00 GMT",
            "description": "<p>On today's show, Pat is joined in studio by Vibbs and Tactical Digs to help recap the week. Topics include Pat's time between the pipes playing goalie against the Indianapolis Fuel, the time Pat was profiled for driving a black Escalade with 24's, and what national holidays you may have missed this week. As always, Pat gives his locks of the week, and the guys give you their selections for your weekend bangerz playlist. To close out the show, Pat sits down for an interview with Hollywood star Haley Joel Osment, whose credits include The 6th Sense, The Entourage Movie, and Silicon Valley. They chat about what it's been like being in the movie industry for 25 years, how he's navigating the current issues in Hollywood, how he's handling being a Giants fan this season, and his new film, ‘Almost Friends' (1:12:22). Come laugh with us and let us help send you into the weekend. It's a fantastic time. Cheers.</p>",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/landmark.barstoolsports.net/pat-mcafee-show/pms096final.mp3",
            "categories": [
                "Talk Radio"
            ]
        },
        {
            "title": "PMS 095 - My Father, Tim",
            "datePublished": "Thu, 16 Nov 2017 05:30:00 GMT",
            "description": "<p>On today's show, Pat is joined by the 20 Dollar Chef, Shaun Latham, who gives everyone a quick geography lesson, and asks the age old question, ‘Can we live?' World News Nick also stops in the studio to give a long awaited Kim Jong Update, and tell us exactly what is going on in North Korea. Later, Pat is joined by his father, Tim, for one of the most incredible conversations you'll ever hear. They discuss Pat's phone call to Tim when Pat was involved in an alleged swimming incident, the time they went hunting together and Pat had to drag a deer 5 miles through mountainous terrain, and the night Tim spent slamming beers with Archie Manning (46:57). Also joining the show is NASCAR superstar Kurt Busch, who educates Pat on the sport of polo, and talks about how confident he is in his Mario Kart abilities (1:29:35). After the show, Jon and Brian of the new Mythbusters stop by to chat with Pat about some of their favorite experiments, what they do in their free time, and what we can expect from this season of Mythbusters in a bonus interview (1:40:10). Come laugh with us. Cheers.</p>",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/landmark.barstoolsports.net/pat-mcafee-show/pms095final.mp3",
            "categories": [
                "Talk Radio"
            ]
        },
        {
            "title": "PMS 094 - Colts General Manager Chris Ballard",
            "datePublished": "Tue, 14 Nov 2017 05:15:00 GMT",
            "description": "<p>On today's show, Indianapolis Colts General Manager Chris Ballard sits down with Pat for a conversation about what it's like being a GM in the NFL, how he's dealing with the current situation the Colts are facing, and what it was like hearing Pat retired on his first day on the job (18:26).  Pat is also joined by the 20 Dollar Chef, Shaun Latham, to chat about his 39th birthday and what's on the menu for this week's episode of 20 Dollar Chef. Later, Tactical Digs joins Pat and Shaun to give his 45 second recap of the NFL, and reminisces about how much better Facebook was when it first started. After the show, Pat sits down with actress, gamer, Youtube Red star and co-creator of the scripted comedy series 'Good Game,' Michele Morrow, to discuss the culture of gaming, the underworld black market of video games, and Robert Kraft and A-Rod's Esports teams in a bonus interview. It's a good one. Come laugh with us. Cheers.</p><p> </p><p>Thanks to our Sponsors: </p><p> </p><p>Omaha Steaks - For only $49.99, you can get my Family Gift Pack when you go to OmahaSteaks.com and enter my code PAT in the search bar – That's 75% off!</p><p> </p><p>Seat Geek - Download the SeatGeek app and enter promo code PAT for $10 off your first SeatGeek purchase.</p><p> </p><p>Five Four Club - Go to FiveFourClub.com right now and enter promo code HEARTLAND – and they'll give you 50% off your first month's package plus a free pair of sunglasses.</p>",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/landmark.barstoolsports.net/pat-mcafee-show/pms094finalfinal.mp3",
            "categories": [
                "Talk Radio"
            ]
        },
        {
            "title": "PMS 093 - We Have A Good Time Here",
            "datePublished": "Fri, 10 Nov 2017 05:00:00 GMT",
            "description": "<p>On today's show, the guys from Heartland Radio join Pat to slam a couple of brews, react to the backlash from Digs hating biscuits and gravy,   and talk about Todd's personality changes while in boot camp. The guys also talk about their favorite moments of this week, and as always, give you a couple of bangerz to put on your weekend playlist. Pat also delivers his NFL locks of the week and sends you into the weekend with an incredible conversation with star of the Marvel series ‘Inhumans,' Anson Mount. They chat about his vaping prowess, his discussion with former Hawaii football coach June Jones about changing the culture there, creating an alien sign language, and what it's like being close personal friends with Xzibit (1:25:21). Start your weekend the right way, come laugh with us. Cheers.</p>",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/landmark.barstoolsports.net/pat-mcafee-show/pms093final.mp3",
            "categories": [
                "Talk Radio"
            ]
        },
        {
            "title": "PMS 092 - Send Nudes To Mark Zuckerberg",
            "datePublished": "Thu, 09 Nov 2017 05:30:00 GMT",
            "description": "<p>On today's show, Pat rants about some current events making waves in the news. He welcomes in Rams punter and For The Brand inaugural winner, Johnny Hekker to chat about the resurgence of the Rams in LA, Jared Goff's pregame playlists, and how he handles distractions in LA (16:09). Pat also sits down with 2015 Sprint Cup Series Champion and NASCAR superstar, Kyle Busch, for a convo involving a story about getting Steak N Shake together at 4 AM, Kyle's driving style, and his infamous fight with Joey Logano (50:00). Later, Pat sits down for an electric interview with The Source, Stu Feiner to chat about his career, betting philosophy, and what he does with his free time (1:11:54). After the show, the 20 Dollar Chef, Shaun Latham, stops in to tell a couple of hilarious stories about his time working as a corrections officer in Yuma, Arizona. It's a good one. Come laugh with us. Cheers.</p><p>Thanks to our sponsors:</p><p>HIMS - Do your future self a favor and try Hims TODAY! Go to For Hims.com/PAT</p><p>State &amp; Liberty - Go to stateandliberty.com and use code PAT at checkout to receive 10% off your first order</p><p>Leesa - Go to Leesa.com/Barstool today to receive an exclusive $100 off the Leesa Mattress - just for you Stoolies!</p>",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/landmark.barstoolsports.net/pat-mcafee-show/pms092final.mp3",
            "categories": [
                "Talk Radio"
            ]
        },
        {
            "title": "PMS 091 - Marquette King, The Cougar Hunter",
            "datePublished": "Tue, 07 Nov 2017 05:30:00 GMT",
            "description": "<p>Pat recaps some of the major events that happened over the weekend. Pat also welcomes current punter of the Oakland Raiders, Marquette King for a hilarious conversation including his taste in women, and what he does to stay busy during games (1:01:21). Later, Pat sits down for a chat with one of the stars of 'Gotham,' and Indiana native, Drew Powell, to talk about what it's like currently being a Colts fan and what it was like to work with Bryan Cranston on 'Malcom in the Middle' (1:17:19). Come laugh with us. Cheers.</p>",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/landmark.barstoolsports.net/pat-mcafee-show/pms091final.mp3",
            "categories": [
                "Talk Radio"
            ]
        },
        {
            "title": "PMS 090 - A Magical Friday",
            "datePublished": "Fri, 03 Nov 2017 07:30:00 GMT",
            "description": "<p>Pat welcomes in the crew from Heartland Radio as the guys throw back a couple of beers and shoot the shit. AJ Hawk calls in from Seattle to join the guys as they chat about his play-by-play work, Halloween at the Hawk residence, and Pat performs AJ an exclusive magic trick (18:56). Pat also welcomes Corey Bellemore, the world record holder in the beer mile, as they talk about his training regimen, what it takes to run a fast beer mile, and conduct a little chug off. The guys finish off the pod by selecting their playlist bangers to send you into the weekend. Come laugh with us. Cheers.</p>",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/landmark.barstoolsports.net/pat-mcafee-show/pms090final.mp3",
            "categories": [
                "Talk Radio"
            ]
        },
        {
            "title": "PMS 089 - Dwight Freeney Is Not Good At Cornhole",
            "datePublished": "Thu, 02 Nov 2017 06:30:00 GMT",
            "description": "<p>On today's episode, Pat talks about the Conor McGregor interview getting pushed back, the Astros winning the world series, and discusses some current events in the news. Pat also welcomes former NFL quarterback and University of Kentucky legend, Jared Lorenzen. They chat about his time in college, the Indoor Football League, what his favorite nickname is, and The Lorenzen Project (37:17). Pat also welcomes former teammate, future Hall of Famer and current Seattle Seahawk, Dwight Freeney. They chat about his Sports Science comparison, his relationship with Michael Jordan, and games of cornhole in the locker room (01:06:03). #ComeLaughWithUs. Cheers.</p>",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/landmark.barstoolsports.net/pat-mcafee-show/pms_089_final.mp3",
            "categories": [
                "Talk Radio"
            ]
        },
        {
            "title": "PMS 088 - Juiced Balls",
            "datePublished": "Tue, 31 Oct 2017 05:45:00 GMT",
            "description": "<p>Pat welcomes Cincinnati Reds catcher, Tucker Barnhart, into the studio to chat about his journey to the MLB, and how juiced balls are impacting the World Series (25:49). Creator of the TBS show 'Drop the Mic,' Jensen Karp, joins the show to talk about his journey through the music industry, his relationship with Kanye West, and some of the big names he has worked with in his career (55:33). After the show, the 20 Dollar Chef, Shaun Latham stops in to talk about the grind of a stand up comedian, and gives a tease of this week's 20 Dollar Chef recipe in a bonus interview (01:32:14). Happy Halloween. Cheers.</p>",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/landmark.barstoolsports.net/pat-mcafee-show/pms_088_final.mp3",
            "categories": [
                "Talk Radio"
            ]
        },
        {
            "title": "PMS 087 - Oprah Winfrey is a Bartender",
            "datePublished": "Fri, 27 Oct 2017 06:30:00 GMT",
            "description": "<p>Tactical Digs sits down with Pat to talk about the slate of games this week in the NFL, while Pat delivers his locks of the week. Actor Omar J. Dorsey, one of the stars of the new film 'Thank You for Your Service' joins the show for an incredible conversation with Pat, as they chat about his friendship with Oprah and what it was like being a Falcons fan at the Super Bowl. (47:34) Pat ends the show with his playlist bangers to get your weekend jump started. Come laugh with us. Cheers.</p>",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/landmark.barstoolsports.net/pat-mcafee-show/pms087.mp3",
            "categories": [
                "Talk Radio"
            ]
        },
        {
            "title": "PMS 086 - The State of the Union: Barstool Sports",
            "datePublished": "Thu, 26 Oct 2017 06:00:00 GMT",
            "description": "<p>Pat is joined by the founder of Barstool Sports, Dave Portnoy, to discuss all the controversy, chaos, and war the pirate ship has been through the last week, and how he thrives while &quot;living in the mud.&quot; Country superstar Wheeler Walker Jr. joins Pat to talk about the current state of country music, play a couple of cuts off his new album, and debut a new song (28:26). Vernon Davis also stops by for a quick chat, and tells Pat about one of the more wild pregame rituals out there (1:12:53). Come laugh with us. Cheers.</p>",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/landmark.barstoolsports.net/pat-mcafee-show/pms086final.mp3",
            "categories": [
                "Talk Radio"
            ]
        },
        {
            "title": "PMS 085 - Live From Barstool Sports HQ",
            "datePublished": "Tue, 24 Oct 2017 06:30:00 GMT",
            "description": "<p>Pat heads to New York to check in at the Headquarters of Barstool Sports. He is joined by Vibbs and the 20 Dollar Chef, Shaun Latham, and also sits down for a chat with the advertising director at Barstool Sports, Louis Roberts. Pat also welcomes Oakland Raiders cornerback, TJ Carrie for an incredible conversation (35:10). Come laugh with us.</p>",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/landmark.barstoolsports.net/pat-mcafee-show/pms_085_finalfinal.mp3",
            "categories": [
                "Talk Radio"
            ]
        },
        {
            "title": "PMS 084 - 12 Hour Psychedelic Trip",
            "datePublished": "Fri, 20 Oct 2017 06:00:00 GMT",
            "description": "<p>Pat sits down for a chat with former NFL vet and current screenwriter/executive producer, Kerry Rhodes, for a conversation about his new film, and a wild experience he had with psychedlics in Costa Rica (4:25). Pat also welcomes former teammate Chris Gronkowski to discuss his recent appearance on Shark Tank, and what it's like being in business with A-Rod and Mark Cuban (27:11). Current Jacksonville Jaguars defensive end Calais Campbell joins the show to discuss the Jaguars hot start (48:20), and newest Barstool Heartland employee Buck Coltrain takes you into the weekend with a new tune (1:10:54). Come laugh with us.</p>",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/landmark.barstoolsports.net/pat-mcafee-show/pms_084_final.mp3",
            "categories": [
                "Talk Radio"
            ]
        },
        {
            "title": "PMS 083 - 12 Year NFL Vet Punked By Peyton Manning",
            "datePublished": "Thu, 19 Oct 2017 06:00:00 GMT",
            "description": "<p>Pat sits down with former teammate and 12 year NFL veteran, Dan Orlovsky, to discuss what it was like playing on an 0-16 team, and being Peyton Manning's backup (19:11). A fan of the show joins Pat to chat about his encounter with Big Foot (56:33), and Pat also welcomes Barstool Nate to discuss his recent destruction of a critic trying to sink the pirate ship (1:24:32).</p>",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/landmark.barstoolsports.net/pat-mcafee-show/pms_083finalfinal.mp3",
            "categories": [
                "Talk Radio"
            ]
        },
        {
            "title": "PMS 082 - Shane Lechler, Spice Adams, and AQ Shipley Stop By For A Good Time",
            "datePublished": "Tue, 17 Oct 2017 04:45:00 GMT",
            "description": "<p>Pat sits for a couple of incredible conversations with seven time Pro Bowler and current Houston Texans punter, Shane Lechler (23:34); former 49ers and Bears defensive tackle, Spice Adams (52:23); and recurring guest and current center of the Arizona Cardinals, AQ Shipley (1:18:27). Sit back and enjoy.</p>",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/landmark.barstoolsports.net/pat-mcafee-show/pms_082_final.mp3",
            "categories": [
                "Talk Radio"
            ]
        },
        {
            "title": "PMS 081 - John Daly Yourself Into The Weekend",
            "datePublished": "Fri, 13 Oct 2017 04:30:00 GMT",
            "description": "<p>Pat sits down with his good friend, John Daly. They discuss golf, music, football, and life in general. John Daly has been there and done that with literally everything. From gambling millions and millions of dollars away to winning a major championship. He's one of the most interesting humans to ever live. Laugh your way into the weekend.</p>",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/landmark.barstoolsports.net/pat-mcafee-show/pms081.mp3",
            "categories": [
                "Talk Radio"
            ]
        },
        {
            "title": "PMS 080 - The GOAT; Adam Vinatieri",
            "datePublished": "Thu, 12 Oct 2017 04:45:00 GMT",
            "description": "<p>4x Super Bowl Champ, 3X first-team All-Pro, and the most clutch athlete in the history of sports, Adam Vinatieri, sits down with Pat for a one-on-one conversation. They take a stroll down memory lane, discuss the Tuck Rule game, and chat about the current state of the NFL.</p>",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/landmark.barstoolsports.net/pat-mcafee-show/pms080.mp3",
            "categories": [
                "Talk Radio"
            ]
        },
        {
            "title": "PMS 079 - Charcandrick West ",
            "datePublished": "Tue, 10 Oct 2017 04:30:00 GMT",
            "description": "<p>Pat and the boys sit down with running back Charcandrick West from the undefeated Kansas City Chiefs to discuss his music career, philanthropy, and him sharting his pants at practice. The guys discuss Manning's big weekend, the Vice President, Governors, cocaine, Apple, sex island and more. </p>",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/landmark.barstoolsports.net/pat-mcafee-show/pms079charcandrickwest.mp3",
            "categories": [
                "Talk Radio"
            ]
        },
        {
            "title": "PMS 078 - Lock It Up ",
            "datePublished": "Fri, 06 Oct 2017 04:15:00 GMT",
            "description": "<p>Pat and the boys sit down and discuss their favorite Barstool Heartland moments while Vibbs relaxes after a hard week. Tactical Digs brings you the latest sports news while World News Nick delivers the latest breaking OJ news. </p>",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/landmark.barstoolsports.net/pat-mcafee-show/pms078deeptissuemassage.mp3",
            "categories": [
                "Talk Radio"
            ]
        },
        {
            "title": "PMS 077 - AyyyyQandA",
            "datePublished": "Thu, 05 Oct 2017 05:00:00 GMT",
            "description": "<p>Pat and the boys sit down and take questions from Pat McAfee Show fans on twitter. They discuss 80's music, porn, the world cup, drugs, the Band Slip Knot, and much more. Tactical Digs brings us the latest news in sports, World News Nick delivers the latest breaking news, and Vibbs unleashes a new game upon the world. </p>",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/landmark.barstoolsports.net/pat-mcafee-show/pms077qandayyy.mp3",
            "categories": [
                "Talk Radio"
            ]
        },
        {
            "title": "PMS 076 - Wednesday Special ",
            "datePublished": "Wed, 04 Oct 2017 04:00:00 GMT",
            "description": "<p>Pat kicks off the Podcast with a heartfelt speech about the nightmarish past few days. Pat and the boys try to return things to normal the best way they can, through comedy ... Tactical Digs fills us in on the latest sports news and World News Nick gives us the latest happenings around the world. Poor Todd is home sick with the flu, get well soon Todd.</p>",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/landmark.barstoolsports.net/pat-mcafee-show/pms076tribute.mp3",
            "categories": [
                "Talk Radio"
            ]
        },
        {
            "title": "PMS 075 - Friday Celebraish",
            "datePublished": "Fri, 29 Sep 2017 07:01:00 GMT",
            "description": "Get ready for the weekend and join Pat and the boys as celebrate Friday. They discuss going to the doctor, how worthless mosquitos are, Russel Wilson canceling, Playboy magazine, Pat and Digs NFL picks, and Pat's upcoming trip to Blacksburg for the Barstool Tailgate Show.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/landmark.barstoolsports.net/pat-mcafee-show/PMS075final.mp3",
            "categories": [
                "Talk Radio"
            ]
        },
        {
            "title": "PMS 074 - Bill Walton",
            "datePublished": "Thu, 28 Sep 2017 07:01:00 GMT",
            "description": "Pat and the boys sit down after a crazy week of Mariachi bands and exotic animals visiting the Heartland Studio to discuss the Rick Pitino drama, Mr. 305, Justin Timberlake, Flo-Rida, and special guest Bill Walton stops by the studio.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/landmark.barstoolsports.net/pat-mcafee-show/PMS074BillWalton.mp3",
            "categories": [
                "Talk Radio"
            ]
        },
        {
            "title": "PMS 073 - Dave Portnoy",
            "datePublished": "Tue, 26 Sep 2017 07:01:00 GMT",
            "description": "The founder of Barstool Sports, Dave Portnoy, joins Pat and the boys to discuss how El Presidente built Barstool Sports brick by brick,  horse racing, Patriots vs Colts, gambling, and the early days of Barstool Sports.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/landmark.barstoolsports.net/pat-mcafee-show/PMS073DavePortnoy-1.mp3",
            "categories": [
                "Talk Radio"
            ]
        },
        {
            "title": "PMS 072 - End of the World Party",
            "datePublished": "Fri, 22 Sep 2017 07:01:00 GMT",
            "description": "The end of the world is right around the corner so Pat and the boys have an end of the world party and discuss what they have accomplished with their lives and what they want to accomplish in the last 24 hours. The boys also get a special guest caller from heaven on the podcast.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/landmark.barstoolsports.net/pat-mcafee-show/PMS72Final-1.mp3",
            "categories": [
                "Talk Radio"
            ]
        },
        {
            "title": "PMS 071 - The End of the World",
            "datePublished": "Thu, 21 Sep 2017 07:01:00 GMT",
            "description": "The end of the world is supposedly this weekend, but that doesn't stop Pat and the boys from sitting down for a chat about the NFL with Arizona Cardinals offensive lineman, AQ Shipley. The boys talk aliens, trading jerseys, Eric Dickerson partying, and what Todd keeps in his room.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/landmark.barstoolsports.net/pat-mcafee-show/PMS71EndofTheWorld-1.mp3",
            "categories": [
                "Talk Radio"
            ]
        },
        {
            "title": "PMS 070 - AJ Hawk",
            "datePublished": "Tue, 19 Sep 2017 07:01:00 GMT",
            "description": "11 year NFL Vet and Laces Out co-host, AJ Hawk, skypes into the studio to chat with Pat and the boys about Ohio State, celebrating championships, and AJ's love for Aaron Rodgers. World News Nick gives us the latest breaking news, while Tactical Digs informs us about sports and moon sauce.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/landmark.barstoolsports.net/pat-mcafee-show/PMS070Final-1.mp3",
            "categories": [
                "Talk Radio"
            ]
        },
        {
            "title": "PMS 069 - Episode 69 (haha)",
            "datePublished": "Fri, 15 Sep 2017 07:01:00 GMT",
            "description": "Pat skypes into the studio from Cincinnati where he is recording NFL virtual reality segments for Intel. The boys learn a what an archipelago is, they discover Vibbs cant read, Tactical Digs gives us the latest sports news, World News Nick delivers breaking news, and Todd McComas takes us \"Behind the Badge\" with weird laws.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/landmark.barstoolsports.net/pat-mcafee-show/6969696.mp3",
            "categories": [
                "Talk Radio"
            ]
        },
        {
            "title": "PMS 068 - Jon Gruden",
            "datePublished": "Thu, 14 Sep 2017 07:01:00 GMT",
            "description": "Pat and the boys sit down for an interview with a man who absolutely rocketed a punt on Monday Night Football, Thomas Morstead. The Monday Night Football action doesn't stop there, Jon Gruden swings by the studio and sits in with the boys. Tactical Digs fills us in on the latest sports news, World News Nick gives us the latest world breaking news and has a meltdown due to too much Will Smith.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/landmark.barstoolsports.net/pat-mcafee-show/PMSJohnGrudenFINAL.mp3",
            "categories": [
                "Talk Radio"
            ]
        },
        {
            "title": "PMS 067 - St. Francisco Rams",
            "datePublished": "Tue, 12 Sep 2017 07:01:00 GMT",
            "description": "After the blowout loss to the LA Rams the Indianapolis Colts Head Coach, Chuck Pagano, is called in for an emergency press conference. Pat and the boys discuss Pat's trip to Ohio for Barstool Tailgate, Tactical Digs fills us in on the latest news from week 1 in the NFL, World News Nick brings us the latest breaking news, and Todd goes \"Behind The Badge\" to break down the police chase Pat was involved in.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/landmark.barstoolsports.net/pat-mcafee-show/PMSstFranciscoRams--1.mp3",
            "categories": [
                "Talk Radio"
            ]
        },
        {
            "title": "PMS 066 - Jerraud Powers",
            "datePublished": "Fri, 08 Sep 2017 07:01:00 GMT",
            "description": "Pat and the boys chat with retired NFL veteran Jerraud Powers about this upcoming football season and the Colts infamous fake punt against the Patriots. The guys discuss the package delivered to the office for Digs, Barstool's new tailgate show, what Pat looks for in a movie, Digs brings us the latest NFL stories, and World News Nick delivers breaking world news.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/landmark.barstoolsports.net/pat-mcafee-show/pms066JerraudPowers-1.mp3",
            "categories": [
                "Talk Radio"
            ]
        },
        {
            "title": "PMS 065 - Chase Rice",
            "datePublished": "Thu, 07 Sep 2017 07:01:00 GMT",
            "description": "Pat and the boys sit down for a chat with country superstar Chase Rice. They discuss Chase's college football career, the CMA's, Chase going to the DMZ in Korea, Pat's upcoming schedule, NFL updates from Tactical Digs, and the latest breaking news from World News Nick.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/landmark.barstoolsports.net/pat-mcafee-show/PMS065ChaseRiceFINALFINAL-1.mp3",
            "categories": [
                "Talk Radio"
            ]
        },
        {
            "title": "PMS 064 - No Luck",
            "datePublished": "Mon, 04 Sep 2017 07:01:00 GMT",
            "description": "Coming off of Labor Day weekend, Pat and the boys get right into it. They discuss Pat's dog coming home from camp, Vibb's going to the John Mayer concert, taking a bath, a special Chuck Pagano press conference, NFL updates from Tactical Digs, the latest breaking news from World News Nick, and much more on The Pat McAfee Show.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/landmark.barstoolsports.net/pat-mcafee-show/PMS064NoLuckFINAL-1.mp3",
            "categories": [
                "Talk Radio"
            ]
        },
        {
            "title": "PMS 063 - Green Screen Porn",
            "datePublished": "Fri, 01 Sep 2017 07:01:00 GMT",
            "description": "Pat and the boys sit down for a podcast to take you into the weekend. They discuss donuts, Voodoo, week 4 of the preseason, green screens, Tactical Digs gives you the latest NFL updates, World News Nick delivers the latest breaking news with a trip past the DMZ for a Jim Kong Update.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/landmark.barstoolsports.net/pat-mcafee-show/GreenScreenPorn-1.mp3",
            "categories": [
                "Talk Radio"
            ]
        },
        {
            "title": "PMS 062 - Vontae Davis Stops By",
            "datePublished": "Wed, 30 Aug 2017 07:01:00 GMT",
            "description": "Pat is fresh off the plane after visiting Hendrick Motorsports in Charolette North Carolina and he shares the details with the boys. Chuck Pagano and Vontae Davis stop by for a chat, Digs fills us in on what's going on in the NFL, World News Nick gives us the latest breaking international news, and high school Digs is exposed in Pat's final thought.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/landmark.barstoolsports.net/pat-mcafee-show/PMS-062_VontaeDavisStopsBy.mp3",
            "categories": [
                "Talk Radio"
            ]
        },
        {
            "title": "PMS 061 - Viral Superstar Kevin Huber",
            "datePublished": "Mon, 28 Aug 2017 07:01:00 GMT",
            "description": "Pat and the boys interview the man from Cincinnati who went viral after pulling off one of the silkiest football moves in Week 3's preseason matchup against Washington, Kevin Huber. Tactical Digs delivers the most recent sports news and World News Nick brings us the latest international news.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/landmark.barstoolsports.net/pat-mcafee-show/PMSKEVINHUBERFINAL.mp3",
            "categories": [
                "Talk Radio"
            ]
        },
        {
            "title": "PMS 060 - Chuck Pagano Press Conference",
            "datePublished": "Fri, 25 Aug 2017 07:01:00 GMT",
            "description": "Pat and the boys sit down and discuss all of the things Barstool Heartland has cooking, gun safety, Pat driving a Nascar, the titanic, sports news with Digs, \"Behind the Badge with Todd McComas, and we get surprise appearance from Chuck Pagano.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/landmark.barstoolsports.net/pat-mcafee-show/PMS60ChuckPaganoPressFINAL-1.mp3",
            "categories": [
                "Talk Radio"
            ]
        },
        {
            "title": "PMS 059 - The Man Who Took an $880,000 Bet",
            "datePublished": "Thu, 24 Aug 2017 07:01:00 GMT",
            "description": "Pat and the boys sit down for a conversation with a man who took an $880,000 bet on the McGregor vs Mayweather fight, Chris Andrews. They talk about the Bones Jones failed drug test, Tiger Woods dick pics, NBA trades, NFL week 1, and the boys take a trip past the DMZ for a Jim Kong update.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/landmark.barstoolsports.net/pat-mcafee-show/PMS059ENDFINAL-1.mp3",
            "categories": [
                "Talk Radio"
            ]
        },
        {
            "title": "PMS 058 - The Moon Cucks the Sun",
            "datePublished": "Tue, 22 Aug 2017 07:01:00 GMT",
            "description": "The moon cucks the sun and the whole country loses their minds. Your retina's may be burned but your ears are good to listen to Pat talk about his trip to Boston. Digs, Nick, and Vibbs talk about their trip to Pittsburgh while hitting on the biggest stories in sports and the world.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/landmark.barstoolsports.net/pat-mcafee-show/PMS058MoonCucksSun-1.mp3",
            "categories": [
                "Talk Radio"
            ]
        },
        {
            "title": "PMS 057 - We Have A Good Time Here",
            "datePublished": "Wed, 16 Aug 2017 07:01:00 GMT",
            "description": "Pat and the boys sit down for another late night recording at Heartland HQ. No stone goes unturned as every topic that could possibly be covered in a 2 hour window is covered. Pat once again teases the release of his new hit rap single RIP Sea Japan. Look for that to drop soon, and enjoy a good ass conversation among friends.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/landmark.barstoolsports.net/pat-mcafee-show/PMSLATE56-1.mp3",
            "categories": [
                "Talk Radio"
            ]
        },
        {
            "title": "PMS 055 - Tiger is LIT",
            "datePublished": "Tue, 15 Aug 2017 07:01:00 GMT",
            "description": "Welcome to the era of same day delivery for The Pat McAfee Show. Pat about flipping the rap game upside down, Todd McComas takes us \"Behind the Badge\", Tactical Digs gives us a sports update, and World News Nick delivers breaking news.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/landmark.barstoolsports.net/pat-mcafee-show/PMS-055-TigerIsLIT.mp3",
            "categories": [
                "Talk Radio"
            ]
        },
        {
            "title": "PMS 056 - Rashad Jennings",
            "datePublished": "Tue, 15 Aug 2017 07:01:00 GMT",
            "description": "Pat and the boys sit down for a chat with NFL running back and Dancing with the Stars Champion Rashad Jennings.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/landmark.barstoolsports.net/pat-mcafee-show/JENNINGSfinal.mp3",
            "categories": [
                "Talk Radio"
            ]
        },
        {
            "title": "PMS 054 - RIP to the Sea of Japan",
            "datePublished": "Mon, 14 Aug 2017 07:01:00 GMT",
            "description": "Thanks to 100 Retweets in less than a minute by the twitter faithful, here is a Monday edition of The Pat McAfee Show. Pat talks about his first time watching the Colts, we receive breaking news from World News Nick, and get the latest NFL news from Tactical Digs.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/landmark.barstoolsports.net/pat-mcafee-show/PMS-054-RIPSeaOfJapan.mp3",
            "categories": [
                "Talk Radio"
            ]
        },
        {
            "title": "PMS 053 - MMA Chat with Matt Mitrione",
            "datePublished": "Fri, 11 Aug 2017 07:01:00 GMT",
            "description": "A bonus episode of The Pat McAfee Show as two legendary badasses, Matt Mitrione and Chris \"Lights Out\" Lytle, crash the studio for an amazing chat about MMA. Enjoy the bonus episode. Cheers.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/landmark.barstoolsports.net/pat-mcafee-show/PMS-053-MMAchat.mp3",
            "categories": [
                "Talk Radio"
            ]
        },
        {
            "title": "PMS 052 - A Lot of Stories",
            "datePublished": "Thu, 10 Aug 2017 07:01:00 GMT",
            "description": "Pat and the boys sit down for another late night podcast with Bobby the Money guy. The boys cover everything from finances, ordering 500 shots at the bar, and the newly formed \"Little 3\" Basketball league. The group also takes you on a trip past the DMZ for a Jim Kong update.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/landmark.barstoolsports.net/pat-mcafee-show/PMS052480001.mp3",
            "categories": [
                "Talk Radio"
            ]
        },
        {
            "title": "PMS 051 - 20 Dollar Chef",
            "datePublished": "Tue, 08 Aug 2017 07:01:00 GMT",
            "description": "Pat and the boys sit down to podcast after eating an amazing meal prepared by the $20 Chef himself, Shaun Latham. The boys discuss the Dolphins signing Jay Cutler, the blind twin brother prank, Martavis Bryant being reinstated, and take a trip past the DMZ for a Jim Kong update.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/landmark.barstoolsports.net/pat-mcafee-show/PMS51EDITED-1.mp3",
            "categories": [
                "Talk Radio"
            ]
        },
        {
            "title": "PMS 050 - 50th Episode Celebration",
            "datePublished": "Thu, 03 Aug 2017 07:01:00 GMT",
            "description": "It's the 50th episode ... the boys celebrate with Conor Daly.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/landmark.barstoolsports.net/pat-mcafee-show/pmsGOLDEN.mp3",
            "categories": [
                "Talk Radio"
            ]
        },
        {
            "title": "PMS 049 - Tony Hinchcliffe",
            "datePublished": "Tue, 01 Aug 2017 07:01:00 GMT",
            "description": "Pat and the boys premiere the first episode from the new Heartland Studio. Comedian and Roast Master Tony Hinchcliffe calls in to talk about his upcoming tour and working with celebrities such as Snoop Dogg and Martha Stewart. Pat and the boys go past the DMZ for a Jim Kong update, and Pat gives us his game plan on playing soccer with U.S. legend Tim Howard.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/landmark.barstoolsports.net/pat-mcafee-show/PMS-049Hinchcliffe.mp3",
            "categories": [
                "Talk Radio"
            ]
        },
        {
            "title": "PMS 048 - Diamond Dallas Page",
            "datePublished": "Thu, 27 Jul 2017 07:01:00 GMT",
            "description": "BANG! Diamond Dallas Page joins Pat and the boys and talks DDP Yoga, taking on Brock Lesner in the ring, Jake the Snake, and DDP's acting career. The boys fill pat in on the worst concert of all time, Pat gives his take on the most recent CTE study, Degenerate Digs gives his NFL week 1 gambling picks, and Todd takes us \"Behind The Badge\" with a real life horror story.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/landmark.barstoolsports.net/pat-mcafee-show/PMS048DDP-1.mp3",
            "categories": [
                "Talk Radio"
            ]
        },
        {
            "title": "PMS 047 - Travis Pastrana",
            "datePublished": "Tue, 25 Jul 2017 07:01:00 GMT",
            "description": "Extreme/action sports icon Travis Pastrana joins the show and Pat attempts to find out what Travis is truly afraid of. The guys talk about the best show on tv (Game of Thrones) and the worst show on tv (Michael Phelps Races a Shark). Pat goes to the movie Dunkirk and throws a carnival for his ladies birthday. The boys also take a trip past the DMZ for a Jim Kong update.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/landmark.barstoolsports.net/pat-mcafee-show/PMS047TravisP-1.mp3",
            "categories": [
                "Talk Radio"
            ]
        },
        {
            "title": "PMS 046 - Life Advice From A Pro Bookie",
            "datePublished": "Thu, 20 Jul 2017 07:01:00 GMT",
            "description": "One of the best bookies in Las Vegas, Chris Andrews calls into the show to shed some light on the gambling industry. Not only is this podcast filled with great gambling advice, but Pat and the boys  dish out cant miss life advice on texting and driving, sexual intercourse, catching punted balls, police search warrants, and more. The boys also take a trip past the DMZ and get a Jim Kong update.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/landmark.barstoolsports.net/pat-mcafee-show/PMS046LifeAdviceFrom.mp3",
            "categories": [
                "Talk Radio"
            ]
        },
        {
            "title": "PMS 045 - Bruce Arians",
            "datePublished": "Tue, 18 Jul 2017 07:01:00 GMT",
            "description": "Arizona Cardinals coach Bruce Arians joins Pat and the guys to discuss his reputation as a player's coach, his respect for Andrew Luck, running up the score, and his relationship with Ben Rothlisberger. Pat and the boys also discuss the Game of Thrones premiere, R. Kelly's legal trouble, Tim Tebow dominating the minors, and we take a trip past the DMZ for a Jim Kong update.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/landmark.barstoolsports.net/pat-mcafee-show/PMS_045BruceArians.mp3",
            "categories": [
                "Talk Radio"
            ]
        },
        {
            "title": "PMS 044 - Fitness Gurus",
            "datePublished": "Thu, 13 Jul 2017 07:01:00 GMT",
            "description": "Pat and the boys sit down and discuss the new HBO show \"The Defiant Ones\", the McGregor vs Mayweather press conference, the legend of Wild Bill Hickok, and they chat with two of the most successful serial entrepreneurs in fitness, John Fosco and Cory Gregory.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/landmark.barstoolsports.net/pat-mcafee-show/PMS044.mp3",
            "categories": [
                "Talk Radio"
            ]
        },
        {
            "title": "PMS 043 - Hot Tub AIDS",
            "datePublished": "Tue, 11 Jul 2017 07:01:00 GMT",
            "description": "Pat and the boys sit down and recap their 4th of July weekend at the Greenbrier with John Daly, who had sex in a hot tub this weekend, Nick and Digs becoming dads to Sugar Gliders, Todd McComas gives us a glance behind the badge, and we take a trip past the DMZ to get an update on old buddy Jim Kong.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/landmark.barstoolsports.net/pat-mcafee-show/PMS043HotTubAIDS-1.mp3",
            "categories": [
                "Talk Radio"
            ]
        },
        {
            "title": "PMS 042 - John Daly at the Greenbrier",
            "datePublished": "Thu, 06 Jul 2017 07:01:00 GMT",
            "description": "Pat and the boys recorded this episode on the tour bus of a living legend, John Daly. Pat and John talk about being partners in the PGA tour Pro-AM at the Greenbrier, chocolate milk, living on a boat, surgeries, the White House, and going to the casino. Todd also takes us on a quick trip \"Behind the Badge\".",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/landmark.barstoolsports.net/pat-mcafee-show/JohnDaly-1.mp3",
            "categories": [
                "Talk Radio"
            ]
        },
        {
            "title": "PMS 041 - America's Birthday",
            "datePublished": "Tue, 04 Jul 2017 07:01:00 GMT",
            "description": "Pat and the boys are back from vacation and ready to celebrate America's Birthday. The guys talk about their vacations and how good it is to be back in the good old US of A, Trump's unprecedented presidential GIF, getting your twitter hacked like Jim Irsay, and Todd takes us \"Behind the Badge\".",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/landmark.barstoolsports.net/pat-mcafee-show/PMS-41_AmericasBirthdayFINALFINALFINAL-1.mp3",
            "categories": [
                "Talk Radio"
            ]
        },
        {
            "title": "PMS 040 - Behind The Badge",
            "datePublished": "Thu, 29 Jun 2017 07:01:00 GMT",
            "description": "This episode is 1 hour and 48 minutes of Behind The Badge.  It's hosted by Todd McComas and co-hosted by comedian Jeff Vibbert, U.S. Army veteran Ryan Cauley and firefighter / UFC legend Chris \"Lights Out\" Lytle.  The last 45 minutes of this episode features special guests Marty Dulworth and Joe Garrett.  Marty and Joe are brothers that are both police officers for the city of Anderson, IN.  Marty and Joe tell the crew the most intense story of courage, comradery, fortitude and sense of duty ever told.  A story about how \"just another shift\" left Marty and his canine \"Kilo\" in a terrifying battle for their lives and left Joe in a desperate race to find his younger brother and get him out of harm's way.  If this story doesn't move you, you don't have a pulse.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/landmark.barstoolsports.net/pat-mcafee-show/PMS-40_BehindTheBadgeFINALFINAL-1.mp3",
            "categories": [
                "Talk Radio"
            ]
        },
        {
            "title": "PMS 039 - Billy Buck Roscoe",
            "datePublished": "Tue, 27 Jun 2017 07:01:00 GMT",
            "description": "Pat and the boys are joined by Billy Buck Roscoe, a man who loves two things; his country and drinking beer. Billy Buck's drinking videos have made him an internet sensation, but his tales of sex and patriotism on this podcast will make him a legend.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/landmark.barstoolsports.net/pat-mcafee-show/PMS_039-BillyBuckRoscoeFINAL-1.mp3",
            "categories": [
                "Talk Radio"
            ]
        },
        {
            "title": "PMS 038 - Adam Vinatieri",
            "datePublished": "Thu, 22 Jun 2017 07:01:00 GMT",
            "description": "Pat and the boys sit down with the greatest kicker in the history of the National Football League, Adam Vinatieri, and discuss the ins and outs of a living legend's career.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/landmark.barstoolsports.net/pat-mcafee-show/VINATIERIFINALFINALFINAL.mp3",
            "categories": [
                "Talk Radio"
            ]
        },
        {
            "title": "PMS 037 - Pat Phones It In",
            "datePublished": "Tue, 20 Jun 2017 07:01:00 GMT",
            "description": "Pat phones into the studio from high society Connecticut to tell the boys all about his first morning on NBC Sports Pro Football Talk with Mike Florio. The boys recap their $1,000 bar tab, Paul George leaving Indy, foreign drama, and go \"Behind the Badge\" with Todd.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/landmark.barstoolsports.net/pat-mcafee-show/PMS-037PatPhonesItInFINALFINALFINAL.mp3",
            "categories": [
                "Talk Radio"
            ]
        },
        {
            "title": "PMS 036 - The Greatest Original Movie Ever Written",
            "datePublished": "Thu, 15 Jun 2017 07:01:00 GMT",
            "description": "Pat and the boys sit down for a ridiculous interview with Stanley Cup Champion, Ian Cole, from the middle of the Penguin's championship parade. Pat plants a seed for an amazing original movie and the boys water it until it blooms into the greatest original movie ... ever created.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/landmark.barstoolsports.net/pat-mcafee-show/PMS-036_GreatestMovieEverWritten.mp3",
            "categories": [
                "Talk Radio"
            ]
        },
        {
            "title": "PMS 035 - Stanley Cup Celebration",
            "datePublished": "Tue, 13 Jun 2017 07:01:00 GMT",
            "description": "The Pittsburgh Penguins are \"back to back\" Stanley Cup Champs! Pat and the boys celebrate by having the voice of Pittsburgh, Mark Madden, on the podcast with a special guest appearance by Pen's superfan, AQ Shipley. Digs tells us about his interesting Uber experience, Todd takes us \"Behind the Badge\", and Nick takes us on a trip past the DMZ for a JimKong update.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/landmark.barstoolsports.net/pat-mcafee-show/PMS-035StanleyCup-1.mp3",
            "categories": [
                "Talk Radio"
            ]
        },
        {
            "title": "PMS 034 - Rip Rodgers",
            "datePublished": "Thu, 08 Jun 2017 07:01:00 GMT",
            "description": "Rip Rodgers is a wrestling legend and a man without a filter. Rip tells Pat and the boys everything about wrestling and life; in the most raw interview to ever hit the Pat McAfee Show. Todd McComas takes us \"Behind the Badge\". The boys get a visit from the next president of The United States, and the gang goes on a trip past the DMZ for a Jim Kong update.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/landmark.barstoolsports.net/pat-mcafee-show/PMS-034_RipRodgersFINALCUT.mp3",
            "categories": [
                "Talk Radio"
            ]
        },
        {
            "title": "PMS 033 - Michael Waltrip",
            "datePublished": "Tue, 06 Jun 2017 07:01:00 GMT",
            "description": "Two time Daytona 500 winner and Fox Nascar analyst Michael Waltrip calls in and answers the question everyone wants to know about racing. The gang discusses going to the zoo, Pat's wrestling training, the NHL and NBA playoffs, players fighting coaches, and the Kathy Griffin drama. The boys also take a trip past the DMZ and get a Jim Kong Update.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/landmark.barstoolsports.net/pat-mcafee-show/PMS-033_MichaelWaltripFINALFINALFINAL-1.mp3",
            "categories": [
                "Talk Radio"
            ]
        },
        {
            "title": "PMS 032 - Paul Bissonnette",
            "datePublished": "Thu, 01 Jun 2017 07:01:00 GMT",
            "description": "\"BizNasty\" Paul Bissonnette joins the show to talk Stanley Cup Finals and his NHL career. Pat accepts a challenge from his mother to donate $ to charity every time he swears on the show. Todd takes everyone Behind The Badge on his experiences with bribes. Other topics include Tiger Woods DUI, Jim Kong's new iPad, and a font to indicate sarcasm.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/landmark.barstoolsports.net/pat-mcafee-show/PMS-032_BizNastyFINALCUT.mp3",
            "categories": [
                "Talk Radio"
            ]
        },
        {
            "title": "PMS 031 - The Greatest Spectacle in Racing",
            "datePublished": "Tue, 30 May 2017 07:01:00 GMT",
            "description": "Pat and crew present their final show from the Indy 500 infield in dire conditions of what is left of #CampHeartland. The recap of the previous week provides insight into meeting the drivers, the events of the race, and the ridiculous party atmosphere at the track. A Jim Kong update and the Tiger Woods arrest are discussed as well.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/landmark.barstoolsports.net/pat-mcafee-show/PMS-031_Indy500RecapFINALEDITCLEAN.mp3",
            "categories": [
                "Talk Radio"
            ]
        },
        {
            "title": "PMS 030 - Conor Daly",
            "datePublished": "Thu, 25 May 2017 07:01:00 GMT",
            "description": "Pat and the boys sit down with a man who knows more about rockets than Jim Kong, Indy car driver; Conor Daly. Pat asks the hard hitting questions we all want to know about Indy car drivers. Strap yourself in and feel the G's.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/landmark.barstoolsports.net/pat-mcafee-show/PMS-030_ConorDaly.mp3",
            "categories": [
                "Talk Radio"
            ]
        },
        {
            "title": "PMS 029 - Hot, Nasty Speed",
            "datePublished": "Tue, 23 May 2017 07:01:00 GMT",
            "description": "Pat and the boys come to you LIVE from their RV in the Indy 500 infield with everything you need to know about the Indianapolis Motor Speedway. The crew talks about bowing to the queen, dueling, driverless cars, gods, and how god awful Will Smith is at acting. We also go \"Behind the Badge\" and take a trip past the DMZ for a Jim Kong update.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/landmark.barstoolsports.net/pat-mcafee-show/PMS-029_HotNastySpeed.mp3",
            "categories": [
                "Talk Radio"
            ]
        },
        {
            "title": "PMS 028 - Buck Coltrain, Country Superstar",
            "datePublished": "Thu, 18 May 2017 07:01:00 GMT",
            "description": "This episode features our first live music performance from country superstar Buck Coltrain. Pat and the boys talk about the upcoming week at the Indy 500. Also, the crew teaches us about history, science, dolphins, and the male romper. Todd takes you \"Behind the Badge\" and we take a trip past the DMZ to North Korea for a Jim Kong update.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/landmark.barstoolsports.net/pat-mcafee-show/PMS-028_BuckColtrain.mp3",
            "categories": [
                "Talk Radio"
            ]
        },
        {
            "title": "PMS 027 - Slept at John Daly's House",
            "datePublished": "Tue, 16 May 2017 07:01:00 GMT",
            "description": "Pat, Nick, and Digs went balls deep in the meat of Arkansas to spend the weekend with golf legend and American icon John Daly. Meanwhile Todd stayed home in Indianapolis and headlined a comedy show. Jim Kong makes a visit and we take a trip \"Behind the Badge\".",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/landmark.barstoolsports.net/pat-mcafee-show/PMS-027_DailySleepover.mp3",
            "categories": [
                "Talk Radio"
            ]
        },
        {
            "title": "PMS 026 - Detroit Recap",
            "datePublished": "Thu, 11 May 2017 07:01:00 GMT",
            "description": "Pat heads off to the magical land of Detroit where he learns about amperands and Chinese culture. Nick and Digs finalize names for their Sugar Gliders, while Todd takes us \"Behind The Badge\". The crew also takes us on a trip past the DMZ for a Jim Kong update.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/landmark.barstoolsports.net/pat-mcafee-show/PMS-026_DetroitRecap.mp3",
            "categories": [
                "Talk Radio"
            ]
        },
        {
            "title": "PMS 025 - The Haunted Basement",
            "datePublished": "Tue, 09 May 2017 07:01:00 GMT",
            "description": "Pat McAfee Show's first recording in the new temporary studio (Pat's basement). Today's guest was former NFL linebacker, Kamerion Wimbley, who will be featured on next season of MTV's Challenge: Champs vs Pros. Digs and Nick discuss getting new pets. Pat and the boys reminisce on television shows they watched as kids, recap the Kentucky Derby, and talk BBB Shoes. Todd takes us Behind The Badge.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/landmark.barstoolsports.net/pat-mcafee-show/PMS025TheHauntedBasement.mp3",
            "categories": [
                "Talk Radio"
            ]
        },
        {
            "title": "PMS 024 - Jerome Bettis",
            "datePublished": "Thu, 04 May 2017 07:01:00 GMT",
            "description": "Pat's birthday surprise kid napping, hearing the future, Japan talk, upcoming fights, game shows, Pat's cruise ship offer, Digs' brain, Behind the Badge, jersey chasers, Colts team stories, Pat's NBA rebound average, ADD sports, Jerome Bettis calls, t-shirt previews, future of medicine, Pat's TV reviews,  #JimKong update.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/landmark.barstoolsports.net/pat-mcafee-show/PMS024-JeromeBettis.mp3",
            "categories": [
                "Talk Radio"
            ]
        },
        {
            "title": "PMS 023 - Mike Florio",
            "datePublished": "Tue, 02 May 2017 07:01:00 GMT",
            "description": "First we celebrate Pat's 30th Birthday!  Then on to Todd's story of gulping down a glass of box wine, Pat will die young, Purdue show announced for Sept. 23, 2017.  The boys are impressed with Serena Williams winning while pregnant.  Then cat talk, Lavar Ball, shoe deals, way-too-much Canada talk, Digs' brain, Noah is Pat's OG.  Mike Florio from ProFootballTalk joins us.  Mountain climbing deaths, Fyre Festival disaster, #JimKong update.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/landmark.barstoolsports.net/pat-mcafee-show/PMS023-MikeFlorio.mp3",
            "categories": [
                "Talk Radio"
            ]
        },
        {
            "title": "PMS 022 - Draft Weekend Memories",
            "datePublished": "Thu, 27 Apr 2017 07:01:00 GMT",
            "description": "Digs finds vindication within the Hernandez suicide, Achilles talk, Pat learns about Batman, Pat relives his draft weekend back in 2009, Pat divulges his amazing TD celebration that never happened.  Jeter buys the Marlins, ESPN layoffs, Skip Bayless and Fox Sports.  #JimKong update, wild boars, Pat has yet another ISIS rant and Ice Beer.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/landmark.barstoolsports.net/pat-mcafee-show/PMS022.mp3",
            "categories": [
                "Talk Radio"
            ]
        },
        {
            "title": "PMS 021 - Super Bowl Champ Chris Long",
            "datePublished": "Tue, 25 Apr 2017 07:01:00 GMT",
            "description": "First a Pittsburgh trip recap, getting pulled over stories and Pat has something to say about the reporter/Westbrook incident.  Pat then gets punched in the face.  Super Bowl Champ Chris Long calls.  #JimKong update, Bitcoins and Banks, and Pat rants on terrible food/service.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/landmark.barstoolsports.net/pat-mcafee-show/PMS021-ChrisLong.mp3",
            "categories": [
                "Talk Radio"
            ]
        },
        {
            "title": "PMS 020 - Heartland",
            "datePublished": "Thu, 20 Apr 2017 07:01:00 GMT",
            "description": "The boys speculate A LOT about the death of Aaron Hernandez, get upset over the Adidas gaffe (but are willing to fix it).  Pat gets very upset over a bald eagle shooting and ups the $$ for a tip leading to the guilty idiot.  Pat also does a voiceover for a porno.  \"What if Digs were a dictator?\" and of course, A Kim Jung Un Update.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/landmark.barstoolsports.net/pat-mcafee-show/PMS-020_Heartland.mp3",
            "categories": [
                "Talk Radio"
            ]
        },
        {
            "title": "PMS 019 - Ryan Whitney",
            "datePublished": "Tue, 18 Apr 2017 10:01:00 GMT",
            "description": "This episode features a phone interview with Ryan Whitney.  Ryan is a former NHL Defenseman, an NHL Analyst and the host of the hit podcast \"Spittin' Chiclets\" presented by Barstool Sports.  Pat and the boys also caught up with their \"6th Man\" Kim Jong Un and talked a little sports and world news.  This episode also features a Behind the Badge segment.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/landmark.barstoolsports.net/pat-mcafee-show/PMS019-Ryan_Whitney.mp3",
            "categories": [
                "Talk Radio"
            ]
        },
        {
            "title": "PMS 018 - Steve Weatherford",
            "datePublished": "Thu, 13 Apr 2017 07:01:00 GMT",
            "description": "Fellow former NFL punter, Steve Weatherford joins Pat and the boys in NYC.  They discuss who is more America, they also recall Pat intimidating Steve during pre-game warmups, driving around the Indy 500 track with a Mario.  Michael Cohen calls to promote the show on the show. Tebow talk and out-hustling the hustlers.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/landmark.barstoolsports.net/pat-mcafee-show/PMS018-SteveWeatherford.mp3",
            "categories": [
                "Talk Radio"
            ]
        },
        {
            "title": "PMS 017 - Gary Vaynerchuk",
            "datePublished": "Wed, 12 Apr 2017 07:01:00 GMT",
            "description": "Pat and the boys are still at Barstool HQ in NYC... Pat still hates NYC, but it's growing on him.  Entrepreneur and motivator, Gary Vaynerchuk joins us and brings the heat.  We talk motivation, execution, hustling, football and more.  Plus he challenges you to support #1PagePat and if you have ANY question for the guys, use #PatandGary",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/landmark.barstoolsports.net/pat-mcafee-show/PMS017-GaryVaynerchuk.mp3",
            "categories": [
                "Talk Radio"
            ]
        },
        {
            "title": "PMS 016 - Chaps",
            "datePublished": "Tue, 11 Apr 2017 07:01:00 GMT",
            "description": "Pat and the boys are in Barstool HQ in NYC.  Pat hates NYC, but he doesn't hate speaking with one of his favorite co-workers, Chaps from the Zero Blog Thirty podcast.  Stay for the entire episode because Chaps ends with an epic story of the day he was injured in battle and pays tribute to his brothers in arms.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/landmark.barstoolsports.net/pat-mcafee-show/PMS016-Chaps.mp3",
            "categories": [
                "Talk Radio"
            ]
        },
        {
            "title": "PMS 015 - For The People",
            "datePublished": "Thu, 06 Apr 2017 07:01:00 GMT",
            "description": "Pat and the boys talk a lot about Kim Jong-Un, the NHL's efforts to deny players the opportunity to represent their country in the Olympic Games, and Pat's plan to get in peak physical condition now that he's out of the NFL.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/landmark.barstoolsports.net/pat-mcafee-show/PMS015-ForThePeople.mp3",
            "categories": [
                "Talk Radio"
            ]
        },
        {
            "title": "PMS 014 - Stephen Jackson",
            "datePublished": "Wed, 05 Apr 2017 07:01:00 GMT",
            "description": "This episode features an amazing interview with retired NBA player Stephen Jackson.  Jackson had an illustrious 14 year career and is regarded by many as one the best players to never be voted to an All-Star roster.  He was a major contributor to the San Antonio Spurs' NBA Championship in 2003 and is now focusing on his career as an analyst with ESPN and a future in coaching.  As usual, Pat and the boys also talked a little sports, world news and they caught up with their boy Kim Jong-Un.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/landmark.barstoolsports.net/pat-mcafee-show/PMS014-StephenJackson.mp3",
            "categories": [
                "Talk Radio"
            ]
        },
        {
            "title": "PMS 013 - New York Hangover",
            "datePublished": "Tue, 04 Apr 2017 07:01:00 GMT",
            "description": "Pat and the boys recap their quick trip to New York to party with \"El Pres\" and the gang.  They absolutely killed themselves so they were still recovering from the damage of Saturday night.  They talked a little sports, they talked a little world news and they caught up with their boy Kim Jong-Un.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/landmark.barstoolsports.net/pat-mcafee-show/PMS013.mp3",
            "categories": [
                "Talk Radio"
            ]
        },
        {
            "title": "PMS 012 - Happy Birthday Tactical Digs",
            "datePublished": "Thu, 30 Mar 2017 07:01:00 GMT",
            "description": "Our boy Tactical Digs turned 29! Pat and the boys talked sports, covered some world news, checked in on Kim Jong-Un, Pat conveyed a heartfelt message to the fans of his show and Barstool Indy, and then wrapped things up with Behind The Badge.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/landmark.barstoolsports.net/pat-mcafee-show/PMS012.mp3",
            "categories": [
                "Talk Radio"
            ]
        },
        {
            "title": "PMS 011 - John Daly",
            "datePublished": "Wed, 29 Mar 2017 07:01:00 GMT",
            "description": "PGA legend John Daly was our guest.  John hits it hard man and Pat is his biggest fan.  They had a legendary conversation that will undoubtedly lead to a beautiful friendship.  The boys covered everything from Lavar Ball to Kim Jong-Un and Pat rounds out the Vegas aftermath.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/landmark.barstoolsports.net/pat-mcafee-show/PMS011_JohnDaly.mp3",
            "categories": [
                "Talk Radio"
            ]
        },
        {
            "title": "PMS 010 - Vegas Recap",
            "datePublished": "Tue, 28 Mar 2017 07:01:00 GMT",
            "description": "WARNING: This episode was a hilarious train wreck and we didn't edit out a single moment.  Pat and the boys give Todd and the listeners a full recap of their Vegas trip this past weekend.  You should know that Pat, Digs and Nick landed back in Indy 4 hours before this episode was recorded and their bodies and minds were still tore down from their insane weekend in Sin City.  But the show must go on!  To our listeners...you're welcome.  To our sponsors...we're sorry.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/landmark.barstoolsports.net/pat-mcafee-show/PMS010_VegasRecap.mp3",
            "categories": [
                "Talk Radio"
            ]
        },
        {
            "title": "PMS 009 - A.Q. Shipley",
            "datePublished": "Thu, 23 Mar 2017 10:01:00 GMT",
            "description": "This episode features an interview with Arizona Cardinals center and food enthusiast,  A.Q. Shipley.  Pat discusses what retirement has been like for him thus far and reveals his plans for the future.  Pat and the boys attempt to reach out directly to Kim Jong Un and they talk a little sports and world news.  This episode also features a jazzed-up segment of Behind the Badge.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/landmark.barstoolsports.net/pat-mcafee-show/PMS009.mp3",
            "categories": [
                "Talk Radio"
            ]
        },
        {
            "title": "PMS 008 - Don't be the baboon",
            "datePublished": "Wed, 22 Mar 2017 10:01:00 GMT",
            "description": "Wednesdays are for the crew.  No guests, no ad reads, just Pat and the boys chilling out and having a conversation.  They discussed Pat's past trips in Vegas, Dave Chapelle's return to comedy standup comedy and what's happening in the world.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/landmark.barstoolsports.net/pat-mcafee-show/PMS008.mp3",
            "categories": [
                "Talk Radio"
            ]
        },
        {
            "title": "PMS 007 - Dan Dakich, Darius Butler",
            "datePublished": "Tue, 21 Mar 2017 10:01:00 GMT",
            "description": "This episode features a March Madness rundown with ESPN analyst and radio host Dan Dakich and an interview with Colts cornerback turned safety, Darius Butler.  Pat and the boys also discuss Pat's win in Barstool Sports' Bud Light Busters Challenge and his subsequent upcoming trip to Vegas.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/landmark.barstoolsports.net/pat-mcafee-show/PMS007.mp3",
            "categories": [
                "Talk Radio"
            ]
        },
        {
            "title": "PMS 006 - Edgerrin James",
            "datePublished": "Thu, 16 Mar 2017 10:01:00 GMT",
            "description": "This episode features an interview with former NFL running back and future Hall of Famer Edgerrin James.  Pat and the boys discuss what's happening in sports and world news and they unveil the long-awaited Chicken Story during this week's segment of Behind the Badge.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/landmark.barstoolsports.net/pat-mcafee-show/PMS006.mp3",
            "categories": [
                "Talk Radio"
            ]
        },
        {
            "title": "PMS 005 - Just Us",
            "datePublished": "Wed, 15 Mar 2017 16:01:00 GMT",
            "description": "There was no guest this episode.  Just Pat and the boys talking about what's going on in the world.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/landmark.barstoolsports.net/pat-mcafee-show/PMS005.mp3",
            "categories": [
                "Talk Radio"
            ]
        },
        {
            "title": "PMS 004 - Dan Dakich / Dave Portnoy",
            "datePublished": "Tue, 14 Mar 2017 10:01:00 GMT",
            "description": "This episode features interviews with ESPN analyst and radio host Dan Dakich and founder of Barstool Sports, Dave \"El Pres\" Portnoy.  Dan Dakich breaks down his NCAA Men's Basketball bracket and Dave Portnoy breaks down his opinion of Soul Cycle instructors.  The boys cover what's happening in the world with sports and other news, Uncle Todd answers the weekly cop question in Behind the Badge, and Pat shares his opinion on how America is getting soft.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/landmark.barstoolsports.net/pat-mcafee-show/PMS004.mp3",
            "categories": [
                "Talk Radio"
            ]
        },
        {
            "title": "PMS 003 - Mike Barwis, Arian Foster",
            "datePublished": "Tue, 07 Mar 2017 11:01:00 GMT",
            "description": "This episode features interviews with Strength and conditioning coach Mike Barwis and retired NFL running back and potential wolf slayer Arian Foster.  The boys also discussed what's going on in the world and they introduced their new \"Ask a Cop\" segment.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/landmark.barstoolsports.net/pat-mcafee-show/PMS003.mp3",
            "categories": [
                "Talk Radio"
            ]
        },
        {
            "title": "PMS 002 - Pierre Garcon, Drew Rosenhaus, Brandon McManus and Ryan Whitney",
            "datePublished": "Thu, 02 Mar 2017 10:01:00 GMT",
            "description": "This episode features interviews with Washington Redskins lead receiver Pierre Garcon, Sports Agent Drew Rosenhaus, Denver Broncos kicker Brandon McManus and Former NHL Defenseman / podcaster and NHL Analyst Ryan Witney.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/landmark.barstoolsports.net/pat-mcafee-show/PMS002.mp3",
            "categories": [
                "Talk Radio"
            ]
        },
        {
            "title": "PMS 001 - Glenn Robinson III, Matt Hasselbeck and Dan Dakich",
            "datePublished": "Thu, 23 Feb 2017 10:01:00 GMT",
            "description": "The first official episode of The Pat McAfee show features interviews with The 2017 NBA Slam Dunk Champ, Glenn Robinson III in the first hour, Former NFL quarterback / ESPN analyst Matt Hasselbeck in the second hour and ESPN sportscaster / radio host Dan Dakich wraps things up at the end.",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/landmark.barstoolsports.net/pat-mcafee-show/PMS001.mp3",
            "categories": [
                "Talk Radio"
            ]
        },
        {
            "title": "Pat McAfee Show Announcement",
            "datePublished": "Fri, 10 Feb 2017 18:01:00 GMT",
            "description": "The Pat McAfee Show presented by Barstool Sports",
            "length": "0",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/landmark.barstoolsports.net/pat-mcafee-show/PatMcAfeeMP3.mp3",
            "categories": [
                "Talk Radio"
            ]
        }
    ]
}