{
    "artwork": "http://is3.mzstatic.com/image/thumb/Music71/v4/82/36/8f/82368f98-76c1-aebf-9120-06970eba7c02/source/100x100bb.jpg",
    "description": "Unitarian Universalists are changing the world through the stand they take on issues facing our world today. Meet the people who facilitate making a difference in the communities around them. Whether you want personal spiritual growth or inspiration to impact a community, there is something here for everyone. You’ll be inspired to take action.",
    "feedURL": "http://www.uuperspective.com/feed/podcast/",
    "podcastURL": "http://www.uuperspective.com",
    "title": "Unitarian Universalist: The UU Perspective",
    "episodes": [
        {
            "title": "COP21 - Climate Justice, What the Countries Agreed On In Paris",
            "datePublished": "Sun, 31 Jul 2016 22:53:47 +0000",
            "description": " COP21  Paris - Will Unitarian Universalist Congregations Become Organized to Ensure Earth's Future for Our Descendants?\r\nHear what the results of the Paris COP21 UN talks were from our UU representatives William McPhearson and Jan Dash. Aly Tharp, Program Mangager for Commit2Respond is co-hosting and asking the improtant questions that we want to know the answers to.\r\n\r\nAre we organized as UU Congregations to make a difference when it comes to Climate Justice?\r\n\r\nCan UUs have an influence over Climate Justice locally?\r\n\r\nEmissions - what does the trajectory look like between now and 2100?\r\n\r\n \r\n\r\n\r\n\r\n\r\n\r\n\r\n Co-Host, Aly Tharp -  is the Program Manager for Commit2Respond and has been  staff network coordinator for the UU Young Adults for Climate Justice, a covenanting community of activists aged 18 to 35 years old, supported by the UU Ministry for Earth. Aly graduated from Austin College in May 2012 with a Bachelors of Art in Environmental Studies and has devoted most of her time over the last three and a half years to grassroots movements for environmental and climate justice. Aly resides in North Texas with her family and twelve pets.\r\n\r\n\r\nWebpage: UU Young Adults for Climate Justice\r\n\r\n\r\nTwitter: @UUYACJ\r\n\r\n\r\nFacebook: https://www.facebook.com/uuyacj\r\nLinkedIn: Aly Tharp\r\n\r\n \r\n\r\nJan Dash - links to important sites\r\n\r\nthe Climate Portal\r\n\r\nthe Paris Conference blog on the Climate Portal\r\n\r\nThe talk with slide on CO2 emissions by different countries\r\n\r\n2nd edition of my book with the chapter on Climate Change Risk Management\r\n\r\nDr. William McPherson is a retired environmental diplomat. Author of books on ideology and environment, he has participated in international conferences on climate change and worked on a number of environment issues, including coal use, petroleum transportation and renewable energy.\r\n\r\n \r\n\r\nLinks:\r\n\r\nSabotaging the Planet: Denial and International Negotiations: \r\n\r\n\r\nIdeology versus Science: Climate Change Denial: \r\n\r\n\r\n \r\n\r\nUU Coalition of State Advocacy Networks\r\n\r\nUU-UNO Envoy Program\r\n\r\n \r\n\r\nFinal Credits: music thanks to:\r\n\r\n\"Carefree\", \"Open Those Bright Eyes\", \"Sweeter Vermouth\"\r\nKevin MacLeod (incompetech.com)\r\nLicensed under Creative Commons: By Attribution 3.0\r\nhttp://creativecommons.org/licenses/by/3.0/",
            "length": "22312216",
            "sourceUrl": "http://media.blubrry.com/theuuperspectivepodcast/content.blubrry.com/theuuperspectivepodcast/COP21_Review_.mp3",
            "categories": [
                "Podcast",
                "activist",
                "Aly Tharp",
                "climate change",
                "climate justice",
                "climate talks paris",
                "CO2 emissions",
                "COP21",
                "internationsl UUs",
                "Jan Dash",
                "Lynn Dash",
                "Peggy Clark",
                "Unitarian Universalist",
                "UUA",
                "William McPherson"
            ]
        },
        {
            "title": "Will Summer Seminary and Luminary Leadership Programs Create Our UU Future?",
            "datePublished": "Fri, 01 Jan 2016 07:05:04 +0000",
            "description": "Youth have a great opportunity to find out if becoming a minister is what they want to do. The Summer Seminary Program provided through the UUA is a way to experience what it would be like to attend a seminary program. The attend workshops that introduce them to a variety of areas within the ministry and experience the preparation it takes to speak in front of their peers inside of the \"Preach-Off\".  They discover if it's their calling or it can create more engagement in their own congregations worship committees.\r\nLuminary Leaders is an invitation that sprouts from attending the Summer Seminary Program. They further develop leadership skills through the support of their peers.\r\n\r\nSteven Ballesteros and Alex Jensen are alumni of these programs after attending in  2014 and 2013. They share there experience and what other youth can expect to gain from the experience. Both are going into the ministry and this has added to the growth of their abilities in preaching and ministering in areas they are passionate about.\r\n\r\n \r\nSteven Ballesteros Bio:\r\n\"I was born and then raised in Tucson, Arizona by my two adoptive moms,\r\nalong with my biological sister. I spent most of my teens in a variety\r\nof athletic and artistic extracurriculars while traveling, hiking, and\r\nattending churches with my family. I have spent the last 6 years\r\ninvolved in Unitarian Universalist leadership from the congregational\r\nto national level. I have dedicated my time and talent to a variety of\r\nleadership roles, including dozens of committees spread between two\r\nchurches, volunteering at the UU Camp DeBenneville Pines, and\r\nattending UU leadership schools. I currently serve as member of the\r\nUUA Nominating Committee, co-chair of the General Assembly Right\r\nRelationship Team, and as Faith Development Intern to the Edmonds\r\nUnitarian Universalist Church of Edmonds, Washington.\"\r\n\r\nSteven on LinkedIn\r\nFavorite Quote:\r\n\"We are often called to do the difficult, if not the seemingly\r\nimpossible, and it is vital to our spiritual growth that we not ignore\r\nthese challenges.\"-- Janice Marie Johnson\r\nAlex Jensen Bio:\r\nAlex Jensen is a second year student at California State University, Monterey Bay, where he studies Human Communication. Alex has been a Unitarian Universalist since middle school, where he joined Mission Peak Unitarian Universalist Congregation in Fremont, California. A graduate of the UUA's first Summer Seminary (2013) and a Luminary Leader alumnus, Alex is discerning a call to ministry.\r\nLinks:\r\nAlex on facebook\r\nAlex on linkedin\r\n\r\nEmail: robertalexjensen@gmail.com\r\nFavorite Quote:\r\n\"I do not pretend to understand the moral universe, the arc is a long one, my eye reaches but little ways. I cannot calculate the curve and complete the figure by the experience of sight; I can divine it by conscience. But from what I see I am sure it bends towards justice.\" ~The Reverend Theodore Parker, Unitarian Minister\r\n\r\n \r\nHere's where you can learn more about Summer Seminary\r\n\r\nFinal Credits: music thanks to:\r\n\r\n\"Carefree\", \"Open Those Bright Eyes\", \"Sweeter Vermouth\"\r\nKevin MacLeod (incompetech.com)\r\nLicensed under Creative Commons: By Attribution 3.0\r\nhttp://creativecommons.org/licenses/by/3.0/",
            "length": "38438216",
            "sourceUrl": "http://media.blubrry.com/theuuperspectivepodcast/content.blubrry.com/theuuperspectivepodcast/Will_Summer_Seminary_and_Luminary_Leadership_Programs_Create_Our_UU_Future_UUPP_045.mp3",
            "categories": [
                "Podcast",
                "Alex Jensen",
                "Leadership",
                "Luminary Leadership Alumni",
                "meadville Lombard",
                "minister",
                "Starr King",
                "Steven Ballesteros",
                "Summer Seminary",
                "Unitarian Universalist",
                "uu",
                "UUA"
            ]
        },
        {
            "title": "Baker’s Dozen #3 Quotes & Questions of Former Guests – UUPP 044",
            "datePublished": "Fri, 25 Dec 2015 07:08:21 +0000",
            "description": "Answers to the question \"How is Unitarian Universalism as a religious denomination uniquley positioned to serve and impact society,\" along with some favorite quotes from former UU Perspective guests: Bart Frost, Kenny Wiley, Brian Tideman, Elizabeth Mount, Gleb Tsipursky, Fred Small, Anita Mills, Kathy Smith, Patty MacAfee, Domonic Giafagleone, Cyllis Dreamer, and Micaela Corcoran.\r\nCheck out more about them and hear complete episodes by clicking on their names!\r\nFavorite Quotes:\r\n Lisa Presley:\r\n– Surprised people behave badly\r\n– Transparency, transparency, transparency\r\n– Feed health, starve dysfunction\r\n– Diversity: where you count the people; Inclusion: where the people count.\r\n– Whether you think you can, or think you can’t, you’re right  – Henry Ford\r\nBart Frost\r\nBut love is really more of an interactive process. It’s about what we do not just what we feel. It’s a verb, not a noun . –Bell Hooks\r\nRev. Fred Small\r\n“When conditions are sufficient things manifest. When conditions are no longer sufficient things withdraw. They wait until the moment is right for them to manifest again.” –Thich Nhat Hanh\r\nAnita Mills:\r\nGracias a la vida que me ha dado tanto -from a song by Violeta Parra\r\nTranslation: Thank you to life which has given me so much\r\n\r\n(my own – soon to be bumper sticker!) You can change the world!\r\nKathy Smith:\r\nThe arc of the moral universe is long, but it bends toward justice. – Theodore Parker\r\n Kenny Wiley:\r\nStrong people don’t need strong leaders. – Ella Baker\r\n\r\n \r\n\r\n \r\n\r\nFinal Credits: music thanks to:\r\n\r\n\"Carefree\", \"Open Those Bright Eyes\", \"Sweeter Vermouth\"\r\nKevin MacLeod (incompetech.com)\r\nLicensed under Creative Commons: By Attribution 3.0\r\nhttp://creativecommons.org/licenses/by/3.0/",
            "length": "32848478",
            "sourceUrl": "http://media.blubrry.com/theuuperspectivepodcast/content.blubrry.com/theuuperspectivepodcast/Favorite__Quotes_and_Questions_From_Former_Guests_Third_Installment.mp3",
            "categories": [
                "Podcast",
                "Anita Mills",
                "Bart Frost",
                "Brian Tideman",
                "Cyllis Dreamer",
                "Domonic Giafagleone",
                "Elizabeth Mount",
                "Fred Small",
                "Gleb Tsipursky",
                "inspiration",
                "Kathy Smith",
                "Kenny Wiley",
                "Micaela Corcoran",
                "Patty MacAfee",
                "Quotes",
                "Unitarian Universalist",
                "uu"
            ]
        },
        {
            "title": "Secular Sobriety When Your Beliefs Don't Align With AA",
            "datePublished": "Fri, 18 Dec 2015 07:30:30 +0000",
            "description": "Did you realize that 7/12 of the AA 12 steps have a religious reference and can be a put-off to those non-believers. Even though Alcoholics Anonymous says a Higher Power can be anything you want...a door knob....yeah right! Higher power itself doesn't align with great number of Athiests, UUs and such. So what's the alternative where you can get support if you want to live a sober life? Secular Organizations for Sobriety is available for that purpose.\r\nValerie White (episode 42) give us insight into her journey of becoming sober when she hit bottom in 1985. 28 years sober and the experiences of creating her own group of SOS, has given her the opportunity to be open with others in way that helps them to live a sober life. She writes quarterly articles to support others who suffer with the disease.\r\nLinks:\r\nThe movie: The Anonymous People\r\n\r\nLifeRing Secular Recovery\r\n\r\nSMART recovery\r\n\r\nJames Christopher Books\r\n\r\nUnhooked \r\n\r\nHow To Stay Sober \r\n\r\n \r\n\r\nFinal Credits: music thanks to:\r\n\r\n\"Carefree\", \"Open Those Bright Eyes\", \"Sweeter Vermouth\"\r\nKevin MacLeod (incompetech.com)\r\nLicensed under Creative Commons: By Attribution 3.0\r\nhttp://creativecommons.org/licenses/by/3.0/",
            "length": "33276832",
            "sourceUrl": "http://media.blubrry.com/theuuperspectivepodcast/content.blubrry.com/theuuperspectivepodcast/Secular_Sobriety_When_Your_Beliefs_Dont_Align_With_AA.mp3",
            "categories": [
                "Podcast",
                "12 steps",
                "AA",
                "Alcoholics Anonymous",
                "how to stay sober",
                "james christopher",
                "Secular organizations for sobriety",
                "sobriety",
                "Unitarian Universalist",
                "uu",
                "Valerie White"
            ]
        },
        {
            "title": "Curious about Polyamory? Do You Think We Are Born Polyamory?",
            "datePublished": "Fri, 11 Dec 2015 07:15:16 +0000",
            "description": "Polyamory: It is the idea that you can love more than one person as long as you're doing it openly, honestly and with the full consent and participation of all involved.\r\nValerie White will tell you all different aspects of Polyamory. Where do people find each other who are poly amorous? Why would you get involved in Polyamory? Is it a choice or orientation? Does the 3rd person live with the first couple? How does that work? Anyways, it's a fascinating subject no matter if your are a part of it or not.\r\nBio:\r\nValerie White has been a Unitarian Universalist for 53 years, lawyer, and director of Sexual Freedom Legal Defense and Education Fund, Valerie White has spoken on polyamory at many national and regional conferences.  She has written for many periodicals, including Loving More, The World and The Humanist, and served on the boards of Church of the Larger Fellowship, Unitarian Universalists for Polyamory Awareness (their first president), Interweave and UU’s for Jewish Awareness.  She has been president of the Unitarian Church of Sharon, MA and currently chairs the worship committee.  A long-time sexual rights activist, she was president of the Vermont Civil Liberties Union.  She has lived in an open triad for 21 years and is helping raise 13-year-old twins.\r\nFavorite Quote:\r\n“My feeling about technique in art is that it has about the same value as technique in lovemaking. Heartfelt ineptitude has its appeal and so does heartless skill; but what you want is passionate virtuosity.” John Barth, Giles Goat Boy\r\nWebsite Links:\r\nSexual Freedom Legal Defense and Education Fund\r\n\r\nUnitarian Universalists for Polyamory Awareness\r\n\r\nLoving More\r\nBooks of interest:\r\nLoving More: The Polyfidelity Primer\r\n Sex at Dawn: The Prehistoric Origins of Modern Sexuality By Christopher Ryan\r\n\r\n Sex at Dawn: How We Mate, Why We Stray, and What It Means for Modern Relationships\r\n The Ethical Slut\r\n\r\n More Than Two\r\n Opening Up\r\n\r\n \r\n\r\nFinal Credits: music thanks to:\r\n\r\n\"Carefree\", \"Open Those Bright Eyes\", \"Sweeter Vermouth\"\r\nKevin MacLeod (incompetech.com)\r\nLicensed under Creative Commons: By Attribution 3.0\r\nhttp://creativecommons.org/licenses/by/3.0/",
            "length": "26422252",
            "sourceUrl": "http://media.blubrry.com/theuuperspectivepodcast/content.blubrry.com/theuuperspectivepodcast/Curious_About_Polyamory__Are_We_Born_That_Way__UUPP_042.mp3",
            "categories": [
                "Podcast",
                "loving more",
                "multiple partners",
                "open relationships",
                "Our whole Lives",
                "Polyamory. Polly amorous",
                "sexual freedom",
                "sexual rights activist",
                "Unitarian Universalist",
                "uu",
                "uupa",
                "Valerie White"
            ]
        },
        {
            "title": "COP21 UN Climate Change Conference, UU Young Adults On The Inside!  – UUPP 041",
            "datePublished": "Fri, 04 Dec 2015 07:18:03 +0000",
            "description": "The COP 21 UN Climate Talks in Paris are where decisions are made...or not among 200 Nations.\r\nHow do they get everyone to agree. How will fossil fuels be dealt with. There is so much happening between Nov30- Dec 12 and Aly Tharp and Ethan Bodnaruk are two Young Adult UUs who dig deep into what's happening as they attend the 2015 COP 21. Ethan's Cohert will be inside attending workshops and being directly involved, while Aly will be at the 2nd half attending activist events outside the building in solidarity with others from around the world.\r\n\r\nOnce they are back I'll bring you a recap of their experience.\r\nAly's Bio:\r\nAly Tharp is the staff network coordinator for the UU Young Adults for Climate Justice, a covenanting community of activists aged 18 to 35 years old, supported by the UU Ministry for Earth. Aly graduated from Austin College in May 2012 with a Bachelors of Art in Environmental Studies and has devoted most of her time over the last three and a half years to grassroots movements for environmental and climate justice. Aly resides in North Texas with her family and twelve pets.\r\n\r\n\r\n \r\n\r\nWebpage: UU Young Adults for Climate Justice\r\n\r\n\r\nTwitter: @UUYACJ\r\n\r\n\r\nFacebook: https://www.facebook.com/uuyacj\r\nLinkedIn: Aly Tharp\r\n\r\n\r\n Favorite Quote:\r\n \r\n\r\n\"Dream lucid and wide awake\" - Gini Von Courter, in a speech she once gave in Texas\r\n\r\n \r\n\r\n\r\n Ethan's Bio:\r\nEthan Bodnaruk is a Ph.D. Candidate in Ecological Engineering at SUNY-ESF in Syracuse, NY and is a co-leader of the Religions for Peace, North American Interfaith Youth Network.  He is active in Citizens' Climate Lobby which advocates for a revenue neutral carbon fee and will be attending the Paris COP with a small cohort of interfaith youth sponsored by Religions for Peace USA.  He has a MS in Nuclear Engineering from North Carolina State University and a BS in Engineering from Harvey Mudd College.  He lives in snowy Syracuse, NY with his wife and two dogs.  \r\nWebpage: www.ethanbodnaruk.com\r\n\r\n\r\nTwitter: @ethanbodnaruk\r\n\r\n\r\n\r\nLinkedIn: Ethan Bodnaruk\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n Favorite Quote:\r\n\"Know the rules well so you know when to break them\"  - Gandhi\r\n\r\nOther Links:\r\n The Condor and the Eagle video\r\n\r\n\r\n\r\nFinal Credits: music thanks to:\r\n\r\n\"Carefree\", \"Open Those Bright Eyes\", \"Sweeter Vermouth\"\r\nKevin MacLeod (incompetech.com)\r\nLicensed under Creative Commons: By Attribution 3.0\r\nhttp://creativecommons.org/licenses/by/3.0/",
            "length": "36783339",
            "sourceUrl": "http://media.blubrry.com/theuuperspectivepodcast/content.blubrry.com/theuuperspectivepodcast/COP21_UN_Climate_Change_Conference_UU_Young_Adultts_Get_Involved_UUPP_041.mp3",
            "categories": [
                "Podcast",
                "activist",
                "Aly Tharp",
                "climate action",
                "climate justice",
                "condor and the eagle",
                "COP 21",
                "Ethan Bodnaruk",
                "Leadership",
                "Peggy Clarke",
                "social justice",
                "UN climate talks",
                "Unitarian Universalist",
                "uu",
                "YAC",
                "Young Adult",
                "Young Adults"
            ]
        },
        {
            "title": "Quotes & Questions Answered - a Baker's Dozen #2",
            "datePublished": "Sat, 28 Nov 2015 14:12:12 +0000",
            "description": "Favorite quotes from former guests, Margalie Belizaire, Cal Frye, Phillis Smith, Connie Goodbread, LoraKim Joyner, Hal Walker, Kathleen McTigue, Darlene Pagano, Jyarleen Daniels, Peter Morales, Rachel Gore Freed, Janet Mason, Ariel Hunt-Brondwin, and Susan Katz Miller. Plus answers to the question, How is Unitarian Universalism as a religious denominiation uniquely positioned ot serve and impact society?\r\nWant to find out more about one of the guests? Click on the name to go to their episode!\r\n\r\nHow would you answer this question? Leave your answer in the comment section below or use speakpipe (the tab on the right) and I'll play it on the next episode!\r\nList of Quotes:\r\nMargalie Belizaire\r\nLet us be kind to one another for most of us are fighting a hard battle. – Ian MacLaren\r\nLoraKim Joyner\r\nYou do not have to be good.\r\nYou do not have to walk on your knees for a hundred miles through the desert, repenting.\r\nYou only have to let the soft animal of your body love what it loves\r\nTell me about despair, your, and I will tell you mine.\r\nMeanwhile the world goes on. - Wild Geese, by Mary Oliver\r\n\r\nThey who bind to themselves a joy\r\nDo the winged life destroy;\r\nBut they who kiss the joy as it flies\r\nLive in eternity’s sun rise. - William Blake\r\n\r\n \r\nConnie Goodbread\r\nFaith development is all we do.\r\nUnitarian Universalism is the faith we teach.\r\nThe congregation is the curriculum. - Connie’s creation (it is also the mantra of the UUA Southern Region)\r\nHal Walker\r\n“Don’t Believe Everything You THINK!”\r\nRev. Kathleen McTigue\r\n“If our religion plays a significant role in our lives, then it must do more than simply reinforce the values of our culture. In fact, …our values are often deeply counter-cultural. Articulating the ways these values challenge certain cultural ideas about wealth accumulation…for example, is part of what it means to be prophetic….Given the public dominance of conservative religious voices today, if religious liberals don’t speak up, no one else will know that there is another religious perspective.” – Paul B. Rasor from his book – Reclaiming Prophetic Witness: Liberal Religion in the Public Square\r\nJyarland Daniels\r\nThe ultimate measure of a man is not where he stands in moments of comfort and convenience but where he stans at times of challenge and controversy. – Martin Luther King Jr.\r\n\r\nIf yuu are silent you have chosen the side of the opressor. – Desmond Tutu\r\nDarlene Pagano\r\nJustice is what love looks like in public. –  Cornell West \r\nJanet Mason\r\nPoetry is not a luxury. – Audre Lorde\r\nPeter Morales\r\n“No other faith aligns with the emerging culture the way we do. No other faith has our potential to touch lives and change the world.” – Peter Morales\r\nRachel Gore Freed\r\n“To love. To be loved. To never forget your own insignificance. To never get used to the unspeakable violence and the vulgar disparity of life around you. To seek joy in the saddest places. To pursue beauty to its lair. To never simplify what is complicated or complicate what is simple. To respect strength, never power. Above all, to watch. To try and understand. To never look away. And never, never to forget.” — Arundhati Roy, The Cost of Living\r\n(Arundhati Roy is a famous Indian writer and activist)\r\nSusan Katz Miller\r\n“Unitarian Universalists are neither a chosen people nor a people whose choices are made for them by theological authorities–ancient or otherwise. We are a people who choose.” –Theologian Forrest Church\r\n\r\n \r\n\r\nFinal Credits: music thanks to:\r\n\r\n\"Carefree\", \"Open Those Bright Eyes\", \"Sweeter Vermouth\"\r\nKevin MacLeod (incompetech.com)\r\nLicensed under Creative Commons: By Attribution 3.0\r\nhttp://creativecommons.org/licenses/by/3.0/",
            "length": "29524160",
            "sourceUrl": "http://media.blubrry.com/theuuperspectivepodcast/content.blubrry.com/theuuperspectivepodcast/Baker_s_Dozen__2_Quotes___Questions_UUPP_040.mp3",
            "categories": [
                "Podcast",
                "and Susan Katz Miller",
                "Ariel Hunt-Brondwin",
                "Baker's Dozen",
                "Cal Frye",
                "Connie Goodbread",
                "Darlene Pagano",
                "Hal Walker",
                "janet mason",
                "Jyarleen Daniels",
                "Kathleen McTigue",
                "Leadership",
                "LoraKim Joyner",
                "Margalie Belizaire",
                "Peter Morales",
                "Phyllis Smith",
                "Rachel Gore Freed",
                "social justice",
                "standing on the side of love",
                "Unitarian Universalist"
            ]
        },
        {
            "title": "5000 Texans Involved in the Texas UU Justice Ministry!",
            "datePublished": "Fri, 20 Nov 2015 08:43:33 +0000",
            "description": "Guided by Unitarian Universalist principles, TXUUJM educates and organizes member congregations, and partners with sympathetic organizations in order to advocate effectively for public policies that:\r\nUphold the worth and dignity of every person;\r\nFurther justice, equity, and compassion in human relations;\r\nEnsure the use of the democratic process;\r\nProtect religious freedom; and,\r\nPromote respect for the interdependent web of all existence.\r\n\r\nThe areas of focus in the future are economic justice, reproductive justice, and immigration and refugee rights.\r\n\r\nAre you in one of the 23 States that has a Justice Ministry?\r\nRev. Chuck Freeman Bio:\r\nRev. Chuck Freeman has been in the ministry since 1977 serving Church of Christ and Unitarian Universalist congregations.  He is the founding minister of the Free Souls Church in Round Rock,Texas.  Chuck is a founding member of the Texas Unitarian Universalist Justice Ministry and its Executive Director.\r\n\r\nChuck is also a certified Chaplain who has ministered in the Texas Medical Center in Houston and with Hospice Austin.  He is the co-founder of Hospice Austin’s Bereavement counseling program.\r\n\r\nHe is the creator; producer and host of the radio program “Soul Talk” which has been broadcasting since 1996.  The show currently streams live 24/7  Soultalkradio.com.\r\n\r\nChuck is the Founder and President of the Free Souls Project, promoting the integration of spirituality, democracy and ethics from a liberal faith perspective. His blogs on Politics & Religion have appeared on Fire Dog Lake/The Seminal,  & The Huffington Post.\r\n\r\nHis Op Ed Pieces have been published in the Austin American Statesman, Austin’s NPR affiliate, KUT, and The Washington Post/Newsweek “On Faith” blog. Chuck was a panelist on the 2009 Netroots Nation workshop “A New Progressive Vision for Church & State.” You can keep up with Chuck’s media ventures at ChuckFreeman.org.\r\n\r\nChuck is a lively, reflective, down to earth man who combines irreverence, compassion, and a playful humor in his life and work.\r\nFavorite Quotes:\r\n“Organized error will outdistance unorganized truth every time.”- Rev. James Billings, Universalist Minister/Missionary in Texas, 1889\r\n\r\n\"Why talk forever? What shall we do? Now is the time to push and be active. There will never be a better time ‘til we make the times better.\" —Rev. Theodore Parker\r\nLinks:\r\nTXUUJM\r\n\r\nCoalition of Unitarian Universalist State Action Networks\r\n\r\n \r\n\r\nFinal Credits: music thanks to:\r\n\r\n\"Carefree\", \"Open Those Bright Eyes\", \"Sweeter Vermouth\"\r\nKevin MacLeod (incompetech.com)\r\nLicensed under Creative Commons: By Attribution 3.0\r\nhttp://creativecommons.org/licenses/by/3.0/",
            "length": "18486659",
            "sourceUrl": "http://media.blubrry.com/theuuperspectivepodcast/content.blubrry.com/theuuperspectivepodcast/5000_Texans_Involved_In_TX_Unitarian_Universalist_Justice_Ministry_UUPP_039.mp3",
            "categories": [
                "Podcast",
                "activist",
                "austin texas",
                "economic justice",
                "equality",
                "immigration rights",
                "Justice Ministry",
                "Leadership",
                "racial justice",
                "religious freedom",
                "reproductive rights",
                "Rev. Chuck Freeman",
                "social justice",
                "standing on the side of love",
                "txuujm",
                "Unitarian Universalist",
                "uu",
                "wage equality"
            ]
        },
        {
            "title": "Alzheimer’s, They Receive Weekly Engagement and Connectedness Through the Candle Lighters Program – UUPP 038",
            "datePublished": "Fri, 13 Nov 2015 11:35:30 +0000",
            "description": "Peggy Gill of Horizon UU Church of Carrolton, TX created the Candle Lighters, a 4 hour weekly gathereing for those in the early stages of Alzheimer's.\r\nIt may be respite for spouses and caregivers but it enriches and gives diginity to those suffering from Alzheimer's. As they sing in their own special way, \"We are the Champions\" as friends pass on, they champion each other as they continue to gather.\r\nDescription of the Candle Lighters Program:\r\n\r\nCandle Lighters, an outreach ministry of Horizon UU Church, is a meeting place for adults with memory issues. Open to persons of all faiths, races and ethnicities, Candle Lighters provides a time for those who participate to enjoy and activity-based program each Friday, and gives a respite for caregivers. Activities include exercise (Tai Chi), creating a Memory Book, games and music and art.\r\nBio:\r\nPeggy Gill is a retired professor of educational leadership. During her teaching career, she focused on the needs of students with learning difficulties. She continues to work with future teachers but spends most of her time in volunteer work. She currently volunteers as a teacher of adult ESL classes, in Candle Lighters (a fellowship for those with early stage Alzheimer's) and in rural Belize helping teachers learn the skills to be successful in challenging conditions. She is married and the mother of 3 children and 8 grandchildren.\r\nFavorite Quote:\r\n\"Better to light one candle, than curse the darkness.\"\r\n\r\nContact Peggy at: peggyprof@gmail.com\r\n\r\nLinks:\r\n\r\nAlzheimer's Association\r\n\r\nHorizon UU Church on Facebook\r\n\r\n \r\n\r\nFinal Credits: music thanks to:\r\n\r\n\"Carefree\", \"Open Those Bright Eyes\", \"Sweeter Vermouth\"\r\nKevin MacLeod (incompetech.com)\r\nLicensed under Creative Commons: By Attribution 3.0\r\nhttp://creativecommons.org/licenses/by/3.0/",
            "length": "24490936",
            "sourceUrl": "http://media.blubrry.com/theuuperspectivepodcast/content.blubrry.com/theuuperspectivepodcast/Alzheimers_Connecting_Through_the_Candle_Lighters_Program_UUPP_038.mp3",
            "categories": [
                "Podcast",
                "Alzheimer's",
                "Candle Lighters",
                "Horizon UU Church",
                "Leadership",
                "memory issues",
                "NTUUC",
                "Peggy Gill",
                "Unitarian Universalist",
                "uu",
                "we are the champions"
            ]
        },
        {
            "title": "UU World’s Kenny Wiley – Creating Change, Disrupting the Thought Process – UUPP 037",
            "datePublished": "Fri, 06 Nov 2015 07:21:47 +0000",
            "description": "Kenny Wiley, Senior Editor of the UU World and avid activist.\r\nHe has explored faith and identity as a youth and it helped him develop the core of who he is. His struggles as a Black UU when he was young had him avoid what later would be a significant friendship. He found his friendship with Raziq to be powerful and healing.\r\nBio:\r\nKenny Wiley, a UU World senior editor, lives in Denver and works at Prairie Unitarian Universalist Church as its director of faith formation. A 2011 graduate of the University of Missouri, Kenny loves college football, women's and men's basketball, and playing ultimate frisbee.\r\n\r\nHe also the founder of the Denver Black Lives Matter chapter.\r\nFavorite Quote:\r\nStrong people don't need strong leaders. - Ella Baker\r\n\r\nEach night a child is born, is a holy night.- Sophia Lyon Fahs\r\n\r\n \r\n\r\nFinal Credits: music thanks to:\r\n\r\n\"Carefree\", \"Open Those Bright Eyes\", \"Sweeter Vermouth\"\r\nKevin MacLeod (incompetech.com)\r\nLicensed under Creative Commons: By Attribution 3.0\r\nhttp://creativecommons.org/licenses/by/3.0/",
            "length": "25920150",
            "sourceUrl": "http://media.blubrry.com/theuuperspectivepodcast/content.blubrry.com/theuuperspectivepodcast/Kenny_Wiley_Creating_Change_Disrupting_the_Thought_Process_UUPP_037.mp3",
            "categories": [
                "Podcast",
                "black lives matter",
                "equality",
                "Leadership",
                "new Jim crow",
                "Prairie UU Church denver coloraodo",
                "racism",
                "social justice",
                "standing on the side of love",
                "Unitarian",
                "Unitarian Universalist",
                "uu",
                "UU World",
                "Young Adult"
            ]
        },
        {
            "title": "Common Ground Street Choir, Activism Through Song – UUPP 036",
            "datePublished": "Fri, 30 Oct 2015 06:15:11 +0000",
            "description": "Peaceful, Non-violent Protest through song from the Common Ground Street Choir of Dallas, Texas.\r\n \r\n\r\nKathy Smith, Anita Mills and Pat McAfee lead this activist singing group around the Dallas/Fort Worth area. They hope to expand with new chapters of the Common Ground Street Choir in other counties in the near future. From civil rights to job rights all songs have various verses to fit the moment. In February of 2015 they\r\n\r\nwent to Austin to lobby legislators on inequallity in pay and reproductive rights, singing in the rotunda. Pat will tell you, \"The Common Ground Street Choir has been a joyful process since it’s inception at GA in Providence and one into which I can pour my peace and justice passion and off-key alto.\"\r\nHere's How It All Started:\r\nEmma’s Revolution threw down the gauntlet at their workshop at GA. They said we’ve lost the peaceful nonviolent protests of the 60s and 70s. Now, no one seems to know the songs – or sings at protests and marches.  Now it’s the three-word chant, which is confrontational.\r\n\r\nThey challenged congregations to start Revolutionary Street Choirs to show up at protests to SING the message, and teach the old songs and bring some new ones, too. Singing evokes emotion.  It’s a peaceful, nonviolent way to convey a message.  And it can create magic.\r\nThe take-away if you feel the slight bit interested in creating a similar group:\r\nHoller along, harmonize at will, and you're a passionate street choir.\r\n\r\nBios:\r\nAnita Mills is a lifelong Unitarian and is currently serving as President of the North Texas Unitarian Universalist Congregational cluster. She is a co-founder of the Common Ground Street Choir, which fields members to sing at protests and rallies. Anita works with Grow North Texas to help urban agriculture efforts succeed, particularly in food deserts.\r\n\r\nKathy Smith is currently the Director of Religious Education for Children and Youth for the Community Unitarian Universalist Church in Plano, TX. She has been a lifelong musician, educator, and social activist.\r\n\r\nPat McAfee signed her first Book on Christmas Eve 1980 in Lubbock, TX and is now a member of the UU Church of Oak Cliff in Dallas, TX. As those who prefer small congregations understand, many hats have decorated her head in service to both these churches over the years. Currently Pat serves as the UUCOC representative to the North Texas Unitarian Universalist Congregations cluster and co-chair of NTUUC’s Education Committee.\r\nFavorite Quotes:\r\nAnita:\r\n\r\n1. Gracias a la vida que me ha dado tanto\r\nfrom a song by Violeta Parra\r\nTranslation: Thank you to life which has given me so much\r\n\r\n2. (my own - soon to be bumper sticker!) You can change the world!\r\n\r\nKathy:\r\n\r\nThe arc of the moral universe is long, but it bends toward justice. - Theodore Parker\r\nLinks:\r\nVideo of our Legislative Action Day - incl. choir singing in rotunda of Texas State Capitol\r\n\r\nhttp://www.ntuuc.org/events/ntuuc-event-videos\r\n\r\n It's story and songsheets can be accessed at:\r\nwww.commongroundstreetchoir.org\r\n\r\nhttps://www.oakcliffuu.org/common_ground/\r\n\r\nLink to our FaceBook page \"Common Ground Street Choir\"\r\n\r\nhttps://www.facebook.com/CGStreetChoir?fref=ts\r\n\r\n\r\nFinal Credits: music thanks to:\r\n\r\n\"Carefree\", \"Open Those Bright Eyes\", \"Sweeter Vermouth\"\r\nKevin MacLeod (incompetech.com)\r\nLicensed under Creative Commons: By Attribution 3.0\r\nhttp://creativecommons.org/licenses/by/3.0/",
            "length": "25974979",
            "sourceUrl": "http://media.blubrry.com/theuuperspectivepodcast/content.blubrry.com/theuuperspectivepodcast/Common_Ground_Street_Choir_Activism_In_Song_UUPP_0036.mp3"
        },
        {
            "title": "Rev. Fred Small's Creation Coalition - Be a Political Force for Climate and Environmental Justice",
            "datePublished": "Fri, 23 Oct 2015 06:59:06 +0000",
            "description": "From Full Time Minister to Persuing his Passion for Climate and Enviornmental Justice.\r\nFounder of the Creation Coalition, Fred Small begins gathering the masses for the political force that will bring about change.\r\n \r\n\r\nAs a singer/songwriter you'll hear his performance  of an all-time favorite among many ensembles, Everything Possible.\r\n\r\n \r\nBio:\r\n\r\nHonored by Bill McKibben as “one of the key figures in the religious environmental surge,” Rev. Fred Small is the founder of the Creation Coalition, a new organization to mobilize people of faith as an irresistible political force for climate and environmental justice.\r\nSenior Minister of First Parish in Cambridge, Unitarian Universalist, since 2008, Fred is also a singer-songwriter and environmental lawyer.  One of the first to engage in civil disobedience to draw attention to climate change, he was arrested with 21 others in prayer outside the US Department of Energy in Washington, DC, in May 2001.  In March, 2007, he was a lead organizer of the Interfaith Walk for Climate Rescue from Northampton to Boston, Massachusetts. Grist Magazine has named him one of 15 Green Religious Leaders worldwide.\r\n\r\n\r\n\r\nFavorite Quote:\r\n“When conditions are sufficient things manifest. When conditions are no longer sufficient things withdraw. They wait until the moment is right for them to manifest again.”--Thich Nhat Hanh\r\n\r\n\r\n\r\nLinks:\r\nCreation Coalition website\r\n\r\nQuestions about the Creation Coalition: info@creationcoalition.org\r\n\r\nListen to more songs on the Fred Small Music Page on Facebook\r\n\r\n \r\n\r\nFinal Credits: music thanks to:\r\n\r\n\"Carefree\", \"Open Those Bright Eyes\", \"Sweeter Vermouth\"\r\nKevin MacLeod (incompetech.com)\r\nLicensed under Creative Commons: By Attribution 3.0\r\nhttp://creativecommons.org/licenses/by/3.0/",
            "length": "27560336",
            "sourceUrl": "http://media.blubrry.com/theuuperspectivepodcast/content.blubrry.com/theuuperspectivepodcast/Fred_Smalls_Creation_Coalition_UUPP_035.mp3"
        },
        {
            "title": "OPUS #3 – Are Your Wishes Fulfilled? -UUPP 034",
            "datePublished": "Fri, 16 Oct 2015 07:02:42 +0000",
            "description": "The last installment from the attendees of OPUS. Micaela Corcoran and Brian Tideman share finding Unitarian Universalism, impressions sharing UUism with other, searching for community and connectedness in a foriegn country where UUs are at a minimum, and the experience bridging out.\r\nOpus wishes do come true!  Learn what wishes are!\r\n\r\nMicaela Corcoran  - Her first Opus and what she's experienced! She received support, love, fulfilling wishes and more! She discovered UUism at age 14 and for her to \"do church in a way that's comfortable.\"\r\n\r\n \r\n\r\n \r\n\r\n \r\n\r\nBrian Tideman - Working overseas teaching English in China, Brian came back to the States to enjoy his last OPUS before bridging out. Learn about his journey living in China were UUs aren't as prevalent and how how he fulfills his need for community.\r\n\r\n \r\n\r\n \r\n\r\n \r\n\r\nFinal Credits: music thanks to:\r\n\r\n\"Carefree\", \"Open Those Bright Eyes\", \"Sweeter Vermouth\"\r\nKevin MacLeod (incompetech.com)\r\nLicensed under Creative Commons: By Attribution 3.0\r\nhttp://creativecommons.org/licenses/by/3.0/",
            "length": "22308306",
            "sourceUrl": "http://media.blubrry.com/theuuperspectivepodcast/content.blubrry.com/theuuperspectivepodcast/OPUS_3_Are_Your_Wishes_Fulfilled_UUPP_034.mp3"
        },
        {
            "title": "Survey Says! Bart Frost Reveals What UU Youth Want",
            "datePublished": "Fri, 09 Oct 2015 08:32:03 +0000",
            "description": "Bart Frost, UUA Director of Youth and Young Adult Ministries tells what Youth are enjoying most inside of our church walls.\r\nAlso what do they want in order to feel included?\r\nDo you offer a Junior Membership?Is the symbol of that relationship important to you?\r\nDo you include them in your governance, worship or other activities that move the church forward?\r\nHave you heard of the Summer Seminarian program for high school kids interested in the ministry?\r\n\r\nYoung Adult programs are available through the UUA and feel free to call Bart and talk to him (he says he doesn't get many calls, so go for it!) (617) 948-4359\r\n\r\nAsk for what you need!\r\nBio:\r\nBart Frost is a lifelong Unitarian Universalist, and has served the UUA in various leadership positions for almost fifteen years. He currently serves as Director of Youth and Young Adult Ministries at the UUA. Bart lives in Boston with his fiancé and their three cats. Bart’s passion is creating opportunities for younger leaders in our faith to share their skills and spirit with the world.\r\nFavorite Quote:\r\n\r\nBut love is really more of an interactive process. It's about what we do not just what we feel. It's a verb, not a noun. -Bell Hooks\r\n\r\n \r\nLinks:\r\nBart:\r\nPhone (617) 948-4359  |  bfrost@uua.org\r\nuua.org  |  Twitter  |  Facebook\r\nhttp://www.uua.org/re/youth\r\nhttp://www.uua.org/re/youngadults\r\nhttp://blueboat.blogs.uua.org/\r\n\r\nTwitter: @yayauua\r\nInstagram: @instayayauua\r\nFacebook: UU youth ministry facebook page\r\nhttps://www.facebook.com/CampusUUs\r\nThe Hub: UU Young Adults facebook page\r\n\r\n \r\n\r\nFinal Credits: music thanks to:\r\n\r\n\"Carefree\", \"Open Those Bright Eyes\", \"Sweeter Vermouth\"\r\nKevin MacLeod (incompetech.com)\r\nLicensed under Creative Commons: By Attribution 3.0\r\nhttp://creativecommons.org/licenses/by/3.0/",
            "length": "35139429",
            "sourceUrl": "http://media.blubrry.com/theuuperspectivepodcast/content.blubrry.com/theuuperspectivepodcast/Survey_Says__Bart_Frost_Reveals_What_UU_Youth_Want_-_UUPP_033.mp3"
        },
        {
            "title": "OPUS #2 The Rant! with Dominic Giafagleone – UUPP 032",
            "datePublished": "Fri, 02 Oct 2015 07:09:36 +0000",
            "description": "Opus is a spiritual retreat and summer camp for Unitarian Universalist Young Adults age 18-35.\r\n \r\n\r\nThey worship, have workshops, touch groups, and social justice oriented activities. It runs 5 days and is held in one area for a 2 year period and then moves on to a new area. The past two years it has been located in the mid Ohio area and I had the opportunity to visit for a few hours and do some love interviews. I heard from YAs in their 20's to one aging out this year and enjoying his final year at Opus. By the way if you wonder what Opus stands for...well it's not an acronym for anything. It's just the name of the group.\r\n\r\n\r\n\r\nDominic Giafagleone gives his passionate and  heart felt thoughts on life and what it's like to be a Young Adult in this day and age. Loving  to name drop he's one that shows his appreciation and admiration for those who are thought provoking and inspirations to his life and involvement as an activist.\r\n\r\nHe is a member of Beverly Unitarian Church in Chicago.\r\n\r\n \r\nUpdate May 2016: Check out  in Whiting, Indiana, as Dominic and other activists gathered at Lake Michigan for a Native-led water ceremony and prayer --- and then hundreds marched to a BP refinery known to process large amounts of Canadian tar sands. (read more...)\r\n \r\n\r\n \r\n\r\nFinal Credits: music thanks to:\r\n\r\n\"Carefree\", \"Open Those Bright Eyes\", \"Sweeter Vermouth\"\r\nKevin MacLeod (incompetech.com)\r\nLicensed under Creative Commons: By Attribution 3.0\r\nhttp://creativecommons.org/licenses/by/3.0/",
            "length": "23793853",
            "sourceUrl": "http://media.blubrry.com/theuuperspectivepodcast/content.blubrry.com/theuuperspectivepodcast/OPUS_2_The_Rant_with_Sominic_Giafagleone_UUPP_032.mp3"
        },
        {
            "title": "Gleb Tsipursky connecting Neuroscience, Humanism, and Unitarian Universalism",
            "datePublished": "Fri, 25 Sep 2015 06:21:59 +0000",
            "description": "Finding Meaning and Purpose from a Science Based Perspective.\r\nAre you using the three broad area of activities to gain meaning and purpose?\r\n1. self reflection\r\n2. community bonds and community belonging\r\n3. serving others\r\n \r\n\r\nUUs do a great job in these 3 areas but we could do more especially in interfaith activities.\r\n\r\n \r\nBio\r\nGleb Tsipursky, PhD, is the Co-Founder and President of Intentional Insights (www.intentionalinsights.org), a UU-friendly nonprofit that empowers people to refine and reach their goals through providing research-based content about improving thinking, feeling, and behavior patterns. He is also a tenure-track professor at Ohio State University and a member of the Decision Sciences Collaborative there. As a historian of science working at the intersection of history, psychology, and cognitive neuroscience, he researches emotions, decision-making, meaning and purpose, agency and conformism, community, youth, social control, fun and leisure, and civic engagement in historical contexts. He published dozens of peer-reviewed essays in academic venues in the US, UK, France, Germany, Russia, and elsewhere, as well as numerous popular articles, and serves on a number of boards.\r\n\r\n \r\n\r\nHe has been active in the Unitarian Universalist movement for a number of years, and currently worships at the First Unitarian Universalist Church in Columbus, where he has participated in and led a number of Religious Education Classes and Covenant Groups. His nonprofit is collaborating with the UUA Faith Development Office and the UU Humanist Association to provide resources for UU youth, young adults, and adults.\r\n\r\n \r\n\r\nGet in touch with him at gleb@intentionalinsights.org\r\n\r\nintentionalinsights.org\r\n\r\nFacebook Page\r\n\r\nGleb TsipurskyTwitter\r\n\r\nYoutube Gleb Tsipursky\r\n\r\nPinterest Gleb Tsipursky\r\n\r\n \r\n\r\nFinal Credits: music thanks to:\r\n\r\n\"Carefree\", \"Open Those Bright Eyes\", \"Sweeter Vermouth\"\r\nKevin MacLeod (incompetech.com)\r\nLicensed under Creative Commons: By Attribution 3.0\r\nhttp://creativecommons.org/licenses/by/3.0/",
            "length": "44001824",
            "sourceUrl": "http://media.blubrry.com/theuuperspectivepodcast/content.blubrry.com/theuuperspectivepodcast/Gleb_Tsipursky_connecting_Neuroscience__Humanism_and_Unitarian_Universalism_-_UUPP_031.mp3"
        },
        {
            "title": "UUPP 030: Lisa Presley, Congregational Conflict and Resolution",
            "datePublished": "Fri, 18 Sep 2015 05:28:26 +0000",
            "description": "How Do We DO BETTER as congregations? We are such a mix of individuals and yet we work together fantastically! So what happens when don't agree to disagree?\r\nLisa Presley will give you insight into conflict resolution and what it takes to exist beyond knowing what we support as individuals and DO BETTER as a congregation. It's no longer about saving the day. It's how can we recognize conflict sooner rather than later?\r\nYounger generations aren't about the old way of socializing in the church which was inside of committees. People want to be out in the world doing something! They want to know their lives has value and meaning.  The nature of religious community has to change.  We'll have to reflect new ways to organize our congregations and new ways to be, if we are going to be relevant.\r\n\r\nBio:\r\nLisa Presley is a born and bred UU from the Midwest, who also spent 20 years of her life in Canada (and also holds dual citizenship). She has held almost every role in lay leadership, and is entering her 25th year of ordained ministry. In that ministry, Lisa has served as called minister and interim, as well as for the UUA in the MidAmerica Region. She holds a BA from University of Toronto, an M.Div. from Harvard Divinity School, and a D.Min. from Meadville/Lombard Theological School. She currently lives in Michigan with her partner and their cat.\r\n\r\n \r\nFavorite quotes:\r\n- Surprised people behave badly\r\n- Transparency, transparency, transparency\r\n- Feed health, starve dysfunction\r\n- Diversity: where you count the people; Inclusion: where the people count.\r\n- Whether you think you can, or think you can’t, you’re right. - Henry Ford\r\n\r\nLinks:\r\nMid America Region\r\nLisa Presley   lpresley@uua.org\r\nFinal Credits: music thanks to:\r\n\r\n\"Carefree\", \"Open Those Bright Eyes\", \"Sweeter Vermouth\"\r\nKevin MacLeod (incompetech.com)\r\nLicensed under Creative Commons: By Attribution 3.0\r\nhttp://creativecommons.org/licenses/by/3.0/",
            "length": "28461812",
            "sourceUrl": "http://media.blubrry.com/theuuperspectivepodcast/content.blubrry.com/theuuperspectivepodcast/UUPP_030_Lisa_Presley_Conflict_Resolution.mp3"
        },
        {
            "title": "OPUS #1 UU Young Adult Elizabeth Mount - UUPP 029",
            "datePublished": "Fri, 11 Sep 2015 07:00:38 +0000",
            "description": "Opus is a spiritual retreat and summer camp for Unitarian Universalist Young Adults age 18-35.\r\nThey worship, have workshops, touch groups, and social justice oriented activities. It runs 5 days and is held in one area for a 2 year period and then moves on to a new area. The past two years it has been located in the mid Ohio area and I had the opportunity to visit for a few hours and do some love interviews. I heard from YAs in their 20's to one aging out this year and enjoying his final year at Opus. By the way if you wonder what Opus stands for...well it's not an acronym for anything. It's just the name of the group.\r\n\r\nThis episode you will hear from Elizabeth Mount and Cyllis Dreamer, as he likes to be referred to. Both are activists and they share their experiencesfrom stopping the Shell drilling ship in Portland to mental health support.\r\n\r\n\r\n\r\n \r\n\r\nElizabeth - one of the Bridge Climbers of the Shell Drilling protest in Portland Oregon.\r\n\r\n \r\n\r\n \r\n\r\n \r\n\r\n \r\n\r\n \r\n\r\nFinal Credits: music thanks to:\r\n\r\n\"Carefree\", \"Open Those Bright Eyes\", \"Sweeter Vermouth\"\r\nKevin MacLeod (incompetech.com)\r\nLicensed under Creative Commons: By Attribution 3.0\r\nhttp://creativecommons.org/licenses/by/3.0/",
            "length": "25682821",
            "sourceUrl": "http://media.blubrry.com/theuuperspectivepodcast/content.blubrry.com/theuuperspectivepodcast/UUPP_029_OPUS_Young_Adults_1.mp3"
        },
        {
            "title": "UUPP 028: Susan Katz Miller - Being Both, embaracing two religions in one interfaith family",
            "datePublished": "Fri, 04 Sep 2015 07:00:35 +0000",
            "description": "Susan Katz Miller UU \"fangirl\" and ally presented at GA Portland to clergy about interfaith families and their roles and responsabilites to them.\r\nHow is your congregation interacting with interfaith families? What are clergy doing to be more inclusive of interfaith families in the congregations?\r\nChildren in interfaith families can be taught both religions. This allows youth to explore and experience a wealth of tradition and culture inside their families.\r\n\r\nBio:\r\nAuthor and journalist Susan Katz Miller is both an interfaith child and an interfaith parent. Her father is Jewish, her mother is Protestant: she grew up in Reform Judaism. After marrying a Protestant, Miller and her husband decided to raise their children in both religions, in a community of interfaith families. Miller served as Board Co-Chair of the Interfaith Families Project of Greater Washington DC.\r\nMiller graduated from Brown University, and began her journalism career at Newsweek in New York. After working in the Los Angeles and Washington bureaus, she moved to Dakar, Senegal for three years. While there, she wrote travel pieces for the New York Times, was tear-gassed in the streets while covering an election, interviewed the President of Senegal for Newsweek International, and wrote Christian Science Monitor pieces from Benin, Togo, the Gambia, and Sierra Leone. On returning to the States, she became a US Correspondent for the British weekly magazine New Scientist. She then spent three years freelancing from northeastern Brazil. After her two children were born, she and her husband settled in the Washington, DC, area, and she founded the first blog devoted to interfaith family communities and interfaith identity, onbeingboth.com, and began blogging at Huffington Post Religion.\r\nMiller’s writing has also appeared in Time, Slate, Utne Reader, Discover, Science, National Wildlife, Health, Moment, Jewcy.com, interfaithfamily.com, and many other publications. Miller studied photography at the Maryland Institute College of Art, and her photographs have been published in the New York Times, the Christian Science Monitor, and International Wildlife. Her work on interfaith families has been featured on NPR’s All Things Considered, NPR’s Here & Now, NPR’s Diane Rehm Show, on the PBS program Religion & Ethics Newsweekly and on HuffPost Live, and in dozens of other media outlets. Miller also writes for the Jewish Daily Forward‘s interfaith relationship advice column, The Seesaw.\r\nSusan Katz Miller is available for speaking, book group appearances, and facilitating workshops for interfaith couples, teens or grandparents. She has spoken at the Humanist Community of Harvard, Georgetown’s Berkley Center, the University of Virginia, Lafayette College, Jewish Community Centers, interfaith peacemaking groups, and many other venues.\r\n\r\nFavorite Quote:\r\n“Unitarian Universalists are neither a chosen people nor a people whose choices are made for them by theological authorities--ancient or otherwise. We are a people who choose.” --Theologian Forrest Church.\r\nLinks:\r\nBeing Both: Embracing Two Religions in One Interfaith Family\r\nWebsite susankatzmiller.com\r\nTwitter @beingboth\r\nBlog onbeingboth.com\r\nOn Facebook \r\n\r\nFinal Credits: music thanks to:\r\n\r\n\"Carefree\", \"Open Those Bright Eyes\", \"Sweeter Vermouth\"\r\nKevin MacLeod (incompetech.com)\r\nLicensed under Creative Commons: By Attribution 3.0\r\nhttp://creativecommons.org/licenses/by/3.0/",
            "length": "28324761",
            "sourceUrl": "http://media.blubrry.com/theuuperspectivepodcast/content.blubrry.com/theuuperspectivepodcast/UUPP_028_Susan_Katz_Miller_Being_Both-_Embracing_Two_Religions_in_One_Interfaith_Family.mp3"
        },
        {
            "title": "UUPP 027: Ariel Hunt-Brondwin of the Canadian Unitarian Council – Youth and Young Adult Programs",
            "datePublished": "Fri, 28 Aug 2015 06:00:40 +0000",
            "description": "Ariel Hunt-Brondwin of the CUC gives insight into the Youth program that crosses borders - GoldMine.\r\nUU Young Adults are expressing there needs and are involved in the creation of the Faith Architects Program to fulfill what they're up to.\r\nWhat's the story about how UUs in Canada and the U.S. went seperate ways  and were no longer under one umbrella of the UUA?\r\n\r\n\r\nBio:\r\nAriel Hunt-Brondwin is a life long UU who grew around Vancouver's lower mainland on un-ceaded Coast Salish territories. She currently makes her home in Toronto, Ontario, traditional territory of the Anishnabe, where she serves as the Youth and Young Adult Ministry staff for the Canadian Unitarian Council. Ariel delights in working with the UU youth and young adults of Canada, where she supports both regional and national conference planning as well as congregational Young and Young Adult ministry. This is a great mixture as it provides so many great outlets for creative collaboration with UU keeners and leaders of all ages and experience levels, as well as regular opportunities to participate in the magic of late night circle worships at Cons.\r\nContact Ariel:\r\nariel@cuc.ca\r\nLinks:\r\nCanadian Unitarian Council (CUC) cuc.ca\r\n\r\n \r\n\r\nFinal Credits: music thanks to:\r\n\r\n\"Carefree\", \"Open Those Bright Eyes\", \"Sweeter Vermouth\"\r\nKevin MacLeod (incompetech.com)\r\nLicensed under Creative Commons: By Attribution 3.0\r\nhttp://creativecommons.org/licenses/by/3.0/",
            "length": "29327330",
            "sourceUrl": "http://media.blubrry.com/theuuperspectivepodcast/content.blubrry.com/theuuperspectivepodcast/UUPP_027__Ariel_Hunt-Brondwin_CUC_Youth___Young_Adult_Programs.mp3"
        },
        {
            "title": "UUPP 026: UUSC – Stand Up For Refugee Women Detained in the U.S.",
            "datePublished": "Fri, 21 Aug 2015 05:40:49 +0000",
            "description": "Rachel Gore Freed is Senior Program Leader for Rights at Risk with the Unitarian Universalist Service Committee (UUSC).\r\nShe is giving you a personal account of what is happening at the 3 Detention Centers in Texas at Dilley and Karnes;  and Berks, Pennsylvania. Rachel will share what you can do to help.\r\nBackground:\r\nIt’s not a crime to seek asylum in the United States. Yet, at least 1,500 refugee women, many of whom are mothers, are currently detained in jail-like conditions in Texas and Pennsylvania. Many of these women have passed reasonable fear interviews and have been denied parole.\r\n\r\nAlthough bonds are afforded to mothers whose fears of returning to their home countries are found to be “credible” by an asylum officer, neither ICE nor the immigration judges will grant bonds to families passing the “reasonable” fear process (an even higher standard of proof for people not eligible for credible fear interviews). The withholding of bond along with the ICE policy of denying parole to all positive reasonable fear applicants have resulted in excessively long detention of these families. According to U.S. Citizenship and Immigration Services, at least 100 such families are currently being held in family detention facilities located in Karnes and Dilley, Texas, as well as Berks, Penn. On average, these children and their mothers are detained for nine months to one year, with several having already been detained for more than a year. Continuing to detain these women deeply conflicts with our U.S. values, including due process.\r\n\r\nOne of these refugee women is 19 years old and the mother of a four-year-old. She and her child fled Honduras and are now being held inside Karnes County Residential Center. Under the stress of living in detention, she attempted suicide. She is not alone. At the Berks County facility, another young mother — distraught over being detained for 11 months and counting —attempted to end her life. This spring nearly 80 other women detained at the Karnes facility participated in a hunger strike in hopes of bringing attention to their plight.\r\n\r\nHuman rights lawyers and advocates have reported that conditions inside these centers are similar to jail; they expose refugees to trauma, malnutrition, and depression. Standing up for these women and their families is a moral imperative.\r\n\r\nUUSC video about who they are:\r\n\r\n\r\nBio:\r\nRachel Gore Freed is a human rights lawyer with a wealth of domestic and international experience. As the Rights at Risk senior program leader, Freed spearheads, plans, and implements UUSC’s work responding to humanitarian crises and advancing the rights of people who are most overlooked or discriminated against in the midst of crises such as forced migration, large-scale conflicts, genocide, and natural disasters.\r\n\r\nPrior to joining UUSC, Freed litigated several environmental justice suits with the National Environmental Law Center. A passionate civil rights advocate, she previously represented low-income immigrants and detained asylum seekers pursuing relief from unjust deportation in New York City. She has also worked with the List Project on Iraqi refugee policy and served as cochair of the American Bar Association International Refugee Committee.\r\n\r\nFreed began her legal career clerking with the Charles Taylor prosecution team at the Special Court for Sierra Leone, where she focused on witness protection. In addition, she has worked with the Irish Center for Human Rights, the Center for Reproductive Rights, and the American Society for International Law. Freed holds a bachelor’s degree with a focus in international development from the George Washington Eliot School of International Affairs and a doctor of law degree from Vanderbilt University Law School.\r\nFavorite Quote:\r\n“To love. To be loved. To never forget your own insignificance. To never get used to the unspeakable violence and the vulgar disparity of life around you. To seek joy in the saddest places.",
            "length": "19368364",
            "sourceUrl": "http://media.blubrry.com/theuuperspectivepodcast/content.blubrry.com/theuuperspectivepodcast/UUPP_026_UUSC_Stand_Up_for_Refugee_Women_Detained_in_the_U.S.mp3"
        },
        {
            "title": "UUPP 025: UUA President Peter Morales",
            "datePublished": "Fri, 14 Aug 2015 05:22:19 +0000",
            "description": " \r\nPeter Morales - The visible spokesperson for Unitarian Universalism\r\nRising quickly from member to Seminarian, to religious leader and becoming UUA President, Peter Morales shares his passion for the future of Unitarian Universalism. Here are some of the quotables taken from this episode:\r\n\r\n-The largest religious group of people 35 and under is nothing (the nones.) This is a change from 12%-35% in the last century.\r\n-Our religious cousins in nearly 8 yrs have lost up to 1/4 of there members.\r\n-We are about where we were 10 yrs ago, less the past 3 yrs a 1% decline/yr. Although it's a bit misleading because 35%-40% of congregations are growing, 35% are declining and others in the middle are treading water.   -You went (to church) out of a sense of habit or obligation, those days are over .\r\n-Nothing is stable right now, the ones (congregations) with leadership will thrive, and others that are missing leadership will not thrive. It's about learning how to reach out to those 10s of millions who have become skeptical -Church has become a bad brand. Because of  how people associate with it we have to\r\nfind a way of reaching and engaging people beyond what we do in Sunday morning programming\r\n-So what's the solution? it's a problem with no obvious solution\r\n-How do we adapt to a new environment?\r\n-Interfaith work. We've never reached out as a faith organizations. There will be  more work in the coming year and is the future in this area. We can do it more easily than one of the other progressive faith communities can and I want us to live in to that possibility\r\n-We're multifaith at our core, theologically, so we're natural people to lead and convene this effort.\r\nBio:\r\nThe Rev. Peter Morales is the eighth president of the Unitarian Universalist Association (UUA). He was elected in June 2013 to a second four-year term.\r\n\r\nPrior to his election, Morales served as the senior minister at Jefferson Unitarian Church in Golden, Colorado. From 2002 to 2004, Morales was the UUA Director for District Services. He has also served on the UUA Board of Trustees, as trustee from the Mountain Desert District, and on the Unitarian Universalist Ministers Association (UUMA) Executive Committee, as the first person to carry its anti-racism, anti-oppression, multiculturalism portfolio.\r\n\r\nBefore entering the ministry, Morales was a Fulbright lecturer in Spain, a newspaper editor and publisher in Oregon, a Knight International Press Fellow in Peru, and a regional manager in California state government.\r\n\r\nMorales grew up in San Antonio, Texas. He graduated with a B.A. from the University of the Pacific in Stockton, California, in 1967. He earned his M.Phil in American Studies from the University of Kansas in 1976 and his M.Div. from the Starr King School for the Ministry in Berkeley, California, in 1999.\r\nQuote:\r\n“No other faith aligns with the emerging culture the way we do. No other faith has our potential to touch lives and change the world.” - Peter Morales\r\n\r\nContact:\r\n\r\npetermorales@uua.org\r\n\r\n \r\n\r\nFinal Credits: music thanks to:\r\n\r\n\"Carefree\", \"Open Those Bright Eyes\", \"Sweeter Vermouth\"\r\nKevin MacLeod (incompetech.com)\r\nLicensed under Creative Commons: By Attribution 3.0\r\nhttp://creativecommons.org/licenses/by/3.0/",
            "length": "28301732",
            "sourceUrl": "http://media.blubrry.com/theuuperspectivepodcast/content.blubrry.com/theuuperspectivepodcast/UUPP_025_UUA_President_Peter_Morales.mp3"
        },
        {
            "title": "UUPP 024: Author, Janet Mason – Finding Inspiration for Work and Life in the UU Faith",
            "datePublished": "Fri, 07 Aug 2015 06:09:40 +0000",
            "description": "Janet Mason - Author, Lay Leader -Incorporating Writings into Services\r\nJanet shares about her experience as a newbie to Unitarian Universalism, her involvement as a lay leader and how she incorporates her writings into the UUCR services. Hear how her book Tea Leaves came about and shares a personal story about her mother and her past.\r\n\r\nWhat is her advice for aspiring writers? \"Take yourself seriously.\"\r\nBio:\r\nJanet Mason is an author and lay minister at the Unitarian Universalist Church of the Restoration in Philadelphia. Her book Tea Leaves, a memoir of mothers and daughters was published in 2012 by Bella Books. She is a blogger for The Huffington Post and her commentary airs on This Way Out, the Los Angeles-based, international LGBT news syndicate. Since becoming a member of UUCR last year, she has incorporated pieces of fictions into her sermons, including a piece inspired by The Hebrew Bible called \"The Serpent\" and an excerpt from her recently completed book Art, a novel of revolution, love and marriage.\r\nFavorite Quote:\r\nPoetry is not a luxury. - Audre Lorde\r\nLinks:\r\nJanet Mason's author blog can be found at https://tealeavesamemoir.wordpress.com/\r\nShe can be found on:\r\nTwitter: @amusejanetmason \r\nYou Tube readings from Art\r\n\r\n\r\nTea Leaves by Mason, Janet (2012) Paperback\r\n\r\nFinal Credits: music thanks to:\r\n\r\n\"Carefree\", \"Open Those Bright Eyes\", \"Sweeter Vermouth\"\r\nKevin MacLeod (incompetech.com)\r\nLicensed under Creative Commons: By Attribution 3.0\r\nhttp://creativecommons.org/licenses/by/3.0/",
            "length": "20343307",
            "sourceUrl": "http://media.blubrry.com/theuuperspectivepodcast/content.blubrry.com/theuuperspectivepodcast/UUPP_024_Janet_Mason_Author_of_Art.mp3"
        },
        {
            "title": "UUPP 023: Race Forward - Taking Effective Action Towards Racial Justice!",
            "datePublished": "Fri, 31 Jul 2015 04:45:27 +0000",
            "description": "Race Forward - Center for Racial Justice Innovation!\r\nDarlene Pagano and Jyarland Daniels speak about the organization Race Forward. It advances racial justice through media, research and practice.  Gain the tools and knowledge to be effective inside of racial justice when speak with others or if you write about racial justice. It's not just Black and White, it's about all types of people including Hispanic, Native Americans, South Asians and Immigrants.\r\nTalked about in this episode:\r\n\r\n\tdon't allow racial fatigue\r\n\tSupreme Court activiy\r\n\timplicit bias\r\n\tminority/majority doesn't exist anymore\r\n\tmove away from individual acts of racism and help people identify systemic factors\r\n\tClocking In\r\n\tRace Research Report and its purpose\r\n\r\n \r\nBio:\r\n                                                                                                                                                                                        Darlene Pagano is the Business Associate for both Race Forward and Colorlines Magazine. She comes with over 30 years experience in collectively-owned, worker-run businesses, as well as management experience in several progressive for-profit ones.\r\n\r\nDarlene has been active in grassroots and local campaigns, starting in Dade County, Florida in the Pitts and Lee Defense Committee; organizing against the Edelin decision; participating in the Vietnam Moratoriums; coming to the SF Bay Area at the time of the People’s Bicentennial actions; on to the Bakke case; the Briggs initiative and other ad hoc actions. She worked in several movement collectives supplying educational, management and process assistance to left, progressive and labor organizations. In addition to having the privilege of working almost continuously in social change collectives, Darlene has been involved in the rich activist work in the Bay Area, as well as inspired by the Bay's abundant and astoundingly varied cultural scene.\r\n\r\nDarlene has worked on production of several books in the Herotica series by Down There Press, as well as writing for and editing a book of essays on feminism and sexuality, published by Frog in the Well.\r\n\r\nJyarland Daniels\r\nPrior to joining Race Forward, Jyarland Daniels was the Executive Director of The Metropolitan Detroit Truth & Reconciliation Commission on Racial Inequality where she led a community-based effort to conduct an analysis of structural and institutional racism in metro Detroit. Ms. Daniels, a 2012 graduate of Wayne State University Law School in Detroit, MI, chose the field of law to pursue justice, equality and be a voice for those facing discrimination on the basis of race, gender, sexual orientation and/or economic class. Prior to her legal studies, Ms. Daniels earned an MBA from the University of Michigan – Ann Arbor (2003) in marketing and finance. She has been a successful manager in corporate America, utilizing her talents in communication, team building and project management. Jyarland’s marketing and communication skills led to her success in well-known organizations including Hallmark Cards, Johnson & Johnson, Ford Motor Company, and Bentley Motors.\r\n\r\nMs. Daniels has lived in Japan and attended school in Germany and Japan. She has also had various international work assignments which have enhanced her ability to understand and effectively communicate across cultures.\r\n\r\nShe is a proud parent of a 14 year-old son. In her spare time she enjoys reading, traveling, exercise, public speaking, mentoring foster children and watching sports - especially her son's team - and reminding everyone that she's from Kansas.\r\nFavorite Quotes:\r\nJyarland: The ultimate measure of a man is not where he stands in moments of comfort and convenience but where he stans at times of challenge and controversy. - Martin Luther King Jr.\r\n\r\nIf yuu are silent you have chosen the side of the opressor. - Desmond Tutu\r\n\r\nDarlene: Justice is what love looks like in public. -  Cornell West \r\nLinks:\r\nRace Forward\r\n\r\n",
            "length": "43976036",
            "sourceUrl": "http://media.blubrry.com/theuuperspectivepodcast/content.blubrry.com/theuuperspectivepodcast/UUPP_023_Race_Forward-Advancing_Social_Justice.mp3"
        },
        {
            "title": "UUPP 022: UU College of Social Justice - Director Kathleen McTigue",
            "datePublished": "Fri, 24 Jul 2015 04:51:59 +0000",
            "description": "The UU College of Social Justice is a joint project of the UUA and UUSC and is based in Cambridge, MA. The mission of the College is to inspire and sustain faith-based justice work on issues of local, national and global importance. This mission is served through a variety of short-term experiential learning journey for adults of all ages, intensive justice programs for high school youth, and global summer internships for college-age young adults. All programs are grounded in faith-based study and reflection.\r\nBio:\r\nThe Rev. Kathleen McTigue is the Director of the UU College of Social Justice. Prior to accepting this position in 2012, she served as a parish minister for 25 years, first in North Carolina and then New Haven, CT. She currently resides in Boston, MA.\r\n\r\n \r\nFavorite Quote:\r\n\"If our religion plays a significant role in our lives, then it must do more than simply reinforce the values of our culture. In fact, …our values are often deeply counter-cultural. Articulating the ways these values challenge certain cultural ideas about wealth accumulation…for example, is part of what it means to be prophetic….Given the public dominance of conservative religious voices today, if religious liberals don’t speak up, no one else will know that there is another religious perspective.” - Paul B. Rasor from his book -  Reclaiming Prophetic Witness: Liberal Religion in the Public Square\r\n\r\nLinks:\r\nUU College of Social Justice\r\n\r\nTwitter: @UUCSJ\r\n\r\nVideo: Haiti: Beyond Just Recovery\r\n\r\n\r\nFinal Credits: music thanks to:\r\n\r\n\"Carefree\", \"Open Those Bright Eyes\", \"Sweeter Vermouth\"\r\nKevin MacLeod (incompetech.com)\r\nLicensed under Creative Commons: By Attribution 3.0\r\nhttp://creativecommons.org/licenses/by/3.0/",
            "length": "25345434",
            "sourceUrl": "http://media.blubrry.com/theuuperspectivepodcast/content.blubrry.com/theuuperspectivepodcast/UUPP_022_Kathleen_McTigue_UU_College_of_Socail_Justice_1.mp3"
        },
        {
            "title": "UUPP 021: Get the Skinny on the SI Fairy",
            "datePublished": "Thu, 16 Jul 2015 04:01:02 +0000",
            "description": "The SI Fairy is a tradition at Ohio Meadville District Summer Institute.\r\nFrom teaching the kids to ride bikes, paying double for lost teeth during the week - which creates a rival between her and the tooth fairy, to explosive (real fire) entrances, the Si Fairy entertains young and old alike!\r\n\r\nAn exclusive interview was given during Winter Institute 2015 and she made a special trip from her Florida winter hideaway to ask the most important questions that campers of both SI and WI have been dying to ask...as she \"hydrates\" through the whole thing!\r\n\r\nThe truth about the flaming  pole from news authority the Mockingbird:\r\n\r\n\r\n\r\n\"As somewhat wildly described in the Mockingbird from 2006, The Kaleidoscope published the picture, 'cause we gave it to them, but they Photoshopped the white squares out of it before they printed it. We claimed they were trying to hide the UFOs pursuing the Fairy, and it was off to the races from there. In fact, they were the reflections of the ceiling lights in the cafeteria, but we've never let the truth get too much in the way of a good story.\" - Cal Frye, Mockingbird Editor\r\n\r\n \r\n\r\n \r\n\r\n \r\n\r\n \r\nFun Fairy Facts:\r\nHt: 5'7\" (big fairy by normal standards) but invisible most of the time.\r\n\r\nWeight: as light as a feather\r\n\r\nWing Span: depends on how mad she gets AND they are not cockeyed!\r\n\r\nFavorite saying: \"Stay hydrated\" (H2O doesn't count)\r\n\r\nRival Fairies: Tinkerbell; Tooth Fairy; Titania\r\n\r\nFavorite Drink: The Liquid of Life: containing necture of dafodil, the spit of bee and fermented snail excrement\r\nLinks:\r\nThe infamous arm wrestling match with Fairy Titania\r\n\r\n\r\n\r\nHow Fairys Do It: Sorry no longer in print - darn!\r\n\r\nFinal Credits: music thanks to:\r\n\r\n\"Carefree\", \"Open Those Bright Eyes\", \"Sweeter Vermouth\"\r\nKevin MacLeod (incompetech.com)\r\nLicensed under Creative Commons: By Attribution 3.0\r\nhttp://creativecommons.org/licenses/by/3.0/",
            "length": "7273046",
            "sourceUrl": "http://media.blubrry.com/theuuperspectivepodcast/content.blubrry.com/theuuperspectivepodcast/UUPP_021_SI_Fairy_The_Exclusive_Interview_1_.mp3"
        },
        {
            "title": "UUPP 020: Hal Walker – Makes Unique Musical Contributions inside the UU Community",
            "datePublished": "Fri, 10 Jul 2015 04:03:23 +0000",
            "description": "Enjoy the musical insprirations of Hal Walker!\r\nFrom guitar to Banakulas he is a wealth of talent. You'll hear how his music has transformed over time. The freedom he has to use unique intruments at the UU Church of Kent has creates a rich musical community at the church. Also you'll hear a life changing moment that a near death experience had him realize he could no longer do the \"one-man show\" and had to reach out to other congregants to support the music that needed to be expressed.\r\nMusical Performances:\r\nYou'll hear him perform his song Everywhere, and an improv on the Khaen. Also an excerpt from his original song The 88 Counties of Ohio (accompanied with the Banakulas) that he would like to see as part of the educational cirriculum when students learn Ohio History during the 4th grade. The lyric sheet is in the form of a map! Also click to listen to the full version of a childrens choir singing the song.\r\n\r\nAll the music in this episode is performed and written by Hal Walker\r\n\r\nHal Walker Music is a great place to experience more of  his music!\r\n\r\nMore song links\r\n\r\n \r\n\r\n\r\n\r\n\r\n\r\n\r\nBio:\r\nHal Walker grew up in Kent, Ohio blowing the harmonica along the banks of the Cuyahoga River. As a veteran performer in Ohio, his creative and passionate style engages audiences of all ages. He composes and improvises on the piano, guitar, voice, harmonica, jaw harp and the khaen. (a mouth organ from NE thailand made out of bamboo pipes) Hal has a unique talent for taking an instrument associated with a particular culture, such as the khaen or the African banakulas, and, after experiencing how they are traditionally used, he then makes the instrument his own by playing them in a uniquely “Hal Walker” way. Walker is also an historian with a degree from Northwestern University. Although he has spent his entire post-college career as a musician, much of his music draws from his understanding of time and place. His CD, “Home in Ohio,” is a celebration of community, local history and life in Ohio.\r\n\r\nHal is an artist-in-residence with the Ohio Arts Council and a roster artist with the Center for Arts-Inspired Learning in Cleveland, Ohio. Since 1995, he has been the director of music at the Unitarian-Universalist church of Kent. Hal lives in Kent with a houseful of musical instruments and his 17 year old daughter, Hallie.\r\nFavorite quote:\r\nDon't Believe Everything You THINK!\r\nLinks:\r\nHal Walker on Facebook\r\n\r\nLearn to play Harmonica at Harmonica.com\r\n\r\n ",
            "length": "40325163",
            "sourceUrl": "http://media.blubrry.com/theuuperspectivepodcast/content.blubrry.com/theuuperspectivepodcast/UUPP_020_Hal_Walker_Unique_Musical_Contributions_to_the_UU_Community.mp3"
        },
        {
            "title": "UUPP 019: Connie Goodbread - Passionate Unitarian Universalist Looking Towards the Future",
            "datePublished": "Fri, 03 Jul 2015 05:39:50 +0000",
            "description": "Connie Goodbread - UU Uniquness Comes from the Three Pillars of UUism - Covenant, Pluralism and the Living Tradition\r\nWhat's the future of the UU congregations (the people) and the church (the building)? Can we reach out beyond the walls of the church and begin to share Unitarian Universalism to those who may not be interested in attending churches but yet identify with spirituality? It can't be just us inside our walls of the church. How are we reaching out.\r\nBio:\r\nConnie Goodbread is UUA Staff serving the Southern Region on the Congregational Life Staff Team.\r\nConnie has studied Healthy Congregation development and congregational conflict identification and transformation with Rev. Dr. Peter Steinke.\r\nShe has co-authored an emerging congregation process called, The Chrysalis Way. Connie is part of a team that redesigned and leads the Dwight Brown Leadership Experience and Southern Unitarian Universalist Leadership Experience. Connie has also co-authored Your Faith Home - a new UUA pamphlet.\r\nQuote:\r\nConnie's creation (it is also the mantra of the UUA Southern Region)\r\nFaith development is all we do.\r\nUnitarian Universalism is the faith we teach.\r\nThe congregation is the curriculum.\r\nLinks:\r\nUUA Southern Region Facebook\r\nLinkedin\r\n\r\n \r\n\r\n \r\n\r\nFinal Credits: music thanks to:\r\n\r\n\"Carefree\", \"Open Those Bright Eyes\", \"Sweeter Vermouth\"\r\nKevin MacLeod (incompetech.com)\r\nLicensed under Creative Commons: By Attribution 3.0\r\nhttp://creativecommons.org/licenses/by/3.0/",
            "length": "34741530",
            "sourceUrl": "http://media.blubrry.com/theuuperspectivepodcast/content.blubrry.com/theuuperspectivepodcast/UUPP_019_Connie_Goodbread_Passionate_Unitarian_Universalist_.mp3"
        },
        {
            "title": "UUPP 018: Why I Do The UU Perspective Podcast",
            "datePublished": "Fri, 26 Jun 2015 06:00:33 +0000",
            "description": "What Made Me Do It? OK, here it is in a nutshell of 4 minutes!\r\nAfter I was done interviewing LoraKim Joyner she began asking me about how this UU podcast came about. I have to say that several of the wonderful people I have interviewed in the past have asked the same question so I thought I would share it with you.  I really enjoyed how LoraKim asked me in such a wondering and curious way. Thanks LoraKim for asking me.\r\n\r\nNext week we'll be back to the regular schedule. So thanks again for listening!\r\n\r\n \r\n\r\n \r\n\r\nFinal Credits: music thanks to:\r\n\r\n\"Carefree\", \"Open Those Bright Eyes\", \"Sweeter Vermouth\"\r\nKevin MacLeod (incompetech.com)\r\nLicensed under Creative Commons: By Attribution 3.0\r\nhttp://creativecommons.org/licenses/by/3.0/",
            "length": "5054641",
            "sourceUrl": "http://media.blubrry.com/theuuperspectivepodcast/content.blubrry.com/theuuperspectivepodcast/UUPP_018_Why_I_Do_The_UU_Perspective_Podcast.mp3"
        },
        {
            "title": "UUPP 017: Listen to the Mockingbird - Laughing at Life is a Very Improtant Topic!",
            "datePublished": "Fri, 19 Jun 2015 07:18:53 +0000",
            "description": "Cal Frye and Phyllis Smith are the dynamic duo that create the Mockingbird a spoof on the events that take place at the Ohio Meadville district Summer Institute (and on occasion Winter Institute)\r\nWhat is the Mockingbird?\r\n\" The Premier Pub-lication of the Ohio Meadville District's (Unitarian Universalist) Summer Institute, The Mockingbird reserves the right to report make fun of everything at SI that needs it, and then some. Proudly helping SI campers blow beverages through their noses since 2005! All resemblance to persons, living or dead, is purely coincidental -- honest, it's the beer talking.\" - Cal Frye\r\n\r\nDont be a afraid to make fun of yourself! Cal and Phyllis are proven masters at this! Every year at Summer Insitute the spoof newpaper comes out each evening as everyone anxiously awaits at the pub to get their issue hot off the press. All satire and nothing serious, many are hopeful they have made it into this elusive paper. Your host of UUPP has even had her claim to fame the 1st year she attended SI when I was teaching One Stroke painting and the fun they had at critiquing our creative pieces of art. Ah but I digress. Anyways enjoy how the Mockingbird began, its evolution and its future. Be ready to LOL!\r\n\r\nPhyllis and Cal currently live in Oberlin and attend the of Oberlin Unitarian Universalist Fellowship and the town where the SI is now being held.\r\nBio:\r\nCal Frye was raised Methodist, with Universalist influences from family. Since 2000, he's been a member of several NE Ohio UU churches, currently serving Oberlin as chair of Building and Grounds, and the OMD as Treasurer. He works in IT for Oberlin College, and is a Celebrant endorsed by the American Humanist Association. He holds degrees in Physics and Paleontology, and can be found giving an impression of Charles Darwin from time to time in UU pulpits around the District. Cal and Phyl have been wisecracking together at least since mastodons walked the Earth.\r\nLinks\r\nRead online at simockingbird.com\r\n\r\nMockingbird Facebook page\r\n\r\nOhio Meadville Summer Institute - omdsi.org you can register for SI 2015 July 12-18.\r\n\r\n \r\n\r\nFinal Credits: music thanks to:\r\n\r\n\"Carefree\", \"Open Those Bright Eyes\", \"Sweeter Vermouth\"\r\nKevin MacLeod (incompetech.com)\r\nLicensed under Creative Commons: By Attribution 3.0\r\nhttp://creativecommons.org/licenses/by/3.0/",
            "length": "32218761",
            "sourceUrl": "http://media.blubrry.com/theuuperspectivepodcast/content.blubrry.com/theuuperspectivepodcast/UUPP_017_The_Mockingbird.mp3"
        },
        {
            "title": "UUPP 016: LoraKim Joyner - First Principle Project and Multi Species Ministry",
            "datePublished": "Fri, 12 Jun 2015 07:41:18 +0000",
            "description": "Rev. LoraKim Joyner - Wildlife Veterinarian and UUA's Multi Species and Entreprenuerial Ministry member making an impact from the U.S to Central America.\r\n \r\nMulti Species Minisitry\r\nHow to take care of the many and what does that mean. Seeking to change the First principle to include multi species inside the inherent worth and dignity of all.\r\nFirst Principle Project:\r\nIt takes 15 congregations or 1 distict to have a vote come to the GA floor. It would become a by-law change in the UUA. The vote has it be referred to a study committee as a 2 year process for discussion, study and  reflection, to then bring it back with suggested revisions/changes.\r\nCurrently there are 6 sponsoring congregations and 4 sponsoring organizations. She is confident that there will be the number needed by General Assembly 2016 and no later than 2017.\r\nEntrepreneurial Ministry\r\nThe UU Ministers Association has created a program called Beyond the Call. Approximately 30 UU ministers, rabbis, and UCC ministers are part of a 2 year training in entrepreneurial ministry which is about thinking outside the box and  beyond the church walls and how do we reach out to others that may not look like typical congregations.\r\n\r\nBio:\r\nRev. LoraKim Joyner is a Unitarian Universalist minister, having served in parish ministry for 10 years in North Carolina, Minnesota, Texas, and Florida. Currently she serves as a community minister in Multispecies Ministry and Compassionate Communication, affiliated with the Community Unitarian Church at White Plains. She draws on her training as a Certified Trainer in Nonviolent Communication to serve the UU Metro NY District as Right Relations Consultant. In addition she is the Director of One Earth Conservation and Ministry, where she works as a wildlife veterinarian and human dimension consultant in Latin American avian conservation. Currently she has projects in Guatemala, Belize, Honduras, Nicaragua, and Paraguay. When at home, she serves as the First Principle Project Facilitator.\r\nHer  favorite quote:\r\nWild Geese, by Mary Oliver.\r\n\r\nYou do not have to be good.\r\nYou do not have to walk on your knees for a hundred miles through the desert, repenting.\r\nYou only have to let the soft animal of your body love what it loves\r\nTell me about despair, your, and I will tell you mine.\r\nMeanwhile the world goes on.\r\n\r\n \r\nBonus Quotes/poems:\r\nA shorter one is adapted from William Blake:\r\n\r\nThey who bind to themselves a joy\r\nDo the winged life destroy;\r\nBut they who kiss the joy as it flies\r\nLive in eternity's sun rise.\r\n\r\nFrom the movie The Thin Red Line: One man looks at a dying bird and thinks there's nothing but unanswered pain. That death's got the final word, it's laughing at him. Another man sees that same bird, feels the glory, feels something smiling through it.\r\n\r\n \r\n\r\n \r\n\r\nLinks:\r\n\r\nContact LoraKim at amoloros@gmail.com\r\n\r\nFirst Principle Project - www.firstprincipleproject.org\r\n\r\n Conservationists Way Youtube Video\r\n\r\nOne Earth Conservation - http://www.oneearthconservation.org\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\nLafeber - http://lafeber.com/conservation/ (conservation blog)\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\nNurturing Nature: Yours, Ours, Theirs, the Earth's\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n \r\n\r\n ",
            "length": "29168796",
            "sourceUrl": "http://media.blubrry.com/theuuperspectivepodcast/content.blubrry.com/theuuperspectivepodcast/UUPP_016_LoraKim_Joyner_First_Principle_Project_Multi_Species_Ministry.mp3"
        },
        {
            "title": "Did You Want to Flip Down the Aisle When You Found Unitarian Universalism?",
            "datePublished": "Fri, 05 Jun 2015 04:10:38 +0000",
            "description": "New to Unitarian Universalism? Margalie made a 25 year journey from being shunned by her family, searching and unable to find a religious community she could be herself  in, and then discovering Unitarian Universalism to say, \"Where has it been all my life?\"\r\n \r\n\r\nMargalie Belizaire was a Jahovah's Witness until at age 19 she found she couldn't defend her parent's religion anymore. Shunned by her family she began a 25 years journey questioning and searching, still wanted to find a religious connection. She \"dragged\" herself to services, but never felt quite right at any of the Christian churches...\r\n\r\nUNTIL she stepped inside her first UU church.\r\nFlipping Down the Aisle!\r\nRemember Jake in the Blues Brothers when he saw the light and did  flips down the aisle? That's what Margalie says she felt like after that 1st service she attended at the UU Society of Cleveland.\r\n\r\n\r\n\r\nWhat's in Margalie's future?\r\nLooking forward to discovering spirituality and religion and now feels she finally can be herself.\r\nMargalie's Bio:\r\nMargalie Belizaire was born in Haiti, raised in Florida, lived I numerous places including 3 continents and somehow finds herself at home in Cleveland, Ohio since 2001. Her professional background is in social work and currently manages a Cuyahoga County Board of Developmental Disabilities center that serves adults with developmental disabilities. She loves the arts (especially the theatre) and traveling (both nationally and internationally). Margalie is passionate about community service, and volunteers generally with WVIZ Ideastream, Cleveland Internationsl Film Festival (CIFF) and Adoption Network. She's new to UU and is quite excited about membership.\r\n\r\nComtact Margalie at: mbeliza32@gmail.com\r\nFavorite Quote:\r\nLet us be kind to one another for most of us are fighting a hard battle. - Ian MacLaren\r\n\r\n \r\n\r\nFinal Credits: music thanks to:\r\n\r\n\"Carefree\", \"Open Those Bright Eyes\", \"Sweeter Vermouth\"\r\nKevin MacLeod (incompetech.com)\r\nLicensed under Creative Commons: By Attribution 3.0\r\nhttp://creativecommons.org/licenses/by/3.0/",
            "length": "28596584",
            "sourceUrl": "http://media.blubrry.com/theuuperspectivepodcast/content.blubrry.com/theuuperspectivepodcast/UUPP_015_Margalie_Belzaire_Journey_of_a_New_UU.mp3"
        },
        {
            "title": "UUPP 014: Baker's Dozen of Quotes and the Big UU Question from the Last 13 Episodes",
            "datePublished": "Fri, 29 May 2015 05:34:12 +0000",
            "description": "Baker's Dozen - Quotes and the Big UU Question\r\nPeople love quotes! So here are our first 13 episodes and all their quotes!\r\n\r\nAdditionally you're going to hear everybody's answer to the BIG QUESTION: As a religious denomination how are Unitarian Universalists  and Unitarians uniquely positioned to make a difference in the world?\r\n\r\nHow many have similar ideas when it comes to how UUs can make a difference?\r\n\r\nI had thought about including why the quotes inspire them but realized the episode would end up being too long. Please refer back to the podcast episode so you can  hear more about why the quote inspires them.\r\nFor all you quote collectors, feel free to copy and save them.\r\n \r\n\r\nRev. Rina Shere - Examine Yourself First - Dietrich Bonhoeffer\r\n\r\n \r\n\r\nLuke Scott\r\n\r\n\"Another glorious Sierra day in which one seems to be dissolved and absorbed and sent pulsing onward we know not where. Life seems neither long nor short, and we take no more heed to save time or make haste than do the trees and stars. This is true freedom, a good practical sort of immortality.” —John Muir\r\n\r\n \r\n\r\nAmber Scott\r\n\r\nfrom the song Thanksgiving Eve by Bob Franke:\r\n\r\nWhat can you do with your days\r\nBut work and hope\r\nLet your dreams bind your work to your play\r\nWhat can you do with each moment of your life\r\nBut love til you've loved it away\r\n\r\n \r\n\r\nCarrie Stewart\r\n\r\nOur deepest Fear is not that we are inadequate. Our deepest fear is that we are powerful beyond measure. - Mary Ann Williamson\r\n\r\n \r\n\r\nKC Slack\r\n\r\n\"It is easy to forget how full the world is of people, full to bursting, and each of them imaginable and consistently mis-imagined.\" - John Green, Paper Towns\r\n\r\n \r\n\r\nRev. Meg Riley\r\n\r\nAdrienne Rich wrote, in her book of prose, What Is Found There: Notebooks on Poetry and Politics:\r\n\r\n\"What if\"  is the first revolutionary question, the question the dying forces don't know how to ask. - Adrienne Rich\r\n\r\n \r\n\r\nRev. Melanie Davis\r\n\r\nThe Miracle of Right Thought\r\nBy Orison Swett Marden\r\n\"Do not be afraid to demand great things of yourself. Powers which you never dreamed you possessed will leap to your assistance.\"\r\n\r\n \r\n\r\nRev. Joe Cherry\r\n\r\n\"If we have any hope of improving the world and ourselves we must be bold enough to step into our discomfort, brave enough to be clumsy there, and loving enough to forgive ourselves and each other. May we as a people of faith be so bold, so brave, and so loving.\" -  Rev. Joe Cherry\r\n\r\n \r\n\r\nRev. Renee Ruchotzke\r\n\r\n\"There is no path to God that bypasses your neighbor.\" - Jesse Cavalier\r\n\r\n \r\n\r\nRev. Susan Ritchie\r\n\r\n\"I think there's no greater sign of God's goodness and forgiveness than that the church is allowed to exist.\" - Ann Dillard\r\n\r\n \r\n\r\nRev. Steve Dick\r\n\r\n“Fixing and helping create a distance between people, an experience of difference. We cannot serve at a distance. We can only serve that to which we are profoundly connected, that which we are willing to touch. Fixing and helping are strategies to repair life. We serve life not because it is broken but because it is holy. Serving requires us to know that our humanity is more powerful than our expertise” – Rabbi Rachel Naomi Remen\r\n\r\n \r\n\r\nAmy Collins, CLL\r\n\r\n“He drew a circle that shut me out-\r\nHeretic , rebel, a thing to flout.\r\nBut love and I had the wit to win:\r\nWe drew a circle and took him In ! -Edwin Markham\r\n\r\n \r\n\r\nRev. Scott Tayler\r\n\r\n“Whatever we can do, or dream we can do, let us begin it.  Boldness has genius and power and magic in it.  May we ever be bold in our living and loving.”- Closing words of First Unitarian Church of rochester NY, adapted from Goethe\r\n\r\n \r\n\r\n \r\n\r\n \r\n\r\nFinal Credits: music thanks to:\r\n\r\n\"Carefree\", \"Open Those Bright Eyes\", \"Sweeter Vermouth\"\r\nKevin MacLeod (incompetech.com)\r\nLicensed under Creative Commons: By Attribution 3.0\r\nhttp://creativecommons.org/licenses/by/3.0/",
            "length": "22911023",
            "sourceUrl": "http://media.blubrry.com/theuuperspectivepodcast/content.blubrry.com/theuuperspectivepodcast/UUPP_014_Bakers_Dozen-Quotes_and__the__Big_Question.mp3"
        },
        {
            "title": "UUPP 013: Scott Tayler - Multisites: Interconnection, Innovation, and Impact",
            "datePublished": "Fri, 22 May 2015 05:17:11 +0000",
            "description": "Scott Tayler - Multisites: Interconnection, Innovation, and Impact to Create Congregational Networking\r\nWith 2/3 of our congregations in the U.S. having memberships of 160 or less how can we work together with our existing resources to make us stronger as congregations and as Unitarian Universalists? Ministers coming out of seminary logically would want a full-time placement. Could that be provided with congregations who have part-time ministry, sharing a minister to create a full-time placement? It can start as an experiment to see if and what might work. Small steps to play with the idea of interconnection. Who can share staff (Religious Education, Administrative) the list can become whatever you make it. For those using monthly worship themes this can make it even easier to share resources such as youth leaders, pulpit guests and small group programs.\r\nBeyond that is collaborating with other religious liberals to make a strong impact in the world when it comes to important areas we serve such as social justice. Interfaith connections is an avenue to explore.\r\nThe UUA and CERG has resources to learn more about this and also bring trained staff in to explore this idea. Will this open a door to new conversations inside of your congregation?\r\nBio:\r\nScott Tayler is Director of Congregational Life, overseeing our Regional and District field staff, whose mission is to cultivate connections between congregations, inspire and coach new & innovative models of “doing church”, and empower existing congregations & their leaders to next level of impact. In short, our Congregational Life Teams serve \"Interconnection, Innovation and Impact.\"\r\n\r\nPreviously Scott served as Co-Senior Minister of the First Unitarian Church of Rochester, NY, where he and his staff team developed a small group system that engaged over half of their 1,000 members. Also during his time there, he supported the Rochester congregation entering into a \"yoked\" multisite partnership with the nearby UU Church of Canandaigua, NY—with the two churches now sharing programming & staff.\r\n\r\nemail: stayler@uua.org\r\nShow Quotes:\r\n(15:08) - When seperation is healed and connection is made, the holy, sacred, power of creativity arises out of that...\r\n\r\n(26:35) - \"... alone our vision is too narrow to see all that must be seen, and our strength to limited to do what all that must be done. Together, our vision widens and our strength is renewed.\" - Rev. Mark Moorison-Reed\r\n“Whatever we can do, or dream we can do, let us begin it.  Boldness has genius and power and magic in it.  May we ever be bold in our living and loving.”- Closing words of First Unitarian Church of rochester NY, adapted from Goethe\r\n\r\nLinks:\r\nMultisites information: UUmultisite.weebly.com\r\nKeynote talk on multisites\r\nFollow-up workshop\r\n\r\n \r\n\r\nFinal Credits: music thanks to:\r\n\r\n\"Carefree\", \"Open Those Bright Eyes\", \"Sweeter Vermouth\"\r\nKevin MacLeod (incompetech.com)\r\nLicensed under Creative Commons: By Attribution 3.0\r\nhttp://creativecommons.org/licenses/by/3.0/",
            "length": "26369177",
            "sourceUrl": "http://media.blubrry.com/theuuperspectivepodcast/content.blubrry.com/theuuperspectivepodcast/UUPP_013_Scott_Tayler_Multisites_1_.mp3"
        },
        {
            "title": "UUPP 012: The Commisioned Lay Leader (CLL) Program",
            "datePublished": "Fri, 15 May 2015 07:25:11 +0000",
            "description": "Amy Collins and Deb Chaney - Commissioned Lay Leader Program Supports the Spiritual Activity of the Church\r\n \r\n\r\nHave you ever wondered what kind of training you can get as a lay leader? Do you want to be more deeply involved in worship, pastoral care, religious education or any area you're passionate about? Plus, use your creativity to enhance other congregates emotional and spiritual needs.\r\n\r\nAmy and Deb give you a clear idea of what is involved in participating in the CLL program that originated in the Ohio-Meadville District and has just recently come to the St. Lawrence District - one nwe applicant as of February 2015!\r\n\r\nAmy Collins is CLL of the UU Society of Cleveland that has a full-time minister and Deb Chaney is CLL for the UU Congregation of Greater Canton, Ohio that has contracted ministers.\r\nAmy's Quote:\r\n“He drew a circle that shut me out-\r\nHeretic , rebel, a thing to flout.\r\nBut love and I had the wit to win:\r\nWe drew a circle and took him In ! Edwin Markham\r\n\r\nLinks:\r\nOhio-Meadville District CLL program\r\n\r\nAmy Collins on facebook\r\n\r\nAmymcollins@sbcglobal.net\r\n\r\nDeb Chaney on facebook\r\n\r\nDeborah.a.chaney@gmail.com\r\n\r\nCLL video from Renne Ruchotzke:\r\n\r\n\r\n\r\n \r\n\r\nFinal Credits: music thanks to:\r\n\r\n\"Carefree\", \"Open Those Bright Eyes\", \"Sweeter Vermouth\"\r\nKevin MacLeod (incompetech.com)\r\nLicensed under Creative Commons: By Attribution 3.0\r\nhttp://creativecommons.org/licenses/by/3.0/",
            "length": "50904980",
            "sourceUrl": "http://media.blubrry.com/theuuperspectivepodcast/content.blubrry.com/theuuperspectivepodcast/UUPP__012_Amy_Collins_and_Deb_Chaney_CLL_Program.mp3"
        },
        {
            "title": "UUPP 011: Steve Dick – International Council of Unitarians and Universalists",
            "datePublished": "Fri, 08 May 2015 04:45:58 +0000",
            "description": "Steve Dick from London, England Talks About Unitarians in Europe - how will congregations connect around the world?\r\nAll the way across the pond Steve Dick from London, England talks About Unitarians in Europe - How will congregations connect around the world? Steve is going to fill you with interesting stories about UUs and Unitarians in Europe!\r\n\r\nWhat is the International Council of Unitarians and Universalists? What is the ICUU purpose and how can you benefit from the organization. Steve is with us from London, England and he gives us more history on the evolution of Unitarians to Universalists and then Unitarian Universalism in the U.S. currently (refer to more UU history from Susan Ritchie- UUPP 010). It's amazing to learn the differences between the Unitarian Universalists and our friends across the pond who are Unitarians. We all may follow a similar design to our faith but yet the differences are distinct.\r\nCheck your international Uni knowledge. Can you answer the following (scroll down for answers):\r\n\r\n\tTransylvania is made up of __?__Unitarians\r\n\tAre the UUA Principles used globally?\r\n\tThe British dropped __?__  and are now known as Unitarians.\r\n\t A new Unitarian group was recently formed in the __?__\r\n\tThe ICUU offers conferences every 2 years - The next one (2016) is in the __?__ !\r\n\r\nSteve's Bio:\r\nSteve Dick is a British Unitarian minister born in the USA. Since 2009, he has been employed by the International Council of Unitarians and Universalists (ICUU), now as Executive Director. In the 1980s, Steve helped found European Unitarian Universalists (EUU) and several UU Fellowships in Europe. He also worked on the staff of the IARF for several years while in Germany. In the United Kingdom, he was minister to congregations in Croydon and Horsham followed by a decade as District Minister for London and the South East and a brief stint as Chief Executive Officer of the British Unitarians. Steve currently travels around the world working with Unitarian groups in other countries and cultures, discovering we often have more to learn from them than they from us.\r\nFavorite Quote:\r\n“Fixing and helping create a distance between people, an experience of difference. We cannot serve at a distance. We can only serve that to which we are profoundly connected, that which we are willing to touch. Fixing and helping are strategies to repair life. We serve life not because it is broken but because it is holy. Serving requires us to know that our humanity is more powerful than our expertise” – Rabbi Rachel Naomi Remen\r\nICUU Links:\r\nFacebook: www.facebook.com/InternationalUUs\r\nWeb: www.icuu.net\r\nTwitter: @ICUUinfo\r\nEmail list: ICUU circulates announcements about ICUU as well as news about developments in Unitarianism and Unitarian Universalism in other countries through an email list. Subscribing is a great way to keep up with international liberal religion and ICUU programs and activities. Anyone is welcome to be a subscriber.\r\nTo get this information delivered directly to your email inbox, click here to sign up.\r\n\r\nUUA International Programs Office\r\n\r\nUU Partner Church Council\r\n\r\n \r\nICUU Videos:\r\nConnecting with Unitarians and Unitarian Universalists Around the World FAITHFULLY \r\n\r\nThe Center and the Circle: The Challenge of International UU Ministry\r\n\r\nAfrica: A New World for Emerging Unitarian Universalist Movements \r\n\r\nICUU 20th Anniversary Video for Hungarian Unitarian Church \r\n\r\nInternational Worship Service at ICUU Council Meeting NY 2014 \r\n\r\n \r\n\r\nQuiz Answers:\r\n\r\n1. Christian; 2.No (listen at 21:40 for details); 3. Universalst; 4. & 5. Netherlands\r\n\r\n \r\n\r\nFinal Credits: music thanks to:\r\n\r\n\"Carefree\", \"Open Those Bright Eyes\", \"Sweeter Vermouth\"\r\nKevin MacLeod (incompetech.com)\r\nLicensed under Creative Commons: By Attribution 3.0\r\nhttp://creativecommons.org/licenses/by/3.0/\r\n\r\n ",
            "length": "42033439",
            "sourceUrl": "http://media.blubrry.com/theuuperspectivepodcast/content.blubrry.com/theuuperspectivepodcast/UUPP_011_Steve_Dick_050815.mp3"
        },
        {
            "title": "UUPP10: Rev. Dr. Susan Ritchie- UU Historian, Author, and Her Puppet Minstry run by UU Yew Diva Miss Merrily",
            "datePublished": "Fri, 01 May 2015 09:59:04 +0000",
            "description": "Rev. Dr. Susan Ritchie - Historian, Author, and Miss Merrily's Right Hand  (or at least she guides Miss Merrily with her right hand) when puppet ministry is run by a UU Ewe.\r\nEver curious about the history of Unitarian and Universalism? Susan takes you back to Transylvania where it began and tells you how it emerged.\r\n\r\nAn update on her up and coming book “Unitarian Pirates of the Carribean: Issues in UU Polity” and the story of how it came to being.\r\n\r\nWhere did Miss Merrily come from? And how did she become the Diva of puppet ministry? Plus a special audio interuption from Miss Merrily!\r\n\r\n \r\n\r\n \r\n\r\n \r\nSusan's Bio:\r\nRev. Dr. Susan Ritchie has been the minister of the North Unitarian Universalist Congregation in Lewis Center, Ohio since 1996. She also serves on the UUA Board of Trustees, and as UUA Secretary. Her book, “Children of the Same God: the Historical Relationship Between Unitarianism , Judaism and Islam” was published by Skinner House last Spring. She is currently working on “Unitarian Pirates of the Carribean: Issues in UU Polity”\r\n\r\ncontact Susan at: sritchie@uua.org\r\nFavorite Quote: :\r\n\"I think there's no greater sign of God's goodness and forgiveness than that the church is allowed to exist.\" - Ann Dillard\r\n\r\nSusan says, \"...that might sound a tiny bit cynical, but I find it helpful in remembering that it's kind of the purest expression of faith I think, to understand that our institutions will sometimes fail us precisely because they are  human institutions. But that's not the same thing as faith itself.\"\r\n\r\nLinks:\r\n\r\nChildren of the Same God: The Historical Relationship Between Unitarianism, Judaism, and Islam\r\n\r\n               \r\n\r\n \r\n\r\n \r\n\r\n \r\n\r\n \r\n\r\nFinal Credits: music thanks to:\r\n\r\n\"Carefree\", \"Open Those Bright Eyes\", \"Sweeter Vermouth\"\r\nKevin MacLeod (incompetech.com)\r\nLicensed under Creative Commons: By Attribution 3.0\r\nhttp://creativecommons.org/licenses/by/3.0/",
            "length": "27374554",
            "sourceUrl": "http://media.blubrry.com/theuuperspectivepodcast/content.blubrry.com/theuuperspectivepodcast/UUPP_010_Susan_Ritchie-UU_Historian_and_Author.mp3"
        },
        {
            "title": "UU Leadership Programs to Develop Awesome Lay Leaders",
            "datePublished": "Fri, 24 Apr 2015 09:26:16 +0000",
            "description": " \r\n\r\n \r\n Rev. Renee  Ruchotzke - Helping  Lay Leaders To  Become Awesome!\r\nHave you ever wondered where you could get leadership training to turn you into an awesome leader? Or assist in the forward motion of your UU congregation? Rev. Renee Ruchotzke provides resources from free videos to webinars. Along with training materials that you can study at home and then engage with groups from your congregation and other UU congregations.\r\nAbout Renee:\r\nRev. Renee Ruchotzke has served as Congregational Life Staff in the Central East Region since September of 2010. As program manager for Leadership Development, she is responsible for providing consultation, programming and training material (including webinars and videos) on various aspects of congregational leadership and development. Renee is also Dean of the UU Leadership Institute (formerly known as H-UULTI).\r\n\r\nLeran more about Renee at: UUA.org\r\nRenee's calling:\r\nMy call to ministry is to help lay leaders become awesome so they can help their congregations to be vibrant and vital.\r\nRenee's Favorite Quote:\r\n\"There is no path to God that bypasses your neighbor.\" - Jesse Cavalier\r\nLinks:\r\nUUA Blog: Growing Vital Leaders\r\nOnline Leadership School\r\nOn-demand Leadership Team Institute Website link\r\nRenee on Facebook\r\nYouTube - Growth Cycles of congregations - Cerguua\r\n\r\nFinal Credits: music thanks to:\r\n\r\n\"Carefree\", \"Open Those Bright Eyes\", \"Sweeter Vermouth\"\r\nKevin MacLeod (incompetech.com)\r\nLicensed under Creative Commons: By Attribution 3.0\r\nhttp://creativecommons.org/licenses/by/3.0/\r\n\r\n ",
            "length": "26213001",
            "sourceUrl": "http://media.blubrry.com/theuuperspectivepodcast/content.blubrry.com/theuuperspectivepodcast/UUPP_009_Renee_Ruchotzke.mp3"
        },
        {
            "title": "UUPP 008: Rev. Joe Cherry – What Moment Brought Tears To Your Eyes?",
            "datePublished": "Fri, 17 Apr 2015 09:47:01 +0000",
            "description": " \r\n\r\n \r\n Rev. Joe Cherry - What Moment  Brought Tears To Your Eyes? -  Tell That Story!\r\nRev. Cherry is  minister at the Unitarian Universalist Society of Cleveland. Before  moving to Cleveland he and his partner the Reverend Denis Paul  lived in the  Central Valley of California, where they both had ministries. Joe was the only  minister serving three counties while there. Joe has been a UU for 19 years and his home church is the First Unitarian Society of Chicago.  He graduated from the Meadeville Lombard Theological School. He also served  at the UU church in Dukinfield, UK. (About 8 miles East of Manchester) for a summer internship.\r\n Questions for Joe that you'll hear the answers to:\r\nWhat was your experience in the UK UU Church?\r\n\r\nWhat special project have you worked on?\r\n\r\nWhat is the biggest pain people are expressing when they are coming into Unitarian Universalism?\r\n\r\nHow do we let people more fully know that this faith can be for them.\r\n\r\nWhat is the biggest hurdle to get over in order to express Unitarian Universalism?\r\nAre we lost for words when trying to explain Unitarian Universalists to people?\r\n\r\nWhat's the best way to speak about Unitarian Universalism with ease?\r\nJoe's Gems:\r\n\"As your minister it isn't important what you believe or where you end up. What's important is that you're  engaged in the process...\"\r\n\r\n\"...helping people to come to a place of greater peace.\"\r\n\r\n\"We have a homecoming experience as we discover we are UU.\"\r\n\r\n\"What moment in your life since being a UU brought tears to your eyes? that's what you should be talking about.\"\r\n\r\nJoe turned the interview on me asking:\r\n\r\n\"What is it about you that makes you one of us (a UU)\"\r\n\r\nHow will you answer this question?\r\nPopular Quotes Rev. Joe Referred To:\r\nIf it is not the desire for heaven or social approval, it is the desire for the feeling of self-satisfaction which comes from following the dictates of conscience or from retaining one’s self-respect by being true to one’s ideals. – Marshall M. Knappen, Tudor Puritanism\r\n\r\n\"I am a human being, nothing human is alien to me.\" - Terence (2nd century)\r\n\r\nJoe's published Prayer he created in a workshop that has been used in various venues from General Assembly (GA) to the Selma worship service.\r\n\r\n\"If we have any hope of improving the world and ourselves we must be bold enough to step into our discomfort, brave enough to be clumsy there, and loving enough to forgive ourselves and each other. May we as a people of faith be so bold, so brave, and so loving.\"\r\n\r\n \r\n\r\nFinal Credits: music thanks to:\r\n\r\n\"Carefree\", \"Open Those Bright Eyes\", \"Sweeter Vermouth\"\r\nKevin MacLeod (incompetech.com)\r\nLicensed under Creative Commons: By Attribution 3.0\r\nhttp://creativecommons.org/licenses/by/3.0/",
            "length": "35008068",
            "sourceUrl": "http://media.blubrry.com/theuuperspectivepodcast/content.blubrry.com/theuuperspectivepodcast/UUPP_008_Joe_Cherry_041715.mp3"
        },
        {
            "title": "UUPP 007: Dr. Melanie David - OWL - Sexuality Education",
            "datePublished": "Fri, 10 Apr 2015 08:00:28 +0000",
            "description": "Were You Taught Sex Education like this?\r\nDr. Melanie Davis at the UUA is the OWL Program Associate who drives the Sexuality Education cirriculum that is available for ages 5-95. Her expertise allows her to be innovative and create the revisions to keep the program up to date.\r\n\r\nHear what the OWL cirriculum has to offer for each age group and you'll get the inside scoop on the new program for age 50+ that many are asking to be a part of the pilot program once it's complete. Who uses the OWL programs? You'll hear that the secular community along with the UU and UCC faiths use this program immensly.\r\n\r\n \r\nMelanie Davis Bio:\r\nDr. Melanie Davis is the UUA’s Our Whole Lives Program Associate, and she is a Certified Sexuality Educator and Supervisor through the American Association of Sexuality Educators, Counselors and Therapists. She teaches human sexuality courses at Moravian Theological Seminary, Moravian College, and Widener University, and she is the co-president of the Sexuality and Aging Consortium. Dr. Davis does sexuality training for healthcare providers and educators and offers private sexuality education consulting through the New Jersey Center for Sexual Wellness.\r\n\r\nMelanie is a member of the UU Congregation of Somerset Hills in central New Jersey. She is a member of the UU Trauma Response Ministry.\r\nMalanie's Favorite Quote:\r\nThe Miracle of Right Thought\r\nBy Orison Swett Marden\r\n\"Do not be afraid to demand great things of yourself. Powers which you never dreamed you possessed will leap to your assistance.\"\r\nLinks to check-out:\r\nGeneral information about OWL\r\n\r\nFacilitator training calendar\r\n\r\nUpdate 5/1/15 New release:\r\n\r\nOur Whole Lives: Sexuality Education for Grades 7-9, the second edition\r\n\r\nA sexuality education program for youth that models and teaches caring, compassion, respect, and justice. A holistic program that moves beyond the intellect to address the attitudes, values, and feelings that youth have about themselves and the world. Order a copy.\r\n\r\n \r\nContact Melanie at:\r\nhttp://www.melaniedavisphd.com\r\n\r\n\r\nMelanie's  new book, \"Look Within: A Woman's Journal\"\r\n\r\n\r\n\r\nFinal Credits: music thanks to:\r\n\r\n\"Carefree\", \"Open Those Bright Eyes\", \"Sweeter Vermouth\"\r\nKevin MacLeod (incompetech.com)\r\nLicensed under Creative Commons: By Attribution 3.0\r\nhttp://creativecommons.org/licenses/by/3.0/",
            "length": "26988464",
            "sourceUrl": "http://media.blubrry.com/theuuperspectivepodcast/content.blubrry.com/theuuperspectivepodcast/UUPP_007_Melanie_Davis_OWL_0401015_1.mp3"
        },
        {
            "title": "Meg Riley-Church of the Larger Fellowship (CLFUU)",
            "datePublished": "Fri, 03 Apr 2015 09:44:46 +0000",
            "description": "Meg Riley - Senior Minister for the Church of the Fellowship\r\nMeg gives you an inside look at the history of the church, its mission, and it's future. Learn about the prison outreach and the impact it has. Here about what's provided for the members who range from busy business people to people in remote areas and those that may not have the ability to come to a brick and mortar church.\r\n\r\nMeg shares her journey becoming a UU and what it was like being with people who were less than happy about her choice.\r\nMeg Riley Bio\r\nI am thrilled beyond words to serve what I consider the most creative, unusual, spiritual community in the world! In this congregation without walls, my responsibilities include spiritual leadership, working with others to envision our future, preaching, counseling, and being a general gadfly.\r\nBefore coming to the CLF, I served the Unitarian Universalist Association in a variety of positions including directing the Advocacy and Witness Programs, Washington Office for Advocacy, Office of Gay, Lesbian, Bisexual Transgender Concerns, and Youth Office. I directed the Standing on the Side of Love campaign and the Unitarian Universalist response to Hurricane Katrina.\r\nI have served many national boards of directors including the Interfaith Alliance, Americans United for Separation of Church and State, and the Religious Coalition for Reproductive Choice. I’ve been founding president of two organizations, Faith in Public Life and Equal Partners in Faith.\r\nIn short, I have spent my life’s work advocating for a world of peace and justice. In so doing, I became quite interested in the media revolution taking place, and in the opportunity to create deep and meaningful community on the internet. I live in South Minneapolis with my human and animal family.\r\nYou can find me daily on the CLF facebook page, through the CLF twitter account, by leaving a message at 800-231-3027, and through email, mriley@clfuu.org\r\n Meg's Favorite Quote:\r\nAdrienne Rich wrote, in her book of prose, What Is Found There: Notebooks on Poetry and Politics:\r\n\r\nWhat if is the first revolutionary question, the question the dying forces don't know how to ask. - Adrienne Rich\r\n\r\nAs Meg added, It's a question that will take you anywhere.  It's question that can open a new door... What IF, black life matters?\r\nLinks you might be interested in:\r\nhttp://www.Questformeaning.org\r\n\r\nhttp://www.CLFUU.org\r\n\r\nhttp://www.Thedailycompass.org\r\n\r\nCLF Facebook page: http://www.facebool.com/CLFUU?fref=ts\r\n\r\n \r\n\r\nFinal Credits: music thanks to:\r\n\r\n\"Carefree\", \"Open Those Bright Eyes\", \"Sweeter Vermouth\"\r\nKevin MacLeod (incompetech.com)\r\nLicensed under Creative Commons: By Attribution 3.0\r\nhttp://creativecommons.org/licenses/by/3.0/",
            "length": "37277852",
            "sourceUrl": "http://media.blubrry.com/theuuperspectivepodcast/content.blubrry.com/theuuperspectivepodcast/UUPP_006_Meg_Riley_CLFUU_04032015.mp3"
        },
        {
            "title": "Peggy Lagodny - Sharing Paganism with Unitarian Universalists",
            "datePublished": "Fri, 27 Mar 2015 04:03:43 +0000",
            "description": " \r\n\r\n \r\nAs an eclectic pagan, Peggy Lagodny incorporates her practices into UU worship.\r\nPeggy has led monthly Earth-Centered Spirituality Groups and Pagan 101 Classes sharing ritual with a variety of people. She is a member of the UU Society of Cleveland and has participated on the worship team for several years.\r\n\r\nPeggy Lagodny describes herself as, \"Gracefully aging (sort of), witchy, quicksilver sliding into wisdom (I hope). I'm a liturgy junkie and love creating ritual.\"\r\nPeggy's Favorite Quote:\r\nfrom the Charge of the Goddess by Doreen Valiente\r\nAnd you who seek to know Me, know that the seeking and yearning will avail you not, unless you know the Mystery: for if that which you seek, you find not within yourself, you will never find it without.\r\nFor behold, I have been with you from the beginning, and I am That which is attained at the end of desire.\r\nLinks of Interest:\r\nReclaiming … main site … http://www.reclaiming.org/\r\n\r\nWitch Camps … http://witchcamp.org/\r\n\r\nCUUPS … http://www.cuups.org/\r\n\r\n \r\n\r\n \r\n\r\nFinal Credits: music thanks to:\r\n\r\n\"Carefree\", \"Open Those Bright Eyes\", \"Sweeter Vermouth\"\r\nKevin MacLeod (incompetech.com)\r\nLicensed under Creative Commons: By Attribution 3.0\r\nhttp://creativecommons.org/licenses/by/3.0/",
            "length": "28489994",
            "sourceUrl": "http://media.blubrry.com/theuuperspectivepodcast/content.blubrry.com/theuuperspectivepodcast/UUPP_005_Peggy_Lagodny_032715_1.mp3"
        },
        {
            "title": "UUPP 004: KC Slack - A Seminarian's Ministry",
            "datePublished": "Fri, 20 Mar 2015 04:01:35 +0000",
            "description": " \r\n\r\n \r\nKC Slack - A Seminarian's Ministry\r\n \r\n\r\nEver wonder what it's like to choosing to attend seminary after being a UU for only three years? KC gives you a unique perspective about her journey becoming a seminarian. You will also hear how she unexpectedly came to engage with the homeless during her commute and the relationships she developed. Enjoy this candid interview with KC Slack.\r\n\r\n \r\n\r\nKC Slack is a second year seminarian at Starr King School for the Ministry, and the Student Minister for Religious Education at the Unitarian Universalist Church in Livermore. Originally from Cleveland, Ohio, and a member of the UU Society of Cleveland,  KC earned a BA in Political Science and spent several years working as a patient advocate in an abortion clinic before heading off to seminary. She is passionate about social justice, and  she can often be found reading, yelling on the internet, or deep in conversation with friends. She also loves to dance, spend time with friends and loved ones, and hang out with her two cats, Lyndon and Denny.\r\nKC's Favorite Quote:\r\n\"It is easy to forget how full the world is of people, full to bursting, and each of them imaginable and consistently mis-imagined.\" - John Green, Paper Towns\r\n Where To Find KC:\r\nBlog: https://unexpecteddivinity.wordpress.com/\r\n\r\nTwitter: https://twitter.com/kcslack\r\n\r\n \r\n\r\n \r\n\r\nFinal Credits: music thanks to:\r\n\r\n\"Carefree\", \"Open Those Bright Eyes\", \"Sweeter Vermouth\"\r\nKevin MacLeod (incompetech.com)\r\nLicensed under Creative Commons: By Attribution 3.0\r\nhttp://creativecommons.org/licenses/by/3.0/\r\n\r\n ",
            "length": "30335005",
            "sourceUrl": "http://media.blubrry.com/theuuperspectivepodcast/content.blubrry.com/theuuperspectivepodcast/UUPP_004_KC_Slack_seminary_and_the_homeless.mp3"
        },
        {
            "title": "UUPP 003: Carrie Stewart Discusses New Jim Crow Classes and Role As A Smart Church Consultant",
            "datePublished": "Fri, 13 Mar 2015 03:48:23 +0000",
            "description": " \r\n\r\n \r\nCarrie Stewart - Facilitator of  the New  Jim Crow Classes and  Smart Church  Consultant\r\nNew Jim Crow Classes (quick summary)\r\nBecause of mass incarceration we have the New Jim Crow. Black Americans are imprisoned at a higher rate than whites. Drugs are used at the same rate for all races but blacks are incarcerated at the highest rate.\r\nThe New Jim Crow Classes: Tracks can range from a weekend to a 6 week program.\r\n\r\nBased on six chapters of Michelle Alexander's,  The New Jim Crow: Mass Incarceration in the Age of Colorblindness, each chapter takes you through the different pieces that have been put together to make mass incarceration effective in a way as Michelle puts it, at making a co-class of citizens you don't have to care about.\r\n\r\nThe impact: People are shocked! The way Michelle Alexander connects the dots, we see over time the slow erosion of our civil rights...\r\n\r\nNew Jim Crow resource \r\n\r\nSmart Church (quick summary)\r\nThe term Smart Church developed from the reference to the family system theory. It's about creating healthy congregations by implementing congregational systems.\r\nGoals can include bringing cohesiveness and communication. The benefit can be greater member retention.\r\nPeople naturally avoid conflict. If members leave, sometimes the conflict can stay.\r\n\r\nThere are many congregations that may need this without realizing it. Leaders try to use everything within their knowledge to get things done, but yet struggle without some of these specific skills that could guide them to a healthier church.\r\nWant more info? Visit: Smart Church Consultants \r\nBio:\r\nCarrie Stewart is the Owner and Principal of One World Consulting, Carrie has served various communities and organizations in their quest for greater understanding, and inclusion of diverse individuals.\r\nA lifelong UU, Carrie has been a child, youth, member and friend of 13 congregations in 6 districts. She currently serves as a SWUUC and Southern Region Consultant specializing in anti-racism, anti-oppression and multiculturalism, conflict transformation, leadership, Compassionate Communication and Healthy Congregations. Additionally, she serves on the SWUUC Board, The Journey Toward Wholeness Transformation Committee of the UUA, the UU Allies for Racial Equality Steering Committee, and is a DBLE Staff member. She holds a bachelor’s degree in American Studies from Smith College, and a masters in Communication from Rutgers University. Carrie and her spouse are raising two, third generation UU teens in Colleyville, TX where they enjoy movies, theater, music, Saturday Night Live, travel (especially to water), and their two dogs.\r\nCarrie's Favorite Quote:\r\nOur deepest Fear is not that we are inadequate. Our deepest fear is that we are powerful beyond measure. - Mary Ann Williamson\r\nCarrie's Answer To The Question:\r\nHow is Unitarian Universalism as a religious denomination uniquely positioned to serve and impact society? Carrie says if we make racism and social justice the corner-stone of our work, we can literally change the world.\r\n\r\n \r\ncontact Carrie: \r\nCarrie L. Stewart, M.C.I.S.\r\nOne World Consulting\r\n5407 Sycamore Court   Austin, Texas  76034\r\n817-685-2542(H)   512-350-9030(O/M) OneWorldConsulting@swbell.net\r\n \r\n\r\nBooks of interest:\r\n\r\nThe New Jim Crow: Mass Incarceration in the Age of Colorblindness by Michelle Alexander\r\n\r\nGet the paperback version as it has the forward by Cornel West (2015 GA Ware Lecturer)\r\n\r\n\r\n\r\nThe New Jim Crow Study Guide and Call to Action\r\n\r\n\r\n\r\nHealthy Congregations: a Systems Approach by Peter Steinke\r\n\r\n\r\n\r\nCongregational Leadership in Anxious Times: Being Calm and Courageous No Matter What\r\n\r\n\r\n\r\nFinal Credits: music thanks to\r\n\r\n\"Carefree\", \"Open Those Bright Eyes\", \"Sweeter Vermouth\"\r\nKevin MacLeod (incompetech.com)\r\nLicensed under Creative Commons: By Attribution 3.0\r\nhttp://creativecommons.org/licenses/by/3.0/",
            "length": "29555979",
            "sourceUrl": "http://media.blubrry.com/theuuperspectivepodcast/content.blubrry.com/theuuperspectivepodcast/UUUP_003_carrie_stewart_031115.mp3"
        },
        {
            "title": "UUPP 002: Young Adults, Amber and Luke Scott – Paths To Our Future",
            "datePublished": "Fri, 06 Mar 2015 06:32:58 +0000",
            "description": "Amber and Luke Scott\r\nNow young adults, Amber and Luke Scott whose home church is the UU Church of Kent, are as Luke says, \"home-grown UUs.\" They have grown in their church being active in various  youth groups, committees and conferences.\r\nThey Experienced:\r\nYouth retreats that revealed intense issues that gave them a better perspective and motivation for justice through intellectual discussions. This helped them to deal with challenges\r\n\r\nHaving beliefs challenged and being mindful of the inherent worth and dignity of others.\r\nInspired by:\r\ntheir Grandfather and other peers,\r\nWhat's the vision for the future of the denomination?\r\nAmber: Diversity of worship experiences is important along with navigating the needs of everyone. Luke: More personal connection and intellectual stimulation is needed in the age of social media.\r\nWhat's in their future?\r\nRoles related to youth programs? church board participation? Religious Education?\r\nAmber Scott\r\nAmber is a 28 year-old UU living in Columbus, Ohio. She is finishing her  third year on the Planning Committee for OMD Summer  Institute, and is also serving on this year's steering committee for Opus,  the annual continental UU young adult spiritual retreat. This summer  Opus is being held in Ohio! Amber spends half of her working life in the office of the nonprofit Secular Student Alliance, and half in a Whole Foods Market kitchen. Outside of work Amber spends most of her time riding her bicycle, performing in a local burlesque troupe, and learning trapeze.\r\nFavorite Quote:\r\nfrom the song Thanksgiving Eve by Bob Franke:\r\n\r\nWhat can you do with your days\r\nBut work and hope\r\nLet your dreams bind your work to your play\r\nWhat can you do with each moment of your life\r\nBut love til you've loved it away\r\n\r\nContact info:\r\nmiss.amber.makes.art@gmail.com\r\nLinks:\r\n\r\nOMD Summer Institute 2015\r\nJuly 12-18, 2015\r\n\r\nOpus 2015: Summerfest\r\nAugust 19-23, 2015\r\nLuke Scott\r\nLuke, like his sister Amber, grew up attending the UU Church of Kent. He now lives in Columbus, Ohio and works at Cardinal Health in Human Resources. and still keeps in touch with his network of UU friends from Ohio Meadville District youth conferences as well as the youth and young adult programs at OMD Summer Institute. Luke is a graduate of the Ohio State University class of 2013 and enjoyed the months following his graduation in Yosemite National Park and at Heavenly ski resort in Lake Tahoe before returning to Columbus.\r\nFavorite Quote:\r\n\"Another glorious Sierra day in which one seems to be dissolved and absorbed and sent pulsing onward we know not where. Life seems neither long nor short, and we take no more heed to save time or make haste than do the trees and stars. This is true freedom, a good practical sort of immortality.” —John Muir\r\n\r\nLinks:\r\n\r\nColumbus UU Young Adult Facebook Group -  use for casual UU meet-ups, potlucks, etc.\r\n\r\nOMD Youth Adult Committee page - youth events in OMD that were so beneficial/influential growing up\r\n\r\nOMD UU Young Adult Network Facebook Group - current OMD district-wide events, etc.\r\n\r\nContact Luke:\r\n\r\nlukelukescott@gmail.com\r\n\r\n \r\n\r\nFinal Credits: music thanks to\r\n\r\n\"Carefree\", \"Open Those Bright Eyes\", \"Sweeter Vermouth\"\r\nKevin MacLeod (incompetech.com)\r\nLicensed under Creative Commons: By Attribution 3.0\r\nhttp://creativecommons.org/licenses/by/3.0/",
            "length": "36331679",
            "sourceUrl": "http://media.blubrry.com/theuuperspectivepodcast/content.blubrry.com/theuuperspectivepodcast/Amber_and_Luke_Scott_002_030515.mp3"
        },
        {
            "title": "Rina Shere - Beloved Conversations Making a Difference",
            "datePublished": "Fri, 27 Feb 2015 18:07:44 +0000",
            "description": " \r\nRina Shere - Beloved Conversations Making A Difference\r\nRina Shere currently  serves as the Director of  Lifespan Faith  Development for the  Unitarian Universalist  Society of Cleveland. She   is in her last year of    seminary at the  Methodist Theological  School of Ohio, and is  working on ordination in  the Unitarian  Universalist religion. Prior to her church service Rina worked in arts education and social services for twenty years. She lives in Shaker Heights, OH with her husband, two teen age sons and two cats. Rina is a passionate gardener and arts enthusiast.\r\n\r\nBeloved Conversations\r\nDr. Mark Hicks developed a curriculum to talk about privilege and race. As our denomination is primarily white, this curriculum deals with the issue of how to become a place of worship that is open and affirming to all kinds of people.\r\nAn 8 week course done in small groups with Dr. Hicks initially performing a weekend intensive. Through small groups and journal exercises, you look at the very dynamic of racism in american life.\r\nIt's about being introspective. Feeling uncomfortable is a necessary part of change. Investigating how we learned our ideas about racism and who we are, about the communities we grew up in, how issues of diversity were handled in our family of origin.  And then doing an audit of the congregation in terms of musical diversity, are welcoming staff and greeters trained properly,  board and committee structure.\r\n\r\nRina's Favorite Quote: \r\nExamine Yourself First - Dietrich Bonhoeffer\r\nLinks:\r\n\r\n More information on the Beloved Conversations program and curriculum.\r\n\r\nUU Society of Cleveland\r\n\r\nContacting Rina:\r\n\r\nUU Society of Cleveland - 216-932-1898,\r\n\r\ncell phone 216-333-6355\r\n\r\nvia email at rinashere@yahoo.com\r\n\r\nFinal Credits: music thanks to\r\n\r\n\"Carefree\", \"Open Those Bright Eyes\", \"Sweeter Vermouth\"\r\nKevin MacLeod (incompetech.com)\r\nLicensed under Creative Commons: By Attribution 3.0\r\nhttp://creativecommons.org/licenses/by/3.0/",
            "length": "26387852",
            "sourceUrl": "http://media.blubrry.com/theuuperspectivepodcast/content.blubrry.com/theuuperspectivepodcast/UUPP_001__Rina_Shere_Beloved_Conversations__022715.mp3"
        }
    ]
}