{
    "artwork": "http://is5.mzstatic.com/image/thumb/Music111/v4/8d/6c/c4/8d6cc439-4ee9-8407-2216-341ed1182191/source/100x100bb.jpg",
    "description": "UpToDate® is the premier evidence-based clinical decision support resource, trusted worldwide by healthcare practitioners to help them make the right decisions at the point of care. It is proven to change the way clinicians practice medicine, and is the only resource of its kind associated with improved outcomes.\n\nSupport for UpToDate Talk is provided by UpToDate, Wolters Kluwer. UpToDate is entirely funded by the subscriptions of its users and does not accept advertising or funding unrelated to subscriptions. The opinions in such podcasts are entirely those of the discussants, and these discussants are authors and editors for UpToDate. View UpToDate’s conflict of interest policy:  http://www.uptodate.com/home/conflict-interest-policy.",
    "feedURL": "http://feeds.soundcloud.com/users/soundcloud:users:180380860/sounds.rss",
    "podcastURL": "http://uptodate.com/home",
    "title": "UpToDate Talk",
    "episodes": [
        {
            "title": "Peanut oral immunotherapy in children and young adults",
            "datePublished": "Wed, 30 May 2018 14:43:16 +0000",
            "description": "This episode features Dr. Robert Wood discussing the results of a trial of oral immunotherapy with a manufactured peanut protein product for peanut desensitization, and its potential role in clinical practice. Dr. Nancy Sokol hosts.\n\nDr. Wood is Professor of Pediatrics and Director of Pediatric Allergy and Immunology at the Johns Hopkins University School of Medicine and Professor of International Health at the Johns Hopkins Bloomberg School of Public Health. He is Editor-in-Chief of the Allergy and Immunology specialty at UpToDate.\n\nReference: Bird JA, Spergel JM, Jones SM, et al. Efficacy and Safety of AR101 in Oral Immunotherapy for Peanut Allergy: Results of ARC001, a Randomized, Double-Blind, Placebo-Controlled Phase 2 Clinical Trial. J Allergy Clin Immunol Pract 2018; 6:476.\n\nContributor Disclosure: Grant/Research/Clinical Trial Support: DBV Technologies; Aimmune; Astellas; HAL-Allergy [Food allergy].",
            "length": "16983352",
            "sourceUrl": "http://feeds.soundcloud.com/stream/451250445-uptodate-talk-ep-59.mp3"
        },
        {
            "title": "Digoxin levels and mortality in patients with atrial fibrillation",
            "datePublished": "Wed, 23 May 2018 19:23:36 +0000",
            "description": "Dr. Leonard Ganz discusses pharmacologic rate control of atrial fibrillation (AF) and findings of a recent study published in the Journal of the American College of Cardiology regarding the use of digoxin and mortality in patients with AF. Dr. Nancy Sokol hosts.\n\nDr. Ganz is a clinical cardiologist and Director of Cardiac Electrophysiology at the Heritage Valley Health System, in Western Pennsylvania, and Section Editor of the cardiac arrhythmias section in UpToDate.\n\nReference: Lopes RD, Rordorf R, De Ferrari GM, et al. Digoxin and Mortality in Patients With Atrial Fibrillation. J Am Coll Cardiol 2018; 71:1063.\n\nContributor Disclosure: Speaker’s Bureau: Amgen [Heart failure (Ivabradine)]; Pfizer, BMS [Anticoagulation (Apixaban)]; St. Jude Medical, Biotronik [Cardiac rhythm (Pacemaker/ICD)]; Lundbeck [Orthostatic hypotension (Northera)]. Consultant/Advisory Boards: Unequal Technologies [Commotio cordis (Protective equipment)]. Equity Ownership/Stock Options: Unequal Technologies [Commotio cordis (Protective equipment/apparel)].",
            "length": "14497749",
            "sourceUrl": "http://feeds.soundcloud.com/stream/448184436-uptodate-talk-ep-58.mp3"
        },
        {
            "title": "PERC criteria for ruling out pulmonary embolism",
            "datePublished": "Tue, 15 May 2018 22:05:58 +0000",
            "description": "Dr. Christopher Kabrhel discusses the PERC rule for evaluating patients with suspected pulmonary embolism and a trial exploring the effects of implementing the PERC rule in emergency departments in France, published in JAMA in February 2018. Dr. Nancy Sokol hosts.\n\nDr. Kabrhel is Associate Professor at Harvard Medical School, an Emergency Medicine physician at Massachusetts General Hospital, and author of several topics on pulmonary embolism for UpToDate.\n\nReference: Freund Y, Cachanado M, Aubry A, et al. Effect of the Pulmonary Embolism Rule-Out Criteria on Subsequent Thromboembolic Events Among Low-Risk Emergency Department Patients: The PROPER Randomized Clinical Trial. JAMA 2018; 319:559.\n\nContributor Disclosure: Grant/Research Support: Siemens [Venous thromboembolism (D-dimer test)]; Janssen [Venous thromboembolism (Rivaroxaban)]; Diagnostica Stago [Venous thromboembolism (D-dimer test)]. Consultant/Advisory Board: Siemens [Venous thromboembolism (D-dimer test)]; Janssen [Venous thromboembolism (Rivaroxaban)].",
            "length": "19936234",
            "sourceUrl": "http://feeds.soundcloud.com/stream/444578091-uptodate-talk-ep-57.mp3"
        },
        {
            "title": "Under-recognition of fetal alcohol spectrum disorders",
            "datePublished": "Tue, 08 May 2018 19:16:50 +0000",
            "description": "This episode features Dr. Carol Weitzman discussing a recent study showing a higher incidence of fetal alcohol spectrum disorders in children than previously thought, as well as methods to raise awareness and improve detection. Dr. April Eichler hosts.\n\nDr. Weitzman is Professor of Pediatrics and Director of the Developmental-Behavioral Pediatrics Program at the Yale School of Medicine. She is an author in the Pediatrics specialty at UpToDate.\n\nReference: \nMay PA, Chambers CD, Kalberg WO, et al. Prevalence of Fetal Alcohol Spectrum Disorders in 4 US Communities. JAMA 2018; 319:474.\n\nContributor disclosure: HeartFlow (Investor).",
            "length": "13405621",
            "sourceUrl": "http://feeds.soundcloud.com/stream/441250110-uptodate-talk-ep-56.mp3"
        },
        {
            "title": "Time window for mechanical thrombectomy after acute ischemic stroke",
            "datePublished": "Tue, 01 May 2018 19:34:47 +0000",
            "description": "This episode features Dr. Jose Biller discussing two recent studies showing that intra-arterial mechanical thrombectomy improves neurologic outcomes when performed up to 24 hours after symptom onset for selected patients with ischemic stroke. Dr. April Eichler hosts.\n\nDr. Biller is a Professor of Neurology and Neurological Surgery and Chairman of the Department of Neurology at the Loyola University Chicago Stritch School of Medicine. He is Section Editor in the Neurology specialty at UpToDate.\n\nReferences: \nNogueira RG, Jadhav AP, Haussen DC, et al. Thrombectomy 6 to 24 Hours after Stroke with a Mismatch between Deficit and Infarct. N Engl J Med 2018; 378:11.\n\nAlbers GW, Marks MP, Kemp S, et al. Thrombectomy for Stroke at 6 to 16 Hours with Selection by Perfusion Imaging. N Engl J Med 2018; 378:708.\n\nContributor disclosure: Nothing to disclose.",
            "length": "14914872",
            "sourceUrl": "http://feeds.soundcloud.com/stream/437943807-uptodate-talk-ep-55.mp3"
        },
        {
            "title": "Indications for surgery after a first episode of acute diverticulitis",
            "datePublished": "Tue, 24 Apr 2018 21:50:40 +0000",
            "description": "Dr. John Pemberton discusses a cohort study of patients with acute diverticulitis followed for 4 years for recurrence rates and need for surgery following the initial episode, published in Diseases of the Colon & Rectum in March 2018. Dr. Nancy Sokol hosts.\n\nDr. Pemberton is Professor of Surgery at the Mayo Clinic and Mayo Medical School, and authors several topics on diverticular disease for UpToDate.\n\nReference: El-Sayed C, Radley S, Mytton J, et al. Risk of Recurrent Disease and Surgery Following an Admission for Acute Diverticulitis. Dis Colon Rectum 2018; 61:382.\n\nContributor Disclosure: Nothing to disclose",
            "length": "10977697",
            "sourceUrl": "http://feeds.soundcloud.com/stream/434664519-uptodate-talk-ep-54.mp3"
        },
        {
            "title": "Catheter ablation for atrial fibrillation with heart failure",
            "datePublished": "Tue, 17 Apr 2018 21:40:50 +0000",
            "description": "Dr. Brian Olshansky discusses a paper in the February 2018 New England Journal of Medicine regarding a trial of catheter ablation for atrial fibrillation with heart failure. Dr. Nancy Sokol hosts.\n\nDr. Olshansky is Professor Emeritus of Internal Medicine at the University of Iowa, Adjunct Professor of Medicine at Des Moines University, and Section Editor for UpToDate cardiology topics.\n\nReference: Marrouche NF, Brachmann J, Andresen D, et al. Catheter Ablation for Atrial Fibrillation with Heart Failure. N Engl J Med 2018; 378:417.\n\nContributor Disclosure: Speaker’s Bureau: Lundbeck [Orthostatic hypotension (Droxidopa)]; CryoLife [Heart Valve Replacement (On-X Aortic Valves)]. Consultant/Advisory Boards: Lundbeck [Orthostatic hypotension (Droxidopa)]; CryoLife [Heart Valve Replacement (On-X Aortic Valves)]. Other Financial Interest: Amarin [Hypertriglyceridemia (EPA; Chair, Data and Safety Monitoring Board)]; Boerhringer Ingelheim [Atrial fibrillation (GLORIA AF trial)].",
            "length": "15284348",
            "sourceUrl": "http://feeds.soundcloud.com/stream/431212077-uptodate-talk-ep-53.mp3"
        },
        {
            "title": "Vaccination to prevent herpes zoster",
            "datePublished": "Tue, 10 Apr 2018 21:26:03 +0000",
            "description": "This episode features Dr. Kenneth Schmader discussing new guidelines from the Advisory Committee on Immunization Practices regarding the herpes zoster vaccines. Dr. Sadhna Vora hosts.\n\nDr. Schmader is a Professor of Medicine and Chief of the Division of Geriatrics at Duke University. He is Section Editor in Primary Care and Editor-in-Chief of the Geriatrics specialty at UpToDate. \n\nReference: Dooling KL, Guo A, Patel M, et al. Recommendations of the Advisory Committee on Immunization Practices for Use of Herpes Zoster Vaccines. MMWR Morb Mortal Wkly Rep 2018; 67:103.\n\nContributor Disclosure: Grant/Research/Clinical Trial Support: Merck [Herpes zoster (Zoster vaccine)]; GlaxoSmithKline [Herpes zoster (Zoster vaccine)].",
            "length": "13328717",
            "sourceUrl": "http://feeds.soundcloud.com/stream/427858167-uptodate-talk-ep-52.mp3"
        },
        {
            "title": "Partially closed loop glucose monitoring in children and adolescents with type 1 diabetes",
            "datePublished": "Tue, 03 Apr 2018 19:38:52 +0000",
            "description": "This episode features Dr. Joseph Wolfsdorf discussing advances in devices to manage children and adolescents with type 1 diabetes. Dr. Sadhna Vora hosts.\n\nDr. Wolfsdorf is a Professor of Pediatrics at Harvard Medical School and Director of the Diabetes Program at Boston Children's Hospital. He is also Section Editor in Pediatric Endocrinology at UpToDate.\n\nReference: \nAbraham MB, Nicholas JA, Smith GJ, et al. Reduction in Hypoglycemia with the Predictive Low-Glucose Management System: A Long-term Randomized Controlled Trial in Adolescents With Type 1 Diabetes. Diabetes Care 2018; 41:303.\n\nContributor Disclosure: Nothing to disclose.",
            "length": "13628812",
            "sourceUrl": "http://feeds.soundcloud.com/stream/424316967-uptodate-talk-ep-51.mp3"
        },
        {
            "title": "Third dose of MMR vaccine for prevention of mumps in an outbreak setting",
            "datePublished": "Tue, 27 Mar 2018 21:54:36 +0000",
            "description": "This episode features Dr. Sheldon Kaplan discussing the use of a third dose of the MMR vaccine for the prevention of mumps in an outbreak setting. Dr. Jennifer Mitty hosts.\n\nDr. Kaplan is Professor of Pediatrics and head of the Pediatric Infectious Disease section at Baylor College of Medicine, and he is Chief of the Infectious Disease service and head of the Department of Pediatric Medicine at Texas Children's Hospital in Houston.\n\nReferences:\nMarin M, Marlow M, Moore KL, et al. Recommendation of the Advisory Committee on Immunization Practices for Use of a Third Dose of Mumps Virus-Containing Vaccine in Persons at Increased Risk for Mumps During an Outbreak. MMWR Morb Mortal Wkly Rep 2018; 67:33.\n\nCardemil CV, Dahl RM, James L, et al. Effectiveness of a Third Dose of MMR Vaccine for Mumps Outbreak Control. N Engl J Med 2017; 377:947.\n\nContributor Disclosure: Grant/Research/Clinical Trial Support: Pfizer [Streptococcus pneumonia (PCV13, linezolid)]; Merck [Staphylococcus aureus (Tedizolid)]; Allergen [Osteomyelitis (Ceftaroline)]. Consultant/Advisory Boards: Pfizer [Staphylococcus aureus (vaccine development); linezolid]. Other Financial Interest: Pfizer [Speaker on PCV13, linezolid]; Medscapre [Video discussion on bacterial meningitis]; Elsevier [Co-editor (Feigin and Cherry Textbook of Pediatric Infectious Diseases)].",
            "length": "15276825",
            "sourceUrl": "http://feeds.soundcloud.com/stream/421036854-uptodate-talk-ep-50.mp3"
        },
        {
            "title": "Naltrexone versus buprenorphine for opioid use disorder",
            "datePublished": "Tue, 20 Mar 2018 21:21:56 +0000",
            "description": "This episode features Dr. Andrew Saxon discussing treatments for opioid use disorder. Dr. Jennifer Mitty hosts.\n\nDr. Saxon is a Professor in the Department of Psychiatry and Behavioral Sciences at the University of Washington in Seattle, and he is Chair of the American Psychiatric Association's Council on Addiction Psychiatry.\n\nReferences: \nLee JD, Nunes EV Jr, Novo P, et al. Comparative effectiveness of extended-release naltrexone versus buprenorphine-naloxone for opioid relapse prevention (X:BOT): a multicentre, open-label, randomised controlled trial. Lancet 2018; 391:309.\n\nTanum L, Solli KK, Latif ZE, et al. Effectiveness of Injectable Extended-Release Naltrexone vs Daily Buprenorphine-Naloxone for Opioid Dependence: A Randomized Clinical Noninferiority Trial. JAMA Psychiatry 2017; 74:1197.\n\nContributor Disclosure: Grant/Research/Clinical Trial Support: Medicasafe [Medication dispensing]. Consultant/Advisory Boards: Neurocrine Biosciences [Tardive dyskinesia (Valbenazine)].",
            "length": "15769181",
            "sourceUrl": "http://feeds.soundcloud.com/stream/416734305-uptodate-talk-ep-49.mp3"
        },
        {
            "title": "Monoclonal antibodies to prevent migraine; Oral fecal microbiota transplant for C. diff infection",
            "datePublished": "Tue, 06 Mar 2018 20:45:46 +0000",
            "description": "Today’s episode of UpToDate Talk features Dr. Jerry Swanson discussing novel monoclonal antibody therapies to prevent migraines, and Dr. Ciarán Kelly discussing oral fecal microbiota transplantation for the treatment of C. difficile infection. The second segment begins at 14:58. Dr. Nancy Sokol hosts.",
            "length": "28357693",
            "sourceUrl": "http://feeds.soundcloud.com/stream/409679223-uptodate-talk-ep-48.mp3"
        },
        {
            "title": "Edoxaban vs low molecular weight heparin in cancer-related VTE; New treatment for cystic fibrosis",
            "datePublished": "Tue, 20 Feb 2018 21:46:51 +0000",
            "description": "Today’s UpToDate Talk episode features discussions related to three papers published in the New England Journal of Medicine. Dr. Jess Mandel discusses anticoagulation options for cancer-associated venous thromboembolism, and Dr. George Mallory discusses two studies of tezacaftor-ivacaftor in patients with cystic fibrosis. Segment two begins at 11:32. Dr. Helen Hollingsworth hosts.",
            "length": "24606510",
            "sourceUrl": "http://feeds.soundcloud.com/stream/402679428-uptodate-talk-ep-47.mp3"
        },
        {
            "title": "Management of suicide risk in children and adolescents; Increasing prevalence of syphilis in the US",
            "datePublished": "Tue, 06 Feb 2018 22:05:32 +0000",
            "description": "Today’s episode of UpToDate Talk features Dr. Gregory Simon discussing the management of suicide risk in children and adolescents, and Dr. Khalil Ghanem discussing the increasing prevalence of syphilis in the United States. The second segment begins at 18:10. Dr. Nancy Sokol hosts.",
            "length": "36863581",
            "sourceUrl": "http://feeds.soundcloud.com/stream/395538669-uptodate-talk-ep-46.mp3"
        },
        {
            "title": "Frequency for dosing of oral iron; Risk of late recurrence after endocrine therapy for breast cancer",
            "datePublished": "Tue, 23 Jan 2018 21:51:50 +0000",
            "description": "In this episode of UpToDate Talk, Dr. Stanley Schrier joins us to discuss an article from Lancet Haematology on a new paradigm for the dosing of oral iron, and Dr. Dan Hayes discusses his meta-analysis from the New England Journal of Medicine on the risk of late recurrence after adjuvant endocrine therapy for breast cancer. Dr. Jennifer Tirnauer hosts.\n\nFigure on hepcidin in UpToDate: https://www.uptodate.com/contents/image?imageKey=HEME%2F105245",
            "length": "29829746",
            "sourceUrl": "http://feeds.soundcloud.com/stream/388108607-uptodate-talk-ep-45.mp3"
        },
        {
            "title": "Revised recommendations for endoscopy in dyspepsia; New hypertension criteria in ACC/AHA guidelines",
            "datePublished": "Wed, 10 Jan 2018 01:26:08 +0000",
            "description": "This edition of UpToDate Talk features Dr. Nicholas Talley, who joins us to discuss the evaluation and management of dyspepsia in adults, and Dr. William White, who discusses the new ACC/AHA guidelines for the evaluation and management of high blood pressure in adults. Dr. April Eichler hosts.",
            "length": "36391705",
            "sourceUrl": "http://feeds.soundcloud.com/stream/381314564-uptodate-talk-ep-44.mp3"
        },
        {
            "title": "PFO closure for prevention of recurrent stroke; Cost-effectiveness of triple therapy in RA",
            "datePublished": "Wed, 13 Dec 2017 14:00:48 +0000",
            "description": "This episode of UpToDate Talk begins with Dr. Scott Kasner, who outlines three recent NEJM studies investigating the effects of PFO device closure on recurrent stroke risk. The second segment features Dr. James O’Dell, discussing the cost effectiveness of triple therapy in the treatment of rheumatoid arthritis. Dr. Helen Hollingsworth hosts.",
            "length": "40474645",
            "sourceUrl": "http://feeds.soundcloud.com/stream/368948678-uptodate-talk-ep-43.mp3"
        },
        {
            "title": "Investigational gene editing in human embryos to prevent disease; Tests for diagnosis of influenza",
            "datePublished": "Wed, 29 Nov 2017 12:43:51 +0000",
            "description": "This episode features Dr. Benjamin Raby discussing a recent paper on correcting a pathogenic gene mutation in human embryos, and Dr. Martin Hirsch discussing testing for diagnosing influenza. Dr. Nancy Sokol hosts.",
            "length": "73987663",
            "sourceUrl": "http://feeds.soundcloud.com/stream/362470475-uptodate-talk-ep-42.mp3"
        },
        {
            "title": "Prevention of HIV in high risk adolescents; ICDs for treatment of nonischemic cardiomyopathy",
            "datePublished": "Wed, 15 Nov 2017 13:52:09 +0000",
            "description": "This episode features Dr. Kenneth Mayer, discussing use of pre-exposure HIV prophylaxis for high-risk adolescents, and Dr. Samuel Lévy, discussing use of an implantable cardioverter defibrillator for the primary prevention of sudden death in patients with nonischemic cardiomyopathy. Dr. Nancy Sokol hosts.",
            "length": "44097130",
            "sourceUrl": "http://feeds.soundcloud.com/stream/356139587-uptodate-talk-ep-41.mp3"
        },
        {
            "title": "Zika virus prenatal infection and birth outcome; Evaluation for occult cancer in unprovoked VTE",
            "datePublished": "Wed, 01 Nov 2017 12:17:57 +0000",
            "description": "This episode features Dr. Karin Nielsen discussing maternal Zika virus and potential factors associated with birth outcomes, and Dr. Jess Mandel discussing screening for occult cancer in patients with unprovoked venous thromboembolism.  Dr. Jennifer Mitty hosts.",
            "length": "55282535",
            "sourceUrl": "http://feeds.soundcloud.com/stream/349631035-uptodate-talk-ep-40.mp3"
        },
        {
            "title": "Choice of basal insulin for management of diabetes; Evaluation of children with febrile seizures",
            "datePublished": "Wed, 18 Oct 2017 12:47:59 +0000",
            "description": "In this episode, Dr. David Nathan discusses choice of basal insulin for management of type 1 and type 2 diabetes, and Dr. Douglas Nordli, Jr., discusses evaluation of children with febrile seizures. Dr. Nancy Sokol hosts.",
            "length": "46776226",
            "sourceUrl": "http://feeds.soundcloud.com/stream/347456358-uptodate-talk-ep-39.mp3"
        },
        {
            "title": "Guselkumab and tildrakizumab for plaque psoriasis; Two new investigational therapies for hemophilia",
            "datePublished": "Wed, 04 Oct 2017 11:40:14 +0000",
            "description": "This episode features Dr. Kristina Callis Duffin discussing the efficacy and safety of guselkumab and tildrakizumab in patients with moderate to severe plaque psoriasis, and Dr. Amy Shapiro discussing emicizumab prophylaxis in hemophilia A with inhibitors and targeting of antithrombin in hemophilia A or B using RNA interference therapy. Dr. Jennifer Tirnauer hosts.",
            "length": "85211039",
            "sourceUrl": "http://feeds.soundcloud.com/stream/345309312-uptodate-talk-ep-38.mp3"
        },
        {
            "title": "Revised follow-up for solitary pulmonary nodule; Safe sleep practices and SIDS",
            "datePublished": "Wed, 20 Sep 2017 13:01:47 +0000",
            "description": "This podcast features Dr. Steven Weinberger, discussing new guidelines on the management of solitary pulmonary nodules, and Dr. Michael Corwin, discussing interventions to promote safe sleep practices for infants and decrease the incidence of sudden infant death syndrome (SIDS). Dr. Nancy Sokol hosts.",
            "length": "48011624",
            "sourceUrl": "http://feeds.soundcloud.com/stream/343221189-uptodate-talk-ep-37.mp3"
        },
        {
            "title": "Sentinel lymph node metastasis in melanoma; Transcranial electrical stimulation for depression",
            "datePublished": "Thu, 31 Aug 2017 17:47:31 +0000",
            "description": "This episode features Dr. Michael Atkins discussing the management of positive sentinel lymph nodes in patients with cutaneous melanoma, and Dr. Peter Roy-Byrne discussing an investigational transcranial therapy for individuals with depression. Dr. April Eichler hosts.",
            "length": "75962935",
            "sourceUrl": "http://feeds.soundcloud.com/stream/340333551-uptodate-talk-ep-36.mp3"
        },
        {
            "title": "Pediatric behavior & celiac autoimmunity; Adjuvant capecitabine & HER2-negative breast cancer",
            "datePublished": "Wed, 23 Aug 2017 11:56:56 +0000",
            "description": "In this episode, Dr. Ivor Hill discusses the psychological impact of celiac autoimmunity in children, and Dr. Daniel Hayes discusses adjuvant therapy with capecitabine for selected women with breast cancer.",
            "length": "43943610",
            "sourceUrl": "http://feeds.soundcloud.com/stream/339133475-uptodate-talk-ep-35.mp3"
        },
        {
            "title": "Edaravone for amyotrophic lateral sclerosis; Neonatal mortality in US planned home births",
            "datePublished": "Tue, 08 Aug 2017 19:39:52 +0000",
            "description": "Edaravone for amyotrophic lateral sclerosis; Neonatal mortality in US planned home births by UpToDate",
            "length": "70120295",
            "sourceUrl": "http://feeds.soundcloud.com/stream/337034628-uptodate-talk-ep-34.mp3"
        },
        {
            "title": "Buprenorphine for neonatal abstinence syndrome; Sublingual immunotherapy for house dust mite allergy",
            "datePublished": "Wed, 26 Jul 2017 14:16:39 +0000",
            "description": "In this episode, Dr. Lauren Jansson discusses buprenorphine for neonatal abstinence syndrome, and Dr. Peter Creticos discusses a sublingual immunotherapy tablet for house dust mite allergies. Dr. Sadhna Vora hosts.",
            "length": "39982264",
            "sourceUrl": "http://feeds.soundcloud.com/stream/334924921-uptodate-talk-ep-33.mp3"
        },
        {
            "title": "Goal blood pressure in older adults; Dexamethasone and acute pharyngitis pain in adults",
            "datePublished": "Wed, 12 Jul 2017 14:07:46 +0000",
            "description": "This episode features Dr. Brent Egan discussing the target blood pressure in older adults, and Dr. Mark Aronson discussing the use of dexamethasone for acute pharyngitis pain in adults. Dr. Nancy Sokol hosts.",
            "length": "53869415",
            "sourceUrl": "http://feeds.soundcloud.com/stream/332089178-uptodate-talk-ep-32.mp3"
        },
        {
            "title": "Complications of t1 and t2 diabetes diagnosed in childhood; Gene therapy for sickle cell disease",
            "datePublished": "Wed, 28 Jun 2017 13:19:20 +0000",
            "description": "Dr. Joseph Wolfsdorf discusses complications related to type 1 and type 2 diabetes in pediatric patients, and Dr. Michael DeBaun discusses a report of gene therapy for sickle cell disease. Dr. Nancy Sokol hosts.",
            "length": "35394674",
            "sourceUrl": "http://feeds.soundcloud.com/stream/330525188-uptodate-talk-ep-31.mp3"
        },
        {
            "title": "Long-term follow-up of imatinib for CML; Ocrelizumab for primary progressive multiple sclerosis",
            "datePublished": "Tue, 13 Jun 2017 14:15:23 +0000",
            "description": "This episode features Dr. Richard Larson discussing the long-term outcomes of imatinib treatment for chronic myeloid leukemia, and Dr. Francisco Gonzalez-Scarano discussing the use of ocrelizumab for treatment of primary progressive multiple sclerosis. Dr. Jennifer Mitty hosts.",
            "length": "50017129",
            "sourceUrl": "http://feeds.soundcloud.com/stream/327863868-uptodate-talk-ep-30.mp3"
        },
        {
            "title": "Transcatheter aortic valve implantation; Bariatric surgery for patients with diabetes mellitus",
            "datePublished": "Wed, 31 May 2017 10:33:22 +0000",
            "description": "In this episode, Dr. Stephen Brecker discusses transcatheter aortic valve implantation for severe aortic stenosis in patients with intermediate surgical risk, and Dr. David McCulloch discusses outcomes of bariatric surgery for patients with diabetes mellitus.",
            "length": "46716179",
            "sourceUrl": "http://feeds.soundcloud.com/stream/325338697-uptodate-talk-ep-29.mp3"
        },
        {
            "title": "Spirometry and asthma diagnosis; Baricitinib for the treatment of rheumatoid arthritis",
            "datePublished": "Wed, 17 May 2017 12:11:32 +0000",
            "description": "This episode features Dr. Christopher Fanta, discussing the role of spirometry in the diagnosis of asthma; and Dr. James O’Dell, discussing baricitinib, a promising oral agent for the treatment of rheumatoid arthritis. Dr. Helen Hollingsworth hosts.",
            "length": "46567843",
            "sourceUrl": "http://feeds.soundcloud.com/stream/323045205-uptodate-talk-ep-28.mp3"
        },
        {
            "title": "Scalp cooling and alopecia from chemotherapy; Immunotherapy for stinging insect hypersensitivity",
            "datePublished": "Wed, 03 May 2017 12:32:14 +0000",
            "description": "This episode features Dr. Hope Rugo, discussing the use of a scalp-cooling device to prevent hair loss after chemotherapy in breast cancer patients; and Dr. David Golden, discussing the joint practice parameter on immunotherapy for stinging insect hypersensitivity. Dr. Nancy Sokol hosts.",
            "length": "52137001",
            "sourceUrl": "http://feeds.soundcloud.com/stream/320658550-uptodate-talk-ep-27.mp3"
        },
        {
            "title": "Duration of Zika virus detection in body fluids; Underdosing of direct oral anticoagulants",
            "datePublished": "Wed, 19 Apr 2017 12:06:57 +0000",
            "description": "This podcast features Dr. Martin Hirsch, discussing persistence of Zika virus in body fluids; and Dr. Mark Crowther, discussing underdosing of direct oral anticoagulants (DOACs). Dr. Jennifer Tirnauer hosts.",
            "length": "40258243",
            "sourceUrl": "http://feeds.soundcloud.com/stream/318435290-uptodate-talk-ep-26.mp3"
        },
        {
            "title": "Treatment for acute otitis media in young children; Tenofovir alafenamide for chronic hepatitis B",
            "datePublished": "Wed, 05 Apr 2017 13:10:08 +0000",
            "description": "This podcast features Dr. Sheldon Kaplan, discussing the duration of antibiotic treatment in young children with acute otitis media; and Dr. Anna Lok, discussing the use of tenofovir alafenamide for the treatment of chronic hepatitis B virus infection. Dr. Jennifer Mitty hosts.",
            "length": "46230043",
            "sourceUrl": "http://feeds.soundcloud.com/stream/316220439-uptodate-talk-ep-25.mp3"
        },
        {
            "title": "Metformin use in diabetes; Flexible sigmoidoscopy and colorectal cancer screening in older women",
            "datePublished": "Wed, 22 Mar 2017 12:51:46 +0000",
            "description": "This episode features Dr. David Nathan, discussing clinical outcomes of metformin use in populations with chronic kidney disease, congestive heart failure, or chronic liver disease; and Dr. Chyke Doubeni, discussing the effectiveness of screening for colorectal cancer using flexible sigmoidoscopy in men and women at different age groups. Dr. Nancy Sokol hosts.",
            "length": "48340878",
            "sourceUrl": "http://feeds.soundcloud.com/stream/313765716-uptodate-talk-ep-24.mp3"
        },
        {
            "title": "Determining CPR futility for out-of-hosp cardiac arrest; Hep C management in liver transplantation",
            "datePublished": "Wed, 08 Mar 2017 13:47:55 +0000",
            "description": "In this episode, Dr. Charles Pozner discusses criteria for determining futility for resuscitation for out-of-hospital cardiac arrest and potential implications for organ donation; and Dr. Robert Brown discusses management of hepatitis C infection in patients undergoing liver transplantation. Dr. Nancy Sokol hosts.",
            "length": "35309501",
            "sourceUrl": "http://feeds.soundcloud.com/stream/311349686-uptodate-talk-ep-23.mp3"
        },
        {
            "title": "Adverse pregnancy outcomes associated with treatment for CIN; Prevention of egg allergy in infants",
            "datePublished": "Wed, 22 Feb 2017 13:52:04 +0000",
            "description": "This episode features Dr. Barbara Goff, discussing a population-based study on adverse pregnancy outcomes associated with treatment for cervical intraepithelial neoplasia (CIN) (starts at 00:43); and Dr. David Fleischer, discussing data on early dietary egg introduction for the prevention of egg allergy in infants (starts at 15:32).",
            "length": "40497237",
            "sourceUrl": "http://feeds.soundcloud.com/stream/308993466-uptodate-talk-ep21.mp3"
        },
        {
            "title": "The Road to Clinical Effectiveness",
            "datePublished": "Fri, 17 Feb 2017 18:07:29 +0000",
            "description": "This episode features Dr. Peter Bonis, Chief Medical Officer, and Dr. Denise Basow, President and CEO of Clinical Effectiveness for Wolters Kluwer Health, discussing current challenges in the U.S. healthcare space, including undesirable variability in care, suboptimal patient outcomes and rising costs, and the digital solutions necessary to address these problems. We hope this will be a valuable insight into how a coordinated, harmonized, multitargeted digital solution might meet these challenges and improve healthcare delivery and outcomes for patients, clinicians, and payers.",
            "length": "28927147",
            "sourceUrl": "http://feeds.soundcloud.com/stream/308242772-uptodate-talk-the-road-to-clinical-effectiveness.mp3"
        },
        {
            "title": "Syncope and pulmonary embolus; Treatment of vulvovaginal atrophy",
            "datePublished": "Wed, 08 Feb 2017 14:28:51 +0000",
            "description": "This episode features Dr. Jess Mandel, discussing the prevalence of pulmonary embolism in patients hospitalized for syncope (starts at 00:54); and Dr. Robert Barbieri, discussing the potential role for a new topical drug, prasterone (DHEA), in the treatment of genitourinary syndrome of menopause (starts at 11:44). Nancy Sokol hosts.",
            "length": "33890817",
            "sourceUrl": "http://feeds.soundcloud.com/stream/306716152-uptodate-talk-ep20.mp3"
        },
        {
            "title": "Severe asymptomatic hypertension; Endovascular vs. open abdominal aneurysm repair",
            "datePublished": "Wed, 25 Jan 2017 13:49:07 +0000",
            "description": "In this episode, Dr. William Elliott discusses management of hypertensive urgency (starts at 00:50); and Dr. John Eidt discusses a comparison of long-term outcomes following endovascular and open surgical repair of an asymptomatic abdominal aneurysm (starts at 17:09). Dr. Nancy Sokol hosts.",
            "length": "50194239",
            "sourceUrl": "http://feeds.soundcloud.com/stream/304444977-uptodate-talk-ep19.mp3"
        },
        {
            "title": "Overdiagnosis of breast cancer with mammography",
            "datePublished": "Thu, 12 Jan 2017 15:47:05 +0000",
            "description": "This episode features Dr. Joann Elmore, discussing the UpToDate What’s New topic on the overdiagnosis of breast cancer with mammography. Dr. Sandy Falk hosts.",
            "length": "24496398",
            "sourceUrl": "http://feeds.soundcloud.com/stream/302357167-uptodate-talk-ep18.mp3"
        },
        {
            "title": "Glucocorticoids and sepsis; HPV vaccination in young adolescents",
            "datePublished": "Wed, 21 Dec 2016 14:10:06 +0000",
            "description": "This episode features Dr. Scott Manaker, discussing the UpToDate What’s New topic on the lack of benefit of glucocorticoids in severe sepsis (starts at 01:07); and Dr. Joel Palefsky, discussing the UpToDate Practice Changing UpDate regarding updated guidelines for HPV vaccination in young adolescents (starts at 14:56). Dr. Sandy Falk hosts.",
            "length": "42729296",
            "sourceUrl": "http://feeds.soundcloud.com/stream/298958936-uptodate-talk-ep17.mp3"
        },
        {
            "title": "Influenza vaccination in pregnancy; Degenerative meniscal tears",
            "datePublished": "Wed, 07 Dec 2016 14:20:11 +0000",
            "description": "This episode features Dr. Sonja Rasmussen, discussing infant protection against influenza illness through maternal immunization (starts at 00:44); and Dr. Karl Fields, discussing outcomes for patients with degenerative meniscal tears, comparing meniscectomy with physical therapy (starts at 13:38).  Dr. Nancy Sokol hosts.",
            "length": "37098569",
            "sourceUrl": "http://feeds.soundcloud.com/stream/296665090-uptodate-talk-ep16.mp3"
        },
        {
            "title": "Evidence-Based Medicine and UpToDate",
            "datePublished": "Wed, 23 Nov 2016 14:18:57 +0000",
            "description": "This episode features Dr. Gordon Guyatt, discussing general principles of evidence-based medicine (EBM) and how EBM is incorporated into UpToDate topics, using an example from a topic in UpToDate on aspirin for primary prevention.",
            "length": "32604007",
            "sourceUrl": "http://feeds.soundcloud.com/stream/294412903-uptodate-talk-ep15.mp3"
        },
        {
            "title": "Options for treatment of localized prostate cancer; Drug-eluting & bare metal intracoronary stents",
            "datePublished": "Wed, 09 Nov 2016 13:56:15 +0000",
            "description": "This episode features Dr. Jerome Richie, discussing options for treatment of localized low-risk prostate cancer (starts at 00:42); and Dr. Donald Cutlip, discussing comparison of current generation drug-eluting and bare metal intracoronary stents (starts at 14:30).",
            "length": "46171057",
            "sourceUrl": "http://feeds.soundcloud.com/stream/292231278-uptodate-talk-ep14.mp3"
        },
        {
            "title": "Early benefit of aspirin after TIA or ischemic stroke; HIV treatment to prevent sexual transmission",
            "datePublished": "Wed, 26 Oct 2016 12:54:52 +0000",
            "description": "This episode features Dr. Brett Cucchiara discussing aspirin for secondary prevention after transient ischemic attack or stroke (starts at 01:28); and Dr. Paul Sax discussing the prevention of HIV1 transmission with antiretroviral therapy (starts at 16:50). Dr. Helen Hollingsworth hosts.",
            "length": "43965197",
            "sourceUrl": "http://feeds.soundcloud.com/stream/290047042-uptodate-talk-ep13.mp3"
        },
        {
            "title": "Choice of influenza vaccines for 2016-17 season; Complications of dopamine agonists for RLS",
            "datePublished": "Wed, 12 Oct 2016 13:09:16 +0000",
            "description": "This episode features Dr. Martin Hirsch discussing choice of influenza vaccines for the 2016-17 season in the northern hemisphere (starts at 00:35); and Dr. Alon Avidan discussing the diagnosis and management of augmentation, a condition seen in patients with restless legs syndrome who have been treated with dopamine agonists (starts at 13:37). Dr. Nancy Sokol hosts.",
            "length": "42427594",
            "sourceUrl": "http://feeds.soundcloud.com/stream/287311525-uptodate-talk-ep12.mp3"
        },
        {
            "title": "Sofosbuvir-velpatasvir for chronic HCV infection; Neonatal phototherapy & risk of childhood cancer",
            "datePublished": "Wed, 28 Sep 2016 12:35:55 +0000",
            "description": "This episode features Dr. Adrian Di Bisceglie discussing a Practice Changing UpDate related to sofosbuvir-velpatasvir for treatment of chronic HCV infection (starts at 00:51); and Dr. Vinod Bhutani discussing neonatal phototherapy and risk of childhood cancer (starts at 14:50). Dr. Nancy Sokol hosts.",
            "length": "47963190",
            "sourceUrl": "http://feeds.soundcloud.com/stream/285095252-uptodate-talk-ep11.mp3"
        },
        {
            "title": "Duration of adjuvant endocrine therapy for breast cancer; Treatment for binge eating disorder",
            "datePublished": "Wed, 14 Sep 2016 13:01:57 +0000",
            "description": "This episode features Dr. Harold Burstein discussing a Practice Changing Update related to the duration of adjuvant hormone therapy for non-metastatic, post-menopausal breast cancer (starts at 01:01); and Dr. Joel Yager discussing a recent systematic review of treatment for binge eating disorder (starts at 15:04). Dr. Nancy Sokol hosts.",
            "length": "46555578",
            "sourceUrl": "http://feeds.soundcloud.com/stream/282866288-uptodate-talk-duration-of-adjuvant-endocrine-therapy-for-breast-cancer-treatment-for-binge-eating-disorder.mp3"
        },
        {
            "title": "Sexual dysfunction in women; Pediatric gastroenteritis; Childhood obesity",
            "datePublished": "Thu, 11 Aug 2016 13:18:08 +0000",
            "description": "In this episode, Dr. Jan Shifren discusses flibanserin for treatment of sexual dysfunction in women (starts at 01:13); Dr. Stephen Freedman discusses use of diluted apple juice for hydration in children with mild gastroenteritis (starts at 11:31); and Dr. Kathleen Motil discusses the association between obesity in adolescence and cardiovascular mortality in adulthood (starts at 20:53). ",
            "length": "45412500",
            "sourceUrl": "http://feeds.soundcloud.com/stream/277803126-uptodate-talk-sexual-dysfunction-in-women-pediatric-gastroenteritis-childhood-obesity.mp3"
        },
        {
            "title": "Multi-drug resistant tuberculosis; Ischemic cardiomyopathy; Chronic insomnia",
            "datePublished": "Wed, 13 Jul 2016 18:20:18 +0000",
            "description": "In this episode, Dr. Neil Schluger will discuss new WHO recommendations for treatment of multi-drug resistant tuberculosis (starts at 00:52); Dr. Wilson Colucci will discuss the STITCHES trial for coronary artery bypass surgery in ischemic cardiomyopathy (starts at 14:22); and Dr. Michael Bonnet will discuss cognitive behavioral therapy for insomnia (CBT-I) (starts at 25:34).",
            "length": "55464245",
            "sourceUrl": "http://feeds.soundcloud.com/stream/273517576-uptodate-talk-multi-drug-resistant-tuberculosis-ischemic-cardiomyopathy-chronic-insomnia.mp3"
        },
        {
            "title": "Zika virus; Therapy for chronic asthma; Stroke prevention in sickle cell disease",
            "datePublished": "Wed, 08 Jun 2016 12:43:36 +0000",
            "description": "This episode features Dr. Martin Hirsch discussing the association between Zika virus and Guillain Barré syndrome (starts at 01:18); Dr. Christopher Fanta discussing the use of combination inhaled long-acting beta agonists and corticosteroids for asthma (starts at 10:08); and Dr. Donald Mahoney discussing stroke prevention with hydroxyurea in children with sickle cell disease (starts at 22:32).",
            "length": "52031537",
            "sourceUrl": "http://feeds.soundcloud.com/stream/268126153-uptodate-talk-zika-chronic-asthma-sickle-cell-disease.mp3"
        },
        {
            "title": "Screening for diabetes mellitus",
            "datePublished": "Wed, 18 May 2016 16:32:44 +0000",
            "description": "This episode features Dr. David Nathan discussing screening adults for type 2 diabetes and increased risk for diabetes, and new recommendations for such screening as part of cardiovascular risk assessment. Dr. Nancy Sokol hosts.",
            "length": "27526790",
            "sourceUrl": "http://feeds.soundcloud.com/stream/264750045-uptodate-talk-screening-for-diabetes-mellitus.mp3"
        },
        {
            "title": "Hodgkin lymphoma survivors; medical management of pediatric appendicitis; PPIs and dementia risk",
            "datePublished": "Thu, 21 Apr 2016 15:17:51 +0000",
            "description": "In this episode, Dr. Andrea Ng discusses second cancers in Hodgkin lymphoma survivors (starts at 01:13); Dr. David Mooney discusses nonoperative management for children with uncomplicated appendicitis (starts at 10:22); and Dr. Steven DeKosky discusses proton pump inhibitors and risk of dementia in older adults (starts at 21:07). Dr. Nancy Sokol hosts.",
            "length": "47009289",
            "sourceUrl": "http://feeds.soundcloud.com/stream/260195526-uptodate-talk-episode5.mp3"
        },
        {
            "title": "DAPT Score for coronary stents; Bronchoscopic interventions for severe emphysema; Beers criteria",
            "datePublished": "Wed, 16 Mar 2016 13:17:19 +0000",
            "description": "In this episode, Dr. Christopher Cannon discusses decisions about stopping dual antiplatelet therapy in patients with intracoronary stents (starts at 01:21); Dr. Tom Gildea discusses novel bronchoscopic interventions on the horizon for patients with severe emphysema (starts at 11:45); and Dr. Paula Rochon discusses the updated Beers criteria to guide appropriate use of pharmacotherapy in older adults (starts at 22:52). Dr. Nancy Sokol hosts.",
            "length": "32226741",
            "sourceUrl": "http://feeds.soundcloud.com/stream/252153364-uptodate-talk-dapt-score-for-coronary-stents-bronchoscopic-interventions-for-severe-emphysema-beers-criteria.mp3"
        },
        {
            "title": "SPRINT Trial; Recurrent Wheezing in Children; HTN in Pregnancy and Risk of Congenital Heart Defects",
            "datePublished": "Wed, 17 Feb 2016 13:39:10 +0000",
            "description": "This episode features Dr. George Bakris, discussing the SPRINT Trial (starts at 01:01); Dr. Robert Wood, discussing azithromycin in the treatment of recurrent wheezing in young children (starts at 16:20), and Dr. Charles Lockwood discussing hypertension and its treatment during pregnancy in relation to congenital heart defects (starts at 25:33). Dr. Anna Feldweg hosts.",
            "length": "33398699",
            "sourceUrl": "http://feeds.soundcloud.com/stream/247509208-uptodate-talk-sprint-trial-recurrent-wheezing-in-children-htn-in-pregnancy-and-risk-of-congenital-heart-defects.mp3"
        },
        {
            "title": "Neonatal hypoglycemia; Hysteroscopic sterilization; Dabigatran reversal agent",
            "datePublished": "Tue, 19 Jan 2016 18:59:33 +0000",
            "description": "This episode features Dr. Paul Rozance, discussing the management of neonatal hypoglycemia (starts at 01:13); Dr. Howard Sharp, discussing concerns related to hysteroscopic sterilization (starts at 11:55); and Dr. Lawrence Leung, discussing a new reversal agent for the direct oral anticoagulant dabigatran (starts at 21:46). Dr. Nancy Sokol hosts.",
            "length": "28018310",
            "sourceUrl": "http://feeds.soundcloud.com/stream/242768936-uptodate-talk-podcast-b-final.mp3"
        },
        {
            "title": "Empagliflozin for diabetes; Pneumococcal vaccines; PCSK9 antibodies",
            "datePublished": "Tue, 08 Dec 2015 16:34:04 +0000",
            "description": "This episode features Dr. David Nathan, discussing the diabetes drug, empagliflozin, and its impact on diabetes and cardiovascular outcomes (01:07); Dr. John Bartlett, discussing revisions to US recommendations for pneumococcal vaccination in older adults (09:30); and Dr. Mason Freeman, discussing use of the newly approved PCSK9 antibodies in the treatment of hyperlipidemia (17:53). Dr. Nancy Sokol hosts.\n\nPodcast References\n\n1.  Segment on empagliflozin (Dr. Nathan):\n\nZinman, B, Wanner C, Lachin JM, et al. Empagliflozin, cardiovascular outcomes, and mortality in type 2 diabetes. N Engl J Med 2015; 373:2117.\n\n2.  Segment on pneumococcal vaccination (Dr. Bartlett):\n\nKobayashi M, Bennett NM, Gierke R, et al. Intervals between PCV13 and PPSV23 vaccines: Recommendations of the Advisory Committee on Immunization Practices (ACIP). MMWR Morb Mortal Wkly Rep. 2015; 64:944.\n\n3.  Segment on PCSK9 antibodies (Dr. Freeman):\n\nRobinson JG, Farnier M, Krempf M et al. Efficacy and safety of alirocumab in reducing lipids and cardiovascular events. N Engl J Med 2015; 372:1488.\n\nSabatine MS, Giugliano RP, Wiviott SD et al.  Efficacy and safety of evolocumab in reducing lipids and cardiovascular events. N Engl J Med 2015; 372:1500.",
            "length": "25285275",
            "sourceUrl": "http://feeds.soundcloud.com/stream/236645253-uptodate-talk-empagliflozin-for-diabetes-pneumococcal-vaccines-pcsk9-antibodies.mp3"
        }
    ]
}