{
    "artwork": "http://is4.mzstatic.com/image/thumb/Music62/v4/7f/70/f7/7f70f701-343e-62ac-9c27-8703b55c7870/source/100x100bb.jpg",
    "description": "We tell stories from the fault lines that separate Americans. Peabody Award-winning public radio producer Trey Kay listens to people on both sides of the divide.",
    "feedURL": "http://feeds.wvpublic.org/usthempodcast",
    "podcastURL": "http://usandthempodcast.com",
    "title": "Us & Them",
    "episodes": [
        {
            "title": "Forced Apart: Can Our Economy Rebound Without Reliable, Safe Child Care?",
            "datePublished": "Wed, 11 Nov 2020 11:00:00 -0000",
            "description": "\r\n        <p>The coronavirus has divided the world’s workforce into some new categories. White collar workers are remote employees who can do their jobs from home. Blue collar workers are often essential, front-line workers who must show up on the job to keep the supply chain and service industries moving. Essential medical workers keep our hospitals and clinics open. And there’s another group of workers on which the success of all the above — and some argue our very economy — rely: child-care workers. </p>\n\n<p>Early on in the pandemic, many states declared day-care facilities to be critical care sites and ordered them open to care for the children of our essential workers. Months later, those businesses face continually evolving regulations designed to keep children and workers safe. The success of our services and our economy is banking on them.</p>\r\n      ",
            "length": "19961563",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/dovetail.prxu.org/95/18042bc2-57ea-4172-a0e2-9181ae889f81/UsandThem_128_Childcare_11.10.20_PP_1.mp3",
            "epNo": "128"
        },
        {
            "title": "Us & Them: Let Us 'Bind Up The Nation's Wounds'",
            "datePublished": "Wed, 04 Nov 2020 21:56:16 -0000",
            "description": "\r\n        <p>The 2020 presidential election has offered a host of unexpected  twists and turns. The candidate’s varied approaches to campaigning during a pandemic. The president’s own COVID diagnosis. The death of Supreme Court Justice Ruth Bader Ginsburg and a fast confirmation process for her successor just before election day. A record number of citizens participated in this election.  However, the process highlights and confirms our divisions.  As votes are counted and winners declared, it’s possible that some Americans will dispute the outcome — clear evidence of the “Us &amp; Them” all around us. So how do we move forward?</p>\r\n      ",
            "length": "33219292",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/dovetail.prxu.org/95/8de00eb2-626a-483f-950f-af5b904bd0c5/UsandThem_127_Bind_The_Nations_Wounds_11.04.20_PP_1.mp3",
            "epNo": "127"
        },
        {
            "title": "Breaking Bread, Talking Politics",
            "datePublished": "Thu, 22 Oct 2020 10:00:00 -0000",
            "description": "\r\n        <p>Keep politics away from the dinner table! This year’s contentious campaign season offers fresh reasons for that advice. But Us &amp; Them host Trey Kay decided to host a virtual dinner party with guests whose politics reach across the divides. They came to the video chat potluck showing off some family favorite foods. The guests were ready to disagree and see how the conversation would go. Along the way there were some good meals… honest conversation… and even a few surprises. Join us for the dinner party and you’ll also get recipes from Trey and his guests!</p>\r\n      ",
            "length": "50057088",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/dovetail.prxu.org/95/19e3e28a-787b-4b5a-b496-2e048a4979c7/UsandThem_126_Breaking_Bread_10.22.20_PP_1.mp3",
            "epNo": "126"
        },
        {
            "title": "Us & Them: Working Man vs. The Political Machine",
            "datePublished": "Wed, 07 Oct 2020 10:00:00 -0000",
            "description": "\r\n        <p>The 2020 political campaigns are in high gear and the elections are just weeks away. This year, one West Virginia man watches from the sidelines, knowing what it’s like to put on a statewide campaign. Four years ago, Bo Copley was an unemployed miner who got the chance to ask then-candidate Hillary Clinton a question that resonated with many people. In 2018, Copley waged his first political campaign for the U.S. Senate. A new documentary, “The Campaign of Miner Bo'' airs this fall on many PBS stations and shadows Copley’s unsuccessful run for office and the things he learned from the experience. Documentary filmmaker Todd Drezner, a New Yorker who voted for Clinton, tells the story of the unlikely candidate as a way to learn about a West Virginian who voted for Donald Trump.</p>\n\n<p>For this episode, Us &amp; Them host Trey Kay has a talk with Copley and Drezner.</p>\r\n      ",
            "length": "34151808",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/dovetail.prxu.org/95/0b69e653-4b08-4413-a380-248b4b3ebfa6/UsandThem_125_Working_Man_vs_Political_Machine_PP_1.mp3",
            "epNo": "125"
        },
        {
            "title": "Forced Apart: An Ailing Economy -- Is Workforce Training The Cure?",
            "datePublished": "Thu, 24 Sep 2020 10:00:00 -0000",
            "description": "\r\n        <p>The coronavirus has created an economic nightmare. About a million jobs have disappeared in six months and more layoffs are likely this fall. In West Virginia, the pandemic doubled the state’s unemployment rate. That means 75,000 West Virginians are looking for work. Many of those searching for work are young people who’ve just graduated. How are employers and educators dealing with this disruption? Are students redefining their hopes for the future? We’ll look at the training that can match workers with jobs.</p>\r\n      ",
            "length": "49807987",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/dovetail.prxu.org/95/01557426-2c67-47ad-b735-4cc8207d3f00/UsandThem_124_Workforce_Training_PP_1.mp3",
            "epNo": "124"
        },
        {
            "title": "Can a White Supremacist Alter Her DNA of Hate?",
            "datePublished": "Wed, 09 Sep 2020 20:22:02 -0000",
            "description": "\r\n        <p>Black and Brown people in America continue to die at the hands of police officers and that's created a season of hate. George Floyd’s killing ignited a sense of racial outrage that has spread around the world. U.S. cities continue to see protests against police brutality and riots over racial injustices. We’ll hear about a new podcast “Sounds Like Hate” that looks at racial extremism, white power groups, the DNA of hate in America and specifically, the story of a woman who walked away from her life as a white supremacist. </p>\r\n      ",
            "length": "23025704",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/dovetail.prxu.org/95/5f7c8f9c-61b2-464a-8724-49bc2590d337/UsandThem_123_DNA_of_Hate_Test_PP_1.mp3",
            "epNo": "123"
        },
        {
            "title": "Forced Apart: The 'Delicate and Crazy Dance' of American Health Care",
            "datePublished": "Thu, 27 Aug 2020 20:05:45 -0000",
            "description": "\r\n        <p>The coronavirus confronts every aspect of our society - with our health care systems front and center in the crosshairs. When hospitals canceled nonessential medical procedures at the beginning of the pandemic, it created an economic free fall.  U.S. hospitals have lost $200 billion dollars and laid off nearly a million workers. Urban hospitals and clinics have faced a run on equipment and supplies. While rural facilities have seen fewer COVID-19 cases, they took the same hit to their income and revenue.  Now the question may be - just how healthy is our health care system and which institutions will survive to help redefine the future of medicine?</p>\r\n      ",
            "length": "50065329",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/dovetail.prxu.org/95/ad3f4f17-2e2d-445a-be39-e748d20d9013/UsandThem_122_Healthcare_Stress_Test_PP_1.mp3",
            "epNo": "122"
        },
        {
            "title": "The Vaccination Divide",
            "datePublished": "Wed, 05 Aug 2020 22:11:07 -0000",
            "description": "\r\n        <p>The race is on to develop a vaccination that can bring an end to the coronavirus pandemic. Researchers around the world are working on an immunization to slow or stop the outbreak. As that effort ramps up, there’s clear evidence that childhood vaccination rates for existing infectious diseases have plummeted. Parents and families have postponed or cancelled routine healthcare appointments fearing COVID-19 contagion. Standard immunizations for diseases like measles, mumps, diphtheria and pertussis are down between 40 and 50%. Whether we’re talking about a coronavirus vaccine or standard childhood disease prevention, some - people  are eager to get vaccinated while others refuse. How are people likely to respond to a COVID vaccination when it’s finally developed?</p>\r\n      ",
            "length": "11711569",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/dovetail.prxu.org/95/b6ec428e-4e3e-405a-99d3-8add257ab743/UsandThem_121_Vaccination_Divide_PP_1.mp3",
            "epNo": "121"
        },
        {
            "title": "Recovery and Resiliency in Kermit",
            "datePublished": "Wed, 22 Jul 2020 18:57:15 -0000",
            "description": "\r\n        <p>At the peak of the opioid crisis, drug companies sent 12 million hydrocodone pills to Kermit, West Virginia - a town of about 350 people. Cars would line up at the one pharmacy with people waiting to pick up pain pills. The so-called pain clinics of a decade ago are gone. In their place, a continued need for addiction treatment and recovery resources. Lawsuits against big pharmaceutical companies continue to bring in settlements, but so far, Kermit hasn’t seen any money from the litigation. We head to Mingo County to see how the community is healing and what the future might look like.</p>\r\n      ",
            "length": "99730986",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/dovetail.prxu.org/95/37f1bd4b-b871-4057-96e9-a0776a82b671/UsandThem_120_Kermit_07.23.20_PP_1.mp3",
            "epNo": "120"
        },
        {
            "title": "Forced Apart: Quarantine and the Danger of Eating Disorders",
            "datePublished": "Wed, 08 Jul 2020 21:50:14 -0000",
            "description": "\r\n        <p>COVID-19 forces big changes in our society and for our medical systems. When patients with mental health conditions are forced to stay at home isolated, the resulting social distancing can be particularly dangerous. Counselors and therapists are just learning how to use virtual care and teletherapy to support their patients. One group of disorders, eating disorders, can affect a person’s physical health. If they’re left untreated, these conditions can become fatal. We’ll hear how one doctor treats her patients virtually, and helps them stay healthy.</p>\r\n      ",
            "length": "63881572",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/dovetail.prxu.org/95/bb9ec5de-b412-4689-9fa8-da3f7160db66/UsandThem_119_Eating_Disorders_07.08.20_PP_1.mp3",
            "epNo": "119"
        },
        {
            "title": "Us & Them: Abortion Divides",
            "datePublished": "Thu, 02 Jul 2020 01:06:16 -0000",
            "description": "\r\n        <p>Chief Justice John Roberts sided with the liberal wing of the U.S. Supreme Court to strike down a Louisiana abortion law. The narrow decision may be a relief to abortion rights supporters, but political watchers speculate the ruling could ignite voters in November. It may bring out those who favor a presidential candidate determined to curtail abortion rights.</p>\n\n<p>The Louisiana case was something the Us &amp; Them team was aware of last November when we released an episode called “Abortion Divides.” Last week, we learned the Public Media Journalists Association honored our program with a national award.  We’re delighted to have our work recognized by our peers in the public media universe.</p>\n\n<p>To acknowledge this recent honor, we are reposting this episode just as we released it back in November 2019. It captures some of the passion people bring to the issue - but it also brought together two women on opposite sides who found more common ground than they -- or we --  expected.   We hope even though the subject of abortion is emotionally charged, people can find a way to speak civilly about their differences.</p>\r\n      ",
            "length": "129064756",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/dovetail.prxu.org/95/12754095-8a2d-40ba-a636-8ae0ca23a3f7/UsandThem_118_Abortion_Divides_07.01.20_PP_1.mp3",
            "epNo": "118"
        },
        {
            "title": "Forced Apart: Shadow Pandemic",
            "datePublished": "Thu, 25 Jun 2020 04:30:00 -0000",
            "description": "\r\n        <p>COVID-19 has forced millions to stay at home for months. Isolation can feed anxiety and depression and now tens of millions of Americans say that potent combination threatens their mental health. Calls to help centers and suicide hotlines are up in what some call a shadow pandemic. Nearly a quarter of Americans have applied for unemployment insurance since March, when the pandemic forced businesses to shut down and people to stay home. Studies show a correlation between unemployment and suicide. In the past few months, counselors and therapists have shifted to tele-health, using phone and video chats to connect with patients and clients. Some say the changes offer a new set of clinical options that could change the way we define therapy in the future.</p>\r\n      ",
            "length": "50062848",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/dovetail.prxu.org/95/c8240dfd-69a5-4aec-b63d-2fc39ee9a89a/UsandThem_117_Mental_Health_06.25.20_PP_1.mp3",
            "epNo": "117"
        },
        {
            "title": "The Black Talk",
            "datePublished": "Fri, 19 Jun 2020 13:37:37 -0000",
            "description": "\r\n        <p>Much of the recent work of our Us &amp; Them team has focused on our day-to-day experience as we live through a global pandemic. But we need to shine our light on the deadly consequences of police<br>\nbrutality.  Racial inequality is America’s most toxic “us and them” issue. George Floyd died from a Minneapolis police officer’s chokehold. Police officers in Louisville shot and killed Breonna Taylor. Officers in Atlanta shot and killed Rayshard Brooks. The reactions to those and other killings have resulted in peaceful protests AND violent riots across the country. Those actions have prompted several Us &amp; Them listeners to request that we re-post an episode we produced two years ago. It’s called “The Black Talk.” In the light of all the calls and demands for change in the matter of racial equality, we are going to honor that request and repost the episode as it was originally released on February 28, 2018. Here’s to the dawning of a time, when this kind of  “Black Talk” can become a historical footnote.</p>\r\n      ",
            "length": "98202028",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/dovetail.prxu.org/95/2e0cfaf2-f8f0-4b6f-b3ba-f76c8ab9c9b7/UsandThem_116_Black_Talk_6.19.20_PP_1.mp3",
            "epNo": "116"
        },
        {
            "title": "COVID-19 Takes A Toll On Our Food Supply",
            "datePublished": "Wed, 10 Jun 2020 18:21:10 -0000",
            "description": "\r\n        <p>The coronavirus highlights many of our vulnerabilities, including the system we use to get food from the farm to the table.  Lately, the pandemic has forced U.S. farmers to face the unthinkable. They plowed under perfectly good vegetables when schools and restaurants shut down and their market vanished. Livestock producers have euthanized hogs and chickens. They couldn’t get the meat to consumers when workers got sick and packing plants closed. The growing season also brings migrant workers to U.S. farms. They come for jobs they need. But this year, some come wearing face masks, worried they may take the virus home to their families.</p>\r\n      ",
            "length": "19479930",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/dovetail.prxu.org/95/0995c646-7183-4993-8a92-db1bc319b9af/UsandThem_115_COVID_Takes_Toll_On_Food_Supply_6.10.20_PP_1.mp3",
            "epNo": "115"
        },
        {
            "title": "Coronavirus Czar Says Pandemic is a Stress Test for WV Health Care",
            "datePublished": "Wed, 03 Jun 2020 22:52:10 -0000",
            "description": "\r\n        <p>It’s about 10 weeks since the coronavirus pandemic shut down much of the country, including West Virginia. While state officials are now reopening businesses, the pandemic is far from over. Seventy-eight West Virginians have died due to COVID-19. 250,000 unemployment claims have been filed. But the pandemic has exacted another toll — it’s fractured many of the state’s healthcare institutions. When the state was in quarantine mode, hospitals delayed and canceled many medical procedures. People shied away from elective surgeries that are just the kind of procedures that make money for hospitals. As a result, revenues are down and some health care systems have laid off staff to keep costs down. Recently, WV’s Governor lifted those restrictions to allow elective medical procedures. As medical systems come back on line, Trey speaks with Dr. Clay Marsh -- WV’s “COVID-19 Czar.” He  sees the pandemic as an opportunity to fix the parts of the state's healthcare system that are failing some West Virginians.</p>\r\n      ",
            "length": "30089380",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/dovetail.prxu.org/95/0f95badb-d717-48e5-b4ac-6ea1afb8d726/UsandThem_114_Coronavirus_Czar_6.03.20_PP_1.mp3",
            "epNo": "114"
        },
        {
            "title": "Forced Apart: Same Pandemic, Unequal Education",
            "datePublished": "Thu, 28 May 2020 13:00:24 -0000",
            "description": "\r\n        <p>West Virginia’s 2020 school year, from kindergarten through college, is wrapping up unlike any other.  In recent years, Mountain State communities have been devastated by man-made crises and natural disasters, but nothing has affected the state’s education system like a world-wide pandemic. The coronavirus forced an extended Spring Break in March that quickly became a season of virtual classrooms and distance learning. Teachers have converted lessons into online assignments. Parents juggle their work with home-based tutoring. And schools deliver millions of meals to low-income students. As this truncated school year comes to an end, we hear from West Virginia families trying to make it work and teachers who say they’re learning valuable lessons they will use in the future. But we’re all learning something unfortunate; during a pandemic, all students aren’t equal.</p>\r\n      ",
            "length": "62399904",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/dovetail.prxu.org/95/76e9fb4b-6e86-4f90-acfd-c866495d6985/UsandThem_113_Same_Pandemic_Unequal_Education_5.22.20_PP_1.mp3",
            "epNo": "113"
        },
        {
            "title": "The Legacy of the Upper Big Branch Disaster",
            "datePublished": "Wed, 13 May 2020 15:49:16 -0000",
            "description": "\r\n        <p>Ten years ago, the Upper Big Branch Mine exploded in West Virginia. 29 men died and an investigation uncovered that a legacy of overlooked safety measures contributed to the disaster. A new play called <em>“Coal Country”</em> focuses on the stories of the men and their families. It aims to put a spotlight on prejudice against the rural working class… to bridge a divide between city dwellers and those who work with their hands underground. Co-creators Jessica Blank and Erik Jensen interviewed the families and the production weaves their words with the music of Grammy-award winner Steve Earle to help people understand another America.</p>\r\n      ",
            "length": "33101556",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/dovetail.prxu.org/95/a80ae42c-9e8a-4db8-9b0f-560c7cf09413/UsandThem_112_Legacy_of_UBB_Disaster_5.13.20_PP_1.mp3",
            "epNo": "112"
        },
        {
            "title": "Nurse Eva Travels to a COVID-19 Front Line",
            "datePublished": "Thu, 30 Apr 2020 12:03:16 -0000",
            "description": "\r\n        <p>The coronavirus pandemic prompts many reactions from people. Some people can be overwhelmed with fear and anxiety. Others step up to help where they can. U&amp;T host Trey Kay splits his time living in West Virginia and New York. A few weeks ago, he got a message from someone trying to help Eva Crockett, a West Virginian traveling nurse looking to help treat COVID patients in New York City hospitals. This person wanted to know if Trey could help Eva find a place to stay in the Big Apple. Trey ran up a “Bat signal” on social media -- asking his New York friends for help. The response was overwhelmingly positive. For Trey, New Yorkers helping a West Virginian who was willing to help New Yorkers felt like an “Us and Them” moment. </p>\r\n      ",
            "length": "21549064",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/dovetail.prxu.org/95/3180f19b-9139-4ae3-a901-b1105f6d2418/UsandThem_111_Nurse_Eva_4.30.20_PP_1.mp3",
            "epNo": "111"
        },
        {
            "title": "Forced Apart: A Virus Creates New Divides",
            "datePublished": "Thu, 23 Apr 2020 04:01:00 -0000",
            "description": "\r\n        <p>A global public health crisis in the form of an invisible virus, now officially divides us from each other. We’ve learned to call it ‘social distancing.’ But the coronavirus is creating or reopening many layers between us and them. There are divides between workers: some must show up while others work virtually and millions more have lost their jobs as businesses shutter and the economy grinds to a halt. Families see divides as they decide how many generations can safely live under the same roof. And the government creates divisions as national, state and local leaders have different responses to the pandemic. </p>\r\n      ",
            "length": "50061149",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/dovetail.prxu.org/95/764bfa1f-ac6b-444a-89be-39cb09dfa016/UsandThem_110_Forced_Apart_4.23.20_PP_1.mp3",
            "epNo": "110"
        },
        {
            "title": "The Connector",
            "datePublished": "Wed, 08 Apr 2020 04:30:05 -0000",
            "description": "\r\n        <p>In many cities and towns, there are people in charge, and there are people who get things done. Joe Slack is an instigator for community change in West Virginia’s Upper Kanawha Valley. He sees the needs in his region, one that’s been hit hard by one economic disappointment after another. But Slack is a self-described squeaky wheel. He connects people, helps identify realistic opportunities and then works to make things happen.</p>\r\n      ",
            "length": "44439791",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/dovetail.prxu.org/95/8176ff86-365b-49bf-a845-50c72a718cc5/UsandThem_109_TheConnector_4.08.20_PP_1.mp3",
            "epNo": "109"
        },
        {
            "title": "Upriver Battle: Two Mayors Join Forces to Revive Their Rural Small Towns Against All Odds",
            "datePublished": "Thu, 26 Mar 2020 04:30:00 -0000",
            "description": "\r\n        <p>Appalachia is a unique region of the country. Its namesake mountain range boasts a tangle of thick forests where the economy has relied on forestry, manufacturing and mining for jobs. The Kanawha River winds through West Virginia upstream from Charleston and was once a hotbed of mining operations and chemical plants. But these prime economic movers washed away in what two local mayors describe as an “economic tsunami.” At a time when the world is concerned with a virus that has killed people and created economic turmoil, Trey revisits a part of his home state that’s familiar with uncertainty. But it’s a place where the people find ways to keep going. He speaks with local politicians from one of the nation’s most rural states, who are looking to reshape the local economy one business at a time. This corridor is home to a ribbon of small cities and towns where people work hard to attract outside investment. That’s paying off with new ventures that are putting some people back to work.</p>\r\n      ",
            "length": "50023114",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/dovetail.prxu.org/95/0153c87d-c345-44f7-b14f-0f77c61f3da5/UsandThem_108_Upriver_Battle_3.26.20_PP_1.mp3",
            "epNo": "108"
        },
        {
            "title": "Without A Home Can You Be A Good Neighbor? ",
            "datePublished": "Wed, 11 Mar 2020 14:50:13 -0000",
            "description": "\r\n        <p>Homelessness is one of the things that divides us in America. It’s an Us<br>\n&amp; Them issue that can spring from, and inform our views on other social<br>\ntopics. The number of homeless people nationally has dropped in the past<br>\ndecade, but there was an increase between 2017 and 2018. A West Virginia man<br>\nsaw a need and is trying to help. He owns and supports a homeless encampment<br>\nthat gives people a place to live. At the same time, he balances the reaction<br>\nfrom local residents who worry about homeless people who are now, their<br>\nneighbors.</p>\r\n      ",
            "length": "17884048",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/dovetail.prxu.org/95/3e703677-94c3-482e-ac6f-4120a923f42f/UsandThem_107_Without_A_Home_3.11.20_PP_1.mp3",
            "epNo": "107"
        },
        {
            "title": "Grandfamilies of the Opioid Crisis",
            "datePublished": "Thu, 27 Feb 2020 11:00:00 -0000",
            "description": "\r\n        <p>Chemical addictions and the opioid crisis have<br>\ndivided millions of U.S. families. An addicted parent can abandon<br>\nresponsibilities to their children. When a grandparent steps in to help, it<br>\ncreates a new kind of family structure. Some call it a grandfamily. Addictions<br>\ncan create a generational Us &amp; Them divide in a household. It also<br>\nspotlights underlying financial issues that cause a strain between parents and<br>\ntheir adult children.West Virginia and other Appalachian states are<br>\nat the epicenter of this trend. But there’s a new effort called “Healthy<br>\nGrandfamilies.” It’s a training program designed to support grandparents when<br>\nthey become caregivers the second time around. </p>\r\n      ",
            "length": "98778251",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/dovetail.prxu.org/95/86bea771-f60a-440e-b4eb-f4ab00f1e20b/UsandThem_106_Grandfamilies_2.27.20_PP_1.mp3",
            "epNo": "106"
        },
        {
            "title": "Diversity Divide",
            "datePublished": "Wed, 12 Feb 2020 17:35:02 -0000",
            "description": "\r\n        <p>There are now more students of color at some universities and colleges in the U.S. In the past decade at Western Illinois University, the non-white student population nearly tripled to one-third of the enrollment. The change helped fill classrooms and satisfy the school’s mission. But it’s part of what pushed the school’s first African-American president out of his job.</p>\n\n<p><br>\nFor this episode, we look at how campus diversity can divide a community and Trey has a conversation with Jack Stripling, Senior Writer at The Chronicle of Higher Education about his article, “Fear of a Black Campus: How an ugly campaign to force out an African American president exposed racial fault lines in a mostly white town.”</p>\r\n      ",
            "length": "25183488",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/dovetail.prxu.org/95/6da37849-0d1d-4a9e-8dfd-62823291dc6d/UsandThem_105_Diversity_Divides_2.12.20_PP_1.mp3",
            "epNo": "105"
        },
        {
            "title": "Should History Be Set In Stone?",
            "datePublished": "Thu, 23 Jan 2020 05:00:00 -0000",
            "description": "\r\n        <p>When we learn our history, we see things that reflect our past. Paintings of famous battles and statues of men who were heroes to some. But how we interpret our legacy changes. Time can warp our notion of a once righteous cause. There are examples around the world of ways we have edited our past. In the U.S., recent decisions to move Confederate monuments and take down Confederate flags. But the effort to cleanse the past is global. And in places with a much longer history, the disagreements can be<br>\nmore contentious and complex.</p>\n\n<p>For this episode, Trey travels to Skopje, North Macedonia to speak with locals about controversial statues honoring Alexander the Great. He also visits a cemetery in Corinth, Mississippi to visit the graves of soldiers decorated with the Confederate battle flag. Trey also examines the origins and evolution of the song Dixie.</p>\r\n      ",
            "length": "50051954",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/dovetail.prxu.org/95/f2b97ca1-b5db-4d6d-b232-d2f3d249279d/UsandThem_104_History_set_In_Stone_1.23.20_PP_1.mp3",
            "epNo": "104"
        },
        {
            "title": "Indian Country Relocation: A One-way Ticket to Poverty",
            "datePublished": "Wed, 08 Jan 2020 14:38:12 -0000",
            "description": "\r\n        <p>North America’s early experiences with <em>Us &amp; Them</em> come from our history with indigineous people. In the 19th century, a nascent U.S. government used treaties with Native tribes and nations to take land and resources. Those treaties relocated Native people to reservations. More than a century later, from 1950 - 1970, U.S. programs were still moving people around. Approximately 100,000 Native Americans were part of what one U.S. official called a “one way ticket from rural to urban poverty.” </p>\n\n<p>For this episode, Trey speaks with reporter Max Nesterak about his American Public Media documentary, “Uprooted: The 1950s Plan To Erase Indian Country.”</p>\r\n      ",
            "length": "27703259",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/dovetail.prxu.org/95/a0406cd4-6636-42eb-986a-e4cdc6763ccd/UsandThem_103_Indian_Country_Relocation_1.8.20_PP_1.mp3",
            "epNo": "103"
        },
        {
            "title": "Music with a Message",
            "datePublished": "Thu, 26 Dec 2019 08:00:00 -0000",
            "description": "\r\n        <p>Music can entertain and inspire, and it can be a path into another person’s world. On this episode, two different musicians with roots in Appalachia make music that spans the globe. Some of it carries a political message. One man takes his music to places where people struggle with war and disasters, as an offer of healing. The other uses his string band heritage to write songs that sound familiar but carry a message of change.</p>\r\n      ",
            "length": "50050560",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/dovetail.prxu.org/95/1a1a2fd4-107f-4f95-a0bf-6f8fc32b641a/UsandThem_102_Music_with_a_Message_12.26.19_PP_1.mp3",
            "epNo": "102"
        },
        {
            "title": "We The Purple",
            "datePublished": "Thu, 12 Dec 2019 02:31:03 -0000",
            "description": "\r\n        <p>Democracy may need a reboot, or a kickstart. Pick your favorite term, but the fact is, our system of government requires our participation. When we lose trust, it suffers. “We the Purple” is a campaign designed to encourage engagement. Its partners will help tell the American story in a way that rewards active individuals who want to restore democracy’s foundations. What’s at stake if we don’t get it right? Very little, except political freedom, social and economic justice and our entire way of life. Trey speaks with “On The Media” host Bob Garfield about The Purple Project for Democracy.</p>\r\n      ",
            "length": "75730972",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/dovetail.prxu.org/95/4c9d5534-5940-4008-bcf6-751594cdb254/UsandThem_101_We_The_Purple_12.11.19_PP_1.mp3",
            "epNo": "101"
        },
        {
            "title": "Us & Them: Abortion Divides",
            "datePublished": "Wed, 27 Nov 2019 19:33:01 -0000",
            "description": "\r\n        <p>Do you disagree with any of your close friends or family members about abortion? When’s the last time you actually talked about it? For many of us, the abortion debate defines Us &amp; Them. Sometimes, it’s better to avoid the conflicts. State laws now include abortion restrictions. Next year, the U.S. Supreme Court hears a case that could change the right to legal abortion. We’ll hear from the protest lines and learn how some people who disagree, choose to talk across the divide.</p>\r\n      ",
            "length": "50063616",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/dovetail.prxu.org/95/7b374bfb-16cb-4e90-b0d4-54d91f80e5ab/UsandThem_100_Abortion_Divides_11.27.19_PP_1.mp3"
        },
        {
            "title": "The Bond Buster Says ‘No’ to Public Schools",
            "datePublished": "Wed, 06 Nov 2019 23:06:13 -0000",
            "description": "\r\n        <p>Paying taxes is one of those things we just can’t avoid… except for the local tax measures we get to vote on. One of the best examples is school spending. When local school officials ask for additional money for new academic programs or school buildings, taxpayers must approve it. There’s one man who has worked with citizen’s groups in dozens of places to fight against more money for public schools. He’s been successful in many places and his efforts highlight the Us &amp; Them in all of these communities. For this episode, Trey speaks with APM Educate producer Alex Baumhardt about her time getting to know the “Bond Buster.”</p>\r\n      ",
            "length": "75356176",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/dovetail.prxu.org/95/e812e120-a6d7-4d54-b8a9-2fca9463bc56/UsandThem_99_Bond_Buster_Says_No_11.06.19_PP_1.mp3",
            "epNo": "99"
        },
        {
            "title": "Three Tales of Coal",
            "datePublished": "Thu, 24 Oct 2019 02:17:04 -0000",
            "description": "\r\n        <p>For decades, coal was king in West Virginia. It paid good wages, paid the bills for many local services through taxes, and kept small towns alive. But more of our nation’s electricity is starting to come from other sources like wind and solar power. Coal is losing out. This Us &amp; Them episode brings us three tales of coal and its future in Appalachia. Two of those tales come from men who grew up in the same neighborhood street in Charleston, WV and now hold very different perspectives. One owns mines, the other is an environmental lawyer. Our third tale comes from a journalist who has covered the coal industry for decades. He says West Virginia needs to look at another energy player - natural gas - to determine its future. </p>\r\n      ",
            "length": "124521268",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/dovetail.prxu.org/95/ec777f2e-38e6-4d26-aa16-0792901cc96c/UsandThem_98_Three_Tales_Coal_10.23.19_PP_1.mp3",
            "epNo": "98"
        },
        {
            "title": "Losing It All: Natural Disasters and America’s Immigrant Worker",
            "datePublished": "Wed, 09 Oct 2019 17:51:25 -0000",
            "description": "\r\n        <p>We’re in the midst of the 2019 hurricane season, and people in the Bahamas are still digging out from Hurricane Dorian. In 2018 hurricane Florence hit the coast of North Carolina, which left 51 people dead and caused $24 billion in damage in the state. Disaster relief programs provide assistance to many, but in the U.S. some people are not eligible for any of that help. Undocumented migrant workers who harvest crops and perform other temporary jobs can lose everything when disaster hits.</p>\r\n      ",
            "length": "46346096",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/dovetail.prxu.org/95/9f92c06c-5da9-4a4f-96e1-12b53a660a9a/Oct2019_Pratt_pt1_v1.mp3",
            "epNo": "97"
        },
        {
            "title": "Us & Them Update: A Surprising Ending to Justice for James Means ",
            "datePublished": "Sat, 05 Oct 2019 13:35:45 -0000",
            "description": "\r\n        <p>For the past three years, the Us &amp; Them team has tracked the case of James Means since the 15-year-old boy was shot and killed by 62-year-old William Pulliam on the East End of Charleston, W.Va. The case got national attention partly because Pulliam is white and Means was black.This week, the story came to a sad<br>\nunexpected conclusion.</p>\r\n      ",
            "length": "18088600",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/dovetail.prxu.org/95/9bc7cbe1-9e6c-4654-a6b1-ef5593dccc24/UsandThem_96_Update_Sad_Ending_Justice_For_James_Means_10.05.19_PP_1.mp3",
            "epNo": "96"
        },
        {
            "title": "Faith in Science",
            "datePublished": "Thu, 26 Sep 2019 21:08:27 -0000",
            "description": "\r\n        <p>Science and faith can offer a different perspective of the world... of life... and of what we believe. When you mix in a third ingredient - politics - the dynamic can become toxic. Whether you consider evolution versus creationism or the causes of climate change, there are people who say their religious beliefs make it difficult for them to have faith in science. However, some scientists say there is nothing in theology that separates them from their faith and beliefs.  This episode looks at people of faith and people of science to find some common ground. Trey speaks with Dr. Katharine Hayhoe, a respected climate scientist, as well as a devoted evangelical Christian – two descriptions that some Americans don’t think naturally go together.</p>\r\n      ",
            "length": "125221792",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/dovetail.prxu.org/95/bd596199-fdfd-4721-a149-2adac74defd6/UsandThem_95_Faith_In_Science_9.26.19_PP_1.mp3",
            "epNo": "95"
        },
        {
            "title": "Update: Killer of James Means Changes His Mind…Again.",
            "datePublished": "Sat, 21 Sep 2019 13:20:12 -0000",
            "description": "\r\n        <p>The Us &amp; Them team has tracked the case of James Means — a 15-year-old boy who was shot and killed in Charleston, WV by William Pulliam back in November 2016. The case got national attention partly because Pulliam is white and Means was black. It was one of a number of shootings that focused on questions about<br>\nracial injustice in our legal system. Last month, Pulliam agreed to plead guilty to second-degree murder. A week later, he wrote to the judge and asked to revoke his plea. This week the judge called Pulliam into court to get a clarification.</p>\r\n      ",
            "length": "8664412",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/dovetail.prxu.org/95/025cffb5-05b4-43c6-90f0-dbecc69735c3/UsandThem_94_Update_Pulliam_Changes_Mind_Again_9.21.19_PP_1.mp3"
        },
        {
            "title": "Update: Farm Wars",
            "datePublished": "Wed, 11 Sep 2019 04:00:00 -0000",
            "description": "\r\n        <p>Last spring, we put out an episode called “Farm Wars.” It was about Arkansas farmers' never-ending battles with “pigweed” or as some call it “Satan’s Weed.” It’s incredibly hard to get rid of. There’s a controversy in that state over a herbicide called “dicamba” that’s used to keep the weeds at bay, but has divided the farming community. For more than a year and a half, Us &amp; Them host Trey Kay and his colleague Loretta Williams have tracked the Arkansas dicamba saga. In their last report, they told us that farmers and the state government had set some rules they hoped everyone could live by. Now, Trey checks in with Loretta and Arkansas Public Media’s Dan Breen to see how this year's growing season is going.</p>\n\n<p>Spoiler Alert: There are a lot of “cupped” leaves on trees surrounding Arkansas soybean fields</p>\r\n      ",
            "length": "60219383",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/dovetail.prxu.org/95/06f32761-ed6a-4bf0-b9f7-b678fafab3fa/UsandThem_93_Update_Farm_Wars.mp3",
            "epNo": "93"
        },
        {
            "title": "Update: Killer of James Means Seeks to Revoke Plea",
            "datePublished": "Wed, 14 Aug 2019 16:18:23 -0000",
            "description": "\r\n        <p>For nearly three years, the Us &amp; Them team has tracked the case of James Means - a 15-year-old boy who was shot and killed in Charleston, WV, by William Pulliam, who was 62 years old at the time. The case got national attention partly because Pulliam is white and Means was black. It was one of a number of shootings that focused on questions about racial injustice in our legal system. A week ago, it seemed like there was conclusion to the protracted prosecution, when Pulliam agreed to plead guilty to second degree murder. This week, he wrote to the judge and asked to revoke his plea.</p>\r\n      ",
            "length": "10982092",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/dovetail.prxu.org/95/42da80d3-01be-4d5c-a5c7-4dfbf189363d/UsandThem_92_Update_Pulliam_Seeks_To_Revoke_Plea_8.14.19_PP_1.mp3",
            "epNo": "92"
        },
        {
            "title": "What, Us Worry?: Life After MAD",
            "datePublished": "Fri, 09 Aug 2019 20:24:01 -0000",
            "description": "\r\n        <p>MAD Magazine, once the touchstone of American satire and snark, is winding down its publication after 67 years. Trey says, as a kid, MAD’s adolescent-focused, subversive content helped him connect with his inner “wise ass.” It made him feel smarter and stupider at the same time. And now he’s trying to reconcile an Us &amp; Them world without MAD firing its arrows toward the sacred cows of our culture.</p>\r\n      ",
            "length": "56887816",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/dovetail.prxu.org/95/4e9b417b-51a0-4768-80e1-55d0cda18dc3/UsandThem_91_What_Us_Worry_MAD_Magazine_8.09.19_PP_1.mp3",
            "epNo": "91",
            "categories": [
                "\r\n        MAD Magazine \r\n      ",
                "\r\n        Satire\r\n      ",
                "\r\n        Us & Them\r\n      "
            ]
        },
        {
            "title": "Update: Justice for James Means",
            "datePublished": "Wed, 07 Aug 2019 16:59:38 -0000",
            "description": "\r\n        <p>For nearly three years, the Us &amp; Them team has followed the James Means’ case - a 15-year-old boy who was shot and killed  in Charleston, WV, by William Pulliam, who was 62 years old at the time. The case got national attention partly because Pulliam is white and Means was black. It was one of a number of shootings that focused on questions about racial injustice in our legal system. Pulliam’s trial was scheduled to begin  late this summer, but instead there’s been a surprise outcome.</p>\r\n      ",
            "length": "19135732",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/dovetail.prxu.org/95/bada3811-56e5-4dc6-bc16-b40fac8a67ec/UsandThem_90_Update_JusticeForJamesMeans_8.07.19_PP_1.mp3",
            "categories": [
                "\r\n        Interracial Violence\r\n      ",
                "\r\n        James Means\r\n      ",
                "\r\n        Us & Them\r\n      ",
                "\r\n        William Pulliam\r\n      "
            ]
        },
        {
            "title": "My Friend From Camp",
            "datePublished": "Thu, 25 Jul 2019 13:10:40 -0000",
            "description": "\r\n        <p><strong>Two men, one a British citizen of Pakistani heritage, and the other a former housing<br>\npolice officer in the Boston area, were unlikely to meet, until the terror attacks of September 11th, 2001. But after the Bush Administration launched the War on Terror, Moazzam Begg was detained and held at the U.S. Detention Camp at Guantanamo Bay, Cuba where Albert Melise was a guard. You can’t get much more Us &amp; Them than that. We’re rebroadcasting this episode, which was recently honored with a first place award for Long Documentary by the Public Media Journalists Association.</strong></p>\r\n      ",
            "length": "124669516",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/dovetail.prxu.org/95/f51522c3-de4f-4242-bf97-f3ac145465cd/UsandThem_89_MyFriendFromCamp_7.24.19_PP_1.mp3",
            "epNo": "89",
            "categories": [
                "\r\n        9/11\r\n      ",
                "\r\n        Albert Melise\r\n      ",
                "\r\n        Guatanamo Detention Center\r\n      ",
                "\r\n        Moazzam Begg\r\n      ",
                "\r\n        September 11, 2001\r\n      ",
                "\r\n        War on Terror\r\n      "
            ]
        },
        {
            "title": "Immigrant ‘Concentration Camps’ on the Southern Border?",
            "datePublished": "Wed, 10 Jul 2019 20:35:20 -0000",
            "description": "\r\n        <p><strong>U.S. immigration policies are very much in the spotlight recently with reports on conditions at some of the southern border detention camps and fresh concerns about children being held apart from their parents. Recently, Congresswoman Alexandria Ocasio-Cortez called these facilities “concentration camps” and was swiftly rebuked by people on the right and left. To be clear, the U.S. government holds immigrants -- who have entered the country illegally -- while they’re being processed. The question is: what do we call these places?  Are they Detention centers -- as the government refers to them?  Detainment camps? Is Ocasio-Cortez misinformed and perhaps, hyperbolic when she injects a loaded term like “concentration camp” into the discussion? To get a better perspective on this, Trey thought it’d be a good time to check in with author Andrea Pitzer about her book, <em>One Long Night: A Global History of Concentration Camps</em>.</strong></p>\r\n      ",
            "length": "75778996",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/dovetail.prxu.org/95/9ff4ee8e-5b96-4426-a8e2-1cddb17125d6/UsandThem_88_BorderConcentrationCamps_6.26.19_PP_1.mp3",
            "epNo": "88",
            "categories": [
                "\r\n        Alexandria Ocasio-Cortez\r\n      ",
                "\r\n        Andrea Pitzer\r\n      ",
                "\r\n        Child Separation\r\n      ",
                "\r\n        Concentration Camps\r\n      ",
                "\r\n        Holocaust\r\n      ",
                "\r\n        Immigration\r\n      ",
                "\r\n        Japanese Internment Camps\r\n      ",
                "\r\n        Southern Border\r\n      ",
                "\r\n        Zero Tolerance Policy\r\n      "
            ]
        },
        {
            "title": "Pride in the Mountain State",
            "datePublished": "Wed, 26 Jun 2019 12:03:31 -0000",
            "description": "\r\n        <p>June is Gay Pride month across the U.S. and around the world. It’s a celebration of increased social acceptance and expanded legal rights. But as Trey has learned, despite that, there are still attitudes and even words that continue to cause pain. An <em>Us &amp; Them</em> episode we called “Revisiting the Grand Palace” stirred up just such a reaction from Mark Yozie, a self-described proud, gay man living in the Mountain State. He was incensed at our story, and in this episode, he and Trey meet to talk things out. And we offer a tribute to “Maw Maw,” a gay man who was sent to a West Virginia mental institution in the 1960s for violating sodomy laws.  </p>\r\n      ",
            "length": "124717540",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/dovetail.prxu.org/95/98d81feb-c5be-41b7-8f1b-811867953986/UsandThem_87_PrideMountainState_6.26.19_PP_1.mp3",
            "epNo": "87",
            "categories": [
                "\r\n        Gay Pride\r\n      ",
                "\r\n        Gay Pride Month\r\n      ",
                "\r\n        LGBTQ Rights\r\n      ",
                "\r\n        Sodomy Laws\r\n      ",
                "\r\n        West Virginia LGBTQ\r\n      "
            ]
        },
        {
            "title": "Reckoning with Sexual Assault: Righting a Wrong",
            "datePublished": "Thu, 13 Jun 2019 16:20:09 -0000",
            "description": "\r\n        <p>Two college freshman spend a night together. There’s inexperience, miscommunication and things go wrong -- really wrong. One of them calls what happened sexual assault, the other calls it rape. But together, they’ve found a remarkable way to recover, heal and learn.  For this episode, Trey speaks with Stephanie Lepp, the producer of the podcast “Reckonings” about the story of Anwen and Sameer and one night that has changed their lives.</p>\r\n      ",
            "length": "68550340",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/dovetail.prxu.org/95/9181ca73-b293-4a70-bff2-7b9542c923ab/UsandThem_86_ReckoningSexualAssault_6.06.19_PP_1.mp3",
            "epNo": "86"
        },
        {
            "title": "Farm Wars",
            "datePublished": "Wed, 22 May 2019 20:45:48 -0000",
            "description": "\r\n        <p><strong>It’s a tough time to be a soybean farmer in the U.S.  Soybeans are a $40 billion business in America, but crop prices plummeted last year because of  the trade war between the U.S. and China.  That has many farmers taking steps to boost their crop yields and effective weed prevention is one approach.   For years, farmers kept even the stubborn “pigweed” at bay with herbicides like Monsanto’s Round-up.  But over time, weeds become resistant to the chemical. Monsanto and other companies have  another product that relies on a chemical called “dicamba,” which effectively keeps the weeds at bay. But, there’s a problem:  dicamba can  evaporate and drift from where its  sprayed and harm other sensitive plants. In  2017, the drifting chemical damaged some three and half million acres of valuable crops. In this episode, Trey Kay and Loretta Williams travel to Arkansas to report on a simmering battle -- more like a civil war -- that pits farmer against farmer and forces them to consider the line between doing what’s good for their business and doing what’s good for their neighbor.</strong></p>\r\n      ",
            "length": "73476504",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/dovetail.prxu.org/95/b214876a-8f9e-4a5b-9b5c-9cf1e94721d1/UsandThem_85_FarmWars_5.22.19_PP_1.mp3"
        },
        {
            "title": "Still Waiting For Justice",
            "datePublished": "Wed, 08 May 2019 18:55:05 -0000",
            "description": "\r\n        <p>Two and a half years ago, an African-American teen named James Means was shot and killed in Charleston, WV. An older white man, William Pullman faces first-degree murder charges. The trial was scheduled<br>\nfor this week, but instead, the Means family learned there's a new twist in the case. They talk with Trey and Lacie Pierson of the Charleston Gazette for an update.</p>\r\n      ",
            "length": "40827964",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/dovetail.prxu.org/95/e7046887-969a-4c1c-8be4-7c66c79e53e4/UsandThem_84_StillWaitingForJustice_5.08.19_PP_1.mp3",
            "categories": [
                "\r\n        Charleston Gazette\r\n      ",
                "\r\n        Charleston, WV\r\n      ",
                "\r\n        James Means\r\n      ",
                "\r\n        Killing of Young Black Men\r\n      ",
                "\r\n        Lacie Pierson\r\n      ",
                "\r\n        Nafia Fay Adkins\r\n      ",
                "\r\n        Us & Them\r\n      ",
                "\r\n        William Pulliam\r\n      "
            ]
        },
        {
            "title": "Waiting for Justice",
            "datePublished": "Wed, 24 Apr 2019 07:00:00 -0000",
            "description": "\r\n        <p>In Charleston, WV back in November 2016, William Pulliam, a 62-year-old white man, shot and killed James Means, a 15-year-old African-American boy. The case made national headlines. Reports say during his confession, Pulliam told police, “The way I look at it, that’s another piece of trash off of the street.” </p>\n\n<p>Trey has met with lawyers and others grieving such a loss.  Multiple delays have pushed back  Pulliam’s trial. One delay was to assess Pulliam’s mental competency, a move the Means’ family just doesn’t understand. In December 2018, Pulliam was finally declared mentally competent, and his trial is scheduled to start in early May 2019.</p>\n\n<p>With so many delays, the Means family, has little confidence in the legal system.  As the trial date approaches, they’re waiting for justice.</p>\r\n      ",
            "length": "97895234",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/dovetail.prxu.org/95/daf55c31-a0c7-4fd2-adc7-b6259fa1e10b/UsandThem_83_Justice_42419_PP_1.mp3",
            "epNo": "83"
        },
        {
            "title": "Opioid Recovery in Appalachia's Ground Zero",
            "datePublished": "Thu, 11 Apr 2019 15:36:49 -0000",
            "description": "\r\n        <p>America has a drug addiction crisis. Recovery could take decades. Opioid addiction has hit<br>\nAppalachia harder than any region in the nation. This episode, Trey talks to Caitlin Esch, a reporter for The<br>\nUncertain Hour podcast produced by APM’s Marketplace. Caitlin has spent years<br>\ntracking the challenges of the drug epidemic in Wise County, VA, where opioid<br>\naddiction, and now methamphetamine and cocaine abuse takes lives and devastates<br>\nfamilies.</p>\r\n      ",
            "length": "81109660",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/dovetail.prxu.org/95/cdf27473-72f2-4215-8a30-2687462b32e1/UsandThem_82_WiseCounty_4.11.19_PP_1.mp3",
            "epNo": "82",
            "categories": [
                "\r\n        Caitlin Esch\r\n      ",
                "\r\n        Opioid Crisis\r\n      ",
                "\r\n        Opioid Epidemic\r\n      ",
                "\r\n        The Uncertain Hour\r\n      ",
                "\r\n        Trey Kay\r\n      ",
                "\r\n        Us & Them\r\n      ",
                "\r\n        Wise County, VA\r\n      ",
                "\r\n        Wise Works\r\n      "
            ]
        },
        {
            "title": "States Look to Appalachia for Vaccination Laws",
            "datePublished": "Fri, 29 Mar 2019 20:02:55 -0000",
            "description": "\r\n        <p>Measles cases have spiked in the first quarter of 2019 with<br>\noutbreaks in ten states. Vaccinations prevent many communicable diseases, but<br>\nmeasles is back. Epidemiologists believe it's because some parents do not<br>\nimmunize their children. As a result, the so called “herd protection” from<br>\ndisease that public health officials rely on, is weaker. The option to forgo<br>\nvaccinations varies from state to state and is based on laws that are different<br>\nacross the country. Some states allow vaccination exemptions based on a person’s<br>\nreligious or philosophical beliefs. However some lawmakers are rethinking their<br>\nvaccination policies because of the recent up tick in measles cases - and<br>\nthey’re looking to an unlikely part of the country as a model: Appalachia.</p>\r\n      ",
            "length": "72589576",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/dovetail.prxu.org/95/e8301d62-cebe-4308-8946-2dc0a7e0e810/UsandThem_81_VaccinationAppalachia_3.29.19_PP_1.mp3",
            "epNo": "81"
        },
        {
            "title": "Reconnecting With Femme Voice ",
            "datePublished": "Wed, 13 Mar 2019 15:15:27 -0000",
            "description": "\r\n        <p>In the winter of 2016, we told the story of Anne Kelly Skinner, a Charleston, WV lawyer, who was transitioning from male to female.  As Anne's body became less dude-like and more womanly, she was pleased. However, she worried her voice wouldn’t match her new body. There are many physical challenges for transgender people, one that doesn't get a lot of attention is how a trans woman learns to sound like a woman. If a woman sounds like a guy, can she truly feel like a woman?  We revisit Anne, three years later, to find out how she’s doing and if she has found what she calls, her femme voice.</p>\r\n      ",
            "length": "50044426",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/dovetail.prxu.org/95/e1effa52-7b67-48c4-9128-faadf8ee2a0e/UsandThem_80_ReassertingFemmeVoice_3.16.19_PP_1.mp3",
            "epNo": "80",
            "categories": [
                "\r\n        Us and Them, Trey Kay, transgender\r\n      "
            ]
        },
        {
            "title": "Scarlet Letters and Second Chances",
            "datePublished": "Wed, 27 Feb 2019 05:00:00 -0000",
            "description": "\r\n        <p>As a West Virginia teenager, Amber Miller dropped out of school, took drugs and robbed homes. She wound up on the wrong side of the law and served time for a felony. In a youth correction center, she turned her life around, but after her release, had trouble finding a job to support her two sons. Like 8% of Americans with felony conviction, Amber had to “check the box” on job applications admitting to her criminal past. The felony on her record was like a ‘scarlet letter’ and most employers were reluctant to hire her. Amber was committed to change, but was society willing to give her a second chance? Trey speaks with Amber and West Virginia politicians about the state’s plans for helping felons get back into the workforce.</p>\r\n      ",
            "length": "54659027",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/dovetail.prxu.org/95/aabd8bd7-7025-4073-bb63-03c4b721f87d/UsandThem_79_2ndChance02.27.18_PP_1.mp3",
            "epNo": "79"
        },
        {
            "title": "Black Talk",
            "datePublished": "Wed, 13 Feb 2019 05:20:06 -0000",
            "description": "\r\n        <p>How old were you when you first learned that police may think of you as a threat?</p>\n\n<p>You’ve never been told that?</p>\n\n<p>Chances are you’re not African American. In this episode, Trey Kay examines “The Black Talk,” which is the sober conversation that many black families have with their teenage kids – particularly teenage boys – about how they should conduct themselves when stopped by the police.</p>\n\n<p>Spoiler alert: Black parents, like any parent, want their kids to come home alive.</p>\n\n<p>We’ll also learn from a chapter of Charleston, West Virginia’s Civil Rights legacy from a minister mentored by Dr. Martin Luther King Jr.</p>\r\n      ",
            "length": "48833875",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/dovetail.prxu.org/95/b2fe40b8-5b1f-4c72-be0a-3de921423942/UsandThem_78_BlackTalk_2.12.19_PP_1.mp3",
            "epNo": "78",
            "categories": [
                "\r\n        Black families\r\n      ",
                "\r\n        Charleston\r\n      ",
                "\r\n        Ron English\r\n      ",
                "\r\n        Trey Kay\r\n      ",
                "\r\n        Us & Them\r\n      ",
                "\r\n        civil rights\r\n      ",
                "\r\n        police\r\n      ",
                "\r\n        race relations\r\n      ",
                "\r\n        urban renewal\r\n      ",
                "\r\n        young Black men\r\n      "
            ]
        },
        {
            "title": "Cave Men, The Patriarchy & Fairytales",
            "datePublished": "Wed, 30 Jan 2019 05:00:00 -0000",
            "description": "\r\n        <p>Throughout history, men have been seen as the dominant gender. Why is this? Some assume the model goes all the way back to the primitive cave man. Others believe the gender pecking order was commanded by God. In this episode, Trey speaks with John Biewen and Celeste Headlee about their “Men” series for the \"Scene On Radio\" podcast. In this episode we dive deep into how, when and why men invented the patriarchy, and how it hurts everyone.</p>\r\n      ",
            "length": "28736977",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/dovetail.prxu.org/95/f4cb5e69-7b89-45ef-9e66-71a41ff0ef7d/UsandThem_Cavemen_Fairytales_013019_PP_1_rev3.mp3",
            "epNo": "77",
            "categories": [
                "\r\n        #metoo\r\n      ",
                "\r\n        cavemen\r\n      ",
                "\r\n        celeste headlee\r\n      ",
                "\r\n        feminism\r\n      ",
                "\r\n        gender equality\r\n      ",
                "\r\n        gender roles\r\n      ",
                "\r\n        john biewen\r\n      ",
                "\r\n        man cave\r\n      ",
                "\r\n        men\r\n      ",
                "\r\n        patriarchy\r\n      ",
                "\r\n        trey kay\r\n      ",
                "\r\n        us & them\r\n      "
            ]
        },
        {
            "title": "My Friend From Camp",
            "datePublished": "Mon, 14 Jan 2019 23:54:23 -0000",
            "description": "\r\n        <p>Moazzam Begg, a British citizen of Pakistani heritage, and Albert Melise, a former housing police officer in the Boston area, were unlikely to have their life stories intersect and become friends; but then September 11 happened.</p>\n\n<p>After the Bush Administration launched the War on Terror, Begg was detained and held at the U.S. Detention Camp at Guantanamo Bay, Cuba. Melise was a Gitmo guard. You can’t get much more Us &amp; Them than that.</p>\r\n      ",
            "length": "49796728",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/dovetail.prxu.org/95/3263b803-f67b-4a5c-af1e-119d2d48698b/UsandThem_76_MyFriendFromCamp_1.14.19_PP_1.mp3",
            "epNo": "76",
            "categories": [
                "\r\n        Guantanamo\r\n      ",
                "\r\n        Trey Kay\r\n      ",
                "\r\n        Us & Them\r\n      ",
                "\r\n        culture wars\r\n      ",
                "\r\n        torture\r\n      ",
                "\r\n        war on terror\r\n      "
            ]
        },
        {
            "title": "War on Christmas…Really? 2018",
            "datePublished": "Tue, 18 Dec 2018 22:03:24 -0000",
            "description": "\r\n        <p>It’s that time of year again, when Trey’s Twitter and Facebook feeds flare up with posts about a “War on Christmas.” Every year there’s hubbub over how saying “Happy Holidays” instead of “Merry Christmas” is TOO politically correct, or that a nativity scene doesn't belong on government property. Christmas traditionalists feel there’s an attack on this sacred holiday, while secularists seem bothered that this religious holiday has a privileged place in a country known for its separation of church and state.  For this (mostly fun) episode, Trey and historian Adam Laats ponder the nature of this so-called “war.”</p>\r\n      ",
            "length": "50497705",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/dovetail.prxu.org/95/e82b111d-577e-48e0-89da-db8716263ea9/UsandThem_75_WaronChristmas2018_12.18.18_PP_1.mp3",
            "epNo": "75",
            "categories": [
                "\r\n        Adam Laats\r\n      ",
                "\r\n        Christianity\r\n      ",
                "\r\n        Christmas\r\n      ",
                "\r\n        Trey Kay\r\n      ",
                "\r\n        Us and Them\r\n      ",
                "\r\n        culture wars\r\n      ",
                "\r\n        holiday music\r\n      ",
                "\r\n        holidays\r\n      "
            ]
        },
        {
            "title": "Culture Clash: Back to the Border",
            "datePublished": "Wed, 05 Dec 2018 09:00:00 -0000",
            "description": "\r\n        <p>Back in the 1990s, Trey got into Culture Clash, a trio of Latino comedians who do social satire. He loved that they skewered public figures and poke sacred cows. Culture Clash enjoys making the audience squirm, no matter what part of the political spectrum they're on. Their critically acclaimed work in the 90s had to do with tension along the U.S.-Mexico border. Recently, they’ve been reviving and updating their pieces because – if you haven’t heard – news from the border is pretty relevant these days.</p>\r\n      ",
            "length": "23420012",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/dovetail.prxu.org/95/e3631268-8ac0-45e6-82e1-d0a48c281934/UsandThem_74_CultureClash_12.05.18_PP_1.mp3",
            "epNo": "74",
            "categories": [
                "\r\n        Chicano\r\n      ",
                "\r\n        Latino\r\n      ",
                "\r\n        Latinx\r\n      ",
                "\r\n        Politics\r\n      ",
                "\r\n        comedy\r\n      ",
                "\r\n        satire\r\n      "
            ]
        },
        {
            "title": "EXTRA: Red State Blue State, Ep.10 -- Origins of the Epidemic",
            "datePublished": "Fri, 30 Nov 2018 16:55:34 -0000",
            "description": "\r\n        <p>Last year, 72,000 Americans died from drug overdoses.  A lot of those deaths -- about three-fourths -- were caused by opioid medication prescribed by doctors or substances like heroin obtained on the street.</p>\n\n<p>A disproportionate number of the dead are from West Virginia. For several years, the state has led the nation in per-capita opioid-related deaths.</p>\n\n<p>In this episode, hosts Trey Kay and Chery Glaser talk about the origins of the Appalachian drug epidemic. They're joined by Los Angeles crime reporter Sam Quinones, the author of Dreamland: The True Tale of America’s Opiate Epidemic, and by Ian Kessinger, a former addict who now runs a recovery clinic in Elkins, West Virginia.</p>\r\n      ",
            "length": "11112786",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/dovetail.prxu.org/95/9f7501a6-4670-439e-8549-a3b3b652fe14/UsandThem_Extra_RedStateBlueState10_11.30.18_PP_1.mp3",
            "categories": [
                "\r\n        Appalachia\r\n      ",
                "\r\n        Opioids\r\n      ",
                "\r\n        addiction\r\n      ",
                "\r\n        epidemic\r\n      ",
                "\r\n        politics\r\n      "
            ]
        },
        {
            "title": "The Great Textbook War",
            "datePublished": "Wed, 21 Nov 2018 21:23:37 -0000",
            "description": "\r\n        <p>In 1974, a fierce controversy erupted over some newly adopted school textbooks in Kanawha County, West Virginia. School buildings were hit by dynamite and Molotov cocktails, buses were riddled with bullets, journalists were beaten and surrounding coal mines were shut down by protesting miners. Textbook supporters<br>\nthought they would introduce students to new ideas about literature and multi-culturalism. Opponents felt<br>\nthe books undermined traditional American values.</p>\r\n      ",
            "length": "55256092",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/dovetail.prxu.org/95/ce392fde-ede6-4cd3-a295-4df4ff425f12/UsandThem_73_TheGreatTextbookWar_11.22.18_PP_1.mp3",
            "epNo": "73",
            "categories": [
                "\r\n        Charleston\r\n      ",
                "\r\n        Textbooks\r\n      ",
                "\r\n        Trey Kay\r\n      ",
                "\r\n        Us & Them\r\n      ",
                "\r\n        WVPB\r\n      ",
                "\r\n        West Virginia\r\n      ",
                "\r\n        culture wars\r\n      ",
                "\r\n        education\r\n      "
            ]
        },
        {
            "title": "EXTRA: Red State Blue State, Ep.9 -- Make applebutter, not war",
            "datePublished": "Wed, 21 Nov 2018 00:38:12 -0000",
            "description": "\r\n        <p>Election season’s over, but we sure haven’t put politics behind us. Not with the holidays approaching. Some families avoid talking politics over the turkey, but other family gatherings descend into political fights. Trey takes us on a visit to a family with deep political divisions — but they also have a trick for keeping it friendly. </p>\r\n      ",
            "length": "11522804",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/dovetail.prxu.org/95/92e58d45-f030-4432-94c3-ad92e5c605ec/UsandThem_Extra_RedStateBlueState9_11.21.18_PP_1.mp3",
            "categories": [
                "\r\n        KCRW\r\n      ",
                "\r\n        WVPB\r\n      ",
                "\r\n        families\r\n      ",
                "\r\n        holidays\r\n      ",
                "\r\n        politics\r\n      "
            ]
        },
        {
            "title": "EXTRA: Red State Blue State, Ep.8 -- The Media",
            "datePublished": "Fri, 16 Nov 2018 15:40:36 -0000",
            "description": "\r\n        <p>Political debate in this country has become anything but civil. Who do you blame? Nearly a third of Americans surveyed by NPR blamed “the media.” In this episode, Red State host Trey Kay goes to a Trump rally to see how reporters are treated, and Blue State host Chery Glaser talks with a West Coast journalist about how journalists should respond.</p>\r\n      ",
            "length": "10051170",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/dovetail.prxu.org/95/6fef9ab5-4dd4-45b0-a38b-e13851c1b6d5/UsandThem_Extra_RedStateBlueState8_11.16.18_PP_1.mp3",
            "categories": [
                "\r\n        California\r\n      ",
                "\r\n        Dana Rohrabacher\r\n      ",
                "\r\n        Donald Trump\r\n      ",
                "\r\n        West Virginia\r\n      ",
                "\r\n        elections\r\n      ",
                "\r\n        news media\r\n      ",
                "\r\n        politics\r\n      "
            ]
        },
        {
            "title": "EXTRA: Red State Blue State, Ep.7 -- Two Views",
            "datePublished": "Fri, 09 Nov 2018 15:39:40 -0000",
            "description": "\r\n        <p>The midterm election results seem to deliver conflicting messages depending on where you live. In California, candidates were rewarded for opposing President Trump -- critics like California’s new Gov. Gavin Newsom won big. But in West Virginia, Sen. Joe Manchin was returned to office while siding with the president on key issues. What's going on?</p>\n\n<p>Trey talks with Cherry Glazer of KCRW in California in the latest episode of “Red State Blue State,” our weekly chat between Trump Country and the Blue Bubble.</p>\r\n      ",
            "length": "9787856",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/dovetail.prxu.org/95/59d3d0bd-201b-45d0-9d8d-041e1cdcf168/UsandThem_Extra_RedStateBlueState7_11.09.18_PP_1.mp3"
        },
        {
            "title": "Reading Wars",
            "datePublished": "Wed, 07 Nov 2018 15:10:27 -0000",
            "description": "\r\n        <p>Researchers say science makes it clear that there's a direct, systematic way we should be teaching kids to read. But lots of people discount the science of reading. They say teaching kids to sound out words is boring, and kids will learn to read naturally if they're read to and exposed to lots of books. This is more of an angry argument than a polite debate. It's been raging for years. And there's a lot at stake. Millions of American adults are not proficient readers.</p>\n\n<p>Trey talks with Emily Hanford about her radio documentary, “Hard Words.”</p>\r\n      ",
            "length": "24951168",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/dovetail.prxu.org/95/5cd08ac1-fbf5-45bb-b87e-1d379ef800ce/UsandThem_72_ReadingWars_11.07.18_PP_1.mp3",
            "epNo": "72",
            "categories": [
                "\r\n        APM Reports\r\n      ",
                "\r\n        Emily Hanford\r\n      ",
                "\r\n        education\r\n      ",
                "\r\n        literacy\r\n      ",
                "\r\n        phonics\r\n      ",
                "\r\n        reading\r\n      ",
                "\r\n        schools\r\n      ",
                "\r\n        teaching\r\n      ",
                "\r\n        whole language\r\n      "
            ]
        },
        {
            "title": "EXTRA: Red State Blue State, Ep.6 -- Deana & Linda",
            "datePublished": "Fri, 02 Nov 2018 08:00:00 -0000",
            "description": "\r\n        <p>When we cast a ballot, it's personal. About as personal as it gets.</p>\n\n<p>That’s easy to forget when we talk about big blocks of voters, like congressional districts or entire states.</p>\n\n<p>So Blue State host Chery Glaser takes it to the personal level and talks with two voters.</p>\n\n<p>In Southern California, Linda Rife is a music composer. She identifies as \"liberal,\" but she’s registered as an independent.</p>\n\n<p>In West Virginia, Deana Samms is a family therapist and an evangelical Christian. She voted for Donald Trump in 2016 but struggled with that decision.</p>\r\n      ",
            "length": "12707718",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/dovetail.prxu.org/95/f4cf223b-72bb-42f2-a766-41c0edc03728/UsandThem_Extra_RedStateBlueState6_11.02.18_PP_1.mp3",
            "categories": [
                "\r\n        California\r\n      ",
                "\r\n        Election\r\n      ",
                "\r\n        KCRW\r\n      ",
                "\r\n        WVPB\r\n      ",
                "\r\n        West Virginia\r\n      ",
                "\r\n        midterms\r\n      ",
                "\r\n        politics\r\n      ",
                "\r\n        voters\r\n      "
            ]
        },
        {
            "title": "EXTRA: Red State Blue State, Ep.5 -- Immigration",
            "datePublished": "Fri, 26 Oct 2018 14:20:09 -0000",
            "description": "\r\n        <p>The migrant caravan moving through Mexico is nowhere near the U.S. border, but it's smack dab in the middle of the nation’s politics. As we draw near the midterm election, this week's episode brings us views on immigration from Angelenos in the “Blue Bubble” and red-state West Virginians at a rally with Vice President Mike Pence.</p>\r\n      ",
            "length": "10129747",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/dovetail.prxu.org/95/dc11d7c6-f643-432d-a523-a83df4da7186/UsandThem_Extra_RedStateBlueState5_10.26.18_PP_1.mp3",
            "categories": [
                "\r\n        California\r\n      ",
                "\r\n        KCRW\r\n      ",
                "\r\n        WVPB\r\n      ",
                "\r\n        West Virginia\r\n      ",
                "\r\n        elections\r\n      ",
                "\r\n        immigration\r\n      ",
                "\r\n        midterm\r\n      ",
                "\r\n        politics\r\n      "
            ]
        },
        {
            "title": "\"Steve\"",
            "datePublished": "Thu, 25 Oct 2018 01:46:39 -0000",
            "description": "\r\n        <p>According to the National Center for Health Statistics, in the last 2 years, 2 million people misused prescription opioids for the first time.  “Steve,” a curious kid from New Hampshire, found his mom’s Oxycodone pills in the medicine cabinet and liked the way they made him feel. Before long, he wanted to see what the big deal was with heroin, and doubted that he’d become addicted.  As it turns out, he got hooked on his first try. In this episode, we’ll hear Steve’s struggle to stay clean and how his addiction became a family affair. We’ll also hear his parents speak openly—at times, brutally--about the limitations of “being there” for an addict.</p>\r\n      ",
            "length": "50687023",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/dovetail.prxu.org/95/fcf1dc6d-d747-42bc-9652-dfb8638a07fc/UsandThem_71_Steve_10.24.18_PP_1.mp3",
            "epNo": "71",
            "categories": [
                "\r\n        Addiction\r\n      ",
                "\r\n        Heroin\r\n      ",
                "\r\n        Opiods\r\n      ",
                "\r\n        Us & Them\r\n      "
            ]
        },
        {
            "title": "EXTRA: Red State Blue State, Ep.4 -- Coal: Hero or Villain?",
            "datePublished": "Fri, 19 Oct 2018 09:00:00 -0000",
            "description": "\r\n        <p>In the past, President Trump has called climate change a hoax. Then this week, Trump told 60 Minutes that he believes the climate is changing — but that the change isn’t caused by humans, and it will probably change back. Trump said the economy is more important than the climate, so trying to fight climate change makes no sense. He said it would cost jobs, and for no good reason.</p>\n\n<p>These two related issues – climate change and energy jobs – get very different reactions in California and Appalachia. You’ll hear those reactions in this installment of “Red State, Blue State,” our weekly chat between Trump Country and the Blue Bubble.</p>\r\n      ",
            "length": "9787020",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/dovetail.prxu.org/95/5da02910-7e09-4d94-ba59-20b8ce02a881/UsandThem_Extra_RedStateBlueState4_10.19.18_PP_1.mp3",
            "categories": [
                "\r\n        California\r\n      ",
                "\r\n        West Virginia\r\n      ",
                "\r\n        climate change\r\n      ",
                "\r\n        coal\r\n      ",
                "\r\n        elections\r\n      ",
                "\r\n        energy\r\n      ",
                "\r\n        jobs\r\n      ",
                "\r\n        politics\r\n      "
            ]
        },
        {
            "title": "EXTRA: Red State Blue State, Ep.3 -- Why is Joe Manchin a Democrat?",
            "datePublished": "Fri, 12 Oct 2018 10:00:00 -0000",
            "description": "\r\n        <p>West Virginia Senator Joe Manchin voted to confirm Brett Kavanaugh, President Trump’s pick for the U.S.  Supreme Court. Manchin was the only Democrat in the Senate to cross party lines, and he did it in a very public way. Manchin’s vote didn’t surprise many Mountain State voters, but it left a lot of people in other states asking, “Why is he even a Democrat?”</p>\n\n<p>That question came from listeners.</p>\n\n<p>“Red State Blue State” is a collaboration between Us &amp; Them and KCRW in Santa Monica, California. Each week until the midterm election, we’re presenting a new segment co-hosted by Trey Kay in West Virginia and Chery Glaser in Southern California.</p>\r\n      ",
            "length": "11086038",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/dovetail.prxu.org/95/fb341ef6-8000-4754-89b2-f33709ea5695/UsandThem_Extra_RedStateBlueState3_10.12.18_PP_1.mp3",
            "categories": [
                "\r\n        California\r\n      ",
                "\r\n        Joe Manchin\r\n      ",
                "\r\n        Us&Them\r\n      ",
                "\r\n        West Virginia\r\n      ",
                "\r\n        elections\r\n      ",
                "\r\n        midterm\r\n      ",
                "\r\n        politics\r\n      "
            ]
        },
        {
            "title": "Rural Voters: You Can't Ignore Us",
            "datePublished": "Wed, 10 Oct 2018 09:00:00 -0000",
            "description": "\r\n        <p>Why did rural Americans love Donald Trump so much in 2016? Some say they’ve felt left out of the economic recovery. Others say the culture is changing in ways that makes rural people feel uncomfortable. Others say it was simply because Trump made rural people feel like they mattered. Trey talks with three journalists who live in rural places and report on rural issues talks with three journalists who live in rural places and report on rural issues. Trey asks what they're hearing from the people they talk with every day. Trey is joined by <a href=\"https://www.dailyyonder.com/tag/by_tim_marema/\" rel=\"nofollow\" target=\"_blank\">Tim Marema</a>, editor of “The Daily Yonder,” <a href=\"http://www.harvestpublicmedia.org/people/madelyn-beck\" rel=\"nofollow\" target=\"_blank\">Madelyn Beck</a>, a reporter at Harvest Public Media, and <a href=\"http://masonadams.net/\" rel=\"nofollow\" target=\"_blank\">Mason Adams</a>, a freelance writer based in Appalachia.</p>\r\n      ",
            "length": "23862632",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/dovetail.prxu.org/95/6de26ad1-4555-42b1-b586-404efa91b53b/UsandThem_70_YouCantIgnoreUs_10.10.18_PP_1.mp3",
            "epNo": "70",
            "categories": [
                "\r\n        Daily Yonder\r\n      ",
                "\r\n        Harvest Public Media\r\n      ",
                "\r\n        elections\r\n      ",
                "\r\n        midterm\r\n      ",
                "\r\n        politics\r\n      ",
                "\r\n        rural voters\r\n      "
            ]
        },
        {
            "title": "EXTRA: Red State Blue State, Ep.2 -- The future of the Supreme Court",
            "datePublished": "Fri, 05 Oct 2018 22:06:03 -0000",
            "description": "\r\n        <p>There have been times time when the U.S. Supreme Court seemed to be apart from the partisanship that’s infected other government institutions. But President Trump’s choice of Kavanaugh -- and the sexual assault accusations against the him -— have sent Americans on the Left and the Right running to their corners. “Red State” host Trey Kay went to a Trump rally to talk to supporters and “Blue State” host Chery Glaser brings us the voices of fearful protestors.</p>\r\n      ",
            "length": "11031285",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/dovetail.prxu.org/95/0113a472-1499-45e9-8243-a1a48c991e96/UsandThem_Extra_RedStateBlueState2_10.05.18_PP_1.mp3",
            "categories": [
                "\r\n        Brett Kavanaugh\r\n      ",
                "\r\n        Elections\r\n      ",
                "\r\n        KCRB\r\n      ",
                "\r\n        Midterm\r\n      ",
                "\r\n        Politics\r\n      ",
                "\r\n        SCOTUS\r\n      ",
                "\r\n        Supreme Court\r\n      ",
                "\r\n        WVPB\r\n      "
            ]
        },
        {
            "title": "EXTRA: Red State Blue State, Ep.1",
            "datePublished": "Fri, 28 Sep 2018 20:42:39 -0000",
            "description": "\r\n        <p>If you really listen, we sound like two different countries: Red America and Blue America. Then again, most of us aren't listening. As we head into the midterm elections, WVPB and KCRW are teaming up to try to change that. “Red State, Blue State” is a weekly conversation between West Virginians and Californians about the issues that divide us. Trey co-hosts the series. Over the next six weeks, we’ll bring you “Red State Blue State” as an Us &amp; Them extra.</p>\r\n      ",
            "length": "9887748",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/dovetail.prxu.org/95/a17f60e2-5e5e-443b-998a-c2e02e2c8165/UsandThem_Extra_RedStateBlueState_9.28.18_PP_1.mp3",
            "categories": [
                "\r\n        California\r\n      ",
                "\r\n        Us&Them\r\n      ",
                "\r\n        West Virginia\r\n      ",
                "\r\n        elections\r\n      ",
                "\r\n        midterm\r\n      ",
                "\r\n        politics\r\n      "
            ]
        },
        {
            "title": "And Now... on the Radio!",
            "datePublished": "Thu, 27 Sep 2018 19:44:12 -0000",
            "description": "\r\n        <p>We’re excited to announce that West Virginia Public Broadcasting has invited Us &amp; Them to be a regular part of their radio programming. Starting this week, West Virginia audiences are going to hear stories about America’s culture divides  -- many that our devoted podcast listeners have been enjoying since 2015 – but now… On The Radio!!!  Can you tell that we’re excited?</p>\r\n      ",
            "length": "51514351",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/dovetail.prxu.org/95/ea2d308e-848c-4bc2-a28a-bfd52d4ab6c9/UsandThem_69_AndNowonthe_Radio_09.27.18_PP_1.mp3",
            "epNo": "69"
        },
        {
            "title": "‘Us’ Music: a Conversation with Stephan Said",
            "datePublished": "Wed, 12 Sep 2018 22:15:39 -0000",
            "description": "\r\n        <p>The Village Voice and Billboard Magazine have compared Stephan Said to Woody Guthrie because uses his music to bridge divides between people. He's taken his guitar to war zones in Iraq, refugee camps in the Mediterranean and to ravaged Houston after Hurricane Harvey. When he gets to these places, he sits down with local folks to play music and help the healing begin. </p>\r\n      ",
            "length": "26689289",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/dovetail.prxu.org/95/4cd53b85-04b1-4bee-b48f-e0b2872c7bb5/UsandThem_68_UsMusic_9.12.18_PP_1.mp3",
            "epNo": "68",
            "categories": [
                "\r\n        Ballad of Abner Louima\r\n      ",
                "\r\n        Borderless\r\n      ",
                "\r\n        Charlottesville Protest\r\n      ",
                "\r\n        Hurricane Harvey\r\n      ",
                "\r\n        I Believe in America\r\n      ",
                "\r\n        Iraq War\r\n      ",
                "\r\n        Patti Smith\r\n      ",
                "\r\n        Stephan Said\r\n      ",
                "\r\n        Stephan Smith\r\n      ",
                "\r\n        Syrian Refugees\r\n      ",
                "\r\n        We The People\r\n      "
            ]
        },
        {
            "title": "Shack!",
            "datePublished": "Wed, 29 Aug 2018 16:50:06 -0000",
            "description": "\r\n        <p>The start of the football season has once again, seen players standing up, kneeling down or not showing up for the national anthem. Some see this as a question of patriotism, others as an issue of free expression. If it seems football has, perhaps unwillingly, become a platform for civil rights issues, well, keep it mind that didn’t start with Colin Kapernick but with James “Shack” Harris, the first African American to be named in the NFL as a starting quarterback.</p>\r\n      ",
            "length": "99328504",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/dovetail.prxu.org/95/9dac6df7-6faa-46d1-b466-cecca73f8593/UsAndThem_Shack_082818_segment_1.mp3",
            "epNo": "67",
            "categories": [
                "\r\n        African American\r\n      ",
                "\r\n        Colin Kaepernick\r\n      ",
                "\r\n        Donald Trump\r\n      ",
                "\r\n        Grambling University\r\n      ",
                "\r\n        Muhammad Ali\r\n      ",
                "\r\n        NFL\r\n      ",
                "\r\n        Samuel Freedman\r\n      ",
                "\r\n        civil rights\r\n      ",
                "\r\n        football\r\n      ",
                "\r\n        sports\r\n      "
            ]
        },
        {
            "title": "Hillers and Creekers",
            "datePublished": "Wed, 15 Aug 2018 21:56:24 -0000",
            "description": "\r\n        <p>Americans tend to sort themselves into tribes that share similar culture, ideas and values. Trey recalls kids at his West Virginia high school sorting themselves into different camps, and how the way one dressed was often a defining factor, right down to the shoes.</p>\r\n      ",
            "length": "84389908",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/dovetail.prxu.org/95/41382be9-f3d3-4f36-a3df-2e17c8906238/UT_HillerCreeker_PRX_part_1.mp3",
            "epNo": "66",
            "categories": [
                "\r\n        Education\r\n      ",
                "\r\n        Politics\r\n      ",
                "\r\n        Youth\r\n      "
            ]
        },
        {
            "title": "The Church Lady",
            "datePublished": "Wed, 01 Aug 2018 22:09:36 -0000",
            "description": "\r\n        <p>Are America’s schools hostile to religion? There’s been a tussle over this issue since the early 60s, when the Supreme Court ruled that prayer and school-sponsored Bible reading were unconstitutional. Since then, evangelical Christians have claimed that God and religion have all but been driven out of education and secular Americans, concerned about blurring the wall between church and state, have been vigilant over any erosion of that separation. The fact is religion has been a part of America’s classrooms ever since there were public schools. And before the court weighed in, some public schools welcomed preachers and priests and even rabbis into classrooms. They called it Weekday Religious Education. And here’s a surprise… a version of Weekday Religious Education is still going on today.</p>\r\n      ",
            "length": "29655132",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/dovetail.prxu.org/95/4b13fb08-9d76-4f02-8fae-c9477c0ab2a8/UsAndThem_65_TheChurchLady_8.1.18_PP_1.mp3",
            "epNo": "65",
            "categories": [
                "\r\n        church state separation\r\n      ",
                "\r\n        prayer in schools\r\n      ",
                "\r\n        public schools\r\n      "
            ]
        },
        {
            "title": "Gentrification (or that Kumbaya moment)",
            "datePublished": "Wed, 18 Jul 2018 16:35:52 -0000",
            "description": "\r\n        <p>Things have changed in the old neighborhood. There are cool little restaurants and cafes, funky little shops and a vibrant art and music scene. On one side, you have the newcomers— people who came here to open new businesses and live in this trendy neighborhood. On the other side you have the old guard — the people who grew up here, before it was trendy, and have been watching the place they call home rapidly dissolve all around them. For this episode of the Us &amp; Them, we look at the evolution of neighborhoods in Brooklyn, Chicago and New Orleans and learn how all of this change is anything but simple.</p>\r\n      ",
            "length": "36059412",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/dovetail.prxu.org/95/837e205d-49d6-43fb-827f-a2be45b6e223/UsAndThem_64_ThatKumbayaMoment_07.18.2018_PP_1.mp3",
            "epNo": "64",
            "categories": [
                "\r\n        St Roch\r\n      ",
                "\r\n        gentrification\r\n      ",
                "\r\n        housing\r\n      ",
                "\r\n        urban\r\n      ",
                "\r\n        white flight\r\n      "
            ]
        },
        {
            "title": "The Elephant in the Classroom",
            "datePublished": "Wed, 04 Jul 2018 16:24:33 -0000",
            "description": "\r\n        <p>Hey, it’s Independence Day - the official birth of our nation! Watching fireworks on July 4th may be as close as some of us get to expressing a shared love of country with fellow citizens. As you very well know, there is a great deal of polarization in our nation. To work through many of our differences, we have to do more than just stand next to each other on patriotic holidays. In the spirit of celebrating our country’s founding and with the hope of encouraging the bridging of some of our nation’s divides, we’re re-releasing a piece that features a friendship between Vassar College professor, Hua Hsu and one of his more unconventional students, Dave Carrell, an Iraq War veteran.</p>\r\n      ",
            "length": "33219246",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/dovetail.prxu.org/95/f99a4bea-25df-474c-b2a8-a5f44fb99573/UsAndThem_63_ElephantInTheClassroom_7.04.18_PP_1.mp3",
            "epNo": "63",
            "categories": [
                "\r\n        Iraq war\r\n      ",
                "\r\n        Vassar\r\n      ",
                "\r\n        veteran\r\n      "
            ]
        },
        {
            "title": "Housing in Paradise",
            "datePublished": "Thu, 21 Jun 2018 03:15:45 -0000",
            "description": "\r\n        <p>Places like Lake Tahoe, Nantucket and Colorado ski country are playgrounds for the wealthy. To make the playground run smoothly, there’s a dire need for people to cook food, bus tables, clean rooms, mow lawns, manicure golf courses and operate ski lifts. It all works well until those same workers don’t have a place to lay their heads at night. For this episode, Trey speaks with a few journalists across the country, who’ve been reporting about a shortage of affordable living accommodations for workers in affluent vacation communities.</p>\r\n      ",
            "length": "31698436",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/dovetail.prxu.org/95/2ac9b89c-061d-47a4-a176-401a5981a919/UsandThem_62_HousingInParadise_6.20.18_PP_1.mp3",
            "epNo": "62",
            "categories": [
                "\r\n        affordable housing\r\n      ",
                "\r\n        housing crunch\r\n      ",
                "\r\n        nantucket\r\n      ",
                "\r\n        resorts\r\n      ",
                "\r\n        tahoe\r\n      ",
                "\r\n        vacation\r\n      ",
                "\r\n        vail\r\n      "
            ]
        },
        {
            "title": "Revisiting the Grand Palace",
            "datePublished": "Wed, 06 Jun 2018 23:40:29 -0000",
            "description": "\r\n        <p>Trey Kay has observed how things have changed significantly for LGBTQ people where he lives in New York. But he’s not sure if anything’s changed in a more conservative place like West Virginia, where he grew up.  A recent Pew survey shows that more than half of West Virginians believe the Bible is the literal word of God. An even higher percentage of Mountain State residents think homosexuality should be discouraged. Trey went back home to visit some old friends, and to see what it’s like to be gay in Appalachia today.</p>\r\n      ",
            "length": "37779531",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/dovetail.prxu.org/95/52f5f97f-215d-4571-ae69-86049f83634a/UsAndThem_61_RevisitingTheGrandPalace_6.6.18_PP_1.mp3",
            "epNo": "61",
            "categories": [
                "\r\n        Charleston\r\n      ",
                "\r\n        Grand Palace\r\n      ",
                "\r\n        LGBTQ\r\n      ",
                "\r\n        drag queen\r\n      ",
                "\r\n        gay\r\n      ",
                "\r\n        gay marriage\r\n      ",
                "\r\n        homosexuality\r\n      "
            ]
        },
        {
            "title": "Love, the Ayatollah, and Revolution",
            "datePublished": "Wed, 23 May 2018 17:17:45 -0000",
            "description": "\r\n        <p>America and Iran used to be close allies, but since the Iranian Revolution began in 1979, the relationship has been akin to a bad divorce. After President Trump’s announcement to pull the U.S. out of the Iran Nuclear Deal, cable news has been abuzz with political pundits and foreign policy scholars reacting to the latest chapter of the tortured relationship. But there are Iranian and American love stories that have worked out. Trey’s friend Essi Zahedi risked life and limb to flee his country during the Iranian Revolution. His motivation for leaving wasn’t just about politics or religion, or fear for his safety. A major reason was to be with the American woman who captured his heart.</p>\r\n      ",
            "length": "27511331",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/dovetail.prxu.org/95/1b127cca-c29a-45f9-b2be-4f2ce1b2cd3d/UsAndThem_60_LoveAyatollahRevolution_5.23.18_PP_1.mp3",
            "epNo": "60",
            "categories": [
                "\r\n        1979\r\n      ",
                "\r\n        Carter\r\n      ",
                "\r\n        Cold War\r\n      ",
                "\r\n        Iran\r\n      ",
                "\r\n        Iranian Revolution\r\n      ",
                "\r\n        hostages\r\n      ",
                "\r\n        nuclear pact\r\n      "
            ]
        },
        {
            "title": "Touching the Third Rail with Katharine Hayhoe",
            "datePublished": "Wed, 09 May 2018 21:07:42 -0000",
            "description": "\r\n        <p>In today’s culturally polarized society, discussing whether the planet is warming and if humans have an impact on the climate is a topic that’s often avoided. Why? Because speaking about it can be akin to touching the “third rail” of religion and politics. Us &amp; Them’s Trey Kay speaks with a person whose professional and personal lives revolve around the highly charged topic of climate change. Katharine Hayhoe is a respected climate scientist, as well as a devoted evangelical Christian – two descriptions that some Americans don’t think naturally go together.</p>\r\n      ",
            "length": "85386822",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/dovetail.prxu.org/95/3369c105-f614-413f-ae97-a361464b5bfd/UsAndThem_59_TouchingThirdRailWithKatharineHayhoe_05.09.2018_PP_1.mp3",
            "epNo": "59",
            "categories": [
                "\r\n        carbon dioxide\r\n      ",
                "\r\n        climate\r\n      ",
                "\r\n        climate change\r\n      ",
                "\r\n        climate science\r\n      ",
                "\r\n        global warming\r\n      ",
                "\r\n        hoax\r\n      ",
                "\r\n        pollution\r\n      "
            ]
        },
        {
            "title": "Heroin: N'ganga Dimitri",
            "datePublished": "Wed, 25 Apr 2018 17:05:08 -0000",
            "description": "\r\n        <p>As the United States works through what the American Medical Association describes as “the worst drug addiction epidemic in its history,” we revisit the story of Dimitri. This former junkie was delivered from a 27-year heroin addiction by a controversial treatment that seems to work miracles for people addicted to opioids. Since kicking the habit, he’s been an evangelist to other junkies, spreading the good news about the wondrous drug that instantly cured him.</p>\r\n      ",
            "length": "84613237",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/dovetail.prxu.org/95/31d3119a-6fe3-4fbd-acbf-279e21c376f7/UsAndThem_58_NgangaDimitri_4.25.18_PP_1.mp3",
            "epNo": "58",
            "categories": [
                "\r\n        addiction\r\n      ",
                "\r\n        drugs\r\n      ",
                "\r\n        heroin\r\n      ",
                "\r\n        ibogaine\r\n      ",
                "\r\n        recovery\r\n      ",
                "\r\n        war on drugs\r\n      "
            ]
        },
        {
            "title": "Under the Microscope: Put Your Money Where Your Mouth Is",
            "datePublished": "Wed, 11 Apr 2018 21:13:55 -0000",
            "description": "\r\n        <p>Back in 2015, we aired an episode called “Put Your Money Where Your Mouth Is” that didn’t go over so well with a bunch of our listeners. We received messages saying that Trey mishandled a conversation between a physicist who defends climate science and a former public school teacher who’s an evolution skeptic. With the hope of finding a better way around the culture war aspects of science debates, we’re putting that episode (and ourselves) under the microscope.</p>\r\n      ",
            "length": "78355486",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/dovetail.prxu.org/95/a0d41b42-98b6-4872-8677-d12e2c195eef/UsAndThem_57_UnderMicroscopePutYourMoneyWhereYour_4.11.18_PP_1.mp3",
            "epNo": "57",
            "categories": [
                "\r\n        climate science\r\n      ",
                "\r\n        creationism\r\n      ",
                "\r\n        evolution\r\n      ",
                "\r\n        skeptic\r\n      "
            ]
        },
        {
            "title": "EXTRA CUTS: My Friend From Camp",
            "datePublished": "Thu, 05 Apr 2018 22:10:53 -0000",
            "description": "\r\n        <p>As promised, we are posting some additional segments from our last episode, My Friend From Camp that we just couldn’t fit in. If you haven’t heard that episode yet, by all means, head over to your Us and Them feed and have a listen to that one first. These segments will make a whole lot more sense once you’ve heard the full episode.</p>\n\n<p>Former Guantanamo detainee Moazzam Begg about the meaning of the term jihad.</p>\n\n<p>Former Guantanamo MP Albert Melise explains why he wanted to re-enlist and go back to the island.</p>\n\n<p>Andrea Pitzer, journalist and author of <em>One Long Night: A Global History of Concentration Camps</em>, on whether or not she thinks the United States will ever face up to what was done at Guantanamo Bay and black sites around the world.</p>\r\n      ",
            "length": "33707769",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/dovetail.prxu.org/95/519b2651-f2b3-4766-bd82-83841d565567/UsAndThem_56_MyFriendFromCamp_ExtraSegments_4.5.18_PP_1.mp3",
            "epNo": "56"
        },
        {
            "title": "My Friend From Camp",
            "datePublished": "Thu, 29 Mar 2018 15:03:58 -0000",
            "description": "\r\n        <p>Moazzam Begg, a British citizen of Pakistani heritage, and Albert Melise, a former housing police officer in the Boston area, were unlikely to have their life stories intersect and become friends; but then September 11 happened. After the Bush Administration launched the War on Terror, Begg was detained and held at the U.S. Detention Camp at Guantanamo Bay, Cuba. Melise was a Gitmo guard. You can’t get much more Us &amp; Them than that.</p>\r\n      ",
            "length": "131291499",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/dovetail.prxu.org/95/6ac7607b-6eb9-4613-99ea-71d2e874c9a8/UsAndThem_55_MyFriendFromCamp_3.29.18_PP_1.mp3",
            "epNo": "55",
            "categories": [
                "\r\n        9/11\r\n      ",
                "\r\n        Bush\r\n      ",
                "\r\n        Camp Delta\r\n      ",
                "\r\n        Camp Echo\r\n      ",
                "\r\n        Gitmo\r\n      ",
                "\r\n        Guantanamo\r\n      ",
                "\r\n        Moazzam Begg\r\n      ",
                "\r\n        War on Terror\r\n      ",
                "\r\n        abuse\r\n      ",
                "\r\n        detainees\r\n      ",
                "\r\n        torture\r\n      "
            ]
        },
        {
            "title": "A Suburb of Hell",
            "datePublished": "Thu, 15 Mar 2018 22:32:01 -0000",
            "description": "\r\n        <p>For a little more than a century, there’s been at least one concentration camp somewhere on earth. The fact that camps still exist and that humans can justify forcing other humans into such inhumane living conditions is the “us and them” dynamic taken to the most vile extreme. For this episode, Trey interviews journalist Andrea Pitzer, author of <em>One Long Night: A Global History of Concentration Camps</em>. She says that the legacy of camps started in Cuba and continues there to this day.</p>\r\n      ",
            "length": "73285839",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/dovetail.prxu.org/95/2dcbb1bf-9e63-4f84-a9d7-41c5e1013bf5/UsAndThem_54_ASuburbOfHell_3.15.18_PP_1.mp3",
            "epNo": "54",
            "categories": [
                "\r\n        Andrea Pitzer\r\n      ",
                "\r\n        Cuba\r\n      ",
                "\r\n        Gitmo\r\n      ",
                "\r\n        War on Terror\r\n      ",
                "\r\n        concentration camp\r\n      ",
                "\r\n        detainees\r\n      ",
                "\r\n        guantanamo\r\n      ",
                "\r\n        internment\r\n      ",
                "\r\n        torture\r\n      "
            ]
        },
        {
            "title": "The Black Talk",
            "datePublished": "Wed, 28 Feb 2018 19:59:41 -0000",
            "description": "\r\n        <p>How old were you when you first learned that police may think of you as a threat?</p>\n\n<p>You’ve never been told that?</p>\n\n<p>Chances are you’re not African American. In this episode, Trey Kay examines “The Black Talk,” which is the sober conversation that many black families have with their teenage kids – particularly teenage boys – about how they should conduct themselves when stopped by the police.</p>\n\n<p>Spoiler alert: Black parents, like any parent, want their kids to come home alive.</p>\r\n      ",
            "length": "93265834",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/dovetail.prxu.org/95/e5ea3313-465d-4a96-b91b-d2c814b62c15/UsAndThem_53_TheBlackTalk_2.28.18_PP_1.mp3",
            "epNo": "53",
            "categories": [
                "\r\n        African American\r\n      ",
                "\r\n        Jelani Cobb\r\n      ",
                "\r\n        black\r\n      ",
                "\r\n        crime\r\n      ",
                "\r\n        law enforcement\r\n      ",
                "\r\n        police\r\n      ",
                "\r\n        profiling\r\n      ",
                "\r\n        racial profiling\r\n      "
            ]
        },
        {
            "title": "The \"Talk\"",
            "datePublished": "Wed, 14 Feb 2018 17:03:20 -0000",
            "description": "\r\n        <p>Despite all the fuss about sex education in America, students get precious little of it. Jonathan Zimmerman, an education historian, tells Trey how Americans spend more time arguing about what kids should learn about human sexuality in schools than they actually do teaching anything about it.</p>\r\n      ",
            "length": "42164794",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/dovetail.prxu.org/95/8a83612a-23b9-4a80-a939-93faecc2118c/UsAndThem_52_TheTalk_2.14.18_PP_1.mp3",
            "epNo": "52",
            "categories": [
                "\r\n        abstinence\r\n      ",
                "\r\n        birth control\r\n      ",
                "\r\n        condoms\r\n      ",
                "\r\n        schools\r\n      ",
                "\r\n        sex\r\n      ",
                "\r\n        sex education\r\n      ",
                "\r\n        teenage\r\n      "
            ]
        },
        {
            "title": "Trapped on the Turnpike",
            "datePublished": "Thu, 01 Feb 2018 01:27:42 -0000",
            "description": "\r\n        <p>On Friday, January 22nd, 2016, I was in New York City preparing to head to West Virginia. So was a blizzard called Jonas. The blizzard that took the East Coast by storm hadn’t hit by the time I rolled into in Harrisburg, PA.  I was assured by meteorologists that I shouldn’t try driving down I-79 to Charleston, but that I could make it to Pittsburgh without encountering snow. This podcast tracks my experience on the Pennsylvania Turnpike between the Bedford and Somerset exits, and the TWENTY-SEVEN AND A HALF hours I remained there, trapped in snow.</p>\r\n      ",
            "length": "29424193",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/dovetail.prxu.org/95/36b51211-801c-4bef-a256-349c9c5078f0/UsAndThem_51_TrappedOntheTurnpike_1.31.18_PP_1.mp3",
            "epNo": "51",
            "categories": [
                "\r\n        National Guard\r\n      ",
                "\r\n        Pennsylvania Turnpike\r\n      ",
                "\r\n        driving\r\n      ",
                "\r\n        emergency\r\n      ",
                "\r\n        storm\r\n      ",
                "\r\n        stranded\r\n      ",
                "\r\n        winter\r\n      "
            ]
        },
        {
            "title": "Panhandlers: To Give Or Not to Give?",
            "datePublished": "Wed, 17 Jan 2018 23:13:00 -0000",
            "description": "\r\n        <p>What do you do when a panhandler hits you up for some money? Whatever your answer is, what experiences or facts inform your policy for giving or not giving? People have strong opinions on this. With this episode we try to separate the facts, suppositions and ideology.</p>\r\n      ",
            "length": "30049693",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/dovetail.prxu.org/95/d333de46-e41a-4f49-a2b4-039090e367a7/UsAndThem_50_ToGiveOrNotToGive_01.17.18_PP_1.mp3",
            "epNo": "50",
            "categories": [
                "\r\n        begging\r\n      ",
                "\r\n        mendicant\r\n      ",
                "\r\n        panhandling\r\n      ",
                "\r\n        parkersburg\r\n      "
            ]
        },
        {
            "title": "A New Year, A Reprise, Amazing Grace ",
            "datePublished": "Thu, 04 Jan 2018 03:14:28 -0000",
            "description": "\r\n        <p>Everyone knows the song \"Amazing Grace.\" People who don’t<br>\neven consider themselves spiritual or religious find it meaningful. And<br>\nwhile John Newton penned the hymn to connect with Christians, it has<br>\ntranscended religion and become a folk song and an anthem for civil rights.<br>\nBut the origins of the song are just a bit more complicated...</p>\r\n      ",
            "length": "25721233",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/dovetail.prxu.org/95/a6a8b3cc-c1a1-4585-9a00-ab2391fb6fea/UsAndThem_49_AmazingGrace_1.3.18_PP_1.mp3",
            "epNo": "49",
            "categories": [
                "\r\n        Amazing Grace\r\n      ",
                "\r\n        Civil Rights\r\n      ",
                "\r\n        hymn\r\n      ",
                "\r\n        redemption\r\n      ",
                "\r\n        slavery\r\n      "
            ]
        },
        {
            "title": "Feminism Is The Word",
            "datePublished": "Thu, 21 Dec 2017 03:25:20 -0000",
            "description": "\r\n        <p>Merriam-Webster declared that the word for 2017 is 'feminism.' The term was the most-looked-up on their online dictionary, and there were 70% more searches for the word this year than in 2016. Trey feels this couldn’t be more timely because this year, he’s seen women effecting a change in the balance of power in ways that he’s never experienced before. In a way, he sees the whole thing like an earthquake that’s been a long time in coming. He’s trying to wrap his mind around what the New Year might hold for the sexual misconduct “tsunami” the earthquake has unleashed. To try to get a handle on all of this, Trey sits down with his friends Lauren Schiller of the *<a href=\"http://apple.co/1IgClzr\" rel=\"nofollow\" target=\"_blank\">Inflection Point *podcast</a> and Nancy Giles of the <em>CBS Sunday Morning Show</em> and <em><a href=\"https://itunes.apple.com/us/podcast/the-giles-files/id1191095320?mt=2\" rel=\"nofollow\" target=\"_blank\">The Giles Files</a></em><a href=\"https://itunes.apple.com/us/podcast/the-giles-files/id1191095320?mt=2\" rel=\"nofollow\" target=\"_blank\"> </a>podcast.</p>\r\n      ",
            "length": "34457383",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/dovetail.prxu.org/95/59c6f7a5-6f13-4301-9f60-1156dd6eff0c/UsAndThem_48_FeminismIsTheWord_12.20.2017_PP_1.mp3",
            "epNo": "48",
            "categories": [
                "\r\n        feminism\r\n      ",
                "\r\n        feminist\r\n      ",
                "\r\n        inflection point\r\n      ",
                "\r\n        sexual abuse\r\n      ",
                "\r\n        sexual harassment\r\n      ",
                "\r\n        weinstein\r\n      ",
                "\r\n        woman\r\n      ",
                "\r\n        women\r\n      "
            ]
        },
        {
            "title": "His Name's DJ",
            "datePublished": "Thu, 07 Dec 2017 02:40:28 -0000",
            "description": "\r\n        <p>We revisit the story of “Steve,” a young New Hampshire man that we met back in the spring of 2016. In our episode called “The Changing Face of Heroin,” we followed him and his father as he reported for the last visit of a court ordered drug rehab program. As you can imagine, kicking a powerful opioid habit isn’t easy, but in many ways our guy remained committed to the program. Sometimes, it was nearly impossible and during those times the strain on his family and loved ones was immense. For this new episode, we learn how everyone is doing more than 19 months later. </p>\r\n      ",
            "length": "33291868",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/dovetail.prxu.org/95/11396079-8279-4072-82f9-81722e9294f6/UsAndThem_47_HisNameIsDJ_12.6.2017_PP_1.mp3",
            "epNo": "47",
            "categories": [
                "\r\n        New Hampshire\r\n      ",
                "\r\n        fentanyl\r\n      ",
                "\r\n        heroin\r\n      ",
                "\r\n        manchester\r\n      ",
                "\r\n        opioid\r\n      ",
                "\r\n        overdose\r\n      "
            ]
        },
        {
            "title": "Killing James Means",
            "datePublished": "Mon, 20 Nov 2017 20:37:22 -0000",
            "description": "\r\n        <p>On November 21, 2016, William Pulliam, a 62-year-old white man, shot James Means, a 15-year-old African-American boy, after the two had an argument outside of a Dollar General Store in Charleston, WV.  The shooting conjured memories of the death of Trayvon Martin after it was reported that in his confession, Pulliam told police, “The way I look at it, that’s another piece of trash off of the street.” In this episode, Us &amp; Them host Trey Kay works to understand who are Means and Pulliam, but moreover, what can this senseless killing tell us about race relations in small town America in 2017.</p>\r\n      ",
            "length": "24933937",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/dovetail.prxu.org/95/ca3414a0-b9bb-4b8b-8d8a-fdd3053becb9/UsAndThem_46_Killing_James_Means_11_20_2017_PP_1.mp3",
            "epNo": "46",
            "categories": [
                "\r\n        charleston\r\n      ",
                "\r\n        pulliam\r\n      ",
                "\r\n        race\r\n      ",
                "\r\n        shooting\r\n      ",
                "\r\n        wv\r\n      "
            ]
        },
        {
            "title": "The Church Lady",
            "datePublished": "Wed, 08 Nov 2017 15:50:58 -0000",
            "description": "\r\n        <p>Trey speaks with journalist Linda K. Wertheimer, the author of <em>Faith Ed: Teaching About Religion In an Age of Intolerance</em>. In her book, she has a chapter titled “The Church Lady,” where she recounts her experience of her family moving from western New York to a town in Ohio. The Wertheimers were the only Jews in that community. Linda and her brother felt confused and ostracized when a lady came to their classroom each week to lead a class that felt less like social studies and more like Sunday school. Linda recalls all of her classmates singing, “Jesus Loves Me,” but she was the only one who didn’t know the words.</p>\r\n      ",
            "length": "27878791",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/dovetail.prxu.org/95/3525b064-1eac-4938-82a0-09860a1bf536/UsAndThem_45_TheChurchLady_11.06.17_PP_1.mp3",
            "epNo": "45",
            "categories": [
                "\r\n        christianity\r\n      ",
                "\r\n        judaism\r\n      ",
                "\r\n        linda wertheimer\r\n      ",
                "\r\n        religion\r\n      ",
                "\r\n        school\r\n      "
            ]
        },
        {
            "title": "Community and Cops Talking Across the Divide",
            "datePublished": "Wed, 25 Oct 2017 18:51:06 -0000",
            "description": "\r\n        <p>High-profile confrontations between African-Americans and police officers have fueled tensions across the country. West Virginia is NOT a place where people are comfortable talking about these things. But in Trey's hometown of Charleston, some of the key players are now bringing this tension out into the open.</p>\r\n      ",
            "length": "26285434",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/dovetail.prxu.org/95/2e1d6765-2443-4dd0-a0d4-3df6fefee0bd/UsAndThem_44_CommunityCopsTalkingAcrossDivide_10.25.17_PP_1.mp3",
            "epNo": "44",
            "categories": [
                "\r\n        CPD\r\n      ",
                "\r\n        West Virginia\r\n      ",
                "\r\n        black lives matter\r\n      ",
                "\r\n        charleston\r\n      ",
                "\r\n        police\r\n      ",
                "\r\n        race\r\n      "
            ]
        },
        {
            "title": "A Policeman is a Person in Your Neighborhood, In Your Neighborhood, In Your Neigh-bor-hoo-ood!",
            "datePublished": "Thu, 12 Oct 2017 16:12:19 -0000",
            "description": "\r\n        <p>Errol Randle is a cop in Charleston, WV. He thinks police have to do more than arrest bad guys: they should also help fix struggling communities. He champions a program that encourages officers to resettle among Charleston’s high crime neighborhoods. While some residents welcome the boots-on-the-ground, embedded police presence, others are suspicious.</p>\r\n      ",
            "length": "29726935",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/dovetail.prxu.org/95/6dd3e5c3-effc-43b6-8795-a426111ce548/UsAndThem_43_PolicemanPersonInNeighborhood_10.12.17_PP_1.mp3",
            "epNo": "43",
            "categories": [
                "\r\n        community\r\n      ",
                "\r\n        policing\r\n      ",
                "\r\n        urban development\r\n      "
            ]
        },
        {
            "title": "Shack! -  A Civil Rights Story",
            "datePublished": "Wed, 27 Sep 2017 04:00:00 -0000",
            "description": "\r\n        <p>At a time when the President of the United States questions the patriotism of African American football players protesting social injustice, we present the civil rights struggle of another African American who, nearly 50 years ago, broke a color barrier in the NFL -- James “Shack” Harris, the first black player in history of NFL to earn a job as starting quarterback.</p>\r\n      ",
            "length": "38231650",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/dovetail.prxu.org/95/33757e8a-b04f-43c5-8aa7-5cfffb662d3b/UsAndThem_42_Shack_ACivilRightsStory_9.28.2017_PP_1.mp3"
        },
        {
            "title": "Two Tales of Coal",
            "datePublished": "Tue, 12 Sep 2017 04:00:00 -0000",
            "description": "\r\n        <p>Like many from his state, Trey was weaned on the jingle “Coal is West Virginia!”  For this episode, we meet two West Virginians who see the mining industry in completely different ways: one who believes coal is the lifeblood of the state's workers; the other who argues coal is to blame for keeping West Virginians poor.</p>\r\n      ",
            "length": "34554544",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/dovetail.prxu.org/95/bba8f84b-d83a-4e54-a6e2-b77485b8f510/UsAndThem_41_TwoTalesOfCoal_9.11.2017_PP_1.mp3"
        },
        {
            "title": "Hillers & Creekers!",
            "datePublished": "Wed, 23 Aug 2017 13:26:11 -0000",
            "description": "\r\n        <p>Americans tend to sort themselves into tribes that share similar culture, ideas and values. Trey recalls kids at his West Virginia high school sorting themselves into different camps and how one dressed was a defining factor, right down to the shoes.</p>\r\n      ",
            "length": "32786464",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/dovetail.prxu.org/95/ede9857d-ec29-470f-a0fc-9c4f4d9a3f80/UsAndThem_40_HillersAndCreekers_8.23.17_PP-1.mp3"
        },
        {
            "title": "Confederate Reckoning: When Will The Civil War End?",
            "datePublished": "Thu, 17 Aug 2017 02:32:38 -0000",
            "description": "\r\n        <p>The tragedy in Charlottesville, VA makes us wonder if it’s possible to reconcile different versions of history. This episode features two American foreign correspondents of color who’ve sought to answer this quandary. They fly from Kenya to New Orleans to report on the angry protests over the dismantling of Confederate monuments.</p>\r\n      ",
            "length": "50517721",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/dovetail.prxu.org/95/28e5b11c-99d4-4203-b8da-a9cc2158a3c7/UsAndThem_39_ConfederateReckon2017_8.17.2017_PP-1.mp3"
        },
        {
            "title": "Remembering New Math & Common Core",
            "datePublished": "Thu, 03 Aug 2017 15:27:32 -0000",
            "description": "\r\n        <p>When conservatives and liberals fight about school curriculum, the disagreements aren’t just about science and history. Even math has been a battleground in the culture wars. Also, Common Core was a hot button issue during the 2016 Presidential Campaign. Have you heard much about it lately?</p>\r\n      ",
            "length": "31597597",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/dovetail.prxu.org/95/269b2836-9435-4e2d-bb61-8242d7eccd82/UsAndThem_38_RememberingNewMath_8.1.17_PP-1.mp3"
        },
        {
            "title": "Deanna, Tymel & Amarie",
            "datePublished": "Tue, 18 Jul 2017 03:33:18 -0000",
            "description": "\r\n        <p>Deanna McKinney’s been through one of the hardest things a parent can endure. Her teenage son was gunned down on her front porch by a kid looking to join a gang. Now she’s making meaning out of the tragedy by working to ensure a better community for the daughter her son left behind.</p>\r\n      ",
            "length": "26409700",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/dovetail.prxu.org/95/404b7bac-b930-4e49-a2a2-e9c9b8f5ce61/UsAndThem_37_Deanna_Tymel_Amarie_7.14.17_PP-1.mp3"
        },
        {
            "title": "Amazing Grace",
            "datePublished": "Sat, 01 Jul 2017 02:57:17 -0000",
            "description": "\r\n        <p>Everyone knows the song. People who don’t consider themselves spiritual or religious find it meaningful. John Newton penned the hymn to connect with Christians, but it has transcended that and become a folk song and an anthem for civil rights. The origins of the song are complicated -- Newton was a slave trader who did not renounce slavery until long after he wrote it. </p>\r\n      ",
            "length": "24345550",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/dovetail.prxu.org/95/d65ee1e1-c38b-484e-b343-92a279b1b0d3/UsAndThem_36_AmazingGrace_7.1.17_PP-1.mp3"
        },
        {
            "title": "Sodomy, Stonewall & Pride",
            "datePublished": "Mon, 19 Jun 2017 20:43:16 -0000",
            "description": "\r\n        <p>Not that long ago, you could get locked up for being gay. A West Virginia man tells Trey about being sent to a mental institution for violating sodomy laws. While standing in front of the historic Stonewall Inn in NY’s Greenwich Village, gay activist Brendan Fay tells Trey how things have changed over the past five decades for LGBT people in America and around the world.</p>\r\n      ",
            "length": "28576432",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/dovetail.prxu.org/95/c172c4cc-1426-45d1-9ddd-eef83f26f7b8/UsAndThem_35_SodomyStonewallPride_6.19.17_PP-1.mp3"
        },
        {
            "title": "The Elephant in the (Class) Room: How I Survived Iraq and Vassar College",
            "datePublished": "Thu, 01 Jun 2017 02:38:37 -0000",
            "description": "\r\n        <p>After four years of commanding a tank in Iraq, David Carrell, a Republican from Texas, had the opportunity to study at a liberal college in the northeast. He tells Trey what he’s observed about Red and Blue America.</p>\r\n      ",
            "length": "30424159",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/dovetail.prxu.org/95/28bc0cda-0ee6-4398-81d2-c5ceb645e1f6/UsAndThem_34_ElephantInTheClassroom_5.31.17_PP-1.mp3"
        },
        {
            "title": "Gentrification: That Kumbayah Moment",
            "datePublished": "Sat, 20 May 2017 03:27:09 -0000",
            "description": "\r\n        <p>When a neighborhood transforms, newcomers can feel unwelcome, while longtime residents feel threatened. But is there a sweet spot when everyone in the community lives in harmony?</p>\n\n<p> </p>\r\n      ",
            "length": "34869796",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/dovetail.prxu.org/95/a8b12fe5-1aaa-4416-b86d-75a0ff3930d7/UsAndThem_33_GentrifyKumbayaMoment_5.18.17_PP-1.mp3"
        },
        {
            "title": "What I Learned About Empathy from a Textbook",
            "datePublished": "Mon, 24 Apr 2017 22:06:26 -0000",
            "description": "\r\n        <p>Empathy... it's a word we've heard a lot in the past year. But what is it? And do we need it? Trey explains what he learned about empathy from... a textbook!</p>\r\n      ",
            "length": "28458421",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/dovetail.prxu.org/95/51432c62-7719-4757-a84e-77f23736da3c/UsAndThem_32_WhatIlearnedaboutEmpathy_4.23.17_PP-1.mp3"
        },
        {
            "title": "Reasserting Femme Voice",
            "datePublished": "Wed, 05 Apr 2017 02:16:47 -0000",
            "description": "\r\n        <p>North Carolina repealed its notorious bathroom law, but not necessarily for the better. Transsexuals remain outside NC’s equal protection laws—whether in the bathroom or in the workplace. All of this has got me thinking about my friend Anne Kelly.</p>\r\n      ",
            "length": "36863056",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/dovetail.prxu.org/95/ee608db0-92e2-44a8-8b89-f9630cfdb01f/UsAndThem_31_ReassertingFemmeVoice_4.5.17.PP-1.mp3"
        },
        {
            "title": "Love, the Ayatollah & Revolution",
            "datePublished": "Wed, 15 Feb 2017 01:51:43 -0000",
            "description": "\r\n        <p>Essi and Katie fell in love before the backdrop of the Iranian Revolution and growing antipathy between America and Ayatollah Khomeini. Despite many fantastic twists and dangerous turns, their love has triumphed over archenemies' hatred.</p>\r\n      ",
            "length": "26319628",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/dovetail.prxu.org/95/c686e68b-c1bf-49c1-9ea2-9c5b2e4fda4e/UsAndThem_30_LoveAyatollahRevolution_2.14.17_PP-1.mp3"
        },
        {
            "title": "Coming Out of the Closet",
            "datePublished": "Wed, 25 Jan 2017 03:37:45 -0000",
            "description": "\r\n        <p>Where some Trump supporters have been loud and proud, others have remained in the shadows. With the new boss installed, it’s “olly olly in come free!” Trey speaks with Trump voters about their hopes, dreams and expectations.</p>\r\n      ",
            "length": "28442992",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/dovetail.prxu.org/95/61af4022-151b-4cde-9aeb-bdebe0cd0b38/UsAndThem_29_ComingOutCloset_1.23.17_PP-1.mp3"
        },
        {
            "title": "Serious as a Heart Attack",
            "datePublished": "Wed, 14 Dec 2016 13:55:23 -0000",
            "description": "\r\n        <p>An Us and Them conversation turns ugly and Trey loses it. He becomes concerned about with his physical, mental and spiritual health.</p>\r\n      ",
            "length": "37280056",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/dovetail.prxu.org/95/99639a34-2ccc-4383-b58f-91d6cf0a2214/UsAndThem_28_SeriousAsHeartattack_12.14.16_PP-1.mp3"
        },
        {
            "title": "Taking an Ass Whoopin’",
            "datePublished": "Tue, 15 Nov 2016 14:44:07 -0000",
            "description": "\r\n        <p>The 2016 presidential campaign was one of the most brutal in America’s history. Trey was stunned by the outcome and is trying understand what the whole thing means. Are truth and bitter reality the new <em>Us</em>? Have our news sources become <em>Them</em>?</p>\r\n      ",
            "length": "16731837",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/dovetail.prxu.org/95/963ca246-9317-427a-b233-244646257394/UsAndThem_27_TakinAnAssWhoopin_11.16.16_PP.mp3",
            "categories": [
                "\r\n        ADFREE\r\n      "
            ]
        },
        {
            "title": "Hello Mary Lou...",
            "datePublished": "Sat, 21 May 2016 23:30:05 -0000",
            "description": "\r\n        <p>Mary Lou Bruner, who made headlines with her wild accusations about President Obama, is running for Texas State Board of Education. If elected, she’ll be responsible for guiding the nation’s second largest public school system. Could she influence the content of textbooks across the nation?</p>\r\n      ",
            "length": "31506691",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/dovetail.prxu.org/95/a1e9cd5f-f308-44f5-899e-adf89587c0f5/UsAndThem_26_HelloMaryLou_5.21.16_PP-1.mp3"
        },
        {
            "title": "The Changing Face of Heroin",
            "datePublished": "Tue, 26 Apr 2016 17:27:33 -0000",
            "description": "\r\n        <p>Something has shifted in the way our society thinks and talks about heroin addicts these days. Could it be that smack users seem more like ‘us’ and less like ‘them’?</p>\r\n      ",
            "length": "38030656",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/dovetail.prxu.org/95/87d18b9d-0f83-4bf2-b775-38b8e10ff57c/UsandThem_25_ChangingFaceofHeroin_4.27.16_PP-1.mp3"
        },
        {
            "title": "Heroin I - N'ganga Dimitri",
            "datePublished": "Tue, 22 Mar 2016 21:18:31 -0000",
            "description": "\r\n        <p>Dimitri Mugianis has an undying love for drug addicts.  He's a former junkie who's been clean for a decade. Now he feels a calling to help other addicts -- \"my people,\" he calls them -- by using unconventional “shamanistic” treatment methods.</p>\r\n      ",
            "length": "35163781",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/dovetail.prxu.org/95/0eb30135-8464-454c-8d29-4bebd78d16ae/UsAndThem_24_HeroinNgangaDimitri_3.22.16_PP-1.mp3"
        },
        {
            "title": "Femme Voice",
            "datePublished": "Mon, 29 Feb 2016 01:00:59 -0000",
            "description": "\r\n        <p>Anne Kelly always felt like she was born into the wrong body. She began life as a man, but is now transitioning into a woman. She’s got the looking like a woman part down. It’s the sounding like a woman thing that’s harder than she expected.</p>\r\n      ",
            "length": "44409088",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/dovetail.prxu.org/95/c086de14-fb2e-4b73-9324-46c5a84c6b1a/UsAndThem_31_ReassertingFemmeVoice_4.5.17.PP-1.mp3"
        },
        {
            "title": "Shack!",
            "datePublished": "Fri, 05 Feb 2016 17:59:10 -0000",
            "description": "\r\n        <p>In 1969, James “Shack” Harris became the first African American quarterback to break the color line in the NFL.</p>\r\n      ",
            "length": "31713523",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/dovetail.prxu.org/95/4105eb43-2ac1-425e-9593-d62bb92608bb/UsAndThem_22_Shack_2.15.16_PP-1.mp3"
        },
        {
            "title": "Trapped on the Turnpike",
            "datePublished": "Wed, 03 Feb 2016 16:58:31 -0000",
            "description": "\r\n        <p>How 27 hours of being snow-bound on the Pennsylvania Turnpike helps Trey file a report to the Keystone State’s “Office of Lessons Learned.”</p>\r\n      ",
            "length": "27720748",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/dovetail.prxu.org/95/7a67952c-b746-41e9-8d13-7cbab2549d88/UsAndThem_21_TrappedOntheTurnpike_2.3.16_PP-1.mp3"
        },
        {
            "title": "The Refugee Trail with Scott Carrier",
            "datePublished": "Sun, 17 Jan 2016 05:47:39 -0000",
            "description": "\r\n        <p>Veteran journalist – or “cultural anthropologist” – Scott Carrier speaks with people fleeing war-torn Syria, Iraq, Afghanistan and other countries as they seek refuge in Europe.</p>\r\n      ",
            "length": "32119264",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/dovetail.prxu.org/95/689fa9a2-4fd1-46d5-b9f0-ab0ea533de82/UsAndThem_20_RefugeeTrail_1.17.16_PP-1.mp3"
        },
        {
            "title": "War on Christmas…Really?",
            "datePublished": "Mon, 21 Dec 2015 23:03:12 -0000",
            "description": "\r\n        <p>Some feel there’s an attack on this sacred holiday. Others are bothered that this religious holiday has blurred America’s church/state separation. But is this really a war?</p>\r\n      ",
            "length": "32582968",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/dovetail.prxu.org/95/297b3696-8573-4649-8dbb-4bc04d4cd798/UsAndThem_19_WarOnChristmas_12.22.15_PP-1.mp3"
        },
        {
            "title": "Islamophobia",
            "datePublished": "Thu, 10 Dec 2015 01:49:13 -0000",
            "description": "\r\n        <p>With acts of terrorism in Paris and San Bernardino, some Americans are suspicious of Muslim neighbors and immigrants. Warranted fear or paranoia?</p>\r\n      ",
            "length": "25237096",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/dovetail.prxu.org/95/63f10435-8f9d-4f90-87fb-453c73e378bc/UsAndThem_18_Islamophobia_12.29.15_PP-1.mp3"
        },
        {
            "title": "Atheism",
            "datePublished": "Thu, 19 Nov 2015 20:34:40 -0000",
            "description": "\r\n        <p>Would Americans vote for an atheist president? A recent poll says no way. In this episode, a social psychologist tells us why this might be. </p>\r\n      ",
            "length": "19549633",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/dovetail.prxu.org/95/1e11d2a6-a919-4040-984f-e587c66b5cb3/UsAndThem_17_Atheism_11.19.15_PP-1.mp3"
        },
        {
            "title": "Enemies",
            "datePublished": "Fri, 06 Nov 2015 16:13:13 -0000",
            "description": "\r\n        <p>Jesus said, “Love your enemies.\" Today’s politicians ask God to bless America, but in the same breath, they call their political opponents \"enemies.\" Labels help us organize the world along fault lines, but is this the best policy?  In a polarized America, is it possible to love our enemies?</p>\r\n      ",
            "length": "18317398",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/dovetail.prxu.org/95/807e970b-f387-478e-8cc3-0e1546e1d3fe/UsAndThem_16_Enemies_11.6.15_PP-1.mp3"
        },
        {
            "title": "Locked Up For Sodomy",
            "datePublished": "Thu, 15 Oct 2015 16:35:57 -0000",
            "description": "\r\n        <p>Not that long ago, you could get locked up for being gay. A West Virginia man tells Trey about being sent to a mental institution for violating the state’s sodomy laws.</p>\r\n      ",
            "length": "28101886",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/dovetail.prxu.org/95/27825a83-6764-4a69-a3e9-f4e26e40f1c2/UsAndThem_35_SodomyStonewallPride_6.19.17_PP-1.mp3"
        },
        {
            "title": "A Confederate Reckoning",
            "datePublished": "Sat, 03 Oct 2015 21:34:16 -0000",
            "description": "\r\n        <p>Can we reconcile different versions of history? Two American foreign correspondents of color fly from Kenya to Louisiana to report on an unfinished civil war back home.</p>\n\n<p> </p>\r\n      ",
            "length": "50518138",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/dovetail.prxu.org/95/c353bc8f-a7f2-4a79-8358-e275d02f6e8b/UsAndThem_39_ConfederateReckon2017_8.17.2017_PP-1.mp3"
        },
        {
            "title": "Strangers With Cameras In Appalachia",
            "datePublished": "Thu, 17 Sep 2015 11:51:32 -0000",
            "description": "\r\n        <p>A recent photo essay depicting Appalachians has stirred controversy in that region.  Some locals feel violated when outsiders come into their communities snapping photos.  Are these shutterbugs depicting reality or reinforcing stereotypes?</p>\n\n<p> </p>\r\n      ",
            "length": "49487731",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/dovetail.prxu.org/95/0124f631-7fd6-4546-8d94-729798b77e1c/UsAndThem_13_StrangersWithCameras_9.17.15_PP-1.mp3"
        },
        {
            "title": "New Math",
            "datePublished": "Tue, 01 Sep 2015 06:00:00 -0000",
            "description": "\r\n        <p>When conservatives and liberals fight about school curriculum, the disagreements aren't just about science and history. Even math has been a battleground in the culture wars. Trey talks with historian Christopher Phillips.</p>\r\n      ",
            "length": "31597597",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/dovetail.prxu.org/95/e8759819-bf26-4ea0-9c3d-16f99ed84de5/UsAndThem_38_RememberingNewMath_8.1.17_PP-1.mp3"
        },
        {
            "title": "Textbook Watchdogs",
            "datePublished": "Sun, 16 Aug 2015 17:29:34 -0000",
            "description": "\r\n        <p>Lots of American school districts have fierce fights over what kids should learn in school, but nobody fights like Texans. And no citizens have had a bigger impact on what goes into public school textbooks than Mel and Norma Gabler.</p>\r\n      ",
            "length": "28649407",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/dovetail.prxu.org/95/9c5cdb8e-f32c-42f1-b575-7f0ac5108c99/UsAndThem_11_TextbookWatchdogs_8.17.15_PP-1.mp3"
        },
        {
            "title": "The Church Lady",
            "datePublished": "Fri, 31 Jul 2015 16:32:48 -0000",
            "description": "\r\n        <p>The Supreme Court says you can't have organized prayer in public schools. But most Americans don't agree with that call -- and some people are still finding ways to make sure public school children have a chance to hear about God.</p>\r\n      ",
            "length": "28073947",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/dovetail.prxu.org/95/f276dc60-cff2-4b98-8cc3-db24fc3e817c/UsAndThem_10_ChurchLady_8.1.15_PP-1.mp3"
        },
        {
            "title": "Put Your Money Where Your Mouth Is",
            "datePublished": "Wed, 15 Jul 2015 18:00:57 -0000",
            "description": "\r\n        <p>Two men with strong opinions about evolution and climate change are willing to lay their money on the line.</p>\r\n      ",
            "length": "36771316",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/dovetail.prxu.org/95/29ee7adf-7283-41fa-8d42-32b6092bb609/UsAndThem_09_PutYourMoneyWhereYour_7.15.15_PP-1.mp3"
        },
        {
            "title": "In Dixieland, I'll Take My Stand",
            "datePublished": "Fri, 26 Jun 2015 03:08:40 -0000",
            "description": "\r\n        <p>The Condederate flag and the song \"Dixie\" -- two enduring Old South icons that make us wonder if the war ever ended.  </p>\r\n      ",
            "length": "36452728",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/dovetail.prxu.org/95/082fab49-1ccb-4c62-97ad-6858ad90d7e4/UsAndThem_08_InDixielandIllTakeMyStand_6.25.15_PP-1.mp3"
        },
        {
            "title": "Sex Ed for Grown-ups",
            "datePublished": "Mon, 15 Jun 2015 04:52:40 -0000",
            "description": "\r\n        <p>The chair of the University of Minnesota's program for Sexual Health Education tells Trey most sexual health instruction focuses on adolescents and that maybe adults might also need some instruction.</p>\r\n      ",
            "length": "16334563",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/dovetail.prxu.org/95/dbe0a943-5bcb-45af-aedc-27ae70883772/UsAndThem_07_SexEdForGrownups_6.15.15_PP-1.mp3"
        },
        {
            "title": "The Talk",
            "datePublished": "Mon, 01 Jun 2015 05:00:00 -0000",
            "description": "\r\n        <p>Despite all the fuss about sex education in America, students get precious little of it.  Jonathan Zimmerman, an education historian, tells Trey how Americans spend more time arguing about what kids should learn about human sexuality in schools than they actually do teaching anything about it.</p>\n\n<p> </p>\r\n      ",
            "length": "41375413",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/dovetail.prxu.org/95/34452475-d553-4e8b-9ef9-35b985dfd85e/UsAndThem_06_TheTalk_6.1.15_PP-1.mp3"
        },
        {
            "title": "To Give or Not to Give",
            "datePublished": "Fri, 15 May 2015 06:00:00 -0000",
            "description": "\r\n        <p>If you give money to panhandlers, are you helping them or hurting them? And do they really need help? People have strong opinions. We try to separate the facts from the ideology.</p>\r\n      ",
            "length": "29799076",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/dovetail.prxu.org/95/86551491-2aec-4361-bb78-bf83bacc20a3/UsAndThem_05_ToGiveOrNotToGive_5.15.15_PP-1.mp3"
        },
        {
            "title": "Revisiting the Grand Palace",
            "datePublished": "Fri, 01 May 2015 07:00:00 -0000",
            "description": "\r\n        <p>Americans' attitudes toward gay relationships have changed dramatically in a short time. Trey Kay returns to his home state of West Virginia to see how this change is playing out in a state where 53 percent of residents believe the Bible is the literal word of God. </p>\r\n      ",
            "length": "36918934",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/dovetail.prxu.org/95/f3d9ac0a-35dc-4e5f-b72f-e034f2e323da/UsAndThem_03_RevisitingTheGrandPalace_5.1.15_PP-1.mp3"
        },
        {
            "title": "The Great Textbook War",
            "datePublished": "Fri, 01 May 2015 05:04:06 -0000",
            "description": "\r\n        <p>In 1974, Kanawha County West Virginia was an early battleground in the American culture wars. The fight focused on what children should learn in school. This documentary won a Peabody Award and a DuPont Silver Baton in 2009.</p>\r\n      ",
            "length": "55350207",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/dovetail.prxu.org/95/51041b39-cddc-4848-b284-ce10e3ad4496/UsAndThem_02_GreatTextbookWar_5.1.15_PP.mp3",
            "categories": [
                "\r\n        adfree\r\n      "
            ]
        },
        {
            "title": "Marrying Gays When It Wasn't Cool - Rev. Jim Lewis",
            "datePublished": "Fri, 01 May 2015 04:00:00 -0000",
            "description": "\r\n        <p>Decades before same-sex marriage became legal, the Reverend Jim Lewis of Charleston, West Virginia sparked outrage by blessing the unions of gay men and lesbians in his church. </p>\r\n      ",
            "length": "7339746",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/dovetail.prxu.org/95/d102f062-0ab7-41ca-8ead-21e9cfae2959/UsAndThem_4_MarryingGaysWhenWasntCool_5.1.15_PP_1_.mp3",
            "categories": [
                "\r\n        adfree\r\n      "
            ]
        },
        {
            "title": "Trey & Alice",
            "datePublished": "Fri, 01 May 2015 03:35:28 -0000",
            "description": "\r\n        <p>A blue state secular liberal and a red state conservative Christian have an unlikely friendship. And a slug burger.</p>\r\n      ",
            "length": "30659764",
            "sourceUrl": "https://dts.podtrac.com/redirect.mp3/dovetail.prxu.org/95/82288c2c-8392-4d94-9c14-9cb655681e67/UsAndThem_01_TreyAndAlice_5.1.15_PP-1.mp3"
        }
    ]
}